{
  "FacilityID": 1000091223,
  "FacilityName": "Gardner Denver, Inc.",
  "FacilityStr1": "178 Bearcat Road",
  "FacilityStr2": null,
  "FacilityCity": "Aledo",
  "FacilityState": "TX",
  "FacilityZipCode": "76008",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48367",
  "LEPC": "Parker County LEPC",
  "FacilityLatDecDegs": "32.72787",
  "FacilityLongDecDegs": "-97.613258",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": "https://www.gardnerdenver.com",
  "FacilityEmailAddress": "Brett.Walters@gardnerdenver.com",
  "FacilityDUNS": 80972264,
  "ParentCompanyName": "Ingersoll Rand, plc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brett Walters",
  "OperatorStr1": "2600 Sylvania Cross Drive",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76137",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000244336",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-12-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-12-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-12-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000113372,
      "AltID": "Oxygen/propylene spray",
      "FacilityID": 1000091223,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141653,
          "ProcessID": 1000113372,
          "ChemicalID": 129,
          "Quantity": 14989.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000114744,
          "ProcessID": 1000113372,
          "NAICSCode": "332912",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000071293,
              "Process_NAICS_ID": 1000114744,
              "SafetyReviewDate": "2020-11-02 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Compressed Gas Association",
              "FR_Comments": null,
              "HazardReviewDate": "2020-11-02 00:00:00",
              "ChangeCompletionDate": "2020-11-13 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Administrative control limit for each tank fill capacity set to 88% of total capicity.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Remote tank monitoring via cellular antenna",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-11-13 00:00:00",
              "TrainingReviewDate": "2020-11-05 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-11-02 00:00:00",
              "EquipmentInspectionDate": "2020-11-13 00:00:00",
              "EquipmentTested": "Tanks, piping, supports, valves and safety devices",
              "ComplianceAuditDate": "2020-11-02 00:00:00",
              "AuditCompletionDate": "2020-11-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2020-11-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "3.0 PROGRAM 2 PREVENTION PROGRAM\n\nProgram 2 eligibility requirements are necessary for facilities that do not meet the eligibility\n\nrequirements of either Program 1 or Program 3. There are seven elements in the Program 2\n\nprevention program, which is set forth in the 40 CFR Part 68 regulations at Subpart C.\n\n\n\n3.1 Safety Information (? 68.48)\n\nGDI-P&IP shall compile and maintain the up-to-date safety information related to the regulated\n\nsubstances, processes, and equipment.\n\n? Safety Data Sheets (SDS) that meet the requirements of 29 CFR 1910.1200(g) are\n\navailable in Appendix B and will be kept current.\n\n? The maximum fill setting in each tank is limited to 88 percent, controlling the maximum\n\npropylene storage to 3,502 gallons of liquid contained within tanks. Piping associated with\n\nthe supply system contain a negligible amount of gas phase propylene. At 4.28 lbs./gal for\n\npropylene at 20?C the total maximum liquid storage capacity is 14,989 pounds.\n\n? Materials of construction for the propylene system include steel tanks, steel and/or Type\n\nK piping, threaded fittings and/or soldered with 15% solder, valves, regulators and\n\nflashback arrestors. Full details of system construction are included in piping and\n\ninstrumentation diagrams (P&IDs) located in Figures 5A/5B.\n\n? The following design codes and standards were employed in the construction of the\n\npropylene system: NFPA-58, NFPA-30, NFPA-51, OSHA 29 CFR 1910.110 and\n\nCompressed Gas Association.\n\nAppropriate engineering controls are required during Spray operations to ensure adequate\n\nventilation is provided to keep worker exposure below applicable limits for fumes, dusts, gases,\n\nand other by-products. Fumes or gases should not be breathed, short-term overexposure to\n\nfumes may cause dizziness, nausea, and dryness or irritation of the nose, throat, and eyes, or\n\nmay cause other similar discomfort. Use an explosion-proof local exhaust system and general\n\nventilation that is adequate to meet exposure standards. Use of protected explosion proof\n\nequipment and lighting is required in the Spray room.\n\nSuitable work gloves should be worn when handling containers and welding gloves are required\n\nfor welding/heating parts. Care should be taken to keep gloves free of oil and grease, gloves with\n\noil and grease shall not be used for the Spray process.\n\nEye protection must be worn at all times and will consist of safety glasses with side shields or\n\ngoggles when transfilling or breaking transfer connections. During Spray operations a face shield\n\nis required. Safety boots are required onsite, the use of flame resistant anti-static safety clothing\n\nis recommended.\n\nRespiratory protection is required when workplace conditions warrant respirator use. Respiratory\n\nprotection program is required that meets OSHA 29 CFR 1910.134. Use an air-supplied or airpurifying\n\ncartridge if the action level is exceeded and ensure the respirator has the appropriate\n\nprotection factor for the exposure level. If cartridge type respirators are used, the cartridge must\n\nbe appropriate for the chemical exposure present. For emergencies or instances with unknown\n\nexposure levels, use a self-contained breathing apparatus (SCBA).\n\nThe exposure to liquid propylene may cause frostbite, appropriate thermal hazard protection such\n\nas cold insulating gloves are required when transfilling or breaking transfer connections.\n\n\n\n3.2 Hazard Review (? 68.50)\n\nGDI-P&IP shall conduct a review of the hazards associated with the regulated substances,\n\nprocess, and procedures. GDI-P&IP will document the results of the review and ensure that\n\nproblems identified are resolved in a timely manner. The review shall be updated at a minimum\n\nof once every five years. GDI-P&IP shall also conduct additional reviews whenever a major\n\nchange in the process occurs and confirm issues identified in the review are resolved before\n\nstartup of the changed process.\n\nGDI-P&IP use checklists developed by persons knowledgeable about the process and equipment\n\nas a guide to conducting the review, checklists are located in Appendix C. For processes designed\n\nto meet industry standards or Federal or state design rules, the hazard review shall, by inspecting\n\nequipment to determine whether the process is designed, fabricated, and operated in accordance\n\nwith the applicable standards or rules.\n\nThe review shall be updated at a minimum of once every five years. GDI-P&IP shall also conduct\n\nreviews whenever a major change in the process occurs and confirm issues identified in the\n\nreview are resolved before startup of the changed process. Completed hazard review checklist\n\nare located in Appendix E.\n\n\n\n3.3 Operating Procedures (? 68.52)\n\nThese procedures are the guide for informing employees how to work safely every day, giving\n\neveryone a quick source of information that can prevent or mitigate the effects of an accident, and\n\nproviding workers and management with a standard against which to assess performance.\n\nOperating procedures are provided in Appendix D and will be readily accessible to employees\n\nwho operate or maintain the system.\n\nThe operating procedures will be reviewed as often as necessary to assure that they reflect\n\ncurrent operating practice, including changes that result from changes in process chemicals,\n\ntechnology, and equipment, and changes to stationary sources. GDI-P&IP will certify annually\n\nthat these operating procedures are current and accurate (Appendix D).\n\nGDI-P&IP has developed and implemented safe work practices to provide for the control of\n\nhazards during operations such as lockout/tagout; start up; shut down; temporary operations;\n\nemergency shut down; start up following major change or emergency; consequences of deviation;\n\nprocess equipment inspections; and control over entrance into a stationary source by\n\nmaintenance, contractor, or other support personnel. These safe work practices are applied to\n\nemployees and contractor employees.\n\n\n\n3.4 Training (? 68.54)\n\nTraining for employees that are involved with operating the system will be completed as outlined\n\nin Appendix D. The training will be completed by personnel competent with the Spray process\n\nand propylene supply system. In addition, the training will include a review of the operating\n\nprocedures with an emphasis on specific safety and health hazards, emergency operations\n\nincluding shutdown, and safe work practices applicable to the employee's job tasks. Additional\n\nhands on training will be provided to personnel for specialized tasks or when processes change.\n\nFor employees responsible for maintaining the system, training will include operating procedures\n\nassociated with maintenance of the equipment mechanical integrity.\n\nRefresher Training\n\nRefresher training shall be provided at least every year, and more often if necessary, to each\n\nemployee involved in operating the system to assure that employees understand and adhere to\n\nthe operating procedures provided in Appendix D. The content of the refresher training will be\n\nsimilar to the information provided during initial training. Copies of training records are located in\n\nAppendix E.\n\n\n\n3.4.1 Change of Process or Materials Training\n\nTraining will be required for employees involved with operating the system when it is determined\n\nthat a process, procedure, or material has changed that would affect the operation of equipment\n\nor storage.\n\n\n\n3.4.2 Training Documentation\n\nGDI-P&IP shall document that each employee involved in operating or maintaining the system\n\nhas received and understood the training described above. Employee training records are\n\nmaintained in the facility?s training database and will document:\n\n? Date of most recent review/revision of training programs.\n\n? Type of training provided.\n\n? Type of competency test used.\n\nCopies of the most recent training procedures are located in Appendix E.\n\n\n\n3.5 Maintenance (? 68.56)\n\nPreventive maintenance, inspection, and testing of equipment is critical to safe operations.\n\nWaiting for equipment to fail often means waiting for an accident that could harm people and the\n\nenvironment.\n\nGDI-P&IP maintains the integrity of the propylene system by completing maintenance activities\n\nas specified in documents provided by the manufacturer of the components of the system.\n\nSpecifically, the following manufacturer's maintenance programs are used on specific\n\ncomponents of the system:\n\n? Tanks\n\n? Piping\n\n? Supports\n\n? Valves\n\n? Safety devices\n\n? Detection/alarm system\n\n? Supply\n\nThe activities include inspection and testing of pressure vessels, emergency shutdown, controls,\n\npumps, and other equipment associated with operating the system.\n\nInspection and testing procedures have been developed by that follow recognized and generally\n\naccepted good engineering practices. The frequency of inspections and tests of process\n\nequipment will be consistent with applicable manufacturers? recommendations, industry\n\nstandards or codes, good engineering practices and prior operating experience.\n\nEmployees responsible for the on-going integrity of process equipment on the system will be\n\ntrained in an overview of the process. Training will include a review of the hazards associated\n\nwith as well as operating procedures associated with maintaining the equipment integrity.\n\nGDI-P&IP has developed a checklist to document each inspection and test that is required to be\n\ncompleted on the system. The checklist located in Appendix F identifies the following information:\n\n? date of the inspection or test;\n\n? name of the person who performed the inspection or test;\n\n? serial number or other identifier of the equipment on which the inspection or test was\n\nperformed;\n\n? description of the inspection or test performed; and\n\n? results of the inspection or test.\n\nWhen deficiencies are identified during inspections, GDI-P&IP will correct the problem to return\n\nthe system to acceptable parameter limits specified in the process safety information. Corrections\n\nwill occur before further use or in a safe and timely manner, when necessary means are taken to\n\nassure safe operation.\n\nGDI-P&IP has constructed the system and assured that the equipment, as it is fabricated, is\n\nsuitable for the process application. Appropriate checks and inspections are performed to assure\n\nthat equipment is installed properly and consistent with design specifications and the\n\nmanufacturer's instructions. GDI-P&IP assures that the maintenance materials, spare parts and\n\nequipment are suitable for the system by completing the pre-startup safety review.\n\nPre Startup Review\n\nA pre-startup safety review will be completed on the system prior to initial startup or when a\n\nmodification is significant enough to require a change in the process safety information. The prestart-\n\nup safety review will confirm the following information prior to the introduction of system:\n\n? Equipment is constructed in accordance with design specifications;\n\n? Safety, operating, maintenance, and emergency procedures are in place and are\n\nadequate;\n\n? For new stationary sources, a process hazard analysis has been performed and\n\nrecommendations have been resolved or implemented before startup; and\n\n? Training of each employee involved in operating the process has been completed.\n\nOperating procedures have been developed for initial startup and startup following an emergency\n\nshutdown.\n\n\n\n3.6 Compliance Audits (? 68.58)\n\nThe Risk Management program should be reviewed periodically to ensure that employees and\n\ncontractors are implementing the audits properly. A compliance audit is a way to evaluate and\n\nmeasure the effectiveness of your risk management program. In accordance with 40 CFR 68.58,\n\nGDI-P&IP will evaluate compliance with this Plan at least once every three years to verify that the\n\nprocedures and practices developed are adequate and being followed. The compliance audit has\n\nbeen developed to ensure that employees and contractors are implementing the risk management\n\nprogram properly. The audit will be conducted by a person knowledgeable with the covered\n\nprocess. The audit?s findings will be reported on the checklist provided in Appendix G and written\n\nreports of the findings and corresponding corrective actions taken will be maintained for five years.\n\nCompleted checklist are located in Appendix E.\n\n\n\n3.7 Incident Investigation (? 68.60)\n\nIncidents can provide valuable information about site hazards and the steps you need to take to\n\nprevent accidental releases. Often, the immediate cause of an incident is the result of a series of\n\nother problems that need to be addressed to prevent recurrences.\n\nGDI-P&IP will investigate each incident which resulted in, or could have reasonably resulted in, a\n\ncatastrophic release, in accordance with 40 CFR 68.60. An incident investigation will be initiated\n\nas soon as possible, but no later than 48 hours after the incident occurred. GDI-P&IP will quickly\n\naddress and resolve the investigation findings and recommendations, and resolutions and\n\ncorrective actions will be documented and maintained for five years.\n\nAn Incident Report is used by GDI-P&IP to document, address, and resolve the findings of the\n\ninvestigation. The report includes the following information:\n\n? Date of incident;\n\n? Date of investigation;\n\n? Detailed description of the incident;\n\n? List factors that contributed to the incident; and,\n\n? Include recommendations resulting from the investigation.\n\nThe Incident Report also includes fields for documenting resolutions and corrective actions. Upon\n\ncompletion, the report will be reviewed with affected personnel whose job tasks are relevant to\n\nthe incident findings including contract employees, where applicable. Appendix H contains the\n\nEnvironmental & Safety Management Program effective January 01, 2020.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000072081,
                  "PreventionProgram2ID": 1000071293,
                  "ProcessChemicalID": 1000141653
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000091223,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Aledo Fire Department Station 34",
    "CoordinatingAgencyPhone": "8174417284",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091223,
      "SummaryText": "This Risk Management Plan (RMP) is established for Gardner Denver Petroleum & Industrial\n\nPumps (GDI-P&IP) Aledo facility. The RMP is developed in accordance with the United States\n\nEnvironmental Protection Agency's (USEPA) Chemical Accident Prevention regulations 40 CFR\n\nPart 68 with Program 2 requirements for facilities were flammable endpoint for a worst-case\n\nrelease assessment exceeds the distance to public receptors. The purpose of this RMP document\n\nis to assist with the prevention of accidental releases of flammable substances that can cause\n\nharm to the public, facility employees and the environment.\n\nThe GDI-P&IP Aledo facility stores Liquefied Petroleum Gas (propylene, CAS No.115-07-1) for\n\nuse in pump plunger manufacturing operations exceeding Table 3: ?68.130 - List of Regulated\n\nFlammable Substances and Threshold Quantities for Accidental Release Prevention of 10,000\n\npounds. The facility maintains two 1,990-gallon tanks for a total potential capacity of 3,980 gallons\n\n(17,034 pounds). The propylene system is designed, installed, and maintained in accordance with\n\nfederal, state, and local laws.\n\nRisk is defined by the combination of the probability or likelihood that the process will experience\n\nan event and the consequences, impact, or severity of the event. Each process assumes some\n\nelement of risk, however, when risk management techniques are applied to monitor and track\n\nevents with the potential to impact operations, the overall risk can be minimized at the facility.\n\nThis facility complies with National Fire Protection Association (NFPA) requirements for LP-Gas\n\nstorage, and will adhere to applicable federal, state, and local laws. In the event of an emergency,\n\nit is our policy to notify the Fire Department and request assistance in respond to an emergency.\n\nThe worst-case scenario evaluated is failure of the storage tank system when filled to the greatest\n\namount allowed (88% at 20?C), resulting in a vapor cloud explosion. The resulting dista"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091223,
      "SummaryText": "nce to the\n\nendpoint extends offsite, and public receptors are within the distance to the endpoint. The\n\nalternative release scenario analyzed is a break in a 0.25-inch diameter hose, leading to a 240-\n\nminute release inside the Spray Room and subsequent vapor cloud explosion. The resulting\n\ndistance to the endpoint extends offsite, and public receptors are within the distance to the\n\nendpoint.\n\nThe facility has no reported accidents involving propylene that caused deaths, injuries, property\n\nor environmental damage, evacuations, or required sheltering in place orders.\n\nThe system is equipped with safety measures to prevent accidental release and equipment to\n\ndetect a release. In the event of an emergency involving the propylene system, it is policy to notify\n\nthe Fire Department and request assistance responding to the emergency. We will coordinate our\n\nresponse plan with the fire department and have the fire department inspect the propylene system\n\nand conducted joint exercises."
    }
  ]
}