{
  "FacilityID": 1000006239,
  "FacilityName": "City of Deer Park Surface Water Treatment Plant",
  "FacilityStr1": "2117 East \"X\" Street",
  "FacilityStr2": null,
  "FacilityCity": "Deer Park,",
  "FacilityState": "TX",
  "FacilityZipCode": "77536",
  "Facility4DigitZipExt": "0700",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Deer Park Area L",
  "FacilityLatDecDegs": "29.695278",
  "FacilityLongDecDegs": "-95.101111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Deer Park, Texas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Deer Park",
  "OperatorStr1": "2117 East \"X\" Street",
  "OperatorStr2": null,
  "OperatorCity": "Deer Park,",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77536",
  "OperatorZipCodeExt": "0700",
  "RMPContact": "Carl L. Stevens",
  "RMPTitle": "Plant Supervisor",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000108475",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.6908,
  "FRS_Long": -95.1183,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007298,
      "AltID": "22131",
      "FacilityID": 1000006239,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007449,
          "ProcessID": 1000007298,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008245,
          "ProcessID": 1000007298,
          "ChemicalID": 62,
          "Quantity": 7000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508245,
          "ProcessID": 1000007298,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006239,
      "SummaryText": "The City of Deer Park is proud of our safety record in regard to Environmental concerns pertaining to the storage and use of Gas Chlorine. Our number one concern continues to be the safety of our Citizens, workers and the Environment.\n\nOur Risk Management Plan is facilitated through a Direct Chain of Command with each Employee having \nclear and varied responsibilities.\n\nOn site management is delegated to the Plant Supervisor (per job description) who is responsible for all Operations, Maintenance and Training.\n\nEach Employee at the site is responsible (per job description) for operating and inspection of all equipment and material associated with the storage and use of Chlorine Gas in the day to day operation of the Plant.\n\nMaintenance of the system and equipment is accomplished by the Maintenance Technician with assistance from others. all maintenance is accomplished by using Factory Operations and Maintenance Manuals and Factory Parts and Repair Kits in accordance with all applicable Standards and Rules.\nAll Chlorine Storage and Application Equipment was installed by experienced Contractors using Factory Specifications\n\n\nThe Chlorine Storage and Metering System was designed and inspected by Professional Engineers licensed by the State of Texas, using best available technology and methods. All Specifications and Drawings received approval from the appropriate State Agencies (TCEQ, Texas Water Commission,Texas Water Developement Board).\n\n\nSTATIONARY SOURCE\n\nThe stationary source of a possible chemical release is the DEER PARK SURFACE WATER PURIFICATION PLANT located at 2117 East \"X\" Street, Deer Park, Texas 77536.\nThe chemical stored and used above the EPA threshold at this location is Chlorine Gas.\n\nHAZARD ASSESSMENT\n\n\nWorst Case Release Scenario:\n\nThe release of Chlorine Gas at a rate of 15  pounds per minute from a ruptured 150 pound cylinder would affect an area with a radius of 0.4 miles according to Exhibit 4-3, Page 4-7 of the EPA Risk Management Program Guid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006239,
      "SummaryText": "ance for Waste water Plants.\n\nhe release of Chlorine Gas at a rate of 200 pounds per minute from a ruptured One Ton cylinder would affect an area with a radius of 1.3 miles according to Exhibit 4-3, page 4-7 of the EPA Risk Management Program Guide for Wastewater Treatment Plants.\n\nAlternative Release Scenario:\n\nThe release of Chlorine Gas at a rate of 37 pounds per minute from a broken vapor feed line would affect an area with a radius of 0.1 mile according to Exhibit 4-15, page 4-26 of the EPA Risk Management Program Guidance for Wastewater Treatment Plants.\n\n\nHAZARD ASSESSMENT REVIEW\n\nThe Plant Supervisor with the assistance of other Plant Personnel has performed a Hazard Review of the current Risk Management Plan and has updated the offsite impacts.Hazard Review takes into consideration New Construction (population) in the area as well as new Environmental Receptors and their distance in reference to any End Point based upon a circle with the Point of Release at the center. This review used U.S.G.S maps as a data source.\nPopulation within the area of potential impact was calculated using the most recent census as well as on site observation and visual count of homes and businesses in the path of any Plume. All offsite consequences were calculated using the EPA Risk Management Guidance for Wastewater Plants.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThis Facility has not experienced an offsite accident in the past Five Years.\n\nPREVENTION PROGRAM\n\nThe Facility maintains up to date Safety Information in the form of Material Safety Data Sheets (MSDS).\nInventory in the form of Chlorine is maintained at level at or below the intended maximum quantity on hand. The inventory is maintained at safe upper and lower temperatures and pressures.\nThe Plant Supervisor and Maintenance Personnel have conducted a Hazard Review on 02/08/2004 of the Prevention Program. Identified were hazards associated with the Process and Regulated Substance (Chlorine Gas).\nidentified opportunities for Equipme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006239,
      "SummaryText": "nt Malfunctions or Human Error that could cause an accidental release. Identified all safeguards used or required to control hazards or prevent Equipment Malfunctions or Human Error. Identified measures used to Detect or Monitor releases. all results of the Hazard Review are on file and available at the Plant.\n\nPREVENTION PROGRAM    Operating Procedures\n\nThe Deer Park Surface Water Purification Plant has on site written Operating Procedures that provide clear instructions for safely conducting activities associated with the Storage and Usage of Chlorine Gas. The Safety Information is provided by Equipment Manufacturers and Organizations knowledgeable about the Process and Equipment. Sources are Manufacturers Operations and Maintenance Manuals and information provided by the Chlorine Institute through Chemical Vendors.\n\nThe Procedure addresses all aspects of safely carrying out Initial Start up, Normal Operations,Emergency Shut downs, Normal Shutdowns, Start up following a normal or emergency shutdown or a major change that requires a Hazard Review, consequences of deviations, steps to avoid or correct deviations, and equipment inspections.\n\nAll procedures of Operations and Maintenance are carried out by qualified Personnel that have the required knowledge, skills and abilities to safely carry out the duties and responsibilities as provided in the written operating procedures. each Employee has been trained in the Classroom,in the Field and during In House Training Sessions held on a frequent basis. At present, there are no changes or updates on Processes that would require additional Training.\n\nThe Deer Park Surface Water Purification Plant maintains a computerized Preventative Maintenance Program that insures the integrity of the Process Equipment. Each Employee is required to inspect all Chlorination Equipment during their shift to minimize the chance of a malfunction. This responsibility is outlined in each Job Description (Operator, Maintenance Technician). All "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006239,
      "SummaryText": "equipment is maintained per Manufacturer Operation and Maintenance Manual and only Factory parts are utilized in this process.\n\nA Prevention Program Compliance Audit was performed by Supervisory, Maintenance and Operations Personnel. Each of these individuals has intimate knowledge of the Processes involved and a report was generated reflecting this audit. There were no deficiencies noted and this is included in the report. The report is on file at the Deer Park Surface Water Purification Plant. The Facility has on file two audits less than five years old.\n\nEMERGENCY RESPONSE\n\nIn the event of a Chlorine Gas Release, Plant Personnel are notified by means of a Chlorine Gas Detector Alarm. This Alarm is contained within the Plant Operational SCADA System. The System monitors all OperationalParameters throughout the Plant.\n\nNotification of the Release would be relayed to the First Responders, The Deer Park Volunteer Fire Department and Deer Park Police Department by telephone or radio. At the same time, Mitigation efforts would be initiated by the application of the components contained in A or B Chlorine Repair Kits stored on site. In addition, CHEMTREC would be notified by telephone at 800-424-9300. The local CHEMTREC responder is Oxyvynl Corp. which is located approximately two miles North of the Plant site.\nThe Deer Park Volunteer Fire Department through the Emergency Operations Center would develop a Plume Profile and activate the LEPS ONE CALL SYSTEM to notify the Public.\n\nhe City of Deer Park is also a member of the Channel Industries Mutual Aid Organization (CIMA).This organization maintains HAZMAT capabilities and is available for possible Mitigation downstream.\n\nn the event of a Chlorine Gas Release, the Public would be notified to \"SHELTER IN PLACE\" until the situation is controlled.\n\nThe Deer Park Local Emergency Planning Committee (LEPC) has in place systems for rapid notification to local Citizens and Facilities concerning any incident occurring in the are"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000006239,
      "SummaryText": "a. This System provides information concerning incidents that are Visible and/or audible but pose no hazard, and those that could or do create a hazard external to the Plant site.\n\nThe LEPC has adopted the following Level System to clearly indicate the Level of Hazard present in any Incident.\n\nLEVEL 1-  Information only\n\nLEVEL 2- STANDBY ALERT\n\nLEVEL 3- FULL EMERGENCY CONDITION\n\nLEVEL 4- ALL CLEAR\n\nThe Deer Park Communication System consists of the following:\n\n1. Outside Alarm System- Outdoor Alarm Speakers located throughout the City, activated by the Police Dispatcher when a LEVEL 3 release is reported and is activated within fifteen (15) seconds.\n\n2. Telephone Calling System (CAN)- Activated by the Police Dispatcher and can notify all homes within a localized affected area. Activation time is ONE (1) Minute.\n\n3. Schools and Public Buildings Notification System-  Located within the School Administration Building.\nAll School Buildings and all City Buildings. Activation time is ONE (1) Minute.\n\n4. 530 AM Radio Station- Activate within FIVE (5) SECONDS by Police Dispatcher.\n\n5. CAER LINE- Message placed on CAER LINE.\n\n6. Prime Cable Network- Message transmitted on Cable TV. Deer Park EOC can and will interrupt programming and issue messages.\n\nAs the City of Deer Park is located in an area of high concentration of Chemical Plants, Oil Refineries, Etc, The City requires all Citizens to \"SHELTER IN PLACE\" during a Level 3 incident."
    }
  ]
}