{
  "FacilityID": 1000050001,
  "FacilityName": "Tronox Metals Inc.",
  "FacilityStr1": "1501 Titanium Drive",
  "FacilityStr2": null,
  "FacilityCity": "Ottawa",
  "FacilityState": "IL",
  "FacilityZipCode": "61350",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17099",
  "LEPC": "Lasalle County LEPC",
  "FacilityLatDecDegs": "41.352137",
  "FacilityLongDecDegs": "-88.796933",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.tronox.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tronox",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tronox Metals Inc.",
  "OperatorStr1": "1501 Titanium Drive",
  "OperatorStr2": null,
  "OperatorCity": "Ottawa",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61350",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": "ILR000164731",
  "EPAFacilityID": "100000212511",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-07-30 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-07-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-05-18 00:00:00",
  "DeRegistrationEffectiveDate": "2020-05-05 00:00:00",
  "AnniversaryDate": "2020-07-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000062851,
      "AltID": null,
      "FacilityID": 1000050001,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000077635,
          "ProcessID": 1000062851,
          "ChemicalID": 51,
          "Quantity": 250000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000063973,
          "ProcessID": 1000062851,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052223,
              "Process_NAICS_ID": 1000063973,
              "SafetyReviewDate": "2017-07-11 00:00:00",
              "PHA_Date": "2018-09-11 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-10-24 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Containment Areas",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Smoke Detectors; Conductivity sensors, surveillance cameras; process control system",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-10-17 00:00:00",
              "TrainingReviewDate": "2019-01-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Job Cycle Checks",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-20 00:00:00",
              "EquipmentInspectionDate": "2019-02-21 00:00:00",
              "EquipmentTested": "Pressure Transmitter",
              "ChangeMgmtDate": "2019-03-21 00:00:00",
              "ChangeMgmtReviewDate": "2018-11-22 00:00:00",
              "PreStartupReviewDate": "2019-03-19 00:00:00",
              "ComplianceAuditDate": "2017-07-11 00:00:00",
              "AuditCompletionDate": "2019-06-12 00:00:00",
              "IncidentInvestigationDate": "2018-08-30 00:00:00",
              "InvestigationChangeDate": "2018-09-28 00:00:00",
              "ParticipationPlansReviewDate": "2017-08-24 00:00:00",
              "HotWorkPermitReviewDate": "2017-07-20 00:00:00",
              "ContractorSafetyReviewDate": "2017-06-22 00:00:00",
              "ContractorSafetyEvalDate": "2017-05-25 00:00:00",
              "CBI_Flag": 0,
              "Description": "The regulated chemical per 40CFR68 is Titanium Tetrachloride (TiCl4 - CAS#7550-45-0).  On site deliveries will range from 20,000 lbs (Truck Trailers) up to 200,000 lbs (Rail Car).  On site accumulated storage maximum (Rail Car and Main Storage Tank) may reach as much as 250,000 lbs. These quantities far exceed the threshold quantities of 2,500 gals.\n\n\n\nBeyond Storage systems, are transfer piping, vaporizers, superheater and reactor. \n\n\n\nThe process design, operating procedures, and process control plans have been evaluated by a rigorous PHA-HAZOP following AICHe - CCPS guideline.  In addition, Operator/Maintenance personnel have been trained, and an electronic MOC System is in place. ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000064147,
                  "PreventionProgram3ID": 1000052223,
                  "ProcessChemicalID": 1000077635
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050001,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-06-26 00:00:00",
    "ERTrainingDate": "2015-06-16 00:00:00",
    "CoordinatingAgencyName": "LaSalle County Emerg. Man. Agency",
    "CoordinatingAgencyPhone": "8154335622",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050001,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.    Introduction\n\nCristal Metals LLC, Ottawa, Illinois Facility, herein referred to as the \"Facility\" is a titanium metal powder manufacturing plant located in Ottawa, Illinois.  The Facility is one of several throughout the world owned by National Titanium Dioxide Company Ltd.   The Facility takes pride in ensuring that the plant is designed and operated to prevent hazards in our workplace.  Consistent with the company's corporate commitment to Safety, Health, and Environmental excellence, the Facility's written policies provide the foundation for Risk Management Programs and activities at the plant.  In keeping with this commitment, the Facility has established comprehensive Process Safety (PS) programs that strive to identify, control, and eliminate potential release of hazardous chemicals and exposures to employees, community, and the environment.  In addition, this PS program includes accidental release prevention and emergency response plans and procedures. The PS program embodies and employs the spirit and intent of the concepts found in the EPA's Risk Management Plan (RMP) Rule, other applicable regulatory standards, and other rigorous standards and procedures identified as industry best-practice. \n\nThe major chemical that the facility uses to manufacture an inorganic chemical (titanium metal) is liquid Titanium Tetrachloride (TiCl4) and the facility is considered a Basic Inorganic Chemical Manufacturing facility included within NAICS code # 325188.  The inventory quantities of TiCl4 retained on site is in excess of the EPA threshold of 2,500 lbs., and if released, has the potential to impact the local community.  Based upon these criteria, the facility is subject to the requirements of EPA's RMP Program 3.\n\nThe goal of Cristal Metal's PS program is to control potential exposures that include, but are not limited to, personal injury/illness, property damage, fires, impacts to local community and the environment, and process incidents and br"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050001,
      "SummaryText": "eaches of security.  In support of this goal, the plant was designed and constructed in accordance with the most strict industry and code standards (ASME, ASCE, NFPA, NEC, Pipe, Welding Standards, etc).\n\n2.    Cristal Metals Process Safety Management Program\n\nThe Cristal Metals Safety Policy includes the following policy statement:\n\nIt is the Facility's policy to adhere to all applicable federal and state rules and regulations for accidental release prevention and emergency response.  The Facility's policies include that safe procedures be used to handle titanium tetrachloride, that adequate safety devices and systems are designed and constructed into the facility, and that all pertinent personnel be adequately trained in safe procedures.  Although the ultimate responsibility for safety and loss prevention at this location rests with the Site Director, implementation of the PS program is the responsibility of each Cristal Metals employee.  Cristal Metals management is committed to broad and active employee participation in developing and implementing all elements of the PS program, as this participation enhances the overall effectiveness of the program.  Employee participation from all levels is encouraged with the common goal of making the facility a safer place to work.  All employees are expected to perform their work safely and recognize that working safely is a condition of employment. \n\nEmployees are made aware of the safe work responsibilities.  The following quote is an excerpt from the employee handbook:  \"There is no activity or job at the Cristal Metals Ottawa Facility that is so important or urgent that it must be done at the jeopardy of the safety or health of any employee or contractor, the local community, or at the risk of damaging the environment.  An employee has the responsibility to stop any activity or job that they feel may jeopardize the safety or health of any employee or contractor, or that may risk damaging the environment.\"\n\n3.    Titanium Tetra"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050001,
      "SummaryText": "chloride \n\nDescription of the Cristal Metals Facility, Ottawa, Illinois and How Titanium Tetrachloride is handled:\n\nThe Cristal Metals Facility located at 1501 Titanium Drive in Ottawa, Illinois produces pure titanium metal powder and titanium alloy metal powder for shipment to external users. The covered process is the patented \"Armstrong Process (trademarked process),\" for the production of high-purity titanium and titanium alloy powders. The detailed process design and operating procedures for this process are proprietary.  This process handles one chemical included on the EPA regulated list, namely titanium tetrachloride (CAS Number 7550-45-0).  Titanium Tetrachloride (TiCl4) liquid is shipped to Cristal Metals in rail cars and/or truck trailers, and is transferred inside a building via pump from rail car/truck to a main steel storage tank.  The main storage tank resides within a building with a controlled environment.  All transfer pipe used in TiCl4 service is of welded metal construction (except for some pumps and serviceable equipment).  Where bolt-up connections occur, the flanges are wrapped with suitable covers. TiCl4 liquid is pumped from the rail car to the main storage tank, and separate pumps transfer liquid from the main storage tank to a vaporizer where the liquid is converted to a vapor.  The vapor is pressure transferred forward to a reactor area where it is pre-heated and then to the reactor where it is mixed with a reducing agent to produce pure titanium metal powder (Ti).  Similarly, TiCl4 is reacted with a reducing agent and other metal chlorides to produce pure titanium alloy metal powder (Ti-M1-M2).  Once the reaction has occurred, the TiCl4 and other metal chlorides are completely consumed. The powder and intermediates are further processed to remove by-product residuals from the titanium and titanium alloy materials, and prepared for packaging / shipping.  \n\n4.    Worst Case Release Scenario\n\nRMP regulations require performing a consequence a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050001,
      "SummaryText": "nalysis for one worst case release scenario, estimated to present the greatest distance in any direction to a toxic endpoint.  The worst case release scenario (WCS) is presented in this Cristal Metals EPA RMP submission.  The EPA's RMP Guidance for Offsite Consequence Analysis (EPA document 550-B-99-009 - March 2009) was consulted for the preparation of this scenario.\n\nIn the current state of Cristal Metals, the facility anticipates receiving a maximum of one 200,000 lb. railcar.  Per facility standard operating procedure (administrative control measure), railcars that are delivered to the facility will be accepted outside the fence, brought within the Facility gates, and towed inside the TiCl4 Storage and Unloading Building by the Facility-owned track mobile as soon as practically possible after receipt inspection.  This procedure limits the time a railcar spends outside on the tracks after receiving.   TiCl4 railcars will not be stored outside of the TiCl4 building while on Cristal Metals property.  The TiCl4 railcar is unloaded to a TiCl4 storage tank within the TiCl4 Storage and Unloading Building.   The Worst Case scenario for the facility is a ground-level spill of 200,000 lbs. of liquid titanium tetrachloride from a TiCl4 Rail Car inside of the TiCl4 Storage and Unloading Building.  The entire contents of the Rail Car are released by a vessel failure.  Three passive mitigation systems are in place in the TiCl4 Storage and Unloading Building:  a Rail Car Catch Pan surrounding tracks inside the TiCl4 Storage and Unloading Building (444.6 ft2 x 2.5 in deep), a diked containment area surrounding the TiCl4 Storage Tank (972 ft2 x 4 ft deep), and the TiCl4 Storage and Unloading Building itself (5600 ft2).  The Rail Car Catch Pan drains to the diked containment surrounding the TiCl4 Storage Tank.  Liquid Titanium Tetrachloride will pool in the diked containment area and release Hydrochloric Acid vapor to the air.   The Worst-case model was performed using EPA's RMP "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050001,
      "SummaryText": "Comp mode and assumed the following: 100% pure Titanium Tetrachloride, temperature of 105 oF (max. summertime temperature), Urban setting, wind speed 1.5 meters/sec, default Atmospheric Stability class F, and 3 passive mitigation measures:  rail car catch pan (444.6 ft2 x 2.5 in deep), diked containment area (972 ft2 x 4 ft deep), and building (5600 ft2).  RMP Comp allows for crediting one diked area.  For this scenario, the two containment areas were combined to account for total evaporative surface area (1416.6 ft2 x 4 ft deep).  Using the toxic endpoint of titanium tetrachloride of 0.20 mg/L, and assuming that the atmospheric release occurs at ground level, the RMP Comp Model projected an affected distance from the release point to be 0.4 miles, which is beyond the boundaries of the stationary source.  \n\nWithin the TiCl4 Storage and Unloading Building, a number of active mitigation measures are in place for control in the event of a spill.  The building is equipped with smoke sensors, which upon activation will shut down the building's tempered air HVAC system and immediately start the building's fume collection/scrubber system.  The diked containment area within the TiCl4 Storage and Unloading Building is also equipped with a permanent foam suppression system, which can be activated manually by an operator to cover the spill area and suppress fume evolution from the spill.  Operators will be alerted by visual detection as well as observation via surveillance cameras mounted in the building.   Additionally, the Facility has a portable foam suppression system to respond to release outside of the diked containment area, thus reducing the extent of fume migration from a release point. \n\n5.    Alternative Case Release Scenarios\n\nRMP regulations require that at least one alternative release scenario be identified and analyzed for each regulated toxic chemical present. The regulations require that a scenario that is more realistic than the worst case scenario is selected "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050001,
      "SummaryText": "as the alternative release.  A more likely release scenario would occur during TiCl4 unloading activities in the TiCl4 Storage and Unloading Building.  During unloading from a railcar and transfer to the TiCl4 storage tank, a potential loss of containment scenario exists due to a broken or sheared pipe, pump leak, or seal failure.  In this scenario, ~4500 lbs. of liquid TiCl4 would be released near ground level inside the TiCl4 Storage and Unloading Building.  Liquid Titanium Tetrachloride will pool on the building floor and release Hydrochloric Acid vapor to the air.   This Alternative Case model was performed using EPA's RMP Comp mode and assumed the following: 100% pure Titanium Tetrachloride, temperature of 105 oF (max. summertime temperature), Urban setting, wind speed 1.5 meters/sec, default Atmospheric Stability class D, and 2 mitigation measures:  closed building (5600 ft2) and an active mitigation release rate reduction factor of 0.85 by the building's fume collection/scrubber system.  The building is equipped with smoke sensors, which upon activation will shut down the building's tempered air HVAC system and immediately start the building's fume collection/scrubber system.  Because of the active mitigation measures, the alternative case release period is estimated to be a total of 5 minutes.  Using the toxic endpoint of titanium tetrachloride of 0.20 mg/L, and assuming that the atmospheric release occurs at ground level, the RMP Comp Model projected an affected distance from the release point to be <0.1 miles.\n\nIn addition to the aforementioned mitigation devices, the following active mitigation measures are in place in the event of this release:\n\n?    Operators will be alerted by visual detection as well as observation via surveillance cameras mounted in the building and respond to the spill.   \n\n?    The Facility has a portable foam suppression system to respond to release, thus reducing the extent of fume migration from a release point. \n\n?    The facility is eq"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000050001,
      "SummaryText": "uipped with Petroguard which will also absorb and suppress the vapors. \n\nThe detection of a release followed by immediate action by a fume scrubber and area operators are the major contributors to minimizing off-site impacts.\n\n6.    Offsite Impacts to the Community and Environment\n\nA number of industrial and commercial businesses are within the worst-case offsite impact radius zone of 0.4 miles.  There are no residential or environmentally sensitive receptors within this zone.  \n\n7.    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nPrevention of accidental releases of hazardous substances at the Cristal Metals, Inc. Facility involves a unified approach that integrates technologies, procedures, employee participation, and management practices and is dictated by the PS program.  This program complies with all applicable requirements of the EPA Risk Management Program, as stipulated in 40 CFR Part 68.  The program provides layers of protection for preventing releases, of hazardous substances (namely TiCl4).  All personnel at the Facility actively participate in regularly scheduled safety meetings, operating and process hazards reviews, and training.  The Facility strives to prevent any release or incident and operates under a 'Continuous Improvement' philosophy.  \n\n\n\n8.    Five Year Accident History\n\nNo reportable accidents causing offsite impact or employee injury involving TiCl4 have occurred at the Facility in the last 5 years. \n\n9.    Emergency Response Program\n\nThe Cristal Metals, LLC Facility Emergency Response Plan (ERP) is a comprehensive set of documents which lay the foundation for response to emergency situations that the Facility might encounter.  The ERP is tailored to the process hazards, facility location, and emergency response services that are available in the nearby community.  The plan complies with EPA's \"Emergency Response Program\" requirements stipulated in 40 CFR Part 68.  The Emergency Response Program consists of an "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000050001,
      "SummaryText": "ERP, emergency response equipment, employee training and exercises, and written procedures to ensure a high state of operational readiness to responds to emergencies.  The Emergency Response Program is coordinated with local emergency professionals, namely the City of Ottawa Fire Department, the Local Emergency Planning Commission (LEPC), and the Illinois Emergency Management Agency.  The City of Ottawa Fire Department is the primary responder for site emergencies.  No additional onsite firefighting capability (beyond normal safety equipment such as fire extinguishers and dry chemical firefighting agents) is maintained.  The Facility ERP includes specific actions to be taken in response to an accidental release of a regulated substance and procedures for informing the public and local agencies responsible for responding to accidental releases.  If a release should occur, the City of Ottawa Fire department would be contacted.  Immediate first aid response is the responsibility of onsite individuals trained for this purpose.  Upon arrival of the fire department, the fire and rescue personnel assume this responsibility.  \n\nAdditionally, the Ottawa Fire department participates in the Mutual Aid Box Alarm System (MABAS).  In partnership with the Illinois Emergency Management Agency (IEMA), MABAS is a statewide, non-discriminatory mutual aid response system for fire, Emergency Medical Services, and specialized incident operational teams.   Sharing the effort are representatives from the Office of the State Fire Marshal, Department of Public Health, and the EMS Division and Illinois Fire Chiefs Association.  The system defines a resource response plan to any location within the state when the Governor orders a Declaration of Disaster.   \n\n10.    Planned Changes to Improve Safety\n\nThe Facility continually evaluates and implements employee suggestions and recommendations to improve safety.  The facility pursues the identification of safety improvements identified through Proces"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000050001,
      "SummaryText": "s Hazard Analyses, incident investigations, and routine audits of the systems.  Through the \"Continuous Improvement\" philosophy, the Facility strives to minimize risk through process improvement and re-design.\n\n"
    }
  ]
}