{
  "FacilityID": 1000046910,
  "FacilityName": "International Paper, Flint River Mill",
  "FacilityStr1": "2449 Stagecoach Road",
  "FacilityStr2": null,
  "FacilityCity": "Oglethorpe",
  "FacilityState": "GA",
  "FacilityZipCode": "31068",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13193",
  "LEPC": "Macon County LEPC",
  "FacilityLatDecDegs": "32.253889",
  "FacilityLongDecDegs": "-084.068417",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.internationalpaper.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1316561,
  "ParentCompanyName": "International Paper",
  "Company2Name": null,
  "CompanyDUNS": 1316561,
  "Company2DUNS": null,
  "OperatorName": "International Paper-Flint River",
  "OperatorStr1": "P.O. Box 238",
  "OperatorStr2": null,
  "OperatorCity": "Oglethorpe",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31068",
  "OperatorZipCodeExt": null,
  "FTE": 285,
  "OtherEPAFacilityID": "31068BCKYCOLDST",
  "EPAFacilityID": "100000109964",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not available",
  "SafetyInspectionDate": "2016-06-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-06-26 16:15:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-10-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.2531,
  "FRS_Long": -84.0691,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058464,
      "AltID": "ClO2 Generation & Storage",
      "FacilityID": 1000046910,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071428,
          "ProcessID": 1000058464,
          "ChemicalID": 71,
          "Quantity": 29784.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059444,
          "ProcessID": 1000058464,
          "NAICSCode": "32211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000048672,
              "Process_NAICS_ID": 1000059444,
              "SafetyReviewDate": "2016-06-30 00:00:00",
              "PHA_Date": "2016-09-06 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Sewer System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-12-15 00:00:00",
              "TrainingReviewDate": "2016-06-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-06-08 00:00:00",
              "EquipmentInspectionDate": "2016-06-08 00:00:00",
              "EquipmentTested": "Chlorine Dioxide Piping and Valves Inspection",
              "ChangeMgmtDate": "2016-05-16 00:00:00",
              "ChangeMgmtReviewDate": "2016-02-22 00:00:00",
              "PreStartupReviewDate": "2016-05-16 00:00:00",
              "ComplianceAuditDate": "2016-06-06 00:00:00",
              "AuditCompletionDate": "2016-12-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-06-16 00:00:00",
              "HotWorkPermitReviewDate": "2016-06-16 00:00:00",
              "ContractorSafetyReviewDate": "2016-06-08 00:00:00",
              "ContractorSafetyEvalDate": "2016-08-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000059233,
                  "PreventionProgram3ID": 1000048672,
                  "ProcessChemicalID": 1000071428
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046910,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-06-02 00:00:00",
    "ERTrainingDate": "2016-07-28 00:00:00",
    "CoordinatingAgencyName": "Macon County LEPC",
    "CoordinatingAgencyPhone": "4784723575",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CERCLA (40 CFR 302)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046910,
      "SummaryText": "cal recovery), the finishing unit [product formation, drying (roll width and sizing), packaging, and weighing], and the plant maintenance unit.\r\n\r\nRoundwood (logs), purchased wood chips, and wood residuals (bark) are received and processed by the woodyard.  Major woodyard operations include debarking, chipping, and screening for thickness and sizing.  The pulping operation includes chip digesting with chemicals (liquors) and steam, brownstock diffusion washing and screening, and reaction with oxygen to dissolve lignin that holds the cellulose fibers of the wood chips together.  Bleaching of the delignified pulp is accomplished in the bleaching sequence.  The bleached pulp is then formed, dried, cut into small rolls, wrapped, weighed, and then shipped off site.\r\n\r\nThe primary functions of the utilities unit include cogeneration of electricity, generation of compressed air and chilled water for the plant, regeneration of white liquor, recovery of lime, and combustion of non-condensible (TRS laden) gases.  The major emission units in the utilities units are the bark boiler, recovery furnace, smelt dissolving tank, and lime kiln.  The facility also operates a chlorine dioxide generation unit to supply the bleach plant.  Raw river water and well water are treated on site for use in the utilities unit and wastewater generated by the plant is treated prior to underwater effluent pipe discharge to the Flint River.\r\n \r\n\r\nREGULATED SUBSTANCES AND PROCESSES\r\n\r\nThe mill operates one process that exceeds the  threshold quantity of a regulated substance. The process is:\r\n\r\n1)  Chlorine dioxide generation and storage: There are two chlorine dioxide solution tanks at the facility with a maximum capacity of 191,000 gallons each.  The maximum working volume in each tank is administratively controlled to a maximum capacity of 170,000 gallons.  The chlorine dioxide concentration in solution averages 10.5 g/L.  This is equivalent to about 29,784 lbs of chlorine dioxide.\r\n\r\n \r\nThe above"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046910,
      "SummaryText": "e plant to maintain preparedness and to identify areas for improvement.  The emergency response program is updated when necessary, based on modifications made to the plant processes or facilities.  In addition, the plant has an emergency preparedness program that addresses maintenance, inspection and testing  of response equipment as well as instructions and training that govern use of this equipment.\r\n\r\nThe overall emergency response program is coordinated with the Local Emergency Planning Commission (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives. The mill has 24-hour communications with the County Sheriff's office (county communication point of contact) and the LEPC to ensure notification of the public in event of an incident, if necessary, as well as facilitating a quick response."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046910,
      "SummaryText": "process is regulated under RMP Program 3. \r\n\r\n\r\nPREVENTION PROGRAM\r\n\r\nThe mill has developed and implemented an accidental release prevention program to continuously comply with OSHA's 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals and EPA's 40 CFR Part 68 Subpart D, Accidental Release Prevention provisions in the Risk Management Program.  The prevention program thus developed and implemented consists of twelve elements which are listed below.\r\n\r\nA·Process safety information.\r\nA·Process hazard analysis.\r\nA·Operating procedures.\r\nA·Training.\r\nA·Mechanical integrity.\r\nA·Management of change.\r\nA·Pre-startup review.\r\nA·Compliance audits.\r\nA·Incident investigation.\r\nA·Employee participation.\r\nA·Hot work permit.\r\nA·Contractors.\r\n\r\nSome elements of the prevention program are intended to ensure that designs are reviewed so that any new processes and/or equipment are in conformance to safe design principles.  The remainder of the elements ensure that normal operation, maintenance and control of hazards prevent inadvertent changes outside the safe design and operating envelope.\r\n\r\nThe mill's processes and procedures are in line with US EPA's assessment that, Prevention of accidental releases requires a holistic approach that integrates technologies, procedures, and management practices.  Therefore, the mill's prevention program is designed to provide for ongoing management of highly hazardous substances.  It is not a list of once and done actions.  Rather it provides a means for assuring safe operations throughout the life of the facility.  To this end, the mill utilizes modern computer management techniques in coordination with plant-wide awareness to ensure continued fulfillment of prevention requirements.\r\n\r\n\r\nFIVE-YEAR ACCIDENT HISTORY AT International Paper-Flint River Mill\r\n\r\nThe mill has an outstanding record of accident prevention over the past five years.  This good record is demonstrated by the lack of any accidental release which had o"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046910,
      "SummaryText": "CORPORATE COMMITMENT\r\n\r\nThe International Paper-Flint River Mill has a basic commitment to responsible stewardship of the environment, protection of the community, protection of employee health, and assurance of product safety that extends to the processes covered by Risk Management Program (RMP) requirements. The mill has developed management systems in compliance with various applicable regulations to prevent the release of regulated substances especially in locations that may cause detrimental effects to employees, the community, or the environment.  This is accomplished through a systematic evaluation of process design, process technology, operational procedures, maintenance activities, non-routine procedures, emergency preparedness, training, and several other factors.\r\n\r\nThe mill has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes. The mill's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, trained personnel will respond to control and contain the release.\r\n\r\nThe mill plans to meet or surpass all regulatory requirements.  In the attempt to accomplish this goal, the management systems at this facility have been developed in such a way that the hazards are identified, understood, and controlled to prevent accidents.  The RMP regulated chemicals include chlorine dioxide.\r\n\r\n\r\nMILL DESCRIPTION\r\n\r\nThe Flint River Mill produces bleached fluff pulp from cellulose fiber using the Kraft Process.  The plant is organized into five main units encompassing several operational process areas.  The five units include the woodyard unit, the pulping unit (chip digestion, oxygen delignification, and bleaching), the utilities unit (energy and water/power generation and chemi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046910,
      "SummaryText": "ffsite consequences over the past five years and by International Paper-Flint River Mill achievement of OHSA's VPP STAR award.  \r\n\r\nHAZARD ASSESSMENT\r\n\r\nThe hazard assessment evaluates the offsite consequences of accidental releases on public and environmental receptors.  Pubic receptors are offsite residences, institutions (such as schools and hospitals), commercial and office buildings, parks, or recreational areas inhabited or occupied by the public at any time where members of the public could be exposed to toxic concentrations, radiant heat, or overpressure, as a result of an accidental release. Environmental receptors are natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and federal wilderness areas, that could be exposed at any time to toxic concentrations, radiant heat, or overpressure greater than or equal to the endpoints in the risk management program rule, as the result of an accidental release.  For this RMP, the mill has modeled a single worst-case release for the site and an alternative release for each of the two regulated substances chlorine dioxide and chlorine.  Information about these releases are contained in the RMP Data Elements.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe mill maintains a comprehensive written emergency response program to protect plant workers, the general public and the environment.  The program includes plans and procedures for responding to a wide range of events, caused either naturally or accidentally, which have the potential to result in a release of a regulated substance. The mill's emergency response program utilizes the Incident Command System (ICS) which parallels the National Interagency ICS.  This is an all risk system developed for on-scene management of any emergency event.  The functional design of the ICS minimizes the impact of personnel changes upon the emergency plan.  Periodic emergency drills are conducted within th"
    }
  ]
}