{
  "FacilityID": 1000021465,
  "FacilityName": "Pine Tree Propane, LLC",
  "FacilityStr1": "43 Propane Lane",
  "FacilityStr2": null,
  "FacilityCity": "Hermon",
  "FacilityState": "ME",
  "FacilityZipCode": "04401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23019",
  "LEPC": "Penobscot County LEPC",
  "FacilityLatDecDegs": "44.790278",
  "FacilityLongDecDegs": "-068.857222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.rhfoster.com",
  "FacilityEmailAddress": "rtracy@rhfoster.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "R. H. Foster Energy, LLC",
  "Company2Name": "Duke Energy",
  "CompanyDUNS": 40234064,
  "Company2DUNS": 931088900,
  "OperatorName": "R. H. Foster Energy, LLC",
  "OperatorStr1": "P.O. Box 161",
  "OperatorStr2": "110 Mecaw Road",
  "OperatorCity": "Hampden",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04444",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175366",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-10-26 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-04-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-04-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-04-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 44.79094,
  "FRS_Long": -68.85652,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025983,
      "AltID": "Propane Storage",
      "FacilityID": 1000021465,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030891,
          "ProcessID": 1000025983,
          "ChemicalID": 98,
          "Quantity": 814100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000026366,
          "ProcessID": 1000025983,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000022347,
              "Process_NAICS_ID": 1000026366,
              "SafetyReviewDate": "2009-06-10 00:00:00",
              "PHA_Date": "2009-10-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-07-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Two 500 gallon/min monitor nozzles (water cannons. On-site hydrant.On-site fire extinguishers.",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Temperature sensitive cable around large storage tanks that is tied to central fire alarm system and two water cannons (monitor nozzles) automatic activation system.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-04-01 00:00:00",
              "TrainingReviewDate": "2009-06-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-04-04 00:00:00",
              "EquipmentInspectionDate": "2011-03-31 00:00:00",
              "EquipmentTested": "Fire extinguishers; pumps; motors; compressors, and plant piping, valves, fittings and hoses.",
              "ChangeMgmtDate": "2009-06-30 00:00:00",
              "ChangeMgmtReviewDate": "2009-06-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2009-06-10 00:00:00",
              "AuditCompletionDate": "2009-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-10 00:00:00",
              "HotWorkPermitReviewDate": "2009-06-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2009-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000026433,
                  "PreventionProgram3ID": 1000022347,
                  "ProcessChemicalID": 1000030891
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000021465,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-10-31 00:00:00",
    "ERTrainingDate": "2009-07-02 00:00:00",
    "CoordinatingAgencyName": "Hermon Fire Department",
    "CoordinatingAgencyPhone": "2078485986",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021465,
      "SummaryText": "ailcars and transports, and for loading transports and bobtails.  Access to this site is restricted to authorized facility employees, authorized drivers, authorized management personnel and authorized contractors. The regulated substance handled at this facility is propane.  The maximum amount of propane that can be stored at this facility is approximately 800,000 lbs.\n\n3.  The Flammable Worst Case Release Scenario and the Alternative Release Scenario, including Admistrative Controls and Mitigation Measures to Limit the Distance for Each Reported Scenario:\n\nWe have calculated the worst case release scenario based on EPA's RMP Comp (TM) method.  The alternative release scenario analysis is based on EPA's RMP Comp (TM) method.  The following paragraphs provide details of the chosen scenarios.\nThe worst case release scenario submitted for propane involves a catastrophic release from the two 60,000 gallon storage tanks at 80% capacity.  The scenario involves the release of 407,000 lbs. of propane.  The release quantity has been calculated with a wind speed of 1.5 meters/second, stability class: F and an air temperature of 25 degrees C.  The estimated distance to 1 psi overpressure is .60 miles.\n\nThe alternative release scenario involves a release from the rail tower header piping resulting in a vapor cloud fire.  In this scenario 580 lbs. of propane is released in one minute.  This release is also controlled by active mitigation measures that include two monitor fire nozzles (water cannons) rated at 500 gallons/minute, emergency shutdown valves and manual valves.  With a wind speed of 3 meters/second, stability Class: D and an air temperature of 25 degrees C.  The estimated distance to the lower flammability limit is < .10 miles.\n\n4.  The General Accidental Release prevention Program and The Chemical-Specific Prevention Steps:\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021465,
      "SummaryText": "EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1995 Edition and NFPA-70, 1993 Edition. In 2002 a propane cylinder fill plant was constructed in accordance with NFPA-58 Standard, 2001 Edition.\n\nThe following sections briefly describe the release prevention program that is in place at our stationary sources.\n\nSafety Information:\n\nPine Tree Propane, LLC - Hermon Terminal maintains a detailed record of written safety information, which describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.\n\n\n\n\nHazard Review:\n\nA visual inspection methodology is used to carry out hazard reviews at our facility.  The reviews focus on operating procedures, equipment functions, and handling practices to identify possible hazards.  Any finding related to the hazard reviews are addressed in a safe and timely manner.\n\nOperating Procedures:\n\nFor the purposes of conducting safety activities within our covered processes, Pine Tree Propane, LLC - Hermon Terminal maintains written operating procedures.  These procedures address various modes of operation such as emergency shutdown system/startup procedures, pre-operational visual inspection procedures, rail car unloading procedures, transport loading procedures, transport unloading procedures, and bobtail loading procedures.  The information is regularly reviewed and readily accesssible to operators involved with the processes.\n\nTraining:\n\nPine Tree Propane, LLC - Hermon Terminal has a comprehensive training program in place to ensure that employees are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations. All employees must have completed The National Propane Gas Association's Certified Employee Training Program (CETP) in accordance with the State of Maine licensing requirements. OSHA HAZWOPER, DOT HAZ MAT and Fire Extinguisher training for plan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021465,
      "SummaryText": "t operators is regularly scheduled.\n\nMaintenance:\n\nPine Tree Propane, LLC - Hermon Terminal carries out monthly maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with previous training in theses practices.  Any equipment deficiencies identified by the maintenance inspection are corrected in a safe and timely manner.\n\nIncident Investigation:\n\nPine Tree Propane, LLC - Hermon Terminal has Incident Investigation procedures that require the prompt investigation of any incident that has resulted in, or could reasonably result in, a catastrophic release of propane.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\n5.  Five-year Accident History:\n\nPine Tree Propane, LLC - Hermon Terminal has had an excellent record of preventing accidental releases since its inception.  Due to our strigent release prevention policies, there has been no accidental release during this period.\n\n6.  Emergency Response Plan:\n\nPine Tree Propane, LLC - Hermon Terminal has a written emergency response plan to deal with an accidental release of propane.  The plan includes all aspects of emergency respose including evacuations and notification of local emergency response agencies.  \nOur facilitiy's emergency response plan is based upon the NPGA's LP-Gas Handbook/Guidelines for Developing Plant Emergency Response Procedures/How to Control LP-Gas Leaks and Fires.\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted in the implementation of the various elements of our acc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000021465,
      "SummaryText": "idental release prevention program.  Continued operator training, employee CTEP certification, OSHA HAZWOPER, DOT HAZ MAT & Fire Extinguisher training, and operational reveiw are some of the major steps taken to improve safety at our facility.  These changes shall be implemented on an ongoing basis.\n\n8.  Certification Statement:\n\nThe undersigned certifies that to the best of my knowledge, information, belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:  Robert H. Tracy\nSignature:\nTitle: Executive Vice President\nDate Signed:04/08/2011"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021465,
      "SummaryText": "GENERAL EXECUTIVE SUMMARY FOR PROPANE STORAGE DISTRIBUTION FACILITY\nPine Tree Propane, LLC - Hermon, ME\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nThe primary function of Pine Tree Propane, LLC - Hermon, ME is to act as a propane distribution facility.  By virtue of the flammable effect associated with propane, it is necessary to observe certain safety precautions in handling propane to prevent unncessary human exposure, to reduce the threat to our own personal health as well as the health of our co-workers, and to reduce the threat to nearby members of the community.  We are strongly committed to employee, public, and environmental safety.  Safety at our facility depends upon the manner in which we handle propane as well as on the various safety devices incorporated into the design of our equipment.  Furthermore, comprehensive training received by our employees adds to the safety of our distribution facility.\nOur emergency response program is based upon the NPGA's LP-Gas Safety Handbook/Guidelines for Developing Plant Emergency Procedures/How to Control LP-Gas Leaks and Fires.  In addition to the presence of appropriate controls to prevent possible releases of propane, if a release does occur, we are completely coordinated with the Hermon Fire Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release. We share our emergency action plan with local railroad entities, and periodically conduct emergency training with them.\n\n2.  The Stationary Source and The Regulated Substance Handled:\n\nThe primary purpose of this facility is to repackage and distribute propane to wholesale customers for use as a fuel. This facility has a propane filling plant used to inspect, repair, and fill small tanks and cylinders. Propane arrives at our facility via rail car and transports.  The propane is stored in two (2) aboveground 60,000 gallon storage tanks.  This facility has equipment for unloading r"
    }
  ]
}