{
  "FacilityID": 1000069258,
  "FacilityName": "Houston Marine Terminal",
  "FacilityStr1": "2345 Tidal Road",
  "FacilityStr2": null,
  "FacilityCity": "Deer Park",
  "FacilityState": "TX",
  "FacilityZipCode": "77536",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Deer Park Area L",
  "FacilityLatDecDegs": "29.742356",
  "FacilityLongDecDegs": "-95.101640",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Vopak Terminals North America Inc",
  "Company2Name": "Moda Midstream Operating, LLC",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Vopak Moda Houston, LLC",
  "OperatorStr1": "1000 Louisiana St. Suite 7100",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238343",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-04-24 08:33:26",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-24 08:33:26",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-04-24 08:33:26",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-04-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 29.73318,
  "FRS_Long": -95.09632,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086794,
      "AltID": "Refrigerated NH3 Storage",
      "FacilityID": 1000069258,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108261,
          "ProcessID": 1000086794,
          "ChemicalID": 56,
          "Quantity": 70000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000088015,
          "ProcessID": 1000086794,
          "NAICSCode": "49311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000073351,
              "Process_NAICS_ID": 1000088015,
              "SafetyReviewDate": "2018-04-23 00:00:00",
              "PHA_Date": "2018-04-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Double walled tanks",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-04-23 00:00:00",
              "TrainingReviewDate": "2018-04-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer based",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer based testing",
              "MaintenanceReviewDate": "2018-04-23 00:00:00",
              "EquipmentInspectionDate": "2018-04-23 00:00:00",
              "EquipmentTested": "None",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-04-23 00:00:00",
              "PreStartupReviewDate": "2018-04-23 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-04-23 00:00:00",
              "HotWorkPermitReviewDate": "2018-04-23 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2018-04-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000091110,
                  "PreventionProgram3ID": 1000073351,
                  "ProcessChemicalID": 1000108261
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000069258,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-04-23 00:00:00",
    "ERTrainingDate": "2018-04-23 00:00:00",
    "CoordinatingAgencyName": "Harris County-Deer Park Area LEPC",
    "CoordinatingAgencyPhone": "2814791511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069258,
      "SummaryText": "The Vopak Moda Houston (\"VMH\") Houston Terminal is a joint venture between Vopak Terminals North America Inc. and Moda Midstream Operating, LLC.  The Houston Terminal is a liquid storage terminal located at 2345 Tidal Road, Deer Park, Texas 77536.  This executive summary is provided to meet the Risk Management Plan (\"RMP\") regulatory requirements in Title 40 Code of Federal Regulations (\"CFR\") Part 68, specifically 40 CFR 68.155.\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPOPNSE POLICIES\r\nThe VMH Houston Terminal is committed to operating and maintaining our processes in a safe and responsible manner.  The facility uses a combination of emergency response planning programs to help ensure the safety of our workers and the public, as well as the protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed, including:\r\n¿\tA description of our facility and our uses of substances that are regulated by EPA's RMP rule.\r\n¿\tAn overview of our accidental release prevention programs and chemical specific prevention steps.\r\n¿\tA five-year history of accidental releases for chemicals that are regulated by EPA's RMP rule.\r\n¿\tAn overview of our emergency response program.\r\n¿\tAn overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and therefore adversely affecting our employees, the public, and the environment.\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\r\nThe VMH Houston Terminal is a liquid storage terminal that will receive anhydrous ammonia from refrigerated ocean vessels, temporarily store the ammonia in two (2) 15,000-ton refrigerated, double-walled storage tanks, then send the ammonia offsite via underground pipeline to customers.  Anhydrous ammonia receipt and storage is the only covered process at the site regulated under the RMP rule.  Anhydrous ammonia storage in excess of 10,000 pounds has been identified as having the potential to c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069258,
      "SummaryText": "ause significant offsite consequences under the RMP rule in the event of a substantial accidental release.  Anhydrous ammonia storage is also regulated under the Occupational Safety and Health Administration (\"OSHA\") Process Safety Management (\"PSM\") rules as a highly hazardous chemical.  Because the covered process at the site has the potential for a worst-case release to affect a public receptor and anhydrous ammonia is considered a highly hazardous chemical under the OSHA PSM rule, the covered process is regulated under Program Level 3 of the RMP rule.\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\nWe take a systematic, proactive approach to the prevention of accidental releases of hazardous chemicals.  Our management system addresses each key feature of a successful prevention program, including:\r\n¿\tProcess safety information\r\n¿\tProcess hazard analysis\r\n¿\tOperating procedures\r\n¿\tTraining\r\n¿\tMechanical integrity\r\n¿\tManagement of change\r\n¿\tPre-startup review\r\n¿\tCompliance audits\r\n¿\tIncident investigation\r\n¿\tContractors\r\n¿\tEmployee participation\r\n¿\tHot work permits\r\nThese individual elements of our prevention program are utilized to prevent accidental chemical releases.  Our company and employees are committed to the standard that these management systems set for the way we do business.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\r\nProcess safety information is maintained according to the regulated substances using Safety Data Sheets (\"SDS\") and other applicable information.  Data on the technology of the process is maintained, such as flow diagrams, maximum inventory, safe upper and lower limits of temperature, pressure, flow, and composition, including the consequences of deviations.  Design information on the equipment in the process is maintained as required, including, but not limited to construction materials, relief systems, design standar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069258,
      "SummaryText": "ds, energy balances, and safety systems to document compliance with good engineering practices.\r\nThe process hazard analysis is conducted according to the requirements in the RMP rule.  The process hazard analysis is revalidated when any changes in the process warrant and at intervals of no more than five (5) years even when no process changes have occurred.\r\nWritten operating procedures are provided to ensure that the covered processes are operated in a safe and efficient manner.  These procedures also identify any different operating scenarios, operating limits, unique hazards, safety systems, and safe work practices.  Each employee and contractor involved in operating the process is trained in the operating procedures prior to operating the process and provided refresher training at least every three (3) years.\r\nProcess equipment is maintained and inspected according to written procedures developed according to manufacturer recommendations and good engineering practices.  Equipment deficiencies identified during inspection are corrected in a timely manner to ensure safe operation.  Employees and contractors are trained in the process and associated hazards to ensure that their job tasks may be performed in a safe manner.\r\nWritten management of change procedures are maintained and utilized to address impacts on safety and health, operating procedures, timing of changes, authorization requirements, employee and contractor information and training, and process safety information.\r\nPre-startup safety review procedures are addressed for all new or revised processes that involve a change in process safety information.  The pre-startup safety review addresses design specification compliance, safety, operating, maintenance, and emergency procedures, resolution of any process hazard analysis recommendations, and employee training.\r\nCompliance audits to evaluate compliance with the RMP rule requirements are conducted every three (3) years.  The results of the compliance au"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000069258,
      "SummaryText": "dit are documented in a report and follow-up is conducted to determine that identified deficiencies have been corrected.\r\nAn incident investigation program is utilized to investigate each incident which resulted in or could have resulted in a catastrophic release of a regulated substance within 48 hours of the incident.  A report of the investigation is prepared to provide the details of the incident, the results of the investigation, and any recommendations, including review with affected personnel.  Recommendation are addressed and corrective actions are documented.\r\nA written plan is utilized to ensure employees may participate in the development of process hazard analyses and other element of process safety management.  Access to all information prepared under the RMP rule is provided to employees.\r\nWritten hot work permit procedures are utilized to ensure fire prevention and protection requirements are implemented prior to hot work on or near a covered process.\r\nA contractor plan is in place to communicate hazards of the process, emergency response procedures, and control access to covered process areas.  Contractor safety performance and associated training is periodically evaluated to ensure that the contract owner is properly training their personnel and following safety rules.\r\nFIVE-YEAR ACCIDENT HISTORY\r\nThis is a new facility; therefore, there have been no releases of a regulated substance from a covered process in the past five (5) years.  A program will be maintained at the facility to investigate accidents and maintain specific records of any accidents that result in a release of a regulated substance from a covered process that results in on-site deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\r\nEMERGENCY RESPONSE PROGRAM\r\nWe maintain various contingency plans, which address federal, state, and local regulatory requirements for emergency res"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000069258,
      "SummaryText": "ponse planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan.  We are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.  Our accidental release prevention programs and our contingency planning efforts help us to effectively manage the hazards that are presented to our employees, the public, and the environment.\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nThis is a new facility that is designed to operate in a safe manner and employees and contractors are trained to operate the facility safely and use safe work practices.  Potential changes to improve safety may be identified during periodic reviews of operations, safety procedures, and training.  The potential changes identified to improve safety will be evaluated to determine if these changes would reduce hazards and increase safety at the facility.  If it is determined that any of these changes will contribute to improved safety, they may be incorporated into the prevention program for the facility."
    }
  ]
}