{
  "FacilityID": 1000055121,
  "FacilityName": "Walnut Energy Center",
  "FacilityStr1": "600 South Washington Road",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.488056",
  "FacilityLongDecDegs": "-120.896389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.tid.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 46004933,
  "ParentCompanyName": "Walnut Energy Center Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Turlock Irrigation District",
  "OperatorStr1": "600 South Washington Road",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": "981367691",
  "EPAFacilityID": "100000192301",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "N-7172",
  "SafetyInspectionDate": "2015-01-27 00:00:00",
  "SafetyInspectionBy": "Aegis Insurance Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-01-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-01-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-01-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000068930,
      "AltID": "Anhydrous Ammonia for SCR",
      "FacilityID": 1000055121,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084917,
          "ProcessID": 1000068930,
          "ChemicalID": 56,
          "Quantity": 52530.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000070072,
          "ProcessID": 1000068930,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000057575,
              "Process_NAICS_ID": 1000070072,
              "SafetyReviewDate": "2015-04-22 00:00:00",
              "PHA_Date": "2014-08-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-11-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Drought",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Containment Area",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Improved signage",
              "OpProceduresReviewDate": "2015-12-09 00:00:00",
              "TrainingReviewDate": "2015-04-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-12-09 00:00:00",
              "EquipmentInspectionDate": "2015-12-28 00:00:00",
              "EquipmentTested": "ammonia tank and piping",
              "ChangeMgmtDate": "2015-04-01 00:00:00",
              "ChangeMgmtReviewDate": "2015-04-22 00:00:00",
              "PreStartupReviewDate": "2005-11-01 00:00:00",
              "ComplianceAuditDate": "2014-07-24 00:00:00",
              "AuditCompletionDate": "2015-06-30 00:00:00",
              "IncidentInvestigationDate": "2011-04-20 00:00:00",
              "InvestigationChangeDate": "2011-12-01 00:00:00",
              "ParticipationPlansReviewDate": "2015-04-22 00:00:00",
              "HotWorkPermitReviewDate": "2015-04-22 00:00:00",
              "ContractorSafetyReviewDate": "2015-04-22 00:00:00",
              "ContractorSafetyEvalDate": "2016-01-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous ammonia for SCR",
              "_chemicals": [
                {
                  "PrimaryKey": 1000070454,
                  "PreventionProgram3ID": 1000057575,
                  "ProcessChemicalID": 1000084917
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000055121,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Turlock City Fire Department",
    "CoordinatingAgencyPhone": "2096685580",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055121,
      "SummaryText": "ES.1 Introduction\n\n\n\nThe Walnut Energy Center (WEC) is generally located at the western edge of the City of Turlock in Stanislaus County, California, approximately 2.7 miles west of Highway 99, just south of West Main Avenue, off South Washington Road. The WEC stores and uses anhydrous ammonia to reduce nitrogen oxides (NOX), which are created during the combustion of natural gas and exhausted from the two combustion turbine generators (CTGs) and two heat recovery steam generators (HRSGs). Using and storing anhydrous ammonia can be a hazard if it is not handled properly. WEC personnel take their safety obligations very seriously and ensure that operators involved in the use of anhydrous ammonia are trained and knowledgeable in the chemical hazards associated with their jobs. The following Risk Management Plan (RMP) describes what could happen if there were to be an accident, some of the steps taken to ensure a safely operating power plant, and how chemical emergencies are handled. This RMP complies with the U.S. Environmental Protection Agency (EPA) Risk Management Program for Chemical Accidental Release Prevention under Title 40 of the Code of Federal Regulations (CFR), Part 68, and the California Accidental Release Prevention (CalARP) Program under Title 19 of the California Code of Regulations (CCR), Division 2, Chapter 4.5. This RMP, specifically Section 3, also complies with the federal Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard, which was adopted by the California Occupational Safety and Health Administration (CalOSHA) under 8 CCR 5189 in 1992. Attached to this section is a copy of the electronic submittal of the RMP to the EPA.\n\n\n\nES.2 Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe WEC accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices. Applicable"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055121,
      "SummaryText": " federal procedures and state of California procedures are adhered to, including key elements such as training, systems management, and emergency response procedures.\n\n\n\nWEC facility management recognizes the responsibility to make the environment, community, and employee safety a primary part of daily concerns. The WEC is committed to being a responsible member within the community by giving top priority to operating in a safe and environmentally sound manner. The WEC is dedicated to developing an environmentally responsible energy resource compatible with community needs. The prevention of accidents and protection of its employees, property, and the general public are essential to the efficient and successful completion of every project undertaken by the WEC. The WEC requires active injury and illness prevention as an important element of production on a daily basis.\n\n \n\nIt is the policy of the WEC that every WEC employee is entitled to a safe and healthful place in which to work and live. The WEC incorporates the concepts of environmental responsibility and productivity with safety resulting in efficiency and productivity. As part of the WEC's obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and efficiently utilize those resources, the WEC will:\n\n\n\n? Comply fully with laws regulating environmental protection and employee health and safety.\n\n? Furnish work places free of recognized hazards likely to cause injury to employees, the public,\n\n  or the environment.\n\n? Train employees in safe and environmentally conscious practices and require compliance with\n\n  environmental, health, and safety regulations, policies, and procedures.\n\n? Provide a professional staff to maintain and support environmental, health, and safety programs.\n\n\n\nES.3 General Facility and Regulated Substances Information\n\n\n\nThe WEC is a nominal 250-megawatt (MW), natural-gas-fired, combined-cycle generating facility consisting of two na"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055121,
      "SummaryText": "tural-gas-fired CTGs and one condensing steam turbine generator (STG). The WEC is owned by the Walnut Energy Center Authority and is operated by the Turlock Irrigation District (TID). The WEC is a high efficiency, combined-cycle facility that has been integrated into TID's plans to meet its growing native load, and provide other ancillary services and benefits to TID and its ratepayers.\n\n\n\nThe generating facility consists of two CTGs equipped with dry, low NOX combustors; two HRSGs; one condensing STG; a deaerating surface condenser; a 5-cell mechanical-draft cooling tower; and associated support equipment providing a total nominal generating capacity of 250 MW (at average annual ambient conditions). The CTGs are General Electric Frame 7EA units.\n\n\n\nThe WEC stores anhydrous ammonia in a 12,000-gallon storage tank, which contains a mixture of liquid and vaporized ammonia under pressure. The maximum quantity of anhydrous ammonia stored at a given time is 52,530 pounds. This quantity exceeds the Risk Management Program threshold quantity (10,000 pounds), CalARP Program threshold quantity (500 pounds), and PSM threshold quantity (10,000 pounds); therefore, the WEC's anhydrous ammonia system is subject to the Risk Management Program, CalARP Program, and PSM regulations. The anhydrous ammonia system at WEC qualifies for Program 3.\n\n\n\nAnhydrous ammonia is used at the WEC in a Selective Catalytic Reduction (SCR) system to reduce emissions of NOX from the combustion of natural gas. Ammonia vapor is drawn from the top of the storage tank, diluted with air at the ammonia injection skids, and injected into a distribution grid inside the CTG exhaust duct, upstream of the SCR unit. The SCR unit consists of a catalyst bed, which allows the ammonia vapor and NOX to combine and form nitrogen and steam or water vapor, thereby reducing NOX emissions. This RMP addresses the anhydrous ammonia system at the WEC and satisfies the requirements of 40 CFR 68 and CCR Title 19, Division 2, Cha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000055121,
      "SummaryText": "pter 4.5.\n\n \n\nES.4 Summary of the Five-Year Accident History\n\n\n\nIn the past five years, the WEC has had no accidents involving anhydrous ammonia that have resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nES.5 Summary of the Emergency Response Program\n\n\n\nThe WEC has developed an Emergency Action Plan, which establishes emergency response procedures designed to protect personnel, limit damage to the environment, and ensure that proper notifications go to the appropriate government agencies. The Emergency Action Plan details the response procedures, protective measures, levels of training, regulatory notification requirements, and post-incident investigation procedures. The Emergency Action Plan also identifies emergency assembly areas, evacuation routes, and related procedures to be undertaken during emergency scenarios.\n\n\n\nIn the event of an anhydrous ammonia release, the highest ranking operations person must be notified immediately. If the release is incidental, trained WEC personnel will perform the tasks necessary to accomplish containment and mitigation of the release. If the release is uncontrollable, the Control Room Operator will notify the Fire Department. The Fire Department will handle spill/release response and mitigation.\n\n\n\nAlthough not a requirement of Risk Management Program regulations, it is recommended that Emergency Action Plan drills be performed at least annually. Emergency response agencies should be contacted and encouraged to participate in the drills. The Emergency Action Plan will be reviewed annually.\n\n\n\nES.6 Summary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe prevention program for the anhydrous ammonia system is briefly summarized below.\n\n\n\nProcess Safety Information\n\n\n\nThe WEC compiled and maintains up-to-date safety information related to the regulated subst"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000055121,
      "SummaryText": "ances, processes, and equipment. This information is used to identify and understand the hazards in operating the anhydrous ammonia system. The safety information includes safety data sheets (SDSs), a process description, maximum intended inventory, safe operating limits, equipment specifications, and codes and standards used to design, build, and operate the system.\n\n\n\nProcess Hazard Analysis\n\n\n\nThe WEC conducts process hazard analyses (PHAs) to improve safety and reduce the consequences of accidental releases of anhydrous ammonia. A PHA identifies the process hazards, opportunities for equipment malfunctions or human errors, safeguards used to control hazards, and steps used to detect or monitor releases. Each PHA will be revalidated or updated at least once every five years.\n\n\n\nOperating Procedures\n\n\n\nThe WEC maintains up-to-date, accurate, and written operating procedures that provide clear instructions for the anhydrous ammonia system. Operating procedures are required for all stages of system operation including initial startup, normal operations, temporary operations, emergency operations, normal shutdown, and startup following emergency shutdown.\n\n\n\nTraining\n\n\n\nWEC employees presently involved in operating or maintaining the anhydrous ammonia system at the WEC must be trained in an overview of the process and applicable operating and maintenance procedures. The WEC developed and maintains the written employee training program and associated training materials and training records. The training program includes initial training, refresher training, and documentation. Refresher training is conducted at least every three years.\n\n\n\nContractors\n\n\n\nThe WEC has procedures and policies in place that ensure that only contractors with good health and safety programs are selected to perform work on and around the anhydrous ammonia system and that the contractors are properly prepared to safely complete the work. These procedures apply to vendor's drivers delivering acu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000055121,
      "SummaryText": "tely hazardous materials, such as anhydrous ammonia, to the plant. The contractor safety requirements do not apply to contractors providing incidental services that do not influence process safety, such as janitorial work, food and drink services, laundry, delivery, or other supply services. The WEC holds contractor safety briefings before allowing the contractor to perform work on or adjacent to the anhydrous ammonia system. These safety briefings inform contractors of the hazards, access limitations, safe work practices, and emergency response procedures associated with the anhydrous ammonia system.\n\n\n\nPre-Startup Safety Review\n\n\n\nThe WEC has procedures in place to ensure that a pre-startup safety review is conducted prior to starting a new covered process or prior to making modifications to the anhydrous ammonia system that require implementation of the management of change (MOC) procedures. These procedures ensure that no new or significantly modified process will startup and no regulated substances will be introduced into such a process prior to the pre-startup safety review.\n\n\n\nMechanical Integrity\n\n\n\nThe WEC implements the mechanical integrity program to ensure the continued integrity of the equipment in the anhydrous ammonia system. An effective mechanical integrity program addresses equipment testing and inspection, preventive maintenance schedules, and personnel training. Preventive maintenance records are maintained on file electronically for review as needed.\n\n\n\nHot Work Permits\n\n\n\nThe WEC requires employees and contractors to employ safe work practices when performing hot work in, on, or around the covered process. The WEC uses a permitting program to ensure hot work is conducted safely on or near a process involving anhydrous ammonia.\n\n\n\nManagement of Change\n\n\n\nThe WEC provides a system and approach to maintain and implement any MOC or modifications to equipment, procedures, chemicals, and processing conditions. This system allows TID staff to identify"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000055121,
      "SummaryText": " and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\n\n\n\nCompliance Audits\n\n\n\nCompliance audits are completed and documented for the covered process at least once every three years. Compliance audits for the anhydrous ammonia system are performed by a team that includes at least one person knowledgeable in the anhydrous ammonia system and an audit leader knowledgeable in the Risk Management Program, CalARP Program, and PSM requirements and audit techniques. The compliance audit consists of separating the PSM program into its elements or sections, and auditing each element to determine compliance and effectiveness.\n\n\n\nIncident Investigation\n\n\n\nFollowing an incident that resulted in or could reasonably have resulted in a catastrophic release of anhydrous ammonia, WEC staff will initiate incident investigation procedures and ensure that any resulting corrective actions are addressed and documented. The investigation will begin as soon as possible, but no later than 48 hours after the incident.\n\n\n\nES.7 Planned Changes to Improve Safety\n\n\n\nA number of studies and inspections have been conducted to improve the safety of the anhydrous ammonia system at the WEC, including the initial PHA conducted on January 26, 2005, and the PHA revalidations conducted on April 15, 2011 and August 1, 2014. During these studies and inspections, several additional risk reduction measures were recommended to improve safety at the WEC. Details of the recommendations from each PHA can be found in Section 6 of the RMP. Some of the recommended risk reduction measures from the most recent PHA revalidation include posting additional signage near the anhydrous ammonia storage tank and evaluating the potential installation of additional safety equipment. The implementation of these recommendations will further improve the safety of the anhydrous ammon"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000055121,
      "SummaryText": "ia system."
    }
  ]
}