{
  "FacilityID": 1000045643,
  "FacilityName": "Carmel Area Wastewater District treatment facility",
  "FacilityStr1": "26900 State Route 1",
  "FacilityStr2": null,
  "FacilityCity": "Carmel",
  "FacilityState": "CA",
  "FacilityZipCode": "93923",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Office of Emergency Services",
  "FacilityLatDecDegs": "36.539722",
  "FacilityLongDecDegs": "-121.918889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.cawd.org",
  "FacilityEmailAddress": "downstream@cawd.org",
  "FacilityDUNS": 6294912,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Barbara Buikema",
  "OperatorStr1": "P.O. Box 221428",
  "OperatorStr2": null,
  "OperatorCity": "Carmel",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93922",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joseph F. Gregory",
  "RMPTitle": "Compliance Officer",
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151382",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "4034",
  "SafetyInspectionDate": "2012-06-20 00:00:00",
  "SafetyInspectionBy": "California Sanitation Risk Management Authority",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-07-03 00:00:00",
  "DeRegistrationEffectiveDate": "2018-06-28 00:00:00",
  "AnniversaryDate": "2019-07-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 36.53972,
  "FRS_Long": -121.91778,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056675,
      "AltID": "Chlorination",
      "FacilityID": 1000045643,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057619,
          "ProcessID": 1000056675,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000069254,
          "ProcessID": 1000056675,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000569254,
          "ProcessID": 1000056675,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045643,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis Risk Management Plan has been developed, adopted, and implemented at the Carmel Area Wastewater Treatment Facility pursuant to requirements set forth in the California Code of Regulations, Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention Program, article 3, Risk Management Plan.\n\n\n\nA. Regulated Substance\n\nThe Monterey County Department of Environmental Health has evaluated the Carmel Area Wastewater District's Wastewater Treatment Facility for the risk that it poses to the surrounding community from an accidental release of the acutely hazardous material - Chlorine Gas. The CAWD facility was ranked relative to all other facilities in Monterey County, which handle acutely hazardous materials pursuant to the requirements of California Health and Safety Code section 25534 (b). Based upon the evaluation, the CAWD facility was ranked #14 out of 137 facilities (#1 being the highest risk).\n\n\n\nB. History\n\nThis document was originally prepared in 1992 to meet the requirements of the Risk Management Prevention Program, using the Hazard and Operability Study (HAZOP) methodology and an Offsite Consequence Analysis. The document was reviewed and modified to accommodate Process Safety Management (PSM) requirements in 1997. Plant safety regulations with regard to process management was not significantly changed to accommodate the new law, as CAWD already had in place the highest level of safety management possible with existing infrastructure. There are no practical additional steps that could be taken to protect employees that were not already being taken to protect the surrounding community.\n\n\n\nC. Responsible Party\n\nThe Carmel Area Wastewater District's Plant Superintendent (James J. Pinkevich) and the Safety and Regulatory Compliance Officer (Joseph F. Gregory) assume overall responsibility for the development, implementation, and integration of the elements of this Risk Management Plan. The Plant's Operations Supervisor (Lawre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045643,
      "SummaryText": "nce M. Brown) will be responsible for the execution of safe work practices and procedures regarding this process.\n\n\n\nD. Accidental Release Prevention\n\nContained within this document include emergency response and accidental release prevention policies and procedures that have been designed to reduce the risk of exposure to employees and the surrounding community of the acutely hazardous material. The Chlorine Storage facility is equipped with a number of safeguards such as high impact trunnions, chlorine cylinder leak repair kits, flexible connectors, various pressure/vacuum gauges, chlorine leak detection devices, emergency breathing apparatus, and a secure ventilation system with automatic shut-off devices, which will create containment of atmospheric chlorine in the event of a release.\n\n\n\nE. Five Year Accident History\n\nThe Carmel Area Wastewater District's Risk Management Plan contains an Incident Investigation Form that is to be filled out in the event of any accidental release that may occur. The form documents information such as the date, time, duration, amount, type and source of release. Weather conditions, on-site and off-site impacts, and any process changes resulting from the release or subsequent investigation are also included. The form must be filled out at any time that a release occurs which results in death, injury, significant property damage, or environmental damage. The District has not had any releases that warrant such an investigation in more than 21 years.\n\n\n\nF. Business Response Plan / Emergency Action Plan\n\nThe Carmel Area Wastewater District's Business Response Plan / Emergency Action Plan was designed to satisfy the requirements of AB2185 - Community Right-to-Know legislation, codified as CA Health & Safety Code section 25503 et. Seq., as well as the requirements of California Code of Regulations Title 8, section 3220 - Emergency Action Plan. By combining the two requirements into a single document, this plan is designed to minimize haza"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045643,
      "SummaryText": "rds to employees, public health, and the environment from fires, explosions, natural disasters, or any unplanned sudden or non-sudden release of hazardous materials, hazardous waste, or hazardous constituents to air, soil, surface water or groundwater. A revised copy of this plan is filed with the Monterey County Health Department (Division of Environmental Health) annually.\n\n\n\nG. Process Hazard Analysis\n\nThe Carmel Area Wastewater District has no immediate or long term improvements planned for the Chlorine feed system at this time, but this plan will be ammended at any time that such changes occur, and the Monterey County Health Department will be notified.\n\nA Process Hazard Analysis was performed during the month of July, 2002, at the treatment facility in accordance with the CalOSHA standard for Process Safety Management of Highly Hazardous Chemicals (PSM Standard). The method chosen for this analysis was the What/If Checklist method. The Process Hazard Analysis team consisted of Carmel Area Wastewater District's two Senior Operators, the Safety & Regulatory Compliance Officer, and the Environmental Health and Safety Director from Workplace Safety Specialists. The Process Hazard Analysis Revalidation was performed on January 28th, 2008, and the Revalidation Team consisted of two Carmel Area Wastewater District Operations personnel, the Safety & Regulatory Compliance Officer, and the Principle Representative from Total Safety Compliance."
    }
  ]
}