{
  "FacilityID": 1000029499,
  "FacilityName": "Valley Queen Cheese Factory, Inc.",
  "FacilityStr1": "200 E Railway Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Milbank",
  "FacilityState": "SD",
  "FacilityZipCode": "57252",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46051",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "45.220833",
  "FacilityLongDecDegs": "-096.637222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Valley Queen Chesse Factory, Inc.",
  "OperatorStr1": "PO Drawer 351",
  "OperatorStr2": null,
  "OperatorCity": "Milbank",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57252",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jason Humpton",
  "RMPTitle": "Maintenance Manager",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199983",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-04-13 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-09-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-09-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-09-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-09-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000035968,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000029499,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036350,
          "ProcessID": 1000035968,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043533,
          "ProcessID": 1000035968,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543533,
          "ProcessID": 1000035968,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029499,
      "SummaryText": "The Valley Queen Cheese Factory is located in Milbank, South Dakota. Valley Queen is a producer of various types of cheeses sold wholesale to its customers in 640 pound blocks for further processing. The plant has a state of the art, closed loop ammonia system used to maintain cooler temperatures, room air conditioning and cooling for multiple processes.\n\nAmmonia is a valuable chemical used in the plant refrigeration system. Ammonia is used at the plant to refrigerate large cheese storage coolers. It is used in jacketed silos for the cooling of milk cream. Ammonia is used in four different plate chillers to cool glycol which in turn provides cooling for different processes plant wide. The plant has 5 Evapco air handlers on the rooftop which use ammonia to condition the air in five different process areas. Ammonia is contained in the plant ammonia system equipment. The ammonia is compressed, condensed and evaporated to remove heat.\n\nSince ammonia is classified as a toxic chemical by the EPA, it is necessary to observe safety precautions in handling the chemical to prevent human exposure, to reduce the health threat to our fellow employees and to ensure the safety of our neighbors and community. Safety depends upon knowledgeable system operators, the safe manner in which we handle ammonia and safety devices inherent to the design of this plant.\n\nIn June of 2012, a third evaporative condenser was added to the ammonia system. A fifth air handler was also added. The new condenser will provide additional system capacity and the new air handler provides conditioned air for a new production process. These additions have resulted in an inventory increase of ammonia from 19,000 pounds to 24,000 pounds and therefore an OSHA Process Safety Management Plan and EPA Risk Management Plan have been implemented. It is the intent of Valley Queen Cheese to comply with OSHA Process Safety Management, EPA Accidental Release Prevention Rule and with all applicable state codes and regulati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029499,
      "SummaryText": "ons.\n\nThe plant ammonia refrigeration system operators are trained using various methods such as on the job training, formal classroom training, video/computer training and testing and verification of knowledge. Operators are initially classroom trained and have refresher training in the operation of the ammonia system at least every three years.\n\nThe ammonia refrigeration system is computer controlled with on-site and remote access for control of the system. If a system alarm should occur, operators are notified by an on screen alarm, and audible alarm in the engine room and by an auto paging message on their radios. An extensive ammonia detection system is in place which alarms if ammonia is detected. There are sensors place in every room of the plant where ammonia is present as well as three relief vent lines and each air handling unit. The ammonia system is also protected by safety systems and cutouts including pressure, temperature and level control. Safety relief valves protect the compressor discharge, condensers and all vessels from the hazard associated with overpressure. \n\nThe process has numerous safeguards including but not limited to:\n\n1.    Ammonia is not corrosive in this service\n\n2.    All of the ammonia lines are located on the roof or elevated and guarded to minimize potential forklift damage.\n\n3.    This plant has a safety program that includes employee awareness, employee participation and training to minimize the potential for an accident or incident involving ammonia.\n\n4.    A Process Hazard Analysis (PHA) was performed in January of 2012. A team with expertise in engineering, operations, maintenance and safety evaluated the existing ammonia system in depth and developed recommendations to improve the safety and operability of the system. The PHA addressed process hazards, previous incidents, engineering and administrative controls, facility siting, human factors and a qualitative evaluation of possible safety and health effects of control system failures."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029499,
      "SummaryText": "\n\n5.    Standard Operating Procedures were reviewed. The SOP's include procedures for normal operations, startup, shutdown, and emergency shutdown.\n\n6.    Management of Change procedures and pre startup safety reviews are in place to ensure that system changes and expansions are safe and consistent with the engineering design. They also ensure the system is safe for operation prior to startup.\n\n7.    Contractors that are used for work on or adjacent to the ammonia system are pre qualified based upon their knowledge of our ammonia system, understanding of applicable codes and standards, and their demonstrated ability to work safely. Each of these contractors is evaluated from a safety perspective.\n\n8.    The plant has a program in place for replacement of all pressure relief valves every five years.\n\n9.    The plant has and Emergency Response Plan based upon federal guidelines as they apply to this facility. The Emergency Response Plan includes in-house response capabilities in the event of a release, procedures for notification of the local fire authority, local emergency response authorities, and notification of any affected neighbors. The plant Emergency Action Plan is based on all known applicable regulations and requirements. Responders are medically evaluated, initially trained and refresher trained as required.\n\n\n\nValley Queen Cheese has had no reportable releases in the past five years or ever.\n\nThis system was new and operational on 8/21/2007. The first five year mechanical integrity inspection was completed the week of August 20th, 2012.\n\nRespectfully Submitted,\n\nJason R Humpton\n\nMaintenance Manager\n\nValley Queen Cheese\n\n"
    }
  ]
}