{
  "FacilityID": 1000046658,
  "FacilityName": "Sunoco Logistics Eagle Point NJ",
  "FacilityStr1": "1240 Crown Point Road",
  "FacilityStr2": null,
  "FacilityCity": "Westville",
  "FacilityState": "NJ",
  "FacilityZipCode": "08093",
  "Facility4DigitZipExt": "1000",
  "FacilityCountyFIPS": "34015",
  "LEPC": "West Deptford Twp LEPC",
  "FacilityLatDecDegs": "39.867201",
  "FacilityLongDecDegs": "-75.154938",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.sunocologistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 64717981,
  "ParentCompanyName": "Sunoco Partners Marketing & Terminals LP",
  "Company2Name": null,
  "CompanyDUNS": 64717981,
  "Company2DUNS": 64717981,
  "OperatorName": "Sunoco Partners Mktg & Terminals LP",
  "OperatorStr1": "1240 Crown Point Road",
  "OperatorStr2": null,
  "OperatorCity": "Westville",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08093",
  "OperatorZipCodeExt": "1000",
  "RMPContact": "Aaron Mierzwa",
  "RMPTitle": "Sr. Manager, Eagle Point Operations",
  "FTE": 50,
  "OtherEPAFacilityID": "08093cstlgrtes1",
  "EPAFacilityID": "100000051775",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "56002",
  "SafetyInspectionDate": "2014-01-15 00:00:00",
  "SafetyInspectionBy": "NJDEP",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-01-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-01-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-01-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.86153,
  "FRS_Long": -75.15217,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058147,
      "AltID": "Bulk Pet. Stor. Facility",
      "FacilityID": 1000046658,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000059088,
          "ProcessID": 1000058147,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071031,
          "ProcessID": 1000058147,
          "ChemicalID": 118,
          "Quantity": 8500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000571031,
          "ProcessID": 1000058147,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046658,
      "SummaryText": "Sunoco Partners Marketing & Terminals, L. P.\n\nEagle Point Tank Farm\n\n\n\nRMP EXECUTIVE SUMMARY\n\n\n\nAt the Sunoco Partners Marketing & Terminals, L.P. Eagle Point Tank Farm in Westville, NJ, we are committed to providing a safe work environment for employees and to being a responsible corporate citizen. We believe that excellent performance in the areas of health, environment, safety and security goes hand-in-hand with operational excellence and financial success. In fulfilling this commitment, we will comply with regulatory requirements and provide and maintain a safe working environment using acceptable and proven business practices. All Sunoco Logistics employees will strive to identify and eliminate hazards which could result in injury and illness, damage to the environment, property damage, and security losses.\n\n\n\nThe Eagle Point Tank Farm is operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community in which we operate. We promote health, safety, and the environment through programs of awareness, compliance, prevention and protection.  These programs include a combination of accidental release prevention and emergency response planning.  This summary provides a brief overview of the risk management activities that we have designed and implemented.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe Sunoco Logistics Eagle Point Tank Farm is primarily a refined petroleum products and crude oil terminal located in the city of West Deptford, New Jersey.  The tank farm receives, stores and transfers Gasoline, Distillates, Crude oil and Liquid Petroleum Gases (LPG), through various modes of transportation.  EPTF complies with Process Safety Regulations in covered process areas including all Butane loading/ unloading, Butane storage vessels, pumps and associated piping.  Butane is stored in four (4) 12,000 barrel spheres and one (1) 60,000 gallon cylinder at the east end of the tank"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046658,
      "SummaryText": " farm. Butane is blended into Gasoline streams in order to optimize Butane throughput at the facility.  There is also the ability to load Butane to truck trailers for delivery offsite.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\n\n\nOur accidental release prevention programs and emergency planning and response programs help us effectively manage the hazards posed by our regulated substances to our employees, the public, and the environment. The covered process is regulated by the EPA RMP regulation 40 CFR Part 68, as well as NJDEP Toxic Catastrophe Prevention Act program N.J.A.C. 7:31 (1-6) and the OSHA Process Safety Management Standard 29CFR 1910.119. The following accident prevention programs are in place at the Eagle Point Tank Farm:\n\n1) Employee Participation\n\n2) Process Safety Information\n\n3) Process Hazard Analysis (PHA) with Risk Assessments\n\n4) Standard Operating Procedures\n\n5) EHS Operator Training\n\n6) Contractors\n\n7) Pre-startup Safety Review\n\n8) Mechanical Integrity with Preventive Maintenance\n\n9) Work Permits\n\n10) Management of Change\n\n11) EHS Accident or Potential Catastrophic Event Investigation\n\n12) Emergency Response\n\n13) Compliance Audits\n\n14) Trade Secrets\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents within the past five (5) years.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Eagle Point Tank Farm maintains compliance with local, state and federal regulations including OSHA 29CFR 1910.120, Oil Pollution Act of 1990 and SARA Title III.  The programs are reviewed and updated on an annual basis, or more often if required.  Our Emergency Response Plan provides the essential planning and training for protecting employees, the public, and the environment during emergency situations. Contained within the Plan are written procedures that outline the actions to be taken for various types of emergencies that could occur in the facility.  These emergencies may include: airborne releases of chemical substances, spills to the water or ground, fir"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046658,
      "SummaryText": "es, explosions, personnel medical emergencies. The Programs address the aspects of emergency response including:\n\n-    Information on emergency organization (Incident Command System), including roles and responsibilities of personnel responding to the incident\n\n-    Procedures for notifying employees that a release has occurred\n\n-    Procedures for plant evacuation and accounting of personnel\n\n-    Procedures to notify local emergency response organizations and other appropriate authorities that a release has occurred\n\n-    Guidance on proper first aid and medical treatment for exposures\n\n-    Procedures for post incident cleanup and decontamination\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nWe are continually striving to make the Eagle Point Tank Farm the safest and most reliable workplace possible for our employees, our neighbors and our community. The facility's focus is safe, reliable, and environmentally sound operations. The goal of the Eagle Point Tank Farm is to demonstrate continuous improvement in our health, environmental and safety performance. In addition, we will work cooperatively with our neighbors to ensure the health, environment, safety and security of the Eagle Point Tank Farm and surrounding community.\n\n"
    }
  ]
}