{
  "FacilityID": 1000022136,
  "FacilityName": "Catoma Water Pollution Control Plant (WPCP)",
  "FacilityStr1": "6000 Richard E. Hanan Drive",
  "FacilityStr2": null,
  "FacilityCity": "Montgomery",
  "FacilityState": "AL",
  "FacilityZipCode": "36108",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01101",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "32.364167",
  "FacilityLongDecDegs": "-086.446111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.mwwssb.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Montgomery Water Works and Sanitary Sewer Board",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jody Thompson, WCPC Superintendent",
  "OperatorStr1": "6000 Richard E. Hanan Drive",
  "OperatorStr2": null,
  "OperatorCity": "Montgomery",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36108",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "ALL027863",
  "EPAFacilityID": "100000029747",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-24 00:00:00",
  "SafetyInspectionBy": "Ken Baugher/Water Training and Consulting Services",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-05-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-05-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-05-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-05-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.3653,
  "FRS_Long": -86.4428,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "250000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026924,
      "AltID": "Chlorine Storage and Use",
      "FacilityID": 1000022136,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031948,
          "ProcessID": 1000026924,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000027226,
          "ProcessID": 1000026924,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000018589,
              "Process_NAICS_ID": 1000027226,
              "SafetyReviewDate": "2011-03-24 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Unifrom Fore Code, NFPA 820, National Electrical Code, ADEM Chapter 317, Chlorine Institute Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2011-03-24 00:00:00",
              "ChangeCompletionDate": "2011-04-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Vandalism, Terrorism, Airplane crash",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Neutralization by routing chlorine rich air through the scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": "No process changes were recommended",
              "OpProceduresReviewDate": "2011-03-24 00:00:00",
              "TrainingReviewDate": "2011-03-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Hands-On",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-03-24 00:00:00",
              "EquipmentInspectionDate": "2011-03-24 00:00:00",
              "EquipmentTested": "Entire chlorination system visually inspected every day",
              "ComplianceAuditDate": "2011-03-24 00:00:00",
              "AuditCompletionDate": "2011-04-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000018875,
                  "PreventionProgram2ID": 1000018589,
                  "ProcessChemicalID": 1000031948
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000022136,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-03-24 00:00:00",
    "ERTrainingDate": "2011-03-25 00:00:00",
    "CoordinatingAgencyName": "Montgomery Fire Department HAZMAT",
    "CoordinatingAgencyPhone": "3342412400",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "NPDES"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022136,
      "SummaryText": "ne storage and chlorination system operation within the last five years.\n\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\nThe Catoma WPCP is in compliance with the RMP Rule, 40 CFR 68.  The facility has conducted a comprehensive review of all systems such as administrative, technical, and O&M procedures, in addition to the other required program elements of the RMP rule.  A hazard review was conducted at this facility using a what-if scenario and a checklist during March 2006.\nThe safety measures include a chlorine scrubber and process area chlorine leak detectors connected to audio alarms. For added safety and protection, access to the Catoma WPCP is through a remote controlled gate.  \nIn addition, the Catoma WPCP has implemented a prevention program that meets the requirements of the RMP rule. Preventive maintenance is performed on the chlorination process, including the appurtenances such as hoist and cables used to move the chlorine containers. The chlorination equipment is designed according to industry standards, is regularly inspected, and maintained in good working order by qualified maintenance personnel. The maintenance personnel are well trained in the handling and use of chlorine. The plant operators are also trained in the actions to be taken during an emergency and receive safety training every 18 months, more frequently than once every 3 years as required by the RMP regulation. The prevention program consists of the following elements:\n1) Safety information, which includes information pertaining to the hazards of chlorine, chlorination process, and the chlorination equipment. The safety information was reviewed in March 2011. \n2) Hazard Review, which includes a systematic evaluation (by an employee team) of the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000022136,
      "SummaryText": "factors, and possible safety and health effects of failure of controls. Hazard review was updated using a What-if Scenario and a Checklist in March 2006. \n3) Operating procedures, that provide clear instructions for safely conducting activities associated with the chlorine storage and chlorination process. The operating procedures were reviewed in March 2011.\n4) Training for each employee involved in operating the chlorine system. Most recently refresher training was provided to employees in March 2011.\n5) Maintenance procedures to maintain the on-going integrity of the chlorine process equipment. The maintenance procedures were reviewed in March 2001.\n6) Compliance audit to evaluate the Catoma WPCP's Risk Management Program with the regulatory requirements and to evaluate the effectiveness of implementation. The last compliance audit was conducted in March 2011. \n7) Incident investigation procedures, to be followed, if required to conduct and document each incident that results in, or could reasonably have resulted in, a catastrophic release of chlorine. \n\nEmergency Response Program\nThe MWWSSB has an Emergency Response Program, which applies to the Catoma WPCP. The Emergency Response Program coordinates response efforts with the City of Montgomery Fire DepartmentÂ¿s HAZMAT team, the police department, and the hospital.  The City of Montgomery Fire Department is fully equipped to respond to emergencies and is staffed around the clock with trained firefighters and HAZMAT personnel that can respond to emergencies. Response activities also have been discussed with the Alabama Emergency Management Office Agency.\n\nPlanned Changes to Improve Safety\nIt was observed that the Catoma WPCP has the necessary equipment and the operating and training procedures required for the safe storage of chlorine and safe operation of the chlorination system. Wind socks have been installed at the Catoma WPCP and are currently working properly."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022136,
      "SummaryText": "Executive Summary\nAccidental Release Prevention and Emergency Response Policies \nIt is the policy of the Water Works and Sanitary Sewer Board of the City of Montgomery (MWWSSB) to adhere to all federal, state, and local laws applicable to the Catoma Water Pollution Control Plant (WPCP). In the spirit of this policy Catoma WPCP and the MWWSSB operate the waste water treatment processes safely, reducing to the greatest extent practicable any hazards associated with the treatment processes and reducing any subsequent risk to the surrounding community, personnel, and the environment. The policy includes working with the surrounding community and local emergency response agencies including the City of Montgomery Fire Department to implement the emergency response program, in the unlikely event of a process incident occurring at the Catoma WPCP. \nThe Catoma WPCP is subject to the Program Level 2 of the RMP regulations. The Catoma WPCP's accidental release prevention and emergency response policies comply with the RMP rule requirements. Specific handling, operation and maintenance, and emergency response procedures have been developed for the storage of chlorine and for the chlorination process.  The Catoma WPCPÂ¿s personnel that work with chlorine storage and the chlorination process are thoroughly trained in the aspects of safe handling, operation, maintenance, and emergency response actions as required by the Risk Management Program (RMP) regulation. \nTo minimize the effect of an accidental release of chlorine on the surrounding community Catoma WPCP has a chlorine scrubber that can neutralize the chlorine with an effectiveness of 99.5 percent. The Catoma WPCP has established and maintained procedures for emergency notification and response and has coordinated the emergency response steps with the City of Montgomery Fire Department. The City of Montgomery Fire Department is fully equipped to respond to emergencies and is staffed around the clock with trained firefighter"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022136,
      "SummaryText": "s and HAZMAT personnel that can respond to emergencies.  \n\nStationary Sources and Regulated Substance Handled\nThe Catoma WPCP is located in Montgomery, Alabama. The Catoma WPCP uses chlorine to disinfect treated waste water and maintain a chlorine-residual prior to discharging the treated waste water.  Chlorine is used primarily as a disinfectant.  Other possible uses of chlorine include odor control and assisting the biosolids settling in the clarification process.\nThe Catoma WPCP stores chlorine, liquefied under pressure, in an enclosed building.  The maximum chlorine storage capacity exceeds the RMP applicability threshold. Chlorine gas is withdrawn, mixed with water and distributed to application points. As required by the RMP regulation, the Catoma WPCP has evaluated the following offsite consequence analysis and reported it in this Risk Management Plan to EPA using RMP*Submit 2004.\n\nWorst-Case Release Scenario (WRS)\nAs required by the RMP Rule, the WRS used for the Catoma WPCP is the release of entire contents of a single largest container over a period of 10 minutes. The chlorine cylinder storage area is in an enclosed building, which results in a 45 percent passive mitigation of any chlorine release. The distance to the toxic endpoint of 3 ppm is estimated using the EPA-approved model RMP Comp&reg;. \n\nAlternative Release Scenario (ARS)\nThe ARS is one that is more likely to occur than a WRS. Based on the process hazard analysis performed for the chlorine system, it was determined that the most likely scenario would be a chlorine gas leak from the gas side of the chlorine container or from the gas feed lines leading to the chlorinator. According to the Risk Management Program regulations, mitigation from both active (chlorine scrubber) and passive (building enclosure) controls are factored in to determine the ARS chlorine release rate using the EPA-approved model RMP Comp&reg;. \n\nFive-year Accident History\nThe Catoma WPCP has had no accidents related to chlori"
    }
  ]
}