{
  "FacilityID": 1000070077,
  "FacilityName": "Ashland Cold Storage Company, Inc.",
  "FacilityStr1": "1556 West 43rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60609",
  "Facility4DigitZipExt": "3389",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.815833",
  "FacilityLongDecDegs": "-087.663333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "ashlandcoldstorage.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dwight Steihl",
  "OperatorStr1": "1556 W. 43rd ST.",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60609",
  "OperatorZipCodeExt": null,
  "FTE": 84,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000116714",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-11-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.81583,
  "FRS_Long": -87.6642,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000088053,
      "AltID": "Ashland NH3 Refrigeration",
      "FacilityID": 1000070077,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000110261,
          "ProcessID": 1000088053,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000089275,
          "ProcessID": 1000088053,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000074349,
              "Process_NAICS_ID": 1000089275,
              "SafetyReviewDate": "2018-12-05 00:00:00",
              "PHA_Date": "2015-12-14 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-01-21 00:00:00",
              "TrainingReviewDate": "2017-05-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-12-10 00:00:00",
              "EquipmentInspectionDate": "2018-12-10 00:00:00",
              "EquipmentTested": "all compressor, boosters, condensers & evaporators",
              "ChangeMgmtDate": "2018-06-25 00:00:00",
              "ChangeMgmtReviewDate": "2018-06-25 00:00:00",
              "PreStartupReviewDate": "2017-05-16 00:00:00",
              "ComplianceAuditDate": "2017-05-16 00:00:00",
              "AuditCompletionDate": "2017-11-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-05-16 00:00:00",
              "HotWorkPermitReviewDate": "2017-05-16 00:00:00",
              "ContractorSafetyReviewDate": "2017-05-16 00:00:00",
              "ContractorSafetyEvalDate": "2019-01-14 00:00:00",
              "CBI_Flag": 0,
              "Description": "Preventative maintenance and on-the-job training of operators make up the foundation of our orevention program.  Our program also relies heavily upon the prior experience of our operators and refrigeration contractors and outside consultants.  Inspections by our staff, refrigeration contractors, as well as, city inspectors help us with our on-going commitment to adhere to OSHA's Process Safety Management Program.  In this regard we have developed and implemented safe work practices, including, lockout/tagout, confined space entry, line break and entrance control policies and permits.  Continue our training and emergency action program and reassessed procedures to maintain the on-going integrity of the refrigeration system.  Other items include updating of our operation manual and training to reflect improved approaches to safety.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000092711,
                  "PreventionProgram3ID": 1000074349,
                  "ProcessChemicalID": 1000110261
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000070077,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2017-05-16 00:00:00",
    "ERTrainingDate": "2018-07-18 00:00:00",
    "CoordinatingAgencyName": "Chicago LEPC",
    "CoordinatingAgencyPhone": "3127466430",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000070077,
      "SummaryText": "The accidental release prevention and emergency response policies at our facility.\n\n\n\nIt is the company's policy:\n\n\n\n- To continously perform preventative maintenance on all aspects pertaining to the the refrigeration system.  The success of this policy is evidenced by the safe operation of the facility since its origin in 1963.\n\n- That there is no smoking permitted anywhere inside the building, other than a single designated smoking area.  This keeps fire hazards to a minimum.\n\n- That no vehicles, such as forklifts, are permitted near ammonia refrigeration equipment, including piping.  Forklift operators are trained to use caution wherever refrigeration equipment is present.\n\n- That all operators must be properly trained before they are permitted to work on, or operate the refrigeration system.\n\n- That all operators are required to undergo a 24 hour hazardous material training as per OSHA 1910.120 regulations.  This is done to insure their ability to participate in the correction or repair of conditions that might result in an accidental release.\n\n- That every employee, visitor, contractor or truck driver is informed of the safety aspects of the facility.\n\n\n\nDescription of our facility and the regulated substances handled, including how and why we use ammonia.\n\n\n\nOur company supplies refrigerated warehousing to companies in the food industry.  Our building is basically a large refrigerator/freezer used to prevent food from spoiling.  Refrigeration is an essential component of the health and safety in everyday life of the consumer.  Our facility supplies refrigeration services to thousands of food related businesses to help insure safe storage and shipment of their products.\n\n\n\nAnhydrous ammonia is utilized as the refrigerant in our refrigeration system.  Unlike the now-banned or restricted chlorofluorocarbons (CFC's such as certain Freons and Genetrons), ammonia is not an environmental ozone depleter.  When in the environment, it readily enters the natural nitrogen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000070077,
      "SummaryText": " cycle, supplying fixed nitrogen to the plants, which in turn use it as an essential growth nutrient.  In addition, ammonia is a highly efficient refrigerant.  This translates to lower energy costs, thereby resulting in savings to the consumer, less dependence upon foreign energy imports, as well as less production of public-utility-generated greenhouse gases.\n\n\n\nDescription of the \"Worst case release scenario\" and the \"Alternative release scenario\", including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\n\n\nWe used the EPA supplied RMP-Comp software package to perform the release scenario calculations.  As part of our modeling, we have assumed that the building structure will act in the capacity of passive mitigation, to decrease the rate of release to the environment.\n\n\n\nWe have performed a \"Worst case scenario\" calculation for a release from a ruptured refrigeration vessel that could potentially hold 423 cubic feet of ammonia.  However, it is our normal opeating procedure to keep this vessel filled to only about 25% to 35% of its capacity.  From our calculations we have concluded that there would be offsite consequences to the surrounding community in the event of an ammonia release.  However, due to our continous inspection and maintenance procedures, we feel such a release is extremely unlikely.\n\n\n\nWe have also performed an \"Alternantive release scenario\" calculation.  The alternative release we have presented would be if a forklift completely broke one of the major pipes in the system.  In this instance the effect on the surrounding location would be drastically less than in the worst case scenario described above.  This is even assuming no active active mitigation devices.  However, our protection systems and devices in the refrigeration system make off-site impacts even less likely.\n\n\n\nGeneral accidental release prevention program and prevention steps relating to the ammonia refrigeration system.\n\n\n\nPreven"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000070077,
      "SummaryText": "tative maintenance has been the hallmark of the safety program at our facility.  We have daily walk-throughs by experienced personnel.  Our facility strives to comply with the OSHA PSM program, which include:\n\nPROCESS SAFETY INFORMATION, including hazard, technology, and equipment information on ammonia refrigeration.\n\nEMPLOYEE PARTICIPATION, including providing employees and their representatives access to our PSM records.\n\nPROCESS HAZARD ANALYSIS, performed by using the \"WHAT IF\" format.\n\nOPERATING PROCEDURES, including clear instructions for safely conducting activities involving our system and safe work practices.\n\nTRAINING, especially in safety aspects and refresher cources.\n\nCONTRACTORS, assuring that we use knowledgeable, trained experts that follow the safety rules of the facility.\n\nPRE-STARTUP SAFETY REVIEW, confirming in a safety review that changes to our system are properly designed and installed correctly.\n\nMECHANICAL INTEGRITY, including procedures to maintain the ongoing integrity of our refrigeration equipment.\n\nHOT WORK PERMITS\n\nMANAGEMENT OF CHANGE, including informing and training affected employees if any changes are made to the system, prior to start up.\n\nINCIDENT INVESTIGATION, including all incidents and near-miss incidents relating to our refrigeration system that have a potential for injury.\n\nEMERGENCY PLANNING AND RESPONSE, including development and implementation of an emergency action plan.\n\nCOMPLIANCE AUDITS, on a regular basis.\n\n\n\nOur refrigeration system has extensive control and safety devices that act to ensure efficient and safe operation.\n\n\n\nWe have on site electric-generating equipment which is capable of producing all of our electrical needs 24 hours per day, 365 days per year.  We also have, in addition, an emergency generator that is capable of supplying electricity to essential areas.\n\n\n\nFive year accident history relating to the ammonia refrigeration system.\n\nIn the past five years we have not had a injury or incident concern"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000070077,
      "SummaryText": "ing ammonia.\n\n\n\nEmergency respnce program.  We have a safety program that involves all employees at our facility.  Operators and maintenance personnel are trained in how to properly investigate under potentially hazardous circumstances, inspect equipment, and maintainsafe work conditions.  Operators and maintenance personnel, as well as our management and security personnel, have all been trained in what steps to take in an emergency situation and who to call.  Our program utilitzes the Chicago Haz Mat team and refrigeration contractors.  Our operators are trained to provide assistance in a Haz Mat response.\n\n\n\nPlanned changes to improve safety.\n\n- We continue our annual Haz Mat Responder training for all operators.\n\n- We continue on the job training.\n\n- We keep abreast of new technologies and systems to keep our system operating safely and efficiently.\n\n- We have an on-going effort to convert our automatic controllers to a computerized control system.  This will further improve safety by allowing off-site control of our refrigeration system."
    }
  ]
}