{
  "FacilityID": 1000085142,
  "FacilityName": "Fresh Select LLC",
  "FacilityStr1": "39303 Road 56",
  "FacilityStr2": null,
  "FacilityCity": "Dinuba",
  "FacilityState": "CA",
  "FacilityZipCode": "93618",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.504308",
  "FacilityLongDecDegs": "-119.450316",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fresh Select LLC",
  "OperatorStr1": "39303 Road 56",
  "OperatorStr2": null,
  "OperatorCity": "Dinuba",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93618",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200613",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-10-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-10-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000106329,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000085142,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000133111,
          "ProcessID": 1000106329,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000107602,
          "ProcessID": 1000106329,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000090137,
              "Process_NAICS_ID": 1000107602,
              "SafetyReviewDate": "2019-09-25 00:00:00",
              "PHA_Date": "2019-09-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-10-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-11-04 00:00:00",
              "TrainingReviewDate": "2019-08-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-08-13 00:00:00",
              "EquipmentInspectionDate": "2020-02-07 00:00:00",
              "EquipmentTested": "Daily Compressor Inspection",
              "ChangeMgmtDate": "2019-08-13 00:00:00",
              "ChangeMgmtReviewDate": "2019-08-13 00:00:00",
              "PreStartupReviewDate": "2019-08-13 00:00:00",
              "ComplianceAuditDate": "2017-10-17 00:00:00",
              "AuditCompletionDate": "2019-05-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-08-13 00:00:00",
              "HotWorkPermitReviewDate": "2019-08-13 00:00:00",
              "ContractorSafetyReviewDate": "2019-08-13 00:00:00",
              "ContractorSafetyEvalDate": "2019-03-08 00:00:00",
              "CBI_Flag": 0,
              "Description": "Fresh Select has prepared a unified Risk & Process Safety Management Program. The program is in compliance with California's Accidental Release Prevention (CalARP) Program (in California CCRTitle 19, Chapter 4.5 Program Level 3 Elements. At the Federal level, Title 40 CFR Part 68), and California OSHA's Process Safety Management (PSM) of Acutely Hazardous Materials, standard (in California CCR Title 8, Section 5189, ?Process Safety Management of Acutely Hazardous Materials,? and Federally Title 29 Code of Federal Regulations (CFR) 1910.119). This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000112216,
                  "PreventionProgram3ID": 1000090137,
                  "ProcessChemicalID": 1000133111
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000085142,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000085142,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\nCalifornia Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\nFederal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\nCalifornia Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\nFederal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Fresh Select has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Fresh Select, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that Fresh Select has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name                | Process Chemical             | Process Quantity(lbs.)\n\nAmmonia Refrigeration         Anhydrous Ammonia              14,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM plan to meet CalARP and RMP obligations as w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000085142,
      "SummaryText": "ell\n\n2. Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Descriptions\n\n\n\nFresh Select operates a commercial cold storage for a variety of fruit in Dinuba, CA. The facility has an ammonia refrigeration system that provides refrigeration capacity to the following:\n\n\n\n(3) Rooms\n\n(1) Loading Dock\n\n(4) Degreening Rooms (glycol)\n\n\n\nRoom 1 is equipped with air-cooling evaporators and an accumulator as required for flooded operation. Rooms 2-3 and the loading dock are equipped with air-cooling evaporators and a liquid recirculator (machinery room) as required for a pumped overfeed operation.\n\n\n\nMost control valve groups are located on the roof to provide easy access. The refrigeration machinery is contained within or directly adjacent to the machinery room. A partial list of system components includes:\n\n\n\nMachinery Room\n\n(1) Reciprocating compressor\n\n(2) Screw compressors\n\n(3) Oil separators\n\n(1) Plate heat exchanger (glycol)\n\n(1) Liquid recirculator\n\n(1) Oil pot\n\n\n\nCondenser Area\n\n(1) Evaporative condenser\n\n(1) High pressure receiver\n\n(1) Liquid transfer vessel\n\n(1) Main suction accumulator\n\n\n\nLoading Dock\n\n(4) Air-cooling evaporators (ceiling-suspended)\n\n\n\nRoom 1\n\n(1) Accumulator\n\n(2) Air-cooling evaporators (bunker-mounted, spiral fin)\n\n\n\nRoom 2\n\n(3) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 3\n\n(3) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nThe flooded system operates as follows: high pressure liquid from the high pressure receiver is piped to each cold room, where it passes through an expansion valve into low temperature and pressure accumulator mounted behind the bunker wall. From the accumulators, low pressure liquid is circulated thro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000085142,
      "SummaryText": "ugh evaporator coils. As heat is absorbed, the liquid ammonia vaporizes to form low temperature and pressure gas which is returned to the accumulator vessels. The suction gas is returned from the accumulators through a suction return line to the main suction accumulator.  From the main suction accumulator, ammonia is piped to the suction inlet on the compressors. The high pressure discharge from the compressors is sent to water-cooled evaporative condensers where the high pressure gas ammonia is cooled, liquefied and returned to the high pressure receiver.\n\n\n\nThe pumped overfeed system operates as follows:  high pressure liquid from the high pressure receiver is piped through a series of liquid feed solenoid valves, an expansion valve, and into a liquid recirculator.  From there, low pressure liquid is pumped to each evaporator, where it passes through a solenoid valve, hand expansion valve and into evaporator.  Low temperature liquid circulates through the evaporator.  As heat is absorbed, the liquid ammonia vaporizes to form low temperature and pressure gas which passes through an isolation valve and is returned to the liquid recirculator.  The residual liquid is separated from the gas in the recirculator and the gas is piped to the suction inlet on the compressors which elevate the temperature and pressure of the gas.  The high pressure discharge from the compressors is sent to a water cooled evaporative condenser where the high pressure gas ammonia is liquefied and returned to the high pressure receiver.\n\n\n\nThe system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and pressure relief valves which vent to the atmosphere if the pressure in the system exceeds their set point. \n\n\n\nThere is one ammonia detector installed inside the refrigeration machinery room. The sensor is set at the California OSHA permissible exposure limit of 25 ppm, which will activate the mecha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000085142,
      "SummaryText": "nical ventilation system at a normal rate of 20 air changes per hour and activate an audible alarm and strobe. Also, a sampling system is installed in each refrigerated area that provides at least every 15-minute interval monitoring. The sampling system is set at the California OSHA permissible exposure limit of 25 ppm, which will activate an audible alarm and auto-dialer.\n\n\n\nThe ammonia refrigeration system at Fresh Select consists of vessels, equipment, and valves which are interconnected by piping.  As such, the refrigeration system at Fresh Select is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nFresh Select has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the Fresh Select facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equip"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000085142,
      "SummaryText": "ment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nFresh Select has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nFresh Select's emergency action and response program has been developed to satisfy the following requirements:\n\nCalifornia \"Emergency Action Plan\" - Title 8 CCR ?3220\n\nFederal \"Emergency Action Plan\" - Title 29 CFR ?1910.38 \n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nFresh Select has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Fresh Select continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Fresh Select's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Fresh Select's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nFresh Select has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\nIn addition to utilizing PSMWriter to create, sch"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000085142,
      "SummaryText": "edule, track, and document events, Fresh Select has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, Fresh Select now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Fresh Select employees, but allows for feedback and continual improvement. Through the RMP-PSM program Fresh Select will continue to maintain overall plant worker and public safety. \n\n"
    }
  ]
}