{
  "FacilityID": 1000025797,
  "FacilityName": "Helena Chemical Company - Burkburnett, TX",
  "FacilityStr1": "2202 South Red River Expressway",
  "FacilityStr2": null,
  "FacilityCity": "Burkburnett",
  "FacilityState": "TX",
  "FacilityZipCode": "76354",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48485",
  "LEPC": "Wichita County LEPC",
  "FacilityLatDecDegs": "34.051781",
  "FacilityLongDecDegs": "-098.559171",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "2202 South Red River Expressway",
  "OperatorStr2": null,
  "OperatorCity": "Burkburnett",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76354",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Stockinger",
  "RMPTitle": "Warehouse & Safety Manager",
  "FTE": 16,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000082019",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-01-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-01-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.05575,
  "FRS_Long": -98.55896,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000031706,
      "AltID": "Storage and Handling",
      "FacilityID": 1000025797,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000032007,
          "ProcessID": 1000031706,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000038430,
          "ProcessID": 1000031706,
          "ChemicalID": 56,
          "Quantity": 5842670.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000538430,
          "ProcessID": 1000031706,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025797,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nHelena is submitting this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Helena engages in the formulation, distribution, and sale of chemicals to customers, most of whom use Helena's products to support agricultural operations.  The Burkburnett Facility is a Program 3 facility because it is regulated under the standards codified by the Occupational Safety and Health Administration (OSHA) at 29 CFR ? 1910.119, also known as the process safety management (PSM) standards.   The PSM standards are applicable to operations at the Burkburnett facility because it receives less than half of its anhydrous ammonia related income from the direct sale of anhydrous ammonia to end users (i.e. individual farms).  The majority of the anhydrous ammonia related income from the Burkburnett facility is derived from the sale of anhydrous ammonia to other distributors.  The Burkburnett, TX facility is also subject to the OSHA standards at 29 CFR ? 1910.111, Storage and Handling of Anhydrous Ammonia.  \n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Burkburnett, TX Facility located at 2202 South Red River Expressway, Burkburnett, TX 76354.  The electronic RMP summarizes the policies and procedures implemented by the Burkburnett, TX Facility to minimize the likelihood of an accident. The electronic RMP also summarizes the actions that the Burkburnett, TX Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nHelena is submitting this RMP as a 5-year update.\n\n\n\nFACILITY\n\n\n\nThe Burkburnett, TX Facility is involved in the sale of agricultural chemical products to farmers and other distributors.   Anhydrous Ammonia (ammonia) is transferred from up "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025797,
      "SummaryText": "to 10-30,000-gallon railcars to one of 23 storage tanks that have a combined capacity of 1,063,350 gallons.  From the storage tanks, ammonia is transferred using a liquid pumps to one of two commercial tanker truck loading areas and one of two nurse-tank loading areas.  Ammonia is also transferred from one of the 23 storage tanks to a stationary blender located adjacent to the ammonia storage tanks, or to a mobile blender that is temporarily located near the stationary blender and operated by a Contractor.  At the blender (stationary or mobile), ammonia is mixed with water and phosphoric acid to produce liquid ammonium phosphate fertilizer.  The liquid fertilizer is pumped from either blender to one of three liquid fertilizer storage tanks. \n\n\n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative consequence analysis were completed for the Burkburnett, TX Facility. The worst-case scenario release assumed that all the contents in the largest single storage tank (48,000 gallons) were released.  The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\n\n\nThe alternative (or more likely to occur) scenario assumes a rupture of a 3-inch pipe caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although this event is classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment (rail guards, check valves) and operating procedures that Helena uses to safeguard ammonia transfer operations.\n\n\n\nBoth the worst case and alternative scenario are overly conservative because even a 2-minute release is unlikely to occur since check valves on the system should close immediately upon increased flow resulting from the severed transfer line.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Plant Manager implements the risk management "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025797,
      "SummaryText": "planning process at this Helena facility.  Other Helena staff, as directed, assists the Plant Manager.  The Plant Manager is responsible for conducting ammonia process operations in accordance with this RMP, and is responsible for the relevant PSM requirements.  Upon request, Helena will provide a copy of its RMP, Contingency Plan, Operating Procedures, and PSM to its contractors and auditing agency.  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nHelena Chemical Company?s Burkburnett, TX Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Burkburnett, TX Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Burkburnett, TX Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Burkburnett, TX Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Wichita County, TX LEPC.\n\n\n\nNOTE: Sections 4, 5, 6, and 8 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Burkburnett, TX Facility."
    }
  ]
}