{
  "FacilityID": 1000115373,
  "FacilityName": "Cal West Cooling",
  "FacilityStr1": "761 Commercial Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.193201",
  "FacilityLongDecDegs": "-119.173486",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Western Precooling Systems",
  "Company2Name": null,
  "CompanyDUNS": 81840753,
  "Company2DUNS": null,
  "OperatorName": "Western Precooling Systems",
  "OperatorStr1": "P. O. Box 5083",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93031",
  "OperatorZipCodeExt": "5083",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124581",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-05-15 00:00:00",
  "SafetyInspectionBy": "CUPA Oxnard City Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2004 RMP Submit",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 34.19363,
  "FRS_Long": -119.174019,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000143917,
      "AltID": "Refrigeration System",
      "FacilityID": 1000115373,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000179924,
          "ProcessID": 1000143917,
          "ChemicalID": 56,
          "Quantity": 19560.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000145435,
          "ProcessID": 1000143917,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000123017,
              "Process_NAICS_ID": 1000145435,
              "SafetyReviewDate": "2024-05-16 00:00:00",
              "PHA_Date": "2024-05-16 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Touchscreen PLC, Microprocessors, Penn Switches",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-Water Diffusion Containment System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Maintenance and Administrative Improvements",
              "OpProceduresReviewDate": "2024-02-06 00:00:00",
              "TrainingReviewDate": "2024-02-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online Courses",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-20 00:00:00",
              "EquipmentInspectionDate": "2024-04-27 00:00:00",
              "EquipmentTested": "T048 (IIAR-6 Annual)",
              "ChangeMgmtDate": "2015-08-26 00:00:00",
              "ChangeMgmtReviewDate": "2023-07-25 00:00:00",
              "PreStartupReviewDate": "2016-03-08 00:00:00",
              "ComplianceAuditDate": "2023-07-25 00:00:00",
              "AuditCompletionDate": "2024-12-16 00:00:00",
              "IncidentInvestigationDate": "2019-05-23 00:00:00",
              "InvestigationChangeDate": "2019-05-23 00:00:00",
              "ParticipationPlansReviewDate": "2023-07-25 00:00:00",
              "HotWorkPermitReviewDate": "2023-07-25 00:00:00",
              "ContractorSafetyReviewDate": "2018-01-05 00:00:00",
              "ContractorSafetyEvalDate": "2023-07-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000154248,
                  "PreventionProgram3ID": 1000123017,
                  "ProcessChemicalID": 1000179924
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000115373,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-02-06 00:00:00",
    "ERTrainingDate": "2024-04-04 00:00:00",
    "CoordinatingAgencyName": "Oxnard Fire/CUPA Department",
    "CoordinatingAgencyPhone": "8053857722",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CFR 1910.120(q); CCR8 3220; 5189; Cal/ARP CCR 19, Div 2, Chapter 4.5; CCR 19, 2729 - 2732"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000115373,
      "SummaryText": "aging Area(s) for a head count. Emergency response is coordinated with the City of Oxnard Fire/CUPA. The facility has confirmed that it is included in the Oxnard Community Emergency Plan required by the Emergency Planning and Community-Right-to-Know Act (EPCRA).  Oxnard Fire/CUPA performs routine inspections.\n\n1.6 Planned changes to improve safety\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n\n­-Process Hazard Analysis Update\n­-Cal/ARP Seismic Assessment\n­-Compliance Audits\n­-Mechanical Integrity Program (Routine Inspections & Maintenance)\n­-IIAR Inspection Protocol\n­-WPS Inspection Protocol\n\nThe programs above may result in recommendations ranging from capital improvements to routine maintenance. Where appropriate service calls are established in parallel to identified needs. Current planned changes to improve safety include recommendations as a result of the Process Hazard Analysis (PHA) performed May 16, 2024. The local Fire Department/CUPA was invited to participate and did attend the PHA.  Recommendations have been compiled; reviewed by management, and a written implementation schedule has been prepared. The completion of recommendations is scheduled by 12/30/2025.  A summary includes seismic re-evaluation, documentation updates and administrative improvements. \n\nEnd of Executive Summary 2024"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000115373,
      "SummaryText": "alert is automatically sent to \n technicians and cooler managers.\n­-Staff is trained in the benefits of good housekeeping. The general appearance of the \n facility is maintained on a day-to-day basis.\n­-Primary ammonia pump upgrades to seal-less design.\n\n1.4 Five-Year Accident History\n\nThere is no data to report.\n\n1.5 The Emergency Response Program\n\nThe plant is specifically designed and engineered to provide for life safety and effective emergency response. Building space is fire-alarm, ammonia alarm and fire-sprinkler equipped. The refrigeration process\u0092s Control, Monitoring and Alarm System includes a backup power supply (UPS). The system initiates notifications, alarms, equipment shutdown and pump-down of the affected area according to the location, nature and severity of the problem. Authorized personnel can access critical process system controls remotely. A KNOX system is coordinated and kept up to date via communications with the Oxnard Fire Department/CUPA. The automatic systems and devices are regularly inspected, tested and maintained. Employees are trained in manual discovery, emergency shutdown, evacuation and notification procedures in the highly unlikely event of a failure of the engineered safety and emergency systems.\n\nThe Plant does not require its employees to participate in conducting emergency response activities under the HAZWOPER standard; a Non-responding Facility Policy has been adopted for the Plant as a whole. In the event of an ammonia emergency, the response is to follow the procedures in the Equipment SOP's and the California Hazardous Material Business Plan. The overall procedure is to shutdown critical systems if it can be done safely by qualified personnel, evacuate, and notify the local response agencies and WPS; WPS employs technicians that are 1910.120(q) Hazardous Material Technician certified. Plant employees are to implement hazard communications, provide for the safety of visitors and report to the established Evacuation St"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000115373,
      "SummaryText": "occur. Special self-closing valves are now installed as a permissive for oil drain flow. If a release were to develop during the oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated. The facility has installed these types of valves at each of the system's oil drain points. \n\nModifications have been made to the system to provide support in the event of seismic activity. Relief valves have been piped to a common header that terminates at the bottom of an ammonia-water diffusion tank system. Relief valve excursions were another unwanted release potential and by routing to a secondary containment system should no longer affect people on or off-site.\n\nOther Ammonia-Specific Release Prevention Steps:\n\n-A computer monitoring system that monitors process parameters 24/7/365. This \n ammonia alarm system is continuously monitored via a third-party security company.\n­-CWC has enclosed the facility with fencing and gates to limit access to the facility to \n increase the security of the facility from potential wrong-do-ers.\n­-Access to process areas is controlled by a sign-in/sign-out program\n­-Employees are trained for hazard communication (discovery and communicating) for \n  releases, fires, vandals, etc. Training is documented through an online training system \n  (WBBM).\n­-A relationship exists with the Oxnard Fire Department. There have been demonstrations \n and tours of the system to familiarize their personnel with facility layout and where \n hazardous areas are located.\n­-The engine room is computer-controlled with telephone access for monitoring and \n parameter changes. The equipment may be shut down from offsite via phone if it were \n not possible to directly access the control area.\n­-There is an automatic texting function that is connected to the computer control. When \n there is an equipment failure, or when the pressures are rising and approaching the \n shutdown setting, or if there is a power failure, a text"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000115373,
      "SummaryText": "harvest demand. Portable refrigerating equipment is common in the industry.\n\n1.3 General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nThe design of the refrigeration system along with the implementation of the PSM Accidental Release Prevention Program is designed to provide assurance that the risks associated with the ammonia refrigerant are effectively managed. The elements of the PSM Program are intended to be integrated with the ongoing functions of the facility. The program is specifically intended to prevent an occurrence and minimize the consequences of an Anhydrous Ammonia release. In California the PSM program is in accordance with CCR 8, §5189, which is integrated with the Cal/ARP and Fed/ARP Accidental Release Prevention Programs.\n\nWritten procedures have been developed for the daily operation of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release. The written procedures include necessary safety precautions and address each operating phase as defined by the Cal-ARP RMP/PSM Program. Refrigeration systems are only operated by pre-qualified personnel that are trained and qualified in the relevant operating and safety procedures. The Written Operating Procedures are maintained online & onsite and are regularly validated.\n\nScheduled inspections and maintenance are executed by Western Precooling Systems (WPS) qualified technicians and/or pre-qualified specialty vendors. WPS actively encourages its ammonia technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA). WPS Technicians participate in a state-of-the-art online training program that includes RETA course materials (Web-based Business Manager/WBBM).\n\nChemical-Specific Prevention Steps\n\nOver the years it had become apparent in the Industry that a mishap while draining oil from the system was one of the most common release incidents to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000115373,
      "SummaryText": "Western Precooling Systems supervises and maintains the refrigeration system.\n\nThe facility provides refrigeration effect for the removal of field heat from freshly harvested vegetables and fruit. The product that comes to the facility for pre-cooling and short-term storage is on site anywhere from 1-6 days. The facility is a seasonally operated plant with product harvest periods picking up in the month of October and finishing in July. The remaining months see little fresh product; however, the refrigeration equipment is still operative. Major maintenance is performed during these slower months. Operational maintenance is performed on a year-round basis. Company policy requires appropriately pre-qualified personnel to perform maintenance tasks.\n\nThe Regulated Substance in use is Anhydrous Ammonia, CAS #7664-41-7, which is used in a single closed-loop mechanical refrigeration system. Refrigerating equipment consists of Compressor Units, Evaporative Condenser, Pressure Vessels, Room Evaporators, Portable HydroVac Vacuum Tubes, Pressure Coolers, Pumps, and associated valves, instrumentation, and piping. Pressure and temperature controls are installed in accordance with appropriate standards, including isolation and overpressure safety relief valves. Pressure relief valves terminate at an Ammonia-Water Diffusion System which protects these valves from venting directly to atmosphere. \n\nAn automated refrigeration control, monitoring and alarm system automatically monitors the system. The Alarm System is supervised 24/7/365 by a third-party alarm company which maintains pre-determined call lists and parameters. Technicians are also notified directly via text message if the system approaches out-of-tolerance conditions. Though rare, the facility has the ability to augment its capacity with portable refrigeration equipment according to seasonal harvest demand. Some of the facility equipment is also portable and may be used in other areas depending on geographical & seasonal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000115373,
      "SummaryText": "in 200 yards of the site. WPS supports HAZWOPER 1910.120 (q) and Refrigerating Engineers and Technicians (RETA) training for key Refrigerating Technicians and management personnel. These personnel are available to support Oxnard Fire/CUPA and the facility in the event of an emergency, and staff are on-call 24/7/365. Written procedures that include ammonia specific emergency pre-planning have been developed within the WPS Thirty Minute Plan. Ammonia-specific emergency equipment is maintained at the WPS Service Shop and in WPS Refrigerating Technician's service vehicles. The company strives to execute its accidental release prevention & emergency response policies through appropriately skilled employees that are provided with adequate equipment and training.\n\nA relationship with Oxnard Fire/CUPA has been established. Emergency response pre-planning is coordinated via regular site visits/inspections and submittal of appropriate EPCRA and other compliance reports. Compliance reports and submittals are updated in accordance with applicable requirements at predetermined intervals. Oxnard Fire/CUPA has also participated with WPS in the execution of Process Hazard Analysis at this and other facilities in the Oxnard area. The WPS/Cal West Facility has confirmed that it is included in the Oxnard Community Emergency Plan, and Key Maintenances Technicians receive HAZWOPER Training. \n\n1.2 General Description of the Stationary Source and Regulated Substances\n\nCal West Cooling (CWC) is a facility located in Oxnard, CA in a commercial/industrial area of the city. The facility was built in the early 1970's on what were at that time the outskirts of the city, according to locally adopted codes in effect at that time. Improvements over the years have been made according to codes in effect at the time. Cal West Cooling is 100% owned by Western Precooling Systems but operations are separated: Cal West Cooling manages pre-cooling and refrigerated storage and shipping of fresh produce;"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000115373,
      "SummaryText": "WESTERN PRECOOLING SYSTEMS/CAL WEST COOLING\n\nRISK MANAGEMENT PLAN - PROGRAM LEVEL 3\n5 Year Update 2024\n\n1\tEXECUTIVE SUMMARY\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nThe Western Precooling Systems/Ocean Breeze Cooling (OBC) Accidental Release Prevention and Emergency Response Policies are simply to not have accidental releases or emergencies. The Company endeavors to execute this policy through the daily implementation of its Safety Programs. Company safety programs include but are not limited to a comprehensive Process Safety Management Program (PSM), which is an integrated approach to the safe operation of processes using Regulated Substances. The PSM Program is specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen. It is the goal of the company to protect its employees, visitors, and neighbors from harm due to Company operations.  \n\nA Non-Responding Facility policy has been adopted. However, the Company recognizes the need to be prepared to safely deal with emergencies. A Hazardous Material Business Plan consistent with Emergency Action Plan requirements has been developed and includes emergency procedures, requirements, and information necessary to notify public response agencies and technical resources. The Staff communicate to the Fire Department and evacuate (or shelter-in-place) if there is a release situation or fire. Managers and employees would also shepherd visitors (truck drivers receiving product or delivering product). By effectively determining all persons are safe, the Fire Department can more swiftly manage the tactical part of a response. It is the policy of the company that no-one shall respond to an emergency in a way that is beyond his or her level of training and responsibility.\n\nThe facility is supported by Western Precooling Systems (WPS) for ammonia refrigeration maintenance needs. The WPS Oxnard-area regional office and shop are both with"
    }
  ]
}