{
  "FacilityID": 1000026537,
  "FacilityName": "Wal-Mart Distribution Center #7055",
  "FacilityStr1": "100 Fischer Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Gas City",
  "FacilityState": "IN",
  "FacilityZipCode": "46933",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18053",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "40.476194",
  "FacilityLongDecDegs": "-085.583111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "andy.ellis@wal-mart.com",
  "FacilityDUNS": 51957769,
  "ParentCompanyName": "Wal-Mart Stores Inc.",
  "Company2Name": null,
  "CompanyDUNS": 51957769,
  "Company2DUNS": 0,
  "OperatorName": "Wal-Mart Stores, Inc.",
  "OperatorStr1": "100 Fischer Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Gas City",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46933",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Maintenance Manager",
  "FTE": 786,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198608",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Gas City, IN",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-02-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-02-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-02-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000032464,
      "AltID": null,
      "FacilityID": 1000026537,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000032726,
          "ProcessID": 1000032464,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000039488,
          "ProcessID": 1000032464,
          "ChemicalID": 56,
          "Quantity": 78196.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000539488,
          "ProcessID": 1000032464,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000026537,
      "SummaryText": "WAL-MART DISTRIBUTION CENTER #7055\n\nGas City, Indiana\n\nRISK MANAGEMENT PLAN \n\nExecutive Summary\n\n\n\n\n\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES.\n\n\n\nAt this Wal-Mart Distribution Center (D. C.), we utilize anhydrous ammonia which is considered hazardous by the Environmental Protection Agency (EPA).  The properties which make ammonia valuable as a refrigerant also necessitate certain safety precautions.  Wal-Mart strives to protect all its valuable resources and assets - both personnel and property.  We live and have families in this community.  We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment.  It is our policy to comply with all Federal, State, and Local regulations.  Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases.\n\n\n\nOur emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies.  We work in conjunction with the Grant County Fire Department and the Grant County and Gas City Local Emergency Planning Committees to prepare for necessary notification of all affected neighbors.\n\n\n\n\n\n2.  THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED.\n\n\n\nThe primary purpose of our facility is the temporary storage of refrigerated and frozen foods.  We utilize anhydrous ammonia as the primary means for refrigeration and freezing.  An outside company is used to fill our main receiver tanks.  Piping then carries the ammonia to the needed refrigeration or freezing units.  Access to the site is restricted to facility employees, authorized management personnel and authorized contractors.\n\n\n\nThe regulated substance used at our facility is anhydrous ammonia.  The maximum amount of ammonia stored at this facility is 78,196 pounds.   We have the capacity for more but our policy limits this amount not to exceed IIAR recommendation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000026537,
      "SummaryText": "s.\n\n\n\n\n\n \n\n3.  THE WORST CASE RELEASE SCENARIO(S) AND THE ALTERNATIVE RELEASE SCENARIO(S), INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO.\n\n\n\nWorst Case Scenario\n\nThe worst case scenario would be failure of our largest vessel (Intermediate Pressure Recirculator).  Our policy restricts the maximum capacity of this 43,744 pound tank to 80% of capacity.  The maximum quantity stored in this receiver is 35,103 pounds.   It is assumed that the entire contents are released as a two phase flow (gas and aerosol-ALOHA).\n\nDistance to endpoint: 2.3 miles\n\n\n\nAlternative Scenario\n\nThe alternative scenario would be the release of ammonia due to the failure of a pressure relief valve.  The emergency valves shutdown release would engage and stop the flow and sounds an alarm.  The monitoring system would alert personnel to manually shut the valve.  The maximum time of the release would be 60 minutes and maximum quantity released would be approximately 4,581 pounds of ammonia.  \n\nDistance to endpoint:  0.11 miles (or 189 yards)\n\n\n\n\n\n4.  FIVE-YEAR ACCIDENT HISTORY.\n\n\n\nThis facility opened in 2007.  To date, this Wal-Mart D.C. facility has not incurred a reportable release.\n\n\n\n\n\n5.  THE RMP MANAGEMENT PROGRAM.\n\n\n\nThe management of the RMP program will be handled by the Maintenance Manager.  He/She will administrate in conjunction with the Wal-Mart D. C. management and personnel.  Other entities or organizations that will be coordinated with include the Grant County and Gas City Local Emergency Planning Committees and the Grant County Fire Department.\n\n\n\n\n\n6.  THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS.\n\n\n\nThe Wal-Mart D. C. facility complies with all applicable Federal, State and Local regulations including the EPA?s Accidental Release Prevention Rule.  Our personnel are trained about this during our Hazard Communications Training and through access to our Written Programs.  Our Refrige"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000026537,
      "SummaryText": "ration Maintenance operators receive classroom training and/or plus On-The-Job training (OJT).  They are given written tests and are able to demonstrate proper job skills and knowledge.  Also, the ammonia system is operated, tested and maintained to the standard of International Institute of Ammonia Refrigeration (IIAR), the most stringent standards of the industry.\n\n\n\n\n\n7.  THE EMERGENCY RESPONSE PROGRAM.\n\n\n\nWal-Mart D. C. has onsite Hazardous Materials trained personnel to immediately respond to adverse conditions.  We have monthly meetings as well as annual certification.  This helps minimize the potential of an off-site release. \n\n\n\nWe work very closely with the Grant County Local Emergency Planning Committees and the Storey County Fire Department on emergency preparedness.  We meet periodically with representatives of each to address any changes in the facility or any new concerns.\n\n\n\n\n\n8.  PLANNED CHANGES TO IMPROVE SAFETY.\n\n\n\nCurrently, Wal-Mart D. C. trains and tests all refrigeration technicians.  Our preventative maintenance program is above standard and our total ammonia Process Safety Program is reviewed annually and updated periodically. Our program is improved continuously through annual updates of our written program and annual training of our technicians.  We also take advantage of new technologies when safer and more economical alternatives are available.\n\n\n\nIn December of 1999, Wal-Mart implemented the IIAR training protocol for their refrigeration technicians.  The program consists of classroom training, viewing various training/safety videos and written testing procedures.  The training will be conducted on at least an annual basis."
    }
  ]
}