{
  "FacilityID": 1000059619,
  "FacilityName": "Solar Turbines",
  "FacilityStr1": "4200 Ruffin Road",
  "FacilityStr2": null,
  "FacilityCity": "San Diego",
  "FacilityState": "CA",
  "FacilityZipCode": "92123",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.817321",
  "FacilityLongDecDegs": "-117.128639",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://mysolar.cat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Solar Turbines, Inc.",
  "OperatorStr1": "4200 Ruffin Road",
  "OperatorStr2": null,
  "OperatorCity": "San Diego",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92123",
  "OperatorZipCodeExt": null,
  "FTE": 1600,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215171",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "960991",
  "SafetyInspectionDate": "2016-03-29 00:00:00",
  "SafetyInspectionBy": "Cal-OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-10-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 32.81872,
  "FRS_Long": -117.1258,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074507,
      "AltID": null,
      "FacilityID": 1000059619,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092135,
          "ProcessID": 1000074507,
          "ChemicalID": 93,
          "Quantity": 21000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000075669,
          "ProcessID": 1000074507,
          "NAICSCode": "333611",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000062613,
              "Process_NAICS_ID": 1000075669,
              "SafetyReviewDate": "2015-05-26 00:00:00",
              "PHA_Date": "2018-02-02 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Pipeline Risk Checklist",
              "PHACompletionDate": "2016-08-02 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "External events such as aircrasft, terrorist attack, etc.",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Thermal Oxidizer",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "slope draining",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Fire/Flame Detectors, Hydrocarbon Gas Sensors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-05-16 00:00:00",
              "TrainingReviewDate": "2016-02-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer",
              "MaintenanceReviewDate": "2015-01-26 00:00:00",
              "EquipmentInspectionDate": "2016-07-28 00:00:00",
              "EquipmentTested": "PSU's, Instrumentration",
              "ChangeMgmtDate": "2016-06-03 00:00:00",
              "ChangeMgmtReviewDate": "2015-06-29 00:00:00",
              "PreStartupReviewDate": "2016-05-26 00:00:00",
              "ComplianceAuditDate": "2014-03-19 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2014-12-03 00:00:00",
              "InvestigationChangeDate": "2014-12-14 00:00:00",
              "ParticipationPlansReviewDate": "2015-05-26 00:00:00",
              "HotWorkPermitReviewDate": "2016-06-29 00:00:00",
              "ContractorSafetyReviewDate": "2016-07-26 00:00:00",
              "ContractorSafetyEvalDate": "2016-05-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000076693,
                  "PreventionProgram3ID": 1000062613,
                  "ProcessChemicalID": 1000092135
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059619,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-06-29 00:00:00",
    "ERTrainingDate": "2015-11-03 00:00:00",
    "CoordinatingAgencyName": "San Diego County Department of EHS",
    "CoordinatingAgencyPhone": "8585056858",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000059619,
      "SummaryText": "ent item close-out. The recommendations are tracked on a master spreadsheet maintained on the facility intranet."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059619,
      "SummaryText": "ies with the California Occupational Safety and Health Administration (CalOSHA), Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR), the EPA Risk Management Program (RMP), and the California Emergency Management Agency (Cal EMA) California Accidental Release Prevention (CalARP) Program.\r\n\r\nThe GCTF system was constructed in accordance with all applicable federal, state and local regulations at the time of construction (2010) .  These standards outline requirements for occupancy classification, GCTF system classification, natural gas (methane) classification, requirements for natural gas (methane) use, design and construction of equipment systems, pressure limiting devices, pressure relief protection, installation requirements, and field pressure tests. Monitoring systems in the facility are comprised of pressure, temperature and level indicators, inspections, as well as other system safeguards. Level indicators are located on the Cooling Tower.  Pressure indicators are located on process equipment and throughout the system. The level and pressure indicators allow operators to monitor system operations and to determine potential adverse situations in the event of deviations from standard or acceptable operating conditions. In addition, the natural gas (methane) system at the facility is controlled and monitored using the following:\r\n\r\n¿\tinspections;\r\n¿\tpreventive maintenance;\r\n¿\tpersonnel training; and\r\n¿\tincident investigations.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe GCTF process commenced operations as a regulated process on November 15, 2011.  Solar Turbines, Inc. has been using methane in the Fuel Consumption Process which was exempted from the EPA RMP and CalARP Program regulations on January 23, 2000.  An investigation into the facility's accident history associated with the existing (but previously exempt) supply side process revealed that there had been no reportable releases of methane over the past five years (August 2011 to August 2016)."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059619,
      "SummaryText": "EMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has an Emergency Response and Evacuation Plan (Plan) in effect.  This Plan was designed to meet the following objectives:\r\n\r\n- save lives;\r\n- minimize and avoid injuries;\r\n- protect the environment; and\r\n- minimize property damage.\r\n\r\nThe Plan provides the response organization and notification procedures, evacuation routes, chemical health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  \r\n\r\nSolar Turbines, Inc. maintains a Safety Team Leaders and Safety Leadership Committees whose members are the Solar Turbines, Inc. employees and management.  Additionally, Solar Turbines, Inc. - Kearny Mesa maintains Designated Emergency Responders (DERs), Evacuation Team, HAZMAT Team, and Security Team.  The Security Team is present at the facility 24 hours per day, 7 days per week.\r\n\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Process Hazard Analysis Revalidation for the Supply and GCTF processes at the Solar Turbines, Inc. facility located in San Diego, California was completed over the following sessions:\r\n \r\n- August 12-14, 2014: PHA for Cooling Tower and GCTF was revalidated per the 5 year requirement\r\n- July 21-22, 2015: PHA for Thermal Oxidizer / Gas Compressor  was revalidated per the 5 year requirement\r\n- August 1-2, 2016: PHA for GCTF was updated to include an additional test loop\r\n\r\nThese analyses resulted in many mitigation measures to improve safety and operations associated with the Methane Supply and GCTF processes. The mitigation measures included verification of system shutdown alarms and interlocks, preparation of alarm logic and associated procedures, personnel training associated with facility safety procedures and GCTF process, and establishing maintenance procedures and schedules for new equipment. The Safety Engineer is responsible for assembling the appropriate personnel to complete each recommendation and to docum"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059619,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nHeadquartered in San Diego, California, USA, Solar Turbines Incorporated, a subsidiary of Caterpillar Inc., is one of the world's leading manufacturers of industrial gas turbines, with more than 13,900 units and over 1.7 billion operating hours in 98 countries.\r\n\r\nSolar's foundation is people and Solar's culture is one where individual contributions are valued, diversity in the workplace is encouraged, and safety is emphasized in all aspects of the business. Solar Turbines is comprised of a dedicated and multi-talented workforce of more than 7,000 employees with decades of experience working as a global team.\r\n\r\nAll of Solar's facilities place high priority on environmental health and safety performance. High priority areas include Pollution Prevention and Waste Reduction and many of Solar's facilities have received awards for safety and environmental management.\r\n\r\nThe Solar Turbines, Inc. management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Solar Turbines, Inc.'s safety and environmental policies are administered by the Human Resources Director and/or Manager of EHS, who ensures that periodic inspections of the facility to verify compliance, and oversees the entire safety and environmental programs, including the PSM/RMP/CalARP Programs. \r\n\r\nIn the event of a natural gas release, the facility will evacuate.  The facility is a non-responding facility, and will call the Fire Department to respond to any natural gas releases at the facility.  The Solar Turbines, Inc. Security Department is responsible for activating the alarm systems to notifying all facility personnel, locating and/or notifying the Emergency Coordinator/designee, notifying Corporate EHS, notifying proper agencies, contacting and communicating with the emergency responders, determinin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059619,
      "SummaryText": "g the extent of the problem, and evaluating the need for an evacuation and/or shut-down.  The Emergency Coordinator/designee will be the on-scene commander at an incident and will participate in the responsibilities assigned to Solar Turbines, Inc. Security.  The Emergency Coordinator evaluates the need for containment, reviews spill clean-up, evaluates the need for evacuation, and reviews follow-up procedures in the event of an accident.  The Corporate EHS is responsible for notifying appropriate government agencies.  All managers are responsible for ensuring personnel has evacuated.  The Emergency Assembly Area Leaders (AA Leaders) are responsible for performing head counts and reporting missing persons to the Facility Incident Coordinator.  The Designated Emergency Responders (DERs) are responsible for assisting an ill or injured co-worker.  The DERs are first-aid and CPR-trained.\r\n\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Solar Turbine, Inc. facility is located at 4200 Ruffin Road in San Diego, California.  The facility is approximately 0.9 miles west of Interstate 15 with the western property line bordering Montgomery Field.  The area immediately surrounding the facility is urban and largely populated with Solar Turbines, Inc. test facilities and offices.  \r\n\r\nSolar Turbines, Inc. (Solar) has a Gas Compression Test Facility (GCTF) to develop and test gas compressors. The GCTF operates with nitrogen, carbon dioxide or odorized natural gas (methane) to test solar gas compressors. The regulated material present at the facility and the focus of this study is methane. The GCTF system is interconnected with the underground methane supply pipeline from SDG&E distribution system to the on-site storage, the 30,000-gallon Storage Tank, the pipeline delivery system, the Plant Fuel Consumption, and the Thermal Oxidizer.  The Fuel Consumption process is exempt from the EPA RMP and CalARP Program regulation per regulations established on January 23, 2000.  Thus,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059619,
      "SummaryText": "covered process includes the methane supply line from SDG&E, the 30,000-gallon Storage Tank, the pipeline delivery system, the GCTF, and the Thermal Oxidizer.  The maximum intended inventory of methane at Solar Turbines, Inc. is 21,000 pounds.\r\n\r\nMethane / ordorized natural gas from SDG&E distribution piping enters the facility and is stored in the 30,000-gallon Storage Tank.  The GCTF is interconnected to the main pipeline supply from the 30,000-gallon Storage Tank and the Fuel Consumption process.  Once the GCTF is prepared for operation, the procedure will be to open and valve off the main 650 psig feed line to the GCTF process piping.  \r\n\r\nThe GCTF consists of an existing SOLAR gas turbine driving a SOLAR gas compressor and all necessary equipment to conduct a closed loop test. The GCTF will operate with nitrogen, carbon dioxide or odorized natural gas (methane) to test solar gas compressors. The original GCTF loop estimated volume is 2,300 cubic feet. In 2016 construction of a second loop was completed that has an estimated volume of 1,500 cubic feet. Only one loop will be run at a time. The weight of natural gas in the process is not expected to exceed 13,000 pounds. \r\n\r\nThe GCTF system has a series of valves some automated and some manual. The manual valves are not used during testing. Once the GCTF is pressurized, the inlet valve will be closed.  Once testing is complete, the methane is destroyed at the Plant Thermal Oxidizer.  \r\n\r\nThe GCTF has been designed using recognized standards and codes. It is designed to ensure that all personnel are in a safe environment at all times. Piping and equipment are equipped with control logic, instrumentation, and mechanical safety systems, such as multiple levels of safety instrumentation to operate and shutdown safely under all expected or foreseeable situations.\r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\r\n\r\nIn order to operate the natural gas (methane) system, the facility compl"
    }
  ]
}