{
  "FacilityID": 1000011519,
  "FacilityName": "Tops Frozen Distribution Center",
  "FacilityStr1": "5000 North American Drive",
  "FacilityStr2": null,
  "FacilityCity": "West Seneca",
  "FacilityState": "NY",
  "FacilityZipCode": "14224",
  "Facility4DigitZipExt": "2254",
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.842500",
  "FacilityLongDecDegs": "-078.722778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.alliedfrozenstorage.com",
  "FacilityEmailAddress": "jmills@alliedfrozenstorage.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tops Markets, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tops Markets, LLc",
  "OperatorStr1": "124 Taylor Drive",
  "OperatorStr2": "P. O. Box 1027",
  "OperatorCity": "Buffalo",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14043",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kevin Darrington",
  "RMPTitle": "EVP of Supply & IT",
  "FTE": 85,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028739",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-03-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-11-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-11-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-11-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.84417,
  "FRS_Long": -78.73033,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013771,
      "AltID": "Ammonia refrigeration sys",
      "FacilityID": 1000011519,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014135,
          "ProcessID": 1000013771,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015798,
          "ProcessID": 1000013771,
          "ChemicalID": 56,
          "Quantity": 13600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515798,
          "ProcessID": 1000013771,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011519,
      "SummaryText": "Allied Frozen Storage, Inc.\n\n\n\nWest Seneca  SITE\n\n\n\nEXECUTIVE SUMMARY OF\n\n THE EPA RISK MANAGEMENT PLAN \n\n\n\nTops Markets, LLC acquired this facility on August 1, 2016.\n\nTop Markets, LLC Management has elected to implement the requirements of the Risk Management Plan at this facility in accordance with regulations and support of best industry standards.  The ultimate objective is to minimize the risk of an accidental ammonia release.  The facility management has developed an Emergency Response Plan along with training to ensure a fast and efficient response in the event of an accidental hazardous material release, fire or other emergency situation.\n\n\n\nIn order to prevent a potential accidental ammonia release at any Atlas Cold Storage facilities, the Company has an ongoing review process for design and operating procedures.  This assists in ensuring the refrigeration systems comply with OSHA, EPA and all other local, state and federal regulatory agency safety standards, as well as its own internal standards.\n\n\n\nTop Markets, LLC has a rigorous emergency response training program that follows the guidelines of federal, state and local regulatory agencies.  The management believes that cooperative emergency response training must include company employees, local emergency responders and regulatory agency people in order to provide a safe workplace and a safe environment.  In an emergency, all personnel are trained to cooperate with fellow employees and other support personnel as directed by the Emergency Response Incident Commander. \n\n\n\nTops Markets, LLC West Seneca is a refrigerated warehousing facility. The large majority of products stored are refrigerated foods for human consumption and inherently pose no known environmental or safety risks.  Ammonia, a regulated substance, is the commonly used refrigerant in industrial grade refrigeration systems that maintain low storage temperatures and can be safely managed by trained operators.  The ammonia refrigeration proces"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011519,
      "SummaryText": "s functions within a closed piping network serving the facility operations.  The refrigeration system in this facility contains approximately 13,600  pounds of ammonia inventory for this process.\n\n\n\n\n\nTops Markets, LLC is committed to safe management and operation of the closed Ammonia Refrigeration System.  Maintenance employees are trained to observe operational procedures designed to be as fail-safe as possible to prevent accidental release of ammonia at any time.  Should any accidental release occur, all maintenance employees are certified Emergency Hazardous Material Responders and are required to observe safe emergency response procedures.  They are trained to work in conjunction with the local Emergency Planning Commission to minimize the impact of any accidental releases.\n\n\n\nAs part of Top Markets, LLC safety programs, we have adopted the OSHA Process Safety Management Plan as an integral part of our base safety manual.  The OSHA PSM Program has been implemented and covers the entire scope of safe operation procedures of the ammonia refrigeration system from start-up and normal operations to potential emergency response operations and subsequent clean-up and restoration of systems.  Normal operations rely on the following:\n\n\n\nA? The Maintenance Management Procedures are used to perform preventative\n\n maintenance and to maintain records of all maintenance work performed.  This\n\n helps to ensure that the closed ammonia system continues to work safely,\n\n reliably and efficiently in the originally intended manner.\n\n \n\nA? Any set specifications of systems temperature, pressure, level or power \n\n interruption, that are exceeded or violated will normally trigger an alarm and\n\n safety shutdown.  Maintenance technicians are notified of a deviation from\n\n normal operational specifications through indicator or alarm systems.\n\n \n\nA? In the event of deviations, technicians are trained to analyze the situation,\n\n follow personal safety procedures at all times, determine t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011519,
      "SummaryText": "hat everything\n\n is under control and correct problems and/or deviations.\n\n \n\nA? If a problem cannot be corrected immediately, the equipment needing\n\n repair service will be safely locked out of service until such time as\n\n repairs have been completed.\n\n -3-\n\n \n\nA? If a problem cannot be safely handled by the Maintenance Personnel, procedures are in place to obtain the required resources to correct the situation.\n\n \n\n \n\n During the past five years  there have been no accidental releases at this facility.\n\n \n\n \n\n EMERGENCY RESPONSE OPERATIONS READINESS INCLUDES THE THE FOLLOWNG PROGRAMS:\n\n \n\nA? Written procedures for emergency operations include emergency evacuation\n\n procedures, emergency shutdown instructions, emergency response training\n\n expectations, emergency response unit coordination plans, regulatory agency\n\n notification and other pertinent information.\n\n \n\nA? The Emergency Response Plan is for managing emergency responses.  It\n\n identifies response teams, assigns specific emergency tasks to each team,\n\n provides emergency contact information and sets up procedures for recovery\n\n of information systems.  It also provides forms for logging emergency\n\n operations from beginning to end of these operations and forms to facilitate\n\n a systematic incident investigation and corrective measures to prevent\n\n recurrence of a similar incident.\n\n \n\nA? The Emergency Response Training program includes all maintenance\n\nemployees and local emergency responders.  This establishes an effective\n\nand informed emergency response team that is familiar with systems and\n\npotential hazards.\n\n\n\nIt is the intent of Tops Markets, LLC to not only meet any regulatory requirement, but also take a pro-active approach into implementing these requirements as part of a working safety plan.  Tops Markets, LLC is in a constant review process of its operations and industry standards to provide a safe working environment for our employees, customers and neighbors."
    }
  ]
}