{
  "FacilityID": 1000084229,
  "FacilityName": "Houston Ammonia Terminal, L.P.",
  "FacilityStr1": "4403 Highway 225",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Southeast Regional LEPC",
  "FacilityLatDecDegs": "29.7330972",
  "FacilityLongDecDegs": "-95.1501416",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 613541069,
  "ParentCompanyName": "Southern Ionics Incorporated",
  "Company2Name": "PCS Nitrogen Ammonia Terminal Corporation 1",
  "CompanyDUNS": 49109440,
  "Company2DUNS": 605002864,
  "OperatorName": "Houston Ammonia Terminal, L.P.",
  "OperatorStr1": "P. O. Box 46",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77501",
  "OperatorZipCodeExt": "0046",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000101285",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-11-15 00:00:00",
  "SafetyInspectionBy": "Railroad Commission of Texas",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-01-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-09-12 00:00:00",
  "DeRegistrationEffectiveDate": "2022-07-11 00:00:00",
  "AnniversaryDate": "2025-01-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.733097,
  "FRS_Long": -95.150142,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "50000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105211,
      "AltID": "Marine Cargo handling",
      "FacilityID": 1000084229,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131738,
          "ProcessID": 1000105211,
          "ChemicalID": 56,
          "Quantity": 60040000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000131739,
          "ProcessID": 1000105211,
          "ChemicalID": 57,
          "Quantity": 385000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000106541,
          "ProcessID": 1000105211,
          "NAICSCode": "48832",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000089196,
              "Process_NAICS_ID": 1000106541,
              "SafetyReviewDate": "2019-10-30 00:00:00",
              "PHA_Date": "2015-03-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-03-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hand held monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-10-30 00:00:00",
              "TrainingReviewDate": "2019-10-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-10-30 00:00:00",
              "EquipmentInspectionDate": "2019-09-10 00:00:00",
              "EquipmentTested": "Ammonia Pipeline",
              "ChangeMgmtDate": "2019-02-18 00:00:00",
              "ChangeMgmtReviewDate": "2019-11-25 00:00:00",
              "PreStartupReviewDate": "2016-06-22 00:00:00",
              "ComplianceAuditDate": "2019-11-15 00:00:00",
              "AuditCompletionDate": "2020-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-11-25 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-30 00:00:00",
              "ContractorSafetyReviewDate": "2019-09-07 00:00:00",
              "ContractorSafetyEvalDate": "2019-09-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000111003,
                  "PreventionProgram3ID": 1000089196,
                  "ProcessChemicalID": 1000131738
                },
                {
                  "PrimaryKey": 1000111004,
                  "PreventionProgram3ID": 1000089196,
                  "ProcessChemicalID": 1000131739
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084229,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-11-25 00:00:00",
    "ERTrainingDate": "2019-11-16 00:00:00",
    "CoordinatingAgencyName": "Southeast Regional LEPC",
    "CoordinatingAgencyPhone": "7134757088",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084229,
      "SummaryText": "ees will be evaluated and compensation will be based, in part, on their effectiveness in implementation of this policy.\r\n\r\nThe Company will defend and indemnify any employee charged with health, safety or environmental offenses when the Company determines that the employee has acted in good faith to comply with this policy.\r\n\r\nDisclosure\r\nIt is the policy of the Company to make relevant disclosure, consistent with all laws, regulations and this policy to its employees, and to the public, of incidents relating to its operations that cause environmental harm or pose health or safety hazards. \r\n\r\nCommitment of Resources\r\nThe Company will commit resources to implement this policy and to monitor and sustain a process to ensure that Parent Company Management is kept informed of all health, safety and environmental matters.\r\n\r\nSelf-Evaluation\r\nThe Company, or its designee, shall conduct an annual self-evaluation to assess the Company's status regarding implementation of this policy.\r\n\r\nHAT consists of two 15,000 ton atmospheric ammonia storage tanks, associated refrigeration equipment and transfer equipment.  The terminal receives, by barge and ship, approximately 175,000 tons of anhydrous ammonia each year, which is stored and transferred by truck and pipeline to various end users.  The terminal operates 7 days per week and 24 hours per day.  Operational and maintenance personnel constantly monitor and maintain process equipment.  The terminal conducts drills and personal hygiene monitoring to maintain emergency response readiness.  HAT maintains the ongoing integrity of the process equipment through preventive maintenance and inspections.  Strict guidelines have been established, through the Process Safety Management Regulations, to maintain equipment in accordance with applicable federal, state, and local codes and regulations.\r\n\r\nHAT's safety and environmental exemplary record reflects this commitment.  We have multiple layers of safety and environmental protection in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000084229,
      "SummaryText": "ersion 5.0.3)."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084229,
      "SummaryText": "RMP EXECUTIVE SUMMARY - Houston Ammonia Terminal, L.P. Facility ID:  1000 0010 1285\r\n\r\nHouston Ammonia Terminal, L.P. (HAT) is a joint venture between Southern Ionics Incorporated and PCS Nitrogen Ammonia Terminal Corporation 1.  \r\n\r\nHAT is committed to safety and the environment and stands behind the commitment with the following company policy.\r\n\r\nHAT and its employees have an enduring commitment to protecting health, safety and the environment.  In order to document that commitment, the Company has authorized a Health, Safety and Environmental Statement of Policy.\r\n\r\nLaws, rules and regulations in the area of health, safety and the environment impose responsibilities on the Company and its employees.  An additional purpose of this policy is to set forth the principles, under which those responsibilities are to be fulfilled, thereby providing appropriate protection for employees, as well as the Company.\r\n\r\nEmployee Health and Safety\r\nWorkplace health and safety are of paramount concern.  The Company and its employees are expected to be aware of and adhere to laws, regulations, company policy and procedures designed to ensure safe and healthy workplace conditions and practices.\r\n\r\nContractors and Visitor Health and Safety\r\nAll contractors working in the company facility or visitors to company facilities are expected to be aware of and adhere to all company health, safety and environmental policies and procedures.  The Company may conduct, or require proof of, appropriate training.\r\n\r\nEnvironment\r\nIn all its activities, the Company will remain sensitive to environmental concerns and the need for sound environmental practices.  The Company and its employees are expected to be aware of and adhere to laws, regulations, company policy, and company procedures designed to ensure that the Company's activities are in compliance with all federal, state and local environmental laws and regulations.\r\n\r\nMinimization of Risks and Releases to the Environment and Conservation of N"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084229,
      "SummaryText": "atural Resources\r\nIt is the policy of the Company to minimize the environmental, health and safety risks to its employees and the communities in which it operates, to minimize releases to the environment, to conserve natural resources through efficient use and careful planning, to recycle materials whenever technically and economically feasible, and to dispose of wastes in a manner determined to be environmentally sound.\r\n\r\nCompliance with Laws\r\nThe activities of the Company and its employees are expected to be in full compliance with all applicable laws, rules and regulations relating to health, safety and the environment.\r\n\r\nAssistance to Government\r\nIt is the policy of the Company to participate with all levels of government in the development of equitable and effective health, safety and environmental laws, rules and regulations.\r\n\r\nEmployee Training\r\nIt is the Company's continuing policy to inform and educate each employee regarding health, safety and environmental laws and regulations applicable to his or her job.  Through such training, the employee is responsible for learning and maintaining knowledge of the health, safety and environmental duties of his or her job.\r\n\r\nInternal Reporting by Employees\r\nEmployees must be alert to the presence of unsafe conditions or violations of environmental law and shall report these to designated managers.  It is the policy of the Company that no retaliatory action will be taken against any employee for good faith reporting consistent with this policy.\r\n\r\nCompliance\r\nCompliance with this policy is an ongoing duty of each employee and compliance will be monitored.  Each employee is obligated to report immediately to designated managers any failure to comply with this policy.\r\n\r\nEmployees who violate this policy are subject to disciplinary action, up to and including discharge.\r\n\r\nFull compliance with the intent and purpose of this policy requires that employees be diligent within the scope of their responsibilities.  Employ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084229,
      "SummaryText": "side the facility, personnel injury or fatality, and equipment failures.  The plan also designates the type and frequency of training that each person is required to have depending on their responsibilities.  Furthermore, the plan commits the management team to devote the necessary resources to prepare, implement and audit the ERP.\r\n\r\nAlthough HAT's ERP is specifically written for the HAT facility, the plan is also part of the countywide emergency response plan organized with the local LEPC.  All these plans are reviewed with representatives of the LEPC, State Police, Sheriff's Department, Fire Departments, regulatory agencies and industry.\r\n\r\nThrough our ongoing implementation of the PSM/RMP program, HAT looks continuously for possible operational or administrative changes to improve safety in our facility.  HAT is striving on a daily basis to make the facility as safe as possible for the employees, contractors and the community.  Every employee and contractor will attend numerous safety and/or environmental training meetings annually.  HAT and its employees have an enduring commitment to protecting health, safety and the environment and our success is accomplished by research, innovation and the use of good common sense.\r\n\r\nHAT has performed the offsite consequence analysis (OCA) per the requirements of 40 CFR Part 68, Subchapter B.  The Worst-Case Toxic scenario is defined as the total release of one of the bulk anhydrous storage tanks.  EPA's RMP*COMP (web version) was utilized to obtain the predicted radius to the toxic endpoint; however, the program is limited to a release of 7,500,000 pounds for ammonia liquified by refrigeration, which is less than the release scenario of 30,000,000 pounds.  Per guidance from the EPA, the endpoint determination was obtained by specifying that the ammonia was liquified under pressure and specifying a release of 30,000,000 pounds as required.   Population estimates for the OCA were determined using NOAA/EPA MARPLOT software (V"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084229,
      "SummaryText": "place at our plant to protect our employees and the community.  The following covers some of these layers of protection:\r\n\r\n*Managing risks is something we do on a daily basis.\r\n\r\n*We have worked for many years to reduce risks at our site and to be prepared for emergencies.\r\n\r\n*Our employees are highly skilled and well trained.\r\n\r\n*Our equipment is routinely inspected and tested to make sure it is safe.\r\n\r\n*We have monitors and controls in the process throughout our facility to detect potential leaks or releases before they occur.\r\n\r\n*Hazard reviews are also conducted at the terminal.\r\n\r\n*Emergency response, including employee responders, as well as off-site responders like LEPC, State Police and HAZMAT, add another layer of protection to the community.\r\n\r\n*We work closely with the police and fire departments, and we conduct routine drills.\r\n\r\n*In the event of an emergency, we are prepared to respond.\r\n\r\nHAT has not had any accidental releases, as defined by the Risk Management Program regulations, for the last 5 years.  The releases that HAT has had in the past 5 years are typically very small releases in nature to the air and do not meet the criteria that is stipulated in the regulations.\r\n\r\nHAT has an extensive emergency response program both within the facility and within the community.  Within the facility there is a written Emergency Response Plan (ERP).  The ERP is designed as a guide to help in determining the magnitude of an incident, the steps needed to bring the incident under control, and the requirements to ensure that all the federal, state, and local laws are complied with.  The ERP is a definitive plan that assigns responsibilities, defines several different methods of communication, assigns control centers and safe havens, designates evacuation procedures, and coordinates with outside assistance.  The plan has detailed action plans that specifically address incidents concerning chemical spills, fire, acts of nature, civil strife, area risks from out"
    }
  ]
}