{
  "FacilityID": 1000071498,
  "FacilityName": "Shoal Creek Filter Plant",
  "FacilityStr1": "1755 Buford Dam Road",
  "FacilityStr2": null,
  "FacilityCity": "Buford",
  "FacilityState": "GA",
  "FacilityZipCode": "30518",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13135",
  "LEPC": null,
  "FacilityLatDecDegs": "34.147000",
  "FacilityLongDecDegs": "-84.042800",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.gwinnettcounty.com/portal/gwinnett/Departments/PublicUtilities",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DWR Gwinnett County",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DWR Gwinnett County, GA",
  "OperatorStr1": "1755 Buford Dam Road",
  "OperatorStr2": null,
  "OperatorCity": "Buford",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30518",
  "OperatorZipCodeExt": null,
  "RMPContact": "Pierce Freeman",
  "RMPTitle": "Water resources Division Director",
  "FTE": 24,
  "OtherEPAFacilityID": "GA1350004",
  "EPAFacilityID": "100000185505",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-01-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-07-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-07-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-07-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.145,
  "FRS_Long": -84.0425,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089554,
      "AltID": null,
      "FacilityID": 1000071498,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000090776,
          "ProcessID": 1000089554,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112022,
          "ProcessID": 1000089554,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000612022,
          "ProcessID": 1000089554,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071498,
      "SummaryText": "Chlorine is used as a disinfectant at the Shoal Creek Filter Plant to protect consumers from potentially harmful microorganisms (such as Giardia, Legionella, coliforms, viruses, etc.) that may be present in the raw water supply (Lake Lanier).  Although the use of chlorine has been known to produce various regulated disinfection by-products in the finished water, the use of chlorine is required by the Safe Drinking Water Act and by the Georgia Environmental Protection Division (GAEPD).  Disinfection by-products associated with chlorine are below the regulated levels as regulated by the Stage 1 and Stage 2 Disinfectants/Disinfection By-Products Rule and water quality criteria established by the Georgia Environmental Protection Division. \n\n  \n\nThis RMP provides process safety information, process hazard analysis, employee training, standard operating procedures, safe work practices, information on the contractor safety program, and emergency response related to the Shoal Creek Filter Plant chlorine system.  \n\n\n\nThe chlorine gas system at the Shoal Creek Filter Plant is original to its 2003 construction.  The latest improvements were made in 2016 to provide a safer system including automatic shut-off valves and individual regulators on each chlorine container. Our system is still in an enclosed storage area with protection of an emergency scrubber system that was recently expanded to a capacity of 6300 lbs.  Chlorine application points have not been changed since the plant was built. The Shoal Creek Filter Plant process safety management program and the RMP reflect the entire upgraded chlorine system. \n\n\n\nChlorine is delivered to the Shoal Creek Filter Plant in one-ton chlorine containers by a chemical supplier.  The chlorine containers, which are in service, are connected to a vacuum pipeline system (designed exclusively for the transport of chlorine gas) and delivered to four chlorinators.  The chlorinators operate under vacuum conditions and deliver chlorine gas to a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071498,
      "SummaryText": " chlorine injector.  The injector mixes the chlorine gas into a water stream that makes a concentrated chlorine solution.  The chlorine solution is then applied to the appropriate application points in the water treatment process to insure adequate disinfection is provided as required by the Surface Water Treatment Rule.  A chlorine residual is maintained in the distribution system to protect the distribution from potential outside contamination and to control microbial populations throughout the transmission system.    \n\n\n\nAccidental chlorine releases can be caused by a multitude of reasons.  In the event of a chlorine release (either small or large) employees are routinely trained on how to safely contain chlorine releases utilizing the Chlorine Institute Chlorine Repair B-kit apparatus.  The plant also has a detailed standard operating procedure (SOP) that clearly identifies how to unload chlorine containers, hook up chlorine containers, startup the chlorinators, and how to disconnect chlorine containers.  In addition to the above, plant computers continuously monitor gas detector alarms via SCADA and employees are required to conduct walk through inspections of the chlorine facilities 4 times a day (every 6 hours) to document issues for immediate repair by our maintenance staff.  \n\n \n\nIn the event of a chlorine gas release, an emergency response plan has been developed that identifies the operational and administrative procedures used to evaluate the safety risk to our plant staff and the surrounding residents and determine if a plant evacuation or public notification is necessary.  The plan addresses the procedures for responding to minor and major chlorine releases and describes safety plans for the employees, contractors, and visitors, at the Shoal Creek Filter Plant.  \n\n\n\nThere have been no accidental releases of chlorine in the past five years. \n\n"
    }
  ]
}