{
  "FacilityID": 1000021431,
  "FacilityName": "Benton Separation Facility",
  "FacilityStr1": "Cycle Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Benton",
  "FacilityState": "LA",
  "FacilityZipCode": "71006",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22015",
  "LEPC": "Bossier-Caddo Parish LEPC",
  "FacilityLatDecDegs": "32.744575",
  "FacilityLongDecDegs": "-093.656022",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Samson Contour Energy E&P, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Samson Resources",
  "OperatorStr1": "4915 Shed RD",
  "OperatorStr2": null,
  "OperatorCity": "Bossier City",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71111",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195059",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-04-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-03-10 00:00:00",
  "DeRegistrationEffectiveDate": "2019-12-09 00:00:00",
  "AnniversaryDate": "2016-04-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.744575,
  "FRS_Long": -93.656022,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025965,
      "AltID": "Refrigeration Plant",
      "FacilityID": 1000021431,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030869,
          "ProcessID": 1000025965,
          "ChemicalID": 155,
          "Quantity": 45437.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 104006,
              "ProcessChemicalID": 1000030869,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 104007,
              "ProcessChemicalID": 1000030869,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 104008,
              "ProcessChemicalID": 1000030869,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 104009,
              "ProcessChemicalID": 1000030869,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 104010,
              "ProcessChemicalID": 1000030869,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 104011,
              "ProcessChemicalID": 1000030869,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000026347,
          "ProcessID": 1000025965,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000017870,
              "Process_NAICS_ID": 1000026347,
              "SafetyReviewDate": "2013-03-14 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API",
              "FR_Comments": null,
              "HazardReviewDate": "2013-03-14 00:00:00",
              "ChangeCompletionDate": "2013-05-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Level switch for operator callout",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-03-14 00:00:00",
              "TrainingReviewDate": "2008-07-23 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-03-14 00:00:00",
              "EquipmentInspectionDate": "2013-07-29 00:00:00",
              "EquipmentTested": "compressor unit, refrigeration unit",
              "ComplianceAuditDate": "2013-07-15 00:00:00",
              "AuditCompletionDate": "2013-11-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2013-07-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000018156,
                  "PreventionProgram2ID": 1000017870,
                  "ProcessChemicalID": 1000030869
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000021431,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Benton Fire District 4",
    "CoordinatingAgencyPhone": "3189659454",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021431,
      "SummaryText": "Executive Summary\n\nBENTON SEPARATION FACILITY RISK MANAGEMENT PLAN:  EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nSamson Contour Energy E&P, LLC (Samson) has a long-standing commitment to workers and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facilityÂ¿s processes.  The Samson policy is to implement reasonable controls to prevent foreseeable releases of substances.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nSamson operates the Benton Separation Facility located in Bossier Parish, Louisiana.  Benton is a natural gas processing plant that produces liquefied natural gas (LNG) by mechanical refrigeration with water removal by glycol dehydration.  The LNG, a mixture of ethane, propane, butanes, pentanes, hexanes, and C6+ compounds, is stored in a pressurized bullet tank for transportation by truck.  A level switch is installed on the bullet tank, which provides a shut in on the compressor and refrigeration unit and calls out the operator in the event of a high level situation.  Condensate and produced water is also stored onsite prior to transportation from the site via tanker trucks.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention (ARP) Program, Benton is a Program 2 RMP process.\n\nOperations at Benton were evaluated to determine if any regulated flammable or toxic substances were present in the process and if they exceeded the threshold quantity.  All equipment and vessels are considered to be connected and/or co-located; consequently, for the purposes of the ARP Program, all equipment and vessels are part of a single process.  The identification of even a single vessel exceeding threshold quantities of a regulated flammable or toxic substance would subject a process to threshold determination for offsite"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021431,
      "SummaryText": "consequence analysis.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nBenton has not had any accidental releases which meet the criteria outlined in 40 CFR 68.42(a).\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at Benton:  \n\nEmployee Participation\n\nSamson actively encourages all employees and contract employees to participate in creating a safe work environment.   This participation begins with well-established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining RMP rule compliance based on their knowledge, skill, job responsibilities, and experience.  \n\nProcess Safety Information \n\nSamson maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as key process parameter limits and equipment design basis/configuration information.    \n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDSs).  In addition, the plant has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\n\nHazard Review and Analysis\n\nSamson has a comprehensive program to ensure that hazards associated with the process are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nSamson primarily uses the checklist method to perform these evaluations.  The checklist used in the Hazard Review was provided by persons knowledgeable about the process.  Based on the answers to the questions, consequences and preliminary recommendations can be determine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021431,
      "SummaryText": "d.\n\nThe Hazard Review findings are promptly and systematically addressed.  Samson assures that the recommendations are documented and resolved in a timely manner. This documentation includes the actions to be taken and a written schedule of completion dates.   All Hazard Review findings are communicated with Samson employees and contractors that may be affected. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years by the Hazard Review team.  \n\nOperating Procedures\n\nThe Benton facility maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are periodically reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary. \n\nTraining\n\nTo complement the written process operating procedures, Samson has implemented a comprehensive training program for all employees. New employees receive job specific basic training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\n\nMechanical Integrity\n\nSamson has well-established programs, procedures and practices that are required to ensure that equipment used to process, store, or handle flammable material is designed, constructed, installed, and maintained to minimize the risk of a r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021431,
      "SummaryText": "elease. Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e., monitoring devices, sensors, alarms, and interlocks).\n\nMaintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employeeÂ¿s job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to ensure safe operation.\n\nIncident Investigation\n\nSamson promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is led by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. \n\nEmergency Planning and Response\n\nEmergency Response activities for the Benton facility are coordinated with the local fire department and LEPC.  In the case of an accidental release, the Samson employee will activate the emergency shutdown system if possible and evacuate upwind of the release.  They will immediately notify the local fire department who will then respond to the emergency.\n\nCompliance Audits\n\nTo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000021431,
      "SummaryText": "ensure that the accident prevention program is functioning properly, Samson periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  The audit team includes those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions which are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nSamson is committed to operating the Benton facility in a safe manner for workers, the public, and the environment.  Samson personnel have an opportunity to make suggestions that could improve the safety of this facility during regional safety meetings.  Samson will also conduct compliance audits and hazard reviews as required and make improvements to safety based on findings of the audits and reviews."
    }
  ]
}