{
  "FacilityID": 1000117425,
  "FacilityName": "CYTEC INDUSTRIES INC - Willow Island Plant",
  "FacilityStr1": "#1 Heilman Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Willow Island",
  "FacilityState": "WV",
  "FacilityZipCode": "26134",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54073",
  "LEPC": "Pleasants County LEPC",
  "FacilityLatDecDegs": "39.356393",
  "FacilityLongDecDegs": "-081.30879",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809749948,
  "ParentCompanyName": "Syensqo SA",
  "Company2Name": null,
  "CompanyDUNS": 372787070,
  "Company2DUNS": null,
  "OperatorName": "CYTEC INDUSTRIES INC",
  "OperatorStr1": "#1 Heilman Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Willow Island",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26134",
  "OperatorZipCodeExt": null,
  "FTE": 189,
  "OtherEPAFacilityID": "26190MRCNCSTRT2",
  "EPAFacilityID": "100000106253",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "03-54-07300003",
  "SafetyInspectionDate": "2017-05-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-08-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-08-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-08-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.355575,
  "FRS_Long": -81.299838,
  "FRS_Description": null,
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000146395,
      "AltID": "P2930",
      "FacilityID": 1000117425,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000182940,
          "ProcessID": 1000146395,
          "ChemicalID": 4,
          "Quantity": 89000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000148008,
          "ProcessID": 1000146395,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000125204,
              "Process_NAICS_ID": 1000148008,
              "SafetyReviewDate": "2024-08-22 00:00:00",
              "PHA_Date": "2024-08-26 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-07-31 00:00:00",
              "TrainingReviewDate": "2023-06-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-01 00:00:00",
              "EquipmentInspectionDate": "2022-08-22 00:00:00",
              "EquipmentTested": "Vessel R20350",
              "ChangeMgmtDate": "2024-08-27 00:00:00",
              "ChangeMgmtReviewDate": "2023-04-13 00:00:00",
              "PreStartupReviewDate": "2024-07-29 00:00:00",
              "ComplianceAuditDate": "2023-05-04 00:00:00",
              "AuditCompletionDate": "2024-05-30 00:00:00",
              "IncidentInvestigationDate": "2024-06-19 00:00:00",
              "InvestigationChangeDate": "2024-06-20 00:00:00",
              "ParticipationPlansReviewDate": "2023-04-13 00:00:00",
              "HotWorkPermitReviewDate": "2023-03-03 00:00:00",
              "ContractorSafetyReviewDate": "2024-03-11 00:00:00",
              "ContractorSafetyEvalDate": "2023-01-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000156886,
                  "PreventionProgram3ID": 1000125204,
                  "ProcessChemicalID": 1000182940
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000117425,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-08-08 00:00:00",
    "ERTrainingDate": "2024-04-15 00:00:00",
    "CoordinatingAgencyName": "Pleasants County LEPC",
    "CoordinatingAgencyPhone": "3046842285",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "Yes",
    "ExercisePlanDate": "2024-06-10 00:00:00",
    "NotificationDrill": "Yes",
    "NotificationDrillDate": "2024-06-10 00:00:00",
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2024-07-25 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2024-06-10 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "Yes"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000117425,
      "SummaryText": "es includes an overview of the process and its hazards.\n\nManagement of Change (MOC)\n\nThe facility has a written MOC procedure to manage changes to chemicals, process technology, equipment, and procedures.  These changes are reviewed for potential impact on safety, health and the environment prior to being approved for implementation.  All approved changes are communicated to affected employees.  MOCs are tracked and documented using an electronic change management program.  \n\nPre-Startup Safety Reviews (PSSR)\n\nPSSRs are conducted on new processes and on modifications to existing processes.  These PSSRs confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into service.  Action items identified in the PSSR are tracked to completion using an electronic follow up system.\n\nCompliance Audits\n\nThe Willow Island Plant currently also has processes covered by OSHA\u0092s Process Safety Management regulation (1910.119) which are subjected to a compliance audit every three years.  These audits are certified by site management and action items are tracked to completion in an electronic follow up system.  The P2930 was included in the most recent audits which was completed in May, 2023.\n\nIncident Investigation\n\nThe facility has written incident investigation procedures and will promptly investigate any incident that results in, or could reasonably have resulted in the accidental release of a regulated substance.  These investigations are conducted to identify the situation leading to the incident as well as any corrective actions to prevent the situation from reoccurring. All reports are retained for a minimum of 5 years.\n\nEmployee Participation\n\nEmployees are encouraged to participate in all aspects of the Process Safety Management and accident prevention program.  This includes participation in PHAs, PSSRs, and Incident Investigations.  Employees also have access to all information created as part of the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000117425,
      "SummaryText": "Executive Summary for Cytec Industries Inc \u0096 Willow Island, WV\n\n1. Accidental Release Prevention and Emergency Response Policies\nP2930 Process \u0096 Program Level 3\nFacility ID #1000001066253\nTHIS IS A 5-YEAR UPDATE\n\nWe at Cytec Industries Inc are strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances; and ensure the safety of employees and neighbors.\n\n2. The Stationary Source and the Regulated Substances Handled\n\nThe Willow Island Plant\u0092s Polymer Additives Unit manufactures polymer additive products, including ultraviolet light absorbers, antioxidants, anti-static agents, and depressant reactants.  P2930 is an intermediate product which is used to produce materials sold to the aerospace industry.  The Willow Island Plant manufactures P2930 in its Polymer Additives Unit in Building 82.  The process is located in Building 82 bays 28 through 32, floors 1 through 3 and the north yard adjacent to those areas.\n\nThe P2930 process uses chloroform which result in a Program 3 Stationary Source at the facility. \n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements of \n40 CFR part 68 of the EPA. The process was designed and constructed in accordance with ASME, NFPA and other nationally recognized safe design standards. The following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\nProcess Safety Information\n\nProcess Safety Information pertaining to the hazards of the chemicals, the technology of the process, and the equip"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000117425,
      "SummaryText": "ment of the process is compiled and maintained accessible to affected employees.  This includes access to SDSs for all materials handled. \n\nProcess Hazard Analysis (PHA)\n\nPHAs are conducted in accordance with regulatory, company and business unit requirements, including compilation of Process Safety Information and participation including hourly personnel.  Action items from the PHAs are entered into an electronic follow up system to be tracked to completion.  The most recent PHA revalidation for the P2930 process was completed in August 2024 and used the What If/Checklist methodology.  PHAs are revalidated at least every five years.\n\nOperating Procedures\n\nThe facility maintains written operating procedures that address various modes of operations, such as start up, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup following a shutdown.  These procedures are available to all operators for operating and training purposes and are periodically reviewed and certified annually as current and accurate. \n\nTraining\n\nThe facility has a comprehensive training program for all employees involved in operating the P2930 process.  This training program includes new hire orientation, classroom and on-the-job training.  Topics include an overview of the process and its hazards and the operating procedures.  Operators demonstrate their competency by examinations or field demonstrations and are given periodic refresher training.\n\nMechanical Integrity / Preventive Maintenance Program\n\nWritten mechanical integrity procedures follow consensus standards and corporate requirements, and recognized and generally accepted good engineering practices.  These include periodic inspections of equipment and piping systems as well as preventive maintenance routines on instrumentation and other systems.  These routines are tracked using an electronic maintenance management program.  Training for individuals involved in maintenance activiti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000117425,
      "SummaryText": "facility\u0092s accident prevention program.  \n\nHot Work Permit\n\nThe facility has a written Hot Work program which requires hot work permitting for jobs involving a potential source of ignition.\n\nContractors\n\nThe facility uses contractors to supplement its workforce for maintenance and construction activities.  Prior to selecting a contractor, their safety performance is evaluated.  Contract workers are given site-specific training including emergency procedures, site safety requirements and policies, and an overview of the process and its hazards. \n\nChemical-Specific Prevention Steps\n\nThe chemical-specific prevention steps for reducing the risk of an accidental release of the regulated substance, chloroform, include:\n\u0095\tInventory management of chloroform in covered-process and peripheral areas\n\u0095\tDesign of specialized spill containment system which minimizes vapor generation\n\u0095\tContainment of emergency relief devices\n\u0095\tCarbon bed to reduce emissions\n\u0095\tFixed and portable leak detection equipment\n\u0095\tElectrical classification for equipment\n\u0095\tFixed fire protection systems\n\u0095\tChemical-specific response procedures and personal protective equipment (PPE).\n\n4. Five-year Accident History\n\nThe P2930 process has had no accidents within the past 5 years which met the criteria of part 68.42(a).\n\n5. Emergency Response Program\n\nThe Willow Island Plant has a written emergency response program to protect worker and public safety as well as the environment.  These procedures include responses to a release of a regulated substance, fire, explosion, medical treatment for exposures, evacuation plans, accountability for personnel, and notification of site and local emergency responders.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  Suitable training is conducted regularly, for the different levels of responders. Drills are held regularly to ensure readiness for response. In addition, the emergency response plan is promptly updated to reflect"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000117425,
      "SummaryText": "any pertinent changes taking place within our equipment or processes that would require a modified emergency response.\n\nThe overall emergency response program for the facility is coordinated with Pleasants County Emergency Management.  This coordination includes periodic meetings with local response officials, local government officials (LEPC), mutual aid associations (COVIEO) and industry representatives. Updated information pertaining to the P2930 process and chloroform handling has been submitted to Pleasants County and local volunteer fire departments have been provided a tour of the facility.\n\n6.  Planned Changes to Improve Safety\n\nThe Willow Island Plant has ongoing activities to improve safety at the site.  As a member of OSHA\u0092s Voluntary Protection Program (VPP) Star Site since 2002, the site performs an annual evaluation of our safety performance and safety programs and develop action plans for the following year.  The facility also maintains current certifications under ISO/RC14001 and ISO45001.  Regarding accidental release prevention of regulated substances, the extensive PHA of the P2930 process developed action items which will be tracked to completion."
    }
  ]
}