{
  "FacilityID": 1000006467,
  "FacilityName": "Sara Lee Corporation - Paris, TX",
  "FacilityStr1": "2020 19th NW",
  "FacilityStr2": null,
  "FacilityCity": "Paris",
  "FacilityState": "TX",
  "FacilityZipCode": "75460",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48277",
  "LEPC": "Lamar County LEPC",
  "FacilityLatDecDegs": "33.681391",
  "FacilityLongDecDegs": "-095.574395",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.saralee.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 139551691,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": 5213962,
  "OperatorName": "Sara Lee Corporation - Paris, TX",
  "OperatorStr1": "2020 19th NW",
  "OperatorStr2": null,
  "OperatorCity": "Paris",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75460",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Machetta",
  "RMPTitle": "Plant Manager",
  "FTE": 680,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161488",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "LA00690",
  "SafetyInspectionDate": "2009-02-25 00:00:00",
  "SafetyInspectionBy": "TCEQ",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2011-11-11 00:00:00",
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.68076,
  "FRS_Long": -95.57686,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007570,
      "AltID": "Ammonia Refrig. System 1",
      "FacilityID": 1000006467,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007697,
          "ProcessID": 1000007570,
          "NAICSCode": "311812",
          "_desc": {
            "NAICS_CODE": "311812",
            "NAICS_DESCRIPTION": "Commercial Bakeries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008477,
          "ProcessID": 1000007570,
          "ChemicalID": 56,
          "Quantity": 34000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508477,
          "ProcessID": 1000007570,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000007571,
      "AltID": "Ammonia Refrig. System 2",
      "FacilityID": 1000006467,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007698,
          "ProcessID": 1000007571,
          "NAICSCode": "311813",
          "_desc": {
            "NAICS_CODE": "311813",
            "NAICS_DESCRIPTION": "Frozen Cakes, Pies, and Other Pastries Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008478,
          "ProcessID": 1000007571,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508478,
          "ProcessID": 1000007571,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006467,
      "SummaryText": "Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe commercial baking facility located in Paris, TX is a wholly owned subsidiary of Sara Lee Corporation. It is the policy of Sara Lee to comply with all applicable federal, state and local environmental and safety laws and regulations, and to conduct its business in an environmentally sound manner that avoids any unreasonable adverse impact on the environment or its neighboring community.\nIn keeping with this policy, Sara Lee, Paris, TX has developed and implemented OSHA's Process Safety Management and EPA's Risk Management programs to ensure the safety of our employees and the surrounding community.\nThe Risk Management program includes procedures: (1) to identify potentially hazardous chemicals at the facility, (2) for maintaining a safe working environment and, thereby, help prevent the release of hazardous chemicals, and (3) for minimizing the consequences of a release should one occur.\n\nStationary Source and Regulated Substances Handled\n\nThe Sara Lee Corporation, Paris, TX facility makes a variety of baked and frozen dough products. The major processes at the Paris facility include flour handling and storage, ingredient mixing, dough proofing, bread baking and product packaging and distribution. Raw materials are delivered to this facility by rail car and common carriers.\n\nThe only RMP regulated chemical handled by the Paris facility is anhydrous ammonia. Anhydrous ammonia is used at the facility in two refrigeration systems for process cooling, making ice, and freezing products. The anhydrous ammonia refrigeration systems are closed loop systems. Anhydrous ammonia is delivered to the facility by supplier tank trucks to initially charge the systems and occasionally thereafter to top-off the systems as needed, to replenish from periodic maintenance.\n\nThe Sara Lee, Paris TX facility has in place policies that limit the amount of ammonia at the facility. In addition, this facility co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006467,
      "SummaryText": "mplies with the ANSI/ASHRAE Standard 15 for ammonia refrigeration.\n\nWorst-Case and Alternate-Case Release Scenarios\nAs stipulated in EPA guidelines, 40 CFR Part 68.25, the worst-case and alternate case release scenarios were calculated for the covered process at the facility and the results are held on file at the Paris facility.\n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nThe Sara Lee Corporation, Paris, TX facility is subject to both EPAA?s Accidental Release Prevention program and OSHAA?s Process Safety Management (PSM) program. Under both of these programs, the facility has outlined specific procedures that it follows to prevent or minimize the release of anhydrous ammonia to the environment. Specifically, the facility has performed process hazard analysisA? (PHA) of the two ammonia systems and will repeat this process at least every 5 years. The purpose of the PHA is to provide a systematic approach for identifying, evaluating, and controlling potential hazards associated with the ammonia system. In addition, the facility performs regular training of its employees to ensure that the procedures developed for the safe use and handling of ammonia is adhered to all the time. Finally, the facility has a regular inspection and maintenance program to ensure that the ammonia systems are operated and maintained according to specific ammonia industry safety standards. It is Sara Lee's policy and belief that safe operating and maintenance practices and accident prevention programs are the key to obtaining safe operation and achieving accident prevention.\n\nFive Year Accident History\n\nThe Sara Lee Coroporation, Paris TX facility has had no reportable accidental release of ammonia in the last five years involving the refrigeration system. \n\nEmergency Response Program\n\nThe Sara Lee Coroporation, Paris, TX facility has devised a comprehensive emergency response program, designed to protect both employees and the community in the event of a rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006467,
      "SummaryText": "ease. The facilities Emergency Response Policy focuses on evacuation of the facility in the event of an ammonia emergency, with the assistance of local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The facility maintains a written Emergency Response Plan that documents specific procedures to be implemented in the event of various emergencies, including ammonia releases. The Emergency Response Plan includes procedures for facility evacuation, as well as notification of the local emergency response agencies that are responsible for notifying the public. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures. Additionally the facility has trained on-site personnel to respond to accidental ammonia releases. These personnel are trained in accordance with 29 CFR 1910.120, Hazardous Operations and Emergency Response regulations according to their duties and functions. These personnel also receive initial training and annual update of training thereafter.\n\nPlanned Changes to Improve Safety\n\nChanges to the facilities ammonia refrigeration processes are planned at this time. The changes will address the findings from the latest audit performed by the Hixson Company.  The changes will result in a safer system and address changes in current refrigeration code requirenments."
    }
  ]
}