{
  "FacilityID": 1000060730,
  "FacilityName": "Buena Vista Juice",
  "FacilityStr1": "23154 Lerdo hwy",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93206",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.500731",
  "FacilityLongDecDegs": "-119.60411",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Buena Vista Company",
  "OperatorStr1": "23154 West Lerdo Highway",
  "OperatorStr2": null,
  "OperatorCity": "Buttonwillow",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93206",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000233892",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-11-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-09-30 00:00:00",
  "DeRegistrationEffectiveDate": "2019-08-08 00:00:00",
  "AnniversaryDate": "2021-11-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 35.499507,
  "FRS_Long": -119.605546,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075882,
      "AltID": "Refrigeration System",
      "FacilityID": 1000060730,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094017,
          "ProcessID": 1000075882,
          "ChemicalID": 56,
          "Quantity": 10300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000077060,
          "ProcessID": 1000075882,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000063760,
              "Process_NAICS_ID": 1000077060,
              "SafetyReviewDate": "2016-08-30 00:00:00",
              "PHA_Date": "2016-08-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human error, airplane strike, severe weather, inadequate physical security devices, terrorism, theft, sabatage,",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion tank",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Engine room detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-09-30 00:00:00",
              "TrainingReviewDate": "2016-08-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-10-08 00:00:00",
              "EquipmentInspectionDate": "2016-10-08 00:00:00",
              "EquipmentTested": "All equipment at startup",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2016-08-16 00:00:00",
              "PreStartupReviewDate": "2016-10-03 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-08-16 00:00:00",
              "HotWorkPermitReviewDate": "2016-08-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2016-08-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000078387,
                  "PreventionProgram3ID": 1000063760,
                  "ProcessChemicalID": 1000094017
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000060730,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-08-30 00:00:00",
    "ERTrainingDate": "2016-09-30 00:00:00",
    "CoordinatingAgencyName": "Kern County",
    "CoordinatingAgencyPhone": "6618628740",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CalARP (Title 19)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000060730,
      "SummaryText": "duled to be performed based on the location of the facility and the Seismic History / Classification.  \r\n\r\nFacility Design Group Inc. produced the build specifications based on the following codes:\r\n¿\tGeneral\r\no\t2013 California Building Code\r\no\tChapter 17 of the 2013 California Building Code\r\n¿\tReinforced Concrete\r\no\tACI 301-10\t\tSpecifications for Structural Concrete for Buildings\r\no\tACI 302.1R-04\tGuide for Concrete Floor and Slab Construction\r\no\tACI318-11\t\tBuilding Code Requirements for Reinforced Concrete\r\no\tACI 360R-10\t\tDesign of Slabs-on-Ground\r\n¿\tMasonry\r\no\tACI 530-11\t\tBuilding Code Requirements for Masonry Structures\r\no\tACI 530.1-11\t\tSpecifications for Masonry Structures\r\n¿\tStructural Steel\r\no\tAISC 303-05\tCode of Standard Practice for Structural Steel Buildings and Bridges\r\no\tAISC 325-11\t\tSteel Construction Manual, 14th Edition\r\no\tAISC 326-09\t\tDetailing for Steel Construction, 3rd Edition\r\no\tAISC 360-10\t\tSpecification for Structural Steel Buildings\r\no\tAWS D1.1-10\t\tStructural Welding Code - Steel\r\n¿\tOpen Web Steel Joints and Joist Girders\r\no\tSJI JG-10\t\tStandard Specification for Joist Girders\r\no\tSJI K-10\tStandard Specification for Open Web Steel Joists, K-Series\r\no\tSJI LH/DLH-10\tStandard Specification for Longspan Steel Joists, LH Series and Deep Longspan Steel Joists, DLH Series\r\n\r\nThe design of foundations, retaining walls, and slabs-on-grade is based on the following criteria established in the geotechnical report by SEL, report number 13-14653 dated 1/2/14.  \r\n¿\tAllowable Soil Bearing Pressure:\t\t\t2500 PSF\r\n¿\tEquivalent Lateral Fluid Pressure - Active Case:\t33 PSF/FT\r\n¿\tEquivalent Lateral Fuid Pressure - At-rest Case:\t50 PSF/FT\r\n¿\tEquivalent Lateral Fluid Pressure - Passive Case:\t360 PSF/FT\r\n¿\tCoefficient of Sliding Friction:\t\t\t0.38\r\n¿\tSoil Density:\t\t\t\t\t\t120 PCF\r\n\r\nA-4   ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nSunnyGem Juice Plant's Prevention Program is described in the RMP/PSM Manual. The RMP Prevention Program is equivalent to OSHA's Process Safety Manag"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000060730,
      "SummaryText": "in the Maintenance Office.\r\n\r\nContractors and Contractor Qualifications\r\nThis site follows strict guidelines for qualifying contractors who directly influence the safety of the process or the system. The contractor qualification procedure ensures that contractors and their employees are fully aware of the potential dangers involved with the ammonia process, that contractors understand their responsibility and train their people, and that a contractor's safety record is considered in reviewing the bids. \r\n\r\nSee the Prevention Program Element 12 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\nA-5   FIVE YEAR ACCIDENT HISTORY\r\n\r\nThis is new facility and does not have any recorded history.\r\n\r\nA-6   EMERGENCY ACTION PROGRAM\r\n\r\nThis facility has trained personnel to implement the Emergency Action Plan developed for this facility for flammables, fire, earthquake, hazardous materials and other emergencies. \r\n\r\nFacility personnel have coordinated with responding outside agencies such as  fire and Kern County Environmental Health. The facilities emergency action plan has been coordinated with the community plan which includes these agencies. \r\n\r\nThe facility can coordinate with outside parties through drills and attendance at Ammonia Safety Days. Facility personnel will exchange data with local environmental authorities, fire and contractors who might assist during an emergency.  In addition, Fire Department personnel should tour the facility frequently to get a better understanding of the processes and the facilities during an emergency such as fire, earthquake and or a chemical release.\r\n\r\nDetailed plans (emergency action plans) have been developed to assist responders and company personnel.  All areas (zones) can be brought under control within 20 minutes of any ammonia emergency or breakdown if personnel/contractors are on site.  Small releases can be brought under control immediately.  \r\n\r\nThe eme"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060730,
      "SummaryText": "A.   EXECUTIVE SUMMARY\r\n\r\nGeneral [40 CFR 68.155/CALARP 2745.3]\r\n\r\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. \r\n\r\nNote: This summary includes additional information not included in the RMP Submit to assist SunnyGem Juice Plant management, process operators, technicians, contractors plus all involved and affected employees towards safe operation. In addition, some of the detail provided within this summary was excluded from the submitted RMP as current public access to this detail could expose the facility and personnel to terrorist or criminal activity.\r\n\r\nThese process does not meet the requirements of Program 1.  It is subject to OSHA's PSM standard.  Thus this RMP is written to meet the EPA Program 3 level of compliance. \r\n\r\nThis program was created in August of 2016 in conjunction with the start-up of the new facility.  \r\n\r\nThe following areas are addressed in this summary:\r\n\r\n1.\tAccidental release prevention and emergency response policies at the stationary source\r\n2.\tThe stationary source and regulated substances handled\r\n3.\tThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and      \r\n        mitigation measures \r\n4.\tThe accidental release prevention program and chemical-specific prevention steps\r\n5.\tThe five-year accident history\r\n6.\tThe emergency response program\r\n7.\tPlanned changes to improve safety\r\n\r\nA-1   ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \r\n\r\nSunnyGem Juice Plant is committed to complying with all of the regulatory requirements of the EPA Risk Management Program. SunnyGem Juice Plant has developed their Risk Management Plan / Process Safety Management (RMP/PSM) making up the CalARP program to document policies and address the implementation of these regulations. The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060730,
      "SummaryText": "perating, training, maintenance, emergency mitigation, and others. The RMP sections pertain to management systems and include the Hazard Assessment (Offsite Consequence Analysis) Report.\r\n\r\nFederal regulations require reporting when there is a release of ammonia exceeding 100 pounds in 24 hours.\r\nState regulations require reporting when there is an accidental release of ammonia or a threat of accidental release of ammonia.  SunnyGem Juice Plant interprets this regulation at any release that poses a threat of injury above and beyond minor irritation to anyone.\r\n\r\nAll releases and near misses are to be recorded using the incident investigation forms.  All releases are to be monitored and all readings recorded.  All releases and near misses are to be reviewed to develop procedures that may prevent future incidents.\r\n\r\nAny release of more than 25 ppm may result in immediately shutting down the ammonia systems depending on the location of the release. The Plant Manager is to be called if not on-site for reporting purposes. In turn, the ammonia refrigeration contractor would be notified to respond, mitigate and repair as needed.  Releases less than 25 PPM shall result in immediately calling the Maintenance Supervisor and Plant Manager, if not on-site, for instructions.\r\n\r\nThe facility utilizes inspection procedures to review refrigeration equipment on an ongoing basis. These procedures identify potential sources of release and equipment corrections required to prevent these releases. Onsite personnel, registered engineers, refrigeration experts, and certified refrigeration contractors as required review the equipment.\r\n\r\nThere are additional full time managers, supervisors and operational / maintenance personnel at this facility that have been trained to conduct visual and audible inspections of the ammonia systems on a regular basis. They are instructed to report any condition that could result in an ammonia release immediately.  This team activity is the core of SunnyGe"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000060730,
      "SummaryText": "rgency action plan for all releases is to gain access to the shutdown valves and controls for the system with the release.  If the system shut down areas are within the ammonia release area the entire ammonia system may be shut down if appropriate.  The appropriate shut down switches and controls are identified at the facility.  \r\n\r\nOn-site personnel do not enter an IDLH condition (300 ppm for ammonia).  Incidental responders are trained to the Air Purifying Respirator level and trained to retreat at 300 ppm for ammonia. Facility personnel will assist outside agencies during larger releases. All personnel not trained to respond will evacuate to the meeting areas and be accounted for.\r\n\r\nA-7   PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nEmployees, community safety, the environment and product care are primary concerns at this facility.  An initial PHA study was conducted at SunnyGem Juice Plant and the study team made recommendations for additional safety which have been incorporated into the original design.  \r\n\r\nThe following is a list of recommendations which will help to improve overall safety.  The recommendations shall be tracked to completion.  \r\n\tConduct emergency action training, create applicable SOP's, calibrate and test safeties at startup, install windsock to be seen from exits, install eyewashes inside and outside of engine room, follow RAGAGEP for mechanical integrity inspection / maintenance (refrigeration contractor to perform for short time after startup)."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060730,
      "SummaryText": "m Juice Plant's prevention program.  \r\n\r\nA-2   STATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\r\nThe SunnyGem Juice Plant utilizes anhydrous ammonia as a refrigerant in their juice production and storage facility.  The facility takes in raw pomegranates which they utilize to produce juice.  The anticipated production months are November thru January with production occurring 7 days a week.  The refrigeration system will run year around to keep freezer room temperatures for product quality and safety.  \r\n\r\nThe finished pomegranate juice is stored long term in 55-gallon drums in the freezer rooms.  The facility has the future goal of shipping product out of the facility.  The anhydrous ammonia is used to achieve temperature in the freezer rooms and used to cool a secondary coolant (glycol).\r\n\r\nThe facility is located in Kern County on a contiguous property. Ammonia is used as the refrigerant in the House Refrigeration System. The total ammonia inventory in the House System is 10,300 lbs. based weight ticket(s) from the initial ammonia delivery from Airgas.  The program was updated within the month and at this time, the estimated amount does exceed the Federal and State thresholds. \r\n\r\nThe refrigeration system is a direct mechanical refrigeration system. The refrigeration machine room / refrigeration system was built in 2016.  The remainder of the facility structures were built in the 1970's.\r\n\r\nThe ammonia equipment is located in the machine (engine) room, outside on the roof, and in the freezer room.\r\n\r\nA-3   HAZARD ASSESSMENT\r\n\r\nThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures. The regulation requires that the Worst-Case Release Scenario use the ammonia quantity in the largest vessel or pipe. \r\n\r\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system - in eithe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060730,
      "SummaryText": "r design or operation. In addition, the House System is separated by walls and distance. Furthermore, as the refrigerant escapes pressure will decrease reducing the release rate. The scenario parameters are established by the regulation to provide uniformity for dialog between the industry, community, and regulatory agencies.\r\n\r\nThe regulation allows the facility to select the Alternate-Case Scenario.\r\n\r\nA-3.1  SESIMIC ASSESSMENT\r\nH&SC 25534.05(c), CCR 2755.2(d), CCR 2760.2(c)(8)\r\nPurpose\r\n\r\nIdentifies seismic vulnerabilities that could result in an accidental release of a regulated substance and provides for required remedial action to reduce the likelihood of offsite consequences that may impact public health or the environment.\r\n\r\nRegulations & Guidelines\r\n\r\nAs part of RMP submittal a Hazard Review must be conducted, including a seismic assessment (Walkdown) by a qualified engineer. For new facilities, prior to equipment charging, and every 5 years thereafter.  Existing facilities must perform assessments every 5 years.\r\n\r\nThe seismic assessment will be performed by an individual who is registered in California as a Civil, Structural or Mechanical Engineer with experience in seismic design and/or evaluations of stationary sources subject to CalARP.  Qualified Engineer who is knowledgeable about the applicable types of failures that may occur to structures and equipment during ground shaking or movement.  The engineer performs a methodical physical inspection or 'walkdown' of the stationary source.\r\nThe purpose of the walkdown is to identify vulnerabilities.  The overall objective is to maintain primary containment of regulated substances and performance criteria includes:\r\n\r\na.  Maintain structural integrity;\r\nb.  Maintain position;\r\nc.  Maintain containment of material;\r\nd.  Function during the earthquake; and/or\r\ne.  Function after the earthquake.\r\n\r\nThe seismic assessment as required by the California Code of Regulations Title 19 Division 2 Chapter 4.5 is sche"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000060730,
      "SummaryText": "cuments are filed and maintained in the Maintenance Office \r\n\r\nTechnical Operating Specifications and Standard Operating Procedures\r\nThe Technical Operating Specifications (TOS) and Standard Operating Procedures (SOP's) are provided for each compressor, condenser, ammonia vessel, oil pot, and evaporator etc. Topics include general information such items as:\r\n\r\n¿\tObjectives \r\n¿\tSpecial hazards \r\n¿\tLocation \r\n¿\tSafety equipment needed \r\n¿\tP&ID's and Block Flow Diagrams\r\n¿\tTechnical operating specifications, \r\n¿\tElectrical classifications \r\n¿\tStep-by-step procedures\r\n¿\tSpecific warnings & PPE \r\n\r\nThe SOPs cover different phases of operations such as: initial startup; normal, temporary and emergency operations; emergency shutdowns; and startup following a shutdown. Various other safety programs and procedures are included.\r\n\r\nSee the Prevention Program Element 3 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nTraining\r\nAll employees who are involved with anhydrous ammonia have been properly trained, at a minimum, in understanding the SDS, routine refrigeration system operation, emergency refrigeration system operation, emergency and normal refrigeration safety practices, and the individual's role in the emergency response plan or action plan.\r\n\r\nSee the Prevention Program Element 4 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Human Resources Office and/or Maintenance Office.\r\nMechanical Integrity\r\nThe purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working condition.   Inspections, and ongoing maintenance based on industry standards are performed on all compressors, condensers, evaporators, pressure vessels, piping systems, relief/vent systems and devices, emergency shutdown systems, controls, and pumps etc.\r\n\r\nSee the Prevention Program Element 5 for the complete guidelines. \r\nThe s"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000060730,
      "SummaryText": "ement Program (PSM). The Prevention Program implemented by SunnyGem Juice Plant is essential to help prevent or minimize the effects if a release occurs.\r\n\r\nKey objectives of SunnyGem Juice Plant's Prevention Program are briefly described below:\r\n\r\n1) Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information Element)\r\n\r\n2) Provide thorough team evaluation of the refrigeration system.  The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes).  All safety recommendations developed by the team are reviewed and addressed by SunnyGem Juice Plant.  (Addressed under Process Hazard Analysis and Mechanical Integrity Elements)\r\n\r\n3) Written procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation Elements.)\r\n\r\n4) Certification of refrigeration operators to safely operate the refrigeration system.  SunnyGem Juice Plant certifies operators following completion of operator training and SunnyGem Juice Plant's confirmation of the operator's ability apply what they have learned.  (Addressed under Training Element.)\r\n\r\n5) Employee involvement in the Prevention Program.  This is addressed on two levels.  First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.).  This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \r\n\r\nSecond, all SunnyGem Juice Plant employees (direct hires and contract) at this facility receive ammonia awareness training.  Additionally, they have access to the RMP/PSM information.  These activities"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000060730,
      "SummaryText": "upporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nManagement of Change\r\nThe Management of Change (MOC) procedure requires that all changes (even replacement in kind) be reviewed to see if there is a possible negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operating procedures, and authorization requirements for the proposed change.  Employees affected by the change are informed of the change before startup and trained in the proper procedures.\r\n\r\nSee the Prevention Program Element 6 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nPre-Startup Safety Review\r\nPre-startup safety reviews are required on all new or modified equipment/systems. This involves process safety information, process hazard analysis, training, safety procedures, operating procedures, and verification that construction and equipment are in accord with the design specifications.\r\n\r\nSee the Prevention Program Element 7 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nCompliance Audits\r\nTo ensure that all the other areas of program are followed, the regulations require compliance audits.  At a minimum, these must be completed every three years. Resubmission of the RMP shall be done according to requirements.\r\n\r\nSee the Prevention Program Element 8 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nIncident Investigation\r\nAn incident investigation shall be performed any time there is an incident which resulted in, or which could reasonably have resulted in, a catastrophic release of ammonia. The purpose is to gain information that could prevent further accidents and to identify weaknesses in the emergency response plan that need to be addressed. Investigations"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000060730,
      "SummaryText": "improve the overall safety of the employees. (Both levels are addressed under the Employee Participation Element)\r\n\r\n6) Implementation of additional measures when changes are planned (procedural or mechanical).  These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by SunnyGem Juice Plant's Management of Change Procedure. \r\n \r\nIf a mechanical change is required and for maintenance contracts, SunnyGem Juice Plant has a procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other hot work occurs close to the refrigeration system, a SunnyGem Juice Plant Hot Work permit is required.  The purpose of the permit and the associated Hot Work procedure is to minimize the possibility of a fire. \r\nFollowing completion of a mechanical change, a pre-startup safety review is required before the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Startup Safety Review Elements.)\r\n\r\n7) Verification of SunnyGem Juice Plant's compliance with the RMP/PSM program.  This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program (and the Risk Management Program) has been implemented and properly documented by SunnyGem Juice Plant personnel.  SunnyGem Juice Plant has established a Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit Element)\r\n\r\n8) Minimize employee injury and illness. (Addressed under Injury and Illness Prevention Program)\r\n\r\nProgram Consolidation\r\n\r\nThe documentation requirements of these programs have been consolidated in the documenting and record filing process. \r\nThe documents and records are kept as identified in each element of the program for the current year and then archived in th"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000060730,
      "SummaryText": "e current year archive binder or in the physical files in the Maintenance Office.  The following identifies the practices and procedures for:\r\n \r\nProcess Safety Information\r\nProcess Hazard Analysis\r\nOperating Procedures\r\nTraining\r\nMechanical Integrity\r\nManagement of Change\r\nPre-Startup Safety Review\r\nCompliance Audits\r\nIncident Investigations\r\nEmployee Participation\r\nHot Works\r\nContractors\r\n\r\nProcess Safety Information\r\nProcess Safety Information includes a wide variety of books, manuals, and process information. These are available to employees that operate, maintain, or repair the process equipment or piping. There are three major categories of information: ammonia data such as SDS, safety information, first aid, chemical properties, IIAR safety bulletins, etc.; process information such as piping & instrumentation diagrams (P&ID's), block flow diagram, design codes and standards, pressure safety relief settings, safety system/devices, ventilation system design, operating procedures, safe operating limits, and ramification of process deviation; and process equipment information such as equipment specifications, electrical classifications, materials of construction, installation manuals, operating and maintenance manuals, and manufacturer's manuals.\r\n\r\nSee the Prevention Program Element 1 for the complete guidelines\r\nThe supporting and completed documents are filed and maintained in the Maintenance Office\r\n\r\nProcess Hazard Analysis\r\nA Process Hazard Analysis (PHA) was completed using the What-if checklist.  This addressed hazards, engineering and administrative controls, consequences of failure of engineering and administrative controls, facility siting, human factors, and a qualitative evaluation of the possible safety and health impact. The results of the PHA were prioritized and incorporated into a PHA Findings Report for follow-up as a corrective action log.\r\n\r\nSee Element 2 of the Prevention Program for the complete guidelines\r\nThe supporting and completed do"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000060730,
      "SummaryText": "are initiated promptly using a trained team. The findings and recommendations will be studied and appropriate corrective action taken.\r\n\r\nSee the Prevention Program Element 9 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nEmployee Participation\r\nThe Employee Participation Program is an asset to both employees at the site and to the community as a whole.  As a general rule, employees who are fully involved have a greater sense of responsibility; they are more likely to catch the problems that can cause accidents. Employee awareness is for employees, not directly involved with the process, this includes knowing the hazards, the safety rules, warning signs, and evacuation procedures. All employees have access to the PSM Program. Involved employees participate directly in every phase of the PSM program, including conducting the PHA, developing or reviewing operating procedures, reviewing incident investigations, and conducting mechanical integrity and compliance audits.\r\n\r\nCommunity involvement is through coordination and cooperation with the local Fire department and CUPA.\r\n\r\nSee the Prevention Program Element 10 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained in the Maintenance Office.\r\n\r\nHot Work and Safe Work Practices\r\nThis permit process is to protect against fire, explosion and other dangers resulting from hot work (welding and cutting outside the designated areas).  Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules are met. Permits indicate the appropriate dates and the work to be done. The permits are kept on file until workers have completed the hot work operations.\r\n\r\nSee the Prevention Program Element 11 for the complete guidelines. \r\nThe supporting and completed documents are filed and maintained"
    }
  ]
}