{
  "FacilityID": 1000071701,
  "FacilityName": "Pasadena Water & Power City Yards Facility",
  "FacilityStr1": "311 W. Mountain Street",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "CA",
  "FacilityZipCode": "91103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.164773",
  "FacilityLongDecDegs": "-118.156516",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ci.pasadena.ca.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 964380315,
  "ParentCompanyName": "City of Pasadena",
  "Company2Name": null,
  "CompanyDUNS": 809839186,
  "Company2DUNS": 0,
  "OperatorName": "City of Pasadena Water & Power",
  "OperatorStr1": "150 S. Los Robles Avenue",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91101",
  "OperatorZipCodeExt": null,
  "FTE": 375,
  "OtherEPAFacilityID": "CAD981648181",
  "EPAFacilityID": "100000164975",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-08-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-08-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.16216,
  "FRS_Long": -118.15765,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089780,
      "AltID": "Chlorine Storage",
      "FacilityID": 1000071701,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112270,
          "ProcessID": 1000089780,
          "ChemicalID": 62,
          "Quantity": 7500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000091002,
          "ProcessID": 1000089780,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000076058,
              "Process_NAICS_ID": 1000091002,
              "SafetyReviewDate": "2018-06-29 00:00:00",
              "PHA_Date": "2018-06-13 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-12-13 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Site Inspection",
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Fusible plugs to protect vessel integrity",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Storage Corral (Chain-in-place)",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-06-29 00:00:00",
              "TrainingReviewDate": "2018-06-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-06-29 00:00:00",
              "EquipmentInspectionDate": "2018-08-02 00:00:00",
              "EquipmentTested": "Daily inspection of chlorine cylinders and storage corral",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-06-29 00:00:00",
              "PreStartupReviewDate": "1999-12-20 00:00:00",
              "ComplianceAuditDate": "2016-12-20 00:00:00",
              "AuditCompletionDate": "2018-06-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-06-29 00:00:00",
              "HotWorkPermitReviewDate": "2018-06-29 00:00:00",
              "ContractorSafetyReviewDate": "2018-06-29 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Risk Management Plan covers the City Yards Chlorine Storage facility owned and operated by the Pasadena Department of Water and Power. It includes strict requirements for written operating procedures, personnel training, equipment maintenance, incident investigation, process hazard analysis, management of change, and periodic review or audit of program elements.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000094519,
                  "PreventionProgram3ID": 1000076058,
                  "ProcessChemicalID": 1000112270
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000071701,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Pasadena Fire Department",
    "CoordinatingAgencyPhone": "6267444655",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071701,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nCity of Pasadena Water & Power Department (PWP) has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\n\n\nPWP has coordinated emergency response efforts with the local fire department, Pasadena Fire Department.  In the event of a small chlorine leak, Pasadena Water & Power City Yards will check the area using a mild ammonia-water solution to determine the location of the faulty cylinder.  If the concentration within the area is less than the IDLH (10 ppm), they will use an A Kit to stop the leak.  Operators will then call the vendor to pick up the defective cylinder.  However, if the concentration is above the IDLH, they will evacuated the premises and call 911 for outside responders (potentially with the assistance of trained facility personnel).  \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe City of Pasadena Water & Power Department City Yards facility is located at 311 W. Mountain Street, California  91103.  The facility is located just east of the Interstate 210 freeway at Mountain Street.  The area surrounding the facility is primarily light commercial and residential.  The City Yards serves primaril"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071701,
      "SummaryText": "y as a storage location for the Pasadena Water & Power Department.  Other departments located at the facility include General Services, Public Works, and Solid Waste.  The facility is surrounded by a chain link fence with primary access through a driveway supervised by a guard shack.  Visitors are required to check in with the guard prior to gaining entry.\n\n\n\nChlorine is stored as a liquefied compressed gas in typical 150-pound cylinders at the City Yards.  A maximum of fifty (50) 150-pound cylinders may be stored at the facility at any one time for a total of a maximum of 7,500 pounds of chlorine. \n\n\n\nThese cylinders are stored on a raised, covered concrete island in a metal three-sided corral which allows for the cylinders to be chained in place.  Access to the cylinders is restricted through the use of a key card to open the locked corral.  The corral is divided into used and full cylinder areas.  Vendor deliveries are made to the full cylinder area, and these cylinders are transported by PWP operators, as needed, to remote chlorination stations.  Used (empty) chlorine cylinders from these facilities are then returned to the used section of the corral and are picked up by the chlorine cylinder vendor during deliveries.  All cylinders are stored with a secure threaded cap in place over the cylinder valve.\n\n\n\nChlorine is only stored at the City Yards facility.  There is no chlorine process piping or equipment at the facility.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe storage of chlorine cylinders at the PWP City Yards is governed by many safety features.  Much of the safety of the process is inherent in the policies and procedures that govern the operation of the process.  For example, the PWP City Yards operates in accordance with OSHA's Process Safety Management regulation and the California Accidental Release Prevention (CalARP) Program.  The chlorine cylinders are checked by operators on a daily basis.  Cylinders wit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000071701,
      "SummaryText": "h any notable defect are immediately returned to the vendor.\n\n\n\nThe stored chlorine cylinders would not be affected by a power outage in any way.  There is not a history of failure of chlorine cylinders.  Every chlorine cylinder has a fusible plug that will melt at high temperatures to protect the vessel's integrity.  To ensure chlorine is not released due to a fusible plug, fires are prevented by storing flammable materials away from the chlorine storage area.\n\n\n\nIn addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes industry practices recommended by the Chlorine Institute.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe EPA's RMP Program defines \"accident\" as the following:\n\n\n\n\"An unanticipated emission of a regulated substance or other extremely hazardous substance into the ambient air from a stationary source.\"\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (19CCR2750.9(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (19CCR2750.9(a)).\"\n\n\n\nBased on the above definition and an investigation into the facility's accident history conducted on (August 2, 2018), there have been no releases of chlorine that exceeded the Federal Reportable Quantity of 10 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material in the last five years (August 2013 - August 2018). In addition, there have been no injuries resulting from a chlorine release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n  \n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nPWP has an emergency action plan in effect.  In case of a major chlorine leak, employees at the City Yards facility are to evacuate the immediate area and contact the Water Operations department.  If needed, an evacuation will be called for"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000071701,
      "SummaryText": " using the building's PA system.  If an evacuation is called, employees are to proceed to the upper parking lot, which is at a higher elevation than the chlorine storage area.  Managers will observe the wind direction to ensure that the primary assembly area is a safe place to meet.\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to personnel turnover.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis and Seismic Hazard Analysis have been reviewed and updated. Recommendations resulting from these two efforts will be considered for implementation within the regulatory deadlines.\n\n \n\n"
    }
  ]
}