{
  "FacilityID": 1000117605,
  "FacilityName": "Durez Corporation - Niagara Falls Facility",
  "FacilityStr1": "5000 Packard Road",
  "FacilityStr2": null,
  "FacilityCity": "Niagara Falls",
  "FacilityState": "NY",
  "FacilityZipCode": "14304",
  "Facility4DigitZipExt": "1510",
  "FacilityCountyFIPS": "36063",
  "LEPC": "Niagara County LEPC",
  "FacilityLatDecDegs": "43.100101",
  "FacilityLongDecDegs": "-079.002075",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sbhpp.com",
  "FacilityEmailAddress": "jhimes@sbna-inc.com",
  "FacilityDUNS": 21239616,
  "ParentCompanyName": "Sumitomo Bakelite North America Holding Company",
  "Company2Name": null,
  "CompanyDUNS": 14845923,
  "Company2DUNS": null,
  "OperatorName": "Durez Corporation",
  "OperatorStr1": "4400 Haggerty Road",
  "OperatorStr2": null,
  "OperatorCity": "Commerce Township",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48390",
  "OperatorZipCodeExt": "1317",
  "FTE": 66,
  "OtherEPAFacilityID": "NYD002103216",
  "EPAFacilityID": "100000074297",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "9291100111105",
  "SafetyInspectionDate": "2024-06-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-10-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-10-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-10-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-10-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.100101,
  "FRS_Long": -79.002075,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000146614,
      "AltID": "Formalin Tank & Loop",
      "FacilityID": 1000117605,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000183236,
          "ProcessID": 1000146614,
          "ChemicalID": 1,
          "Quantity": 170000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000148227,
          "ProcessID": 1000146614,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000125400,
              "Process_NAICS_ID": 1000148227,
              "SafetyReviewDate": "2024-06-17 00:00:00",
              "PHA_Date": "2024-06-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "none",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire doors",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Drager pump & tubes to take current reading of Formaldehyde",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Unloading & Loop pump were changed from a Gear Pump to a Canned Pump; no seal in new pumps to elminate possible leak potential",
              "OpProceduresReviewDate": "2024-04-25 00:00:00",
              "TrainingReviewDate": "2024-04-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-09-26 00:00:00",
              "EquipmentInspectionDate": "2024-06-25 00:00:00",
              "EquipmentTested": "Tank-61",
              "ChangeMgmtDate": "2024-08-20 00:00:00",
              "ChangeMgmtReviewDate": "2024-09-25 00:00:00",
              "PreStartupReviewDate": "2024-09-25 00:00:00",
              "ComplianceAuditDate": "2022-11-08 00:00:00",
              "AuditCompletionDate": "2022-12-31 00:00:00",
              "IncidentInvestigationDate": "2024-09-18 00:00:00",
              "InvestigationChangeDate": "2024-12-01 00:00:00",
              "ParticipationPlansReviewDate": "2024-09-25 00:00:00",
              "HotWorkPermitReviewDate": "2024-08-12 00:00:00",
              "ContractorSafetyReviewDate": "2024-03-01 00:00:00",
              "ContractorSafetyEvalDate": "2023-11-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000157082,
                  "PreventionProgram3ID": 1000125400,
                  "ProcessChemicalID": 1000183236
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000117605,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-08-12 00:00:00",
    "ERTrainingDate": "2024-09-30 00:00:00",
    "CoordinatingAgencyName": "Niagara Falls Fire Department",
    "CoordinatingAgencyPhone": "7162864720",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Niagara Falls POTW Wastewater Discharge Permit; NYSDEC Part 373 Hazardous Waste Permit; NYCRR 6 Part 597 Chemical Bulk Storage regulations",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000117605,
      "SummaryText": "EXECUTIVE SUMMARY\nThe Durez Niagara facility was owned by Occidental Chemical Corporation until September 2000. At that time, Occidental sold its Durez Division to Sumitomo Bakelite who founded Durez Corporation. Durez Corporation owns and operates a phenolic resin manufacturing facility in Niagara Falls, NY. The facility is located at 5000 Packard Road. The facility was originally constructed in 1928 and operated under the Varcum name. Reichold Chemical operated the facility to until 1984. BTL Industries operated the facility from 1984 to 1989, at which time it was sold to Occidental Chemical and became part of their Durez Division. The facility currently employs 66 employees.\n\n1. The Accidental Release Prevention & Emergency Response Policies at the Stationary Source (68.155[a]) \nDurez Corporation is committed to operating its Niagara Falls facility in a manner that is safe for its workers, the public and the environment. It is our policy to adhere to all applicable federal, state and local rules and regulations, industry standards and typical best management practices. As part of this commitment, Durez has established programs in place to help ensure safe operation of the phenolic resin processes at this facility including the prevention of accidental releases of hazardous substances. One component of this system is the Risk Management Program (RMP) that helps manage the risks at the Niagara Falls facility and that complies with the requirements of the EPA's regulation 40 CFR Part 68, Accidental Release Prevention Requirement Risk Management Programs (the RMP rule). This document provides a brief overview of the Risk Management Program at the Niagara Falls facility.\nThe Risk Management Program at the Niagara Falls facility consists of the following three elements:\n* A hazard assessment to help understand a) the potential of offsite consequences of hypothetical accidental releases, and b) accidents that have occurred during the last five years associated with the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000117605,
      "SummaryText": "use of substances regulated by the RMP rules (regulated substances).\n* A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered process).\n* An emergency response program to help respond to accidental releases of regulated substances from a covered process.\n\nAlthough the RMP at the Niagara Falls facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety and environmental program at the facility. The plant has a comprehensive safety and environmental program in place, establishing many levels of safeguards against release of a hazardous substance, as well as injuries and damage from such a release.\n\nDurez limits the use of hazardous substances. Before using a hazardous substance, the material must be reviewed by the plant chemist, production/operations manager, and the environmental, health and safety leader(s) (EH&S). The review includes environmental, health and safety impacts, compatibility to materials of construction in the plant, and review of usage potential. If all managers approve the usage of the hazardous substance, the facility's management of change (MOC) and Process Hazard Review (PHR) procedures are followed to track it through the facility.\n\nDurez strives to prevent releases of the hazardous substances used at the facility. Durez has and will continue to implement reasonable controls to prevent foreseeable releases of hazardous substances. \nDurez:\n* Maintains a computer-based monitoring system on all of its phenolic resin reactors, which not only monitors all aspects of the process cycle such as raw material charging, reaction temperature, pressure, vacuum, condition of auxiliary equipment (pumps, valves, etc.), but when necessary, will automatically initiate active mitigation.  This can be closure of a valve, shutdown of a pump, or release of stored water to quench a reaction in a vessel."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000117605,
      "SummaryText": "* Is an OSHA Process Safety Management Program (PSM) site and maintains an extensive mechanical integrity program (MI) as part of PSM and under the requirements of New York State Bulk Storage Regulations. The MI program includes inspections of storage tanks, transfer lines, containment dikes, and process equipment at various time intervals.\n* Participates in planning with the local community such as the Niagara Falls Fire Department, Local Emergency Planning Committee (LEPC), and the local hospital. Niagara Falls Fire Department conducts an annual walk-around every year. \n* Conducts Audits/Inspections/Certifications through independent contractors, periodic environmental/safety audits and assessments. These include audits for OSHA PSM, ISO 45001 Compliance Audits, Facility Siting, Dust Hazard Analysis (DHA), NYS Chemical Bilk Storage, etc.  The site maintains ISO 45001-2018 Certification.\n* Utilizes an Emergency Response Plan that complies with federal, state and local regulations. This plan is posted on the LEPC Tier II database, accessible to all county responding agencies.\n* Maintains an onsite Emergency Response Team to oversee response activities and coordinates response efforts with the local emergency response agencies. Our Emergency Response Team consists of production and management employees. All ERT members are trained to the HAZMAT Technician Level (24-hour) with 8-hour annual refresher training.  In a situation that requires elevation, the ERT would work with the local Niagara Falls Fire Department.\n*Installed of a thermal oxidizer in 2007 to reduce volatile organic emissions from six reactors producing phenolic resins.\n\nAlthough the Risk Management program at the Durez Niagara facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety and environmental program. Other aspects of the program include OSHA's Process Safety Management Program (PSM), Niagara Falls Water Board Accide"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000117605,
      "SummaryText": "ntal Slug Discharge Control Plan, NYSDEC Part 373 RCRA Permit requirements, and the NYS Bulk Storage Tank Program (NYCRR 6 Part 597).\nThis RMP plan is intended to describe those parts of an overall safety and environmental program required by the RMP regulations.\n\n2. The Stationary Source & Regulated Substances Handled (68.155[b])\nThe Niagara Falls plant handles one regulated substance in sufficient quantity to be covered by Part 68, and there is one RMP covered Program Level 3 process at the plant. This Level 3 process consists of the formalin storage tank (Tank 61), loading system, distribution lines (\"Formalin Loop\") to all 7 reactors on site, and those reactors.\nRegulated Substance: Formaldehyde Solution (45%)\nProcess: Resin Manufacturing\nMaximum Process Quantity, pounds *: 170,000\nRMP Threshold, pounds *: 15,000\n* Process and threshold quantity is the quantity of formaldehyde.\nFormaldehyde is used as a raw material for phenol-formaldehyde resin. The specific hazards of formalin solution are listed in the SDS but may be summarized as follows:\n- a combustible liquid\n- irritating to the eyes, ears, nose and throat\n- IARC Class 2 carcinogen\n\n3. The Worst Case Release Scenario(s) & the Alternative Case Release Scenario(s), Including Administrative Controls & Mitigation Measures to Limit the Distances for Each Reported Scenario (68.155[c])\nThe Niagara Falls plant performed offsite consequence analysis to estimate the potential for accidental release of a regulated substance to affect the public or the environment. The offsite consequence analysis evaluated a \"worst case release scenario\" and an \"alternative case release scenario\". The plant does not expect a worst-case release scenario to ever occur. \nTrinity Consultants modeled the distance to the toxic endpoint for the worst case and alternative case scenarios. The meteorological data used for the modeling was the EPA default for the worst case scenario and EPA suggested values for the alternative case scenario. Th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000117605,
      "SummaryText": "e Landview III Program, available from the U.S. Census, was utilized to estimate the number of people living within worst case and alternative case distances from the location of the storage tank and the public and environmental receptors located within these distances. The Trinity study results were checked against the 2019 version of RMPcomp available online, and the results were quite similar.\nIn both release scenarios, the heated formaldehyde solution rapidly cools upon release and contact with the concrete or asphalt ground surface. The liquid formaldehyde solution primarily crystallized to form paraformaldehyde solid, with some evaporation occurring to form a small vapor cloud.\n\nThe following information summarized the off site consequence analysis performed by the Niagara Falls plant:\n3.1 Toxic Substance(s) - Formaldehyde Solutions\nThe \"worst case release scenario\" for a 45% solution of formaldehyde is the release of the entire contents of a 30,000 gallon storage tank (92,708 pounds of formaldehyde in formalin solution). A concrete diked area contains the released formaldehyde solution while an estimated 50 pounds of formaldehyde gas vaporizes. The maximum distance to the toxic endpoint concentration based on modeling in RMP*comp is 0.2 miles from the source.  The only environmental receptor located within this distance is a small, isolated wetland and a light industrial area.\nThe \"alternative case release scenario\" for the formalin system is a failed gasket or weld at the pressurized formalin loop and the leaking of 51,800 pounds of formaldehyde in formalin solution to the asphalt or concrete surface below over a 15-minute period at 2,330 pounds per minute; mitigation would be turning off the formalin loop pump and absorbing or pumping the spilled solution up, completed in 60 minutes. The conditions are listed in the RMP*Comp scenario summary, attached. Modeling this scenario indicates a toxic endpoint distance of 0.2 miles from the source.   The only public"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000117605,
      "SummaryText": "receptor located within this distance is a small, isolated wetland and a light industrial area.\n\n3.2 Program 3 Processes - Flammable Substances\nThere are no regulated flammable substances held above the RMP threshold quantities at the plant. Propane is stored on site in 30-pound cylinders; however, the total quantity is less than the threshold quantity of 10,000 pounds.\n\n4. The General Accidental Release Prevention Program & Chemical Specific Prevention Steps (68.155[d])\nSince 1994, the Niagara Falls plant has used a prevention program to help prevent accidental releases of hazardous substances. Beginning in 1994, the plant formalized this prevention program for the formaldehyde manufacturing and storage process to comply with the 14 elements of the OSHA process safety management (PSM) prevention program.\nProgram 3 is essentially the same as OSHA's PSM program, except that the program also focuses on protecting the public and the environment outside the fence line, The following sections briefly describe the elements of the Niagara Falls plant's Program 3 Prevention Program that addresses EPA's RMP rule prevention program requirements.\n\n4.1 Program 3 Prevention Program\nThe Niagara Falls Plant\u0092s Program 3 Prevention Program consists of the following 12 elements: \n4.1.1 Process Safety Information (§ 68.65)\nThe Niagara Falls plant maintains a variety of technical documents that are used to help ensure safe operation of the plant processes. These documents address 1) physical properties of hazardous substances handled at the plant, 2) operating parameters of the equipment used at the plant, and 3) design basis and configuration of the equipment at the plant. The plant ensures that this process safety information is available to all employees, the LEPC, the Niagara Falls Fire Department, the Niagara Falls Memorial Medical Center, and the Niagara County Sheriff's Office.\nGHS-compliant material safety data sheets (SDS\u0092s) document the physical properties of the hazardous m"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000117605,
      "SummaryText": "aterials handled at the plant, including regulated substances in covered processes. The information available for each hazardous substance typically includes:\n- Toxicity information and permissible exposure limits\n- Physical data (e.g., boiling point, melting point, flash point)\n- Reactivity and corrosively data\n- Thermal and chemical stability data\n- Hazards of mixing substances in the process\n\nSDS\u0092s for hazardous substances handled in each process are available via plant computer server or hard copies in the shift supervisor's office.\nIn addition, SDS for products stored in amounts exceeding applicable EPCRA Tier II thresholds are provided to the LEPC and the fire department for use in helping formulate emergency response plans.\nThe engineering design documents include the operating parameters and the design basis and configuration of the equipment in each covered process. The available information may include:\n* Operating parameters\n* Block flow or simplified process flow diagrams\n* Process chemistry\n* Maximum intended inventories\n* Safe upper and lower limits for parameters such as temperature, pressure, or flow\n* Consequences of deviations from established operating limits\n* Design basis and configuration of equipment\n* Piping and instrumentation diagrams, including materials of construction\n* Electrical classification\n* Safety systems\n* Applicable design codes and standards\n* Design basis for relief and ventilation systems\n\nWhen important information was not available from the design documents, it was developed through special projects or, in the case of operating parameters, during process hazard analyses of the process. Many of the operating parameters are included in the operating procedures to help with the safe operation of the process. These documents are used to 1) train employees, 2) perform process hazards analyses and, 3) help maintain the equipment.\n\n4.1.2 Process Hazard Analysis (§ 68.67)\nThe Niagara Falls plant performs and updates, within five ye"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000117605,
      "SummaryText": "ars as required by OSHA, process hazard analyses (PHA's) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience, maintenance and process operators from the covered area, and a leader with process hazard analysis experience was assembled to analyze the hazards of the process. The plant primarily uses the \"what if checklist\" technique to perform this analysis. The PHA team prepared a written report describing the results of the analysis, including a list of recommendations. Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n4.1.3 Operating Procedures (§ 68.69)\nNiagara Falls plant process engineers, operators, and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed. The operating procedures 1) are used to train employees and 2) serve as reference guides for appropriate actions to take during both normal operations and process upsets. Operating procedures include:\n* Steps for safely conducting activities\n* Applicable process safety information, such as safe operating limits and consequences of process deviations\n* Procedures for safe work practices such as Lock, Tag and Try; Hot Work; Confined Space Entry; and Line Breaking\n* Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs \n\nPlant personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations. The operating procedures are used both to help in operating"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000117605,
      "SummaryText": "the plant's processes and as a training guide.\n\n4.1.4 Training (§ 68.71)\nThe Niagara Falls plant trains its workers to safely and effectively perform their assigned tasks. The training program includes both initial and refresher training that covers 1) a general overview of the process, 2) the properties and hazards of the substances in the process, and 3) a detailed review of the process operating procedures and safe work practices. Oral reviews and written tests are used to verify that an employee understands the training material before the employee can resume work in the process. The operators are consulted at safety meetings to evaluate the effectiveness and frequency of the training. Recommendations from the operators are reviewed, and changes to the training program are implemented as appropriate. The site currently maintains a full-time Training Supervisor.\n\n4.1.5 Mechanical Integrity (§ 68.73)\nThe Niagara Falls plant maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The mechanical integrity program includes 1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and 2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plant\u0092s processes.\nThe mechanical integrity program includes:\n* Specifications for inspection and testing of process equipment\n* Specifications for replacement parts and equipment\n* Procedures for inspecting, testing, and maintaining process equipment\n* Training of maintenance personnel\n* Documentation of maintenance activities\n\n4.1.6 Management of Change (§ 68.75)\nThe Niagara Falls plant Management of Change (MOC) program evaluates and approves all proposed changes to chemicals, equipment, procedures and salary personnel changes for a covered process to help ensure that the change does not negatively a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000117605,
      "SummaryText": "ffect safe operations. Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change program. All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n\n4.1.7 Pre-startup Review (§ 68.77)\nThe Niagara Falls plant performs a Pre-Startup Safety Review (PSSR) of a new or modified process, as required, before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n* Construction and equipment are in accordance with design specifications\n* Adequate safety, operating, maintenance, and emergency procedures are in place\n* Employee training has been completed\n* For a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\n A pre-startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n\n4.1.8 Compliance Audit (§ 68.79)\nThe Niagara Falls plant audits covered processes to ensure that the prevention program is effectively addressing the safety issues of operations at the plant. The plant assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\nThese audits are conducted at regular intervals, every  3"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000117605,
      "SummaryText": "years.\n\n4.1.9 Incident Investigation (§ 68.81)\nThe Niagara Falls plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future. The plant trains employees to identify and report any incident requiring investigation. An investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are tracked and resolved, and appropriate process enhancements are implemented.\n\n4.1.10 Employee Participation (§ 68.83)\nThe Niagara Falls plant requires that wage roll employees representing affected areas participate in PHAs, MOCs, PSSRs, safety improvement team meetings, and where appropriate, incident investigations. This participation is arranged in conjunction with the union.\n\n4.1.11 Hot Work Permits (§ 68.85)\nThe Niagara Falls plant established a hot work permit program to control spark or flame producing activities that could result in fires or explosions in covered processes at the plant. The plant reviewed OSHA\u0092s fire prevention and protection requirements in 29 CFR 1910.25(a) and created a Hot Work Permit Form to comply with these requirements. Personnel who are to perform hot work are required to fill out the Hot Work Permit Form. The Shift Supervisor reviews the completed form before work can begin. Training in the use of the Hot Work Permit Form is included in the plant\u0092s safe work practices orientation.\n\n4.1.12 Contractors (§ 68.87)\nThe Niagara Falls plant established a program to help ensure that contractor activities at the plant are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the plant only hires contractors who can safely perform the desired job tasks. A mandatory contractor safety orientation explains to the contract supervisors the hazards of the process on which they and their em"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000117605,
      "SummaryText": "ployees will work, the plant\u0092s safe work practices, and the plant\u0092s emergency response procedures. The plant requires that the contractor supervisors train each of their employees who will work at the plant before that worker begins work at the plant site. The plant periodically reviews work performance to help ensure that safe practices are followed. \n\n5. The Five-Year Accident History (68.155[e]) \nFrom October 2019 through October 2024, the Durez Niagara Falls Facility has had no releases from a covered process involving a regulated substance held above its threshold quantity in the process. There has been no release causing offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\n6. The Emergency Response Programs (68.155[f])\nThe facility has established a written emergency response program to help safely respond to accidental releases of hazardous substances. The emergency response plan which was last updated in August 2024 is available to the Niagara Falls Fire Department, the Niagara Falls Police Department, local hospitals, the Niagara County LEPC, NYSDEC and the City of Niagara Falls Wastewater Treatment Plant. The plan includes procedures for the following:\n* Informing the local fire department and the public about accidental releases that could reasonably result in offsite consequences.\n* Provide proper first aid and emergency medical treatment to accidental human exposure to hazardous substances at the plant.\n* Controlling and containing accidental releases of hazardous substances including the use of emergency response equipment.\n* Inspecting and maintaining emergency response equipment.\n* Reviewing and updating the emergency response plan.\n\nThe Niagara Falls facility maintains an emergency response team trained in the emergency response procedures. All plant personnel are trained in evacuation procedures. The plant periodically conducts emergency response drills and provides annual tours for the local fire d"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000117605,
      "SummaryText": "epartment. The written emergency response plan complies with the following federal, state and local regulations:\n* OSHA 29 CFR 1910.38(a) - Employee Emergency Action Plans\n* OSHA 29 CFR 1910.119(n) - Process Safety Management of Highly Explosive Chemicals\n* OSHA 29 CFR 1910.120(p) and (q) - Hazardous Waste Operations & Emergency Response\n* OSHA 29 CFR 1910, Subpart L - Fire Protection\n* EPA 40 CFR Part 302.6 - Notification Requirements\n* EPA 40 CFR Part 355.30 - Facility Coordinator & Emergency Response Plan\n* EPA 40 CFR Part 355.40 - Emergency Release Notifications\n* EPA 40 Part 112 - Spill Prevention, Control & Countermeasures Plan\n* EPA 40 CFR Part 68 - Risk Management Programs for Chemical Accidental Release Prevention\n* EPA RCRA 40 CFR Part 264 Subparts C & D\n* City of Niagara Falls, Wastewater Discharge Permit Section C, Sludge Control Plan\n* EPA 40 CFR Part 63 - Hazardous Waste Combustor MACT\n* NYCRR Title 6, Part 201-6.6C - Emergency Reporting\n* EPA 40 CFR 68 - Risk Management Programs for Chemical Accidental Release Prevention\n\nThe emergency response plan has been communicated to the local response officials through the local fire department, hospital, and LEPC. The plan is also on file with the NYSDEC. The plant maintains and trains an emergency response team which is available during production hours to respond to plant emergencies. The team has access to on site incipient emergency equipment which is appropriate for the anticipated emergency situation and capabilities of Durez personnel. Durez would utilize outside cleanup/recovery contractors, as needed, as well as direct support from the local fire department emergency response team.\n\n7. Planned Changes to Improve Safety (68.155[g])\nThe Durez facility constantly strives to improve the safety of the processes at the facility through both incident investigation programs, safety/environmental audits and soliciting safety suggestions from all employees.\nThe site is ISO 45001-2018, which contains requiremen"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000117605,
      "SummaryText": "ts for continuous improvement. Annual Goals and Objectives are identified and posted each year. \n\n8. Certification (40 CFR 68.185[b])\nTo the best of my knowledge, information and belief formed after reasonable inquiry, the information submitted is true, accurate and complete."
    }
  ]
}