{
  "FacilityID": 1000011245,
  "FacilityName": "Western Wisconsin Energy, LLC",
  "FacilityStr1": "N10185 370th Street",
  "FacilityStr2": null,
  "FacilityCity": "Boyceville",
  "FacilityState": "WI",
  "FacilityZipCode": "54725",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55033",
  "LEPC": "Dunn County LEPC",
  "FacilityLatDecDegs": "45.05172",
  "FacilityLongDecDegs": "-091.98026",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Western Wisconsin Energy, LLC",
  "OperatorStr1": "N1085 370th Street",
  "OperatorStr2": null,
  "OperatorCity": "Boyceville",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54725",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Maska",
  "RMPTitle": "EHS Manager",
  "FTE": 38,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209357",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-10-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-10-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "227",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013437,
      "AltID": "Anhydrous Ammonia Tank",
      "FacilityID": 1000011245,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013797,
          "ProcessID": 1000013437,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015422,
          "ProcessID": 1000013437,
          "ChemicalID": 56,
          "Quantity": 86400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515422,
          "ProcessID": 1000013437,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000013438,
      "AltID": "Denaturant Tank",
      "FacilityID": 1000011245,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013798,
          "ProcessID": 1000013438,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015423,
          "ProcessID": 1000013438,
          "ChemicalID": 125,
          "Quantity": 664698.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515423,
          "ProcessID": 1000013438,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011245,
      "SummaryText": "Western Wisconsin Energy, LLC operates an ethanol fuel production plant located in the city of Boyceville, in Dunn County, Wisconsin.  As a requirement of the Federal Environmental Protection Agency (EPA) and Title 40 CFR Part 68 A? Chemical Accident Prevention Provisions, Western Wisconsin Energy, LLC has completed a Risk Management Plan (RMP) for chemicals stored on-site above RMP reporting thresholds. Regulated chemicals at Western Wisconsin Energy, LLC include pentane (exceeds 10,000 pound threshold) and anhydrous ammonia (exceeds 10,000 pound threshold).\n\nAccidental Release Prevention and Emergency Response Policies\n\nWestern Wisconsin Energy, LLC is committed to the protection of its employees, the greater community and the environment from hazardous substances used in the ethanol production process, specifically anhydrous ammonia and pentane (constituent of the natural gasoline used as a denaturant).  The ammonia is used for pH control directly in the process feed mixture to fermentation.  The denaturant is added to ethanol to make the ethanol unfit for human consumption.  It is the policy of Western Wisconsin Energy, LLC to comply with all applicable federal, state, and local laws.  In the event of an emergency, including an accidental release of toxics and flammables, it is the policy of Western Wisconsin Energy, LLC to notify the Boyceville Fire Department and the Dunn County Emergency Management and evacuate all employees at the facility.  \n\nRegulated Substances Handled\n\nThe facility produces fuel grade ethanol from corn and a process by-product known as wet distillers' grain with solubles, which is used as a livestock feed.  Anyhydrous ammonia is stored on-site and used in the ethanol production process for pH control.  The maximum amount of aqueous ammonia stored is approximately 86,400 pounds.  The fuel ethanol production process requires use of a denaturant (natural gasoline) which may contain approximately 40 percent pentane, an RMP-regulated substanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011245,
      "SummaryText": "e.  The maximum amount of denaturant on-site is approximately 664,698 pounds.  The natural gasoline is stored in an above ground tank as a liquid and is mixed with the fuel ethanol in the final stage of production; this tank is located in the facility tank farm area, which includes a secondary containment dike.  Unleaded fuel may also be used as a denaturant in place of natural gasoline and does not contain any regulated constituents above the threshold quantity.  Western Wisconsin Energy, LLC has evaluated the worst-case and alternative case scenarios as they relate to the regulated substances.  An Emergency Response Program is currently being implemented. Western Wisconsin Energy, LLC has coordinated emergency response with the local authorities and will conduct periodic drills.  \n\nGeneral Accidental Release Prevention Program\n\nThrough completion of this RMP, Western Wisconsin Energy, LLC has complied with the EPA requirements under 40 CFR Part 68 and OSHA Process Safety Management (PSM) requirements under 29 CFR 1910.119.  Process safety information, safe work practices such as Hot Work, Confined Space Entry and Lockout/Tagout, and operations and maintenance procedures are documented on-site as part of the facility PSM/RMP Prevention Program.  Periodic functions such as process hazard analysis, training, management of change, and pre-startup safety reviews are conducted on a regular basis as outlined in the PSM/RMP Prevention Program.  Audits of the overall RMP and Prevention Program will be conducted on a regular basis to assure compliance with EPA regulations.\n\nFive Year Accident History\n\nWestern Wisconsin Energy, LLC does not have a history of accidents related to RMP-regulated programs which may have caused death, injuries, environmental or property damage, evacuations or in-place sheltering in the last five years. \n\nEmergency Response Program\n\nWestern Wisconsin Energy, LLC is has developed their own written emergency response plan.  This plan includes action"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011245,
      "SummaryText": "s to respond to accidental releases of regulated substances, actions to inform the public and local agencies responding to accidental releases and emergency health care information.  Western Wisconsin Energy, LLC routinely conducts employee training on the emergency response plan and periodically evaluates the plan for necessary revisions.\n\nPlanned Changes to Improve Safety\n\nWestern Wisconsin Energy, LLC completed a Process Hazard Analysis (PHA) of the aqueous ammonia and flammables processes on August 17, 2006. A number of recommendations to improve facility safety were accepted as part of the PHA process, and a timeline was developed to track the recommendations to completion.  A complete summary of the PHA process and recommendation tracking progress is maintained at the facility.  \n\nIn addition to the referenced PHA, below is a list of Western Wisconsin Energy, LLCA?s planned changes:\n\nBefore conducting the next PHA the plant will update process safety information data for the regulated processes.\n\nFacility plans to conduct a PHA that expands the scope of the PHA to further assess hazards associated with the regulated processes.\n\nContinue auditing contractors performing work on equipment with associated regulated processes to ensure they are meeting the requirements of the Contractor Program.\n\nUpdate operating procedures to further address potential hazards associated with RMP regulated materials during operation.\n\n"
    }
  ]
}