{
  "FacilityID": 1000086527,
  "FacilityName": "CC-Utica Condensate Stabilization Facility",
  "FacilityStr1": "222 Dragstrip Road",
  "FacilityStr2": null,
  "FacilityCity": "Belpre",
  "FacilityState": "OH",
  "FacilityZipCode": "45714",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39167",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "39.280246",
  "FacilityLongDecDegs": "-81.630773",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "4500 Brooktree Rd.",
  "FacilityEmailAddress": "info@centralcrude.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Central Crude, LLC",
  "Company2Name": null,
  "CompanyDUNS": 117345028,
  "Company2DUNS": null,
  "OperatorName": "CC-Utica, LLC",
  "OperatorStr1": "222 Dragstrip Road",
  "OperatorStr2": null,
  "OperatorCity": "Belpre",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45714",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230109",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-07-24 00:00:00",
  "SafetyInspectionBy": "U.S. Coast Guard",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-04-16 13:29:36",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-04-16 13:29:36",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-04-16 13:29:36",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-04-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.28142,
  "FRS_Long": -81.63217,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107959,
      "AltID": "Condensate Stabilization",
      "FacilityID": 1000086527,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000135001,
          "ProcessID": 1000107959,
          "ChemicalID": 155,
          "Quantity": 118652.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000119225,
              "ProcessChemicalID": 1000135001,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000119226,
              "ProcessChemicalID": 1000135001,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000119227,
              "ProcessChemicalID": 1000135001,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000119228,
              "ProcessChemicalID": 1000135001,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000119229,
              "ProcessChemicalID": 1000135001,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000119230,
              "ProcessChemicalID": 1000135001,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000109270,
          "ProcessID": 1000107959,
          "NAICSCode": "32419",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000091559,
              "Process_NAICS_ID": 1000109270,
              "SafetyReviewDate": "2020-02-28 00:00:00",
              "PHA_Date": "2018-11-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-05-12 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Freezing Temperatures",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Monitor",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Cameras viewed at operations center",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-08-16 00:00:00",
              "TrainingReviewDate": "2017-08-23 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-03-10 00:00:00",
              "EquipmentInspectionDate": "2016-07-01 00:00:00",
              "EquipmentTested": "TK-1101, NGL Storage Tank",
              "ChangeMgmtDate": "2019-12-09 00:00:00",
              "ChangeMgmtReviewDate": "2019-12-11 00:00:00",
              "PreStartupReviewDate": "2019-12-11 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-08-16 00:00:00",
              "HotWorkPermitReviewDate": "2019-04-28 00:00:00",
              "ContractorSafetyReviewDate": "2019-08-16 00:00:00",
              "ContractorSafetyEvalDate": "2019-08-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000113819,
                  "PreventionProgram3ID": 1000091559,
                  "ProcessChemicalID": 1000135001
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000086527,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-02-11 00:00:00",
    "ERTrainingDate": "2020-02-11 00:00:00",
    "CoordinatingAgencyName": "Washington County LEPC",
    "CoordinatingAgencyPhone": "7403735613",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086527,
      "SummaryText": "n a 30,000 gallon, horizontal storage tank. NGLs will be trucked offsite on a routine basis.\r\n\r\nThe general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\r\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 Code of Federal Regulations (CFR) Part 68 of the EPA. The following sections briefly describe the elements of the release prevention program that is in place at this facility.\r\n\r\nProcess Safety Information - Written process safety information regarding the natural gas condensate stabilization process and NGL storage tank was compiled to enable employees involved in the operating process to identify and understand the potential hazards of the process.\r\n\r\nProcess Hazard Analysis - In order to identify the process hazards associated with the facility, CCU conducted a Process Hazard Analysis (PHA). The primary method of PHA selected was the Hazard and Operability (HAZOP) Study. The HAZOP Study is a scenario-based method of hazard evaluation that was developed for continuous and batch plant processes. The HAZOP Study was judged to be an effective method of hazard evaluation for the majority of the processes being evaluated by CCU. A What-If analysis was used as a secondary method of analysis for processes that did not require the in-depth analysis of the HAZOP method. These included the stabilizer package and the NGL tank/pump loading skid. Review and updates of the process hazard analysis will be conducted every 5 years. \r\n \r\nOperating Procedures - Standard Operating Procedures (SOPs) provide clear instructions for properly conducting all activities associated with the natural gas condensate stabilization process and NGL storage tank equipment. Operating procedures are reviewed annually for content and accuracy.\r\n\r\nTraining - The intent of the training program is to increase employee awareness of the process hazards that are associated with t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086527,
      "SummaryText": "he natural gas condensate stabilization process and NGL storage tank. Each new employee involved with the process is trained with an overview and the proper operating procedures. Refresher training is conducted annually and whenever a process change is made.\r\n\r\nMechanical Integrity - Equipment used to process, store or handle natural gas condensate and NGL is designed, constructed, and maintained in order to minimize the risk of a flammable release and explosion. The frequency of mechanical inspections depends upon the part of the system being inspected and in accordance with the manufacturer's recommendations.\r\n\r\nManagement of Change - Prior to implementing a change in the natural gas condensate stabilization process and NGL storage tank operation, the change is identified, reviewed, and authorized prior to implementation. A process change authorization is required for any changes to ensure the operating procedures contain the proper operating parameters and highlights the importance of operating within the limits. Management of change covers changes such as process technology changes and changes to equipment and instrumentation.\r\n\r\nPre-Startup Review - Prior to startup of a changed process or affected part of the process, employees involved in operating the process, maintaining the process, and contract employees affected by a change are informed of and trained in the changes. Additionally, process safety information and operating procedures are updated to reflect the changes necessary.\r\n\r\nCompliance Audits - RMP compliance audits will be conducted at least every three (3) years. The audit procedures include an examination of the written RMP Plan and documentation, interviews with responsible personnel, and visual inspections of the site and equipment. A standard audit form is used to document each step and to ensure an effective audit is conducted and proper follow-up is accomplished.  \r\n\r\nIncident Investigation - Incidents that result in or could have resulted i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086527,
      "SummaryText": "n a release of the flammable mixture/explosion are investigated immediately. Each incident is investigated in an attempt to identify the root cause of the incident and to implement corrective actions to prevent future incidents. The incident investigation elements include a description of the accident, process description, process flow diagram, recommendations and review with affected personnel.\r\nEmployee Participation - Employee participation is a required element in Process Safety Management and Risk Management. Employees have ready access to elements of the RMP Plan. Employees involved with the operation of the natural gas condensate stabilization process and NGL storage tank receive detailed training for the activities relating to the operation and maintenance of the process. New employees receive training prior to being allowed to operate any portion of the system.\r\n\r\nHot Work Permit - The hot work permits issued at the facility document that all fire prevention and protection requirements have been implemented prior to the start of any hot work operations. Each issued permit identifies the date(s) authorized to perform the hot work and the equipment on which the hot work is to be performed, as well as site preparation and safety equipment requirements and documentation.\r\n\r\nContractors - Prior to starting any work on or adjacent to the natural gas condensate stabilization process equipment and NGL storage tank, contractors are required to provide detailed information regarding their safety and health performance record. Contractors are then informed of potential hazards they may be exposed to; emergency action plans in place and required safe work practices. They are also informed of their responsibilities to ensure that their employees receive the necessary training. Periodic inspections of the contractor's performance are conducted to ensure safe work practices are being followed. Documentation is maintained that the listed requirements have been met.\r\n\r\nChem"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000086527,
      "SummaryText": "ical Specific Prevention Steps - The natural gas condensate stabilization process including NGL storage has hazards that must be managed to ensure continued safe operation. Safety features applicable to prevention of accidental releases of regulated substances at the facility are in place to help prevent potential accidental scenarios that could be caused by equipment failures and human error. The facility has safety features on many units to help (a) contain/control a release (e.g., excess flow and isolation valves); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms),and (c) reduce the consequences of (mitigate) a release (e.g., fire suppression and extinguishing).\r\n\r\nThe five-year accident history [40 CFR 68.155(d)]:\r\nThe CCU Belpre facility has had zero RMP reportable incidents in the previous five years.\r\n\r\nThe emergency response program [40 CFR 68.155(e)]:\r\nThe facility has an Integrated Facility Response Plan/Emergency Response Plan which has been coordinated and reviewed by the U.S. Coast Guard, the Washington County Local Emergency Planning Committee (LEPC), and the Belpre Volunteer Fire Department. This program includes an emergency response and notification plan. Emergency response drills and/or evaluations are conducted annually.\r\n\r\nPlanned changes to improve safety [40 CFR 68.155(f)]:\r\nCCU is committed to continuous improvement and looks for opportunities to improve safety systems and programs at the facility."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086527,
      "SummaryText": "This is an executive summary of the policies, procedures and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for Central Crude, LLC. (CCU) Condensate Stabilization Facility.\r\n\r\nThe accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\r\nCCU's accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. This Risk Management Plan (RMP) involves the preparation of response plans that are tailored to this facility and to the emergency response services available in the community. \r\n\r\nThe stationary source and regulated substances handled [40 CFR 68.155(b)]:\r\nStationary Source, Regulated Substances Handles & Covered Process:\r\nThe CCU Belpre Condensate Stabilization Facility, located at 222 Dragstrip Road, Belpre, Ohio 45714, includes two (2) stabilization process units, condensate storage tanks, tanker truck loading and unloading stations, propane storage tank, flares and facility dock for barge loading on the Ohio River. The site has one regulated substance, a flammable mixture of Natural Gas Liquids (NGL), stored in an aboveground storage tank above the RMP threshold amount. The storage tank is located central to the facility. Unprocessed natural gas condensate will be received by truck from nearby natural gas production wells, stabilized, and loaded onto river barges for transport to customers. The unprocessed natural gas condensate consists of a mixture of hydrocarbons including propane, butane, isobutane, and pentane. Two holding tanks will provide storage capacity for the stabilized and un-stabilized natural gas condensate. Each of these tanks can hold up to 60,000 barrels of natural gas condensate. Y-Grade NGLs are produced as a byproduct of the stabilization process. The NGLs will be collected separately i"
    }
  ]
}