{
  "FacilityID": 1000073843,
  "FacilityName": "Pure Chem Products, Inc",
  "FacilityStr1": "8371 Monroe Ave",
  "FacilityStr2": null,
  "FacilityCity": "Stanton",
  "FacilityState": "CA",
  "FacilityZipCode": "90680",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.805974",
  "FacilityLongDecDegs": "-117.986368",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Zep, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alex C. Fergusson, LLC",
  "OperatorStr1": "5121 Coffey Ave",
  "OperatorStr2": null,
  "OperatorCity": "Chambersburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Reggie Carmouche",
  "RMPTitle": "Plant Manager",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000240321",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092101,
      "AltID": "PAA",
      "FacilityID": 1000073843,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093323,
          "ProcessID": 1000092101,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115011,
          "ProcessID": 1000092101,
          "ChemicalID": 18,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 18,
            "ChemicalName": "Peracetic acid  [Ethaneperoxoic acid]",
            "CASNumber": "79-21-0",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615011,
          "ProcessID": 1000092101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073843,
      "SummaryText": "PURE CHEM/STANTON EXECUTIVE SUMMARY\n\n\n\nSince 1855, AFCO has been delivering chemical, process, training, equipment and distribution solutions to leaders in the food, beverage, and hospitality indus?tries that help them operate at the best and highest levels of sanitation, productivity and profitability. AFCO is a full-service partner through?out all areas of the client facilities and their process management. Working alongside our clients AFCO delivers expertise and hands-on support to help meet sanitation, compliance and operational needs efficiently and cost-effectively.\n\nThe 6,400 square foot Pure Chem/Stanton warehouse facility serves as a production and distribution site of AFCO cleaning, sanitation and maintenance products.  AFCO provides a full range of services connected with our products, including consultation, training, equipment designed to deliver our products, and customer site service. \n\n\n\nThe peracetic acid products which are received and stored in various containers, including 330-gallon totes, 55 gallon drums, and smaller (1-5 gallon) containers.  The warehouse section of the Stanton facility stores and ships these products to customers.  The Stanton site does not blend or peracetic acid products or repack from larger to smaller containers.  \n\n\n\nBased on the materials handled, and offsite consequence analysis, the Stanton facility is characterized as a Program Level 2 facility.\n\n\n\nAFCO implements an accidental release prevention policy to ensure compliance with the EPA RMP regulation.  The accidental release prevention program includes:\n\n?    Process Safety Information, which includes:\n\no    SDS sheets for products containing peracetic acid, \n\no    safety information for the peracetic acid products \n\no    inventory which is an ongoing update of quantities products containing peracetic acid on hand; \n\no    warehouse layout \n\no    design codes and standards utilized in construction and project engineering,\n\n?    Process Hazard Analysis (PHA)/Risk Assessment, this include"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073843,
      "SummaryText": "s a process hazard analysis for peracetic acid product storage and handling.  The PHA analyzes scenarios that represent deviations from normal operation, the causes and consequences of these deviations, the safeguards in place to prevent or mitigate releases of hazardous materials, a qualitative assessment of the risk of these scenarios (using a risk matrix for scenario severity and likelihood) and the identification of any recommendations to prevent or mitigate risk; \n\n?    Standard Operating Procedures which include  instructions on handling peracetic acid products,\n\n?    Training - including training for operators handling peracetic acid products, in addition to emergency response training, and OSHA-required safety training, such as hazard communications, personal protective equipment, hearing protection, etc.\n\n?    Incident Investigations and Procedures - which is a list of all incidents or near miss occurrences, the results of investigation into those incidents, and follow-up documentation of corrective actions; \n\n?    Mechanical Integrity/Maintenance program - inspection, testing and preventive maintenance for the equipment and instrumentation utilized in peracetic acid handling\n\n?    Compliance Audits - which documents the findings and corrective actions from internal and external site audits, including insurance company audits.\n\n\n\nFive-year accident history - there have been no accidents in the previous five years that meet the RMP requirements for inclusion in the RMP submittal.\n\n\n\nEmergency response - the Stanton site maintains an up-to-date emergency action plan.  The plan details the actions plant employees would take in the event of a release of peracetic acid, incidents involving other substances, fires, and health emergencies.  The plan details the means to notify all workers of incidents and actions to be taken, such as site evacuation and headcount; and includes contact information for local emergency response organizations, including the Stanton Fire Department. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073843,
      "SummaryText": "Evacuation plans are available and evacuation escape plan maps can be found throughout the facility.  The site maintains inventories of emergency equipment and supplies on site.  The response plan has been reviewed with the local emergency response organizations.\n\n"
    }
  ]
}