{
  "FacilityID": 1000084468,
  "FacilityName": "Rinchem Company Inc. - Savannah Export CSC 40",
  "FacilityStr1": "5565 Export Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Garden City",
  "FacilityState": "GA",
  "FacilityZipCode": "31408",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13051",
  "LEPC": "Chatham County LEPC",
  "FacilityLatDecDegs": "32.1237",
  "FacilityLongDecDegs": "-81.1714",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.rinchem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rinchem Company Inc.",
  "OperatorStr1": "5131 Masthead",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87109",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kelly Martin",
  "RMPTitle": "Facility manager",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217366",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-27 00:00:00",
  "SafetyInspectionBy": "DHS CFATS",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105480,
      "AltID": "Warehousing of Chemicals",
      "FacilityID": 1000084468,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106794,
          "ProcessID": 1000105480,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132107,
          "ProcessID": 1000105480,
          "ChemicalID": 21,
          "Quantity": 200000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000132108,
          "ProcessID": 1000105480,
          "ChemicalID": 52,
          "Quantity": 85000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 52,
            "ChemicalName": "Boron trifluoride  [Borane, trifluoro-]",
            "CASNumber": "7637-07-2",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000132109,
          "ProcessID": 1000105480,
          "ChemicalID": 54,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000132110,
          "ProcessID": 1000105480,
          "ChemicalID": 57,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632107,
          "ProcessID": 1000105480,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632108,
          "ProcessID": 1000105480,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632109,
          "ProcessID": 1000105480,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632110,
          "ProcessID": 1000105480,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084468,
      "SummaryText": "1.0 Executive Summary\n\n1.1. The Accidental Release Prevention and Emergency Response Policies at the Rinchem Company Inc.,\n\nSavannah, GA Facility\n\nRinchem Company, Inc. (Rinchem) is committed to being a responsible member of the community in which it operates by giving top priority to operating in a safe and environmentally sound manner. Policy dictates that Rinchem personnel continuously identify methods to reduce the risk of handling hazardous materials and to reduce the risk to the community and environment through implementation of new technology and procedures. This commitment to safe and environmentally sound operations is documented in the Team Member Handbook, and the mission statement, which are available to all employees. The Safety and Health policy states:\n\nSAFETY FIRST is more than a slogan at Rinchem...it is a way of life. Rinchem Company, Inc., is committed to providing a safe working environment for its staff members, its customers and the public, and maintains that\n\n\"NO JOB IS MORE IMPORTANT THAN THE HEALTH AND SAFETY OF OUR STAFF MEMBERS, OUR\n\nCOMMUNITIES, AND THE ENVIRONMENT\".\n\nWe recognize that the responsibilities for safety and health are shared:\n\nManagement, the VP of Operations, accepts the responsibility for leadership of the safety and health program, for its effectiveness and improvement, and for providing the safeguards required to ensure safe conditions.\n\nManagers and supervisors are responsible for ensuring processes are documented which reinforce safety as well as the use of engineering controls as the preferred method of promoting safety and eliminating unsafe conditions.\n\nStaff members are responsible for cooperation with all aspects of the safety and health program including compliance with all rules, documented procedures, and regulations and for continuously practicing safety while performing their duties.\n\nStaff members are responsible for stopping activities that may lead to injuries to themselves or others.\n\nStaff members, bein"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084468,
      "SummaryText": "g the most familiar with actual operations, are responsible to document suggestions for continual improvements.\n\nEach employee is granted the authority to stop work if it is deemed unsafe. The job will not be continued until the work methods are evaluated and changed, if necessary, to make the work area safe.\n\nManagement continues to do all it can to protect the Health and Safety of all staff and to provide a safe working environment. However, safety requires the participation of everyone...only you can make safety a reality. Be alert for conditions which appear unsafe. Report unsafe conditions immediately. Report any accident, \"near miss\", exposure, incident, spill or release.\n\n\n\n1.2. A Description of the Savannah, GA Facility and Regulated Substances Handled\n\n1.2.1. Description of the Savannah, GA Facility\n\nThe Savannah, GA facility is located at 5565 Export Blvd., Garden City, GA 31408. The facility provides transportation and public warehousing services for manufacturers, distributors and end users of prepackaged specialty chemicals. Warehousing activities include shipping, receiving and storage of chemicals as specified by customer requirements. The chemicals stored at the Savannah, GA Warehouse include chemicals containing toxic hazards. Boron Trifluoride, Hydrogen Chloride, anhydrous, Ammonium solutions > 20% & Epichlorohydrin are the only RMP regulated substances handled at the site.\n\n1.2.2. Description of the Warehousing and Storage Processes\n\nRinchem receives Boron Trifluoride, Hydrogen Chloride, anhydrous, Ammonium solutions > 20% & Epichlorohydrin by truck as shipped from the manufacturer or distributor. It is unloaded from the truck using a forklift and staged for inspection. After the material passes quality and safety inspection, it is placed into the hazard specific storage area until it is shipped to the end user. The storage location of each material is tracked in an electronic inventory management system.\n\nAfter an order is received, Rinchem ships"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084468,
      "SummaryText": " the above listed chemical as ordered by the end user. The material is picked and staged for quality and safety inspection. After the material passes inspection, it is loaded on to a truck for shipment using a forklift.\n\n1.3. The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps Rinchem management realizes that implementation of appropriate administrative and technological safeguards ensure the safety of the workers and the continued safety of public receptors. Those recommendations that are planned for implementation will be discussed in \"Planned Changes to Improve\n\nSafety\". The safeguards shown include both administrative and technological safeguards that prevent, detect, or mitigate releases of chlorine.\n\n1.4. The Five Year Accident History\n\nThere has never been a reportable accident involving Boron Trifluoride, Hydrogen Chloride, anhydrous, Ammonium solutions > 20% & Epichlorohydrin or any other chemical at the Rinchem Company Inc, Savannah, GA Warehouse.\n\n1.5. The Emergency Response Program\n\nOverall safety at the Rinchem Company, Inc, Savannah, GA Warehouse is governed not only by our ability to prevent accidental releases of Boron Trifluoride, Hydrogen Chloride, anhydrous, Ammonium solutions > 20% & Epichlorohydrin from occurring, but also by the ability to mitigate any accidental releases of the above-mentioned materials. Rinchem has contracted an emergency response team to minimize the effects of accidental releases of Boron Trifluoride, Hydrogen Chloride, anhydrous, Ammonium solutions > 20% & Epichlorohydrin to employees (vapor dispersion modeling demonstrates no impact to public receptors). Rinchem management has opted not to respond to releases of these chemicals by containing the spill when it can be safely done and using contracted services for spill cleanup.\n\nThe Savannah, GA Warehouse Emergency Response Program consists of:\n\n Emergency Action Plan and Contingency Plan, (SOP 7900 F1)\n\nEnvironmental, Safety, and Health"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084468,
      "SummaryText": " Reporting (SOP 1502)\n\nEmergency Evacuation Plan (SOP 7900 F1 BCP)\n\nThe Emergency Action Response Program outlines the instructions and required information in order to respond to fire, chemical spills, natural disasters and other emergencies that may arise. The emergency action response plan and documents are reviewed at least annually and revised as necessary to reflect changes that may occur to content and structure of the plan.\n\n1.6 PLANNED CHANGES TO IMPROVE SAFETY\n\nRinchem will review all PHA recommendations currently to address improvement to safety at the facility.  Rinchem's procedures, safety policies, facility design and many other preventative measures are adequate to keep its employees, the community and the environment safe.  However, we are committed to continue working our corrective action process to monitor and improve the safety of all operations. \n\n"
    }
  ]
}