{
  "FacilityID": 1000020725,
  "FacilityName": "Wamsutter LLC Echo Springs Plant",
  "FacilityStr1": "Township 19-N, Range 93-W, Section1",
  "FacilityStr2": "Exit 184 Off I-80, 8 Miles South",
  "FacilityCity": "Wamsutter",
  "FacilityState": "WY",
  "FacilityZipCode": "82336",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56007",
  "LEPC": "Carbon County LEPC",
  "FacilityLatDecDegs": "41.647000",
  "FacilityLongDecDegs": "-107.824000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Williams Field Services Company LLC",
  "Company2Name": "Williams Field Services Group LLC",
  "CompanyDUNS": 931124309,
  "Company2DUNS": 931124309,
  "OperatorName": "Williams Field Services Company LLC",
  "OperatorStr1": "P.O. Box 158",
  "OperatorStr2": "Exit 184 Off I-80 8 Miles South",
  "OperatorCity": "Wamsutter",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82336",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "WY0070005",
  "EPAFacilityID": "100000137586",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "3-1-016-2",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-03-09 09:05:58",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-02-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-02-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-02-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.647,
  "FRS_Long": -107.824,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025281,
      "AltID": "Echo Springs Plant",
      "FacilityID": 1000020725,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030066,
          "ProcessID": 1000025281,
          "ChemicalID": 155,
          "Quantity": 2300000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 103228,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 103229,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 103230,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 103231,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 103232,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 103233,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 103234,
              "ProcessChemicalID": 1000030066,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 1000030067,
          "ProcessID": 1000025281,
          "ChemicalID": 93,
          "Quantity": 23000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000025643,
          "ProcessID": 1000025281,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000020725,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-08-20 00:00:00",
    "ERTrainingDate": "2010-10-25 00:00:00",
    "CoordinatingAgencyName": "Carbon County LEPC",
    "CoordinatingAgencyPhone": "3073242776",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020725,
      "SummaryText": "1.0   Executive Summary:\n\nThe Williams Field Services, Echo Springs Gas Processing Plant, located near Wamsutter, Wyoming, has a long-standing commitment to protecting the safety of our workers and the community.  We invest significant resources in accident prevention, such as, considering safety in design, installation, operation, and maintenance of our facilities.  We implement reasonable controls to prevent foreseeable releases of hazardous substances.  However, if a release should occur, personnel are training to mitigate the release and evacuate the facility if necessary.  Additionally, we have reviewed our facility with local emergency responders to familiarize them with our site and on how to respond to emergencies at our location. \n\nThe Echo Springs plant is a Program Level 1 and has no reportable releases in the 5-year accident history records that resulted in onsite or offsite consequences.  Furthermore, the Echo Springs Plant does not process, produce, or use any of the regulated Toxic substances above the threshold quantities.  There are no environmental or public receptors within the flammable, vapor-cloud explosion, for the worst-case scenario at a 1-psi endpoint of 0.5 miles.   \n\n\n2.0 Description of the Stationary Source and Regulated Substances:\n\nThe Echo Springs Plant, located near Wamsutter, Wyoming, processes natural gas and produces NGL and pipeline quality residue gas, through four Cryogenic plants (P1, P2, P3, and P4).  Temporary storage of the NGL is in five (5) bullet tanks that are used only during pipeline interruptions.  \n\nThe facility processes the following regulated flammable substances (occurring as a mixture):\n\n                 CAS#\n\n        Methane       74-82-8\n\n        Ethane        74-84-0\n\n        Propane    74-98-6\n\n        Butane        106-97-8\n\n        Isobutane    75-28-5\n\n        Pentane    109-66-0\n\n        Isopentane    78-78-4\n\nEcho Springs Processing Plant is a Program Level 1 and there are no regulated Toxic substanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020725,
      "SummaryText": "es processed, produced, or used in the plant above the threshold values.\n \n\n3.0    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following summarizes the accident prevention program in place at the facility.  This summary addresses each of the RMP elements required for a Program Level 1 process and describes the management system in place to implement the accident prevention program.\n\n\n3.1 Employee Participation\n\nThe Williams Echo Springs Gas Processing Plant employees participate in all facets of facility safety management and accident prevention.  Examples of employee participation include participation in: development of the RMP implementation program; HAZOPs; MOC review; Mechanical Integrity issues; development and updating the Operating Procedures; monthly review of the 5-year Accident history; conducting safety audits; planning and contributing during mock emergency drills; personal training and training each other; and, basic monitoring of the facility equipment. \n\nEmployees have access to all information created as part of the facility accident prevention program.  Echo has a local Safety Committee, composed of hourly and salaried personnel, that review accidents, review safety audits, and address safety related issues to identify hazards and prevent accidents.  As a part of RMP, the facility complies with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) program, which improves the safety for the employees and protects the environment at the facility.\n\n\n3.2 Process Safety Information\n\nThe Williams Echo Springs Gas Plant maintains a variety of technical documents that are used to help maintain safe operation of the process.  These documents address chemical properties and associated hazards, limits for key process parameters, an inventory of chemicals stored on-site, and the equipment design basis information.  A table summarizing the reference documents and their location is readily available to help employees loc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020725,
      "SummaryText": "ate any necessary process safety information.\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  The storage and process equipment have documented safety related limits for specific parameters (pressure, overfill, leak detection, and volume received).  The process is maintained using process controls, monitoring instruments, highly trained personnel, and emergency shutdown devices.\n\nWilliams Field Services maintains technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and volume ratings, and electrical area classifications.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\n3.3 Hazard Review\n\nThe team members have conducted several thorough hazard reviews, using the hazard and operability (HAZOP) analysis technique to perform this review.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating, technical, and maintenance experience, as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures.  The team makes suggestions for additional prevention and /or mitigation measures when the team believes such measures are necessary.\n\nThe team findings are forwarded to local and regional management for resolution.    Implementation of mitigation options in response to the hazard review findings is based on a relative risk ranking assigned by the team.  This ranking helps ensure that potential accident scenarios"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000020725,
      "SummaryText": "assigned the highest risk receive immediate attention.  All approved mitigation options in response to the findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the facility periodically updates and revalidates the hazard review information at least every five years.  These periodic reviews are conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  The team findings, just like the original HAZOP results, are forwarded to local and regional management for consideration and the final resolution of the findings is documented and retained.\n\n\n3.4 Operating Procedures\n\nThe Echo Spring's facilities maintain written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  \n\nIn addition, the Echo Spring's facilities maintain a process parameter document that provides guidance on how to respond to upper or lower limit exceedances for specific process or equipment parameters.  This information, along with written operating procedures, is readily available to operators in operations and for other personnel to use as necessary to safely perform their job tasks.\n\n\n3.5 Training\n\nThe written procedures are an integral part of the Operator comprehensive training program for all employees involved in operating the gas processing facilities. New employees receive basic instruction in facility operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000020725,
      "SummaryText": "paired with another operator to learn specific duties and tasks.  After operators demonstrate having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently once they met the minimum requirements.  Subsequent to initial training, all operators receive periodic refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every three years.  All training is documented for each operator, including the means used to verify that the operator understood the training.\n\n\n3.6 Maintenance\n\nThe Echo Spring's facilities have well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps, and emergency shutdown systems in a safe operating condition.  The basic elements of this program include:  (1) training, (2) written procedures, (3) inspections and tests, (4) correction of identified deficiencies, and (5) applying quality assurance measures.  These activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that the equipment functions as intended and to verify that equipment are within acceptable limits (adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service, if possible, or a management of change team will review the use of the equipment and determine what actions are necessary to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000020725,
      "SummaryText": "ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Echo Spring's facilities incorporate quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n\n3.7 Compliance Audits\n\nWilliams Field Services Company is committed to, not only establishing an effective Process Safety Management Program, but also continuously improving the program.\n\nA comprehensive audit of the process is performed internally at least every three years and it is used to increase everyone's knowledge in assisting with audits. The auditors develop a report, which document the findings of the audit. Copies of the findings are filed for at least two years and are available upon request. \n\n\n\n3.8 Incident Investigation\n\nThe Echo Spring's personnel investigate all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage (greater than $250.000.00), environmental loss, or personnel injury.  The goal of the investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to local and regional management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHA revalidations.\n\n\n4.0    CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe fol"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000020725,
      "SummaryText": "lowing is a description of safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\n\n4.1 Universal Prevention Activities\n\nThe accident prevention programs summarized previously are applied to all RMP-covered processes at the Echo Spring's facilities.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment or human errors.\n\n\n4.2 Specialized Safety Features\n\nThe Echo Spring's faciltites have specific safety features on the process equipment that perform the following:  (1) control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered processes:\n\n1. Fire Eyes to detect fires in their incipient stages and shutdown the facility.\n\n2. High Temperature melt-outs to detect fire and shutdown the facility.\n\n3. Gas Detection located inside the process buildings to detect gas, which activates a plant shutdown. (20% LEL alarm  40% LEL. Emergency Shutdown)\n\n\n4.2.1 Release Detection\n\nGas detection is located inside the processing buildings, which are located to detect gas at the floor or overhead depending on the type of gas.(Lighter or heavier than air) Operations personnel continuously monitor the facilities through a distributed control system and visual inspection during rounds. \n\n\n4.2.2 Release Control\n\nAll the facilities have Emergency Shutdowns to isolate the facilities in case of a release. The shutdown devices isolate the facilities and isolate power to all equipment to prevent ignition sources during a release situation.\n\n\n4.2.3 Release Mitigation\n\nEmployees are trained to be first responders and incident commanders. In addition, we have a site-specific spill prevention control and countermeasure plan for controlling, and reporting of spills.\n\n\n5.0    FIVE-YEAR ACCIDENT HISTORY\n\nThe Echo Spring's facilities have an excellent record of accident preve"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000020725,
      "SummaryText": "ntion over the past 5 years.  Over the last 5 years there has not been any release involving a regulated substance that has resulted in significant on-site or off-site effects.\n\n\n6.0    EMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Echo Spring's facilities maintain a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of fire or explosion.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans, and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  The processing facilities also have procedures that address maintenance, inspection, and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modification made to the facility process.  The regional safety administrators administer the emergency response program.  When changes are made to the program, employees are informed and trained on the changes.\n\nThe overall emergency response program of the Echo Spring's facilities is coordinated with the local fire department and the Carbon County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meeting with the committee, which includes local emergency response officials, local government officials, and industry representatives.  The Echo Spring's personnel have communications capability with the appropriate LEPC officials and emergency response organizations (e.g. fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating qu"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000020725,
      "SummaryText": "ick response to an incident.  In addition to periodic LEPC meetings, the Echo Spring's personnel conduct an annual review of the facility and process/regulated substance hazards with local emergency responders. \n\n\n7.0    PLANNED CHANGES TO IMPROVE SAFETY\n\nWilliams Field Services will continue to evaluate safety on a regular basis and make changes as appropriate."
    }
  ]
}