{
  "FacilityID": 1000077654,
  "FacilityName": "Plastics Eng. Co. North Ave. Plant",
  "FacilityStr1": "2732 North 15th Street",
  "FacilityStr2": null,
  "FacilityCity": "Sheboygan",
  "FacilityState": "WI",
  "FacilityZipCode": "53082",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55117",
  "LEPC": "Sheboygan LEPC",
  "FacilityLatDecDegs": "43.774167",
  "FacilityLongDecDegs": "-087.728889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 37841954,
  "ParentCompanyName": "Plastics Engineering Company",
  "Company2Name": null,
  "CompanyDUNS": 6078240,
  "Company2DUNS": null,
  "OperatorName": "Michael Brotz",
  "OperatorStr1": "3518 Lakeshore Road",
  "OperatorStr2": null,
  "OperatorCity": "Sheboygan",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53082",
  "OperatorZipCodeExt": "0758",
  "FTE": 226,
  "OtherEPAFacilityID": "53083PLSTC2732N",
  "EPAFacilityID": "100000083688",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-08-27 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-03-13 08:41:06",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-09 10:18:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-04-09 10:18:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.774167,
  "FRS_Long": -87.728889,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096733,
      "AltID": "Formaldehyde Storage Syst",
      "FacilityID": 1000077654,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000121083,
          "ProcessID": 1000096733,
          "ChemicalID": 1,
          "Quantity": 340000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097974,
          "ProcessID": 1000096733,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000082340,
              "Process_NAICS_ID": 1000097974,
              "SafetyReviewDate": "2019-04-04 00:00:00",
              "PHA_Date": "2017-05-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-07-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-01-24 00:00:00",
              "TrainingReviewDate": "2019-01-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-01-24 00:00:00",
              "EquipmentInspectionDate": "2019-02-20 00:00:00",
              "EquipmentTested": "Tanks, Valves, Pumps, Relief Devices",
              "ChangeMgmtDate": "2018-08-27 00:00:00",
              "ChangeMgmtReviewDate": "2019-03-22 00:00:00",
              "PreStartupReviewDate": "2019-02-20 00:00:00",
              "ComplianceAuditDate": "2018-12-10 00:00:00",
              "AuditCompletionDate": "2018-12-10 00:00:00",
              "IncidentInvestigationDate": "2018-07-12 00:00:00",
              "InvestigationChangeDate": "2019-01-21 00:00:00",
              "ParticipationPlansReviewDate": "2018-12-10 00:00:00",
              "HotWorkPermitReviewDate": "2018-12-10 00:00:00",
              "ContractorSafetyReviewDate": "2019-02-20 00:00:00",
              "ContractorSafetyEvalDate": "2018-12-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000102223,
                  "PreventionProgram3ID": 1000082340,
                  "ProcessChemicalID": 1000121083
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077654,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-03-14 00:00:00",
    "ERTrainingDate": "2018-10-11 00:00:00",
    "CoordinatingAgencyName": "Sheboygan Office of Emerg. Mgmt.",
    "CoordinatingAgencyPhone": "9204593360",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077654,
      "SummaryText": "Plastics Engineering Company has a long standing commitment to the safe operation of it's manufacturing facilities. This is borne out by well established safety policies and procedures. Equipment specifications, installations and operations are closely controlled to prevent releases of hazardous substances.\r\n\r\nIncluded in this commitment is the safety of its employees and the public. An emergency response plan is in effect which includes procedures for informing the public and emergency response agencies, documentation of proper first-aid and emergency medical treatment and procedures and measures for emergency response after a release occurs. An offsite emergency response plan has been submitted to the Local Emergency Planning Committee in accordance with the Emergency Planning and Community Right To Know Law.\r\n\r\nPlastics Engineering Company's North Avenue Plant produces phenolic resins and phenolic molding compounds. One of the raw materials used in the production of phenolic resins is a 52% solution of formaldehyde in water. The solution is received by tanker truck and stored in two tanks which are located in a diked area on the west end of the plant. The solution is pumped to the plant as needed for the various batches of resin. The amount of formaldehyde in the storage system exceeds the threshold amount as defined in the RMP rule, therefore, this process is subject to the rule. This process must meet the Program 3 requirements of the rule because it is subject to the OSHA Process Safety Management Standard.\r\n\r\nThe RMP rule requires that the owner prepare one worst case release scenario and one alternative release scenario for each toxic substance held in a covered process. The North Avenue Facility has one covered process containing a toxic substance (Formaldehyde Storage System). The release scenarios are as follows:\r\n\r\n1.\tFormaldehyde Worst Case Release Scenario\r\nThis scenario is the instantaneous release of one tank containing formaldehyde solution as defin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077654,
      "SummaryText": "ed in the rule. The solution would be contained in the concrete dike area and formaldehyde would be released to the atmosphere by evaporation.  The area of concern was determined by using the AFTOX modeling program. There are no environmental receptors in the area of concern.\r\n\r\n2.\tFormaldehyde Alternative Release Scenario\r\nThis scenario was determined by using the results of the HAZOP (Hazard and Operability Study) that was performed on this process. The release would be caused by a failure of a tanker truck unloading hose. It is assumed that the entire contents of the tanker truck would be spilled into the concrete containment area at the unloading station. The formaldehyde would be released to the atmosphere by evaporation. The area of concern was determined using the AFTOX modeling program. There are no environmental receptors in the area of concern. Mitigation measures include the concrete containment area, operator attendance while unloading and a hose inspection program in conformance with industry standards.\r\n\r\nThe accidental release prevention program for the covered process is part of a comprehensive safety program at the North Avenue facility. The elements of the program that affect the processes are as follows:\r\n\r\n1.\tEmployee Participation\r\nPlastics Engineering Company has long recognized the need for the participation of employees in safety programs and in initiating safety improvements in their work areas. Employees participate in the Safety Representative Program, process hazard analyses, pre-startup safety reviews, and development of operating instructions.\r\n\r\n2.\tProcess Safety Information\r\nProcess safety information is compiled on the chemicals used in the processes, the technology of the processes and the equipment used in the processes. This information is updated regularly through the management of change program and the process hazard analysis reviews.\r\n\r\n3.\tProcess Hazard Analysis\r\nThere is an ongoing program to conduct process hazard analyses"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077654,
      "SummaryText": "on processes that involve hazardous materials. The need for an analysis can be triggered by a new installation, management of change procedures or a five year routine review. The type of analysis (HAZOP, Check List, What If) is dependent on the complexity of the process. A system has been established to assure that the recommendations are documented and resolved in a timely manner.\r\n\r\n4.\tOperating Procedures\r\nWritten operating procedures are readily available to employees operating the covered processes. The procedures are updated through the management of change procedures.\r\n\r\nWritten standard safety procedures are in effect for operations such as lockout/tag out, hot work, confined space entry, opening process equipment and piping, and to control access into the facility by outside contractors or support personnel.\r\n\r\n5.\tTraining\r\nThe employees involved in operating the covered processes, are trained in the operation and the operating procedures for the process. The training includes the specific safety and health hazards, emergency operations and safe work practices applicable to their tasks. They also receive refresher training on a routine basis and their job performance is evaluated annually.\r\n\r\n6.\tContractors\r\nOutside contractors are utilized at the facility on construction projects, maintenance on specialized equipment, and to conduct some equipment testing. They are required to follow all plant safety procedures and their activities are under the direct control of the Plant Engineering and Maintenance Department. All outside personnel receive an orientation as to the plant safety rules and emergency procedures, their entrance and exit to the plant is controlled, and their safety performance is evaluated on a daily basis.\r\n\r\n7.\tPre-Startup and Safety Review\r\nIt is a standard practice to conduct pre-startup safety reviews on all new installations or equipment modifications to assure that the equipment is ready to operate safely. The review utilizes a checklis"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077654,
      "SummaryText": "t to assure that all aspects of the installation are considered and it is conducted by the department supervisor, an operator who will be affected by the change, a Safety Department Representative, electrical and/or maintenance personnel, and engineering personnel. All action items generated during the review are recorded for further resolution.\r\n\r\n8.\tMechanical Integrity\r\nThe plant mechanical integrity program includes the following equipment:\r\n* Pressure vessels and storage tanks\r\n* Piping systems and components\r\n* Pumps\r\n* Relief and vent systems\r\n* Emergency shutdown systems\r\n* Instrumentation and control systems\r\n\r\nSome of the programs in place are:\r\n* Routine inspections by Factory Mutual Insurance Company for pressure vessels, relief devices, and property loss prevention and protection systems.\r\n* Inspection program for tanks, process vessels, and piping and components.\r\n* Scale and weigh systems preventive maintenance.\r\n* Instrument and measuring systems calibration program.\r\n\r\nA computerized maintenance management system is in use which assures the timely scheduling of preventive maintenance tasks, provides detailed instructions on how to execute the tasks, and provides documentation for the equipment history.\r\n\r\n9.\tHot Work Permit\r\nA standard safety procedure is in effect for hot work operations. The procedure meets industry and regulatory standards.\r\n\r\n10.\tManagement of Change\r\nA management of change procedure is in effect to control changes to process equipment and facilities. Changes to chemicals, technology and procedures are controlled by the Corporate Quality Management System. This is a comprehensive system and it includes formal procedures to control changes to these items. The system also assures that the process safety information and operating instructions are kept up to date.\r\n\r\n11.\tIncident Investigation\r\nA standard safety procedure is in effect for incident investigations. The procedure includes the date of the incident, a description of the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077654,
      "SummaryText": "incident, factors that contributed to the incident, recommendations resulting from the investigation, and resolution of the recommendations. This procedure is an integral part of our efforts to improve safety at the facility.\r\n\r\n12.There have been no accidents with the covered process within the last fine years that had consequences as described in the rule.\r\n\r\nThis facility is included in the community emergency response plan as required under 42 U.S.C. 11003. Procedures are in place to notify key company personnel, local emergency responders and appropriate government agencies in case of an accidental release of a regulated substance.\r\n\r\nThe improvement of safety is an ongoing effort at Plastics Engineering Company. Some of the programs that have proven to be effective in this effort are the Safety Representative Program which includes monthly safety inspections, the semi-annual Employee-Supervisor Meetings where items concerning safety can be directly communicated to Company Management, process hazard analyses, incident investigations, insurance inspections, and fire department inspections."
    }
  ]
}