{
  "FacilityID": 1000007946,
  "FacilityName": "Pleasant Prairie Distribution Center",
  "FacilityStr1": "7400 94th Street",
  "FacilityStr2": "PO Box 581908",
  "FacilityCity": "Pleasant Prairie",
  "FacilityState": "WI",
  "FacilityZipCode": "53158",
  "Facility4DigitZipExt": "0908",
  "FacilityCountyFIPS": "55059",
  "LEPC": "Kenosha LEPC",
  "FacilityLatDecDegs": "42.537500",
  "FacilityLongDecDegs": "-087.895833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.supervalu.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6961411,
  "ParentCompanyName": "Meijer Distribution, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Supervalu, Inc.",
  "OperatorStr1": "7400 94th Street",
  "OperatorStr2": "PO Box 581908",
  "OperatorCity": "Pleasant Prairie",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53158",
  "OperatorZipCodeExt": "0908",
  "FTE": 600,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000037211",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-05-07 00:00:00",
  "DeRegistrationEffectiveDate": "2013-04-26 00:00:00",
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.5375,
  "FRS_Long": -87.895833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009172,
      "AltID": "Refrigeration",
      "FacilityID": 1000007946,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010361,
          "ProcessID": 1000009172,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000009414,
          "ProcessID": 1000009172,
          "NAICSCode": "42441",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000007465,
              "Process_NAICS_ID": 1000009414,
              "SafetyReviewDate": "2007-12-03 00:00:00",
              "PHA_Date": "2007-06-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-03-11 00:00:00",
              "TrainingReviewDate": "2007-12-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-12-03 00:00:00",
              "EquipmentInspectionDate": "2009-02-10 00:00:00",
              "EquipmentTested": "Ammonia Compressor safeties/cutouts",
              "ChangeMgmtDate": "2009-02-12 00:00:00",
              "ChangeMgmtReviewDate": "2007-12-03 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2007-12-03 00:00:00",
              "AuditCompletionDate": "2009-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-12-03 00:00:00",
              "HotWorkPermitReviewDate": "2007-12-03 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2007-12-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000008595,
                  "PreventionProgram3ID": 1000007465,
                  "ProcessChemicalID": 1000010361
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000007946,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-06 00:00:00",
    "ERTrainingDate": "2009-06-03 00:00:00",
    "CoordinatingAgencyName": "Kenosha County",
    "CoordinatingAgencyPhone": "2626057900",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007946,
      "SummaryText": "The Pleasant Prairie Distribution Center is a cold storage food warehouse and distribution center located at 7400 95th Street, Pleasant Prairie, WI.\n \nAt our facility, anhydrous ammonia (cas #7664-41-7) is used as a refrigerant to cool our perishable storage rooms and freezers. The refrigeration system is designed as a closed loop, two-stage compression system. Liquid ammonia is pushed, by pressure, to each of the room cooling units located in the cooler and freezer rooms. Ammonia vapor and liquid returns from the evaporators, to the suction accumulators which are located in the engine room. Ammonia vapor from the low-temperature accumulator is removed by the first-stage or booster compressors and discharged into the intermediate-pressure accumulator or intercooler. This vapor, plus the vapor that returns from the cooler room evaporators, is compressed by the high-stage compressors and discharged to the evaporative condensers located on the roof. The condensers remove the heat from the ammonia vapor causing it to condense back into a liquid so that it can be circulated back out to the evaporators. The normal high-side operating pressure ranges from 90 to 150 psig. The maximum allowable working pressure is 250 psig. The quantity of ammonia used in the system to maintain the required refrigeration is 30,000 lbs.\n\nAmmonia is used widely and in large quantities for a variety of  purposes. More than 80% of ammonia produced is used for agricultural purposes; less than two percent is used for refrigeration. Ammonia can safely be used as a refrigerant provided the system is properly designed, constructed, operated, and maintained. It is important to recognize, however, that ammonia is toxic and can be a hazard to human health. It may be harmful if inhaled at high concentrations. The Occupational Safety and Health Administration (OSHA) Permissible Exposure Level (PEL) is 50 parts per million (ppm), 8-hour time-weighted average. Effects of inhalation of ammonia range from irr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007946,
      "SummaryText": "itation to severe respiratory injuries, with possible fatality at higher concentrations. The National Institute of Occupational Safety and Health (NIOSH) has established an Immediately Dangerous to Life and Health (IDLH) level of 300 ppm for the purposes of respirator selection. Ammonia is corrosive and exposure will result in a chemical-type burn. Since ammonia is extremely hygroscopic, it readily migrates to moist areas of the body such as eyes, nose, throat, and moist skin areas. Exposure to liquid ammonia will also result in frostbite since its temperature at atmospheric pressure is Â¿28ÂºF.\n\nThe American Industrial Hygiene Association (AIHA) has developed Emergency Response Planning Guidelines (ERPGs) for a number of substances to assist in planning for catastrophic releases to the community. The ERPG-2 represents the concentration below which it is believed nearly all individuals could be exposed for up to one hour without irreversible or serious health effects. The ERPG-2 for ammonia is 200 ppm. EPA has adopted the ERPG-2 as the toxic endpoint for ammonia for the offsite consequence analysis required by the Risk Management Program (RMP) Rule under section 112(r) of the Clean Air Act.\n\nIn refrigeration systems, ammonia is liquefied under pressure. Any liquid ammonia released to the atmosphere will aerosolize producing a mixture of liquid and vapor at a temperature of Â¿28ÂºF. The released ammonia rapidly absorbs moisture in the air and forms a dense, visible white cloud of ammonium hydroxide. The dense mixture tends to travel along the ground rather than rapidly rising. This behavior may increase the potential for exposure of workers and the public. Although pure ammonia vapors are not flammable at concentrations of less than 16%, they may be a fire and explosion hazard at concentrations between 16% and 25%. Mixtures involving ammonia contaminated with lubricating oil from the system, however, may have a much broader explosive range. A study conducted to deter"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007946,
      "SummaryText": "mine the influence of oil on the flammability limits of ammonia found that oil reduced the lower flammability limit as low as 8%, depending on the type and concentration of oil.\n\nAn important property of ammonia is its pungent odor. The threshold concentration at which ammonia is detectable varies from person to person; however, ammonia can be usually detected at concentrations in the range of 5 ppm to 50 ppm. Concentrations above about 100 ppm are uncomfortable to most people; concentrations in the range of 300 to 500 ppm will cause people to leave the area immediately.\n\nPleasant Prairie Distribution Center has not only complied with the EPA Risk Management Program but also the OSHA Process Safety Management regulation to assure that the Ammonia Refrigeration System is well maintained and employees are properly trained and periodically retrained to assure they are kept up to date on any changes and new operations that may effect them. \n\nNumerous safety devices and policies are in place to prevent or minimize the potential for a catastrophic release of ammonia. \n\n1.\tA system walkthrough is conducted every day to record operating conditions, maintain compressor lubricating oil levels, drain oil from the system if necessary, and check overall system operation and condition. \n\n2.\tSystem compressors are installed with safety cutouts to shut down their operation if operating conditions (pressures, temperatures, liquid levels) get above or below safe levels. \n\n3.\tAmmonia detectors have been installed in the engine room and storage rooms to alarm and shut down equipment if ammonia is sensed in these areas above safe concentrations. The ammonia detectors in the engine room also turn on the engine room ventilation fans to help prevent concentration levels from reaching explosive levels. \n\n4.\tComponents that could potentially reach high pressure levels are equipped with pressure relief devices to prevent overpressure and possible component rupture. An emergency shutdown (E-St"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000007946,
      "SummaryText": "op) switch has been installed outside the engine room to shut down the system in case of an emergency. This switch is available to plant personnel and the local Fire Department and Emergency Responders. \n\n5.\tAmmonia piping and components have been marked with labels to heighten employeeÂ¿s awareness of equipment locations so that it is not accidentally impacted by material handling equipment and to assist emergency responders locate ammonia refrigeration equipment during an emergency. \n\n6.\tExcept for the piping located in the engine room, all process piping and control valves are located outside of the process areas.\n\n7.\tFreezer and cooler evaporators are roof-mounted, penthouse units. This eliminates the risk of air-cooling evaporators and ammonia piping being impacted by forklifts and the accidental release of ammonia into process areas and exposing workers to hazardous chemicals.\n\n8.\tAutomatic fire sprinkler systems have been installed throughout the entire facility including the engine room.\n\nThe facility has also identified periodic maintenance tasks that are conducted on a routine basis to maintain the mechanical integrity and safe operation of the ammonia refrigeration system and abides by the following industry codes and guidelines for the selection, installation, and maintenance of ammonia refrigeration equipment and related components: \n\nASME Boiler & Pressure Vessel Codes\nANSI/ASHRAE Standard 15-2001\nANSI/IIAR 2-1999 \nANSI B31.3 Piping Code\nIIAR industry guideline for safety and good engineering practices\nNFPA guidelines for fire protection equipment\nAccidental Release and Emergency Response Policies:\n\nPleasant Prairie Distribution Center has developed a written emergency action plan that describes the steps that would be taken should an emergency occur. Included in the plan are emergency notification and evacuation of facility personnel and the notification of outside emergency response agencies. Because of limited resources, the facility does not mainta"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000007946,
      "SummaryText": "in an in-house emergency response team but relies on assistance from local emergency agencies to respond in the event an emergency happens at this facility. Response efforts have been coordinated with the local Fire Department and the Kenosha County LEPC. The local Fire Department will assist in containing and mitigating an ammonia release and also will notify and evacuate, if necessary, people in the community. \n\nEmergency evacuation drills are also conducted annually. The Emergency Action Plan is also reviewed annually.   \n\nThrough regular audits, training, maintenance, testing and inspection programs the Pleasant Prairie Distribution Center has established a history of safe operation. Community emergency action plans are current, and training with community services is done for a safe response in the event of an accidental release. Deficiencies that are identified during walkthrough inspections and routine maintenance are corrected immediately. Management is committed to safety by providing ongoing training to employees and implementing improvements to equipment, safety systems, policies and procedures when necessary. \n\nThe Pleasant Prairie Distribution Center has had no reportable accident for the past five years."
    }
  ]
}