{
  "FacilityID": 1000050459,
  "FacilityName": "Ingredion Incorporated North Kansas City Plant",
  "FacilityStr1": "1001 Bedford Ave.",
  "FacilityStr2": null,
  "FacilityCity": "North Kansas City",
  "FacilityState": "MO",
  "FacilityZipCode": "64116",
  "Facility4DigitZipExt": "4115",
  "FacilityCountyFIPS": "29047",
  "LEPC": "Mid-America LEPC",
  "FacilityLatDecDegs": "39.125000",
  "FacilityLongDecDegs": "-094.506111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nationalstarch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4811423,
  "ParentCompanyName": "Ingredion Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 4811423,
  "Company2DUNS": 0,
  "OperatorName": "Ingredion Incorporated",
  "OperatorStr1": "5 Westbrook Corporate Center",
  "OperatorStr2": null,
  "OperatorCity": "Westchester",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60514",
  "OperatorZipCodeExt": null,
  "FTE": 182,
  "OtherEPAFacilityID": "64116NTNLS1001B",
  "EPAFacilityID": "100000083072",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "290470002",
  "SafetyInspectionDate": "2014-05-13 00:00:00",
  "SafetyInspectionBy": "Homeland Security",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-06-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-06-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-06-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.12889,
  "FRS_Long": -94.57,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063491,
      "AltID": "Starch Manufacturing",
      "FacilityID": 1000050459,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078454,
          "ProcessID": 1000063491,
          "ChemicalID": 12,
          "Quantity": 184000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000064632,
          "ProcessID": 1000063491,
          "NAICSCode": "31122",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052740,
              "Process_NAICS_ID": 1000064632,
              "SafetyReviewDate": "2015-06-10 00:00:00",
              "PHA_Date": "2014-11-13 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-11-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Combustible detector in storage and treating areas",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Changed to PPM monitoring as opposed to LEL",
              "OpProceduresReviewDate": "2015-04-27 00:00:00",
              "TrainingReviewDate": "2014-11-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "computer assisted training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-02-05 00:00:00",
              "EquipmentInspectionDate": "2015-06-12 00:00:00",
              "EquipmentTested": "Pipe thickness testing",
              "ChangeMgmtDate": "2015-06-23 00:00:00",
              "ChangeMgmtReviewDate": "2010-11-02 00:00:00",
              "PreStartupReviewDate": "2014-07-17 00:00:00",
              "ComplianceAuditDate": "2015-02-03 00:00:00",
              "AuditCompletionDate": "2015-11-01 00:00:00",
              "IncidentInvestigationDate": "2015-06-03 00:00:00",
              "InvestigationChangeDate": "2015-06-18 00:00:00",
              "ParticipationPlansReviewDate": "2015-06-24 00:00:00",
              "HotWorkPermitReviewDate": "2014-01-10 00:00:00",
              "ContractorSafetyReviewDate": "2015-06-16 00:00:00",
              "ContractorSafetyEvalDate": "2015-06-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "Modification corn granulates through chemical treatment",
              "_chemicals": [
                {
                  "PrimaryKey": 1000064765,
                  "PreventionProgram3ID": 1000052740,
                  "ProcessChemicalID": 1000078454
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050459,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-02-25 00:00:00",
    "ERTrainingDate": "2015-05-11 00:00:00",
    "CoordinatingAgencyName": "North Kansas City Fire Department",
    "CoordinatingAgencyPhone": "8162746025",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Homeland Security Tier 3 facility"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050459,
      "SummaryText": "Executive Summary for Ingredion Incorporated\n\nNorth Kansas City Plant\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nIngredion Incorporated is committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\nThe Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass processing corn to manufacture food grade and industrial starch.  We have one regulated substance present at our facility.  This is propylene oxide.  Propylene Oxide is used as a reactant to modify food grade starches.  \n\n\n\nThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with EPA's accidental release prevention requirements set out under 40 CFR part 68.  The following sections briefly describe the elements of the release prevention program that are in place at our facility.\n\n\n\nProcess Safety Information\n\nIngredion Incorporated maintains a detailed record of safety information that describes the chemical hazard, operating parameters and equipment designs associated with all the processes. We are in the process of converting to the GHS system and our entire corporation is going to a single information system with each plant having its own electronic tab.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and efficiently controlled.   The methodology used to carry out these analyses is a Hazards Operability Study (HAZOPS).  The studies are undertaken by a team of qualified personnel with expertise in safety engineering process chemistry and process operations and are re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050459,
      "SummaryText": "validated at a regular interval of five years.   Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purpose of safely conducting activities within our covered processes, Ingredion Incorporated maintains written operating procedures.  These procedures address various models of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  Our facility is ISO certified and the procedures are reviewed as part of the recertification process.\n\n\n\nTraining\n\nIngredion Incorporated has a comprehensive training program in place to ensure that employees who operate processes are competent in the operating procedures associated with these procedures.  Refresher training is provided at least every three years and more frequently as needed. We have installed a new training center with computer assisted training.\n\n\n\nMechanical Integrity\n\nIngredion Incorporated carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined during these checks include among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Ingredion Incorporated to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050459,
      "SummaryText": "are promptly made aware of and offered training to deal with the modification. A new corporate wide MOC system is planned to be implemented in August 2015.  This system will require retraining of employees.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Ingredion Incorporated.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audit\n\nIngredion Incorporated conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner. All corrective actions are tracked in our EXP database.\n\n\n\nIncident Investigation\n\nIngredion Incorporated promptly investigates any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for the life of the process. Reports are electronically stored in\n\nthe EXP data and are reviewed by a corporate process.\n\n\n\nEmployee Participation\n\nIngredion Incorporated believes that process safety management and accident prevention is a team effort.  Employees are encouraged to express their views concerning accident prevention issues and to recommend improvements of the RMP rule, including information resulting from process hazard analyses.\n\n\n\nContractors\n\nOur company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050459,
      "SummaryText": "  Ingredion Incorporated has a strict policy of informing the contractors of known potential hazardous related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\nFive-year Accident History\n\nIngredion Incorporated has had an excellent record of preventing accidental releases over the last five years.  Due to our stringent release prevention policies, there has been no accidental release resulting in an RQ during this period.\n\n\n\nEmergency Response Plan\n\nIngredion Incorporated has a written emergency response plan to deal with accidental release of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nPlanned Changes to Improve Safety\n\nAll recommended changes are or improvements documented as a result of hazardous analyses, audits or inspections have been evaluated and, if found to be beneficial, have been implemented.  In 2014 we installed overhead piping of our PO system, upgraded our lighting at the unload area, and are researching addition monitoring cameras in the unload and storage areas."
    }
  ]
}