{
  "FacilityID": 1000011330,
  "FacilityName": "Valley Generating Station",
  "FacilityStr1": "11801 Sheldon Street",
  "FacilityStr2": null,
  "FacilityCity": "Sun Valley",
  "FacilityState": "CA",
  "FacilityZipCode": "91352",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.246760",
  "FacilityLongDecDegs": "-118.38953",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Los Angeles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": 21178491,
  "Company2DUNS": 0,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "111 North Hope Street, Room 1050",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary P. Laney",
  "RMPTitle": "Electrical Service Manager",
  "FTE": 71,
  "OtherEPAFacilityID": "CAD000081513",
  "EPAFacilityID": "100000175954",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "800193",
  "SafetyInspectionDate": "2003-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-10-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-10-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.24194,
  "FRS_Long": -118.38945,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013516,
      "AltID": "Aqueous Ammonia Storage 1",
      "FacilityID": 1000011330,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013876,
          "ProcessID": 1000013516,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015518,
          "ProcessID": 1000013516,
          "ChemicalID": 57,
          "Quantity": 169516.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515518,
          "ProcessID": 1000013516,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000013517,
      "AltID": "Aqueous Ammonia Storage 2",
      "FacilityID": 1000011330,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013877,
          "ProcessID": 1000013517,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015519,
          "ProcessID": 1000013517,
          "ChemicalID": 57,
          "Quantity": 98319.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515519,
          "ProcessID": 1000013517,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011330,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nThe City of Los Angeles Department of Water and Power (LADWP) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. All applicable procedures of the California Accidental Release Prevention (CalARP) Program and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to. The LADWP emergency response policy involves the preparation of response action plans that are tailored to each facility and to the emergency response services available in the community, and is in compliance with the State and Federal Emergency Response Program requirements.                               \n\nGeneral Description of the Stationary Source and Regulated Substance\n\nThe Valley Generating Station (VGS) is a 150-acre electric power generating facility designed to generate and supply electric power to the LADWP's system. The facility has new combined cycle generating facility (CCGF) will include two combustion gas turbines (CTs), a new steam turbine generator, two heat recovery steam generators (HRSGs) and associated selective catalytic reduction (SCR) systems, cooling towers and ancillary equipment. CCGF will be fired by natural gas with the capability to fire with distillate fuel under emergency conditions. CCGF covers approximately 10 acres of land at VGS. The total Station gross capacity will be 583 MW.  \n\nThe Station is manned and operated at all times, with a minimum operating crew consisting of 2 operators and a supervisor. Valley GS was constructed in approximately 1951. Valley GS has a gate that is manned with a security guard 24 hours per day.\n\nThe facility is located in Sun Valley, California. The area surrounding the facility is primarily commercial/light industrial; however, a day time emergency clinic, a hospital, and two motels are present on San Fernando Road, approximately 1,900 feet from the existing aqueous ammonia st"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011330,
      "SummaryText": "orage tank at the Peaker Plant (located northwest of the facility). A sand and gravel plant is located adjacent to the northwest of the site.  There are no residences in the immediate vicinity of VGS. The nearest residential properties are located approximately one-half mile to the north of the facility.\n\nAqueous Ammonia Process Description:\n\nLADWP has selective catalytic reduction (SCR) systems that reduce nitrogen oxides (NOx) emissions from an existing 47-MW combustion turbines and two new combustion gas turbines (CTs). The CTs are located at the new combined cycle generating facility (CCGF). The existing SCR for the 47-MW combustion turbine utilizes aqueous ammonia stored in a steel aboveground storage tank (AST). The CCGF utilizes two additional aqueous ammonia ASTs. The storage tanks are all located within secondary containment areas equipped with a sump and pump for pumping out rainwater. The containment areas are designed to hold the contents of the largest tank as well as account for a 25-year flood scenario.\n\nAqueous Ammonia Handling and Storage\n\nThe Ammonia Handling and Storage system supplies ammonia solution to the NOx emission control system. Ammonia solution is used instead of anhydrous ammonia because the latter has some serious inherent safety hazards requiring significant precautions and safety equipment in handling and storing. The risks and safety related costs of anhydrous ammonia are found to outweigh the higher costs for transportation and storage of ammonia solution.\n\nThere are two aqueous ammonia storage areas, one for the CTs and one for the CCGF. The product tanks are located within secondary containment areas (concrete dike) with sumps. Two positive displacement pumps, each fully redundant, dispense ammonia solution from the ASTs to the emission control equipment. Other safety equipment associated with the tanks are: pressure/vacuum relief valves, temperature and pressure indicators, pressure and liquid level alarms, an ammonia vapor scru"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011330,
      "SummaryText": "bber, cam-lock fill connections, vapor recovery and associated piping, strategically-located ammonia vapor detectors, and an emergency eyewash/shower station. A wind sock is also provided for visual indication of wind direction in case of emergency evacuation.\n\nAmmonia solution is delivered by truck into the storage tanks through a 2-inch cam-lock hose connections. The truck parks within a concrete area that is provided with a collection sump to contain spills from the delivery truck. The ammonia solution unloading to the storage tank is done through a quick fill connection. A truck-mounted vapor recovery system is connected to the tank vapor recovery system during the unloading. The storage tanks are equipped with pressure and vacuum relief valves and the tanks are maintained at ambient temperature and atmospheric pressure.\n\nThe storage tank redundant dispensing pump is placed into service when the main pump fails or is out of service for preventive maintenance. The loading operator is provided with a readily accessible water supply to wash spills quickly. All spills are collected and disposed of in accordance with federal, state and local waste disposal requirements. Flashing lights and audible alarms at the tanks and in the main control room are activated when the ammonia gas monitors detect the gas concentration above 20 parts per million in the surrounding area.\n\nOffsite Consequence Analysis Results\n\nThe OCA is conducted in accordance with the latest RMP OCA guidance document that has been developed by the USEPA in conjunction with the National Oceanographic and Atmospheric Administration (NOAA). The OCA is performed to determine the distance traveled by the ammonia released before its concentration decreases to the \"toxic endpoint\" of 0.14 mg/l or 200 parts per million, which is the Emergency Planning Guidance Level 2 (ERPG-2). \n\nWorst-case Release Scenario\n\nThe worst-case release scenario involves the failure of the largest bulk storage tank of each process. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011330,
      "SummaryText": "The entire volume of the solution is contained within the secondary containment system. The regulatory default meteorological parameters, including wind stability F, wind speed 1.5 m/s, and a release temperature of 113F (maximum daily temperature at the nearest monitoring station), 50% average humidity and urban surroundings, were used. The estimated toxic endpoint distance for the worst-case release scenario potentially affects some public receptors.\n\nAlternative Release Scenario\n\nThe alternative release scenario involves the spill of the ammonia solution as a result of the rupture of a two-inch diameter, 100 feet long flexible transfer hose during the bulk transferring of the solution from a tanker truck to the storage tanks. The transfer pump is manually shut off within 15 seconds after the hose rupture.  The volume of released solution spills onto the paved ground that slopes into a bermed area.  The regulatory default meteorological conditions used were: wind stability D, wind speed 3.0 m/s, and a release temperature of 110F (maximum daily temperature at the nearest monitoring station), 50% average humidity, and urban surroundings. For this alternative release scenario, the distance to the toxic endpoint listed in the OCA guidance document (Reference Table 23) is less than 0.1 miles from the ammonia storage area, which does not reach any public or environmental receptors. \n\nSummary of the General Accidental Release Prevention Program and Ammonia Accidental Release Prevention\n\nThe general LADWP accidental release prevention program is based on the following key elements:\n\n-High level of training of the operators in safe handling of chemicals,\n-Effective preventive maintenance program,\n-Use of state-of-the-art process and safety equipment,\n-Use of accurate and effective operating procedures, written with the participation of the operators,\n-Performance of a hazard review of equipment and procedures, and\n-Implementation of an auditing and inspection program.\n\nOthe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011330,
      "SummaryText": "r specific steps to prevent accidental ammonia releases include:\n\n-Required ammonia safe handling training of tank truck drivers from suppliers as well as their equipment preventive maintenance program,\n-The availability of personal protective equipment at close proximity to the storage tanks,\n-The installation of tank liquid level alarms, pressure level alarms, pressure/vacuum relief valve, vapor recovery system, gas scrubbers, deluge system and ammonia gas detectors and alarms around the storage area, and \n-The installation of secondary containment systems and sumps.\n\nSummary of the Five Year Accident History\n\nNo accidental releases of ammonia gas or solution that meet the reporting requirement of the EPA's RMP have occurred at this facility for the past five years.\n\nSummary of the Emergency Action Plan\n\nThe facility has an emergency action plan, which includes an emergency action decision tree and a notification plan. Emergency action drills and drill evaluations are conducted every year; emergency operations and procedures are also reviewed at that time.\n\nPlanned Changes to Improve Safety\n\nMany operations/maintenance and administrative changes to improve safety (recommended actions) were identified as a result of the Hazard Operability (HAZOP) study session with the facility management, operations and maintenance, and plant engineering conducted in October 2009 for the aqueous ammonia processes. These recommended actions have now been either completed or evaluated for implementation as required."
    }
  ]
}