{
  "FacilityID": 1000079144,
  "FacilityName": "Nestle/Dreyer's Ice Cream",
  "FacilityStr1": "9090 Whiskey Bottom Road",
  "FacilityStr2": null,
  "FacilityCity": "Laurel",
  "FacilityState": "MD",
  "FacilityZipCode": "20723",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24027",
  "LEPC": "Howard County LEPC",
  "FacilityLatDecDegs": "39.113611",
  "FacilityLongDecDegs": "-076.827778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66563859,
  "ParentCompanyName": "Dreyer's Grand Ice Cream Holdings, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 133509237,
  "Company2DUNS": 0,
  "OperatorName": "Nestle/Dreyer's Ice Cream, Inc.",
  "OperatorStr1": "9090 Whiskey Bottom Road",
  "OperatorStr2": null,
  "OperatorCity": "Laurel",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "20723",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rafaela Carvalho Marangoni",
  "RMPTitle": "Factory Manager",
  "FTE": 900,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000046489",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-10-02 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-02-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.11542,
  "FRS_Long": -76.83067,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098704,
      "AltID": "North Ammonia System",
      "FacilityID": 1000079144,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099945,
          "ProcessID": 1000098704,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123774,
          "ProcessID": 1000098704,
          "ChemicalID": 56,
          "Quantity": 125324.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000623774,
          "ProcessID": 1000098704,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079144,
      "SummaryText": "- Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe facility is  committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated processes. It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances. However, if such an accidental release does occur, we are coordinated with this facility's Hazmat Team, Anne Arundel County Fire and Rescue, Howard County Fire & Rescue, Howard County Police Department, the Howard County Emergency Management Agency, and our refrigeration contractor Industrial Refrigeration Service for emergency response support.\n\n\n\n- Stationary source and regulated substance handled.\n\n\n\nThe facility, is located at 9090 Whiskey Bottom Road, Laurel, MD 20723.  The facility is primarily responsible for the manufacturing and distribution of ice cream products and fruit bars in various varieties and specialties.  There were two separate anhydrous ammonia refrigeration systems at this site.  The original system was refered to as the \"south side\" and the newer system is refered to as the \"north side\".  The two systems were located at opposite ends of the facility and were not connected.  Both systems use anhydrous ammonia in closed loop refrigeration systems as a heat removal media. The \"south side\" refrigeration system was decommissioned the week of 12/15/17. This process was retired and the refrigeration charge was removed from the site. In order to connect the \"north side\" and \"south side\" refrigeration systems, a transfer vessel room was installed. The purpose of the transfer vessel room is to receive liquid ammonia from the north engine room and then distribute the liquid to process equipment in the older production areas.\n\n \n\nThe facility has developed and implemented a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079144,
      "SummaryText": " Risk Management Program (RMP), a Process Safety Management (PSM) and an Emergency Preparedness System to prevent and respond to ammonia releases.   \n\n          \n\n- The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nThe facility has integrated various engineering and administrative control mechanisms to eliminate and/or minimize any possible upsets or releases  including; electronic ammonia detection and alarms located through out the facility, safety devices and interlocks that will shutdown equipment when safe operating limits are exceeded, safety relief valves are installed on all required equipment components including pressure vessels and oil separators to eliminate the possibility of an over-pressurization condition.   \n\n\n\n- Emergency Preparedness System\n\n\n\nThe facility has implemented  preventive maintenance procedures. The release of ammonia is covered in the Emergency Preparedness System and details of required actions in the event of release of ammonia. As part of the facility's accidental release prevention, training is conducted for employees and new hires.  The plan only allows trained and qualified employees and off-site responders to respond to releases, spills, and or upsets.  Accidental release prevention, training and awareness are reinforced annually and as the operations at the plant dictate.  Employees receive training in Hazard Communication, Emergency Response, Spill Prevention, safe operations, maintenance, and emergency actions.  The facility has specific operational and emergency procedures in place for delivery and handling of ammonia, with the assistance from local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The facility maintains a written Emergency Preparedness System to document specific procedures to be implemented in the event of various emergencies, including ammonia release. The Plan includes procedures for faci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079144,
      "SummaryText": "lity evacuation, as well as for notification to the local emergency response agencies, which are responsible for notifying the public. The plan is  updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\n\n\n- Planned Changes to Improve Safety:\n\n\n\nThe facility's aim is to manufacture as efficiently as possible while minimizing the loss of ammonia refrigerant.  In this effort our priority will be the proactive pursuit of cost-effective process changes that reduce or eliminate ammonia loss. These efforts include the Management of Change Program, Process Hazard Analysis, Process Safety Management, Monitoring New Techniques and Equipment, Employee Participation, Employee Training, Compliance Audits, and Process Auditing."
    }
  ]
}