{
  "FacilityID": 1000093783,
  "FacilityName": "Accra-Pac, Inc. DBA Voyant Beauty",
  "FacilityStr1": "2700 Middlebury Street",
  "FacilityStr2": null,
  "FacilityCity": "Elkhart",
  "FacilityState": "IN",
  "FacilityZipCode": "46516",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18039",
  "LEPC": "Elkhart County LEPC",
  "FacilityLatDecDegs": "41.681710",
  "FacilityLongDecDegs": "-085.919870",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.voyantbeauty.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 42080614,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 65601577,
  "Company2DUNS": null,
  "OperatorName": "Voyant Beauty Holdings, LLC",
  "OperatorStr1": "2730 Middlebury Street",
  "OperatorStr2": null,
  "OperatorCity": "Elkhart",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46515",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": "IND042080614",
  "EPAFacilityID": "100000194087",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "039-2106-00034",
  "SafetyInspectionDate": "2022-07-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-08-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-08-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.6814,
  "FRS_Long": -85.92024,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2.4",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116350,
      "AltID": "Warehouse Operation",
      "FacilityID": 1000093783,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145452,
          "ProcessID": 1000116350,
          "ChemicalID": 98,
          "Quantity": 200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145453,
          "ProcessID": 1000116350,
          "ChemicalID": 118,
          "Quantity": 575000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145454,
          "ProcessID": 1000116350,
          "ChemicalID": 107,
          "Quantity": 825000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145455,
          "ProcessID": 1000116350,
          "ChemicalID": 130,
          "Quantity": 50000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145456,
          "ProcessID": 1000116350,
          "ChemicalID": 111,
          "Quantity": 500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117763,
          "ProcessID": 1000116350,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093783,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-10-09 00:00:00",
    "ERTrainingDate": "2020-10-09 00:00:00",
    "CoordinatingAgencyName": "Elkhart County LEPC",
    "CoordinatingAgencyPhone": "5745356590",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093783,
      "SummaryText": "The accidental release prevention and emergency response policies:\r\n\r\nAccra-Pac, Inc. DBA Voyant Beauty is committed to promoting a safe operating environment for the facility, its\r\nemployees and the surrounding community. The Distribution Center has completed the development and\r\nimplementation of its OSHA's Process Safety Management (PSM) program, and its EPA's Risk Management\r\nprevention program. Compliance with these regulations helps to ensure that the covered process (warehouse\r\noperation involving packaged products containing flammable substances) is designed, operated and maintained\r\nsafely.\r\n\r\nAccra-Pac, Inc. DBA Voyant Beauty recognizes that environmental, health and safety (E.H.S.) compliance is a key\r\nbusiness output with significant impact on corporate performance and success. It is Accra-Pac, Inc. DBA Voyant Beauty\r\nProducts policy to conduct its operations in a responsible manner with sustained good faith efforts to maintain\r\ncompliance with all Federal, State and Local regulations, including those of the Environmental Protection\r\nAgency (EPA), the Occupational Safety & Health Administration (OSHA), the Indiana Department of\r\nEnvironmental Management (IDEM), the Elkhart County Health Department, and the City of Elkhart Public\r\nWorks.\r\n\r\nWe pledge to be a responsible corporate citizen and to manage company operations to protect human health,\r\nnatural resources and the environment. Our goal is to minimize recognized environmental, health and safety\r\nhazards at our facilities. We will implement procedures to help accomplish this goal, and to help any injured or\r\nill employee obtain quality medical care, modified duties in a productive capacity for recuperating employees,\r\nand a rapid return to work where possible.\r\n\r\nSafety, health and environmental protection are an integral part of our daily business. Management and\r\nsupervision are accountable for ensuring employees are trained to perform work safely and in an\r\nenvironmentally responsible manner, for"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093783,
      "SummaryText": "abating safety and health hazards, for minimizing discharges to the\r\nenvironment, and for conserving natural resources through material reuse and waste reduction practices.\r\nEmployees are expected to conduct their daily tasks in a manner consistent with the E.H.S. Policy, to comply\r\nwith company procedures, and to support all compliance efforts. Environmental, health and safety compliance is a responsibility that must be shared equally and without exception by each individual within the organization.\r\n\r\nFacility and the regulated substances handled:\r\n\r\nThe Distribution Center is located at 2700 Middlebury Street, Elkhart, Indiana. The Distribution Center is\r\nadjacent to the Accra-Pac, Inc. DBA Voyant Beauty Main and North Plants that house nine aerosol manufacturing\r\nlines and one liquid filling line, as well as compounding facilities and storage facilities for raw materials.\r\n\r\nThe Distribution Center occupies 210,000 square feet under roof. It has been designed and constructed in\r\naccordance with the current building codes and fire standards, and includes features such as a fire protection\r\nsprinkler system supported by a pump house, and fire detection and alarms systems that are constantly\r\nmonitored and maintained by a contracted security company.\r\n\r\nThe Distribution Center provides storage of incoming components and outgoing finished products for the Main\r\nand North Plants. The incoming components include metal cans, plastic valves and caps, and corrugated\r\nboxes. The outgoing finished products are consumer commodities for various sectors including personal care,\r\nhousehold, food and pharmaceutical. The finished products include air fresheners, hair mousses and sprays,\r\nbody sprays, cooking sprays, cleaning products, liquid soaps, shaving creams, and foot sprays. Many of these\r\nproducts are aerosols and contain flammable propellants. The regulated chemicals used as propellants that\r\nmay be present are:\r\n\r\nn-Butane (CAS No. 106-97-8)\r\nDifluoroethane (CAS No. 75-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093783,
      "SummaryText": "37-6)\r\nDimethyl Ether (Methyl ether) (CAS No. 115-10-6)\r\nIsobutane (CAS No. 75-28-5)\r\nPropane (CAS No. 74-98-6)\r\n\r\nThe contents of the Distribution Center will vary as production requirements dictate. The Risk Management\r\nPlan has been prepared to include predictive filing, as the flammable propellant content of the packaged\r\ngoods in storage may vary from 0 pounds to over 1,000,000 pounds.\r\n\r\nGeneral accidental release prevention program and chemical-specific prevention steps:\r\n\r\nThe Distribution Center has been designed in accordance with the National Fire Protection Association (NFPA)\r\n30-B, Code for the Manufacture and Storage of Aerosol Products, the purpose of which is to provide\r\nrequirements for the prevention and control of fires and explosions in facilities that manufacture, store, or\r\ndisplay aerosol products. The Distribution Center has also been included in the Process Safety Management\r\nprogram developed and implemented at the adjacent Accra-Pac, Inc. DBA Voyant Beauty North and Main Plants.\r\nThe PSM program has been incorporated as both policy, and most importantly, procedure in everyday\r\noperations and maintenance of the Distribution Center.\r\n\r\nFive-year accident history:\r\n\r\nThere have been no incidents in the past 5 years.\r\n\r\nEmergency response program:\r\n\r\nThe Distribution Center has been included in the \"Integrated Contingency Plan\" and that also\r\naddresses the adjacent Main and North Plants. This plan has been coordinated with the Elkhart Fire\r\nDepartment and Elkhart County Local Emergency Planning Committee, as well as the Indiana Emergency\r\nPlanning Committee. The plan addresses fire, explosion, spills and releases of chemicals, severe weather, and\r\nother criteria. The plan details actions to be taken for such emergencies, safety equipment, communication\r\nresponsibilities, and coordination with off-site responders. The emergency response program is based on the\r\nOSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119), Emergenc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093783,
      "SummaryText": "y Response Plan\r\n(40 CFR Part 68.265.50) and HAZWOPER (29 CFR 1910.120). Our employees and emergency coordinators\r\nare trained on this emergency procedures plan. The written plan is maintained on-site at key locations and has\r\nbeen shared with outside responders, including our contracted spill response company.\r\n\r\nPlanned changes to improve safety:\r\n\r\nThe Distribution Center was constructed to comply with all current safety and fire protection requirements and\r\nwill continually work to improve safety in all areas. The facility encourages input from operation and\r\nmaintenance personnel, as well as vendor and agency inspectors, and responds to address potential\r\nimprovements. The facility places a high emphasis upon training of personnel and maintaining safe operations\r\nthat comply with all environmental requirements."
    }
  ]
}