{
  "FacilityID": 1000044901,
  "FacilityName": "Veolia ES Technical Solutions, L.L.C.",
  "FacilityStr1": "7665 Hwy 73",
  "FacilityStr2": null,
  "FacilityCity": "Port Arthur",
  "FacilityState": "TX",
  "FacilityZipCode": "77640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.855072",
  "FacilityLongDecDegs": "-094.093623",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "LF",
  "FacilityURL": "www.veoliaes.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7680775,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Veolia ES Technical Solutions, LLC",
  "OperatorStr1": "P.O. Box 2563",
  "OperatorStr2": null,
  "OperatorCity": "Port Arthur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77643",
  "OperatorZipCodeExt": "2563",
  "RMPContact": "Mitch Osborne",
  "RMPTitle": "General Manager",
  "FTE": 168,
  "OtherEPAFacilityID": "77643WSTMNHWY73",
  "EPAFacilityID": "100000200917",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O1509",
  "SafetyInspectionDate": "2003-07-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-08-01 00:00:00",
  "DeRegistrationEffectiveDate": "2017-03-01 00:00:00",
  "AnniversaryDate": "2019-07-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055576,
      "AltID": "Building 46",
      "FacilityID": 1000044901,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056483,
          "ProcessID": 1000055576,
          "NAICSCode": "562211",
          "_desc": {
            "NAICS_CODE": "562211",
            "NAICS_DESCRIPTION": "Hazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067785,
          "ProcessID": 1000055576,
          "ChemicalID": 55,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567785,
          "ProcessID": 1000055576,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055577,
      "AltID": "Stabilization Building",
      "FacilityID": 1000044901,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056484,
          "ProcessID": 1000055577,
          "NAICSCode": "562211",
          "_desc": {
            "NAICS_CODE": "562211",
            "NAICS_DESCRIPTION": "Hazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067786,
          "ProcessID": 1000055577,
          "ChemicalID": 53,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 53,
            "ChemicalName": "Hydrochloric acid (conc 37% or greater)",
            "CASNumber": "7647-01-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000067788,
          "ProcessID": 1000055577,
          "ChemicalID": 59,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 59,
            "ChemicalName": "Phosphorus trichloride  [Phosphorous trichloride]",
            "CASNumber": "7719-12-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000067789,
          "ProcessID": 1000055577,
          "ChemicalID": 70,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 70,
            "ChemicalName": "Phosphorus oxychloride  [Phosphoryl chloride]",
            "CASNumber": "10025-87-3",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000068182,
          "ProcessID": 1000055577,
          "ChemicalID": 55,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567786,
          "ProcessID": 1000055577,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567788,
          "ProcessID": 1000055577,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567789,
          "ProcessID": 1000055577,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568182,
          "ProcessID": 1000055577,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055579,
      "AltID": "AHF Feed Line",
      "FacilityID": 1000044901,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056486,
          "ProcessID": 1000055579,
          "NAICSCode": "562211",
          "_desc": {
            "NAICS_CODE": "562211",
            "NAICS_DESCRIPTION": "Hazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067790,
          "ProcessID": 1000055579,
          "ChemicalID": 55,
          "Quantity": 7700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567790,
          "ProcessID": 1000055579,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044901,
      "SummaryText": "Executive Summary\n\n\n\nRisk Management Program\n\n\n\nVeolia Technical Solutions\n\n\n\nPort Arthur Facility\n\n\n\nTHE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\n\n\nVeolia ES Technical Solutions, L.L.C., (Veolia) is committed to being a responsible member of the community by operating in a safe and environmentally sound manner.  The three core policies (safety, environmental, and sustainability) express the company's commitment to providing the resources, processes, facilities, standard training, discipline, and work culture to ensure a safe work environment for all employees and safety for the community in which we operate.  Veolia employees are committed to being supportive members of the community by integrating economic, social, and environmental considerations into day to day business and long range planning.  The Accidental Release Prevention Programs at our facilities include daily toolbox meetings, weekly safety meetings, and a safety committee with representation from each department.  The company performs annual emergency response training and all employees understand their role and responsibility in the event of an emergency.  Veolia provides an employee handbook to all new hires, which includes specific and general safety and environmental rules and best practices.  In addition, Veolia is an active participant in the Local Emergency Planning Committee (LEPC) and a long-time member of the Port Arthur Industrial and Community Leaders Advisory Group.    \n\n\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nVeolia's Port Arthur Facility is a commercial hazardous waste management facility located at 7665 Highway 73, which is approximately 3.5 miles west of Taylor Bayou and outside of Port Arthur, Texas.  The Port Arthur Facility receives and manages virtually all types of hazardous and non-hazardous wastes, including most hazardous wastes identified and listed in 40 CFR Part 261.  These wastes include household hazardous"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044901,
      "SummaryText": " waste, waste generated by commercial establishments (e.g., dry cleaners, mechanic shops, printing offices), and waste generated by industrial facilities (e.g., petroleum refining and petrochemical plants, pulp and paper mills, semiconductor plants).  Wastes not accepted by the facility include radioactive and explosive wastes.  The plant is staffed 24 hours a day, 7 days a week year round and has full time security personnel.  The facility has several Process Safety Management (PSM) units under the U.S. Occupations Safety and Health Administration (OSHA) rules.  The materials subject to the Risk Management Program (RMP) will also be managed in several separate processes, including storage and handling.\n\n\n\nThe four RMP-regulated toxic substances covered by the Port Arthur Facility's RMP are hydrogen fluoride, phosphorus trichloride, phosphorus oxychloride, and aqueous hydrochloric acid (37% concentration or more).  The plant will destroy these regulated substances in the on-site incinerator.  The materials will be received in containers and kept in two storage areas until processed in the incinerator.  Individual containers will be moved to the incinerator area, connected to the incinerator feed lines, and then fed to the combustion chambers with 99.99999+% destruction efficiency for each material.  No hazardous substances will be formed as a result of the feeding and combustion of these materials.\n\n\n\nA Hazard Assessment for the process was completed consistent with the 40 CFR 68, Subpart B requirements.  The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances, were determined for each reported scenario. \n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nA number of processes at this facility are subject to the OSHA Process Safety Management (PSM) standard under 29 CFR 1910.119.  The plant PSM program incorporates all of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044901,
      "SummaryText": "he PSM elements identified in the regulation.  The PSM elements are applied uniformly in the plant to both PSM covered processes and other chemical processes to ensure that the plant is operated safely.  There are three elements that act as a cornerstone to the accidental release prevention program:\n\n\n\n * Procedures - Current, clearly written standard operating procedures and safe work practices ensure that both experienced and inexperienced employees (including contract employees) will respond in a safe, consistent, and prescribed manner to any reasonably anticipated emergency.  Veolia has developed written operating procedures that list operating limits for safety equipment, consequences of deviation, appropriate responses for deviation, and emergency shutdown.  In addition, procedures are also being updated to contain pictures of equipment and diagrams in addition to text descriptions to assist in the safe de-energizing of equipment.  These procedures are annually reviewed and certified by front line employees.  The operating procedures are available in the company intranet, and a hard copy of the procedures that is updated quarterly is also available in case of power outage.  \n\n * Employee Involvement - Veolia Technical Solutions relies on the expertise of employees at all levels and disciplines to optimize operations and safety.  This is achieved by consulting with (i.e., exchanging information with, and soliciting input and participation from) employees to ensure consideration of their knowledge and experience in all applicable areas of the prevention program.  Procedures are reviewed and signed off on annually by front line operators.  All departments participate in Process Hazard Analyses (PHAs), incident investigations/corrective actions, plant safety committee, and daily toolbox/weekly safety meetings.  \n\n * Incident Investigation - Incidents and near-incidents are quickly investigated with all affected parties, incident reports/ documentation is developed"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044901,
      "SummaryText": ", and corrective actions are identified/ tracked to completion.  Corrective actions are then shared with employees during the weekly safety meetings.  All supervisors and managers have completed the appropriate training.  Incident investigations are also reviewed by the safety committee to solicit additional insight from personnel that may not have been involved in the incident or incident investigation.  \n\n\n\nSection 7 of the RMP describes existing safety features applicable to prevention of accidental releases of regulated substances at the facility.  The accident prevention program is applied uniformly to both PSM covered processes and chemical process.  Collectively, the PSM element and overreaching management system helps prevent potential accidental scenarios.\n\n\n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThis Risk Management Plan is a predictive filing.  Since the RMP-regulated substances are not present at the facility at the time of this RMP initial submission, the facility has not experienced any reportable accidents.\n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\n\n\nVeolia has implemented a written Emergency Action Plan (EAP) to respond to accidental releases of hazardous materials, fires, natural disasters, and/or acts of terrorism.  The plan includes all aspects of emergency response from initial discovery, defensive maneuvers that can reduce the severity/extent of the spill/release if they can be done without risking injury or exposure to personnel, response to spills/releases, plant alarms, emergency reporting, and evaluation/accountability.  Core site leadership team members have completed Incident Command System (ICS) training to coordinate response efforts with first responders.  A draft organizational chart and key ICS forms are also included in the EAP. \n\n\n\nEmployees receive annual training in emergency procedures.  In addition, members of the facility's fire brigade attend annual fire training which includes both a field exercise where each employee extinguishes a liv"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044901,
      "SummaryText": "e fire and either classroom or computer based training.  To ensure proper functioning, emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within processes that would require a modified emergency response. \n\n\n\nThe emergency plan has been sent to first responders and the LEPC.  \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nReviews of key prevention program elements such as PHAs, incident investigation, management of change, and compliance audits are regularly conducted at the Port Arthur Facility to verify designs and to identify potential hazards.  Recommendations may be developed as a result of these reviews and equipment inspections, safety meetings, industrial experiences, technology improvements, and employee suggestions.  Once formulated, recommendations are reviewed, and corresponding action items are developed to implement each recommendation, which are then tracked to completion.  \n\n\n\nFor the RMP-regulated substances covered by this RMP, the following items identified and based on risk ranking within the PHA will be completed:\n\n\n\n * Ensure that material suppliers comply with appropriate regulations for the packaging and transportation of the regulated substances.\n\n * Review the gasket/ connector materials used in service to determine if these are appropriate for the service, and determine if additional measures such as flange covers are needed to \n\n   prevent moisture infiltration into the flange system.\n\n * Install detectors with alarms to allow for timely detection of leaks and/or releases.\n\n * Continue participation/coordination with the Jefferson County LEPC and utilize the Southeast Texas Alerting Network (STAN) for community notification of emergency releases.\n\n\n\n\n\n"
    }
  ]
}