{
  "FacilityID": 1000088397,
  "FacilityName": "Nestle Development Center",
  "FacilityStr1": "809 Collins Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Marysville",
  "FacilityState": "OH",
  "FacilityZipCode": "43040",
  "Facility4DigitZipExt": "4002",
  "FacilityCountyFIPS": "39159",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "40.229444",
  "FacilityLongDecDegs": "-083.375583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nestle R&D Center, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nestle Development Center",
  "OperatorStr1": "809 Collins Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Marysville",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43040",
  "OperatorZipCodeExt": "4002",
  "RMPContact": "Matthew Betz",
  "RMPTitle": "Utilities Engineer",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000000474",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-11-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-09-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-09-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-09-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.23024,
  "FRS_Long": -83.37788,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110044,
      "AltID": "Refrigerations System",
      "FacilityID": 1000088397,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111336,
          "ProcessID": 1000110044,
          "NAICSCode": "54171",
          "_desc": {
            "NAICS_CODE": "54171",
            "NAICS_DESCRIPTION": "Research and Development in the Physical, Engineering, and Life Sciences"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137412,
          "ProcessID": 1000110044,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637412,
          "ProcessID": 1000110044,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088397,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nNestle Product Technology Center uses anhydrous ammonia to provide cooling for the process areas.  It is Nestle policy to have programs in place dealing with safety precautions for handling these substances and to prevent unnecessary human exposure, to reduce the threat to employee personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is Nestle policy to adhere to all applicable Federal, state, and local rules and regulations. Safety depends upon the manner in which we handle ammonia, combined with the safety devices inherent in the design of this facility, plus written procedures that we use in the training of our personnel.\n\n\n\nSOURCES AND PROCESS DESCRIPTION\n\n\n\nNestle Product Technology Center is in the business of researching and developing food and beverages such as, coffee, tea, and ready-to-drink products for their corporation.  These products are cooled by evaporators and heat exchangers during the process.  Anhydrous Ammonia is the refrigerant used for cooling due to the low cost of the medium and the low temperatures that must be obtained.  The ammonia, which is kept within a closed loop system, is used to cool CO2 and glycol which then are then used to remove heat from the products and storage rooms.  Ammonia is vaporized in evaporator coils by heat removed from the CO2 which has taken heat from products and cooling areas at low temperatures and then the heat is transferred to the ammonia system.  The heat in the ammonia system is then transferred from the system to the atmosphere by moving outside air and water over condenser coils.\n\n\n\n\n\nThe ammonia system at the Nestle Product Technology Center contains up to 21,000 pounds of ammonia.\n\n\n\nPotential for Exposure to Ammonia is very low because the refrigeration operation is a closed system with no purposeful exposure to ammonia.  As a closed system, exposure potentials are primarily rel"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088397,
      "SummaryText": "ated to equipment failure, fugitive emissions from improperly adjusted or worn valve packing, failure of pump and compressor seals and pipe connector gaskets, or mistakes in operation of the system. \n\n\n\n\n\nTHE FIVE YEAR HISTORY\n\n\n\nNestle Product Technology Center has been in operation since 1996.  There have been no incidents of sufficient severity to qualify for inclusion in the RMP Five Year Accident History.   \n\n\n\nRELEASE PREVENTION PROGRAM AND PREVENTION STEPS\n\n\n\nThe Nestle Product Technology Center complies with EPA's Accidental Release Preventative Rule with all applicable state codes and regulations for ammonia.  Management systems are in place to administer the RMP prevention programs for ammonia. The PSM Coordinator is the responsible person for leading this program.\n\n\n\nThe Nestle Product Technology Center is in compliance with OSHA's PSM rule for ammonia.  The RMP's accidental release prevention program for ammonia is covered by the elements of the PSM program.  Controls for the prevention programs are achieved by:\n\n\n\n-   Effective preventative maintenance programs\n\n-   Reviews for proper design\n\n-   Development of and following operating procedures\n\n-   A mechanical integrity program that includes equipment testing procedures\n\n-   Training to be aware of potential exposure situations and using exposure prevention procedures and/or protective equipment.\n\n\n\nEMERGENCY RESPONSE PLAN\n\n\n\nThis facility's emergency response program is modeled on the IIAR's \"Risk Management Guidelines Program for Ammonia Refrigeration.\"  An emergency response plan is in place at the Nestle Product Technology Center to deal with incidents and emergencies that might take place onsite.  The facility utilizes a defensive response stance for Ammonia release and have been working with local fire departments to communicate expectations and to familiarize them with the facility. Onsite drills are also scheduled as part of the emergency response plan to familiarize employees of the dangers "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088397,
      "SummaryText": "of ammonia and the proper response to alarms and evacuations.  Ammonia awareness training is also taken by all facility personnel on an annual basis.  The plan has been provided to, and reviewed with the Union County Local Emergency Planning Committee (LEPC).  Coordination with the LEPC has been made to notify them through the emergency response plan to respond to incidents that may affect the public.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nNestle Product Technology Center continues to improve and update the employee training program to enhance awareness for all employees and contractors, and increase the skills and qualifications of our refrigeration operators to increase their abilities to respond to emergencies.  This ongoing training includes operating procedure reviews, drills, and review of the factory's PSM program elements."
    }
  ]
}