{
  "FacilityID": 1000029076,
  "FacilityName": "Arkema Coating Resins",
  "FacilityStr1": "12840 South Pulaski Road",
  "FacilityStr2": null,
  "FacilityCity": "Alsip",
  "FacilityState": "IL",
  "FacilityZipCode": "60803",
  "Facility4DigitZipExt": "1999",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.666389",
  "FacilityLongDecDegs": "-087.716667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.Arkema.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 61592309,
  "ParentCompanyName": "Arkema Inc.",
  "Company2Name": null,
  "CompanyDUNS": 61592309,
  "Company2DUNS": 0,
  "OperatorName": "Arkema Inc.",
  "OperatorStr1": "12840 South Pulaski Road",
  "OperatorStr2": null,
  "OperatorCity": "Alsip",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60803",
  "OperatorZipCodeExt": "1999",
  "FTE": 37,
  "OtherEPAFacilityID": "ILD069998078",
  "EPAFacilityID": "100000120139",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-07-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-10-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-10-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-10-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.65949,
  "FRS_Long": -87.71928,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000035504,
      "AltID": "Arkema Coating Resins",
      "FacilityID": 1000029076,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043028,
          "ProcessID": 1000035504,
          "ChemicalID": 29,
          "Quantity": 1809324.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000035866,
          "ProcessID": 1000035504,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000031056,
              "Process_NAICS_ID": 1000035866,
              "SafetyReviewDate": "2010-07-16 00:00:00",
              "PHA_Date": "2008-05-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 1,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-05-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Catalytic Oxidizer",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Spill Containment Basin",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-01-30 00:00:00",
              "TrainingReviewDate": "2009-04-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Electronic Training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Certification Required",
              "MaintenanceReviewDate": "2009-02-17 00:00:00",
              "EquipmentInspectionDate": "2009-03-23 00:00:00",
              "EquipmentTested": "T&I  (Inspections) of Reactor  5 and associated equipment",
              "ChangeMgmtDate": "2009-03-31 00:00:00",
              "ChangeMgmtReviewDate": "2008-07-14 00:00:00",
              "PreStartupReviewDate": "2008-11-18 00:00:00",
              "ComplianceAuditDate": "2009-02-04 00:00:00",
              "AuditCompletionDate": "2009-12-31 00:00:00",
              "IncidentInvestigationDate": "2009-03-11 00:00:00",
              "InvestigationChangeDate": "2009-05-01 00:00:00",
              "ParticipationPlansReviewDate": "2008-10-23 00:00:00",
              "HotWorkPermitReviewDate": "2008-05-19 00:00:00",
              "ContractorSafetyReviewDate": "2009-01-01 00:00:00",
              "ContractorSafetyEvalDate": "2009-04-06 00:00:00",
              "CBI_Flag": 0,
              "Description": "Arkema Coating Resins, uses bulk monomers as part of our facility's emulsion polymers process in producing water-borne latex.  A batch operating process is used to produce the latex, which is a non-flammable, non-toxic product.  The latex produced at this site is sold to coating manufacturers.  Some of the products made from the latex produced are used as: paints, caulks, adhesives and sealants.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000037080,
                  "PreventionProgram3ID": 1000031056,
                  "ProcessChemicalID": 1000043028
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000029076,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-01-08 00:00:00",
    "ERTrainingDate": "2009-01-08 00:00:00",
    "CoordinatingAgencyName": "Alsip Fire Department",
    "CoordinatingAgencyPhone": "7083856902",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029076,
      "SummaryText": "ARKEMA COATING RESINS (ACR)\n\n12840 SOUTH PULASKI ROAD\n\nALSIP, ILLINOIS  60803\n\nRISK MANAGEMENT PLAN\n\n\n\nEXECUTIVE SUMMARY\n\n\n\n\n\n\n\n1. Accidental Release Prevention and Emergency Response\n\n     Policies\n\n\n\nThe ARKEMA COATING RESINS (ACR)Alsip Plant is committed to operating and maintaining all of our processes in a safe and responsible manner.  We have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include both Arkema Emulsion Systems, Responsible Care requirements and governmental requirements, such as the Environmental Protection Agency's (EPA) Risk Management Program (RMP) rule and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.\n\n\n\n2. Description of the Facility and Regulated Substances\n\n\n\nThe ARKEMA COATING RESINS (ACR)Alsip Plant is a manufacturing facility that produces synthetic latex polymer products, which are sold to customers that convert them into finished products such as latex paint, caulk and adhesives.  The RMP rule requires that if a facility, such as the Alsip Plant, has a specific amount (threshold) or more of any one of 140 toxic and flammable chemicals, the facility must follow the RMP rule requirements for that chemical.  The ACR Alsip Plant has the following RMP-regulated toxic substances at levels above threshold quantities: \n\n\n\nVinyl Acetate Monomer (Acetic acid ethenyl ester)\n\nThe Alsip Plant has no RMP-regulated flammable substances.\n\n\n\n3. Key Offsite Consequence Analysis Scenarios\n\n\n\nEPAs RMP rule requires that we provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these hypothetical scenarios.  Unless otherwise specified, no credit was taken for administrative controls or mitigation measures in evaluating the off-site"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029076,
      "SummaryText": " impact of the scenarios.  Chemical-specific steps to prevent these scenarios from occurring, and to mitigate their effects should they occur, are shown immediately after the scenario description.  The plant's general accident prevention program is described in Section 4.\n\n\n\nA)  Regulated Toxic Chemicals\n\n\n\nWorst-Case Release Scenario\n\n\n\nVinyl Acetate:  This scenario assumes a storage tank ruptures, releasing within 10 minutes 310,800 pounds of vinyl acetate as a liquid to the monomer mound storage dike, which in turn drains to the spill containment basin.  According to EPA's Offsite Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.\n\n\n\nSpecific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n\n\n\n  Fire Water Monitors:  Area fire water spray monitors can be used with foam to help suppress Vinyl Acetate vapors.\n\n\n\n  Inhibitor:  The vinyl acetate contains an inhibitor that prevents reactions from occurring in a storage tank car that could lead to over pressure.\n\n\n\n  Secondary Containment:  The tank is located in a concrete secondary containment structure and is connected to the spill containment basin.  This containment basin reduces evaporation from the spill.\n\n\n\n  The vapor monitoring system in the monomer storage area has been expanded to include the spill containment basin.\n\n\n\nAlternative Release Scenarios \n\n\n\nVinyl Acetate:  This scenario assumes the bottom valve on the tank car is knocked off and the entire contents, 195,000 pounds is lost in 10 minutes.  According to the EPA's Offsite Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors. The following active mitigation measures are used in this analysis:\n\n\n\n   Secondary Containment:  The railcar is located in a concrete secondary containment structure and is connected to the spill containment basin.  This containment basin reduces evaporation from the spill.\n\n\n\n   Emergenc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029076,
      "SummaryText": "y Shutdown System:  There is a control disconnect switch located at the pump where an operator can select off and shut down the pump and close the unloading valve.  Additionally there is a manual pump Start/Stop switch located in the control shed that can be turned to the off position and the unloading pump and transfer value will shut as their fail safe position.  This system can also be shut down remotely using the Moore APACs control system.\n\n\n\n   Surveillance: Operations employees monitor the work area while the pump is in use.\n\n\n\n   Rail Traffic Control:  To prevent possible collision and rupture of the rail car with rail equipment derailers are used to prevent unexpected moves and collisions.\n\n\n\n\n\nOther specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n\n\n\n   Fire Water Monitors:  Area fire water spray monitors can be used to help suppress vinyl acetate vapors in the process detention basin used in conjunction with inducted foam.\n\n\n\n   Vapor Suppression:  Vapor-suppressing foam can be applied to the contents of the unloading pad using the foam water deluge system.\n\n\n\n  The vapor monitoring system in the monomer storage area has been expanded to include the spill basin.\n\n\n\n4. General Accidental Release Prevention Program \n\n\n\nOur general accident prevention program consists of compliance with the EPA RMP rule and OSHA's PSM standard and implementation of Arkema's Operational Safety Program and Episodic Risk Management System.  Key elements include:\n\n\n\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\n\n\n\nProcess Safety Information: Chemical hazards, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\n\n\n\nProcess Hazard Analysis:  Process hazard analyses are conducted every five years to identify major process h"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029076,
      "SummaryText": "azard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\n\n\nEpisodic Risk Management:  Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\n\n\n\nOperational Safety Standards:  Design requirements for active and passive mitigation controls used to prevent major process hazards documented in our operational safety standards have been incorporated into our Operating Procedures.\n\n\n\nOperating Procedures:  Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\n\n\n\nOperator Training/Certification Program:  The plant has training and testing program which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\n\n\n\nTechnical Staff Training and Support:  Trained technical staff employees are available 24 hours a day to support operations.\n\n\n\nMaintenance Procedures:  The plant has specific procedures for maintaining process equipment so that it operates safely.\n\n\n\nMaintenance Training:  The plant trains persons who perform routine or complex maintenance tasks on process equipment.\n\n\n\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\n\n\n\nLOPA is an administrative program that uses semi-quantitative assessment techniques in process hazard analyses to ensure that controls used for prevention or mitigation of hazards provide adequate protection.\n\n\n\nCTT/MTL are database systems that generate reminders designed to ensure that process safety information is kept up-to-date.\n\n\n\nManagement of Change:  The plant has a management system to ensure that modified fa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000029076,
      "SummaryText": "cilities and processes will be safe to operate.\n\n\n\nPre-startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\n\n\n\nIncident Investigation:  The plant has a program to ensure that accidents and incidents are properly investigated to determine the cause(s) and to implement corrective action(s) that are needed to prevent the event from reoccurring.\n\n\n\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\n\n\n\nHot Work Permit:  The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n\n\n\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.\n\n\n\nCompliance Audits:  Periodic Corporate, Business and plant-led audits are conducted to ensure that process operations comply with governmental and Arkema requirements.\n\n\n\nOperational Safety Program:  Arkema has a comprehensive program to ensure that all the elements listed above are implemented at this location.  This Program includes accountabilities for timely and proper implementation of the program elements.\n\n\n\nThese general prevention elements and the chemical-specific steps discussed in the previous section are parts of an overall management system to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n\n\n5. FIVE-YEAR ACCIDENT HISTORY\n\n\n\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical at the Arkema Emulsion Systems Alsip Plant that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelte"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000029076,
      "SummaryText": "r-in-place, property damage or environmental damage.\n\n\n\n6. EMERGENCY RESPONSE PROGRAM\n\n\n\nThe ARKEMA COATING RESINS(ACR)Alsip Plant maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including:\n\n\n\n   Proper first-aid and medical treatment for exposures.\n\n\n\n   Evacuation plans and accounting for personnel after an evacuation.\n\n\n\n   Notification of local emergency response agencies and the public if a release occurs.\n\n\n\n   Post-incident cleanup and decontamination requirements.\n\n\n\n   Inspecting, testing, maintaining, and using emergency response equipment.\n\n\n\nThe emergency response program is updated when necessary based on modifications made to facility processes.\n\n\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nOn-going programs, such as Process Hazard Analysis evaluations, continually aim to improve process safety.\n\n\n\n8.  The Alsip site has had no accidents in greater than the past 5 years\n\n\n\n"
    }
  ]
}