{
  "FacilityID": 1000086162,
  "FacilityName": "MGC Pure Chemicals America, Inc",
  "FacilityStr1": "4500 Roy J Smith Drive",
  "FacilityStr2": null,
  "FacilityCity": "Killeen",
  "FacilityState": "TX",
  "FacilityZipCode": "76543",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48027",
  "LEPC": null,
  "FacilityLatDecDegs": "31.0617",
  "FacilityLongDecDegs": "-97.4048",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fred J. Boeheim",
  "OperatorStr1": "4500 Roy J Smith Drive",
  "OperatorStr2": null,
  "OperatorCity": "killeen",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76543",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000243952",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-03-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-03-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107610,
      "AltID": "Inorganic chemical mfg",
      "FacilityID": 1000086162,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134532,
          "ProcessID": 1000107610,
          "ChemicalID": 56,
          "Quantity": 68138.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000108883,
          "ProcessID": 1000107610,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000091262,
              "Process_NAICS_ID": 1000108883,
              "SafetyReviewDate": "2020-03-16 00:00:00",
              "PHA_Date": "2020-03-16 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-04-30 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-03-23 00:00:00",
              "TrainingReviewDate": "2020-03-23 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-03-23 00:00:00",
              "EquipmentInspectionDate": "2020-03-20 00:00:00",
              "EquipmentTested": "Leak test of AV-5",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-11-19 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-06-11 00:00:00",
              "HotWorkPermitReviewDate": "2018-05-14 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000113507,
                  "PreventionProgram3ID": 1000091262,
                  "ProcessChemicalID": 1000134532
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000086162,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-03-20 00:00:00",
    "ERTrainingDate": "2020-03-23 00:00:00",
    "CoordinatingAgencyName": "Killeen Fire Department",
    "CoordinatingAgencyPhone": "2545017660",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086162,
      "SummaryText": " \n\n\n\nRISK Management Plan\n\nMGC\n\nKilleen\n\n\n\nRISK MANAGEMENT PLAN (RMP) EXECUTIVE SUMMARY\n\nMGC Pure Chemicals America, Inc. (MPCA)\n\nMPCA is required to develop a RMP for the proposed Ammonia Ammonium Hydroxide Purification Plant located in Killeen, Texas, hereafter referred to as the Ammonia process.\n\nAs required by 40 CFR 68.155, MPCA developed this RMP Executive Summary for the Ammonia process.\n\n1.    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nThe accidental release prevention and emergency response policies at the stationary source. The policy can be seen in Appendix 2.2I.\n\n2.    THE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\nMPCA will have one regulated substance in a covered process at its facility located in Killeen, Texas:  Ammonia (anhydrous) will be present in the process (>10,000 pounds), hereafter referred to as the Covered Process.  The facility is subject to the Program Level 3 RMP requirements.  [The OSHA Process Safety Management (PSM) also applies to the facility because the anhydrous ammonia onsite exceeds the PSM limit of 10,000 pounds.]\n\nMPCA is proposing to construct and operate an ammonium hydroxide purification plant located in Killeen, Texas. The facility will receive raw liquid anhydrous ammonia that will be stored and purified at the facility before it is exported to customers. Bulk liquid shipments of raw anhydrous ammonia will be received via tank trucks and will be transferred to a raw anhydrous ammonium storage tank.  Final products will be stored in temperature-controlled storage tanks. Contents of the final product tanks will be shipped out via isotainers.\n\nPer the amendments to 40 CFR 68, effective on March 14, 2017 , the facility is not required to include the Offsite Consequence Analysis (OCA) results in this Executive Summary to minimize the security risks associated with posting the information on the Internet.  MPCA is completing an OCA and is including the Worst-Case Release Scen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086162,
      "SummaryText": "ario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures, in the RMP document to be maintained onsite at the Killeen facility. \n\nThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nMPCA undertakes necessary measures to comply with the EPA`s accidental release prevention requirements included in 40 CFR part 68, and OSHA's emergency planning and response under PSM regulations in 29 CFR 1910.119. \n\nThe following sections briefly describe the elements of the MPCA release prevention program that are in place at its stationary source. \n\n3.    PROCESS SAFETY INFORMATION (PSI)\n\nMPCA maintains a detailed record of its Process Safety Information (PSI) that describes chemical hazards, operating parameters and equipment designs associated with the regulated substance and covered process. \n\n4.    PROCESS HAZARD ANALYSIS (PHA)\n\nMPCA conducts PHA studies to ensure that hazards associated with its covered process are identified and controlled efficiently. The methodology used to carry out these analyses is \"What If\".  Studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at least every five years.  Findings and recommendations related to the PHAs are addressed in a timely manner. The most recent PHA for the covered process was completed on {6/27/18. Please see appendix 2.2A for the program as well as the study. \n\n5.    OPERATING PROCEDURES\n\nMPCA maintains written operating procedures to safely conduct activities within its covered process. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in these processes. \n\n6.    TRAINING\n\nMPCA has a training program in place to ensure that employees who"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086162,
      "SummaryText": " are tasked with operational processes and procedures are competent.  Refresher training is provided on an as needed basis and on schedule per OSHA's PSM requirements at least once every three (3) years. \n\n7.    MECHANICAL INTEGRITY\n\nMPCA has a preventive maintenance program for the equipment in the covered process.  MPCA carries out documented maintenance checks on process equipment to ensure proper operations. Covered process equipment examined by these checks includes, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  \n\nMaintenance operations are carried out by qualified personnel with previous training in maintenance practices.  MPCA personnel are offered specialized training as needed. Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \n\n8.    MANAGEMENT OF CHANGE (MOC)\n\nMPCA has a written Management of Change process for the Covered Process to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or other employees whose tasks are affected by a modification in process conditions are promptly made aware of and offered training to address the modifications. \n\n9.    PRE-STARTUP SAFETY REVIEW (PSSR)\n\nMPCA has a Pre-startup Safety Review program for the Covered Process.  The facility performs Pre-start up safety reviews related to new processes and to modifications of the Covered Process. The reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start-up prior to placing equipment into operation.  A completed PSSR is required prior to introducing hazardous materials to the process.\n\n10.     COMPLIANCE AUDITS\n\nMPCA conducts audits on a regular basis to determine whether the provisions set out under the RMP regulation are being implemented.  These audits are carried out at least every three years and corrective act"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086162,
      "SummaryText": "ion(s) required as a result of the audits are undertaken in a safe and prompt manner. \n\n11.     INCIDENT INVESTIGATION\n\nMPCA investigates incidents that have resulted in, or could reasonably result in a catastrophic release of a regulated substance from the Covered Process. These investigations are undertaken to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring. Incident Investigation reports related to the Covered Process are retained for a minimum of five years. \n\n12.     EMPLOYEE PARTICIPATION\n\nMPCA believes that process safety management and accident prevention is a team-oriented effort. Company employees are encouraged to express their views concerning accident prevention issues and to recommend measures toward improvement.  \n\nIn addition, MPCA employees have access to information created as part of the facility's implementation of the RMP regulations, including information resulting from PHAs and process safety information. \n\n13.     CONTRACTORS\n\nOn occasion, MPCA hires contractors to conduct specialized maintenance and construction activities for the Covered Process.  Prior to selecting a contractor, MPCA completes an evaluation of safety performance of the contractor.  \n\nMPCA has a policy of informing the contractors of known potential hazards related the contractor's work and the Covered Process.  Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance from a Covered Process occur. \n\n14.     FIVE-YEAR ACCIDENT HISTORY\n\nMPCA will begin constructing the Covered Process in early 2019; there is no operation history for the Covered Process.  Therefore, MPCA has not had an accidental release from the Covered Process over the last five years.  \n\n15.     EMERGENCY ACTION PLAN\n\nMPCA has a written Emergency Action Plan to cover accidental releases of hazardous materials, including the regulated substance in the Covered Process. The Emergency Action"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000086162,
      "SummaryText": " Plan includes the required aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. \n\nMPCA regularly inspects and services emergency response equipment is regularly inspected and serviced to ensure it is properly functioning.  In addition, the Emergency Action Plan is updated to reflect pertinent changes taking place within the Covered Process that would require a modified emergency response. \n\nMPCA is coordinating with the Local Emergency Planning Committee (LEPC) so that the LEPC is aware of the Covered Process and regulated substance and the emergency procedures proposed in the MPCA Emergency Action Plan.  Fire Station #3 was contacted to inform the agency of the regulated substances and covered processes.  \n\n16.     PLANNED CHANGES\n\nAt the time of the RMP Executive Summary's development, MPCA does not have planned changes to the Covered Process to improve safety.  A PHA was completed for the covered processes; recommendations from the PHA to improve safety will be evaluated and addressed using MPCA's risk prioritizing methods.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n1.    HAZARD ASSESSEMENT \n\n1.1.    Site description \n\n1.2.    Company Information\n\n1.3.    Adjacent Property Information\n\n1.4.    Process description\n\n1.5.    Movement of Raw Materials \n\n1.6.    Hazard Summary\n\n1.6.1.    SDS\n\n1.6.1.1.    Anhydrous Ammonia\n\n1.6.1.2.    Ammonium Hydroxide (29%)\n\n1.6.2.    Maximum Intended Storage (combine tables)\n\n1.6.3.    5-Year Accident Summary\n\n1.6.4.    Worst case scenario(s) \n\n\n\n2.    PREVENTION PROGRAM \n\n2.1.    Training\n\n2.1.1.    New Hire Safety Training\n\n2.1.2.    Contractor Safety Training\n\n2.1.3.    Employee Participation letter (add employee participation letter)\n\n2.2.    Process Hazard Analysis\n\n2.2.1.    Pre Startup Safety Reviews\n\n2.2.2.    Contractor Safety Program\n\n2.2.3.    Plant Operations Procedure\n\n2.2.4.    Mechanical Integrity\n\n2.2.5.    Preventative Maintenance "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000086162,
      "SummaryText": "schedule\n\n2.2.6.    Management of Change\n\n2.3.    Preventative Maintenance Schedule\n\n\n\n\n\n3.    EMERGENCY RESPONSE PROGRAM \n\n3.1.    Emergency Action Plan \n\n\n\n4.    APPENDIX \n\n"
    }
  ]
}