{
  "FacilityID": 1000000895,
  "FacilityName": "Cambrex Charles City, Inc",
  "FacilityStr1": "1205 11th Street",
  "FacilityStr2": null,
  "FacilityCity": "Charles City",
  "FacilityState": "IA",
  "FacilityZipCode": "50616",
  "Facility4DigitZipExt": "3466",
  "FacilityCountyFIPS": "19067",
  "LEPC": "NCREPD",
  "FacilityLatDecDegs": "43.055833",
  "FacilityLongDecDegs": "-092.693056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 782974257,
  "ParentCompanyName": "Cambrex Corporation",
  "Company2Name": null,
  "CompanyDUNS": 150596716,
  "Company2DUNS": 150596716,
  "OperatorName": "Cambrex Charles City, Inc",
  "OperatorStr1": "1205 11th Street",
  "OperatorStr2": null,
  "OperatorCity": "Charles City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50616",
  "OperatorZipCodeExt": "3466",
  "RMPContact": "Joe Nettleton",
  "RMPTitle": "VP, Operations and Site Director",
  "FTE": 203,
  "OtherEPAFacilityID": "IAD984591891",
  "EPAFacilityID": "100000176579",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-10-27 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-22 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-04-05 00:00:00",
  "DeRegistrationEffectiveDate": "2012-11-09 00:00:00",
  "AnniversaryDate": "2014-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.05453,
  "FRS_Long": -92.69339,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001087,
      "AltID": "PAA-HCL product",
      "FacilityID": 1000000895,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001173,
          "ProcessID": 1000001087,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000005623,
          "ProcessID": 1000001087,
          "NAICSCode": "325411",
          "_desc": {
            "NAICS_CODE": "325411",
            "NAICS_DESCRIPTION": "Medicinal and Botanical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001128,
          "ProcessID": 1000001087,
          "ChemicalID": 23,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 23,
            "ChemicalName": "Allylamine  [2-Propen-1-amine]",
            "CASNumber": "107-11-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501128,
          "ProcessID": 1000001087,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000895,
      "SummaryText": "Cambrex Charles City, Inc. (CCC), a subsidiary of Cambrex Corporation, manufactures chemicals for use in human pharmaceuticals and specialty chemical applications. The company develops and manufactures active pharmaceutical ingredients, fine chemicals and pharmaceutical intermediates for a wide range of applications. CCC maintains headquarters, research & development and manufacturing facilities in Charles City, Iowa and markets products globally.\n\nDr. Joseph Salsbury, a veterinarian, founded Dr. Salsbury's Laboratories in 1929.  The facility remained family owned until Solvay and Cie, a Belgium company, purchased it in 1979.  The name was changed to Solvay Animal Health, Inc. (SAH) in 1987.  In 1991, Cambrex Corporation acquired the chemical production assets from SAH.  The division was renamed Salsbury Chemicals, Inc. in 1991 and renamed Cambrex Charles City, Inc. in 2002, and remains a wholly owned subsidiary of Cambrex Corporation.\n\nCCC is committed to operating in a manner that is safe for employees, the public, and the environment.  As a part of this commitment, CCC has established a system to help ensure the safe operation of the Charles City Plant. One part of this system is a risk management program (RMP) that helps manage risks at the Charles City Plant and that complies with the requirements of the Environmental Protection Agency's (EPA's) rule 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at the Charles City Plant.  This document is    intended to satisfy the requirements of the RMP rule and to provide the public with a description of the risk management program and activities at the Charles City Plant.\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nCCC is committed to the safety of its employees and the public, and to the preservation of the environment through the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000895,
      "SummaryText": " prevention of accidental releases of hazardous substances.  Several elements of CCCA?s environmental, health, safety and security management program focus on accident prevention.\n\nCCC conducts a Process Hazards Analysis (PHA) for new product introduction or for certain process or equipment modifications.  PHAs are periodically revisited as required by regulation.\n\nCCC utilizes written operating procedures for production and maintenance activities.  Production operating procedures include information on chemical hazards and associated personal protective equipment, as well as instruction on emergency shutdown, spill response and evacuation procedures.\n\nCCC conducts extensive employee training.  In addition to general environmental, health and safety training, employees receive process specific training prior to working with a process; with refresher training conducted as required.  This training includes an overview of the process and operating procedures, as well as a review of associated safe work practices and any specific known hazards associated with the process or chemicals involved in the process.  CCC also provides emergency response training to potentially affected employees.  CCC trains all Production Operators, Maintenance employees and associated Supervisory and other emergency response personnel to the Hazardous Materials Technician level as defined by OSHA in 29 CFR 1910.120.  CCC has approximately 120 employees current with Hazardous Material Technician training requirements.  \n\nCCC has implemented a maintenance program that is intended to maintain the operational integrity of equipment, piping, instrumentation and facilities so that CCC can safely produce quality products with no adverse affect upon the environment.  Preventative maintenance schedules and equipment files are maintained.  A change control program is in place to manage changes to raw materials, facilities, manufacturing processes, safety systems, equipment systems and security systems,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000895,
      "SummaryText": " particularly including safety, environmental and quality issues.\n\nCCC conducts regular pre-startup safety reviews.  Pre-startup reviews are conducted prior to initial startup, or implementation of a significant modification.  CCC conducts batch manufacturing, typically campaigning multiple batches.  CCC also conducts pre-startup reviews prior to production campaigns for established products.\n\nCCC conducts periodic audits of its environmental, health, safety and security systems.  This includes audit of its Risk Management Program. \n\nCCC has programs in place for environmental, health, safety and security incident investigations.  Incidents, near misses, spills, complaints and other deviations are investigated, with findings communicated in a manner to help prevent recurrence.  CCC works to integrate lessons learned into our operations to further minimize risks to employees, the environment, and the community.\n\nCCC has developed a written employee participation policy.  Employees are invited to participate in the development of programs and procedures which affect employee job tasks.  Where appropriate, cross-functional teams are formed.  Examples of this include incident investigation, PHAA?s, safety policy development, emergency response and employee training.  \n\nCCC has implemented a hot work permit program to establish safe work practices that minimize employee exposures and potential incident resulting from hot work activities.  This policy applies to tasks such as welding, burning, cutting and spark generating activities.  A written permit is required for all hot work occurring in operating areas.\n\nCCC has developed contractor safety procedures that specify, among other things, certain training, chemical handling, protective equipment, and notification requirements.  As part of its contractor safety policy, CCC periodically evaluates the safety performance of contractors working onsite. \n\nCCC implements reasonable controls to prevent foreseeable releases of ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000895,
      "SummaryText": "zardous substances.  In the event of a significant accidental release, CCC has developed a written emergency response plan.  The plan includes response procedures in the event of an accidental release, as well as procedures for notifying public and local agencies responsible for responding to accidental releases.  CCC has coordination agreements in place with multiple local response groups.  Emergency health care information for regulated substances is included in the response plan.\n\nCCC operates its plant in an environment that promotes safety, shows respect for employees, encourages individual development and supports teamwork to achieve common goals. We know that the ongoing health and safety of our employees and environmental compliance is critical to our success.  Thus, CCC manages our business in a manner conscious of current and future environmental needs so that we are an asset to our community through our business practices and local involvement.\n\nWe continuously improve our practices in light of advances in technology and new understandings in safety, health, and environmental science.  We make consistent measurable progress in implementing this commitment throughout our operations.  \n\nCCC is a member of the Synthetic Organic Chemical Manufacturers Association (SOCMA) and adheres to the ChemStewardsA? program, which is a requirement for membership.  As a member of SOCMA and a subscriber to the ChemStewardsA? Core Principles, our company is dedicated to continuous improvement in environmental, health, safety and security (EHS&S) performance. We promote innovative, safe and responsible operations and contribute to a healthy, productive economy. To meet these responsibilities, we pledge to manage our business according to the following principles:    \n\n-    We will communicate with and engage employees, business partners and the community to foster a greater understanding on environmental, health, safety and security matters. \n-    We will promote the concepts of p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000895,
      "SummaryText": "roduct stewardship throughout a product's lifecycle. \n-    We will make environmental, health, safety and security considerations a priority in our planning and operations for all new and existing products and processes. \n-    We will train employees in their environmental, health, safety and security responsibilities and promote involvement and accountability in these areas. \n-    We will continuously strive to use our resources efficiently and minimize waste. \n \nCCC has received third party verification that its environmental, health, safety and security management systems adhere to the ChemStewardsA? Core Principles.\n\n1.2 Stationary Source and Regulated Substances\n\nCCC's plant is located on a 45-acre site on the southwestern edge of town.  In order to manufacture one of its products, CCC stores and handles one RMP-regulated substance in an RMP-covered process.  Polyallylamine hydrochloride was first manufactured at CCC in July 1997.  Increased product demands subsequently caused CCC to employ this process at greater production rates, which requires that we store the RMP-regulated substance, allylamine, on site in amounts exceeding EPA's RMP threshold quantity of 10,000 lbs.  We store approximately 43,000 lbs. of allylamine, a toxic and flammable substance, in a 7,500 gal. bulk storage tank at atmospheric pressure.  The bulk storage tank and associated process equipment has a maximum intended inventory of 65,000 lbs and is regulated as a single EPA RMP Program 3 process.\n\n1.3  Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nCCC maintains a number of programs to help prevent accidental releases and to ensure safe operation:\n\nProcess Safety Information - CCC maintains up-to-date, easily accessible versions of a variety of important chemical process information concerning chemical hazards, process technology, and process equipment so that our employees can effectively perform their jobs in a safe manner.\n\nProcess Hazard Analysis - CCC performs te"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000000895,
      "SummaryText": "am-based hazard analyses on the allylamine process using industry best-practice methods.  A management safety team evaluates the results and resolves and implements safety improvements on a timely basis.  CCC updates its hazard analysis when significant process changes warrant, but no less often than every five years.\n\nOperating Procedures - We maintain written operating procedures for our employees to use and we annually certify the procedures to be accurate and up-to-date.\n\nTraining - CCC has thorough initial and refresher training programs and we document that our employees understand the training they receive.\n\nMechanical Integrity - CCC has a formal system to maintain the ongoing integrity of our process equipment.  Our well-trained maintenance personnel, using best practice procedures and high quality tools and materials, perform regular inspections, tests, and preventive maintenance activities.  We document the results of these inspections and    watch closely for and correct equipment deficiencies that could affect safe operation.\n\nManagement of Change - CCC follows a written procedure to evaluate proposed changes to our process to mange our risks and to ensure that new hazards are not introduced.\n\nPre-startup Safety Review - Following significant changes and prior to initial startup, we perform safety reviews to ensure that all equipment is ready, procedures have been modified as needed, appropriate training has been done, and process hazards have been evaluated and managed.\n\nCompliance Audits - CCC performs audits of its process safety management system and we certify that we have evaluated compliance and corrected any deficiencies.\n\nIncident Investigation - In the event of an allylamine release or a \"near-miss\", we thoroughly investigate the incident, determine root causes, and implement improvements to preclude recurrence.\n\nEmployee Participation - CCC knows that safety starts with its employees - the first line of defense against accidental releases.  W"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000000895,
      "SummaryText": "e consult with our employees and determine the appropriate involvement of workers in all accident prevention activities.\n\nHot Work Permit - CCC follows procedures to ensure that spark-producing work in areas containing allylamine do not result in fires or explosions.\n\nContractors - CCC maintains an effective contractors safety program that evaluates the safety program and performance of potential contractor firms, provides necessary site safety information to help ensure that their work can be completed safely when on site, and periodically evaluates the contractor's safety/job performance.\n\nIn addition to the safety management system described above, CCC employs several chemical-specific prevention and mitigation technologies to reduce the risk of allylamine releases:\n\n* Equipment constructed to appropriate codes and standards\n* Fire prevention sprinkler system\n* Storage tank dike and unloading area containment area and sump\n* Remotely-operated shutoff valves to quickly isolate leaking piping and equipment\n* Operators equipped with appropriate personal protective equipment to ensure quick emergency response\n\nThe CCC accident prevention program and chemical-specific steps outlined above also adhere to OSHA's process safety management standard.\n\n1.4  Five-Year Accident History\n\nCCC maintains an effective incident investigation program to identify the root causes of incidents and near-misses and to determine corrective actions to preclude the incidents from recurring.  No releases of allylamine have occurred from the Charles City Plant in the past five years that have resulted in any deaths, injuries, or significant property damage on site, or known deaths injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.\n\n1.5 Emergency Response Program\n\nCCC coordinates emergency response procedures with the Charles City Fire Department, Charles City Police Department, Floyd County Medical Center and with the North Central Regional Emergenc"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000000895,
      "SummaryText": "y Planning District.  All CCC plant employees receive significant training, generally including training to the OSHA Hazardous Materials Technician Level, to respond to spill events.  In the event of a large release or a release which may result in fire or explosion, workers evacuate the area and contact the fire department and other local and regional emergency response officials.\n\n1.6  Planned Changes to Improve Safety\n\nCCC constantly strives to improve the safety of its plant and processes through several formal and informal means.  A CCC management safety committee receives ideas for improvement via the following:  process hazard analyses, management of change reviews, pre-startup safety reviews, incident investigations, and periodic safety audits. We also maintain a program soliciting safety suggestions from employees.  Suggestions for improving safety are reviewed by the safety management committee, acted upon expeditiously in a conscientious fashion, and tracked to completion.\n\n"
    }
  ]
}