{
  "FacilityID": 1000043576,
  "FacilityName": "Shawville Station",
  "FacilityStr1": "Route 970",
  "FacilityStr2": null,
  "FacilityCity": "Shawville",
  "FacilityState": "PA",
  "FacilityZipCode": "16873",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42033",
  "LEPC": "Clearfield County LEPC",
  "FacilityLatDecDegs": "41.066667",
  "FacilityLongDecDegs": "-078.366667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "IP",
  "FacilityURL": "www.nrgenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NRG REMA LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NRG REMA LLC",
  "OperatorStr1": "P.O. Box F",
  "OperatorStr2": null,
  "OperatorCity": "Shawville",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16873",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Palian",
  "RMPTitle": "Engineer III",
  "FTE": 87,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000035071",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TVOP17-00001",
  "SafetyInspectionDate": "2004-03-17 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Shawville 2009 RMP Renewal",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-05-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-07-08 00:00:00",
  "DeRegistrationEffectiveDate": "2015-07-01 00:00:00",
  "AnniversaryDate": "2019-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.06688,
  "FRS_Long": -78.36526,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053804,
      "AltID": null,
      "FacilityID": 1000043576,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054586,
          "ProcessID": 1000053804,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065488,
          "ProcessID": 1000053804,
          "ChemicalID": 56,
          "Quantity": 50997.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565488,
          "ProcessID": 1000053804,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043576,
      "SummaryText": "INTRODUCTION\n\n\n\nShawville Station is a coal-fired, electric power generating station near Shawville, Pennsylvania. This 1,158-acre facility is located 10 miles northeast of Clearfield, PA, on the West Branch of the Susquehanna River, near the intersection of State Routes 879 and 970.  \n\n\n\nShawville Station employs approximately 87 full-time staff and a considerable number of contract employees.  The secondary economic impact of the facility on its many material and services suppliers is significant.  For example, the station provides employment for many coal miners and trucking firms.\n\n\n\nThe facility generates 597 MW of power from two identical, 175 MW units and two other units rated at 122 and 125 MW, respectively.  Each unit has a state-of-the-art pollution control system for particulate and special burners to reduce nitrogen oxide (Nox) emissions.\n\n\n\n\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\n\n\nShawville Station's policy is to comply with all applicable regulatory requirements, including those for accidental release prevention and emergency response.\n\n\n\n\n\n2. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\na. PRIMARY ACTIVITIES \n\n\n\nThis facility is a coal-fired, electric-power generating station.\n\n\n\nB. USE OF REGULATED SUBSTANCES\n\n\n\nAnhydrous ammonia is used at Shawville Station as a fluegas conditioner.  The ammonia improves the ability of the electrostatic precipitators (ESPs) to remove particulate from the flue gas.  In this process, the ammonia is converted to ammonium sulfate and removed from the flue gas as particulate.  \n\n\n\nNo other toxic or flammable materials are stored at the facility in quantities above the regulatory threshold.\n\n\n\nC. QUANTITIES HANDLED OR STORED \n\n\n\nThe anhydrous ammonia is transported, stored and conveyed as a liquid up to evaporators. A single 10,600-gallon pressurized, anhydrous ammonia storage tank located outdoors adjacent to the Machine Shop. The storage tank is kept und"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043576,
      "SummaryText": "er pressure to maintain the ammonia in liquid form. Administrative controls are used to ensure that the tank is not filled above the 85% level.\n\n\n\n3. THE WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO\n\n\n\na. WORST CASE RELEASE SCENARIOS \n\n\n\nThe worst-case release scenario for anhydrous ammonia assumes that the ammonia storage tank catastrophically ruptures, and the entire contents are released as a vapor over 10 minutes.  The quantity released in the 10-minute event is calculated as:\n\n\n\n10,600 gallons * 85% *5.17 lb/gal = 46,582 lb\n\n\n\nb. ALTERNATIVE RELEASE SCENARIO \n\n\n\nThe alternative release scenario (ARS) assumes that the entire contents of a 4,000-gallon ammonia tank truck are spilled into the paved unloading area and evaporate over a 10-minute period (due to, for example, an unloading hose rupture). The quantity released in the 10-minute event is calculated as:\n\n\n\n4,000 gallons * 5.17 lb/gal = 20,680 lb\n\n\n\nThe ARS can include the effects of active mitigation systems, and for Shawville Station this is the use of water sprays to minimize the ammonia plume.  Ammonia is very soluble in water, but the sprays must be activated manually after the release.  A conservative estimate is that the sprays would remove only one-half of the ammonia, changing the quantity released to 2,000 gallons, or 10,340 lb.  \n\n\n\nBecause both the ammonia tank truck and the ammonia storage tank have excess flow valves which would close upon the increase in flow from a hose rupture, the ARS is a very unlikely scenario. However, the use of excess flow valves was not considered in the alternative release calculations.\n\n\n\nc. DISTANCES TO ENDPOINT \n\n\n\nThe offsite consequences of these accidental releases were evaluated with a screening computer dispersion model (RMP*Comp, version 1.07).  Offsite consequence analysis of the worst-case scenario must include the following weather conditions: a wind speed of 1.5 m/s (3.4 mph), \"F\" atmospheric stability class, a temperature of 77?F, a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043576,
      "SummaryText": "nd relative humidity of 50%.  The more typical meteorological parameters used in analyzing the alternative release scenario for anhydrous ammonia include a mean wind speed of 6.7 mph and \"D\" atmospheric stability.\n\n\n\nThe maximum calculated distances to the endpoint using the RMP*Comp model is 2.6 miles for the worst-case scenarios for anhydrous ammonia.  This represents the maximum downwind distance that the catastrophic release (under worst-case weather conditions) could pose a hazard to the public.  For the alternative release scenario (anhydrous ammonia), the maximum calculated distance to the endpoint using the RMP*Comp model is a more realistic 0.2 miles.\n\n\n\n\n\n4. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThere are many safety programs in place at the station to minimize the potential for the accidental releases of ammonia considered by this plan.  For example:\n\n\n\n? A comprehensive OSHA Process Safety Management (PSM) program has been implemented for all anhydrous ammonia process equipment.  This includes daily visual inspections, periodic mechanical integrity checks, and operator training.\n\n\n\n? The registration, installation, and maintenance of the anhydrous ammonia pressure vessel in accordance with regulatory requirements and industry standards.\n\n\n\n? The development of off-loading procedures for the receipt of anhydrous ammonia. The procedures require: \n\n1)    each shipment be physically monitored by an employee fully trained in process safety\n\n2)    the utilization of an off-loading checklist prior to and during each shipment received\n\n3)    requirement that all shipments of ammonia are received during weekdays and daylight hours.\n\n\n\n? The use of administrative controls to ensure that the anhydrous ammonia tank is not filled above the 85% level.\n\n\n\n? The routine inspection and testing of the anhydrous ammonia system and components to ensure system integrity and performance\n\n\n\n? The placement of the tank in an area between"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043576,
      "SummaryText": " several structures, which provide a wind block to increase plume dispersion in the event of a release.\n\n\n\n? A comprehensive training program for all plant personnel with regards to Process Safety Management and the hazards associated with the use, storage and release of anhydrous ammonia.\n\n\n\n\n\n5. FIVE-YEAR ACCIDENT HISTORY \n\n\n\nThis facility has not experienced any accidents as defined in 40 CFR Part 68 during the past five years.\n\n\n\n\n\n6. THE EMERGENCY RESPONSE PROGRAM \n\n\n\nIn the unlikely event that an accidental release of ammonia would occur, the station has prepared a detailed written emergency response plan. A portion of this emergency response plan in specifically dedicated to a release of anhydrous ammonia. This plan has been in place for many years, and release related drills and review of scenarios are routinely conducted to ensure proper response plans are in place.\n\n\n\n\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nAll of the safety programs, including the facility emergency response program, are reviewed periodically for improvement opportunities."
    }
  ]
}