{
  "FacilityID": 1000033079,
  "FacilityName": "The Procter & Gamble Manufacturing Company",
  "FacilityStr1": "1900 Kansas Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "KS",
  "FacilityZipCode": "66105",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20209",
  "LEPC": "Wyandotte County LEPC",
  "FacilityLatDecDegs": "39.089722",
  "FacilityLongDecDegs": "-094.653889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.pg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7130032,
  "ParentCompanyName": "The Procter & Gamble Company",
  "Company2Name": null,
  "CompanyDUNS": 4238200,
  "Company2DUNS": null,
  "OperatorName": "The Procter & Gamble Manufacturing",
  "OperatorStr1": "1900 Kansas Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66105",
  "OperatorZipCodeExt": null,
  "FTE": 307,
  "OtherEPAFacilityID": "KSD007130032",
  "EPAFacilityID": "100000148841",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-01-10 00:00:00",
  "SafetyInspectionBy": "Kansas Department of Health & Environment",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-06-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-06-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2020-01-16 00:00:00",
  "AnniversaryDate": "2018-06-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.089722,
  "FRS_Long": -94.653889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040371,
      "AltID": "3",
      "FacilityID": 1000033079,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048514,
          "ProcessID": 1000040371,
          "ChemicalID": 21,
          "Quantity": 210000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000040772,
          "ProcessID": 1000040371,
          "NAICSCode": "325613",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000035259,
              "Process_NAICS_ID": 1000040772,
              "SafetyReviewDate": "2011-02-22 00:00:00",
              "PHA_Date": "2011-03-24 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-03-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "camera survellience",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Procedural updates",
              "OpProceduresReviewDate": "2013-02-19 00:00:00",
              "TrainingReviewDate": "2011-03-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Review & Acknowledgement of understanding with signature page",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-03-28 00:00:00",
              "EquipmentInspectionDate": "2011-03-27 00:00:00",
              "EquipmentTested": "grounding system & isolation valve",
              "ChangeMgmtDate": "2012-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2011-03-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2012-11-16 00:00:00",
              "AuditCompletionDate": "2013-11-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-03-28 00:00:00",
              "HotWorkPermitReviewDate": "2010-06-14 00:00:00",
              "ContractorSafetyReviewDate": "2013-04-30 00:00:00",
              "ContractorSafetyEvalDate": "2012-05-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000041643,
                  "PreventionProgram3ID": 1000035259,
                  "ProcessChemicalID": 1000048514
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033079,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-11-16 00:00:00",
    "ERTrainingDate": "2013-04-15 00:00:00",
    "CoordinatingAgencyName": "Kansas City, Kansas Fire Department",
    "CoordinatingAgencyPhone": "9135735550",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033079,
      "SummaryText": "Executive Summary\r\nKansas City Soap Plant\r\n\r\nWhat We Do\r\nThe Kansas City Soap Plant of the Procter & Gamble Manufacturing Company (P&G) manufactures liquid dish detergents and raw materials for use in our own products and for sale to other companies.  These include Dawn, Ivory, Joy and Gain which might be found in a home kitchen.  The Kansas City Kansas P&G plant has been in continuous operation since 1905, and it is the first P&G plant opened outside of Cincinnati, Ohio, our corporate headquarters.\r\nIn Kansas City and elsewhere, P&G has a long-standing commitment to a safe work environment for employees and minimizing the impact of our operations on the environment.  Our safety and environmental programs are managed by highly skilled employees, and actively supported by the participation of all employees and all management, and a strong corporate staff.  The goal of both the safety and environmental programs is prevention.  Procter & Gamble believes in a zero defect work environment where issues are identified and fixed as a part of daily work.  This zero defect mentality leads to continuously improving operations and zero incidents that could harm people or the environment.  Although P&G's safety record is already among the best in the business, we are constantly striving for improvement.\r\nThe Kansas City plant has an excellent history of safe operations.  Incident and Near Miss reporting is encouraged and rewarded.  Any incidents or near misses on site are followed by a thorough incident investigation and follow-up action steps are taken to prevent recurrence.  Routine inspection, as well as detailed analysis using non-destructive test equipment such as boriscopes, ultrasonic thickness instruments, dye penetration tests, etc.,  are routinely used to ensure the equipment is at optimal condition at all times.\r\n\r\nChemicals Used in Kansas City Subject to EPA Report\r\nThe P&G Kansas City Soap Plant uses one chemical that is subject to reporting under this filing to the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033079,
      "SummaryText": "U.S. Environmental Protection Agency (EPA).  It is a necessary material used to manufacture soaps and detergents.\r\nEpichlorohydrin is delivered to our plant in dedicated rail cars and is unloaded into two tanks.  Dikes surround the unloading and tank storage areas, and both locations are grounded.  Neither tank is allowed to be more than half full, which allows the transfer of the contents from one to the other during maintenance or an emergency.  Each tank is inspected externally every year and the integrity of the metal walls is routinely examined.  Both the storage and unloading areas are protected by a foaming deluge system that employees can activate remotely.  Fire fighting monitor nozzles are located around the tanks, as are remote video cameras.  Epichlorohydrin is completely consumed in the manufacturing of detergent.\r\nAccident History\r\nIn the past 5 years there have been no incidents involving RMP regulated chemicals.\r\n\r\nHow We Prevent Releases\r\nThe worst case scenarios studied for the off-site consequence analysis required by this risk management program are unlikely to happen because they assume there will be no effective safety systems or emergency response.\r\nProcter & Gamble has conducted a detailed hazard study of the one RMP chemical.  Company engineers and operators identified potential points from which a chemical may be spilled or leaked during the process.  We have used that analysis to design better systems, train operators and maintenance employees and to develop accident prevention and response systems.\r\nAs described above, Epichlorohydrin is contained within a tank and piping system appropriate for that service.  Well trained operators monitor the conditions 24 hours per day, 7 days per week via inspection rounds, video cameras, temperature and pressure gauges, and other instruments.  Volumes in the tanks are also monitored.  Tanks are not refilled unless the arriving truck or rail car can be emptied completely.  This helps prevent overflows"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033079,
      "SummaryText": "and spills.  Control systems of the hazardous processes are monitored and controlled by safety instrumented systems designed to initiate a controlled shut-down if operating parameters go beyond predetermined safe operating ranges.\r\nAs called for in the Occupational Safety and Health Administration (OSHA) Process Safety Management System, plant operating systems are repeatedly assessed and improved.  Process technicians, engineers and the site safety/environmental teams work together to bring about these improvements.  Some products of this improvement process are the mist vacuum neutralization system and triple redundant safety instrumented system controls.\r\nIn the event of an incident, the Kansas City plant has systems to respond quickly.  Processes can be shut down on an emergency basis.  Spills or leaks can be noted immediately and reported to control room operators.  The plant has a direct line to the Kansas City, Kansas Fire Department for quick reporting of releases.  The fire and police departments have developed procedures to communicate instructions to the public in the event that action is needed.  These communications can be carried out either by radio or TV broadcast or through direct communications in the streets.\r\nThe plant now has a fully functional trained Hazwoper Team that drills regularly.  Additionally, the site conducts regular Community Awareness Emergency Response drills.  Local agencies and response organizations are invited to participate.  Real scenarios are simulated and then reviewed and evaluated by everyone in an effort to improve our response systems and hone the skills of the responders.  This gives the non-P&G emergency responders opportunity to tour the site and improves their relationship and communication with P&G.  All P&G employees who work in the vicinity of this chemical, Epichlorohydrin, have been thoroughly trained in company standard operating procedures for both routine and non-routine operations.  These workers participa"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033079,
      "SummaryText": "te in the drills with local emergency preparedness officials as well as conducting table-top exercises within their operating teams.\r\n\r\nPlanned Changes to Improve Safety\r\nThe Kansas City Soap Plant is committed to improving our safety systems.  In an effort to continually improve our systems, Procter & Gamble has an internal process for reviewing all of our safety systems.  This process is called a Key Element Assessment (KEA).  The Kansas City Soap Plant conducted the last KEA in November 2012 and is scheduled for its next KEA in November 2013.  Additionally, all process changes regarding Epichlorohydrin are reviewed by the site change management team prior to making any change.  This provides expert review from each critical discipline, ie.  personnel safety, environmental, process safety, etc...\r\n\r\nCompany and Employee Commitment\r\nThe Kansas City Soap Plant has an outstanding safety and environmental record.  That is a product of the commitment of the company and all employees.  Employees participate in safety and environmental teams that have been responsible for an improved workplace.  The plant works actively with Kansas City, Kansas/Wyandotte County Emergency Management and the Kansas City, Kansas, Fire Department/Hazmat Team.  P&G has donated fire-fighting equipment to these organizations and has sponsored their attendance at training.\r\nThe Kansas City Soap Plant has received recognition for its safety and environmental accomplishments\r\n.............................\r\nConclusion\r\nP&G has been a part of this community for over 100 years, and takes very seriously its responsibility to manage its Kansas City Soap Plant in a way that protects its employees and surrounding neighbors.  We have completed this report to provide the public with information about our activities at this plant.  We believe that, given our safety record, the many controls instituted to maintain a safe operation, and our commitment to continuous improvement that an incident affecting our e"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033079,
      "SummaryText": "mployees or the surrounding area is unlikely to occur."
    }
  ]
}