{
  "FacilityID": 1000008725,
  "FacilityName": "Landsburg Water Treatment Plant",
  "FacilityStr1": "28700 SE 252 Place",
  "FacilityStr2": null,
  "FacilityCity": "Maple Valley",
  "FacilityState": "WA",
  "FacilityZipCode": "98038",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.223330",
  "FacilityLongDecDegs": "-121.574690",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.seattle.gov/util/services",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 117353730,
  "ParentCompanyName": "Seattle Public Utilities",
  "Company2Name": "City of Seattle",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Seattle Public Utilities",
  "OperatorStr1": "Water Quality Laboratory",
  "OperatorStr2": "800 S. Stacy",
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98134",
  "OperatorZipCodeExt": null,
  "RMPContact": "Alex Chen",
  "RMPTitle": "Senior Water Quality Engineer",
  "FTE": 5,
  "OtherEPAFacilityID": "CRK0000025290",
  "EPAFacilityID": "100000014824",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-08-23 00:00:00",
  "DeRegistrationEffectiveDate": "2015-05-31 00:00:00",
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 47.37592,
  "FRS_Long": -121.96303,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010092,
      "AltID": "Water Treatment",
      "FacilityID": 1000008725,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010431,
          "ProcessID": 1000010092,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011475,
          "ProcessID": 1000010092,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511475,
          "ProcessID": 1000010092,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008725,
      "SummaryText": "     Seattle Public Utilities (SPU) provides retail potable water services to its direct service area within the City of Seattle, and also provides wholesale water service to 26 other water purveyors throughout King County.  SPU owns three primary water treatment plants.  Two are operated by private contractors.  The Tolt Treatment Facility is operated by American Water CDM, and the Cedar Treatment Facility is operated by CH2M HILL OMI.  The Landsburg Water Treatment Plant is operated by SPU.  All three plants use chlorine gas for water disinfection in excess of the RMP threshold and are subject to the Risk Management Program Rule.  The Tolt and Cedar Treatment Faciilty contractors are responsible for preparing their own RMP Reports.\n     The Landsburg Water Treatment Plant is located on the Cedar River south of Issaquah, WA.  It is located within the Cedar River Watershed, which is closed and inaccessible to the public.  There is a county day-use park and recreational trail approximately 1/2 mile downriver of the plant.  Landsburg stores up to 20 tons of chlorine gas in one-ton cylinders.  Cylinders not connected to the process line are stored in a covered outdoor storage bay.  The treatment process area is in an enclosed building, but there is no scrubber system present nor was the building designed for gas containment.  The treatment building is equipped with gas detectors.  The plant is staffed 24 hours a day, 7 days a week, by a Water Treatment Operator.  During normal business hours there may be other SPU employees, contractors, and/or consultants engaged in work in the watershed or on the adjacent diversion dam and fish passage facilities.  They do not enter the plant or the chlorine process area without direct supervision.\n     SPU is committed to protecting its employees, the public, and the environment and to preventing injury or death that could result from chlorine gas releases.  SPU has a variety of safety and emergency respone policies in place that gu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008725,
      "SummaryText": "ide employees in general workplace safety, storage and handling of chlorine gas, fire prevention and suppression, and emergency response actions.\n     The worst-case release scenario, as specified by EPA, would involve the release of the entire contents of a one-ton cylinder in a 10 minute period.  Based on modeling with EPA's RMP COMP model, this release could impact an area within a radius of 1.3 miles of the plant.  The worse-case scenario is highly unlikely since the cylinder would have to be split open in order for the entire contents of a one-ton cylinder to be released in 10 minutes.  Given the extreme strength and industry-wide safety record of this technology, only the most direct and severe trauma would be capable of creating such conditions.  The LANDVIEW software package estimated a population of approximately 3,900 within the area of concern for the worst-case scenario.\n     The alternative-case release scenario involves the potential rupture of a 5/16\" valve or transfer line during a cylinder maintenance or replacement operation.  This scenario estimates the impacts of the release of approximately 320 pounds of chlorine over a 60 minute period.  When modeled with RMP COMP, this could impact an area within a 0.1 mile radius of the plant.  The area of concern would be entirely within SPU's watershed property.  However, given the proximity of the county park, this scenario would still require close attention to the possibility of recreationalists nearby.\n     There have been no reportable releases within the last five years from this plant.  SPU has an excellent safety record in its handling of chlorine gas.  SPU has had a corporate chlorine safety program in place for many years.  In addition to its corporate safety program, SPU maintains open relations and communications with the local fire departments responsible for serving this facility, including meetings, site visits, and joint exercises.  SPU complies with OSHA's Process Safety Management standard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008725,
      "SummaryText": ".  SPU also conducts ongoing training of its Water Treatment Operators in all aspects of safe plant operations, including emergency response measures.  The Operators perform daily safety inspections of chlorine equipment at every shift change."
    }
  ]
}