{
  "FacilityID": 1000031459,
  "FacilityName": "Chevron Phillips Chemical Company LP - Bartlesvill",
  "FacilityStr1": "Hwy 60 and Hwy 123",
  "FacilityStr2": null,
  "FacilityCity": "Bartlesville",
  "FacilityState": "OK",
  "FacilityZipCode": "74006",
  "Facility4DigitZipExt": "6670",
  "FacilityCountyFIPS": "40113",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "36.745033",
  "FacilityLongDecDegs": "-96.004662",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.cpchem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Chevron Phillips Chemical Company LP",
  "Company2Name": null,
  "CompanyDUNS": 152975665,
  "Company2DUNS": null,
  "OperatorName": "Chevron Phillips Chemical Co. LP",
  "OperatorStr1": "202-B ARB",
  "OperatorStr2": "HWY. 60",
  "OperatorCity": "BARTLESVILLE",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74003",
  "OperatorZipCodeExt": "6670",
  "FTE": 210,
  "OtherEPAFacilityID": "74004CHVRNHWY60",
  "EPAFacilityID": "100000219042",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-09-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-09-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-31 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-10-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-10-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 36.745033,
  "FRS_Long": -96.004662,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000038447,
      "AltID": "Polyethylene Pilot Plant",
      "FacilityID": 1000031459,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000046192,
          "ProcessID": 1000038447,
          "ChemicalID": 95,
          "Quantity": 56000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000038810,
          "ProcessID": 1000038447,
          "NAICSCode": "54171",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000033540,
              "Process_NAICS_ID": 1000038810,
              "SafetyReviewDate": "2012-09-06 00:00:00",
              "PHA_Date": "2013-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "LOPA",
              "PHACompletionDate": "2011-10-25 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-09-10 00:00:00",
              "TrainingReviewDate": "2011-07-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-03-01 00:00:00",
              "EquipmentInspectionDate": "2012-08-13 00:00:00",
              "EquipmentTested": "SG20014 - Catalyst mud pots",
              "ChangeMgmtDate": "2012-09-10 00:00:00",
              "ChangeMgmtReviewDate": "2010-06-01 00:00:00",
              "PreStartupReviewDate": "2012-09-10 00:00:00",
              "ComplianceAuditDate": "2012-07-25 00:00:00",
              "AuditCompletionDate": "2012-07-25 00:00:00",
              "IncidentInvestigationDate": "2012-08-01 00:00:00",
              "InvestigationChangeDate": "2012-08-27 00:00:00",
              "ParticipationPlansReviewDate": "2011-06-13 00:00:00",
              "HotWorkPermitReviewDate": "2012-06-18 00:00:00",
              "ContractorSafetyReviewDate": "2012-07-30 00:00:00",
              "ContractorSafetyEvalDate": "2012-04-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000039685,
                  "PreventionProgram3ID": 1000033540,
                  "ProcessChemicalID": 1000046192
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000031459,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-06-28 00:00:00",
    "ERTrainingDate": "2012-04-19 00:00:00",
    "CoordinatingAgencyName": "Washington County LEPC",
    "CoordinatingAgencyPhone": "9183312710",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000031459,
      "SummaryText": "ce experience as well as engineering expertise. The team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures when the team believes such measures are necessary. The team employs a Layer of Protection Analysis (LOPA) approach to assist with this task. \r\n \r\nThe PHA Team findings are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA Team (using LOPA). This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options being implemented in response to PHA Team findings are tracked until they are complete. The final resolution of each finding is documented and retained. \r\n \r\nTo confirm that process controls and/or process hazards do not deviate significantly from the original design Features, Bartlesville periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained. \r\n \r\nOperating Procedures\r\nBRTC  maintains written procedures that address various modes of process operations, such as: (1) Unit startup, (2) Normal operations, (3) Temporary operations, (4) Emergency shutdown, (5) Normal shutdown, (6) Emergency operation, and (7) Initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are frequently reviewed and annually certified as current and accurate. The procedures are maintained current and accurate by revising them as necessary t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000031459,
      "SummaryText": "TC maintains a written Emergency Response Program which is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including the following: proper first-aid and medical treatment for exposures; evacuation plans and accounting for personnel after an evacuation; notification of local emergency response agencies and the public if a release occurs; and post-incident cleanup and decontamination requirements. In addition, Bartlesville has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The Emergency Response Program is updated when necessary based on modifications made to plant processes or other plant facilities. \r\n \r\nThe overall Emergency Response Program for BRTC is coordinated with the Washington County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which includes: local emergency response officials, local government officials, and industry representatives. BRTC has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition to periodic LEPC meetings, Bartlesville Complex conducts periodic emergency drills that involve the LEPC and emergency response organizations. In addition to the LEPC, the Bartlesville also has a Mutual Aid System in place.  This system provides Mutual Aid from other industry member"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000031459,
      "SummaryText": "in various processes: \r\n \r\nRelease Detection: - Gas Detectors (Hydrocarbon) with Alarms \r\n \r\nRelease Containment/Control: -  Process Relief Valves that discharge to a flare to capture and incinerate episodic releases -  Valves to permit isolation of the process (manual or automated) -  Automated Shutdown Systems for specific process parameters (e.g., High level, high temperature, release detection) -  Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system, backup firewater pump) -  Atmospheric Relief Devices -   Relief Valve Maintenance Procedures \r\n \r\nRelease Mitigation: -  Fire Suppression and Extinguishing Systems -  Deluge System for specific equipment -  Trained Emergency Response Personnel -  Personal Protective Equipment (e.g., protective clothing, self-contained breathing apparatus) -   Water curtains for specific equipment -  Siting and Spacing Initiative -  Emergency Isolation Valves -  Emergency Activation System -  Risk Based Inspection \r\n \r\nFIVE-YEAR ACCIDENT HISTORY\r\nDuring the past five years, there have been no releases of a regulated substance that required listing under the five-year accident history. \r\n \r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\nSee the Emergency Planning and Response section above. \r\n \r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nBRTC resolves all action items and findings from PHAs, Incident Investigations, Internal and External Audits, etc. some of which result in modifications to the process. These action items or findings are assigned to specific individuals and tracked to completion through an online database system.  Any changes or modifications to the process are routed through a Management of Change System and documented.\r\n\r\nPERMITS, EXEMPTIONS AND GENERAL INFORMATION \r\n \r\nRCRA Permit\r\nDEQ Air Quality Permit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000031459,
      "SummaryText": "o reflect changes made through the Management of Change process. \r\n \r\nIn addition, BRTC maintains a Process Safety Information document that provides guidance on how to respond to upper or lower limit exceedances for specific process or equipment parameters. This information, along with written operating procedures, is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks. \r\n \r\nTraining\r\nTo complement the written procedures for process operations, BRTC has implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in plant operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process specific duties and tasks. After operators demonstrate (e.g., through tests, skills demonstration) that they have adequate knowledge to perform the duties and tasks in a safe manner, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to confirm their skills and knowledge are maintained at an acceptable level. All of this training is documented for each operator, including the means used to verify that the operator understood the training. \r\n \r\nContractors\r\nBRTC uses contractors as part of its regular work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the plant has procedures in place to verify that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, (6) inform plant personnel of any hazards that they find during their work. This is accomplished by providing contractor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000031459,
      "SummaryText": "s with (1) a Process Overview, (2) information about safety and health hazards, (3) Emergency Response Plan requirements, and (4) safe work practices prior to their beginning work. In addition, Bartlesville evaluates contractor safety programs and performance during the selection of the contractor. Plant personnel periodically monitor contractor performance to help ensure that contractors are fulfilling their safety obligations. Contractors also regularly participate in facility emergency drills. \r\n \r\nPre-Startup Safety Reviews (PSSR's)\r\nBRTC conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to confirm that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make certain construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that Accidental Release Prevention Program requirements are properly implemented. \r\n \r\nMechanical Integrity\r\nBRTC has well established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process equipment. \r\n \r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards,"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000031459,
      "SummaryText": "s at the site. In addition, the Bartlesville Fire Departments and Bartlesville Emergency Medical Service would provide assistance in the event of an emergency at the BRTC.\r\n\r\nCompliance Audits\r\nAudits to review compliance with each PSM element and RMP are conducted at least once every three years.  The focus of these audits is to ensure the adequacy of procedures and practices developed to comply with OSHA PSM and EPA RMP prevention program regulatory requirements and to verify that these procedures and practices are being followed.  The two most recent audits are kept on file. \r\n \r\nTrade Secrets\r\nThe Trade Secrets Plan at BRTC provides a structure for employees and contractors to have access to information necessary to comply with PSM.  Employees and contractors use information to update Process Safety Information, participate in Process Hazards Analysis, participate in Management of Change / Pre-Startup Safety Reviews, write/review/update Operating Procedures, and other PSM related activities. This information must be made available to employees and contractors when necessary. \r\n \r\nRISK MANAGEMENT PROGRAM\r\nIn addition to the OSHA PSM and similar EPA RMP prevention program elements described above, the BRTC  Risk Management program includes the following: \r\n \r\nCHEMICAL SPECIFIC PREVENTION STEPS\r\nThe process at BRTC has hazards that must be managed to help ensure continued safe operation. The Accidental Release Prevention Program summarized previously is applicable to all EPA RMP covered processes at the facility. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by (1) equipment failures and (2) human errors. \r\n \r\nIn addition to the Accidental Release Prevention Program activities, Bartlesville has safety features on many processes to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000031459,
      "SummaryText": "and others, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely. \r\n \r\nManagement of Change\r\nBRTC has a comprehensive system to manage change. This system requires that change to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes to be properly reviewed and authorized before being implemented. Changes are reviewed to (1) verify adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change. \r\n \r\nIncident Investigation\r\nBRTC promptly investigates all incidents that result in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the causal factors and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to plant management and respective teams for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until these actions have been resolved. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by these findings. Incident investigation reports are retained for at least 5 years in order for these reports to be available for review during future PHA's and PHA revalidations. \r\n \r\nEmergency Planning and Response\r\nBR"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000031459,
      "SummaryText": "(3) applicable maintenance procedures, (4) Emergency Response Plans, and (5) applicable safe work practices to help ensure they can perform their job in a safe manner. Written procedures confirm work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to verify equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or an MOC Team will review the use of the equipment and determine what actions are necessary to verify the safe operation of the equipment. \r\n \r\nAnother integral part of the Mechanical Integrity Program is quality assurance. BRTC  incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made. \r\n \r\nThe objective of the Mechanical Integrity Program is to eliminate equipment failures through predictive and preventive maintenance. As this process continues to mature, continuous and substantial improvement in operating reliability and safety is anticipated. \r\n \r\nSafe Work Practices\r\nBRTC has long-standing safe work practices in place to help ensure personal and process safety. Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a Lockout/Tagout Procedure to verify isolation of energy sources for equipment undergoing maintenance, (3) procedures for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), (5) a permit and procedure to confirm adequate precautions are in place before entry into a confined space, and (6) a Safety and Emergency Systems Bypass Permit procedure. These procedures"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000031459,
      "SummaryText": "Executive Summary (2012) \r\nChevron Phillips Chemical Company LP - Bartlesville Research and Technology Center (BRTC)\r\nRisk Management Plan Executive Summary\r\n \r\nAccidental Release Prevention and Response Policies\r\nBRTC has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training and consideration of safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement controls to prevent foreseeable releases of hazardous chemicals. However, if a release does occur, our trained personnel will respond to control and contain the release. \r\n \r\nDescription of the Stationary Source and Regulated Substances\r\nBRTC consists of one pilot plant. The complex, near Bartlesville, Oklahoma, is at the intersection of US Highway 60 and State Highway 123, about 40 miles north of downtown Tulsa.  In our process, we use the following chemicals the EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release: \r\n \r\nToxics: None \r\n \r\nFlammables: Ethylene, with smaller quantities of other covered flammable materials in mixtures.\r\n \r\nNote: No significant consequences reach US Highway 60 on the north or State Highway 123 on the east of the complex.\r\n \r\nGeneral Accidental Release Prevention Program Steps\r\nThe following is a summary of the General Accidental Release Prevention Program in place at the BRTC. Because processes at the plant regulated by the EPA RMP regulation are also subject to the OSHA Process Safety Management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the Accidental Release Prevention Program. \r\n \r\nEmployee Participation\r\nThe fundamental idea of employee participation is that all employees and contractors at all levels of an organization should have the opportunity to participate in PSM-r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000031459,
      "SummaryText": "elated activities and provide input as deemed appropriate.  The Employee Participation Plan at BRTC provides a structure for employees and contractors to review, participate in, and get training on process safety practices and procedures.  Employees and contractors periodically participate in Job Safety Analyses, emergency drills, Incident Investigations, MOCs, PHAs, PSSRs, audits and other process safety-related activities.  These provide an opportunity for employees and contractors to raise questions and provide input about the practice and methods used to comply with the PSM Standard. \r\n \r\nProcess Safety Information\r\nProcess Safety Information (PSI) is divided into three main categories, which include:  information pertaining to the hazards associated with the highly hazardous chemicals, the technology of the process, and the equipment in the process.  The Process Safety Information Plan at BRTC provides a guideline of the process safety information available to employees and contractors and how it is maintained.  Process Safety Information is developed, compiled and updated by employees and contractors.  PSI should be accessible to employees and their representatives and all personnel responsible for compiling process safety information; assisting in the development of PHAs; or involved in incident investigations, emergency planning and response, or compliance audits. \r\n \r\nProcess Hazard Analysis\r\nBRTC has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, the process is systematically examined to identify hazards and verify that adequate controls are in place to manage these hazards. \r\n \r\nBRTC primarily uses the Hazard and Operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques. The analyses are conducted using a team of people who have operating and maintenan"
    }
  ]
}