{
  "FacilityID": 1000018076,
  "FacilityName": "Pine Manor, Inc. DBA Miller Poultry",
  "FacilityStr1": "9622 West CR 350 North",
  "FacilityStr2": null,
  "FacilityCity": "Orland",
  "FacilityState": "IN",
  "FacilityZipCode": "46776",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18151",
  "LEPC": "Steuben County LEPC",
  "FacilityLatDecDegs": "41.694897",
  "FacilityLongDecDegs": "-085.175598",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 792759003,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Pine Manor, Inc. DBA Miller Poultry",
  "OperatorStr1": "P.O. Box 239",
  "OperatorStr2": null,
  "OperatorCity": "Orland",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46776",
  "OperatorZipCodeExt": null,
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200141",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-05 00:00:00",
  "SafetyInspectionBy": "IOSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-11-08 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-11-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-11-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.693527,
  "FRS_Long": -85.172524,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000022144,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000018076,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000026168,
          "ProcessID": 1000022144,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000022446,
          "ProcessID": 1000022144,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000018696,
              "Process_NAICS_ID": 1000022446,
              "SafetyReviewDate": "2012-09-17 00:00:00",
              "PHA_Date": "2012-08-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-09-24 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Safety Relief Systems",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "20 Minor deficiencies were identified and are being followed to a conclusion",
              "OpProceduresReviewDate": "2012-05-02 00:00:00",
              "TrainingReviewDate": "2010-09-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-10-25 00:00:00",
              "EquipmentInspectionDate": "2012-09-17 00:00:00",
              "EquipmentTested": "Annual Ammonia Inspection",
              "ChangeMgmtDate": "2012-08-29 00:00:00",
              "ChangeMgmtReviewDate": "2012-08-29 00:00:00",
              "PreStartupReviewDate": "2012-08-02 00:00:00",
              "ComplianceAuditDate": "2012-09-21 00:00:00",
              "AuditCompletionDate": "2013-09-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-09-24 00:00:00",
              "HotWorkPermitReviewDate": "2012-09-17 00:00:00",
              "ContractorSafetyReviewDate": "2010-10-20 00:00:00",
              "ContractorSafetyEvalDate": "2010-11-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000022120,
                  "PreventionProgram3ID": 1000018696,
                  "ProcessChemicalID": 1000026168
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000018076,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-07-01 00:00:00",
    "ERTrainingDate": "2012-01-11 00:00:00",
    "CoordinatingAgencyName": "Orland Fire Department",
    "CoordinatingAgencyPhone": "2608296494",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018076,
      "SummaryText": "al inspections,  which may occur at this plant.\r\nSet-up an adequate chain of command during an emergency. \r\nMinimize the impact of an emergency on employee health and safety.\r\nMinimize the impact of an emergency on our neighbors and the environment.\r\nFollow-up emergency procedures.\r\n\r\nMany more specific programs and policies (Hot Work, Confined Space, Lockout / Tagout, Employee training, etc..) have been developed. For information specific to these see the Safety Manager.\r\n\r\nVOLUME II incorporates information on the specific system components of the production area equipment. This information is used as a reference source for the operator to positively identify system components. This manual also provides a checklist for performing the yearly Mechanical Integrity Inspection.\r\n\r\nVOLUME III incorporates a complete valve list, process and instrumentation diagrams, flow schematics, and other drawings pertinent to the refrigeration equipment. The valve list contains information on the type, port , identifying number, use, location, model, manufacturer, drawing reference, and normal operating position of each valve in the system. Process and Instrumentation Diagrams are included for the individual refrigeration system components. Flow schematics are included showing the entire refrigeration system. A Block flow diagram provides a brief overview of the system. Drawings are included showing symbol and abbreviation descriptions. Plan views are included to allow the operator to physically locate refrigeration equipment in the building.\r\n\r\nVOLUME IV incorporates a complete set of standard operating procedures for the production area equipment. Describing the proper steps for preparing components for start-up, starting components, monitoring normal operation, shutting down as part of normal operation, restarting equipment as part of normal operation, shutting down equipment for maintenance, restarting equipment after maintenance, shutting down equipment in emergency situations,"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018076,
      "SummaryText": "Pine Manor, Inc., Orland, Indiana is proud to inform all interested parties that our company is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68.  In addition to other state and local codes applicable to our facility and process. We have undertaken this process to deal with the risks involved with the storage, handling, and use of Anhydrous Ammonia in our facility.\r\n\r\nOur goal is to promote overall worker, public, and plant safety.\r\n\r\nPine Manor, Inc., Orland, Indiana. located at 9622 West CR 350 North, Orland, Indiana.  We manufacture some of the finest poultry products in the world.  The facility includes processing tanks, piping, packaging equipment, raw materials warehousing, finished goods refrigerated storage, an Ammonia refrigeration engine room, boilers, and miscellaneous utilities. \r\n\r\nThe refrigeration system required for our production process necessitates the submission of this Risk Management Plan.  The refrigeration system contains approximately 31,000 pounds of anhydrous ammonia.  This surpasses the threshold quantity of 10,000 pounds outlined in Process Safety Management and Risk Management Program regulations.\r\n\r\nPine Manor, Inc. has implemented numerous policies and procedures to enable our facility to prevent the occurrence, and minimize the consequences of significant releases of Anhydrous Ammonia as well as other hazardous substances, fires, explosions, and other types of catastrophic accidents.  Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property damage.\r\n\r\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary. \r\n\r\nPine Manor, Inc. has organized the information and polices pertaining to the process into a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018076,
      "SummaryText": "complete library consisting of five numbered volumes, as well as reference materials. Volume numbers are assigned to sets of reference manuals, such as the Operation and Maintenance manuals. The library also incorporates the use of video tapes and computerized tests.\r\n\r\nVOLUME I of the PSM/RMP Library incorporates mainly policies, the following policies are included in Volume I:\r\n\r\nEmployee Participation Guidelines: This policy outlines the commitment between management and employees to establish a program for a successful (safe) program.\r\n\r\nProcess Safety Information: This includes information on the ammonia inventory at the facility, applicable codes, design standards, and information pertaining to the hazards of ammonia (referenced from the IIAR ammonia Data Book).\r\n\r\nProcess Hazard Analysis Program: This program outlines a thorough, orderly, systematic approach for identifying, evaluating, and controlling potential hazards within a process involving potentially hazardous chemicals such as ammonia.\r\n\r\nContractor Qualification Guidelines: This guideline has been established to verify that the contractors working in the facility are qualified to work on the system, trained in the hazards associated with their work, and made aware of the hazards presented by the facility to the employees of the contractor.\r\n\r\nManagement of Change and Pre-Startup Safety Review Programs: These programs have been developed to monitor and provide a checks and balances system to monitor changes in the facility and to verify that changes are safe and consistent with company policy.\r\n\r\nThe Emergency Planning and Response: Is essential to the safety of our employees. The purpose of Emergency Planning and Response is to:\r\n\r\nPrepare for emergencies. including, but not limited to: Fire, Release of hazardous chemicals including ammonia, Bomb Threat, Inclement weather, Civil Disorder, Hostile labor, Flood, Loss of water, Loss of electricity, Terrorist activities, Disruptions due to government"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000018076,
      "SummaryText": "procedures, and facility. It is the intention of Pine Manor, Inc. to remain an industry leader. New technology, training techniques, and equipment are continuously being added to our system."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018076,
      "SummaryText": "restarting equipment after an emergency situations shutdown, and pump out procedures. Also included as a part of each Standard Operating Procedure is the Technical Operating Specifications for the associated system components. This information includes consequences of deviation from standard operating procedures.\r\n\r\nVOULME V contains Operation and Maintenance Information for the refrigeration equipment including manufactures information, spare parts list, maintenance procedures, and preventative maintenance procedures.\r\n\r\nProcess Hazard Analysis was performed in August 2012.  The PHA was completed for the 5 Year Revalidation Rule. The PHA highlighted some deficiencies in the system. These items were addressed as part of the continuous improvement of the facility. These items were addressed on the basis of priority (Injuries to personnel) and any potential offsite impacts.\r\n\r\nPine Manor, Inc. also incorporates additional safety items such as tagging of all ammonia system valves and components. \r\n\r\nDESCRIPTION OF THE REFRIGERATION SYSTEM\r\n\r\nPine Manor, Inc., Orland, Indiana. is a poultry based processing and distribution facility. The facility incorporates a standard evaporation and compression closed loop ammonia refrigeration system. The system is installed to operate as a two-temperature single stage system. The compressors are split as High Stage and Low Stage Compressors. There exists, two different levels of saturated suction temperatures. Each level of suction temperature services a specific area of the plant. \r\n\r\n\r\nSUMMARY OF THE FIVE-YEAR ACCIDENT HISTORY\r\n\r\nPine Manor, Inc. has had no incidents in the past five years involving ammonia. ( Note: All ammonia leaks no matter how small are investigated, fixed and documented.)\r\n\r\n\r\nDESCRIPTION OF THE EMERGENCY RESPONSE PLAN\r\n\r\nThe Emergency Planning and Response Procedures incorporate several existing procedures already in use throughout the facility. \r\n\r\n1.0\tEMERGENCY EVACUATION OR SHELTER IN PLACE.\r\n\r\n1.1\tEmerg"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018076,
      "SummaryText": "ency evacuations shall be accomplished through the use of the posted Emergency Evacuation Plans.\r\n\r\n1.2\tSheltering in Place shall be accomplished through the use of the posted Shelter in Place Plans.\r\n\r\n2.0\tACCOUNTING FOR EMPLOYEES IN THE EVENT OF AN EMERGENCY (EVACUATION COORDINATORS).\r\n\r\n2.1\tEmployees, Visitors and Contractors shall be notified by the P.A. System or by management personnel.\r\n\r\n2.2\tSupervisors are responsible for accounting for employees during / after an emergency situation. A complete list of hourly employees currently in the facility is available via a supervisor's employee checklist system. In the event of an emergency (Evacuation / Shelter in Place), supervisors will carry the employee checklist to the roll call assembly area.\r\n\r\n2.3\tThe receptionist will carry the visitor sign-in book and the office in / out boards to the roll call assembly area. Human Resources Personnel will carry the HR / Accounting sign-in book to the role call assembly area.\r\n\r\n2.4\tContractors will be responsible for accounting for contractor employees in case of emergency (all contract employees will also sign-in on the visitors' log.) In those instances where a Job Trailer Sign-in is used the Contractor shall make provisions to bring the sign-in sheets to the roll call area.\r\n\r\n2.5\tTruck drivers are to stay with their trucks. Accounting for the drivers in the Receiving area is the responsibility of Pine Manor Contact. In the event of an emergency (Evacuation / Shelter in Place, Pine Manor contact will instruct / escort the drivers. In an evacuation in most cases the drivers will evacuate the premises.\r\n\r\n2.6 \tA roll call will be conducted and the results communicated to the Incident Commander or alternate.\r\n\r\n3.0\tEMERGENCY ACTIVITIES AND FOLLOW-UP.\r\n\r\n3.1\tOnce an emergency evacuation has been called the Incident Commander shall be responsible for the coordination of activities.\r\n\r\n\r\nCONCLUSION:\r\n\r\nPine Manor, Inc. is committed to continuous improvement of our policies,"
    }
  ]
}