{
  "FacilityID": 1000063016,
  "FacilityName": "Braskem Oyster Creek Plant",
  "FacilityStr1": "Gate9, BLDG OC-450, 5005 E Hwy. 332",
  "FacilityStr2": null,
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "28.982500",
  "FacilityLongDecDegs": "-095.356415",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Braskem America, INC.",
  "Company2Name": null,
  "CompanyDUNS": 161669049,
  "Company2DUNS": 0,
  "OperatorName": "Braskem America, Inc.",
  "OperatorStr1": "Gate9, BLDG OC-450, 5005 E Hwy. 332",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Loris Canahuati",
  "RMPTitle": "Site Leader, Braskem Oyster Creek",
  "FTE": 59,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217151",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O2313",
  "SafetyInspectionDate": "2013-12-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-05-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-05-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-05-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-05-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079093,
      "AltID": "Polypropylene Production",
      "FacilityID": 1000063016,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080253,
          "ProcessID": 1000079093,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098519,
          "ProcessID": 1000079093,
          "ChemicalID": 129,
          "Quantity": 260000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598519,
          "ProcessID": 1000079093,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063016,
      "SummaryText": "BRASKEM AMERICA, INC. OYSTER CREEK POLYPROPYLENE PLANT\n\nRISK MANAGEMENT PLANT EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\n\n\nAt the Oyster Creek Plant, we are committed to operating and maintaining all of our processes in a safe and responsible manner. We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment. This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\n* A description of the Oyster Creek Plant and use of substances regulated by EPA's Risk Management Program (RMP) regulation\n\n* An overview of our accidental release prevention programs\n\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n\n* An overview of our emergency response program\n\n* An overview of improvements made at the Oyster Creek Plant to minimize the potential for accidental chemical releases that could adversely affect our employees, the public, and the environment\n\n* Certifications in accordance with RMP rule\n\n* Relevant details about the Oyster Creek Plant's risk management program\n\n\n\nFACILITY DESCRIPTION AND REGULATED SUBSTANCES HANDLED:\n\n\n\nThe Oyster Creek Plant manufactures polypropylene using a variety of chemicals including RMP regulated substances and unit operations. Polypropylene is used in many consumer products and automotive industries. The process utilizes the following relevant feedstocks: propylene, a regulated flammable substance, along with catalysts, hydrogen and ethylene. The process contains the RMP-regulated substance propylene above the threshold quantity in storage vessels and reactors, columns, tanks and piping within the unit. The process utilizes other chemicals in quantities well below the RMP threshold quantity.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION AND"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063016,
      "SummaryText": " CHEMICAL-SPECIFIC PREVENTION STEPS:\n\n\n\nThe centerpiece of the accident release and prevention program at the Oyster Creek Plant is Process Safety Management. This is a fully comprehensive prevention program designed to prevent accidental releases of hazardous chemicals. We take a systematic, proactive approach to preventing accidental releases of hazardous chemicals. Our management systems address each of the key features of successful prevention programs including:\n\n\n\n* Process safety information\n\n* Process hazard analysis\n\n* Operating procedures\n\n* Training\n\n* Mechanical integrity\n\n* Management of change\n\n* Pre-startup safety review\n\n* Compliance audits\n\n* Incident investigation\n\n* Employee participation\n\n* Hot work permit\n\n* Contractors\n\n\n\nWe actively encourage participation by all employees in process safety management. Relevant process safety information is available to employees. Employees participate in PHA revalidation studies and PHA studies triggered through our Management of Change Program. Procedures provide information to employees to assist them in performing their jobs safely and correctly. Employees and contractors are trained and are included in the investigation of incidents and accidents. We engage experienced employees in developing and providing our training programs. We also encourage employee suggestions for improvement.\n\n\n\nAs prescribed by our Management of Change procedure, Pre-Startup Safety Reviews are designed to ensure the safety of process operations following new installations or modifications. Our Mechanical Integrity Program includes written procedures governing the inspection and maintenance of affected process equipment. The Plant also has developed and implements Hot Work Permit procedure to prevent performance of hot work in potentially dangerous areas.\n\n \n\nThrough implementation of these multiple elements of our prevention program, the Plant minimizes accidental chemical releases. In order to enhance and reinforce the Plant and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063016,
      "SummaryText": " employee commitment to the standard underlying these management systems, the Company has established both specific accountability and controls for implementation of these systems in support of the Plant's high standards for accident prevention.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY:\n\n\n\nWe keep records for all significant accidental chemical releases that occur at the Oyster Creek Plant. In the past five years, there have been no releases at the Oyster Creek Plant of any RMP regulated chemicals,  as governed by 40 C.F. R. 68.42(a), or that have had an adverse impact on employees, the community, or the environment. If an incident governed by 40 C.F.R. 68.42(a) were to occur, we would conduct formal incident investigations designed to identify and address the root cause.\n\n\n\nEMERGENCY RESPONSE PROGRAMS:\n\n\n\nThe Plant maintains a written emergency response plan for the site. The plan provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations. \n\n\n\nThe Industrial Park owner, The Dow Chemical Company Texas Operations (\"Dow\"), leads the execution of all of the emergency response activities.  The Plant has ensured that its written emergency plan is integrated with Dow's plan.  All external communications are coordinated in accordance with our written plan; Dow manages alerts to the community through the CAER Hotline. \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\n\n\nBraskem received recognition of the Plant as a VPP STAR site on December 2013. \n\n\n\nBraskem believes in a philosophy of continuous improvement. A number of programs are in place to monitor the status of ongoing efforts and continually seek opportunities to improve. The Oyster Creek Plant maintains a structured safety process and employee safety teams that meet regularly.\n\n\n\nAlthough the Plant has not identified any changes to safety practices necessary to achieve or maintain compliance with any applicable regulatory standard, we have enlisted suggest"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063016,
      "SummaryText": "ions from employees for further enhancements.  As a result of such employee suggestions, the Plant has identified several potential improvements justifying further evaluation.  Therefore, the current plan to further enhance safety practices at the Plant includes evaluation of opportunities to improve employee accessibility to and the ergonomics of exchanger head replacement, add platform access to and provide a second mean of egress from a frequently used area, rehabilitate the potable water storage vessel used for ESEW (Emergency Shower Eye Wash), and improve outside visibility with LED lighting."
    }
  ]
}