{
  "FacilityID": 1000027541,
  "FacilityName": "Helena Chemical Company - Casey, IL",
  "FacilityStr1": "601 West Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Casey",
  "FacilityState": "IL",
  "FacilityZipCode": "62420",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17023",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "39.295538",
  "FacilityLongDecDegs": "-088.002622",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": "Helena Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "601 West Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Casey",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62420",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brad Coffey",
  "RMPTitle": "Reg & Safety Field Specialist",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176276",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-04-04 00:00:00",
  "SafetyInspectionBy": "Illinois Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Casey Fertilizer Company",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-03-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-03-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-03-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.295,
  "FRS_Long": -88.00267,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033609,
      "AltID": "Railcar Storage",
      "FacilityID": 1000027541,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000033851,
          "ProcessID": 1000033609,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040614,
          "ProcessID": 1000033609,
          "ChemicalID": 56,
          "Quantity": 1320829.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540614,
          "ProcessID": 1000033609,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000033610,
      "AltID": "Storage & Handling",
      "FacilityID": 1000027541,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000033852,
          "ProcessID": 1000033610,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040615,
          "ProcessID": 1000033610,
          "ChemicalID": 56,
          "Quantity": 784627.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540615,
          "ProcessID": 1000033610,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027541,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe Helena Chemical Company (Helena) Casey Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards.  However, the OSHA standards at 29 CFR 1910.111, Storage and Handling of Anhydrous Ammonia, are applicable and are included in the Risk Management Program (RMPr) document that is implemented by this Facility.\n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Casey Facility located on the west end of Casey at 601 West Main Street, Casey, IL 62420.  The electronic RMP summarizes the policies and procedures implemented by the Casey Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Casey Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nIn 2012, Helena acquired this Facility and submitted this 5-Year update to reflect the new ownership.  All relevant sections for a Program 2 RMP Facility were reviewed and/or updated.  The updates are reflected in both the EPA RMP Submit report and the Facility Risk Management Plan Program Document (RMPr).\n\n\n\nIn 2015, the Emergency contact and RMP Implementation Manager changed.  In addition to this change, the ammonia emission rate and quantity released for the railcar alternative consequence analysis was corrected to reflect the actual 2012 modeling.  This current update is being submitted to reflect the current contact and the correction to the OCA data for the railcar alternati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027541,
      "SummaryText": "ve case analysis.  \n\n\n\nFACILITY\n\n\n\nThe Casey Facility is a retail agricultural chemical facility and operates two (2) covered processes that include Railcar Storage and Storage and Handling of anhydrous ammonia.  Anhydrous ammonia is transported to the Facility via a commercial tanker truck (9,000 gallon) and then transferred to one of three (3) 30,000-gallon stationary storage tanks.  The commercial tanker truck operator (Vendor/Contractor) performs these transfer operations.  \n\n\n\nHelena stores the anhydrous ammonia in the on-site stationary storage tanks and then transfers the anhydrous ammonia from the storage tank to nurse tanks at point of retail sale to the end user (e.g. the farmer).  This Facility owns and operates (1) 16 1,450-gallon nurse tanks, (2) 36 1,000-gallon nurse tanks, (3) two 1,450-gallon double set nurse tanks, and (4) two 1,000-gallon double set nurse tanks.  Helena performs this operation in accordance with its RMPr accident prevention program.  \n\n\n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative case consequence analyses were completed for two covered processes that are conducted at this Facility.  The two covered processes include anhydrous ammonia Railcar Storage and Storage and Handling.  \n\n\n\nThe worst case scenario release for the Retail Facility was the same for both covered processes and assumed that all the contents in the largest single storage tank were released.  For this Facility, the largest vessel is a 34,000-gallon railcar that is delivered in the winter months.  The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\n\n\nThe alternative (or more likely to occur) scenario was different for each covered process.  The alternative scenario for the Railcar Storage assumes a 60-minute release from a Railcar valve that was not completely closed.  The alternative release for the Storage and Handling assumes a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027541,
      "SummaryText": "3-minute release from a ruptured 3-inch transfer line caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although these events are classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment (excess flow devices, check valves) and operating procedures that Helena uses to safeguard ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Regulatory & Safety Field Specialist implements the risk management planning process at this Facility.  The Regulatory & Safety Field Specialist is assisted by other Helena staff, as directed.  The Regulatory & Safety Field Specialist is responsible for ensuring that Helena Staff are properly trained in the implementation of the Prevention Program which includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigations, and Emergency Contingency Plans.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nHelena's Casey Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Casey Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Casey Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Casey Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Cumberland County LEPC and Casey Fire Department.\n\n\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Casey Facili"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027541,
      "SummaryText": "ty."
    }
  ]
}