{
  "FacilityID": 1000108302,
  "FacilityName": "Midwest Sterilization Corporation - Laredo",
  "FacilityStr1": "12010 General Milton Drive",
  "FacilityStr2": null,
  "FacilityCity": "Laredo",
  "FacilityState": "TX",
  "FacilityZipCode": "78045",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48479",
  "LEPC": "Webb County LEPC",
  "FacilityLatDecDegs": "27.620278",
  "FacilityLongDecDegs": "-099.503056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.midweststerilization.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 94387107,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Karen Eldridge",
  "OperatorStr1": "P.O. Box 411",
  "OperatorStr2": "1204 Lenco Avenue",
  "OperatorCity": "Jackson",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63755",
  "OperatorZipCodeExt": null,
  "FTE": 169,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000196762",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-11-16 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-12-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-12-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-12-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-12-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 27.620278,
  "FRS_Long": -99.503056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000135369,
      "AltID": "Ethylene oxide",
      "FacilityID": 1000108302,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000169751,
          "ProcessID": 1000135369,
          "ChemicalID": 9,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000136842,
          "ProcessID": 1000135369,
          "NAICSCode": "339113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000116698,
              "Process_NAICS_ID": 1000136842,
              "SafetyReviewDate": "2023-06-28 00:00:00",
              "PHA_Date": "2021-05-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-05-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-01-16 00:00:00",
              "TrainingReviewDate": "2021-01-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-29 00:00:00",
              "EquipmentInspectionDate": "2022-10-18 00:00:00",
              "EquipmentTested": "Chamber 1",
              "ChangeMgmtDate": "2021-02-05 00:00:00",
              "ChangeMgmtReviewDate": "2021-01-22 00:00:00",
              "PreStartupReviewDate": "2021-12-07 00:00:00",
              "ComplianceAuditDate": "2021-06-29 00:00:00",
              "AuditCompletionDate": "2022-08-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-01-22 00:00:00",
              "HotWorkPermitReviewDate": "2023-08-10 00:00:00",
              "ContractorSafetyReviewDate": "2023-06-05 00:00:00",
              "ContractorSafetyEvalDate": "2023-08-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000146417,
                  "PreventionProgram3ID": 1000116698,
                  "ProcessChemicalID": 1000169751
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000108302,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Webb County LEPC",
    "CoordinatingAgencyPhone": "9565234022",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000108302,
      "SummaryText": "Midwest Sterilization Corporation (MSC) operates a contract sterilization facility located at Laredo, Texas.  The facility is engaged in the sterilization of medical devices using ethylene oxide.  Ethylene oxide is listed as a regulated toxic substance (exceeding 10,000 lb. threshold quantity) under US EPA's Risk Management Program regulations (40 CFR 68).\r\n\r\nMidwest Sterilization has one (1) covered process (Ethylene oxide) at the Laredo Facility that is subject to the Program 3 prevention program requirements of the RMP rule. The Program 3 prevention program aligns with the requirements of the OSHA PSM standard. The facility has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. The following sections briefly describe the elements of the release Prevention Program that are in place at the Laredo Facility.\r\n\r\n1.1. PROCESS SAFETY INFORMATION\r\nMidwest Sterilization maintains a variety of technical documents that are used to ensure safe operation of the processes. Process Safety Information includes information pertaining to hazards of the highly hazardous chemicals in the process,  technology of the process,  and equipment in the process. Examples of Process Safety Information include but are not limited to safety data sheets and piping and instrumentation diagrams. Process Safety Information is updated using the Management of Change (MOC) process.  Process Safety Information is available electronically on the Midwest Sterilization internal server to ensure employee accessibility.  This information informs employees of the hazards, safety precautions, and design related limits for the process. \r\n\r\n1.2. PROCESS HAZARD ANALYSIS (PHA)\r\nMidwest Sterilization uses one or more of the following PHA methods, as appropriate, to identify, evaluate, and control process hazards:\r\n\r\n-What if\r\n-What If/Checklist\r\n-Hazard and Operability study (HAZOP)\r\n-Failure mode and effects analysis (FMEA)\r\n-Fault tree analysis"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000108302,
      "SummaryText": "or\r\n-An appropriate equivalent methodology.\r\n\r\nThe PHA is conducted by a team of people with expertise in engineering and process operations.  The team identifies and evaluates hazards of the process as well as prevention and mitigation measures currently in place and makes recommendations for additional prevention and/or mitigation measures as necessary to reduce risks to as low as reasonably practicable. The ethylene oxide storage and distribution process are designed with extensive safeguards to protect against the accidental release of ethylene oxide.  Examples of safety equipment in place include pressure relief devices, leak detection and alarm systems, equipment grounding system, explosion proof electrical systems, and intrinsically safe emission control equipment.\r\n\r\nRecommendations are reviewed by the Midwest Sterilization Management Team and after approval, corrective actions are assigned and distributed to impacted personnel for follow-up. Action items are tracked to closure to ensure that all follow-up items are completed in a timely manner.  Completed items are documented, and a copy of this document is placed in the PHA.  PHAs are revalidated at least every five years.  The revalidation includes a review of the changes and incidents that have taken place in the process since the last PHA and includes recommendations for additional prevention and/or mitigation measures. \r\n\r\n1.3. OPERATING PROCEDURES\r\nWritten operating procedures have been developed for each process area, which address initial start-up, normal operations, temporary operations, emergency shutdown, emergency operations,  normal shutdown and start-up following a turnaround, or after an emergency shutdown. These operating procedures are stored electronically on an internal server for employee access and are periodically reviewed and revised. \r\n\r\n1.4. TRAINING\r\nMidwest Sterilization's Training program includes formal on-boarding, job-specific training, compliance training, and safety training"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000108302,
      "SummaryText": ". Each employee involved in operating a process is trained in an overview of the process and in the operating procedures developed for that process. The Safety Manager or their designee is responsible for scheduling and coordinating the following training for PSM/RMP affected employees.\r\n\r\n1.5. MECHANICAL INTEGRITY\r\nMechanical Integrity includes all activities required to ensure proper design, construction, and ongoing integrity and reliability of equipment in order to prevent or minimize incidents for the life of the equipment.  Midwest Sterilization has several written programs in place that detail well-established practices and procedures for the inspection, testing, monitoring, and maintenance of process equipment.  Mechanical Training is routinely conducted, and procedures are periodically reviewed and updated.  \r\n\r\n1.6. MANAGEMENT OF CHANGE\r\nThe Management of Change (MOC) program is intended to cover changes to the process chemicals, technology, equipment, and procedures, and changes to stationary sources that affect a covered process. Midwest Sterilization reviews a proposed modification at conception under the MOC/PSSR process prior to addressing the change. The MOC requests are tracked, and once all the required reviews are completed, the MOC is approved for change implementation.  Training requirements for affected personnel will vary depending on the significance of the change. For changes requiring significant updates to procedures or equipment, special training sessions (meeting the training requirements of the company's RMP/PSM programs) may be necessary for operators, mechanics, and/or contractors. For less significant changes, simply communicating information about the change and its anticipated effects on operation/maintenance may substitute for training sessions.\r\n\r\n1.7. PRE-STARTUP REVIEW\r\nPre-startup safety review (PSSR) must be conducted on new facilities and modified facilities when the modification is significant enough to require a change in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000108302,
      "SummaryText": "the process safety information.  The pre-startup safety review process is used in conjunction with the Management of Change (MOC) process.  If the change triggers a PSSR, then approval for startup also requires satisfying the PSSR requirements. The PSSR process requires the appropriate personnel to field verify that the change was constructed and installed per the approved design and equipment specifications following the completion of the installation and prior to startup.\r\n\r\n1.8. COMPLIANCE AUDITS\r\nThe Midwest Sterilization RMP/PSM program is audited every three years and includes verification that the procedures and practices that have been developed to comply with the RMP Prevention Program and PSM regulations are adequate and being followed.   Compliance audits are conducted by at least one person knowledgeable in the process, and this person is impartial toward the facility or area being audited. The audit team develops findings that are forwarded to Midwest Sterilization Management for resolution.  Corrective actions taken in response to the audit team's findings are tracked to closure.  The final resolution of each finding is documented, and the two most recent audit reports are kept on the internal server.\r\n\r\n1.9. INCIDENT INVESTIGATION\r\nAn incident investigation must be conducted for every incident that resulted in or could reasonably have resulted in the catastrophic release of a regulated substance in a covered process. All incidents are reported and investigated according to the Incident Reporting and Investigation Procedure. Results of the investigation and lessons learned are then shared with appropriate personnel to prevent future recurrence. Any corrective actions resulting from the incident investigation are tracked to closure. Incident Investigation reports are retained for at least five (5) years.\r\n\r\n1.10. EMPLOYEE PARTICIPATION\r\nMidwest Sterilization encourages participation in the RMP/PSM Program through training and the development of cross-fu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000108302,
      "SummaryText": "nctional teams to perform process hazards analyses, incident investigations and compliance audits.  All new employees are be made aware of the RMP/PSM program as a part of the initial orientation process.  At least one hourly employee or a representative of the hourly employee, directly involved in the operation or maintenance of the site operations is represented in all meetings and/or formal discussions concerning RMP/PSM policies and procedures. All files associated with the RMP/PSM program are available as read-only to all Midwest Sterilization employees.\r\n\r\n1.11. SAFE WORK PRACTICES\r\nThe Midwest Sterilization facility has safe work practices in place to identify, assess and eliminate or mitigate risks associated with high risk work to ensure worker safety.  Examples of these include but are not limited to: \r\n\r\n -Confined Space Entry \r\n -Energy Isolation  \r\n -Line Opening/Breaks \r\n -Hot Work Permit \r\n -Entry Control \r\n\r\n1.12. CONTRACTORS\r\nMidwest Sterilization utilizes contract personnel to supplement maintenance work and also during planned shutdowns and construction activities. Midwest Sterilization goes through a selection process prior to allowing contractors to bid work in the facility.  The facility obtains and evaluates information regarding the contractor's historical safety performance and current safety programs.  After contractor selection, Midwest Sterilization informs the contractor of the potential fire and explosion hazards related to the facility operations, and routinely follow-ups with the contractor to evaluates the performance of the work to ensure the contractor is meeting RMP/PSM and other safety obligations.\r\n\r\n1.13. FIVE YEAR ACCIDENT HISTORY\r\nMidwest Sterilization has not had any accidental releases from the ethylene oxide storage and distribution process within the last five years that meet the above specified requirements.\r\n\r\n1.14. EMERGENCY RESPONSE PLAN\r\nIn the event of a release, Midwest Sterilization has an Emergency Action Plan (E"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000108302,
      "SummaryText": "AP). The EAP describes requirements that must be followed in the event ethylene oxide is released or if an emergency arises during maintenance or handling of the ethylene oxide. Since Midwest Sterilization employees will not respond to releases of regulated substances, the EAP defines the response organizations on call, emergency notification procedures (internal and external), facility evacuation, site communication and best practices to be used in the event an incident should occur. Emergency response activities are coordinated with the Laredo Fire Department and the Local Emergency Planning Committee. The EAP is reviewed and updated at least once per year to incorporate any facility change.\r\n\r\n1.15. PLANNED CHANGES TO IMPROVE SAFETY \r\nMidwest Sterilization constantly reviews its safety program and institutes revisions as appropriate to enhance safety and promote continuous improvement of our operations.  Safety and emergency preparedness are a part of MSC's everyday activities.  Exposure risks to employees and the public have been minimized through ongoing compliance with regulatory requirements.\r\n\r\n\r\n1.16. CHEMICAL-SPECIFIC SAFETY \r\nEthylene oxide is stored and distributed in a secure area that is temperature controlled, dry, well-ventilated, and away from incompatible chemicals and ignition sources.  Storage containers are grounded and have pressure relief valves.  Lower explosive limit (LEL) sensors are located in the storage and distribution areas that will alarm in the event of a major leak from ethylene oxide cylinders or the process."
    }
  ]
}