{
  "FacilityID": 1000089504,
  "FacilityName": "AMPAC Fine Chemicals",
  "FacilityStr1": "Hwy 50 and Hazel Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Rancho Cordova",
  "FacilityState": "CA",
  "FacilityZipCode": "95741",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.6016667",
  "FacilityLongDecDegs": "-121.209167",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "https://ampacfinechemicals.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 73903937,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 80297160,
  "Company2DUNS": 0,
  "OperatorName": "AMPAC Fine Chemicals LLC",
  "OperatorStr1": "Highway 50 and Hazel Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Rancho Cordova",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95670",
  "OperatorZipCodeExt": null,
  "FTE": 430,
  "OtherEPAFacilityID": "CAR000069153",
  "EPAFacilityID": "100000245157",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-12-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "134",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111297,
      "AltID": "Storage of 37% HCl",
      "FacilityID": 1000089504,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139037,
          "ProcessID": 1000111297,
          "ChemicalID": 53,
          "Quantity": 74000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000112569,
          "ProcessID": 1000111297,
          "NAICSCode": "325411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000089504,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-01-01 00:00:00",
    "ERTrainingDate": "2019-01-01 00:00:00",
    "CoordinatingAgencyName": "Sacramento Metro Fire Department",
    "CoordinatingAgencyPhone": "9162283000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089504,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis Risk Management Plan Executive Summary was developed pursuant to Section 2745.3 of the California Accidental Release Prevention (CalARP) Program codified by Title 19, California Code of Regulations (CCR), Division 2, and Chapter 4.5. The purpose of this Executive Summary is to provide a brief description of certain elements of the Risk Management Plan that has been implemented at the AMPAC Fine Chemicals LLC (AFC) facility, located in Rancho Cordova, California. The objectives of the California Accidental Release Prevention Program are to prevent the accidental release of certain regulated substances, minimize the risk to the community, and promote communication between the facility and emergency response personnel.\n\n\n\n1.0 Accidental Release Prevention \n\nAFC is committed to high standards of environmental, health and safety management as an integral component of its business activities consistent with corporate values and continuous improvement.\n\n \n\nProvide and maintain facilities, operations, and working conditions, which are safe for employees, visitors, contractors, and the public.\n\nProvide appropriate information and training to enable all activities to be conducted in a responsible and effective manner.\n\nInclude health, safety, environmental and loss prevention considerations in planning and decision making.\n\nComply with applicable laws and regulations and establish and maintain programs and procedures to assure that those laws and regulations are known and followed by its employees.\n\nMinimize any undue risk to health, safety or the environment in connection with the conduct of its business.\n\nPromote product stewardship including exerting a positive influence on the environmental, health and safety performance of contract manufacturers and key suppliers.\n\nCooperate with relevant authorities and other key stakeholders in resolving issues and improving performance.\n\n\n\n2.0 Stationary Sources and Regulated Substance\n\n \n\nThe AFC facility oper"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089504,
      "SummaryText": "ates on approximately 241 acres located within the property owned by Aerojet-General Corporation (Aerojet).  The main entrance to the Aerojet site, or Gate 3, is located at Highway 50 and Aerojet Road.  The entire Aerojet site extends between Sunrise Boulevard in Rancho Cordova on the west, Prairie City Road in Folsom to the east and from Folsom Boulevard on the north to White Rock Road on the south.  AFC operations are limited to Line 5, two warehouses located on Line 4, and Building 01-020.\n\n \n\nAFC is a contract manufacturer of custom intermediate and active pharmaceutical ingredients utilizing batch processes.  Active pharmaceutical ingredients (also known as bulk pharmaceutical substances) typically consist of structurally complex organic chemical compounds, which are manufactured via a series of intermediate steps and reactions under precise conditions.  An intermediate is a material produced during a manufacturing process that must undergo further molecular change or processing before it becomes an active pharmaceutical ingredient.  \n\n \n\nSince AFC is a contract manufacturer, pharmaceutical campaigns may run a couple of weeks to a couple of years.  Therefore, due to the possible intermittent use, AFC has registered for all of the chemicals in which the threshold quantities are anticipated to be exceeded during the next couple of production years, otherwise known as predictive filing.  Actual quantities of regulated materials maintained onsite may be significantly less than the registered amount.  AFC uses the following chemicals in amounts that exceed the regulatory threshold for certain regulatory defined processes including storage and manufacturing production.  \n\n\n\nHydrochloric Acid (37%)\n\n\n\nThe covered process involves the storage of the regulated substance in the original supplier's container.  \n\n\n\n\n\n3.0 HAZARD ASSESSMENT SUMMARY\n\n\n\nWorst-Case Release Scenario Results Summary for Toxics\n\n\n\nProcess 1 WCR Scenario Description: The worst-case scenario for 37%"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089504,
      "SummaryText": " Hydrochloric acid (aqueous) assumes a rupture and release of the entire contents of one 55-gal drum, the largest container, containing 500 pounds in storage building 04-045. The liquid temperature used in the simulation is 95oF which is the highest average temperature in Rancho Cordova, CA. Moreover,  enclosure (release into enclosed space, in direct contact with outside air) was considered as a mitigation measure. Using the parameters mandated by regulations through the RMP*Comp program, this worst-case release has the potential to traverse a 0.5-mile radius from the point of release and the potential to affect the population of 0 people.\n\n\n\nAlternative Release Scenario Results Summary for Toxics\n\nThis section is not applicable since Process 1 (37% HCl (aqueous) in building 04-045)is Program Level 1. \n\n\n\n4.0 Accidental Release Prevention Program AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n \n\nAFC has implemented this Risk Management Plan and a Process Safety Management (PSM) Plan in accordance with Title 8 CCR Section 1589 and 29 CFR 1910.119, which include the following elements.\n\n \n\n- Process safety information for each process is maintained to enable the identification of hazards involving regulated substances.  The documentation provides information on the specific hazards from the regulated substances used or generated, the technology of the process and process equipment.\n\n- A Process Hazard Analysis (PHA) is conducted prior to the start-up of each process or campaign, which uses a regulated substance that that exceeds the PSM threshold quantity.  The PHA identifies, evaluates and controls the hazards according to a risk rate system, based on hazard probability and severity.  The prioritization ranking dictates the implementation of hazard mitigation and control systems. \n\n- Written operating procedures, or batch records, are developed and implemented for each process, to provide process safety information, instructions and guidance to conduct the process activiti"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000089504,
      "SummaryText": "d local emergency response agencies about accidental releases, emergency planning, and emergency response.\n\nDocumentation of medical treatment necessary to treat human exposure to an accidental release of a regulated chemical.\n\nProcedures for responding to accidental releases of regulated chemicals.\n\nRequirements to provide training to all employees.\n\n \n\n\n\n7.0 Planned Changes to Improve Safety\n\n \n\nRecommendations developed as a result of the implementation and review of safety programs, process safety management, process improvements, equipment inspections, readiness reviews, safety meetings, lessons learned, industry experience, technology improvements, employee suggestions, and periodic audits are evaluated and employed, as necessary, prior to the start-up of a campaign.\n\n\n\nCurrently, there are no outstanding planned changes to improve safety as a result of Process Hazard Analysis for these RMP regulated substances.   \n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089504,
      "SummaryText": "es.\n\n- Training is provided to all employees who handle or may come into contact with the regulated chemicals or processes.  The training program includes new-hire orientation, annual refresher classes, and process-specific safety training.  The process specific training is conducted before the start of a new process and emphasizes chemical safety, hazard communication, operating procedures, and safe work practices.\n\n- Mechanical Integrity system to maintain the on-going reliability of process equipment.\n\n- A Management of Change procedure has been developed and implemented to provide an administrative tracking system to manage changes to existing processes.\n\n- Pre-startup reviews are conducted prior to the start-up of each new or modified process.\n\n- Compliance audits on the PSM and RMP are conducted once every three years to assure that safe practices are taken as part of a continuous improvement effort.\n\n- Accident and incident investigations are conducted in accordance with written procedures.  \n\n- Employee participation requirements are established in the PSM and RMP Program.\n\n- Hot work permits are issued to control ignition sources from welding, cutting and other open flame operations conducted at the facility.\n\n- A Contractors Safety program has been developed and implemented at the facility.\n\n\n\n\n\n5.0 Five-Year Accident History\n\n \n\nAFC has no history of accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on-site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage within the last five years.\n\n \n\n\n\n6.0 Emergency Response Program\n\n \n\nAFC has implemented an Integrated Contingency Plan and Emergency Response Program in accordance with the National Response Teams' Integrated Contingency Plan Guidance \"One Plan\" published in the Federal Register on June 5, 1996, which includes the following elements.  \n\n \n\nProcedures for informing employees, public an"
    }
  ]
}