{
  "FacilityID": 1000075328,
  "FacilityName": "Omaha Public Power Nebraska City Power Station",
  "FacilityStr1": "7264 L Road",
  "FacilityStr2": null,
  "FacilityCity": "Nebraska City",
  "FacilityState": "NE",
  "FacilityZipCode": "68410",
  "Facility4DigitZipExt": "6584",
  "FacilityCountyFIPS": "31131",
  "LEPC": "Otoe LEPC",
  "FacilityLatDecDegs": "40.620556",
  "FacilityLongDecDegs": "-095.773611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.oppd.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6970453,
  "ParentCompanyName": "Omaha Public Power District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Omaha Public Power District",
  "OperatorStr1": "444 So. 16th Street Mall",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68102",
  "OperatorZipCodeExt": "2247",
  "FTE": 160,
  "OtherEPAFacilityID": "68410MHPBLRR3",
  "EPAFacilityID": "100000204478",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "OP08R1-032",
  "SafetyInspectionDate": "2018-07-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-01-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-01-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-01-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "003",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093784,
      "AltID": "Ammonia SCR",
      "FacilityID": 1000075328,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000117334,
          "ProcessID": 1000093784,
          "ChemicalID": 56,
          "Quantity": 49000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000095049,
          "ProcessID": 1000093784,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000058554,
              "Process_NAICS_ID": 1000095049,
              "SafetyReviewDate": "2018-02-23 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NEMA",
              "FR_Comments": null,
              "HazardReviewDate": "2015-09-10 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-07-25 00:00:00",
              "TrainingReviewDate": "2018-08-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-12-13 00:00:00",
              "EquipmentInspectionDate": "2018-10-03 00:00:00",
              "EquipmentTested": "Ammonia Suppression Deluge Valve",
              "ComplianceAuditDate": "2017-09-30 00:00:00",
              "AuditCompletionDate": "2018-05-30 00:00:00",
              "IncidentInvestigationDate": "2018-02-26 00:00:00",
              "InvestigationChangeDate": "2018-09-11 00:00:00",
              "MostRecentChangeDate": "2018-07-25 00:00:00",
              "CBI_Flag": 0,
              "Description": "OPPD?s Program 2 Prevention Program for the anhydrous ammonia system is a rigorous program designed to meet the requirements of the RMP regulations.\n\n\n\nOPPD updated and revalidated its hazard review on 12/28/2012. The review examined the hazards associated with the selective catalytic reduction (SCR) process and the use of anhydrous ammonia. It also assessed the possibility of equipment malfunction and/or human errors that could cause an accidental release. Safeguards used or needed to control the hazards or prevent equipment malfunction and/or human error were evaluated. The review process also included a review of the steps used or needed to detect or monitor releases.\n\n\n\nIn addition to the hazard review, OPPD?s Program 2 Prevention Program incorporates all of the required elements, including:\n\n\n\nOperating Procedures: OPPD has developed written operating procedures for the safe storage and handling of anhydrous ammonia at Nebraska City Station. The procedures specify steps for each operating phase of the process and operating limits (e.g., pressure in the tanks). OPPD has outlined appropriate safety and health considerations and incorporated them into the safe operating procedures.\n\n\n\nTraining: OPPD has a training program related to the operation, inspection, and maintenance of the SCR anhydrous ammonia system to ensure safe operation.\n\n\n\nMaintenance: OPPD has written procedures for maintaining the process equipment. OPPD has identified inspections and maintenance practices needed to comply with industry standards. The maintenance program is conducted is accordance with good engineering practices and in accordance with manufacturers? recommendations.\n\n\n\nAll of the elements of OPPD?s Program 2 Prevention Program have been developed with the intent of preventing the accidental release of anhydrous ammonia.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000059202,
                  "PreventionProgram2ID": 1000058554,
                  "ProcessChemicalID": 1000117334
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075328,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-02-28 00:00:00",
    "ERTrainingDate": "2018-10-31 00:00:00",
    "CoordinatingAgencyName": "Otoe County Emergency Mgt Agency",
    "CoordinatingAgencyPhone": "4028739598",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075328,
      "SummaryText": "Stationary Source and Regulated Substances Handled:\n\nOmaha Public Power District's (OPPD) Nebraska City Station is a coal-fired electric generating facility. It is located 5 miles south of Nebraska City in Otoe County, Nebraska.  Nebraska City Station's Unit 2 uses anhydrous ammonia in the operation of its selective catalytic reduction (SCR) pollution prevention system. Anhydrous ammonia is the only Risk Management Program (RMP) listed chemical that is present at Nebraska City Station above the threshold quantity.\n\n\n\nThe anhydrous ammonia process at Nebraska City Station is not eligible for Program Level 1 because the distance to a toxic endpoint for the worst-case release assessment is greater than the distance to any public receptor (40 CFR 68.10(b)(2)). The anhydrous ammonia process is not required to be a Program Level 3 because the process is in NAICS code 221112, fossil fuel electric power generation, and not in one of the ten NAICS codes listed in 40 CFR 68.10(b)(1). The process is also not subject to the OSHA process safety management standard (40 CFR 68.10(b)(2)), because  OPPD is a political subdivision of the State of Nebraska, and Nebraska does not have a state OSHA program.  Therefore, the applicable Program Level for the anhydrous ammonia process at Nebraska City Station is Program Level 2.\n\n\n\nThe original Risk Management Plan for Nebraska City Station was submitted to EPA at the time a second electric generating unit, Unit 2, was being added to the facility. The anhydrous ammonia was brought on-site for the operation of Unit 2's selective catalytic reduction (SCR) pollution prevention system.  Because the SCR system was installed by contractors, and the contractors were subject to OSHA rules, OPPD decided that the RMP Program Level of the anhydrous ammonia process would be a Program Level 3, as a conservative measure. Since completion of the construction of the SCR system, the system has been operated and maintained by OPPD employees, who are not subj"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075328,
      "SummaryText": "ect to OSHA rules. For this reason, OPPD has determined that keeping the anhydrous ammonia process at a Program 3 level is not necessary, and OPPD has changed the Program Level of the process from a Program Level 3 to a Program Level 2 in a prior RMP resubmittal.\n\n\n\nAccidental Release Prevention and Emergency Response Policies:\n\nOPPD is committed to employee and public safety and the protection of the environment. To demonstrate this commitment, OPPD has invested significant resources in preventing the release of anhydrous ammonia; as is evident in all elements of OPPD's prevention program.  As an example, OPPD requires all employees, contractors, vendors, and unescorted visitors to take general ammonia awareness training.\n\n\n\nOverall safety at Nebraska City Station is governed not only by the ability to prevent accidental releases of anhydrous ammonia from occurring, but also by the ability to mitigate any accidental releases that may occur. OPPD has developed a robust emergency response program which includes having a trained Hazardous Material Response Team on-site and coordinating emergency response with the local emergency response agency. \n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\nOPPD's Program 2 Prevention Program for the anhydrous ammonia system is a rigorous program which was designed to meet the requirements of the RMP regulations. \n\n\n\nOPPD updated and revalidated its hazard review on 9/10/2015. The review examined the hazards associated with the selective catalytic reduction (SCR) process and the use of anhydrous ammonia. It also assessed the possibilites of equipment malfunction and/or human errors that could cause an accidental release. Safeguards used or needed to control the hazards or prevent equipment malfunction or human error were evaluated. The review process also included the review of steps used or needed to detect or monitor releases. \n\n\n\nIn addition to the hazard review, OPPD's Program 2 Prevention Prog"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075328,
      "SummaryText": "ram incorporates all of the required elements, including:\n\n\n\nOperating Procedures: OPPD has developed written operating procedures for the safe storage and handling of anhydrous ammonia at Nebraska City Station. The procedures specify steps for each operating phase of the process and operating limits (e.g., pressure in the tanks). OPPD has outlined appropriate safety and health considerations and incorporated them into the safe operating procedures.\n\n\n\nTraining: OPPD has a training program related to the operation, inspection, and maintenance of the SCR anhydrous ammonia system to ensure safe operation.\n\n\n\nMaintenance: OPPD has written procedures for maintaining the process equipment. OPPD has identified inspections and maintenance practices needed to comply with good engineering practices and in accordance with manufacturers' recommendations.\n\n\n\nFive-Year Accident History:\n\nThere have been no accidental releases of anhydrous ammonia at the time of this filing.\n\n\n\nEmergency Response Program:\n\nOPPD has developed a robust emergency response program and written Emergency Response Plan to minimize the effects of a release of anhydrous ammonia to employees, the public, and the environment. The emergency response program includes having a trained, on-site Hazardous Material Response Team available to respond to releases. OPPD also coordinates emergency response planning with the local emergency response agency.  \n\n\n\nIn the event of fire, explosion, or release of anhydrous ammonia; alarm systems are activated and emergency response is directed as initial evacuation occurs. Re-entry with personal protective equipment including respiratory protection and monitoring instrumentation is required if the ambient atmosphere ammonia levels exceed specified levels. Both emergency response and emergency medical procedures are documented and stressed during emergency response training on-site.\n\n\n\nPlanned Changes to Improve Safety\n\nOPPD is continually evaluating the hazards of operatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075328,
      "SummaryText": "n of the anhydrous ammonia system. "
    }
  ]
}