{
  "FacilityID": 1000034030,
  "FacilityName": "Chelan Facility",
  "FacilityStr1": "5 Howser Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Chelan",
  "FacilityState": "WA",
  "FacilityZipCode": "98816",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53007",
  "LEPC": "Chelan/Douglas County LEPC",
  "FacilityLatDecDegs": "47.494252",
  "FacilityLongDecDegs": "-119.85971",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Chelan Fruit Cooperative",
  "Company2Name": null,
  "CompanyDUNS": 7942204,
  "Company2DUNS": 0,
  "OperatorName": "Chelan Fruit Cooperative",
  "OperatorStr1": "100 Howser St.",
  "OperatorStr2": null,
  "OperatorCity": "Chelan",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98816",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rick Lancaster",
  "RMPTitle": "Assistant Manage",
  "FTE": 225,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147833",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-05 00:00:00",
  "SafetyInspectionBy": "Bruce Merighi",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-04-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-04-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-04-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-04-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 47.8649,
  "FRS_Long": -120.0527,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "8",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000041550,
      "AltID": "Fruit packing and storage",
      "FacilityID": 1000034030,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000041976,
          "ProcessID": 1000041550,
          "NAICSCode": "31142",
          "_desc": {
            "NAICS_CODE": "31142",
            "NAICS_DESCRIPTION": "Fruit and Vegetable Canning, Pickling, and Drying"
          }
        },
        {
          "Process_NAICS_ID": 1000041977,
          "ProcessID": 1000041550,
          "NAICSCode": "31199",
          "_desc": {
            "NAICS_CODE": "31199",
            "NAICS_DESCRIPTION": "All Other Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049936,
          "ProcessID": 1000041550,
          "ChemicalID": 56,
          "Quantity": 92248.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000549936,
          "ProcessID": 1000041550,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000034030,
      "SummaryText": "Executive Summary - Chelan Fruit Cooperative\n\nChelan Facility EPA Facility ID: 100000147833\n\n1.     Accidental Release Prevention and Emergency Response:\n\nChelan Fruit Cooperative's accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  It is the policy of Chelan Fruit to adhere to all applicable federal and state safety and environmental regulations.\n\n\n\nChelan Fruit's refrigeration personnel do respond to small ammonia releases and have received training in accordance with 29 CFR 1920.120, in addition to training specifically for ammonia.  An emergency plan has been developed covering notification to public safety agencies and the public.  An evacuation plan for the plant has also been developed and all employees receive training on this plan.  The plan has been reviewed with the local fire department.\n\n\n\nAnhydrous ammonia is used on-site at the Chelan Facility.  Ammonia is considered hazardous by EPA and is listed on the Extremely Hazardous Substance list.  Chemical properties of ammonia make it necessary to observe certain safety precautions in handling ammonia in order to:\n\n?    Prevent unnecessary human exposure\n\n?    Reduce the threat to our personnel\n\n?    Reduce the threat to the community\n\n\n\n2.     Facility and Regulated Substance Handled:\n\nThe Chelan Facility is a fruit processing and cold storage facility located near the City of Chelan, County of Chelan, State of Washington.\n\n\n\nThe regulated substance, anhydrous ammonia, is used as a refrigerant.  There is approximately 92,248 pounds of anhydrous ammonia in the overall facility.  The largest vessel could potentially release 9,345 pounds of ammonia. \n\n\n\nThere are four separate systems at this facility: \n\n \n\nSystem #1 has 4 engine rooms, 29 CA rooms, 19 common storage rooms and the largest vessel in the plant with 9,345 pounds (80% of maximum capacity).  The distance to the toxic endpoint would be 1.8 miles in a worse case scenario. EPA report"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000034030,
      "SummaryText": "ing is based on this system; \n\n\n\nSystem #2 has 2 engine rooms, 10 CA rooms and 1 common storage room.  The largest vessel has a capacity of 3,158 pounds (80% of maximum capacity).  The distance to the toxic endpoint in a worse case scenario would be 1.0 miles.\n\n\n\nSystem #3 has 3 engine rooms, 38 CA rooms and 2 common storage rooms.  The largest vessel capacity is 8,244 pounds (80% of maximum capacity).  The distance to the toxic endpoint in a worse case scenario would be 1.6 miles.\n\n\n\nSystem #4 has 3 engine rooms, 10 CA rooms and 13 common storage rooms.  The largest vessel capacity if 5,713 pounds (80% of maximum capacity).  The distance to the toxic endpoint in a worse case scenario would be 1.1 miles.\n\n\n\nThe facility is located in an industrial area spanning approximately 76 contiguous acres. There is a total of 7 buildings; System #1 occupies one building, System #2 has two buildings which share ammonia, System #3 has two buildings sharing ammonia and System #4 has two buildings sharing ammonia. The buildings are spread out over the property in such a manner that a catastrophic event in one building would not compromise the integrity of the other structures.  Isolation valves are located throughout the facility with remote operation and shutdown capabilities. All engine rooms have outside kill switches and ammonia detectors.  Because of these factors, it is highly unlikely that any of the worse case scenarios would actually be possible.\n\n\n\nChelan Fruit uses other hazardous substances on-site, however they do not meet or exceed the threshold limits established in 40 CFR 68.130.  The policies, procedures and training that have been established will reduce the risk of an accidental hazardous substance release for the safety of its employees and surroundings.\n\n\n\n3.     General Accidental Release Prevention Program:\n\nThe program is based on the following key elements;\n\n?    Continuing training for personnel\n\n?    Preventative maintenance programs as described in the PSM progr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000034030,
      "SummaryText": "am\n\n?    Use of safety equipment and procedures\n\n?    Use of accurate and effective written operating procedures\n\nChelan Fruit complies with OSHA and WA State process safety management rules and regulations, WA State safety regulations, and IIAR standards for good work practices.  The ammonia refrigeration system was installed to standards and local codes at the time of installation.  Piping and equipment is secured and protected, engine room doors are tight fitting and open outwards.  Other safety systems used include:\n\n?    Computerized controls, which can be operated remotely\n\n?    Suction trap hi-level float\n\n?    High discharge pressure shut down\n\n?    Low suction pressure shut down\n\n?    High discharge temperature shut down\n\n?    Oil pressure failure shut down\n\n?    High amperes shut down\n\n?    Automatic timer to prevent short cycling via computer controls\n\n?    Oil filters plugged shut down\n\n?    250 psi relief valves on high pressure side, to prevent overpressure situations\n\n?    150 psi relief valves on low pressure side, to prevent overpressure situations\n\n\n\nOperating procedures and checklists have been prepared by Chelan Fruit to be used by employees performing operational functions.  Procedures are kept in the refrigeration office.  These procedures include:\n\n?    Shut down procedures (routine and emergency)\n\n?    Pre-start up safety procedures\n\n?    Routine operations\n\n?    Maintenance of all equipment\n\n?    Response to major and minor releases\n\n?    Emergency action plan\n\n\n\n4.     Five-Year Accident History:\n\nChelan Fruit has had no accidents involving ammonia in the last five years.\n\n\n\n5.     Emergency Response Program:\n\nIn addition to the operating procedures, Chelan Fruit has established Emergency Response Guidelines for releases involving ammonia.  These procedures are part of the ongoing training.  Chelan Fruit coordinates its response efforts with Chelan County Fire District 7, Washington State Patrol, Chelan County Sheriff and Chelan County Emergency Management.\n\n\n\n6.     Planned Safety Improvements:\n\nTraining"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000034030,
      "SummaryText": " on ammonia safety and detailed mechanical integrity will be a major ongoing process at Chelan Fruit.  Review and update of the emergency plan will be done annually and drills and emergency evacuation practices will be executed semi-annually.  Training will be required for all employees who work around the ammonia system, including fork lift personnel.  Safety relief valves will be installed on all condensers.  Proper eyewash showers will be installed in all engine rooms.  A program for the inspection and replacement of rusty pipe will be instituted and carried out immediately.\n\n\n\n\n\n"
    }
  ]
}