{
  "FacilityID": 1000029943,
  "FacilityName": "Lamanuzzi & Pantaleo -  Dehydrator #1",
  "FacilityStr1": "3636 N. Grantland Ave",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "93722",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.787111",
  "FacilityLongDecDegs": "-119.914833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 173808817,
  "ParentCompanyName": "Lamanuzzi & Pantaleo (Ltd)",
  "Company2Name": null,
  "CompanyDUNS": 28194520,
  "Company2DUNS": 0,
  "OperatorName": "Lamanuzzi & Pantaleo",
  "OperatorStr1": "P. O. Box 296",
  "OperatorStr2": null,
  "OperatorCity": "Clovis",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93613",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gino Lamanuzzi",
  "RMPTitle": "Partner",
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161898",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-08-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-10-25 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-17 00:00:00",
  "AnniversaryDate": "2017-08-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.78833,
  "FRS_Long": -119.91625,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036504,
      "AltID": "Fruit fumigation",
      "FacilityID": 1000029943,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036881,
          "ProcessID": 1000036504,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044176,
          "ProcessID": 1000036504,
          "ChemicalID": 49,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544176,
          "ProcessID": 1000036504,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029943,
      "SummaryText": "1. Accidental Release Prevention and Emergency Action Policies:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) is committed to employee, public and environmental safety.  This commitment is demonstrated by its Accidental Release Prevention Program that includes management practices in areas such as operating procedures, equipment maintenance, hazard analysis and employee training associated with the processes at our facility. \n\n\n\nIt is the policy of Lamanuzzi & Pantaleo (Dehydrator) to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2. The Stationary Source and Regulated Substances:\n\n\n\nThe facility's primary activity is the dehydration of grapes for the purposes of producing raisins.  Anhydrous Sulfur Dioxide is the only regulated substance present at this facility that is subject to Process Safety Management/Risk Management Plan regulations.  \n\n\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), include administrative controls and mitigation measures to limit the distances for each reported scenario:\n\n\n\nTo perform the required offsite consequence analysis, the EPA's RMP *Comp(TM) and 2000 US Census data (the newest data available at the time of this program's creation) for LandView 5 were used.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case:\n\nThe worst case scenario is the catastrophic failure of a 2000-pound cylinder of SO2.  It is assumed the entire contents would be lost over a span of ten minutes.  At class D atmospheric stability and 3.0 meters/second wind speed, the toxic endpoint of 0.0078 mg/l would be 3.1 miles.  According to the Landview Census 2000 Population estimator, there are 27,013 persons within the radius.\n\n\n\nAlternative Scenario\n\n\n\nOur alternative scenario is the failure of a fuse plug within the SO2 vessel.  Given the release rate of the un-checked SO2 cylinder is 90PSI, we calculated the loss of a ?\" fuse plug to be roughly 200 pounds per minute ove"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029943,
      "SummaryText": "r a 10 minute period. At class D atmospheric stability and 3.0 meters/second wind speed, the toxic endpoint of 0.0078 mg/l would be 0.6 miles.  According to the Landview Census 2000 Population estimator, there are 273 persons within the radius.\n\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) has taken all the necessary steps to comply with OSHA's  Process Safety Management (PSM) requirements set out under 29 CFR ?1910.119 and EPA's Risk Management Plan regulation 40 CFR ?68.  The following sections briefly describe the elements of the release prevention program that is in place at our dehydrating facility.\n\n\n\na. Process Safety Information:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nb. Process Hazard Analysis:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) has conducted a Process Hazard Analysis to ensure that hazards associated with the process are identified and controlled.  The fumigation system is a simple one and does not incorporate complex equipment or machinery. Process Hazard Analysis' can result in findings or recommendations for improvements to prevent potential releases.  The management system includes that these findings or recommendations are promptly brought to resolution.  \n\n\n\nThe study will be re-evaluated at a regular interval of every five years or whenever major changes in the process are proposed.  Any findings related to the Process Hazard Analysis will be addressed in a timely manner.  \n\n\n\nThe most recent Process Hazard Analysis was performed on April 19, 2011.\n\n\n\nc. Operating Procedures:\n\n\n\nFor the purposes of safely conducting activities within the covered processes, Lamanuzzi & Pantaleo (Dehydrator) maintains written operating procedures.  These procedures address gassing operations and emergency shutdown.  N"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029943,
      "SummaryText": "o other procedures listed in regulations apply to this facility. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nd. Training:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) has a training program in place to ensure that employees who are operating the fumigation system process are competent in the operating procedures associated with the process.  Refresher training is provided at least annually and more frequently as needed.\n\n\n\ne. Mechanical Integrity:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) carries out routine maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, piping/valves systems, and a weigh scale. The most recent review/revision of maintenance procedures was performed on May 10, 2011.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nf. Compliance Audits:\n\n\n\nCompliance audits provide a means by which the management of a plant assures itself that employees are properly carrying out their duties for preventing accidental releases.  \n\n\n\n\n\nThis compliance audit was conducted on April 19, 2011.  \n\n\n\nAdditional audits will be carried out at least every 3 years and any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\n\n\n\n\ng. Incident Investigation:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) will promptly investigate any incident that has resulted in, or could reasonably have resulted in a catastrophic release of a regulated substance.  Such investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports of incidents will be re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029943,
      "SummaryText": "tained for a minimum of 5 years.\n\n\n\nh. Employee Participation:\n\n\n\nAll employees who are involved in the operation of the process have access to the reports, findings and recommendations of the Process Hazard Analysis and all other information required to be developed under this standard.  Additionally employees are actively involved in the conduct and development of Process Hazard Analysis and on the development of the other elements of Process Safety Management.\n\n\n\n\n\n5. Five-year Accident History:\n\n\n\nThere have been no releases from this facility.\n\n\n\n6. Emergency Planning:\n\n\n\nLamanuzzi & Pantaleo (Dehydrator) carries a written Emergency Action Plan to deal with accidental releases of hazardous materials.  The plan includes evacuation locations and procedures, procedures on notification of local emergency response agencies and the public.  To help insure that implementation of this plan is conducted properly an annual emergency evacuation drill is conducted annually.\n\n"
    }
  ]
}