{
  "FacilityID": 1000041673,
  "FacilityName": "TSE  INDUSTRIES, INC.",
  "FacilityStr1": "5260 113TH AVE. N.",
  "FacilityStr2": null,
  "FacilityCity": "CLEARWATER",
  "FacilityState": "FL",
  "FacilityZipCode": "33760",
  "Facility4DigitZipExt": "4838",
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.874027",
  "FacilityLongDecDegs": "-82.704844",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.TSE-industries.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4430187,
  "ParentCompanyName": "NA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TSE INDUSTRIES, INC.",
  "OperatorStr1": "5260 113TH AVE. N.",
  "OperatorStr2": null,
  "OperatorCity": "CLEARWATER",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33760",
  "OperatorZipCodeExt": "4838",
  "RMPContact": "RADMILA PETROVICH",
  "RMPTitle": "EHS MANAGER",
  "FTE": 92,
  "OtherEPAFacilityID": "34620TSNDS52601",
  "EPAFacilityID": "100000079005",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-12-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 27.87477,
  "FRS_Long": -82.7046,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051326,
      "AltID": "Millable urethane product",
      "FacilityID": 1000041673,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000051846,
          "ProcessID": 1000051326,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062268,
          "ProcessID": 1000051326,
          "ChemicalID": 77,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562268,
          "ProcessID": 1000051326,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000051327,
      "AltID": "TDI Dimer production",
      "FacilityID": 1000041673,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000051847,
          "ProcessID": 1000051327,
          "NAICSCode": "32552",
          "_desc": {
            "NAICS_CODE": "32552",
            "NAICS_DESCRIPTION": "Adhesive Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062269,
          "ProcessID": 1000051327,
          "ChemicalID": 44,
          "Quantity": 60464.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562269,
          "ProcessID": 1000051327,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041673,
      "SummaryText": "This summary reflects the conditions at the time of the May 18th RMP re-submittal.\n\n\n\nTSE Industries, Inc., the worlds foremost maker of millable urethane rubber was started almost fifty years ago and has never had an accident affecting offsite health or the environment. With our current accidental release prevention program and emergency response policy we anticipate another fifty safe years for TSE and our commercial and industrial neighbors.\n\n\n\nTSE is an ISO 9001 Certified company by Underwriters Laboratories. One of the requirements within the ISO quality managemen standard is strict adherence to written  production plans and operating procedures. These procedures are in place for the products produced from TDI. The value of this to safe operation is that deviation from the standard procedures is not permitted without through analysis and authorization of the change. This system significantly reduces the opportunity for human error to cause unexpected consequences. Adherance to production plan and operating procedures is verified by Underwriters Laboratories on the regular basis and audited by internal audit team. All deviations found during these inspections are reviewed and corrected. In addition to these constraints, hot work, line breaking and lockout-tagout permits help assure that maintenance or contractors do not make careless mistakes.\n\n\n\nTSE has written training and supplemental computerized audio/visual material for generalized safety and accident prevention programs. Additionally, employees are trained within the department on their specific job function.\n\n\n\nThe accidental release prevention plan is successful because of the following characteristics.\n\nA? All of the affected processes are designed or directed by qualified chemical or process engineers.\n\nA? The operation is accomplished within the framework of an ISO 9001 Quality Management System.\n\nA? The storage tanks are of double wall, stainless steel construction and are installed within a diked a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041673,
      "SummaryText": "rea that can contain the entire contents of the tank. Additionally, the tanks are inside the building.\n\nA? When removed from the tanks for use, the material is drawn out using vacuum, not pressure. This eliminates the possibility of tank failure from over-pressurization.\n\nA? The entire facility is covered by an automatic fire protection system.\n\nA? The plant uses security personnel during non-occupied hours to prevent unauthorized entry or vandalism.\n\n\n\nTSE's emergency response policy is maintained and practiced periodically. We have a good working relationship with the Pinellas Park Fire Department that has received material safety data sheets for the chemicals at TSE. They provide annual training for our employees on handling small fires. They have two stationhouses within five minutes of the plant that are equipped and trained to respond to hazardous materials incidents. They receive a copy of our contingency plan yearly and whenever it is revised. The plan contains a site map of the facility. \n\n\n\nThe Pinellas County Sheriff, Pinellas Park Police and Local Emergency Planning Committee receive copies of the contingency plan yearly and whenever it is revised.\n\n\n\nTSE has a contract with SWS Environmental First Response, Inc. a major emergency response provider. In the event of an emergency TSE may also call on the resources of the Bayer Corporation, the manufacturer of the material, if the need should arise.\n\n\n\nThe facility is located in the northern most part of Pinellas Park, Florida in an industrial park. We are situated on approximately three acres of land with various industrial and commercial businesses to the North and East and the back of a shopping center to the South and West. The property is separated from adjoining land and buildings on the East, South and West by trees, a creek, a stormwater retention pond and chain link fence. The area has numerous trees of various types and s.\n\n\n\nTSE is a producer of millable urethane (Millathane) rubber which is used"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041673,
      "SummaryText": " to produce many types of products from ATM machine money dispensing belts to the soles of high-tech running shoes made by some of the worlds most recognizable names in sports apparel. We also produce hot-melt and foam urethane based adhesives that are essential for the fabrication of many items of everyday use.\n\n\n\nThe process for the production of Millathane is essentially the precise combination of two major constituents, the toluene diisocyanate and a \"polyol\" (a group of chemicals similar to castor oil) as well as small amounts of various modifiers in a machine that dispenses it into five-gallon pails. It then cures to form a material that looks very much like the urethane that in-line roller skate wheels are made of.\n\n\n\nThe other process that uses toluene diisocyanate makes a product that TSE calls \"T9\". This product is used as a curing agent for very hard urethanes used on printing rollers and an adhesion promoter when adhering rubber to fabric, as in various gasket and diaphragm materials. This product is made by mixing the toluene diisocyanate in a vessel with a catalyst to produce a dimer (two molecules stuck together) of the toluene diisocyanate. The dimer is a solid material that is then extracted from the carrier solution and dried.\n\n\n\nEach of these processes has a 6,000-gallon storage tank for the toluene diisocyanate used in the product. Each tank is within a separate concrete containment area capable of collecting and containing the contents of the entire tank.\n\n\n\nThe worst case scenario presented for each of the two processes is the same. The storage tanks containing the toluene diisocyanate (TDI) are the same , 6000 gallons, and each is in a diked enclosure within the main building. Both tanks contain TDI, although not the same proportion.The two containment areas have a slightly different surface area (about 11 square feet difference), but the calculated toxic end points are essentially the same, 44.41 feet and 45.23 feet. \n\n\n\nThe evaporation rate "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041673,
      "SummaryText": "of water is approximately 720 times that of TDI. If an ounce of water took one hour to evaporate, it would take 30 days for the same amount of TDI. Because the tanks are corrosion resistant double walled stainless steel and situated within a concrete enclosure it is difficult to imagine a scenario in which the contents of the entire tank could be released rapidly.\n\n\n\nTSE's emergency response plan requires evacuation of the building once intercom anouncment is received. The emergency number \"911\" will be called. The first responder will be the PPFD that has both the equipment and trained personnel to respond to a hazardous materials incident. They have two stationhouses within five minutes of the facility. Clean up of materials will be handled by a professional emergency response company, SWS Environmental First Response, with which we have an existing agreement. SWS is also located in Pinellas Park. Our plan is reviewed at least once a year to assure currency. If significant changes are made to the operations the plan will be revised and sent to all of the external holders of the plan."
    }
  ]
}