{
  "FacilityID": 1000086222,
  "FacilityName": "Huntsman Advanced Materials - McIntosh Plant",
  "FacilityStr1": "555 Huntsman Road",
  "FacilityStr2": null,
  "FacilityCity": "McIntosh",
  "FacilityState": "AL",
  "FacilityZipCode": "36553",
  "Facility4DigitZipExt": "0500",
  "FacilityCountyFIPS": "01129",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "31.278056",
  "FacilityLongDecDegs": "-088.001667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 13995480,
  "ParentCompanyName": "Huntsman Advanced Materials Americas, LLC",
  "Company2Name": null,
  "CompanyDUNS": 159260202,
  "Company2DUNS": 182575584,
  "OperatorName": "Huntsman Adv. Mat. Americas, LLC",
  "OperatorStr1": "555 Huntsman Road",
  "OperatorStr2": null,
  "OperatorCity": "McIntosh",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36553",
  "OperatorZipCodeExt": "0500",
  "FTE": 144,
  "OtherEPAFacilityID": "ALR000013177",
  "EPAFacilityID": "100000173581",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "108-0022",
  "SafetyInspectionDate": "2019-04-18 00:00:00",
  "SafetyInspectionBy": "Railroad DOT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-04-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-04-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-04-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 31.27806,
  "FRS_Long": -88.00167,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107669,
      "AltID": "Mfg. of Epoxy Resin",
      "FacilityID": 1000086222,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134611,
          "ProcessID": 1000107669,
          "ChemicalID": 21,
          "Quantity": 3400000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000108962,
          "ProcessID": 1000107669,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000091317,
              "Process_NAICS_ID": 1000108962,
              "SafetyReviewDate": "2020-03-18 00:00:00",
              "PHA_Date": "2019-10-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-05-12 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-12-18 00:00:00",
              "TrainingReviewDate": "2019-10-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-03-14 00:00:00",
              "EquipmentInspectionDate": "2020-03-13 00:00:00",
              "EquipmentTested": "19-V-808 & 19-V-832 Level transmitters",
              "ChangeMgmtDate": "2020-03-16 00:00:00",
              "ChangeMgmtReviewDate": "2020-01-22 00:00:00",
              "PreStartupReviewDate": "2019-10-08 00:00:00",
              "ComplianceAuditDate": "2018-03-02 00:00:00",
              "AuditCompletionDate": "2020-12-31 00:00:00",
              "IncidentInvestigationDate": "2019-12-12 00:00:00",
              "InvestigationChangeDate": "2020-05-15 00:00:00",
              "ParticipationPlansReviewDate": "2018-10-29 00:00:00",
              "HotWorkPermitReviewDate": "2020-02-28 00:00:00",
              "ContractorSafetyReviewDate": "2018-11-08 00:00:00",
              "ContractorSafetyEvalDate": "2020-03-23 00:00:00",
              "CBI_Flag": 0,
              "Description": "Epoxy resin manufacturing with epichlorohydrin",
              "_chemicals": [
                {
                  "PrimaryKey": 1000113516,
                  "PreventionProgram3ID": 1000091317,
                  "ProcessChemicalID": 1000134611
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000086222,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "WCEMA",
    "CoordinatingAgencyPhone": "2518472668",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086222,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT OUR FACILITY\n\n\n\nThe Huntsman Advanced Materials McIntosh plant (Huntsman) is located on Huntsman Road in McIntosh, Washington County, Alabama.  Huntsman occupies the northeast quadrant of the manufacturing area that was formally Ciba Specialties Chemicals Corporation (now owned by BASF), prior to purchase by Huntsman, and is operating with approximately 145  employees. We maintain a staff of Environmental, Health, and Safety (EHS) professionals who are trained/educated in their respective areas and provide professional training to our employees.  Huntsman strives to be an accepted part of the community by being a good citizen.  We focus daily on all laws and regulations in order to protect the health and safety of our employees, our community, and the environment.    \n\n\n\nOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\n\n\nHuntsman produces specialty polymers and basic liquid epoxy resins.  As part of the manufacturing process, we utilize one chemical listed in the United States Environmental Protection Agency (USEPA) Risk Management Program rule above the threshold quantity, epichlorohydrin.  Epichlorohydrin is received in rail cars and tank trucks, and then transferred to storage tanks on site.  From the on-site storage tanks, epichlorohydrin is piped to several processing areas, where it is reacted with other chemicals to form epoxy resins.  \n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nOur facility is subject to two major chemical accident prevention rules:\n\n- The USEPA's Risk Management Program (RMP) rule, found at 40 CFR 68, and;\n\n\n\n- The Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) rule found at 29 CFR 1910.119.  The PSM program is applicable due to both flammable and toxic materials above the PSM threshold quantity.\n\n\n\nCompliance with these regulations is integral to Huntsman's efforts to reduce the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086222,
      "SummaryText": "likelihood and impact of potential releases as follows:\n\n\n\n- Employee Participation: Employees are encouraged to participate in identifying and mitigating potential hazards involved in the process.\n\n\n\n- Process Safety Information: We maintain information on the hazards of substances used in the process, the technology of the process, and equipment utilized in the process.  This information helps us to ensure the on-going safety of process equipment.\n\n\n\n- Process Hazard Analysis (PHA): A multidisciplinary team of Huntsman personnel, with or without the assistance of external professional consultants,  analyze our process to determine potential release scenarios and the potential consequences of these scenarios.  The team then evaluates existing safeguards in place referencing process safety information and the knowledge and experience of team members.  The risk of each scenario is ranked according to likelihood and severity.  The team decides if existing safeguards are adequate and if not, a recommendation for improvement is developed.  Recommendations are tracked to completion.  All associates and applicable contractors have access to the results of the PHA.\n\n\n\n- Operating Procedures.  We have developed written safe operating procedures for the process.  These procedures include: initial start-up; normal start-up and shutdown; normal operations; temporary operations; emergency shutdowns and operations; start-up following normal or emergency shutdown or major change; consequences of deviation from normal operations; and equipment inspections.  All of our operating personnel are part of an on-going training program for operating procedures.\n\n\n\n- Mechanical Integrity. We have implemented a program to inspect and maintain all critical components of the process covered by RMP and PSM.  This program utilizes the manufacturer's recommended operations and maintenance procedures, good engineering practice, and our own maintenance experience, to regularly inspect and assess t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086222,
      "SummaryText": "he condition of process equipment. We repair or replace any equipment that does not meet our specifications.\n\n\n\n- Management of Change. We have implemented a system to ensure that any changes to the process are analyzed for potential hazards associated with a change.  This system also helps us to ensure that our program is current.  Before we start a new process, or after a significant change to the system, we complete a formal pre-startup safety review.\n\n\n\n- Incident Investigation.  We review  all incidents and \"near miss\" incidents.  Our reviews  allow us to learn more about the process to prevent recurrence or similar incidents.  We review the results of our investigation with associates and contractors, if involved.\n\n\n\n- Contractors.  We recognize that contractors or visitors may not be familiar with the hazards of our process.  To help assure the safety of our associates, visitors and contractors, we have implemented a contractor safety program whereby contractors are pre-qualified, informed as to the hazards, and periodically evaluated while on site. \n\n\n\n- Safety Systems.  Our process has been equipped with certain safety systems intended to prevent, or minimize the effects of a release.  Examples of these systems are: pressure relief valves, automatic level controls and interlocks and alarms.  Experienced operators continuously monitor the process and are trained to respond to potential process upsets. The process is equipped with automatic fire protection systems including sprinklers, deluge systems and foam systems.  We also have written emergency response procedures, in case the system approaches unsafe limits.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nHuntsman has had no accident in the last five years involving an RMP chemical resulting in an injury to onsite personnel or significant property damage.\n\n\n\nOUR EMERGENCY RESPONSE PROGRAM\n\n\n\nWe are a defensive responder to releases of hazardous materials.  We have developed and implemented an emergency action plan, wh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086222,
      "SummaryText": "ich details the steps we take in an emergency.  This plan specifies that we summon emergency services in case of a release.  A trained HAZMAT team will respond to the release, and our associates will evacuate to a safe area.  The Local Area Planning Commission (LEPC) is familiar with our Risk Management Plan, and will arrange for notification of the public, if necessary.\n\n\n\nBecause of the answer being Yes to 9.1.a., (the Huntsman McIntosh facility is included in the written community emergency response plan,) 9.1.b through 9.6 does not allow input. Therefore, these are answered here in the summary.\n\n9.1.b. This facility has its own written emergency response plan.\n\n9.2 Our facility's ER plan includes specific actions to be taken in response to accidental releases of regulated substances.\n\n9.3 Our facility's ER plan includes procedures for informing the public and local agencies responding to accidental releases.\n\n9.4 Our facility's ER plan includes information on emergency health care.\n\n9.5 Date of most recent review or update of your facility's ER plan was 7/2/2020.\n\n9.6 Date of most recent ER training for your facility's employees was in 3rd quarter 2020.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nWe continually strive to improve the safety of our operations through regular audits along with suggestions and observations from employees.  EHS improvements are made whenever an incident investigation indicates the need for improvement, or a PHA team feels improvements are necessary. In addition, \"near-miss\" reporting is stressed. Investigations using root cause analysis are conducted to uncover conditions leading up to incidents. A Behavioral Based Safety observation program has been instituted where associates observe one another performing tasks to reduce behaviors leading to incidents.  As part of analyzing events at other plants within the company, Huntsman is taking steps to drive our Process Safety Management program far beyond that which is required for simple com"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000086222,
      "SummaryText": "pliance.  Over the past decade within Huntsman we have forged a corporate EHS program based upon our EHS policy, underpinned by the EHS Responsible Care Standards and associated procedures. We place great value on process safety, personal safety and care for the environment. The Huntsman EHS Vision is that we provide innovative solutions which enrich lives and help create a sustainable future, with no harm to people or to the environment.   As such, it is the responsibility of both management and associates to operate safe, clean, efficient and compliant facilities in a sustainable, environmentally and socially responsible manner."
    }
  ]
}