{
  "FacilityID": 1000044472,
  "FacilityName": "Arizona Public Service Company Redhawk Power Plant",
  "FacilityStr1": "11600 South 363rd Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Arlington",
  "FacilityState": "AZ",
  "FacilityZipCode": "85322",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.335833",
  "FacilityLongDecDegs": "-112.840528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6901995,
  "ParentCompanyName": "Pinnacle West Capital Corporation",
  "Company2Name": null,
  "CompanyDUNS": 131155400,
  "Company2DUNS": 131155400,
  "OperatorName": "Arizona Public Service Company",
  "OperatorStr1": "400 North 5th St., MS 5100",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85004",
  "OperatorZipCodeExt": null,
  "FTE": 47,
  "OtherEPAFacilityID": "AZR000042127",
  "EPAFacilityID": "100000177701",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "V99-013",
  "SafetyInspectionDate": "2012-07-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.33944,
  "FRS_Long": -112.83778,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "0.3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054918,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 1000044472,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066877,
          "ProcessID": 1000054918,
          "ChemicalID": 57,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000055755,
          "ProcessID": 1000054918,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000054919,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 1000044472,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066878,
          "ProcessID": 1000054919,
          "ChemicalID": 57,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000055756,
          "ProcessID": 1000054919,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044472,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-04-24 00:00:00",
    "ERTrainingDate": "2013-07-30 00:00:00",
    "CoordinatingAgencyName": "Maricopa Co Emergency Planning Comm",
    "CoordinatingAgencyPhone": "6022731411",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044472,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe following outlines the key components of the Risk Management Plan for the aqueous ammonia storage and handling system at the Arizona Public Service Company's Redhawk Power Plant.  The organization of this executive summary follows the elements listed in the U.S. EPA's RMP*eSubmit Users Manual, with a brief introduction.\n\n\n\n\n\nIntroduction\n\n\n\nArizona Public Service Company owns and operates the Arizona Public Service Company Redhawk Power Plant, an electric power generation facility located in western Maricopa County, Arizona.  The facility is a green-field site currently consisting of two combined-cycle units.  This RMP covers these two unit identified as Units 1 and 2.\n\n\n\nThese combined-cycle units have selective catalytic reduction (SCR) control systems installed to reduce emissions of nitrogen oxides (NOx).  The SCR system utilizes aqueous ammonia to reduce NOx emissions.  Ammonia with concentrations of 20% or higher is listed as a regulated substance under Section 112(r) of the Clean Air Act Amendments of 1990.\n\n\n\nAs a result of the SCR NOx control system, the quantity of aqueous ammonia stored and used at the facility is greater than the Threshold Quantity, thus a Risk Management Plan (RMP) is required.  The aqueous ammonia system is identified as the only process at the facility that triggers RMP requirements.  As explained in the following sections, even the highly unlikely worst-case release from the aqueous ammonia system will not result in the toxic endpoint reaching a public receptor.\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nAccidental release prevention and emergency response policies are supported at the highest level within the Company.  The facility is operated to protect the health and safety of our employees and neighbors, as well as to protect the environment.  To communicate this philosophy, Arizona Public Service Company has an ongoing environmental, health, and safety training program for emp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044472,
      "SummaryText": "loyees.  In addition, a release such as that used for the worst-case scenario is highly unlikely due to this ongoing training, and preventive maintenance inspections of the ammonia system.\n\n\n\n2. Description of Facility and Regulated Substance Handled\n\n\n\nThe Arizona Public Service Company Redhawk Power Plant is located in the western portion of Maricopa County.  As mentioned,  SCR systems are installed to control NOx from the two units.  The SCR system utilizes a 29.4% solution of ammonia in water, ammonium hydroxide.  The ammonia storage and handling system consists of two 25,000 gallon storage tanks (one for each unit), pumps, and piping to the vaporizer, which produces a uniform distribution of aqueous ammonia injected into the flue gas upstream of the SCR catalyst.  The storage tanks will have a maximum design pressure of 30 psia, and both tanks are contained completely within individual walled containment basins designed to hold all of the tank contents.  The tanks have an administrative fill limit of 95% (23,750 gallons each).\n\n\n\n3. Worst-case Release Scenario\n\n\n\nThe worst-case scenario is a release of the entire contents of one of the storage tanks.  The tanks are surrounded by individual walled containment basins that limits the exposed surface area and reduces the release rate for the 29.4 wt.% aqueous ammonia.  Using EPA's Guidance for Offsite Consequence Analysis, dated April 1999, the dike area is less than the area of a pool that could form and the containment area is sufficient to hold the entire volume.  Under worst-case meteorology as per the guidance (1.5 m/s and F stability) and adjusting the release rate for release temperature, the resulting distance to toxic endpoint from Reference Table 10 is 0.4 miles (rural topography).  This distance is contained within the property boundary except for the very northern extent of the distance to toxic endpoint for Unit 1 (extends about 300 feet (0.06 miles) off property).  However, there are no public recepto"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044472,
      "SummaryText": "rs in this area.  The nearest public receptor is over 1.5 miles away from the property boundary to the northeast, which is well beyond the distance to the toxic endpoint.\n\n\n\nThe worst-case release from the storage tank is predicted to remain almost entirely on-site and is less than the distance to public or environmental receptors.  The facility has not had a release of a regulated substance in the past five years, thus it qualifies for Program 1 and an alternate release scenario is not required.\n\n\n\n4. Accidental Release Prevention Program\n\n\n\nThe aqueous ammonia system was designed to reduce potential off-site impacts by including two concrete dikes to provide 100% containment around the storage tanks.  Operators will receive ongoing training in accident prevention and chemical safety, will conduct visual inspections of the ammonia system routinely, as well as perform maintenance recommended by the equipment manufacturers to reduce the risk of accidents.\n\n\n\n5. Five-Year Accident History\n\n\n\nThere have been no accidental releases of a regulated substance at the Arizona Public Service Company Redhawk Power Plant in the past five years.\n\n\n\n6. Emergency Response Program\n\n\n\nArizona Public Service Company is required to meet the requirements for Program 1, which includes coordination with the local emergency responders.  Arizona Public Service Company has coordinated emergency response with the Maricopa County Emergency Planning Commission by submitting an Emergency Response Plan as required.\n\n\n\n7. Planned Changes to Improve Safety\n\n\n\nArizona Public Service Company has an ongoing program of training, maintenance, and inspections in order to minimize the possibility of accidents.  Following start-up of the ammonia system the facility will evaluate procedures and implement recommendations as appropriate from ongoing review of operator training and inspection programs."
    }
  ]
}