{
  "FacilityID": 1000075325,
  "FacilityName": "Calumet Renewable Energy, LLC - Dairy Dreams Fclty",
  "FacilityStr1": "E3576 Cardinal Road",
  "FacilityStr2": null,
  "FacilityCity": "Newton",
  "FacilityState": "WI",
  "FacilityZipCode": "54205",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55061",
  "LEPC": "Kewaunee County LEPC",
  "FacilityLatDecDegs": "44.662692",
  "FacilityLongDecDegs": "-87.587671",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "LC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DTE Biomass Energy, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 876234923,
  "Company2DUNS": 0,
  "OperatorName": "DTE Biomass Energy, Inc.",
  "OperatorStr1": "425 S. Main St",
  "OperatorStr2": null,
  "OperatorCity": "Ann Arbor",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48104",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Regional Operations Manager",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000240394",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "431016850-P01",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "11",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094143,
      "AltID": "Compressed Natural Gas",
      "FacilityID": 1000075325,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000095423,
          "ProcessID": 1000094143,
          "NAICSCode": "22121",
          "_desc": {
            "NAICS_CODE": "22121",
            "NAICS_DESCRIPTION": "Natural Gas Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000117875,
          "ProcessID": 1000094143,
          "ChemicalID": 93,
          "Quantity": 66000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000617875,
          "ProcessID": 1000094143,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075325,
      "SummaryText": "Clean Air Act Amendments Section 112 (r) (7)\n\nAccidental Release Prevention Programs:\n\n40 CFR Part 68 Subpart G\n\nRisk Management Plan\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nThe facility is a stationary source that is subject to the Risk Management Programs under the Clean Air Act, Section 112 (r)(7) (as promulgated in 40 Code of Federal Regulations Part 68).  The facility stores methane (a flammable gas) in quantities in excess of the 10,000 pound Risk Management Program threshold.\n\n\n\nPursuant to 40 CFR ? 68.150, the facility is required to submit a single Risk Management Plan (RMP) that includes the information required by ? 68.150 through 68.195.  The faco;otuis also required to provide an executive summary in the RMP.  The following is a brief description of various elements of the facility's Risk Management Program, as required by 40 CFR ? 68.155:\n\n\n\n(a)    THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\n\n\nCalumet Renewable Energy, LLC recognizes that the safe handling of methane is critical to the welfare of the community.  Calumet Renewable Energy, LLC recognizes that the U.S. Environmental Protection Agency lists methane as a regulated flammable substance pursuant to the Accidental Release Prevention and Risk Management Program regulations.\n\n\n\nCalumet Renewable Energy, LLC is committed to the implementation of the stringent safety precautions required by the regulation for methane at its facility.  These safety precautions are necessary to prevent accidental releases of methane that could threaten the health of employees, contractors, and the members of the community.  To this end, Calumet Renewable Energy, LLC implements routine equipment maintenance, operational procedures, employee training and (where necessary) emergency response, and is committed to compliance with all applicable state and federal regulation.\n\n\n\n(b)    THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nThe facility treats gas from dairy farm digesters to pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075325,
      "SummaryText": "duce renewable compressed natural gas. \n\n\n\nThe facility compresses the raw gas, removes moisture and feeds the gas through a series of membranes to remove the majority of hydrogen sulfide and carbon dioxide. The hydrogen sulfide and carbon dioxide are directed to a thermal oxidizer where the hydrogen sulfide is destroyed. The treated gas is directed to scavenger units where traces of hydrogen sulfide are adsorbed onto solid media. The cleaned renewable natural gas is further compressed and loaded onto trucks for transport to a remote station for injection into a natural gas pipeline.\n\n\n\n(c)    THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe facility has established an accidental release prevention program, which establishes the protocols needed to safely handle and use methane.  The plan is designed to prevent and minimize the effects of an unplanned, sudden or non-sudden incidents involving methane.\n\n\n\nSpecifically this plan protects the community using a combination of operating procedures and safe work practices, equipment design, emergency operations and shut-down procedures, design, detection, and employee training and education.\n\n\n\nIn the event that the digester gas cannot be treated, there is a process upset, the gas does not meet specifications, the thermal oxidizer is not available or trucks are not available to access the cleaned gas, the gas is directed to a flare for destruction.\n\n\n\nThe facility is equipped with explosive gas detectors, hydrogen sulfide detectors and flame detectors. The process controls are programmed to initiate an emergency shutdown and sound an alarm if any of these detectors are activated. \n\n\n\nThe requirements of the accidental release prevention program will be implemented as an on-going compliance policy to ensure that methane is safely stored, handled and used by the facility.  This plan provides direction for the current and future use and handling of methane so as to minimize its imp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075325,
      "SummaryText": "act on the community.\n\n\n\n(d)    THE FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThe facility is new; in the last five (5) years, there have been no releases that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\n(e)    THE EMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility does not intend to have its personnel respond to any major emergencies. If able to safely do so, in the event of a fire, explosion or hazardous material release emergency, facility personnel will press the emergency stop (E-Stop) to activate the local alarm and initiate a process emergency shut down. Emergency shutdown will also be initiated by the control system under a number of scenarios. When the local alarm sounds, or if a fire or explosion occurs, facility personnel evacuate to a safe distance and contact local emergency responders in accordance with the facility's Emergency Action Plan. \n\n\n\n(f)    PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe facility is new; no changes are planned to improve safety.\n\n"
    }
  ]
}