{
  "FacilityID": 1000018376,
  "FacilityName": "Elm Grove Dew Point Control Plant",
  "FacilityStr1": "Johnson Koran Road",
  "FacilityStr2": null,
  "FacilityCity": "Oakland",
  "FacilityState": "LA",
  "FacilityZipCode": "71037",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22015",
  "LEPC": "Bossier-Caddo Parish LEPC",
  "FacilityLatDecDegs": "32.452140",
  "FacilityLongDecDegs": "-093.485130",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "La Grange Acquisitions, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "La Grange Acquisitions, LLC",
  "OperatorStr1": "800 E. Sonterra Blvd",
  "OperatorStr2": "Suite 400",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78258",
  "OperatorZipCodeExt": "3941",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194906",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-04-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-04-15 00:00:00",
  "DeRegistrationEffectiveDate": "2019-04-04 00:00:00",
  "AnniversaryDate": "2016-04-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.45214,
  "FRS_Long": -93.48513,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000022505,
      "AltID": "Dew Point Control Plant",
      "FacilityID": 1000018376,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000026650,
          "ProcessID": 1000022505,
          "ChemicalID": 98,
          "Quantity": 47622.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000026651,
          "ProcessID": 1000022505,
          "ChemicalID": 155,
          "Quantity": 170000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 104087,
              "ProcessChemicalID": 1000026651,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 104088,
              "ProcessChemicalID": 1000026651,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 104089,
              "ProcessChemicalID": 1000026651,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 104090,
              "ProcessChemicalID": 1000026651,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 104091,
              "ProcessChemicalID": 1000026651,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000022787,
          "ProcessID": 1000022505,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000019056,
              "Process_NAICS_ID": 1000022787,
              "SafetyReviewDate": "2010-09-23 00:00:00",
              "PHA_Date": "2010-09-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-01-23 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Shut Down",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-10-22 00:00:00",
              "TrainingReviewDate": "2010-08-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-10-22 00:00:00",
              "EquipmentInspectionDate": "2010-10-20 00:00:00",
              "EquipmentTested": "All equipment",
              "ChangeMgmtDate": "2010-01-26 00:00:00",
              "ChangeMgmtReviewDate": "2010-01-28 00:00:00",
              "PreStartupReviewDate": "2010-03-10 00:00:00",
              "ComplianceAuditDate": "2010-11-04 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-01-08 00:00:00",
              "HotWorkPermitReviewDate": "2010-01-08 00:00:00",
              "ContractorSafetyReviewDate": "2010-07-13 00:00:00",
              "ContractorSafetyEvalDate": "2010-07-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000022581,
                  "PreventionProgram3ID": 1000019056,
                  "ProcessChemicalID": 1000026650
                },
                {
                  "PrimaryKey": 1000022580,
                  "PreventionProgram3ID": 1000019056,
                  "ProcessChemicalID": 1000026651
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000018376,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-07-13 00:00:00",
    "ERTrainingDate": "2010-09-28 00:00:00",
    "CoordinatingAgencyName": "Haughton Fire Department",
    "CoordinatingAgencyPhone": "3189499500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018376,
      "SummaryText": "ELM GROVE DEW POINT CONTROL PLANT RISK MANAGEMENT PLAN: EXECUTIVE SUMMARY\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nEnergy Transfer has a long-standing commitment to workers and public safety.  This commitment is demonstrated by the resources invested in accident prevention such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes.  The Energy Transfer policy is to implement reasonable controls to prevent forseeable releases of substances.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nEnergy Transfer operates the Elm Grove Dew Point Control Plant in Bossier Parish, Louisiana.  This facility is a natural gas processing plant which uses mechanical refrigeration to remove liquids from the gas stream.  Glycol dehydration is used to remove water from the stream.  Mixed liquids from the refrigeration plant are stored in atmospheric tanks prior to being shipped off-site in tanker trucks.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention (ARP) Program, Elm Grove Dew Point Control Plant is a Program 1 process.\r\n\r\nElm Grove Dew Point Control Plant was evaluated to determine if any regulated flammable or toxic substances were present in the process and if they exceeded the threshold quantity.  All equipment and vessels are considered to be connected and/or co-located; consequently, for the purposes of the ARP Program, all equipment and vessels are part of a single process.  The identification of even a single vessel exceeding threshold quantities of a regulated flammable or toxic substance would subject a process to threshold determination for offsite consequence analysis.\r\n\r\nEnergy Transfer identified three flammable liquid mixtures and zero regulated toxic substances along with the largest vessel quantity stored.  Two of the flammable liquid mixtures exceeded the threshold quantity.  The identification"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018376,
      "SummaryText": "of this exceedance indicates that the Elm Grove Dew Point Control Plant is a covered process with a regulated substance subject to offsite consequence analysis.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThis is a new facility that has not had any accidental releases.\r\n\r\nLOCAL EMERGENCY RESPONSE COORDINATION\r\n\r\nThe Elm Grove Dew Point Control Plant has coordinated its emergency response activities with the local emergency planning and response agencies as required in 40 CFR 68.12(b)(3).\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe following is a summary of the accident prevention program in place at the Elm Grove Dew Point Control Plant.  Because plant processes are subject to EPA's RMP regulations and to OSHA's PSM standards, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEMPLOYEE PARTICIPATION\r\n\r\nEnergy Transfer actively encourages all levels of employees and contract employees to participate in creating a safe work environment.  This participation begins with well-established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining PSM rule compliance based on their knowledge, skill, job responsibilities, and experience.\r\n\r\nPROCESS SAFETY INFORMATION\r\n\r\nThe Elm Grove Dew Point Control Plant maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as for key process parameter limits and equipment design basis/configuration information.  Specific departments within the plant are assigned responsibility for maintaining up-to-date process safety information.\r\n\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDSs).  This information"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018376,
      "SummaryText": "is supplemented, when required, by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  In addition, the plant has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel,process controls, and monitoring and protective instrument systems.\r\n\r\nThe plant also maintains documentation that provides information about the design and construction of process equipment.  Equipment information includes construction materials, design pressure, and temperature and electrical ratings.  This information  provides a basis for establishing inspection andmaintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nPROCESS HAZARD ANALYSIS (PHA)\r\n\r\nThe Elm Grove Dew Point Control Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\n\r\nThe Elm Grove Dew Point Control Plant primarily uses the HAZOP method to perform these evaluations. This technique provides a highly structured approach where process parameters such as flow and temperature are examined for deviations from their intended design. Deviation effects are considered in order to determine resulting potential hazards while preliminary recommendations for improvement are proposed.\r\n\r\nThe PHA team findings are promptly and systematically addressed.  Energy Transfer assures that there commendations are documented and resolved in a timely manner. This documentation includes the actions to be taken and a written schedule of completion dates.   The plant also provides proof of communication with operating, maintenance, and other employees whose work assignme"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018376,
      "SummaryText": "nts are in the process and who maybe affected by the recommendations.\r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews will be conducted at least every five years by the PHA team.\r\n\r\nOPERATING PROCEDURES\r\n\r\nThe Elm Grove Dew Point Control Plant maintains written procedures that address various modes of process operations, such as(1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are periodically reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary through the management of change process.\r\n\r\nTRAINING\r\n\r\nTo complement the written process operation procedures, Energy Transfer has implemented a comprehensive training program for all employees. New employees receive job specific basic training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\r\n\r\nHOT WORK PERMIT\r\n\r\nEnergy Transfer issues a hot work permit for all hot work operations conducted on or near a covered process. Energy Transfer provides Hot Work Permit training to all plant employees. Copies of issued work permits are maintained in Operations and Maintenance for a period of 1 year following completion of work.\r\n\r\nCONTRACTORS\r\n\r\nEnergy Transfer periodically uses contractors to perform maintenance or repair, turnaround, major renovations, or specialty work on or adjacent to a covered process"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018376,
      "SummaryText": ".  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) are trained in the work practices necessary to safely perform his/her job, (2) follow the safety rules of the location including the safe work practices, (3) advise the plant of any unique hazards presented by the contractor, and (4) notify the facility of all illnesses and injuries that occur in the process areas.\r\n\r\nPRE-STARTUP SAFETY REVIEWS (PSSRs)\r\n\r\nEnergy Transfer conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an additional check to make sure that construction and equipment are in accordance with design specification, that adequate safety, operating, maintenance, and emergency procedures are in place, and that training of each employee involved in operating the process or equipment has been completed. A standard checklist is used to document compliance.\r\n\r\nMECHANICAL INTEGRITY\r\n\r\nEnergy Transfer has well-established programs, procedures and practices that are required to ensure that equipment used to process, store, or handle lightly hazardous chemicals and/or flammable gas or liquid is designed,constructed, installed, and maintained to minimize the risk of a release. Equipment examples include vessels,storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e., monitoring devices, sensors, alarms, and interlocks).\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employee's job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000018376,
      "SummaryText": "ollows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected before further use or in a safe and timely manner when necessary means aretaken to ensure safe operation.\r\n\r\nMANAGEMENT OF CHANGE\r\n\r\nEnergy Transfer has a comprehensive system to manage and document changes to all covered processes. A systematic approach is followed to control and manage facility changes in order to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment, or the environment. Employees involved in process operations and maintenance and contract employees whose job tasks might be affected by process changes are informed of and trained in the change prior to process start-up.\r\n\r\nINCIDENT INVESTIGATION\r\n\r\nEnergy Transfer promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendationis documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.\r\n\r\nEMERGENCY PLANNING AND RESPONSE\r\n\r\nEnergy Transfer retains a written emergency response plan  which includes the designated actions the company and all personnel will take to ensure personal safety from  fire and other emergencies.  The plan outlines actions that company technicians and contract employees are to take when there is an unwanted release of highly hazardous chemicals.  The int"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000018376,
      "SummaryText": "ent of this plan is to facilitate the prompt evacuation of employees when necessary and to account for all personnel.\r\n\r\nCOMPLIANCE AUDITS\r\n\r\nTo help ensure that the accident prevention program is properly functioning, Energy Transfer periodically conducts an audit to determine whether the procedures and practices required by the accident prevention programare being implemented.  The audit team includes those knowledgeable in the process, operations personnel,and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions are tracked until they are complete.  The final resolution of each finding is documented,and the two most recent audit reports are retained.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nEnergy Transfer is committed to operating the Elm Grove Dew Point Control Plant in a safe manner for workers, the public, and the environment.  Energy Transfer personnel have an opportunity to make suggestions that could improve the safety of this facility during monthly regional safety meetings.  Energy Transfer will also conduct compliance audits and hazard reviews as required and make improvements to safety based on findings of the audits and reviews."
    }
  ]
}