{
  "FacilityID": 1000079884,
  "FacilityName": "Super High Activity Catalyst (SHAC) Plant",
  "FacilityStr1": "16122 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Norco",
  "FacilityState": "LA",
  "FacilityZipCode": "70079",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22089",
  "LEPC": "St. Charles Parish LEPC",
  "FacilityLatDecDegs": "30.002255",
  "FacilityLongDecDegs": "-90.425011",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.grace.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79414149,
  "ParentCompanyName": "W.R. Grace & Co. - Conn.",
  "Company2Name": "W.R. Grace & Co.",
  "CompanyDUNS": 1367846,
  "Company2DUNS": 1367846,
  "OperatorName": "W.R Grace & Co. - Conn.",
  "OperatorStr1": "7500 Grace Drive",
  "OperatorStr2": null,
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21044",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": "70079CYPRS16122",
  "EPAFacilityID": "100000139824",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2520-00064-11",
  "SafetyInspectionDate": "2018-03-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.002417,
  "FRS_Long": -90.4235,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099722,
      "AltID": "Catalyst Production",
      "FacilityID": 1000079884,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124943,
          "ProcessID": 1000099722,
          "ChemicalID": 51,
          "Quantity": 948155.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000124942,
          "ProcessID": 1000099722,
          "ChemicalID": 115,
          "Quantity": 440000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000100964,
          "ProcessID": 1000099722,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084364,
              "Process_NAICS_ID": 1000100964,
              "SafetyReviewDate": "2019-05-20 00:00:00",
              "PHA_Date": "2019-06-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-06-05 00:00:00",
              "TrainingReviewDate": "2018-07-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-05-30 00:00:00",
              "EquipmentInspectionDate": "2019-05-30 00:00:00",
              "EquipmentTested": "Storage tank",
              "ChangeMgmtDate": "2019-05-30 00:00:00",
              "ChangeMgmtReviewDate": "2019-05-30 00:00:00",
              "PreStartupReviewDate": "2019-05-28 00:00:00",
              "ComplianceAuditDate": "2018-10-01 00:00:00",
              "AuditCompletionDate": "2018-11-30 00:00:00",
              "IncidentInvestigationDate": "2019-05-28 00:00:00",
              "InvestigationChangeDate": "2019-06-05 00:00:00",
              "ParticipationPlansReviewDate": "2018-06-06 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-27 00:00:00",
              "ContractorSafetyReviewDate": "2019-04-30 00:00:00",
              "ContractorSafetyEvalDate": "2018-10-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105112,
                  "PreventionProgram3ID": 1000084364,
                  "ProcessChemicalID": 1000124943
                },
                {
                  "PrimaryKey": 1000105111,
                  "PreventionProgram3ID": 1000084364,
                  "ProcessChemicalID": 1000124942
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000079884,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-09-06 00:00:00",
    "ERTrainingDate": "2019-05-15 00:00:00",
    "CoordinatingAgencyName": "St. Charles Parish Dept. HS & EP",
    "CoordinatingAgencyPhone": "9857835050",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000079884,
      "SummaryText": "d the community.\r\n\r\n6. Planned Changes to Improve Safety\r\nOn-going programs, such as process hazard analysis reevaluations, continually aim to improve process safety. The following is a list of specific improvements that we are planning to implement at the Norco SHAC Plant to help prevent and/or better respond to accidental chemical releases:\r\n-Conduct periodic process hazard analyses for all processes and implement resulting recommendations for improvements to safety equipment and procedures.\r\n-Conduct New Leader Reviews so that newly assigned production leaders have all of the process safety and reactive chemicals information necessary for their new jobs.\r\n-All new projects are designed around principles of inherent safety so that process safety is integrated directly into the design.\r\n-Changes to new or revised systems seek to minimize the quantities of hazardous materials.\r\n-Improve Lock-out Tag-out program with new software and utilizing locks instead of hard hasp tags."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079884,
      "SummaryText": "ear period that met the reporting criteria under the RMP rule.\r\n\r\n5. Emergency Response Plan\r\nGrace's SHAC Plant maintains a written emergency response plan to protect worker and public safety as well as the environment. The plan consists of procedures for responding to releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response including:\r\n*Proper first aid and medical treatment for exposures\r\n*Evacuation plans and accounting for personnel after an evacuation\r\n*Post incident cleanup and decontamination requirements, and\r\n*Inspecting, testing, maintaining, and using emergency response equipment.\r\nThe emergency response plan is updated when necessary based on modifications made to facility processes.\r\n\r\nThe SHAC Plant is located within the Momentive Chemical Site Facility, on land owned by Shell Chemical LP.  Emergency response for the manufacturing complex, including the SHAC Plant, is provided by Shell.  The Shell Chemical Plant maintains a trained emergency squad to handle fires, explosions, toxic vapor and releases, spills, and medical emergencies. The plant squad trains and drills with local emergency responders to enhance their skills and tactics for responding to an accidental chemical release. Critiques are held on drills and actual events. In addition to the plant emergency squad, St. Charles Parish Emergency Operations Center (EOC) is notified immediately when an incident occurs. The EOC determines the community impact and takes the appropriate action to protect the community. Additional resources are also available through mutual aid organizations if needed.\r\n\r\nThe emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations. Detailed emergency response plans are developed and coordinated with the St. Charles Parish EOC an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079884,
      "SummaryText": "regular basis to determine whether the provisions set out under regulatory rules are being implemented. These audits are carried out at least every 3 years and corrective actions required as a result of the audits are undertaken in a safe and prompt manner. Third party audits are also utilized to provide independent assessment of site regulatory compliance programs.\r\n\r\nIncident Investigation\r\nGrace's SHAC Plant promptly investigates incidents that result in, or could reasonably result in, a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring. Reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nFor Grace's SHAC Plant, process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular. There is a site procedure for Employee Participation and a Plant Safety Committee has been established with monthly meetings.\r\n\r\nContractors\r\nOur company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Grace's SHAC Plant has a strict policy of informing the contractors of known potential hazards related the contractor's work and the facility. Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n4. Five-year Accident History\r\nGrace's SHAC Plant has had an excellent record of preventing accidental releases.  There have been no accidental releases during the previous five-y"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079884,
      "SummaryText": "hin the covered processes. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\r\n\r\nTraining\r\nGrace's SHAC Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three years.\r\n\r\nMechanical Integrity\r\nGrace's SHAC Plant carries out highly documented maintenance checks on facility equipment to ensure proper operations. Equipment examined by these checks include; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nA management of change (MOC) process is in place at Grace's SHAC Plant to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training addressing the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes or to modifications to the facility are conducted as a regular practice at Grace's SHAC Plant. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nGrace's SHAC Plant conducts audits on a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079884,
      "SummaryText": "propylene resin. The site has one RMP-regulated toxic substance - titanium tetrachloride (TiCl4) and one RMP-regulated flammable substance - isopentane.  The maximum inventory present at our facility is 948,155 pounds of TiCl4 and 440,000 pounds of isopentane. Both substances are located within the manufacturing process area and contained in tankage.\r\n\r\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\nOur facility has taken necessary steps to comply with the accidental release prevention requirements set out under the U.S. Environmental Protection Agency's Accidental Release Prevention Program regulations (40 CFR 68). This facility was designed and constructed with reference to various industry codes including: American Petroleum Institute (API), American Society for Mechanical Engineers (ASME), National Fire Protection Association (NFPA), and Good Engineering Practices. The facility is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard ( 29 CFR 1910.119). The facility is also subject to the Emergency Planning and Community Right-to-Know Act (EPCRA) Section 302 notification requirements. The following sections briefly describe the elements of the release prevention program that is in place at the SHAC Plant.\r\n\r\nProcess Safety Information\r\nGrace's SHAC Plant maintains a detailed record of safety information that describes the chemical hazards, process technology, and equipment information. This information is documented, maintained up to date, and available for operating personnel associated with the facility.  \r\n\r\nProcess Hazard Analysis\r\nProcess Hazard Analyses are conducted or revalidated at least every five years to identify major process hazard scenarios and to recommend corrective actions needed to prevent their occurrence.\r\n\r\nOperating Procedures\r\nGrace's SHAC Plant maintains written operating procedures for the purposes of safely conducting activities wit"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079884,
      "SummaryText": "The W.R. Grace & Co. - Conn. (Grace) Super High Activity Catalyst (SHAC) Plant in Norco, LA is proposing to expand its production of catalyst in 2019.  As per the RMP requirements, the facility is required to update and recertify its RMP Plan according to 40 CFR 68.190.  This submittal includes the updated inventory of all applicable substances located at the facility, the revised hazard assessments (including worst-case release and alternative release scenario analyses and their offsite impacts), the updated Program 3 Prevention Program, and the updated five-year accident history.  Below are the brief descriptions of the required elements as specified in 40 CFR 68.155.\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies\r\nThe Grace SHAC Plant in Norco, LA is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training.  It is company and site policy to implement appropriate controls to prevent possible releases of regulated substances.  If such an unforeseeable release does occur, the site has HazWoper trained individuals on site to control and mitigate the effects of releases.   Furthermore, the SHAC Plant is located inside of the Momentive Chemical Site Facility, on land owned by Shell Chemical LP.  Emergency response services for the manufacturing complex, including the SHAC Plant is provided by  Shell.\r\n\r\n2. The Stationary Source and the Regulated Substances Handled\r\nGrace purchased the Norco SHAC Plant from the Dow Chemical Company in December 2013. The facility's primary activity is catalyst manufacturing. The facility's annual capacity is production of 1,000,000 pounds of catalyst. The material produced at this facility is sold to customers in the United States and abroad. The catalyst is used by our customers primarily in the manufacturing of poly"
    }
  ]
}