{
  "FacilityID": 1000032856,
  "FacilityName": "Essential Power Newington, LLC",
  "FacilityStr1": "200 Shattuck Way",
  "FacilityStr2": null,
  "FacilityCity": "Newington",
  "FacilityState": "NH",
  "FacilityZipCode": "03801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Newington LEPC",
  "FacilityLatDecDegs": "43.105000",
  "FacilityLongDecDegs": "-070.806944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Essential Power, LLC",
  "Company2Name": null,
  "CompanyDUNS": 119341845,
  "Company2DUNS": null,
  "OperatorName": "Essential Power Newington, LLC",
  "OperatorStr1": "200 Shattuck Way",
  "OperatorStr2": null,
  "OperatorCity": "Newington",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03801",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180546",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-0058",
  "SafetyInspectionDate": "2011-04-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-04-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-02-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-02-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-02-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 43.103487,
  "FRS_Long": -70.805243,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040106,
      "AltID": "NH3 for NOx Reduction",
      "FacilityID": 1000032856,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048209,
          "ProcessID": 1000040106,
          "ChemicalID": 56,
          "Quantity": 17700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000040507,
          "ProcessID": 1000040106,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000035016,
              "Process_NAICS_ID": 1000040507,
              "SafetyReviewDate": "2012-12-04 00:00:00",
              "PHA_Date": "2013-02-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-04-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "handheld direct reading instruments and ammonia test paper",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Administrative changes",
              "OpProceduresReviewDate": "2012-12-03 00:00:00",
              "TrainingReviewDate": "2011-06-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-03-31 00:00:00",
              "EquipmentInspectionDate": "2011-04-01 00:00:00",
              "EquipmentTested": "Valves, gauges, tanks, deluge system, vaporizer, heaters, blowers, controls, and alarms.",
              "ChangeMgmtDate": "2012-09-25 00:00:00",
              "ChangeMgmtReviewDate": "2012-12-17 00:00:00",
              "PreStartupReviewDate": "2012-11-20 00:00:00",
              "ComplianceAuditDate": "2012-06-26 00:00:00",
              "AuditCompletionDate": "2013-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-05-08 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2012-02-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000041360,
                  "PreventionProgram3ID": 1000035016,
                  "ProcessChemicalID": 1000048209
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000032856,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-03-07 00:00:00",
    "ERTrainingDate": "2011-06-22 00:00:00",
    "CoordinatingAgencyName": "Newington Fire Dept. (LEPC)",
    "CoordinatingAgencyPhone": "6034369441",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000032856,
      "SummaryText": "from the station.  There are two SCR / HRSG systems in the plant, designated as Train 1 and Train 2.  Each SCR / HRSG has its own dedicated anhydrous ammonia storage and supply system.  \r\n\r\nEach of the two ammonia storage and supply systems include a 2,000-gallon horizontal, cylindrical, pressure vessel for storing liquefied anhydrous ammonia.  The vessel is mechanically rated for 265 psig at 170F.  The level in the vessel is administratively controlled to a maximum of 82% capacity, equivalent to 1,715 gallons.  The maximum intended site inventory of ammonia is therefore 3,430 gallons (17,700 pounds) onsite.\r\n\r\nThe ARPP applicability threshold for anhydrous ammonia is 10,000 pounds.  As Newington Energy's anhydrous ammonia storage capacity exceeds this threshold, the facility is subject to the program and is required to prepare and maintain a RMP for this process.  The anhydrous ammonia system at Newington Energy is the only process that stores a substance in greater quantities than the ARPP applicability threshold.\r\n\r\nThis process is subject to Risk Management Program Level 3 because it is subject to OSHA-PSM provisions and it is not eligible for Program Level 1.\r\n\r\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe SCR and HRSG systems were designed and constructed in general accordance with applicable local building and fire codes, as well as industry-consensus codes and standards where appropriate.  Process verification takes place through design audits conducted by trained personnel and/or qualified consultants.  The schedule of such verifications is at least once every three years.\r\n\r\nPreventative maintenance (PM) is an active part of Newington Energy's daily operations.  PM is performed on a schedule in accordance with OSHA-PSM and, in many cases, the process safety equipment PM schedule prescribed by Newington Energy exceeds recommended equipment maintenance schedules.  Pressure vessels, emergency shutdown, contro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000032856,
      "SummaryText": "ls, pumps, and other equipment associated with operating the SCR ammonia system is regularly inspected and tested.  Maintenance activities are completed on the SCR ammonia system components as specified in documents provided by the manufacturer.\r\n\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nWithin the last five years, Newington Energy has not experienced an accident involving the anhydrous ammonia system that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.\r\n\r\nTHE EMERGENCY RESPONSE PROGRAM\r\n\r\nAmmonia has a strong, pungent odor that makes even the smallest of leaks easily detectable by smell.  A medium to large leak of ammonia could be detectable from a safe distance through a visual white cloud escaping from the source leak.  Ammonia handheld direct reading instruments, fixed area monitors, and ammonia test paper are maintained at the facility to aid in the detection of an ammonia release.  The Local Emergency Planning Committee (LEPC, or Newington Fire Department) is trained and equipped to respond to ammonia releases at Newington Energy.  \r\n\r\nNewington Energy has developed an emergency response program contained within its Integrated Contingency Plan (ICP) to minimize the health, safety and environmental impacts from a release of hazardous materials, and to restore the facility to normal operating conditions as quickly as possible.  \r\n\r\nIn addition, to the general emergency response program, a unique emergency response procedure has been developed for response to releases from the SCR system as outlined below.\r\n\r\n o After all personnel move to a location lateral or upwind from the release area, they shall call the CONTROL ROOM and inform the CONTROL ROOM of the location (inside or outside) of the release and wind direction or direction in which the vapors appear to be moving (if known).\r\n\r\n o The CONTROL ROOM shall dispatch the First Responders to the scene.  \r\n\r\n o If it is safe to do so, First Responders shall coordinate with"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000032856,
      "SummaryText": "Executive Summary\r\nEssential Power Newington, LLC \r\n\r\nEXECUTIVE SUMMARY\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT NEWINGTON ENERGY\r\n\r\nIt is Essential Power Newington, LLC's (Newington Energy's) policy to adhere to all applicable federal, State, and local laws.  The anhydrous ammonia system at Newington Energy provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the selective catalytic reduction system (SCR), which is located in line with the heat recovery steam generators (HRSGs).  The SCR system has been designed and operates in compliance with EPA's Accidental Release Prevention rule and applicable State and local codes and regulations.  Newington Energy has qualified engineering, operations, and maintenance personnel knowledgeable in the safe operation of compressed ammonia systems with direct responsibility for the process.  The process is also designed and operated in compliance with the Occupational Safety and Health Administration's Process Safety Management (OSHA-PSM) rule.\r\n\r\nThrough its Risk Management Plan (RMP), Process Safety Management (PSM) Manual, and Emergency Response Action Plan (found in the facility's Integrated Contingency Plan), Newington Energy has emergency response procedures in place that comply with the Accidental Release Prevention Program (ARPP).\r\n\r\nA DESCRIPTION OF YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\r\n\r\nThe Newington Energy facility is a 525 MW natural gas-and oil-fired combined cycle power plant located at 200 Shattuck Way in Newington, NH.  The facility lies approximately 1,000 feet from the Piscataqua River within a mixed industrial/commercial area.  The anhydrous ammonia system provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the SCR / HRSG systems at the facility.  The application of Selective Catalytic NOx Reduction Technology (the process) reduces nitrogen oxide (NOx) air emissions"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000032856,
      "SummaryText": "plant personnel to shut off all CONTROL ROOM and Admin Building ventilation systems to prevent the migration of the ammonia vapors into the building.  \r\n\r\n o Emergency Coordinator shall report to the scene, if necessary, and coordinate with Newington Fire and/or hazardous waste contractor to determine if additional evacuation of the facility and any off-site, downwind locations is necessary. \r\n \r\n o The EHS Responder will evaluate the need for regulatory reporting (if the release exceeds the reportable quantity of 100 pounds or there is an off-site threat) and contact the Emergency Coordinator if regulatory notification is required.\r\n\r\n o Responders shall continually evaluate the need for medical services, rescue operations, and additional evacuation.  \r\n\r\n o After the ammonia release has been controlled and ammonia vapors have dissipated, the Incident Commander shall meet with the Responders to determine that no threat to health or safety exists and then give the all clear signal.\r\n\r\n o After the incident is terminated, the Incident Commander will document response actions and conduct a debriefing/critique of the Anhydrous Ammonia Release ERP.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nAs an outcome of the most recent 3-year audit and the 5-year update of the process hazard analysis, Newington Energy has already or intends to implement the following changes, which are intended to improve safety with respect to the ammonia systems:\r\n\r\n o Update of Ammonia Training Program (2011) and with biannual retraining (2013);\r\n\r\n o Development of a module in GPi by Q3 of 2013 for enhanced employee training tracking and documentation;\r\n\r\n o Modifications to anhydrous ammonia delivery procedure, including:\r\n\r\n         o  Comparison of local level indicator to remote level indicator prior to anhydrous ammonia transfer;\r\n         o  Computation of expected delivery volume;\r\n         o  Clear delineation of ammonia specification requirements prior to transfer; and\r\n         o  Verifi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000032856,
      "SummaryText": "cation of valid hydro-testing date on anhydrous ammonia transfer hoses prior to use;\r\n\r\n o Development and/or Modification of Preventive Maintenance Procedures, including:\r\n\r\n         o  Increased frequency of internal tank inspection from 10 years to 5 years;\r\n         o  New PM to better identify life cycle of truck unloading Emergency Shutoff Valves;\r\n         o  New PM to test water deluge system located at anhydrous ammonia storage tanks;\r\n         o  Added random ultrasonic thickness scans to existing 3-year PM inspections of ammonia equipment;\r\n         o  Added 100% fluorescent wet magnetic particle examination of longitudinal and circumferential \r\n            welds during 5-year internal tank inspection PM;\r\n         o  Semi-annual PM to check water content in each anhydrous ammonia storage tank;\r\n         o  Semi-annual PM to exercise dual relief valve isolation valve;\r\n         o  Added tank saddle support area inspections to 5-year internal tank inspection PM;\r\n         o  Added 100% QC check of NPT thread quality prior to installation of threaded components in \r\n            ammonia service;\r\n         o  Added flange connection inspections with an ammonia vapor monitor to 3-year PM inspections;\r\n\r\n o Addition of a second redundant location for Emergency Shutoff Valve manual actuator for use during anhydrous ammonia truck unloading;\r\n\r\n o Addition of local ammonia leak detection devices (3) at the anhydrous ammonia storage tanks which are continuously monitored by DCS in the control room (complete 1Q-2013);\r\n\r\n o Extension of  anhydrous ammonia tank relief valve discharges above roof line to improve vapor dispersion capability in the event of a relief valve lifting;\r\n\r\n o Addition of a fixed fire water monitor in the vicinity of the anhydrous storage tanks to help emergency response personnel knock down a vapor cloud in the event of a release (complete 1Q-2013);\r\n\r\n o Addition of structural steel roof above the anhydrous ammonia / dilution air blower skid"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000032856,
      "SummaryText": "s to protect them from inclement weather and ice from HRSG roofs;\r\n\r\n o Modification of anhydrous ammonia storage tank piping to eliminate 2  unions and replaced with ANSI flanges.\r\n\r\n         o  Added flange connection inspections with an ammonia vapor monitor to 3-year PM inspections;"
    }
  ]
}