{
  "FacilityID": 1000077174,
  "FacilityName": "CHARLES HAMMAN WATER TREATMENT PLANT",
  "FacilityStr1": "1500 MANVILLE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "WOONSOCKET",
  "FacilityState": "RI",
  "FacilityZipCode": "02895",
  "Facility4DigitZipExt": "6623",
  "FacilityCountyFIPS": "44007",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "41.984722",
  "FacilityLongDecDegs": "-071.491111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ci.woonsocket.ri.us/water.htm",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 54399382,
  "ParentCompanyName": "CITY OF WOONSOCKET, RI",
  "Company2Name": null,
  "CompanyDUNS": 62308804,
  "Company2DUNS": null,
  "OperatorName": "Steve Wold",
  "OperatorStr1": "1500 Manville Rd.",
  "OperatorStr2": "PO BOX B",
  "OperatorCity": "WOONSOCKET",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02895",
  "OperatorZipCodeExt": "4379",
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059526",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-03-25 12:49:12",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-25 12:49:12",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-03-25 12:49:12",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-11-12 00:00:00",
  "DeRegistrationEffectiveDate": "2021-10-08 00:00:00",
  "AnniversaryDate": "2024-03-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.984278,
  "FRS_Long": -71.489917,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096031,
      "AltID": "DISINFECTION",
      "FacilityID": 1000077174,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120256,
          "ProcessID": 1000096031,
          "ChemicalID": 62,
          "Quantity": 4500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097314,
          "ProcessID": 1000096031,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000081823,
              "Process_NAICS_ID": 1000097314,
              "SafetyReviewDate": "2019-03-24 00:00:00",
              "PHA_Date": "2019-03-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-05-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-03-24 00:00:00",
              "TrainingReviewDate": "2019-03-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-03-24 00:00:00",
              "EquipmentInspectionDate": "2019-02-21 00:00:00",
              "EquipmentTested": "Critical Chlorination System Components",
              "ChangeMgmtDate": "2019-02-21 00:00:00",
              "ChangeMgmtReviewDate": "2019-03-24 00:00:00",
              "PreStartupReviewDate": "2019-03-24 00:00:00",
              "ComplianceAuditDate": "2019-03-24 00:00:00",
              "AuditCompletionDate": "2019-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-03-24 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-24 00:00:00",
              "ContractorSafetyReviewDate": "2019-03-24 00:00:00",
              "ContractorSafetyEvalDate": "2019-03-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000101653,
                  "PreventionProgram3ID": 1000081823,
                  "ProcessChemicalID": 1000120256
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077174,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-03-24 00:00:00",
    "ERTrainingDate": "2019-03-14 00:00:00",
    "CoordinatingAgencyName": "WOONSOCKET FIRE DEPT",
    "CoordinatingAgencyPhone": "4017652500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077174,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n\r\nFacility Description\r\n\r\nThe Woonsocket Water Division (WWD) of the Woonsocket Department of Public Works is a Rhode Island Public Utilities Commission regulated public utility registered with the Department of Health as Public Water System number 1559518.  WWD serves a population of 42,000 and local industry.   On December 31, 2018, WWD contracted with SUEZ to operate the water treatment plant which provides drinking water to the following service area: City of Woonsocket, Rhode Island as well as parts of the towns of North Smithfield, Rhode Island; Cumberland, Rhode Island; Blackstone, Massachusetts; and Bellingham, Massachusetts. The average demand is approximately 3.5 million gallons per day (mgd).   \r\n\r\nRegulated Substances and Associated Hazards\r\n\r\nThis Risk Management Program document has been prepared to meet the requirements of the EPA Risk Management Program regulations as stated in 40 CFR Part 68 and OSHA's 29 CFR 1910.119 Process Safety Management (PSM) Standard.\r\n\r\nChlorine Gas (CAS #7782-50-5) in 150-lb cylinders is the only chemical in use at the water plant in sufficient amounts to be covered by both the Risk Management Program (RMP) regulations and OSHA's PSM regulation.  Chlorine is a heavier than air gas that may be fatal if inhaled.  In lesser quantities it causes respiratory distress and may burn skin and eyes.  The substance is highly reactive and will readily mix with other substances causing further hazards.  In the presence of moisture, chlorine becomes highly corrosive.  A concentration of 30 parts per million causes coughing, 40 to 60 parts per million is dangerous within thirty minutes of exposure, and at one thousand parts per million is apt to be fatal in a few breaths.\r\n\r\nPrevention and Emergency Response Policies\r\n\r\nThe Woonsocket Water Division (WWD) and SUEZ are committed to being responsible members of the community by giving top priority to operating in a safe and environmentally sound manner.  WWD and SUEZ i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077174,
      "SummaryText": "ntend to continuously identify methods to reduce the use of hazardous materials and to reduce the risk to the community and environment through implementation of inherently safer technology and procedures.  WWD and SUEZ safety and environmental programs include training and licensing for all treatment plant operators and active relationships with the Woonsocket Fire Department hazardous materials team and the local LEPC.  WWD maintains an Emergency Response Plan that covers toxic releases as well as water supply concerns. \r\n\r\nSUEZ has scheduled an annual meeting with the local fire dept. to review response roles and responsibilities and planning functions.  \r\n\r\nAccidental Release Prevention Program\r\n\r\nWWD and SUEZ are committed to preventing accidental releases of chlorine gas. The primary elements of our program are as follows:\r\n1) EMPLOYEE PARTICIPATION: SUEZ solicits the input from all employees when developing or revising any aspect of the RMP/PSM Plan.\r\n2) PROCESS SAFETY INFORMATION: SUEZ has accumulated various Process Safety Information to be used during the Process Hazard Analysis (PHA)\r\n3) PROCESS HAZARD ANALYSIS (PHA): SUEZ has conducted a Process Hazard Analysis during the first 60 days of its Operation for the purpose of identifying any opportunities for improvement (OFIs) in safety. These OFIs have been placed in an Action Plan for tracking until resolved.\r\n4) STANDARD OPERATING PROCEDURES:  SUEZ has revised its Standard Operating Procedures (SOPs) to include safe handling of chlorine gas cylinders and associated equipment. These procedures are based on recommended industry practice and adapted to be specific to our facility.\r\n5) EMPLOYEE TRAINING: SUEZ recognizes the most important part of any accident prevention program is the facility's employees. All employees are Certified Water Treatment Operators licensed by the State of Rhode Island for operation of water  facilities. These licenses have continuing education requirements in order to be kept curr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077174,
      "SummaryText": "ement Plan, WWD has replaced vital chlorinator components, replaced our detection system and alarmed it directly to the fire department We have also installed automatic shut off devices to our system. In addition we have installed internal and perimeter security systems to protect against sabotage and outside access to our facilities.\r\n\r\nIn early 2019, SUEZ is coordinating the replacement of the Chlorinators and the Gas Detection Meter as well as all annual maintenance on the vacuum regulators, whips, and yoke valves.  SUEZ is also coordinating the re-building and re-certifying of all automatic shut-off actuators.  \r\n\r\nThe City of Woonsocket is also in the process of constructing a new water treatment facility which will employ an alternate disinfectant to chlorine gas. This will allow WWD to discontinue the use of Chlorine gas."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077174,
      "SummaryText": "ent. In addition SUEZ manages an internal training program specific to its standard operating, maintenance, and emergency response procedures.\r\n6) CONTRACTOR SAFETY: SUEZ uses various procedures to make sure any Contractor working on chlorination system components is competent to do so.  Additional procedures include the use of a Contractor Pre-Qualification Process, Contractor Orientation Program, Verification of Contractor Notification Form, and Project Review Form prior to a Contractor performing any work on this system\r\n7) PRE-STARTUP SAFETY REVIEW: SUEZ uses a Pre-Startup Checklist whenever maintenance has been performed on the chlorination system prior to placing the system back in service.\r\n8) MECHANICAL INTEGRITY [MAINTENANCE MANAGEMENT]: SUEZ maintains and implements an aggressive Preventive Maintenance Program. This program consists of routine equipment inspections for signs of corrosion and equipment wear and failure. During these inspections alarms and detection and automated shutdown systems are tested to ensure they are functional. In addition once per year an inspection and annual service is performed by external experts in the maintenance and repair of chlorine systems.  WWD and SUEZ also replaces critical system components as technology changes and  prior to the  end of their lifecycle.\r\n9) HOT WORK MANAGEMENT: SUEZ uses a Hot Work Policy and Hot Work Permit if there's a need to perform any hot work in or around the chlorination system.  SUEZ uses a Fire Prevention Plan to identify any potential ignition source and prevent fires.\r\n10) MANAGEMENT OF CHANGE (MOC): SUEZ uses a collaborative MOC process whenever a significant change is anticipated with the chlorination system.  The purpose of this process is to identify any risk anticipated by the change and develop controls to mitigate issue\r\n11) INCIDENT REPORTING and INVESTIGATIONS: SUEZ uses a formal Incident Reporting SOP to report any releases or personnel injury caused by the chlorination proce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077174,
      "SummaryText": "ss.\r\n12) EMERGENCY PLANNING: SUEZ uses a written Emergency Action Plan to identify any actions required in the event of an uncontrolled release.\r\n13) COMPLIANCE AUDITS: SUEZ uses a formal Compliance Audit to double check that all required information is contained in the RMP/PSM Plan and that various compliance dates are scheduled within a computerized scheduling system to ensure sustainable compliance  \r\n\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nN/A\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe WWD and SUEZ have developed an emergency response program (ERP) to minimize the effects of various emergency situations on employees, the public, and the environment.  The ERP includes a list of telephone numbers of agencies and individuals to contact in the event of one of several pre-identified situations (e.g., fire, dam failure, storage tank failure, or chlorine release).  The agencies and individuals represent local emergency responders (e.g., fire department), public notification and regulatory reporting requirements (e.g., DEM, DOH, LEPC1), and internal notification (e.g., Public Works / Administration). \r\n\r\nWWD and SUEZ have integrated this ERP with the Woonsocket Fire Department hazardous materials personnel to ensure that an appropriate response can be made in the improbable event of a major release. In addition the chlorination system has detection equipment that is alarmed directly to the Woonsocket Fire Department that notifies them immediately of any release.\r\n\r\nSUEZ has instructed its employees not to respond to an uncontrolled lead but to allow the trained fire dept. responders to respond.  The Woonsocket Fire Dept is equipped with SCBAs and an A Repair Kit.  Class III licensed drinking water operators employed by SUEZ are trained to initiate emergency notification procedures in the event of a chlorine releases.  There is at least one such person on site 24 hours a day, 365 days a year.\r\n\r\nPLANNED CHANGES to IMPROVE SAFETY\r\n\r\nSince the submission of WWD's original Risk Manag"
    }
  ]
}