{
  "FacilityID": 1000009290,
  "FacilityName": "MeadWestvaco Virginia Corp-Wickliffe Carbon Plant",
  "FacilityStr1": "2025 Beech Grove Road",
  "FacilityStr2": null,
  "FacilityCity": "Wickliffe",
  "FacilityState": "KY",
  "FacilityZipCode": "42087",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21007",
  "LEPC": "Ballard County LEPC",
  "FacilityLatDecDegs": "36.950000",
  "FacilityLongDecDegs": "-089.066111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.meadwestvaco.com",
  "FacilityEmailAddress": "wickCDP@meadwestvaco.com",
  "FacilityDUNS": 2553860,
  "ParentCompanyName": "MeadWestvaco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 102235004,
  "Company2DUNS": null,
  "OperatorName": "MeadWestvaco Corporation",
  "OperatorStr1": "11013 West Broad Street",
  "OperatorStr2": null,
  "OperatorCity": "Glen Allen",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23060",
  "OperatorZipCodeExt": null,
  "FTE": 59,
  "OtherEPAFacilityID": "KYR000009266",
  "EPAFacilityID": "100000097753",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "V-99-009",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-07-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-06-20 00:00:00",
  "DeRegistrationEffectiveDate": "2016-05-23 00:00:00",
  "AnniversaryDate": "2014-07-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.95,
  "FRS_Long": -89.066111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010884,
      "AltID": "Catalyst Process",
      "FacilityID": 1000009290,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012403,
          "ProcessID": 1000010884,
          "ChemicalID": 56,
          "Quantity": 52800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000011265,
          "ProcessID": 1000010884,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000008881,
              "Process_NAICS_ID": 1000011265,
              "SafetyReviewDate": "2008-11-17 00:00:00",
              "PHA_Date": "2007-10-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-09-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-10-06 00:00:00",
              "TrainingReviewDate": "2008-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-02 00:00:00",
              "EquipmentInspectionDate": "2009-06-27 00:00:00",
              "EquipmentTested": "Catalyst cooling screw inspection",
              "ChangeMgmtDate": "2008-02-28 00:00:00",
              "ChangeMgmtReviewDate": "2008-08-12 00:00:00",
              "PreStartupReviewDate": "2009-06-03 00:00:00",
              "ComplianceAuditDate": "2007-10-24 00:00:00",
              "AuditCompletionDate": "2008-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-07-28 00:00:00",
              "HotWorkPermitReviewDate": "2008-09-24 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-30 00:00:00",
              "ContractorSafetyEvalDate": "2008-03-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000010301,
                  "PreventionProgram3ID": 1000008881,
                  "ProcessChemicalID": 1000012403
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000009290,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-11-13 00:00:00",
    "ERTrainingDate": "2009-03-24 00:00:00",
    "CoordinatingAgencyName": "Ballard Co. LEPC",
    "CoordinatingAgencyPhone": "2706659928",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000009290,
      "SummaryText": "ersonnel are the key ingredients of this plan. MeadWestvaco policy provides for external communications with local and county-wide response agencies. \n\nThe MeadWestvaco Specialty Chemicals in Wickliffe, Kentucky has in place plans to protect operational integrity, the safety of its workers, and the safety of the surrounding community. The provisions of the Emergency Preparedness Plan for the Carbon Plant address chemical releases as well as a wide range of natural and man-made event, including fire, explosion, utility failures, earthquakes and extreme meteorological events. Procedures are in place to classify events to expedite effective emergency shutdown. \n\nThe Wickliffe Carbon Plant utilizes early detection monitors to notify plant personnel of possible ammonia releases. This, coupled with a fully trained Hazardous Materials Response Team (employees on all shifts trained to the technician level), ensure that emergency situations regarding ammonia are handled quickly and professionally. Emergency response is coordinated by members of the shift who are trained Incident Commanders. If outside response agencies are needed, they are notified via the Ballard County dispatcher. Provisions for making this notification are located in the plant's Emergency Response Procedures. \n\n7.0 PLANNED CHANGES TO IMPROVE SAFETY \nMeadWestvaco Virginia Corporation - Wickliffe Carbon Plant, under the RMP program, as well as its existing PSM and earlier Superfund Amendments and Reauthorization Act (SARA) Title III Community Right-to-Know Act compliance programs, has organized its management system to effectively address all hazards and potential risks. Continual improvement in facility safety is supported by both the advanced planning aspects of process design, operating procedures, emergency preparedness, and the operational elements of system maintenance, safe operating practices and ongoing personnel training.  These programs are all documented so that needed information about the safe"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000009290,
      "SummaryText": "handling of all chemicals present at the facility is continuously available to employees, and can be readily interpreted by emergency response team staff and the Site Emergency Coordinator when questions arise from public safety officials on potential risks to the community.  All of these features of the RMP and the integrated risk management program at this site lead to operations that are safe today, but will be even safer tomorrow."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009290,
      "SummaryText": "RISK MANAGEMENT PLAN PURSUANT TO 40 CFR PART 68(G)\nJune 2009 Revalidation and Submission\n\nMeadWestvaco Virginia Corporation\nWickliffe Carbon Plant\nWickliffe, Kentucky\n\n\nINTRODUCTION\nMeadWestvaco Virginia Corporation, owns and operates a plant that manufactures activated carbon in Wickliffe, Kentucky, which is subject to U.S. Environmental Protection Agency (EPA) regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112Â® of the Clean Air Act (40 CFR Part 68). This Risk Management Plan (RMPlan) has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G. The RMPlan certifies that MeadWestvaco Virginia Corporation - Wickliffe Carbon Plant has instituted a Risk Management Program at the Wickliffe, Kentucky, facility that is in compliance with U.S. EPA ARP requirements. \n\nThe RMPlan includes an Executive Summary and Data Elements. This document identifies the applicable corporate policies and risk management systems, including comprehensive accident prevention and emergency response programs. In addition, this RMPlan identifies a set of worst case and alterative release scenarios, the potential off-site consequences of those releases, and the facility's five year accidental release history. This RMPlan certifies that prevention and emergency response programs are in place so as to minimize risks to workers and the potentially affected public. \n\n1.0 ACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES\n\n1.1 Control of Hazardous Materials \nMeadWestvaco strives to conduct its business in strict conformity with all applicable laws and in a safe and responsible manner and has always placed the very highest priority on the safety and health of its employees and members of the communities in which it operates. \n\nThe management at the Wickliffe Carbon Plant, by utilizing effective process safety management is knowledgeable on a current basis as to materials which are present and aware of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009290,
      "SummaryText": "the possible risk associated with their handling, storage, use, discharge, spill, disposal, or release. Material Safety Data Sheets (MSDS) are maintained as required and reviewed on a current basis. \n\nThe Wickliffe Carbon Plant is designed, constructed, inspected, maintained and operated in a manner so as to minimize the risk of exposure to employees and the public at large to hazardous materials and in conformity with all governmental regulations and corporate guidelines. The facility maintains inspection records and up-to-date procedures to ensure that control of hazardous materials is maintained at all times. The procedures include provisions for the periodic testing, review, and update of the emergency response programs. Changes in protective technology are monitored, and when found to be more effective, the need for change is promptly considered. In addition, at a minimum of every three years, the facility will undergo a comprehensive process safety management compliance review. \n\nThe functions of environmental protection, property conservation and safety and health are to be coordinated so that the most effective and practical protection of employees, public and environment from hazardous materials is achieved and regulatory reporting requirements are met. \n\nAll employees are trained and periodically retrained in a manner appropriate to their possible exposure to materials which are considered hazardous. This includes methods for detection of the presence or release of hazardous materials, the physical and health hazards of the materials, and methods for protecting themselves and co-workers. The information provided by MSDSs is reviewed with employees on a regular basis. \n\nThe Wickliffe Carbon Plant coordinates its safety and emergency response program with local community emergency response officials to facilitate safe, effective, and swift response to emergencies in the workplace. This includes forthrightly disclosing to the community, through its emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009290,
      "SummaryText": "response officials, facts regarding the hazards and risks in operating the facilities, the prevention techniques in place, and assistance in devising the most appropriate and effective protection plans for the community and the plant. \n\nThe Wickliffe Carbon Plant promptly investigates, corrects, and reports in writing to the Division President and the Corporate Safety, Health and Environmental Group all incidents involving hazardous materials having caused, or having the potential for causing, injury or loss. \n\nClear understanding and careful observance of this policy throughout the organization is of great importance to MeadWestvaco, its employees, and the public. While line management has the primary responsibility for providing safe conditions and for creating a climate in which the whole organization shares in the concern for both employee and community safety and health, each member of the organization plays a key role in assuring success. \n\n1.2 Emergency Response Coordination with the NewPage Paper Company\nMeadWestvaco is adjacent to NewPage Paper Company, a pulp and paper mill previously owned by the same parent company. The two facilities are located on adjacent properties separated by a rail line.  Each facility has greater than threshold amounts of substances regulated under 40 CFR Part 68 promulgated under Section 112Â® of the Clean Air Act.  A separate Risk Management Plan (RMPlan) is submitted for each facility, because each has an independent risk management program and are independent business entities. However, the two facilities share information on hazardous chemicals and coordinate their emergency response plans via a mutual aid agreement. Thus, the MeadWestvaco Specialty Chemicals Division facility has a program in place to notify the neighboring NewPage Paper Company in the event of an accidental release. \n\n1.3 Risk Management System \nThe Wickliffe Carbon Plant has developed a management system to implement and maintain compliance with the Accid"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009290,
      "SummaryText": "ental Release Prevention (ARP) and related chemical safety and emergency response programs. This management system identifies lines of responsibility for the entire program and each of its key elements. \n\n2.0 PROCESS AND SUBSTANCE SUBJECT TO 40 CFR PART 68 \nThe Wickliffe Carbon Plant produces activated carbon from saw dust. Activated carbon is a microcrystalline form of carbon with internal porosity and a large specific surface area. This carbon is typically used for the purification of gas and liquid streams. Activated carbon is used widely in industrial processes for the recovery and recycling of volatile organic compounds, and can also be used as a purifying filter for breathing air. All automobiles produced in the U.S. since the early 1970s and most foreign-built automobiles are equipped with an emissions control system which utilizes activated carbon to adsorb gasoline emissions. These emissions would otherwise be released to the atmosphere and contribute to the formation of ozone, a health hazard.  Activated carbon is also used in the treatment of drinking water to remove toxic and other organic material. \n\nAs with most production processes, the activated carbon production process uses several different chemicals. One of these chemicals is anhydrous ammonia, a chemical most commonly used on crops to provide nitrogen for plant growth. Anhydrous ammonia is a colorless liquid or gas which is readily detectable by its extremely pungent odor. In sufficient concentrations, anhydrous ammonia is an eye, skin, and/or inhalation irritant. For this reason, anhydrous ammonia is regulated under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standard at 29 CFR Part 1910.119 and the EPA risk management rule at 40 CFR Part 68. \n\nAnhydrous ammonia is delivered to the site via tank truck and stored in a diked above-ground tank with a nominal 12,000 gallon (62,040 Ib) capacity. For ammonia processes, the threshold quantity for coverage u"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000009290,
      "SummaryText": "nder 40 CFR Part 68 is 10,000 lb. Figure 2-1 provides the layout of the MeadWestvaco Specialty Chemicals Division facility, with the storage area for the regulated process and the on-site transport route highlighted. Once the tank truck is in the unloading area, MeadWestvaco staff isolate the area from vehicular traffic and unlock the ammonia valves at the unloading station. A MeadWestvaco employee provides surveillance of the entire transfer operation from a safe distance. Emergency shut-off valves can be activated remotely in the event of a spill or hose rupture. \n\nThe EPA Risk Management Regulation identifies three levels of requirements for industrial processes. Program 1 can be applied to any process which has not had a significant release of a regulated substance over the five year period prior to the June 1999 compliance date and for which the worst-case release does not affect public I receptors (e.g., residences, parks and recreation areas, commercial/industrial facility, hospitals). Program 2 applies to any process that is ineligible for Program 1 and is not subject to Program 3. Program 3 applies to all processes, such as those present at the MeadWestvaco Carbon Plant, that are subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM), with which the facility is in compliance. The MeadWestvaco Accidental Release Prevention Program elements are adopted directly from the compliance program for the PSM standard, consistent with the Level 3 RMP Program requirements for this MeadWestvaco facility under 40 CFR Part 68. Program 3 related information is included in the Data Elements section of the RMPlan. \n\n3.0 RELEASE SCENARIOS \nFor the purposes of developing and maintaining adequate RMPlan's, the EPA has defined in its governing rules and guidance a series of modeling methods and assumptions which are to be utilized as administrative guides for planning purposes. In order to standardize and simplify to a pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000009290,
      "SummaryText": "actical level the many factors that can potentially occur in an accidental release situation, some of these assumptions may not take into account the available preventive measures or mitigation methods that would diminish or even eliminate the implied risks that are suggested by worst-case analyses. For that reason, both the results for the standardized worst-case defined by the EPA methods and an alternative case, which is believed by MeadWestvaco to more realistically represent situations that may possibly, but rarely, occur within the lifetime of the facility, are presented and described. The actual incident history for this facility over the last five years has been reviewed. No accident has resulted in reportable on-site injury, off-site injury, emergency response, or damage to property or the environment. \n\nHowever, to ensure that mitigation measures and emergency response plans are appropriate, potential release scenarios are considered. Thus, the sections of the RMPlan which discuss both the worst case and the alternative case, believed to be somewhat more probable, are meant to provide the data necessary to develop and evaluate possible improvements in the overall safety provided by the programs which constitute the MeadWestvaco ARP program. \n\n4.0 ACCIDENT PREVENTION \nThe process subject to the Risk Management Regulation is also subject to the OSHA PSM Standard with which the MeadWestvaco Specialty Chemicals Division facility is in compliance. PSM governs the same process and regulated substance at the site that is subject to 40 CFR Part 68. As such, because MeadWestvaco Specialty Chemicals Division has complied with PSM, it is also in compliance with the Prevention Program requirements of 40 CFR Part 68.  MeadWestvaco has in-place specific operational programs to address PSM/RMP Prevention Program requirements. Descriptions of the following programs reside on-site at the Carbon Plant. \n\nÂ¿Preventive Maintenance Program \nÂ¿Tank Integrity Program\nÂ¿Regul"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000009290,
      "SummaryText": "ar Process Hazards Analysis (HAZOP Studies) \nÂ¿Pre-Startup Safety Checks for Changes as Part of Management of Change Program \nÂ¿Incident Review, Diagnosis and Correction (to Prevent Recurrence) \nÂ¿Written Operating Procedures \nÂ¿Operator Training and Qualification Program \n\n5.0 FIVE-YEAR ACCIDENT HISTORY \nIn conjunction with the current ARP and PSM programs in place at the MeadWestvaco Specialty Chemicals facilities, there is a standard management practice that requires immediate internal reporting of unusual events, including those in which any abnormal emission of regulated chemicals is observed or suspected. The incident information is reviewed by supervisory staff and a determination is made as to whether a reportable quantity on any chemical listed as requiring reports to regulatory authorities is involved. If so, the appropriate authorities are promptly notified. \n\nSince the facility has been in operation (June 1997) and since the implementation of the initial Risk Management Plan (June 1999) and revalidation in 2004, there have been no accidents or incidents involving any RMP regulated substance that qualifies for reporting under 40 CFR Part 68. This means that no accident has resulted in reportable on-site injury, off-site injury, off-site evacuation or sheltering in place, or damage to property or the environment. \n\n6.0 EMERGENCY RESPONSE PROGRAM \nIt is the policy of the MeadWestvaco Specialty Chemicals Division and Carbon Plant to place the highest priority on employee safety and health, and on protection of the community for all plant-induced environmental conditions. Emergency response plans have been developed to provide protection by providing prompt action to control an emergency, minimize the amount of released material, and lessen or eliminate the hazards to employees and the community. Proper planning and an organized approach will reduce the effects of emergency events. Prompt internal and external communications, emergency equipment and trained p"
    }
  ]
}