{
  "FacilityID": 1000084110,
  "FacilityName": "George F. French Water Reclamation Facility",
  "FacilityStr1": "14 Industrial Park Lane",
  "FacilityStr2": null,
  "FacilityCity": "Destin",
  "FacilityState": "FL",
  "FacilityZipCode": "32541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12091",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.393056",
  "FacilityLongDecDegs": "-086.445000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "PU",
  "FacilityURL": "dwuinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71946867,
  "ParentCompanyName": null,
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lockwood Wernet",
  "OperatorStr1": "218 Main St.",
  "OperatorStr2": null,
  "OperatorCity": "Destin",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lockwood Wernet",
  "RMPTitle": "General Manager",
  "FTE": 46,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000016378",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-23 00:00:00",
  "SafetyInspectionBy": "Destin Fire Control District",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-12-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-12-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-12-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-12-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.39306,
  "FRS_Long": -86.47833,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105055,
      "AltID": "Chlorine",
      "FacilityID": 1000084110,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106388,
          "ProcessID": 1000105055,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        },
        {
          "Process_NAICS_ID": 1000106389,
          "ProcessID": 1000105055,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131532,
          "ProcessID": 1000105055,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631532,
          "ProcessID": 1000105055,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084110,
      "SummaryText": "EXECUTIVE SUMMARY\n\nGEORGE F. FRENCH WATER RECLAMATION FACILITY\n\nDESTIN, FL 32541 \n\n\n\nIn accordance with 40 CFR 68, Destin Water Users, Inc. has developed a Risk Management Program for the George F. French Reclamation Facility (WRF).  Destin Water Users, Inc. is the owner and operator of the WRF which includes a stationary source (storage facility) for chlorine.  Chlorine is a regulated substance that is stored at the WRF in excess of the threshold quantity of 2,500 pounds.  The chlorine stored at the WRF is used to disinfect the effluent and reclaimed water produced at the WRF.  The chlorine storage facility also stores chlorine used for the disinfection of water at wells owned by Destin Water Users, Inc.  The Destin Water Users, Inc. WRF is a Program 3\n\nprevention program.\n\n\n\nA. ACCIDENT RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nDestin Water Users, Inc. has implemented a Risk Management Program that is designed to prevent or minimize the accidental release of chlorine gas from the WRF and to address the necessary emergency response procedures to prevent or minimize any off-site impacts that result from an accidental release of chlorine gas.\n\n\n\nThe accidental release of chlorine gas is prevented or minimized through chlorine safety training, the use of chlorine safety equipment and the implementation of emergency response plans for chlorine gas release.\n\n\n\nThe Risk Management Program has been developed and implemented in accordance with the regulatory requirements of the U. S. Occupational Safety and Health Administration and the U. S. Environmental Protection Agency.\n\n\n\nB. STATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED\n\n\n\nThe stationary source or chlorine storage facility is located at the WRF.  The WRF is located in Destin, Florida.  Chlorine is the regulated substance handled and stored at the WRF.  Chlorine is stored in 150 pound and 2000 pound containers.\n\n\n\nC. ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nThe ac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084110,
      "SummaryText": "cidental release prevention program includes safety training, the use of safety equipment and mock chlorine release drills.  Chlorine safety training is provided by the chlorine supplier to employees of Destin Water Users, Inc. on an annual basis.  The water and wastewater operators also receive chlorine release First Responder Technician level training in addition to the general chlorine safety training bi-annually.  \n\n\n\nThe Emergency Response Plans for chlorine releases are reviewed with employees of Destin Water Users, Inc. on an annual basis.  Additionally, the Emergency Response Plans are reviewed annually with the Destin Fire Control District.  \n\n\n\nOn May 24, 2019, Destin Water Users, Inc. conducted a mock accidental chlorine release (a minor release) in conjunction with the Destin Fire Control District.  In-sight gained from the mock drill was incorporated into the Emergency Response Plans.  A mock chlorine release drill will be held during 2020 to simulate a chlorine release.  This drill will include an invitation to participate to the Destin Fire Control District.\n\n\n\nIn addition to chlorine safety training, Destin Water Users, Inc. monitors the chlorine storage facility 24 hours per day.  The WRF is a fenced and gated facility.  Chlorine gas detectors and audible alarms are tested monthly.  Chlorine scales, regulators and piping systems are monitored daily and receive preventive maintenance on a regular basis.\n\n\n\nD. FIVE YEAR ACCIDENT HISTORY\n\n\n\nDestin Water Users, Inc. has had no reportable accidental chlorine releases within the past five years.\n\n\n\nE. EMERGENCY RESPONSE PROGRAM\n\n\n\nDestin Water Users, Inc. has developed an Emergency Response Plan for both minor and major chlorine releases.  These emergency response plans are reviewed annually with employees and are updated as needed.  The Emergency Response Plans provide specific instructions as to the evacuation of the WRF, the notification of emergency providers and the procedures for containing the leak"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084110,
      "SummaryText": ".  Destin Water Users, Inc. personnel trained as First Responders may attempt to contain a minor chlorine leak (an accidental release) if the proper number of trained employees are available and the proper personal protective equipment is utilized.  The Destin Fire Control District and local HazMat team will respond to all catastrophic releases of chlorine and will respond to all accidental releases as needed.\n\n\n\n\n\nF.  PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nAlthough there are no planned changes to the Risk Management Program, changes will be made as needs are identified through audits, training and process changes.  Destin Water Users, Inc. will be evaluating alternate forms of disinfection and potential upgrades to the chlorine facility within the next 3 years."
    }
  ]
}