{
  "FacilityID": 1000078542,
  "FacilityName": "Louisiana Pigment Company, L.P.",
  "FacilityStr1": "3300 Bayou D'Inde Road",
  "FacilityStr2": null,
  "FacilityCity": "Westlake",
  "FacilityState": "LA",
  "FacilityZipCode": "70669",
  "Facility4DigitZipExt": "9638",
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.196389",
  "FacilityLongDecDegs": "-93.306944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lapigment.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809154958,
  "ParentCompanyName": "KRONOS Louisiana, Inc.",
  "Company2Name": "Venator Investments Ltd.",
  "CompanyDUNS": 607121258,
  "Company2DUNS": 0,
  "OperatorName": "Louisiana Pigment Company, L.P.",
  "OperatorStr1": "3300 Bayou D'Inde Road",
  "OperatorStr2": null,
  "OperatorCity": "Westlake",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70669",
  "OperatorZipCodeExt": "9638",
  "FTE": 305,
  "OtherEPAFacilityID": "70669KRNSL3300B",
  "EPAFacilityID": "100000089183",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0520-00142-V11",
  "SafetyInspectionDate": "2019-03-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 30.19791,
  "FRS_Long": -93.30761,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097938,
      "AltID": "Titanium Tetrachloride",
      "FacilityID": 1000078542,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122861,
          "ProcessID": 1000097938,
          "ChemicalID": 51,
          "Quantity": 1800000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000099180,
          "ProcessID": 1000097938,
          "NAICSCode": "32518",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000061172,
              "Process_NAICS_ID": 1000099180,
              "SafetyReviewDate": "2018-08-07 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "API, TEMA, IEEE, ISA, NEC, NEMA, NACE, SSPC",
              "FR_Comments": "Standards & Codes used to develope sites's Technical Specifications, Procedues, & MI Insp Profiles",
              "HazardReviewDate": "2018-02-15 00:00:00",
              "ChangeCompletionDate": "2020-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Video Camera in Unit",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-04-08 00:00:00",
              "TrainingReviewDate": "1919-03-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Newsletter",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-04-04 00:00:00",
              "EquipmentInspectionDate": "2019-04-23 00:00:00",
              "EquipmentTested": "W171-A2",
              "ComplianceAuditDate": "2018-09-28 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2016-03-30 00:00:00",
              "InvestigationChangeDate": "2017-05-11 00:00:00",
              "MostRecentChangeDate": "2018-12-14 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000061840,
                  "PreventionProgram2ID": 1000061172,
                  "ProcessChemicalID": 1000122861
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078542,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-12-12 00:00:00",
    "ERTrainingDate": "2019-02-08 00:00:00",
    "CoordinatingAgencyName": "Calcasieu Parish Emergency Planning",
    "CoordinatingAgencyPhone": "3377213800",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078542,
      "SummaryText": "\n\nExecutive Summary\n\n11496 LDEQ Facility ID Number\n\n\n\nLouisiana Pigment Company, L.P. (Louisiana Pigment) is one of the newest titanium dioxide manufacturing plants in the United States, beginning production I April 1992.  The facility, located near Lake Charles, Louisiana, is comprised of a 40-acre \"state-of-the-art\" plant site with an additional 100+ acres used for parking , administrative offices, training area, and an industrial landfill with two settling ponds.\n\n\n\nThe Accidental Release Prevention and Emergency Response Policies\n\n\n\nLouisiana Pigment is dedicated to operating a manufacturing facility that maintains a strong respect for our environment and a safe work place for all employees.  Louisiana Pigment takes great pride in our efforts to continuously evaluate the operation of our process, equipment function and efficiency, and procedures, both management and process, to find ways of improving our ability to prevent accidents from occurring and to minimize the impact if the worst occurs.\n\n\n\nProcedures have been developed to enhance our ability to evaluate events that have a potential for unfavorable results.  Computer tracking databases have been purchased and developed that provide management an overall view of the process and maintenance activities.  An event database has been developed to track both safety and environmental events, including the implementation of any corrective actions that have been determined by an investigative team and/or management that is necessary to prevent a reoccurrence in the future.\n\n\n\nLouisiana Pigment participates in the OSHA's Voluntary Protection Program (referred to as VPP).  Louisiana Pigment received our first OSHA Star in 2005 and has continued to participate in the program. The most recent recertification audit was conducted in March 2019.  \n\n\n\nChemical Manufacture Process\n\n\n\nProduct Utilization\n\n\n\nLouisiana Pigment manufactures in excess of 150,000 metric tons per year of titanium dioxide by utilizing the chloride"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078542,
      "SummaryText": " process.  Titanium dioxide is used in industry for generating brilliantly hued paints, in the manufacturing of primers and base coats, in automotive finishes, and in coatings for the exterior of buildings.  Beyond this, titanium dioxide can be found in materials such as high-quality papers, color plastics, furniture panels, textile fibers, glass, ink, porcelain, toothpaste, cosmetics, candy, food coloring, PVC, white sidewall tires, and a growing list of other items.  Plastics are transparent and acquire their gleaming whites and opacities through the addition of titanium dioxide.  Titanium dioxide also improves the physical properties of many plastics.  It absorbs ultraviolet light, making the material more resistant to weathering.\n\n\n\nManufacturing Process\n\n\n\nThe chloride process at Louisiana Pigment uses high-grade titanium ores (natural rutile, titanium ores, or synthetic rutile) to recover titanium dioxide (TiO2).  This is done by first producing titanium tetrachloride (TiCl4) as an intermediate product, then oxidizing it to form TiO2 particles to the purity required for further processing and finishing treatment.\n\n\n\nThe two steps that most characterize the Chloride Process are the continuous chlorination of ore in the fluidized bed chlorinator and the continuous oxidation of titanium tetrachloride in the gas phase to titanium dioxide using a burner.  These two steps are completely dependent upon each other since the chlorine released by oxidation is recycled to the chlorinator.  Through the use of analytical measurement and computer control technology, it is possible to optimize essential production variables, reduce down time to a minimum k and operate machinery at maximum safety standards.  On the premise that operating conditions are kept at an optimum for every step of the chloride process, 90-95% of the titanium dioxide contained in the original ore can be recovered and used in the end product.\n\n\n\nAccidental Release Prevention Program and Chemical-Specifi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078542,
      "SummaryText": "c Prevention Steps\n\n\n\nThe Federal Clean Air Act (CAA) Amendments of 1990 added Section 112 to the CAA, which mandated the U.S. Environmental Protection Agency (EPA) to establish a regulatory Program to prevent serious chemical accidents that may potentially affect public health and the environment.  The resulting regulations referred to as EPA's Accident prevention program (Risk Management Planning), required certain companies, municipalities, and industries to provide information about potential risks associated with their operations.  Louisiana Pigment assessed its operation and determined that titanium tetrachloride is stored at the facility in excess of the threshold quantity.\n\n\n\nLouisiana Pigment has made a commitment to our employees and community that we will endeavor to provide a safe workplace for our employees and to conduct our business as a responsible member of our surrounding community.  In keeping with this policy, Louisiana Pigment endeavors to extend attention to risk management \"beyond our fence line.\"  Louisiana Pigment's Risk Management Program and internal initiatives comprises a series of management practices that support the goal of preventing fires, explosions, accidental chemical release, and encourage safety at the plant and at home.  Louisiana Pigment is committed to the Responsible Care Guiding Principles:\n\n\n\n1.    To recognize and respond to community concerns about chemicals and our operation.\n\n2.    To make health, safety, and environmental considerations a priority in our planning for all existing and new plants and processes.\n\n3.    To operate our plants and processes in a manner that protects the environment, health, and safety of our employees, and the public.\n\n\n\nRisk Management is an interdisciplinary effort composed of Management Practices divided into four elements.\n\n\n\n1.    Management Leadership\n\n2.    Technology\n\n3.    Facilities\n\n4.    Personnel\n\n\n\nCollectively, these practices encompass process safety from the design stage through operation, mai"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078542,
      "SummaryText": "ntenance, and training.  Louisiana Pigment believes that adherence to the Management Practices provides for a continuous evaluation of our safety and environmental systems.\n\n\n\nLouisiana Pigment utilizes elements of OSHA's PSM standard in various management systems.  Underscoring our systems is the belief that all prevention activities begin with management leadership and are effectively conducted via employee participation.  Louisiana Pigment has implemented several programs to encourage all employees and resident contractors to have a primary role in assessing their work environment and to recommend changes.\n\n\n\n1.    Survey, Consider, Analyze, and Notify (SCAN) is a program that provides all employees a method to identify and correct unsafe conditions, recommend improvements to job task, and other recommendations to improve the workplace.\n\n2.    Safe Track is a behavioral observation program in which employees volunteer and are trained as observers.  The observers then participate in reviewing actual job task completed in the field.  This provides an opportunity to observe and make changes that could improve the safety of conducting the task in the field.  This program has evolved through the years to the \"Safety Improvement Team.\"  The Safety Improvement Team is comprised of chemical technicians from different areas of the plant that rotate every three months.  The Safety Improvement team's focus is on observations, SCAN cards, permit reviews, and employee safety interaction.\n\n3.    Incident Investigations may be conducted to determine, both direct and indirect causal factors, for an event and make recommendations to minimize the reoccurrence of the event..\n\n\n\nLouisiana Pigment continues to emphasize and encourage all employees, including contractors to participate in all the programs and the individual Safety Committees in a strong effort to make Louisiana Pigment a safe work environment.\n\n\n\nFive-Year Accident History\n\n\n\nLouisiana Pigment has not had an accidental release"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078542,
      "SummaryText": " in the last five years that resulted in any deaths, injuries, or significant property damage on or off-site.  Louisiana Pigment has not issued an off-site shelter in place or evacuation in the last five years.\n\n\n\nEmergency Response Program\n\n\n\nAt Louisiana Pigment we work hard to ensure the best operating conditions, but we make sure our personnel are prepared for the worst.  Our emergency preparedness and response plans are supported and thoroughly tested.  There are five key components for a quality emergency preparedness and response plan; Personnel Resources, Planning, Communications, and Alliances.\n\n\n\nThe program includes many methods and activities such as:\n\n\n\n1.    Extensive training in our operational processes, maintenance activities, and specific job safety training.\n\n2.    Providing workplace monitoring to control and identify areas where appropriate personal protective equipment (PPE) may be necessary.\n\n3.    Providing state-of-the-art personal protective equipment, available to all personnel working at our facility.\n\n4.    Utilizing employee input through our employee Safety Committees, SCAN Card and the Safety Improvement Team.\n\n5.    Maintaining an Employee Safety and Activities Team (ESAT) which promotes safety awareness through the use of employee involvement and various award programs.\n\n6.    Providing an on-site Medical Department to provide immediate care for employees in need.\n\n\n\nLouisiana Pigment maintains a voluntary on-site emergency response team.  The team is comprised of chemical response, fire brigade, structural rescue, and emergency medical members.  Routine training of the team provides opportunities to maintain and enhance their skills.\n\n\n\nLouisiana Pigment is an active member of the Local Emergency Planning Committee (LEPC), the Southwest Mutual Aid Organization and the Community Awareness Emergency Response (CAER) program.  Louisiana Pigment installed a Community Awareness Siren that can be activated by the plant to notify the surrounding community o"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078542,
      "SummaryText": "f a release that may require them to Shelter in Place.  \n\n\n\nMaintaining a commitment to our employees and community is an on-going effort.  Continually pursuing opportunities for improvements in our environmental and safety programs which may include interactions with our local community help Louisiana Pigment to be a responsible member of our surrounding community.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nLouisiana Pigment endeavors to provide a safe work place for all personnel who work at the site.  To this end, safety systems such as incident investigation, corrective action tracking, near miss reporting, SCAN, internal audits, and observations conducted by the Safety Improvement Team have been developed and continuously improved.  An excellent base of safety systems exists to ensure safe work procedures and proper PPE.\n\n\n\nRecognizing that human behavior plays an integral role in safety performance, Louisiana Pigment has focused more attention in recent years to the human dimension of safety.  A safety culture has been established that makes safety a value in all aspects of our operation.  Key to this culture is full management commitment to safety along with employee awareness and commitment, both on-the-job and off-the-job.  Employees throughout the organization are trained to champion safety by demonstrating safe behavior and watching out for co-workers.\n\n\n\nRecently, a program has been developed and is being rolled out in 2019 to emphasize the need to maintain good housekeeping.  The program emphasizes good housekeeping is a key to have a safe and an environmentally responsible worksite.  Maintaining good housekeeping practices is everyone's responsibility.\n\n\n\nLouisiana Pigment is careful to include contract personnel in all aspects of the safety improvement process.  The Safety Council of Southwest Louisiana is used for basic training of contract personnel, a commitment made by all industry associated with the Lake Area Industrial Alliance (LAIA).  Proof of t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078542,
      "SummaryText": "his basic training is verified for each contract employee entering the site. Additional safety training is provided by the contractors for their employees.  Finally, each contract employee receives process-specific safety training in the area in which he/she will work.\n\n\n\nSummary\n\n\n\nLouisiana Pigment is one of the newest titanium dioxide manufacturing plants, beginning production in 1992.  The facility is designed and constructed using state-of-the-art technology for process control and employs environmental technology that meets and/or exceeds the regulatory requirements.  We have established internal systems to evaluate and improve our manufacturing process, environmental controls, and safety programs that provide for ownership and accountability. These policies and procedures, including the Risk Management Plan, are in place to ensure that we will continue to operate the facility while maintaining our commitment for an environmental secure and safe workplace for our employees and the community.\n\n\n\n"
    }
  ]
}