{
  "FacilityID": 1000046897,
  "FacilityName": "Clariant",
  "FacilityStr1": "1300 South 11 th Street",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.233107",
  "FacilityLongDecDegs": "-85.773169",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 177863784,
  "ParentCompanyName": " Clariant Corporation",
  "Company2Name": null,
  "CompanyDUNS": 108706425,
  "Company2DUNS": 0,
  "OperatorName": "Clariant Corporation",
  "OperatorStr1": "4000 Monroe Rd",
  "OperatorStr2": null,
  "OperatorCity": "Charlotte",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28205",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": "40210NTDCT1227S",
  "EPAFacilityID": "100000227122",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "27755-14-TV",
  "SafetyInspectionDate": "2018-10-22 00:00:00",
  "SafetyInspectionBy": "Air Pollution Control District (APCD)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-07-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-07-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-07-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063136,
      "AltID": "PP-Catalyst Plant",
      "FacilityID": 1000046897,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078022,
          "ProcessID": 1000063136,
          "ChemicalID": 51,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000064260,
          "ProcessID": 1000063136,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052421,
              "Process_NAICS_ID": 1000064260,
              "SafetyReviewDate": "2018-09-24 00:00:00",
              "PHA_Date": "2018-05-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Zurich Hazard Analysis (ZHA)",
              "PHACompletionDate": "2019-12-03 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "safety instrumented systems",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-09-04 00:00:00",
              "TrainingReviewDate": "2018-10-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-03 00:00:00",
              "EquipmentInspectionDate": "2018-10-10 00:00:00",
              "EquipmentTested": "All equipment is new as of 6/1/2016",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-10-02 00:00:00",
              "PreStartupReviewDate": "2018-09-11 00:00:00",
              "ComplianceAuditDate": "2018-09-24 00:00:00",
              "AuditCompletionDate": "2019-06-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-09-28 00:00:00",
              "HotWorkPermitReviewDate": "2018-10-01 00:00:00",
              "ContractorSafetyReviewDate": "2018-09-26 00:00:00",
              "ContractorSafetyEvalDate": "2018-09-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "Clariant is committed to preventing accidents from happening in the first place.  We use multiple layers of protection to avoid hazards, with each layer adding additional levels of safety.  The regulated process includes five interconnected units including: tank farm, catalyst synthesis, by-product isolation, solvent regeneration and waste gas.  All titanium tetrachloride (TiCl4), containing equipment in the four units have vents, relief valves, alarms and procedures and a purge system (nitrogen inertization).  All equipment is vented to a scrubber to control air emissions.  In addition, all units are subject to the same Process Hazards Analysis, training, mechanical integrity, management of change, pre-startup review, compliance audit, incident investigation, employee participation, hot work permit and contractor safety programs and procedures. \n\n\n\nThe following process controls and mitigation systems are specific to each unit:\n\n\n\n? Tank Farm: storage tanks are located in multiple containment dikes. All tanks containing titanium tetrachloride (TiCl4) are equipped with interlocks and/or automatic shutoffs.  The containment dikes have HCl monitoring and foam deluge systems.  In addition, a fire wall will be used to separate the titanium tetrachloride (TiCl4), tank farm from the flammable and regeneration units.\n\n\n\n? Catalyst Synthesis: this unit is located inside an enclosed building with a sprinkler system.  All\n\nequipment has interlocks and/or automatic shutoffs.  Any spills inside the enclosure would drain to the titanium tetrachloride (TiCl4)emergency tank.\n\n \n\n? By-product Isolation: this unit is located inside an enclosed building. Any spills inside the enclosure would drain to a separator tank.\n\n\n\n? Solvent Regeneration and Waste Gas: these units are located in containment dikes.  All titanium tetrachloride (TiCl4)equipment has automatic shutoffs.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000064431,
                  "PreventionProgram3ID": 1000052421,
                  "ProcessChemicalID": 1000078022
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046897,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-09-03 00:00:00",
    "ERTrainingDate": "2018-10-23 00:00:00",
    "CoordinatingAgencyName": "Jefferson County LEPC",
    "CoordinatingAgencyPhone": "5025743836",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046897,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies:\n\nClariant is committed to operating and maintaining our processes in a safe and responsible manner.  We are dedicated to protecting the health and safety of our employees and neighbors as well as the environment at our site and in our community.  Our goal is always zero incidents.\n\nWe use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\n\n\n\nStationary Source and Regulated Substances:\n\nThe Clariant Louisville West Plant manufactures customized precipitated catalysts and catalyst\n\ncarriers. They are used in various industries to aid in the manufacture of other products.  They set in motion a desired chemical reaction or process using much less energy than otherwise needed and minimizes the output of waste and greenhouse gases.  This Risk Management Plan (RMP) covers the use of titanium tetrachloride (TiCl4), a chemical regulated by the EPA. Titanium tetrachloride is used by plastic resin manufacturers to more efficiently make polypropylene which is used to makes plastics that go into many useful consumer products, including car bumpers, bicycles, medical devices and toys.  The process is comprised of interconnected units including the tank farm and production process.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\nClariant takes a systematic, proactive approach to preventing accidental releases of hazardous\n\nchemicals.  We used multiple layers of protection to avoid hazards, with each layer adding additional layers of safety.  Our management systems address each of the key features of successful process safety programs including:\n\nEmployee participation: Employees are highly trained.  Control room operators constantly monitor the systems and respond quickly.\n\nProcess safety information: Complete and accurate informatio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046897,
      "SummaryText": "n on the process technology, equipment and hazardous/physical characteristics of the chemical are maintained.\n\nOperating procedures: Written operating procedures address all steps for each operation to assure understanding and compliance.\n\nTraining: All employees are trained for their specific jobs with an emphasis on safety and health hazards, emergency operations and safe work practices.\n\nMechanical integrity: Written procedures cover assuring the integrity of equipment and instruments throughout the plant.\n\nManagement of change:This system ensures that any changes to facilities, process chemicals, technologies, equipment, procedures or administrative controls take into consideration the impact of the change on safety.\n\nPre-startup review: All processes are reviewed and safety considerations addressed to assure it is safe to start up the process.\n\nProcess hazard analysis: An analysis of covered processes, conducted every five years, is a detailed study used to identify potential hazards and the measures needed to ensure the hazards are controlled.\n\nIncident investigation: If an incident occurs, it will be thoroughly investigated and causes determined, corrective actions identified and implemented, and employees trained in the new actions.\n\nHot work permit/ Safe work practices: We strictly adhere to internal permitting processes to prevent accidents during performance of hot work, confined space entry, working in elevated altitude; our employees are trained to assure they fully understand these processes.\n\nContractor safety: Contractors are carefully chosen for their safety performance and are expected to maintain the same safety procedures as employees.\n\nEmergency Planning & Response: Plant emergency responders can take actions should an incident occur.  The plant also works closely with local responders to assure they are aware of our operations and are able to assist should the need arise.\n\nCompliance Audits: Every three years, compliance audits are conducted to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046897,
      "SummaryText": " verify that the prevention program is adequate and being followed.\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to maintaining these management systems and recognize that this is the way we do business.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention. \n\n\n\nFive Year Accident History:\n\nThe Clariant Louisville West Plant is introducing titanium tetrachloride (TiCl4) for the first time and, therefore, has not had an accidental release of titanium tetrachloride in the past five years.\n\n\n\nEmergency Response Program:\n\nClariant maintains an emergency response plan which addresses all of the various federal, state,\n\nand local regulatory requirements for emergency response planning.  Our program provides the\n\nessential planning and training for effectively protecting workers, the public, and the environment\n\nduring emergency situations. Our plan also includes specific procedures for responding to a release of titanium tetrachloride, our only RMP chemical on site.\n\n\n\nPlanned Changes to Improve Safety:\n\nAt Clariant, we are committed to continuous improvement of environment, health, and safety\n\nperformance. Through our Process Safety Management program, we review hazards associated\n\nwith our processes and implement actions to reduce the hazards according to risk assessment/risk management principles.\n\n\n\nClariant is dedicated to protecting the health and safety of our employees and neighbors as well as the environment at our site and in our community. Our goal is always zero incidents.\n\n"
    }
  ]
}