{
  "FacilityID": 1000063129,
  "FacilityName": "CHS Inc. Hannaford Propane Terminal",
  "FacilityStr1": "711 109th Ave SE",
  "FacilityStr2": null,
  "FacilityCity": "Hannaford",
  "FacilityState": "ND",
  "FacilityZipCode": "58448",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38039",
  "LEPC": "Griggs County  LEPC",
  "FacilityLatDecDegs": "47.309621",
  "FacilityLongDecDegs": "-98.213166",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.chsinc.com",
  "FacilityEmailAddress": "co.compliance@chsinc.com",
  "FacilityDUNS": 6147177,
  "ParentCompanyName": "CHS Inc.",
  "Company2Name": "Central Plain Ag",
  "CompanyDUNS": 6147177,
  "Company2DUNS": 0,
  "OperatorName": "CHS Inc.",
  "OperatorStr1": "5500 CENEX DRIVE, MS305",
  "OperatorStr2": null,
  "OperatorCity": "INVER GROVE HEIGHTS",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55077",
  "OperatorZipCodeExt": "1733",
  "RMPContact": "Elizabeth Woods",
  "RMPTitle": "Terminal Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227417",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "New Facility",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-04-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079270,
      "AltID": "Propane Terminal",
      "FacilityID": 1000063129,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080430,
          "ProcessID": 1000079270,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098847,
          "ProcessID": 1000079270,
          "ChemicalID": 98,
          "Quantity": 6768720.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598847,
          "ProcessID": 1000079270,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063129,
      "SummaryText": "CHS Inc.\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nAccidental release prevention and emergency response policies:\n\nOur company is committed to protecting the environment and operating facilities in a manner that promotes the safety of employees and the general public. At this facility, we store and handle propane. The management has adopted and implemented policies and procedures that adhere to all applicable Federal and state rules and regulations. The most current editions of NFPA 58 and 54 are followed for the safe handling of propane and the installation and maintenance of storage equipment. Safety is the number one consideration in the handling of propane, the design and maintenance of the equipment, and the training of our personnel. The Certified Employee Training program (CETP) modules relating to the maintenance procedures of bulk storage containers and equipment and the modules relating to Railcar product transfers is the guide for safety practices and procedures at this terminal.\n\n\n\nOur emergency response plan is based upon the \"Guidelines for Developing Plant Emergency Procedures\" and \"How to Control L-P Gas Leaks and Fires\". Terminal staff will not respond to accidental releases of flammable substances at our facility, but has coordinated response actions with the local fire department. Our response plan includes procedures to call the local emergency responders such as the fire and law enforcement departments as well as any potentially affected neighbors. \n\n\n\nStationary source and regulated substance handled:\n\nThe regulated substance handled at this terminal is propane. The purpose of this facility is to store propane for distribution to wholesale customers. Most of the propane is received by rail car, up to forty eight rail cars per rail switch, and stored in twelve large storage tanks. In rare cases, it is received by truck transports. This facility is equipped to unload rail cars and truck transports. It is set up to load transports and bobtails; however the majority"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063129,
      "SummaryText": " of the propane is loaded into transports that haul the propane to wholesale customers. This facility does not sell propane to the general public. The installation of the storage tanks and the loading and unloading equipment has been done according to the provisions of NFPA 58. Federal department of transportation inspectors periodically inspect the facility. The facility is enclosed by fence and access is restricted to authorized personnel only.\n\n\n\n\n\nGeneral accidental release prevention program and chemical-specific prevention steps:\n\nThis terminal complies with all Federal and state rules and regulations that govern the storage, handling and transportation of propane. It also complies with the including the OSHA PSM rule and EPA's Accidental Release Prevention Rule. The terminal was designed and constructed in accordance with NFPA 58 code for the storage and handling of propane. Periodic inspection of the entire system is done to ensure continued safe operations. All maintenance and improvements are done per the latest NFPA code in effect at the time. Regulatory authorities, to ensure that it is operated and maintained properly, inspect this terminal. The employees are trained as required by the appropriate codes and regulations using the Certified Employee Training Program (CETP). \n\n\n\n\n\nFive-year accident history:\n\nNo accidental releases of propane have occurred at this terminal resulting in off-site consequences.\n\n\n\nEmergency response program:\n\nThe emergency response plan at this terminal was based upon the NPGA bulletins \"Guidelines for Developing Plant Emergency Procedures\" and \"How to Control Small Leaks and Fires\" and the CETP training program. Employees are trained in emergency operating procedures such as controlling sources of ignition and leaks. Employees are not trained in emergency medical response and are not equipped to respond to offsite releases. Facility employees will not respond to accidental releases of a regulated flammable substance. Emergen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063129,
      "SummaryText": "cy response will be coordinated with the local fire authorities. The plan identifies who is responsible for calling emergency responders and notifying potentially affected neighbors. A facility security plan has been implemented and incorporated into the overall facility safety program. A written fire safety analysis has been completed.\n\n\n\nPlanned changes to improve safety:\n\nThe facility was constructed in 2014 to meet or exceed all existing standards, and is maintained in compliance with NFPA 58. The staff has been trained using the Certified Employee Training Program developed by the National Propane Gas Association in addition to industry safety practices and procedures. Safety practices are continually reviewed. Equipment and maintenance programs are monitored on an ongoing basis.\n\n"
    }
  ]
}