{
  "FacilityID": 1000094822,
  "FacilityName": "Pregis Innovative Packaging Inc.",
  "FacilityStr1": "1411 Pidco Drive",
  "FacilityStr2": null,
  "FacilityCity": "Plymouth",
  "FacilityState": "IN",
  "FacilityZipCode": "46563",
  "Facility4DigitZipExt": "1352",
  "FacilityCountyFIPS": "18099",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.351389",
  "FacilityLongDecDegs": "-086.325833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.pregis.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 197139665,
  "ParentCompanyName": "Pregis  Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5211768,
  "Company2DUNS": 0,
  "OperatorName": "Pregis Innovative Packaging Inc.",
  "OperatorStr1": "1411 Pidco Drive",
  "OperatorStr2": null,
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46563",
  "OperatorZipCodeExt": "1352",
  "FTE": 240,
  "OtherEPAFacilityID": "IND984882928",
  "EPAFacilityID": "100000044631",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "099-37601-00028",
  "SafetyInspectionDate": "2021-04-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-08-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-08-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-08-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-08-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.35166,
  "FRS_Long": -86.32422,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117690,
      "AltID": "Polyfoam Insulation Mfg.",
      "FacilityID": 1000094822,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147152,
          "ProcessID": 1000117690,
          "ChemicalID": 107,
          "Quantity": 123930.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000119023,
          "ProcessID": 1000117690,
          "NAICSCode": "32615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000100721,
              "Process_NAICS_ID": 1000119023,
              "SafetyReviewDate": "2021-06-30 00:00:00",
              "PHA_Date": "2021-06-30 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-12-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-12-05 00:00:00",
              "TrainingReviewDate": "2013-02-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-02-28 00:00:00",
              "EquipmentInspectionDate": "2021-01-11 00:00:00",
              "EquipmentTested": "iso-butane tanks",
              "ChangeMgmtDate": "2014-03-01 00:00:00",
              "ChangeMgmtReviewDate": "2013-02-28 00:00:00",
              "PreStartupReviewDate": "2014-03-01 00:00:00",
              "ComplianceAuditDate": "2020-06-02 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2014-02-01 00:00:00",
              "InvestigationChangeDate": "2014-02-01 00:00:00",
              "ParticipationPlansReviewDate": "2013-02-28 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2018-05-29 00:00:00",
              "ContractorSafetyEvalDate": "2002-06-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "Pregis Innovative Packaging, Inc. [Pregis] operates a plant in Plymouth, Indiana, to produce sheets and planks of foamed polyethylene for use by its customers for protective packaging.  To form the cells in the foamed products, isobutane is injected at high pressure into the polyethylene melt.  Isobutane is stored in two horizontal tanks that have working capacities near 12,750 gallons, thus, about 74,000 pounds in each tank.  Since the total quantity exceeds the 10,000-pound criterion for inclusion in the Process Safety Management [PSM, Reference 1] Standard of the Occupational Safety and Health Act and the Risk Management Program [RMP: Reference 2] requirements of the U. S. Environmental Protection Agency, periodic Process Hazards Analyses [PHA] are required. ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000126384,
                  "PreventionProgram3ID": 1000100721,
                  "ProcessChemicalID": 1000147152
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094822,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-04-02 00:00:00",
    "ERTrainingDate": "2015-02-26 00:00:00",
    "CoordinatingAgencyName": "Plymouth Fire Department",
    "CoordinatingAgencyPhone": "5749362156",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094822,
      "SummaryText": "Pregis Innovative Packaging Inc., Plymouth, IN\n\n\n\n1 ACCCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nWe at Pregis are strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, we are completely coordinated with the Marshall County Local Emergency Planning Commission (LEPC) and the Plymouth Fire Department to provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n\n\n2. THE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\n\n\nOur facility's primary activities encompass the manufacturing of polyethylene foam products that are used as packaging material. We use isobutane, a regulated substance, as a blowing agent at this facility.\n\n\n\n3. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. In addition, we have one process at our facility which is subject to the Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119 and we have an air operating permit IDT099-5696-00028 from the Indiana Department of Environmental Management. The following sections briefly describe the elements of the accidental release prevention program that are in place at Pregis.\n\n\n\nProcess Safety Information\n\nPregis maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the covered process.\n\n\n\nProcess Hazard Analy"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094822,
      "SummaryText": "sis \n\nPregis conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The HAZOP methodology is used to carry out the analysis. These studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and revalidated at a regular interval of five years and when major changes are made to the covered process. The most recent revalidation was in 2021. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within the covered process, Pregis maintains written operating procedures. These procedures address various modes of operation such as startup, shutdown, normal operations temporary operations, emergency shutdown and emergency operations. The information is reviewed on a regular basis and is readily accessible to operators involved in the process.\n\n\n\nTraining\n\nPregis has a comprehensive training program in place to ensure that employees who are operating components of the covered process am competent in the operating procedures associated with these components. All employees receive training as part of the onboarding process. Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity \n\nPregis performs documented maintenance checks on covered process equipment to ensure proper operations. Process equipment examined by these checks includes but is not limited to storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The maintenance operations are done by qualified personnel with previous training in maintenance practices, and these personnel are provided specialized training as needed. Contractors are used, when necessary, to perform mechanical integrity testi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094822,
      "SummaryText": "ng.   \n\n\n\nManagement of Change\n\nWritten procedures are in place at Pregis to manage changes in covered process chemicals, technology, equipment and procedures. Operations, maintenance personnel or any other employee whose job tasks are affected by a modification in the covered process conditions are promptly made aware of and given training to safely deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to additions and modifications to the covered process are conducted as a regular practice at Pregis. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nPregis will continue to conduct periodic audits to ensure that the provisions set forth under the RMP and PSM rules are being implemented. Any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nPregis promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions that would prevent the release from reoccurring. All reports are\n\nretained at our facility for a minimum of five years.\n\n\n\nEmployee Participation\n\nPregis truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and they actively participate in process safety management. In addition, Pregis employees have access to all information created as part of the facility's implementation of the RMP and PSM rules, including information resulting from process hazard analyses.\n\n\n\nContractors\n\nOn occasion, Pregis hires contractors to conduct specialized maintenance and construction activities. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094822,
      "SummaryText": "Prior to selecting a contractor, a thorough safety performance evaluation of the contractor is carried out. Pregis has a strict policy of informing the contractors of known potential hazards related the contractors work and the covered process. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n4. FIVE-YEAR ACCIDENT HISTORY\n\n\n\nPregis has an excellent record of preventing accidental releases over the last five years. As a result of Pregis's stringent release prevention programs, there have been no significant accidental releases or incidents during this period.\n\n\n\n5. EMERGENCY RESPONSE PLAN\n\n\n\nPregis maintains a written emergency evacuation plan for the safety of our employees during accidental releases of hazardous materials. The plan includes adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies. Pregis employees do not directly respond to the emergency.\n\n\n\nEmergency notification equipment is regularly inspected and serviced to ensure proper functioning. Upon modification of the covered process, the plan is promptly updated to reflect any pertinent changes within the covered process that would require a modified emergency response.\n\n\n\n6. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nTo enhance our continuous improvement in occupational safety and health, we conduct monthly general safety planning meetings which includes employee participation."
    }
  ]
}