{
  "FacilityID": 1000046883,
  "FacilityName": "Herring Water Station",
  "FacilityStr1": "Ranch Road 1923",
  "FacilityStr2": null,
  "FacilityCity": "Stinnett",
  "FacilityState": "TX",
  "FacilityZipCode": "79083",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48233",
  "LEPC": "Hutchinson County LEPC",
  "FacilityLatDecDegs": "35.848217",
  "FacilityLongDecDegs": "-101.525209",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "SW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39045307,
  "ParentCompanyName": "WRB Refining, LP",
  "Company2Name": null,
  "CompanyDUNS": 794031356,
  "Company2DUNS": 0,
  "OperatorName": "WRB Refining, LP",
  "OperatorStr1": "Spur 119 North",
  "OperatorStr2": "P.O. Box 271",
  "OperatorCity": "Borger",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79008",
  "OperatorZipCodeExt": "0271",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209516",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-05-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058428,
      "AltID": "Water Treatment System",
      "FacilityID": 1000046883,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071383,
          "ProcessID": 1000058428,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059411,
          "ProcessID": 1000058428,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000037295,
              "Process_NAICS_ID": 1000059411,
              "SafetyReviewDate": "2013-05-08 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "AWWA",
              "FR_Comments": null,
              "HazardReviewDate": "2014-08-21 00:00:00",
              "ChangeCompletionDate": "2014-08-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-08-31 00:00:00",
              "TrainingReviewDate": "2011-12-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-01-17 00:00:00",
              "EquipmentInspectionDate": "2014-06-01 00:00:00",
              "EquipmentTested": "Chlorine Container",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000037822,
                  "PreventionProgram2ID": 1000037295,
                  "ProcessChemicalID": 1000071383
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046883,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-01-03 00:00:00",
    "ERTrainingDate": "2014-09-04 00:00:00",
    "CoordinatingAgencyName": "Hutchinson County LEPC",
    "CoordinatingAgencyPhone": "8062736012",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046883,
      "SummaryText": "HERRING WATER STATION\n\nRISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nThe Herring Water Station has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training and consideration of safety in the design, installation, operation, and maintenance of our processes. Our policy is to adhere to all applicable Federal and State rules and regulations and implement reasonable controls to prevent foreseeable releases of regulated substances. Safety depends upon the manner in which we handle chlorine, the safety devices, and the training of our employees. WRB Refining is very conscious regarding safety. However, if a release does occur, emergency response measures discussed below will be implemented to minimize impacts on the population and environment.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe Herring Water Station operates 24 hours per day. The station is a water treatment facility that supplies water to Borger Refinery. The NAICS Code for Water Supply operations is 22131. Chlorine is the only regulated toxic material used at the facility. Chlorine is used as a disinfectant during the water treatment process in the manner mandated by state and federal laws.\n\n\n\nThe site is a \"normally unoccupied remote facility\" per the definition of OSHA (29 CFR 1910.119). The plant is automated to operate without continuous supervision. The plant is enclosed by a security fence with all gates and doors being secured during unmanned hours.\n\n\n\nINFORMATION ABOUT CHLORINE AND ITS USE IN THE PROCESS\n\n\n\nA. PHYSICAL PROPERTIES AND DESCRIPTION\n\n\n\nChlorine is an element of the halogen family.\n\n\n\nMolecular Weight: 70.9\n\nSpecific gravity (liquid): 1.467\n\nBoiling point: -34 degrees C\n\nMelting point: -101 degrees C\n\n\n\nLiquid chlorine is brownish and about 1.5 times as heavy as water. Chlorine is removed from the containers as a ga"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046883,
      "SummaryText": "s. Chlorine exists as greenish/yellowish gas at normal temperatures and has a sharp disagreeable odor. Chlorine gas occupies 450 times the volume of its liquid state. Chlorine gas is approximately 2.5 times as heavy as air.\n\n\n\nB. REACTIVITY AND CORROSITIVITY DATA\n\n\n\nChlorine is stable. Chlorine is neither explosive nor flammable, but supports combustion. Dry chlorine is not corrosive but it easily combines with water to form corrosive hypochlorous and hydrochloric acids.\n\n\n\nWhen chlorine is added to water the chemical reaction is:\n\nCl2 + H2O --> HOCl + HCl\n\n(chlorine + water --> hypochlorous acid + hydrochloric acid)\n\n\n\nHypochlorous acid is the primary disinfectant and is thought to inactivate bacteria, viruses, and most protozoa by penetrating the cell wall. Certain protozoa that form cysts in adverse environments can, however, be quite resistant to chlorination.\n\n\n\nSome of the hypochlorous acid dissociates as follows:\n\nHOCl --> H+ + OCl-\n\n(hypochlorous acid --> hydrogen ion + hypochlorite ion)\n\n\n\nHydrochloric acid also dissociates in water:\n\nHCl --> H+ + Cl-\n\n(hydrochloric acid --> hydrogen ion + chlorine ion)\n\n\n\nChlorine is an oxidizing agent and will combine with impurities, if present, in the water to form chlorine compounds such as chloramine. Feeding of additional chlorine destroys some of these compounds (a procedure known as breakpoint chlorination).\n\n\n\nC. INCOMPATIBILITY DATA\n\n\n\nChlorine may cause fire and/or explosion upon contact with turpentine, ethers, ammonia, hydrocarbons, certain metal hydrides, carbides, nitrides, oxides, sulfides, phosphates, or easily oxidized materials.\n\n\n\nD. TOXICITY\n\n\n\nChlorine, in and of itself, is not toxic. It is, however, classified as a poisonous gas because when it combines with moisture it produces corrosive acids. If inhaled the gas combines with moisture in the body to form acids that irritate and burn bodily tissues. Chlorine inhalation can cause lung damage and death from pulmonary edema. Oral ingestion is unlikely "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046883,
      "SummaryText": "because chlorine exists as a gas at ambient temperatures.\n\n\n\nExposure limits:\n\nTWA = 0.5 parts per million.\n\nSTEL = 1.0 ppm\n\n\n\nEye effects: 1 ppm can cause redness, tearing and irritation. Exposure to greater concentrations of vapor or liquid can cause burns and blindness.\n\n\n\nSkin effects: Exposure to liquid will cause burns. Exposure to gas can cause burns.\n\n\n\nOther toxic effects: Inhalation is the major route of exposure. Exposure to 0.5 ppm for 8 hours or 1.0 ppm for 4 hours can cause transient reduction in pulmonary capacity. Exposure to 3 6 ppm can cause irritation of the upper respiratory tract, headaches, and coughing. 10 ppm will cause severe irritation of respiratory tract.\n\n15-20 ppm can cause nausea, vomiting, dizziness, shortness of breath, and chest pain. Pulmonary edema and chemical pneumonia can follow. Exposures to greater concentrations can cause unconsciousness and death.\n\n\n\nChlorine is not listed as a carcinogen by NIP, IARC or OSHA.\n\n\n\nChronic effects: Chronic exposure is unlikely because of the disagreeable odor of concentrations of even 1 ppm. Tests indicate that intermittent exposures to concentrations of that level caused no observable adverse health effects.\n\n\n\nE. STORAGE AND INVENTORY\n\n\n\nChlorine is stored under pressure as liquid in one ton containers. Herring Water Station keeps and uses up to two (2) containers on-site at any time. Chlorine must be stored under pressure to maintain its liquid state. The pressure varies with ambient temperature. At 50 degrees F, the pressure inside the cylinders is 60 psi. Pressures increase as temperatures increase.\n\n\n\nThe safety limits for chlorine cylinders are:\n\n\n\nTemperature: Upper..120 deg. F; Lower..N/A. The cylinders are equipped with a fusible plug that acts as a pressure release if ambient temperature reaches 158 degrees F. In reality temperatures at the storage conditions are those of the outside because the storage is not enclosed.\n\n\n\nPressure: Upper..250 psi; Lower..N/A. Pressure would be app"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046883,
      "SummaryText": "roaching 318 psi before the fusible plug(s) give.\n\n\n\nExceeding 158 deg. F. or 318 psi would cause a release of chlorine gas that would threaten the safety of employees and physical integrity of any metals contacted in the presence of water.\n\n\n\nHAZARD ASSESSMENT INFORMATION\n\n\n\n40 CFR Part 68, Subpart B - Hazard Assessment, outlines a specific set of criteria required to be used in the modeling of worst-case and realistic probable (alternative) case release scenarios. Worst case and alternative case scenario modeling was completed using RMP*Comp software.\n\n\n\nTo complete worst-case alternative case modeling, the default level of concern for chlorine was set at levels established in accordance with EPA and American Industrial Hygiene Association standards. The resulting plume indicates a level where individuals would be able to take protective actions without suffering any serious health effects from a chemical exposure during a one hour or less time period. It is not expected that the vapor cloud would reach any populated areas in case of a realistic release scenario.\n\n\n\nACCIDENT HISTORY\n\n\n\nThere have been no chlorine-related accidents at the facility within the past five years.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM INFORMATION\n\n\n\nThe following is a summary of the general accident prevention program in place at the Herring Water Station.\n\nThis document describes the management system in place to implement the accident prevention program.\n\n\n\nPROCESS SAFETY INFORMATION (PSI)\n\n\n\nWRB Refining keeps a variety of technical documents that are used to maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information. PSI reference documents are readily available.\n\n\n\nChemical specific information, including exposure hazards, emergency response medical treatment considerations, is provided in Safety Data Sheets (SDS's). For specific proce"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046883,
      "SummaryText": "ss areas, the water station has documented safety related limits for specific process parameters (e.g., temperature or pressure) in the unit specific PSI documentation. The water station ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems.\n\n\n\nThe Herring Water Station also maintains technical documents that provide information about the design of process equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nHAZARD REVIEW\n\n\n\nThe Herring Water Station has a comprehensive program to help ensure that hazards associated with the process are identified and controlled. Within this program, the process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\n\n\nWRB Refining uses the \"What If\" and other analysis techniques to perform these evaluations for water stations. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures when the team believes such measures are necessary.\n\n\n\nThe process hazard analysis (PHA) team findings are forwarded to management for resolution.\n\nImplementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options being implemented in response to PHA team findings are tracked until they are complete. The final resolution of each finding is documented"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000046883,
      "SummaryText": " and retained.\n\n\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the Herring Water Station revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years until the process is no longer operating. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\n\n\nOPERATING PROCEDURES\n\n\n\nThe Herring Water Station maintains written procedures that address various modes of process operations.\n\nThese procedures can be used as a reference for experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and certified as current and accurate.\n\nThe procedures are maintained current and accurate by revisiting them as necessary to reflect changes made through the management of change process. Drills are conducted regularly to evaluate emergency procedures.\n\n\n\nTRAINING\n\n\n\nTo prevent accidental releases, the Herring Water Station has implemented an operator training program to minimize the risk of an accidental discharge due to operator error. The facility also has an inspection schedule to reduce the risk of a discharge due to faulty equipment. All outside contractors and employees from other departments are informed of the chlorine storage and given appropriate training. Outside personnel is informed of appropriate escape routes and also be given basic information as to the odor, appearance, and hazards of chlorine. Additionally, the nature of the process, process diagram, and potential hazards are explained.\n\n\n\nTo complement the written procedures for process operations, the Herring Water Station has implemented a comprehensive training program for all employees involved in operating the process. The facility has an ongoing "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000046883,
      "SummaryText": "training plan. All new employees receive basic training in water station operations chlorine safety and undergo Right-to-Know training. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.\n\nOngoing safety training programs cover all phases of plant operation from maintenance and operations safety to safe handling of chlorine. All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n\n\n\nMAINTENANCE AND MANAGEMENT OF CHANGES (MOC)\n\n\n\nThe Herring Water Station has well-established practices and procedures to maintain chlorine containers, piping and material transfer systems, controls, and emergency systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\n\n\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner. Written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended. If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or an MOC team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\n\n\nAnother integral part of the mechanical integrity program is qualit"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000046883,
      "SummaryText": "y assurance. The Herring Water Station incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n\n\nCOMPLIANCE AUDITS\n\n\n\nTo help ensure that the accident prevention program is functioning properly, the Herring Water Station periodically conducts self-audits to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance self-audits are conducted at least every 3 years.\n\nBoth hourly and management personnel participate as audit team members. The audit team develops findings that are forwarded to the company management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nAdditionally, the Herring Water Station may be the subject to Corporate Safety and Health compliance audits and/or to third-party audits, internal employee perception, and industry safety management system audits. The audits, which may include OSHA's PSM elements, also include an overview of the risk management systems. The audits are typically conducted by a team of safety and other element specialists to ensure that audit findings are dependable.\n\n\n\nINCIDENT INVESTIGATION\n\n\n\nWRB Refining promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to company management for resolution. Corrective actions take"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000046883,
      "SummaryText": "n in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be utilized during initial and revalidation PHA's.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\n\n\nA controlled release of the chlorine product located at the water station is defined as the escape of gas to the atmosphere in small, non-reportable quantities, resulting from standard operating procedures of connecting or disconnecting chlorine containers and standard maintenance procedures on the plant's chlorine equipment.\n\n\n\nAn uncontrolled release of chlorine gas that will require the implementation of the emergency response procedures is defined as any release other than those examples defined as similar to controlled releases.\n\nSmall controlled leaks will be handled by personnel serving the station. All uncontrolled leaks will be handled by WRB responders. The overall emergency response program for the Herring Water Station is coordinated with the emergency response organizations (e.g., fire department), Hutchison County Local Emergency Planning Committee (LEPC) and the Panhandle Emergency Response System (PERS). If uncontrolled release conditions warrant such actions, shelter-in-place, evacuation, and public warning will be implemented by the Hutchison County LEPC. Each uncontrolled release of chlorine gas will be subject to a follow-up incident investigation by WRB Refining, Hutchison County LEPC, and applicable State and Federal regulatory agencies.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nWRB Refining resolves all findings from PHA's, some of which result in modifications to the process.  The following are examples of the types of changes:\n\n* Continue to improve process operato"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000046883,
      "SummaryText": "r training to include: additional classroom, hands-on skill development, and a more duty specific examination process.\n\n* Have emergency response training for the people who respond to chlorine leaks.\n\n"
    }
  ]
}