{
  "FacilityID": 1000093466,
  "FacilityName": "Permian Advantage Toyah LLC\t\t",
  "FacilityStr1": "264 Shaw Road",
  "FacilityStr2": null,
  "FacilityCity": "Pecos",
  "FacilityState": "TX",
  "FacilityZipCode": "79772",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48389",
  "LEPC": "Reeves County LEPC",
  "FacilityLatDecDegs": "31.387109",
  "FacilityLongDecDegs": "-103.688048",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": "https://www.goclearshift.com/",
  "FacilityEmailAddress": "cmarkovchik@goclearshift.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "ClearShift, LLC\t\t",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ClearShift, LLC",
  "OperatorStr1": "5910 N Central Expressway\t\t",
  "OperatorStr2": "Suite 1800\t\t",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75206",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sean Kelly, SMS\t\t",
  "RMPTitle": "Manager, HS&E\t\t",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000244979",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116029,
      "AltID": "Naphtha/Gasoline Blend",
      "FacilityID": 1000093466,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117421,
          "ProcessID": 1000116029,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145032,
          "ProcessID": 1000116029,
          "ChemicalID": 118,
          "Quantity": 100380.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145033,
          "ProcessID": 1000116029,
          "ChemicalID": 107,
          "Quantity": 98679.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145034,
          "ProcessID": 1000116029,
          "ChemicalID": 154,
          "Quantity": 105084.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 154,
            "ChemicalName": "Butene",
            "CASNumber": "25167-67-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000145035,
          "ProcessID": 1000116029,
          "ChemicalID": 125,
          "Quantity": 109074.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645032,
          "ProcessID": 1000116029,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645033,
          "ProcessID": 1000116029,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645034,
          "ProcessID": 1000116029,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645035,
          "ProcessID": 1000116029,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093466,
      "SummaryText": "Executive Summary for Permian Advantage Toyah, LLC\n\n\n\nAdvantage Midstream (Advantage) has embraced a commitment to safety of employees and the public and strives to provide a safe working environment for everyone.  The facility processes and stores Naphtha Gasoline Blendstock, a Class 1 fuel, which contains listed RMP substances including Butane, Butene, Isobutane and Pentane.  Therefore, the facility is required to complete an RMP under 40 CFR 68.160. \n\n\n\nThe blendstock is a proprietary material and weight % of individual constituents in the material are confidential.  Therefore, the quantity of listed substances have been assumed to be 100 wt% of the blendstock as a conservative approach.  In reality, the quantities will be less than reported in this RMPLan. \n\n\n\nA hazard assessment was completed as part of the initial RMP to determine the extent of off-site impacts (if any) for a worst-case scenario (WCS) and an alternate release scenario (ARS). For the WCS, a release of 109,074 pounds of pentane was assumed to be released with subsequent vapor cloud explosion.  The impact distance for this scenario reached 0.4 miles and no housing, schools, businesses, or population were affected.\n\nFor the ARS, a release of 4181 pounds of pentane over a 5 minute period was considered due potential pipe leak.  The impact distance for this scenario reached 0.1 miles with no housing, schools, businesses, or population affected. \n\n\n\nAdvantage has a robust safety and incident prevention program that includes various elements as follows: \n\n1.Employee Participation\n\nAdvantage has adopted an open access policy for its employees regarding safety. Advantage has developed an Employee Participation Statement that follows the guidelines set in 29 CFR 1910.119 to encourage employee safety. Input from employees on safety programs is actively solicited and employees are encouraged to participate in safety activities, such as meetings, trainings, or process hazard analysis. Employees have access "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093466,
      "SummaryText": "to all information pertaining to process safety and are required to adhere to all safety procedures.\n\n2.Process Safety Information\n\nThe Process Safety Information is included in the Process Safety Manual developed by Advantage and defines the contents, conditions and limits of the process equipment and help employers and employees identify and understand any possible hazards. The information contained in the Manual follows 20 CFR 1910.119 and is readily available and maintained on-site. The relevant information includes basic chemistry data, technology information (process flow diagrams, maximum intended inventory, etc.), equipment information, safety protective systems, equipment specification sheets, other design specifications and an information checklist. \n\n3.Process Hazard Analysis\n\nAdvantage has developed a Process Hazard Analysis (PHA) procedure that is defined as an organized and systematic effort to identify and analyze the significant potential hazards. The PHA includes planning and organizing, including PHA scope, team selection and assembling the information.  Potential hazards are identified and an investigation is completed on the adequacy of technical and organizational safeguards in place to respond to each hazard. Previous incidents and consequences of failure of the technical and organizational safeguards are identified. A qualitative evaluation of the identified potential hazards is completed by the team, followed by the development of recommendations which will reduce the risk associated with the identified hazards.  Management is responsible for the resolution and documentation of all PHA recommendations in a timely manner.\n\n4.Operating Procedures\n\nThe operating procedures at Advantage provide a guideline in the development and utilization of Operating Procedures. The operating procedures follow 29 CFR 1910.119 and are readily available to all employees involved in operating the facility. They are used by company employees as well as contractors"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093466,
      "SummaryText": " working within the facility. \n\nOperating procedures are outlined for various operating phases, including initial startup, normal operations, emergency shutdown, etc. The procedures also include operating limits (upper and lower) in which the equipment, process or system can be safely operated, safety systems, cautions and warnings and assignment of responsibilities for each job assignment.\n\n5.Training Requirements\n\nEach Department at Advantage is responsible for ensuring its employees receive the necessary training to safely operate and maintain equipment within the facility. All employees and contractors are expected to safely operate and maintain the covered process equipment and are expected to be trained for their required duties. The training guidelines adopted by Advantage follow 29 CFR 1910.119 and follow specific requirements for the training of operations and maintenance personnel. \n\nThe trainer also must follow a set of requirements, including written and oral communication skills, technical competency, organization and clerical skills and accountability.\n\n6.Contractor Safety\n\nEach Department at Advantage must enforce a Contractor safety program that follows 29 CFR 1910.119.  The information pertaining to contractor safety is located in the Contractor Safety Guide and includes designation of specific responsibilities for contractors and employees, contractor qualifications and trainings and evaluation requirements. Management is responsible for ensuring all applicable requirements are implemented. \n\n7.Pre-Startup Safety Review\n\nThe Pre-Startup Safety Review (PSSR) is a verification process that includes confirming inspections and reviews have been conducted.  Advantage follows 29 CFR 1910.119 in order to demonstrate compliance.  The PSSR includes verification that the construction and equipment are in accordance with the design specifications, the facility is prepared to safely start-up, operations have been adequately trained, a Process Hazard Analysis ("
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093466,
      "SummaryText": "PHA) has been performance and Operating Procedures have been updated to ensure continued safe operation.\n\nThe PSSR is intended to aid in the transfer of projects from the construction phase to the operations phase. Management is responsible for assembling a team that includes personnel from operations, maintenance, engineering, and construction, implementing and documenting the PSSR review.  The review is documented in a checklist format and must be completed prior to start-up. \n\n8.Mechanical Integrity\n\nAdvantage maintains a mechanical integrity requirement covered by 29 CFR 1910.119 that includes quality assurance requirements, administration, maintenance training and documentation requirements and audits, and inspection and maintenance requirements. The program is designed to ensure the ongoing integrity of the process equipment and must ensure compliance with applicable laws, regulations, codes, and standards. It applies to all covered processes on-site, including equipment maintained by contractors, regardless of ownership. \n\n9.Safe Work Practices\n\nAdvantage has adopted safe work practices covered by 29 CFR 1910.119 and includes cold work permits, hot work permits, confined space entry, lock out/tag out, blinding and equipment isolation, flammable liquid storage and handling, ground and bonding procedures, hot tapping, disabling safety or control systems and lifting and crane operations. All work completed by employees and contractors are required to be performed in accordance with the safe work practices.\n\n10.Management of Change\n\nThe Management of Change (MOC) system at Advantage ensures that potential hazards have been thoroughly addressed before any changes are made, that all necessary training has been performed prior to startup and Process Safety Information has been updated. The MOC consists of written procedures to manage changes to process chemicals, technology, equipment, and procedures of a covered process. Advantage uses a standardized MOC form avail"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093466,
      "SummaryText": "able in the Process Safety Management Manual to document required information.\n\n11.Incident Investigation\n\nAdvantage implements an Incident Investigation program to determine the \"root cause(s)\" of an incident so that corrective action can be taken to eliminate or control a specific hazard.  The Incident Investigation is covered under 29 CFR 1910.119. If an incident occurs, employees and contractors are required to notify local management immediately.  An incident investigation team is selected and investigates the incident as soon as possible (no later than 48 hours) after the incident. A written report must be developed and be retained for five years. \n\n12.Emergency Response\n\nAdvantage has developed a comprehensive Emergency Response Plan that provides a documented approach for the effective response to any critical incident or threat of critical incident during operations. The plan outlines onsite response to an incident, the management oversight of the response and the communication of the impacts of the incident to outside parties. The response effort relies on the support from local fire, police and EMS organizations and the plan includes coordination details for incident response and external communications. \n\n13.Compliance Audits\n\nAdvantage is required to conduct a compliance audit every three years under 29 CFR 1910.119. The Compliance Audit reflects every element of the Process Safety Management Manual (PSM) and is conducted by Advantage personnel or an approved third-party consultant.  The audit includes three main sections: a review of appropriate records, observance of appropriate on-site conditions and interviews with a sample of affected employees. Recommendations from the audit are prioritized and scheduled to resolution at the earliest practical time. The audit report is to be distributed to the Plant Manager and all affected employees within 30 days after receiving the results and the PSM coordinator is responsible for maintaining and tracking the "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000093466,
      "SummaryText": "recommendation database.\n\n\n\n"
    }
  ]
}