{
  "FacilityID": 1000072823,
  "FacilityName": "Jonco Industries",
  "FacilityStr1": "1445 International Drive",
  "FacilityStr2": null,
  "FacilityCity": "Mount Pleasant",
  "FacilityState": "WI",
  "FacilityZipCode": "53177",
  "Facility4DigitZipExt": "3071",
  "FacilityCountyFIPS": "55101",
  "LEPC": "Racine LEPC",
  "FacilityLatDecDegs": "42.716965",
  "FacilityLongDecDegs": "-87.931893",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 52841608,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jonco Industries",
  "OperatorStr1": "1445 International Drive",
  "OperatorStr2": null,
  "OperatorCity": "Mount Pleasant",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53177",
  "OperatorZipCodeExt": "3071",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000239379",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-07-16 00:00:00",
  "SafetyInspectionBy": "Ahern",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-01-07 08:40:21",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-01-07 08:40:21",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-01-07 08:40:21",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091064,
      "AltID": "Aerosol Paint Storage",
      "FacilityID": 1000072823,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113854,
          "ProcessID": 1000091064,
          "ChemicalID": 98,
          "Quantity": 394000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000113855,
          "ProcessID": 1000091064,
          "ChemicalID": 118,
          "Quantity": 69000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092307,
          "ProcessID": 1000091064,
          "NAICSCode": "56191",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072823,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-08-24 00:00:00",
    "ERTrainingDate": "2018-06-13 00:00:00",
    "CoordinatingAgencyName": "South Shore Fire Department",
    "CoordinatingAgencyPhone": "2625543041",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072823,
      "SummaryText": "Jonco Industries, Inc. (Jonco) operates a contract services facility in Mount Pleasant, Wisconsin. The facility stores and repackages cans containing flammable aerosols.  The aerosol cans contain a flammable propellant comprised of propane and butane.  Flammable aerosols are received already packaged in cans with 14 and 16 ounce capacity.  The cans are then packaged into boxes and other containers for shipment.  The operation does not involve bulk quantities of flammable chemicals. \r\n\r\nFacilities that process certain listed flammable substances above specified threshold quantities are regulated pursuant to Title 40 of the Code of Federal Regulations (CFR) Part 68, Chemical Accident Prevention.  The listed threshold quantity for both propane and butane is 10,000 pounds.  Facilities that use these chemicals above this threshold in a single process must develop and implement a Risk Management Plan (RMP) under 40 CFR 68.  The RMP must also be submitted to the United States Environmental Protection Agency (USEPA) using agency software called RMP eSubmit.  \r\n\r\nThis written RMP report is the first version prepared for Jonco at this facility.  RMP information on the facility was submitted to USEPA and certified using the USEPA's eSubmit data portal on December 17, 2018. \r\n\r\nBased on the evaluation performed by Foth in conjunction with Jonco personnel, it was determined that the facility is eligible for classification under the Program Level 1 requirements.   Program Level 1 eligibility requirements are detailed in the RPM.  In summary, to be eligible for Program Level 1, the facility must demonstrate that within the past five years, the process has not had an accidental release of a regulated substance in which the offsite consequences included death, injury; or response/restoration activities of an environmental receptor.\r\n\r\nProgram Level 1 facility must include the following in the RMP:\r\n\r\n¿\tAnalyze the worst-case release scenario and submit the analysis.\r\n\r\n¿\tProvide the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072823,
      "SummaryText": "istance of 0.01 mile (52.8 feet), the facility was reviewed for receptors within that distance.  In the unlikely event that the facility concrete walls do on contain the blast, at this distance the blast extends into the employee parking lot.  There are no public or environmental receptors located within the minimum radius allowed by the eSubmit program.\r\n\r\nFinal construction of the Jonco facility was completed in 2018.  The facility has not had any accidents involving RMP chemicals since operations began earlier this year.\r\n\r\nJonco had an emergency action plan in place.  The plan includes coordinating response actions with local emergency planning and response agencies.\r\n\r\nThe RMP includes certification by Jonco that no additional prevention steps are needed.\r\n\r\nThe facility is required to review and update the RMP as specified below:\r\n\r\n¿\tAt least once every five years from the date of its initial submission or most recent update.\r\n\r\n¿\tNo later than three years after a newly regulated substance is first listed by USEPA.\r\n\r\n¿\tNo later than the date on which a newly regulated substance is first present in an already covered process above a threshold quantity.\r\n\r\n¿\tNo later than the date on which a regulated substance is first present above a threshold quantity in a new process.\r\n \r\n¿\tWithin six months of a change that requires a revised Process Hazard Analysis or hazard review.\r\n\r\n¿\tWithin six months of a change that requires a revised off-site consequence analysis.\r\n\r\n¿\tWithin six months of a change that alters the Program level that applies to any covered process.\r\n\r\nIf, in the future, Jonco becomes no longer subject to the Risk Management Program, a notice of de-registration is required to be submitted to USEPA within six months after the change, indicating that the facility is no longer covered by this program."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072823,
      "SummaryText": "five-year accident history for the process.\r\n\r\n¿\tEnsure that response actions have been coordinated with local emergency planning and response agencies.\r\n\r\n¿\tCertify that no additional prevention steps are needed.\r\n\r\n¿\tSubmit one RMP for all covered processes.\r\n\r\nUSEPA guidance (USEPA Document 550-B-99-009; Risk Management Program Guidance for Offsite Consequence Analysis was used in conjunction with USEPA's RMP*Comp model to analyze the worst-case release scenario.  The worst case consequence scenario includes the catastrophic release of a single regulated chemical in the largest single container per process.  The largest container is a 16 ounce (1.0-pound) aerosol can containing 0.29 pounds of a flammable propellant containing propane and butane.  The worst case involves the 0.29 pounds of the propane/butane mixture.  The RMP*Comp model predicts a flammable (overpressure) explosion with an endpoint of 0.005 miles (26.4 feet) from the point of origin.  In the unlikely event that the facility concrete walls do on contain the blast, at this distance the blast extends into the employee parking lot.  There are no public or environmental receptors located within the worst case scenario blast radius that would be impacted by such a release. \r\n\r\nThe worst-case scenario input values and the endpoint results are less than the minimum values allowed by the USEPA eSubmit program.  The eSubmit minimum values are 1.0 pounds of a specific chemical and a minimum endpoint distance of 0.01 miles (52.8 feet).  Therefore these values are included in the eSubmit report as representative for the Jonco facility.  \r\n\r\nDue to the RMP*Comp model data and eSubmit data differences, the RMP*Comp model was re run with the minimum flammable chemical amount of 1.0 pound.  In this scenario, the model predicts an endpoint of 0.008 miles (42.2 feet) from the point of origin.  The endpoint is also below the minimum value allowable in the eSubmit program.  In regard to the minimum eSubmit endpoint d"
    }
  ]
}