{
  "FacilityID": 1000090245,
  "FacilityName": "Ruiz Food Products, Inc.",
  "FacilityStr1": "2410 Texoma Drive",
  "FacilityStr2": null,
  "FacilityCity": "Denison",
  "FacilityState": "TX",
  "FacilityZipCode": "75020",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48181",
  "LEPC": "Grayson County LEPC",
  "FacilityLatDecDegs": "33.775000",
  "FacilityLongDecDegs": "-096.570278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9947693,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ruiz Food Products, Inc.",
  "OperatorStr1": "501 South Alta Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Dinuba",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93618",
  "OperatorZipCodeExt": null,
  "FTE": 1100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000193391",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-02-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-10-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-10-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-10-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.77593,
  "FRS_Long": -96.5703,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112232,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000090245,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140274,
          "ProcessID": 1000112232,
          "ChemicalID": 56,
          "Quantity": 107000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000113565,
          "ProcessID": 1000112232,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000095780,
              "Process_NAICS_ID": 1000113565,
              "SafetyReviewDate": "2020-07-30 00:00:00",
              "PHA_Date": "2020-07-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Facility Walkthrough Inspection",
              "PHACompletionDate": "2021-07-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "operator error",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Controlled access to facility, electronic access to ammonia equipment rooms, security cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Improvements in equipment component labeling, training practices, and daily log sheet",
              "OpProceduresReviewDate": "2020-07-29 00:00:00",
              "TrainingReviewDate": "2020-07-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-07-29 00:00:00",
              "EquipmentInspectionDate": "2020-08-31 00:00:00",
              "EquipmentTested": "Mechanical Integrity Inspection of the entire refrigeration system",
              "ChangeMgmtDate": "2020-06-08 00:00:00",
              "ChangeMgmtReviewDate": "2019-04-12 00:00:00",
              "PreStartupReviewDate": "2020-06-08 00:00:00",
              "ComplianceAuditDate": "2019-04-12 00:00:00",
              "AuditCompletionDate": "2020-10-31 00:00:00",
              "IncidentInvestigationDate": "2020-02-27 00:00:00",
              "InvestigationChangeDate": "2020-03-01 00:00:00",
              "ParticipationPlansReviewDate": "2019-04-12 00:00:00",
              "HotWorkPermitReviewDate": "2019-04-12 00:00:00",
              "ContractorSafetyReviewDate": "2020-10-13 00:00:00",
              "ContractorSafetyEvalDate": "2019-04-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000119599,
                  "PreventionProgram3ID": 1000095780,
                  "ProcessChemicalID": 1000140274
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000090245,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-02-01 00:00:00",
    "ERTrainingDate": "2019-11-23 00:00:00",
    "CoordinatingAgencyName": "Grayson LEPC",
    "CoordinatingAgencyPhone": "9035551212",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000090245,
      "SummaryText": "tee (LEPC).\r\n \r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nRuiz Foods is committed to the safety of employees as well as neighboring residents and businesses.  Continual evaluations of risks associated with the ammonia refrigeration process by in-house personnel and outside risk management professionals help to limit the possibility of unintended impacts from the ammonia system.\r\n\r\nItems identified in studies such as the recent Process Hazard Analysis Revalidation and Compliance Audit will be implemented to further reduce the risks.  Ruiz Foods also plans to improve safety as follows:\r\n \r\n -  Continued involvement of refrigeration and safety personnel in the ongoing development and implementation of the risk management policies.\r\n -  Attendance and participation of key personnel in industry groups such as RETA and IIAR ensure the facility is aware of evolving industry standards and techniques used to encourage safety.\r\n -  Conducting routine RMP and PSM meetings to ensure any issues identified by refrigeration personnel, contractors, consultants, or the safety department are discussed and addressed."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000090245,
      "SummaryText": "y as outlined in the Emergency Response and Planning policy.  The Ruiz Foods facility also has an established relationship with the local Fire Department who may be called in to assist depending on the scope of an emergency situation.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nEPA's RMP regulation defines accident as the following: \r\n\r\nThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \r\n\r\n¿\tOn-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n¿\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)). \r\n\r\nAn investigation into the facility's accident history during the PHA Revalidation study performed on July 29-30, 2020, revealed that there have been no ammonia accidents over the previous five years (July 2015 - July 2020).  In addition, there have been no injuries, property damage, or off-site consequences resulting from a release of ammonia from the Ruiz Foods Denison facility.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nRuiz Food Products, Inc. has developed a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nThe facility's emergency response equipment is regularly inspected and serviced to ensure it is properly functional.  In addition, the written plan is promptly updated to reflect any pertinent changes taking place within processes that would require a modified emergency response protocol.\r\n\r\nThe Ruiz Food Products, Inc. facility coordinates its emergency response plan with the City of Denison Fire Rescue Department as well as the Grayson County Local Emergency Planning Commit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090245,
      "SummaryText": "s.  Routine meetings are conducted with ammonia refrigeration and safety personnel at the facility to ensure that any ongoing issues identified as part of the implementation of the RMP and PSM elements are addressed.\r\n\r\nHot Work Permits\r\nRuiz Foods has developed a permitting procedure for all hot work conducted in the vicinity of the ammonia equipment and/or piping.  It documents that appropriate fire prevention measures have been implemented, and defines the work dates and scope of work to be performed.  The permit ensures that the appropriate facility management personnel are aware of ongoing hot work operations and that the facility utilizes the necessary fire prevention precautions.\r\n\r\nContractor Safety \r\nThe Ruiz Foods facility hires contractors to conduct specialized maintenance and construction activities associated with the ammonia refrigeration process.  Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance is carried out. Ruiz Foods has a strict policy of informing contractors of any known potential hazards related the contractor's work and the processes within the facility. Contractors are also informed of all procedures for emergency response and evacuation should an accidental ammonia release occur.  Routine evaluations of ammonia contractors are conducted to ensure Ruiz Foods management chooses contractors prudently.\r\n\r\nEmergency Planning & Response\r\nFacility personnel receive annual training regarding the emergency response procedures and the evacuation plan.  In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger, maintenance personnel, and/or their supervisor.  Maintenance personnel will determine what procedures, personnel, and equipment are necessary to remedy the problem.  All other plant employees will evacuate to the emergency evacuation assembly area.  Emergency agencies will also be notified as necessar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090245,
      "SummaryText": "that no new hazards are introduced to the process.\r\n\r\nPre-Startup Safety Reviews \r\nPre-Startup Safety Reviews related to new regulated processes and to modifications to the existing ammonia refrigeration system are conducted as a regular practice at Ruiz Foods. These written review procedures formally ensure that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation, and the appropriate personnel have been properly trained / notified regarding process modifications.\r\n\r\nCompliance Audits \r\nRuiz Foods conducts compliance audits on a regular basis to verify that the provisions set out under the RMP and PSM rules are adequate and are being implemented. These audits have been completed at least every 3 years since the implementation of the RMP and PSM programs, including most recently in April 2019.  Any corrective actions recommended as a result of Audits will be addressed / resolved in a safe and prompt manner.\r\n\r\nIncident Investigation \r\nRuiz Foods promptly investigates any incident that has resulted in, or could have resulted in a release of ammonia.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a similar release from occurring in the future.  All reports are retained for a minimum of five years.  Any corrective actions noted during Incident Investigations are addressed and resolved as soon as possible.\r\n\r\nEmployee Participation \r\nRuiz Foods believes that process safety management and accident prevention is a team effort and has developed a written plan to implement this philosophy.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, facility employees have access to all information created as part of the facility's implementation of the RMP rule, particularly information resulting from process hazard analyse"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090245,
      "SummaryText": "ng ammonia process equipment are competent in the operating procedures associated with the equipment.  Written procedures are used to enhance the on-the-job training.  Outside schooling resources are utilized for key personnel to ensure a comprehensive understanding of continued safe and effective operations.  Refresher training is provided at least every three years.  All training associated with the ammonia refrigeration system is documented and validated.\r\n\r\nMechanical Integrity \r\nRuiz Food Products, Inc. has a written maintenance program in place for preventative maintenance of all ammonia equipment to ensure ongoing reliability of equipment and safe operations.  Refrigeration rounds are conducted daily that require visual observation of the various ammonia components and auxiliary systems.  Any issues noted during rounds are resolved as soon as possible.\r\n\r\nEquipment maintained under this program includes pressure vessels, piping systems, evaporators and other process equipment (chillers, heat exchangers, ice makers, etc.), condensers, compressors, pumps, relief and vent systems, emergency shutdown systems, and instrumentation/controls.  System maintenance is completed only by qualified personnel with training in maintenance practices, including in-house personnel and contractors as needed.  Specialized training is provided as needed to ensure maintenance personnel are fully qualified. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \r\n\r\nManagement of Change \r\nWritten procedures are followed at Ruiz Foods to manage changes in the design of the ammonia process, technology, equipment, and procedures.  This ensures that ammonia operators, maintenance personnel, or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.  Managing and reviewing changes associated with the ammonia system also ensures"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090245,
      "SummaryText": "ts [CFR Title 29 Section 1910.119], and the EPCRA Section 302 notification requirements.  The following paragraphs briefly describe the elements of the release prevention program that are in place at the Ruiz Foods Denison facility. \r\n\r\nProcess Safety Information \r\nRuiz Food Products, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment specifications associated with the ammonia refrigeration equipment and process.  This includes design parameters and safe operating conditions, as well as details of the many safety features incorporated into the design of the ammonia refrigeration system.\r\n\r\nProcess Hazard Analysis \r\nThe facility has conducted comprehensive studies to ensure that hazards associated with the ammonia system are identified and effectively controlled.  The HAZOP methodology, Industry Safety Checklists, and process inspections have been used to carry out the process hazard analysis (PHA) studies. The studies have been conducted by a team of qualified personnel with expertise in engineering and process operations, and have been revalidated at least every five years, including most recently in July 2020.  Any findings and/or recommendations associated with the evaluation of hazards are addressed in a timely manner.\r\n\r\nOperating Procedures \r\nTo further ensure that activities are safely conducted regarding the ammonia refrigeration system, Ruiz Foods has developed written operating procedures to supplement the current on-the-job operator training.  These procedures address various modes of operation such as initial startup, normal operation, normal shutdown and startup, and emergency shutdown and startup. This information is regularly reviewed and readily accessible to operators and/or contractors who are involved in the routine operations of the ammonia refrigeration process.\r\n\r\nTraining \r\nRuiz Foods has an on-the-job training program in place to ensure that employees who are operati"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090245,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nRuiz Food Products, Inc. is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the ammonia refrigeration equipment at the Ruiz Food Products, Inc. facility in Denison, Texas. \r\n\r\nIt is the policy of Ruiz Food Products, Inc. to ensure that controls are in place to limit the risks of potential ammonia releases. If such a release does occur, the facility's emergency response personnel are trained to control and mitigate the effects of the release. The facility has coordinated emergency response activities with the City of Denison Fire Rescue Department and the Grayson County LEPC, who provide additional emergency response expertise and support.\r\n  \r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nRuiz Foods is a family owned business with a legacy of making great food since 1964.  Our brands deliver convenience, value, and great taste to American families.  Our facility in Denison, Texas is our company headquarters and the largest in our supply chain.\r\n\r\nThe primary business activities at Ruiz Food Products involve the manufacturing and subsequent cold storage of frozen food products.  Located at 2410 Texoma Drive in Denison, Texas, the facility prepares, stores, and ships frozen food products.  Ammonia is the only RMP-regulated substance at the facility, and it is used as a refrigerant in the preparation and cold storage of various food products.  The maximum inventory of ammonia at the facility is approximately 107,000 pounds.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe Ruiz Food Products, Inc. facility is in full compliance with EPA's accidental release prevention requirements as defined in 40 CFR Part 68, OSHA's Process Safety Management (PSM) requiremen"
    }
  ]
}