{
  "FacilityID": 1000106202,
  "FacilityName": "Lawson Products, Inc.-Reno Distribution Facility",
  "FacilityStr1": "1381 Capital Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Reno",
  "FacilityState": "NV",
  "FacilityZipCode": "89502",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32031",
  "LEPC": "Washoe County LEPC",
  "FacilityLatDecDegs": "39.502963",
  "FacilityLongDecDegs": "-119.754263",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lawsonproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Lawson Products, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5438890,
  "Company2DUNS": null,
  "OperatorName": "John Naso",
  "OperatorStr1": "8770 W. Bryn Mawr Ave.",
  "OperatorStr2": "Ste. 900",
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60631",
  "OperatorZipCodeExt": "3515",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238584",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-04-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-07-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-07-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-07-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.50251,
  "FRS_Long": -119.75432,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132629,
      "AltID": "Release of Flammable Aero",
      "FacilityID": 1000106202,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000166131,
          "ProcessID": 1000132629,
          "ChemicalID": 155,
          "Quantity": 53000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000148908,
              "ProcessChemicalID": 1000166131,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000148910,
              "ProcessChemicalID": 1000166131,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134062,
          "ProcessID": 1000132629,
          "NAICSCode": "42384",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106202,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-01-19 00:00:00",
    "ERTrainingDate": "2023-01-19 00:00:00",
    "CoordinatingAgencyName": "Washoe County LEPC",
    "CoordinatingAgencyPhone": "7753282003",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106202,
      "SummaryText": "ecting the local community, Lawson Products, Inc. will work closely with local, county and state agencies to help ensure public safety. These agencies take the lead in informing the public on appropriate actions in the event of an emergency.\n\nPlanned changes to improve safety: \n\nLawson Products, Inc. strives for continuous improvement in its safety program. We train our employees to safely perform their assigned tasks. We encourage employees to suggest changes or improvements that will help minimize the potential for unanticipated failure of operating equipment including forklift trucks. Our systems and programs are routinely audited, typically by an outside company or insurance carrier to evaluate their effectiveness. \n\nPlanned changes to improve safety at the facility include: \n\n            1)   Emphasis on proactive safety reporting (hazard reporting)\n2)\tIncreased safety inspections conducted by safety committee and management\n3)\tUtilize cross-functional team to improve NDEP CAPP/OSHA PSM Program"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106202,
      "SummaryText": "entative maintenance of fire suppression equipment helps ensure that the chances of an external release of process chemicals stays low.  The aerosol cage is a fenced in area that will prevent the rocketing of aerosol cans in the event of a fire.  The aerosol room is equipped with in-rack ESFR sprinklers to quickly contain a fire incident.  PM’s are conducted regularly on sprinklers, fire doors, fire extinguishers, fire pumps, etc.  The Reno Fire Department conducted their last annual inspection on 4/24/23.\n\nThe five-year accident history:\n\nLawson’s Reno facility has no history of accidental releases. Lawson Products, Inc. certifies in the RMP submission to the EPA that during the past five years, no accidental releases have occurred involving regulated flammable substances from the warehousing of aerosol products.\n\nThe emergency response program: \n\nLawson Products, Inc. has an emergency response plan, which details procedures to follow in response to an accidental release and other emergencies.  Employees are given training on this plan and it is reviewed annually.  Drills are conducted annually to ensure the emergency response plan is being followed correctly.  Following drills, employees are asked to provide feedback on the positives and negatives of the process.  If necessary, changes are made to the emergency response plan.  Employees are trained and instructed to evacuate through the nearest exit in the event of an emergency.  Employees are not responsible for any action related to containing a release or extinguishing a fire.\n\nThe emergency response plan has been shared with the Reno Fire Department.  In the event of a fire, the Reno Fire Department will be notified and they will arrive onsite.  The Reno Fire Department conducts an annual inspection of the facility and is very familiar with it.  They are aware of the chemicals that are stored onsite and they also receive SDS’s during the submittal of the annual Tier II Report.\n\nIn the event of an emergency aff"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106202,
      "SummaryText": "eview and a compliance audit is conducted every three years.  Lawson Products, Inc. is also an ISO 9001:2015 certified company and to ensure compliance, internal and external audits are performed regularly.\n\nThere are many steps taken to prevent accidental releases.  Standard Work Instructions (SWI’s) are used for tasks performed by employees.  Employees are trained to these SWI’s upon initial assignment and whenever there is a significant update.  The SWI’s outline the steps that need to be performed to perform the task correctly.  These SWI’s are also audited during ISO audits.  As far as our process of storing aerosols, there are SWI’s related to the put away of aerosol products into the cage, as well as the picking from the cage.  All forklift operators go through Powered Industrial Truck training before operating the forklift.  They also go through refresher training every 2 years.  The trainers go through a Train-the-Trainer program conducted by an outside agency.  \n\nDespite all of the training, it is possible that an accidental release could occur.  An accidental release of a process chemical at our facility would likely be a box of aerosols that was dropped.  This would be a spill that is contained within the facility and there would be no threat of the spill leaking outside of the warehouse due to the location of the aerosol cages within the facility.  The facility takes spills very seriously.  A spill response team is trained on how to clean up a chemical spill.  They will use the SDS to determine how to clean up the spill.  An incident report will be completed and corrective actions implemented to prevent this from occurring in the future.  This is all discussed in the spill response team training.  There are many other elements that contribute to the prevention of accidental releases at the Reno facility.  These consist of safety committee meetings, audits/inspections, and incident investigations.\n\nIn the event of a fire at the facility, the ongoing prev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106202,
      "SummaryText": "e room.  Level 2 and 3 aerosols are stored in the aerosol cage and room.  These areas were designed in accordance with NFPA 30B.  The aerosol room has an automatic fire door.  In the event of a fire, the cage and room prevent the aerosol cans from rocketing out.  The flammable room is where flammable liquids are stored.  The room consists of an overhead fire door, in-rack ESFR sprinklers, and a foam suppression system.  The flammable room has a spill barrier that will prevent spilled material from exiting the room.\nSome aerosol products stored in the Reno facility contain flammable propellants, which are regulated under the RMP rule if handled, manufactured, or stored in a process at a facility in a quantity greater than its listed threshold quantity.  The specified threshold quantity for flammable substances under the RMP Rule is 10,000 pounds.  The warehouse facility constitutes a single process.  The warehouse stores greater than 10,000 pounds of butane and propane in aerosol products.  The aerosol products are typically in metal containers, with 24 ounces being the maximum aerosol can size.  The average weight of these aerosol products is 17.28 oz. and the average amount of propellant in each can is 14%.  Per EPA Helpline, the worst-case scenario was clarified as the release of the largest quantity of a regulated substance from a single aerosol can.  The worst-case scenario was based on the highest containing propane/butane mixed product that is a 16 oz. aerosol can containing 25% propane and 60% butane.  The quantity released in a vapor cloud explosion would not affect any residential population or public receptor or have any off-site consequences.\nThe general accidental release prevention program and chemical-specific prevention steps: \n\nLawson Products, Inc. has a strong accidental release prevention program.  The facility is in compliance with the OSHA Process Safety Management (PSM) Standard 1910.119 and to ensure compliance, management conducts an annual r"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106202,
      "SummaryText": "The accidental release prevention and emergency response policies at your facility:\n\nLawson Products, Inc. is committed to worker and public safety in the operation of our Reno distribution center facility.  Senior management, both onsite and at the corporate headquarters, are committed to maintaining a strong safety program.  Safety training is conducted regularly for a variety of topics and an employee safety committee conducts monthly meetings and inspections.  Safety audits are performed by Corporate Safety, as well as external agencies, such as CNA Insurance.  Chemical safety is very important to us.  We have a Hazard Communication program and annual training on the program is conducted for all employees.  Safety Data Sheet’s (SDS’s) are retained onsite and available to all employees.  During Hazard Communication training, as well as the various DOT trainings conducted, employees learn what the labels on the chemicals mean.  We also have a spill response team who is trained on how to respond to a chemical spill.  In the event of a spill, the spill response team will be notified and they will use the SDS to determine how to clean up the spill.  Overall, Lawson Products Inc. is committed to safety and has a strong chemical safety program.  The accidental release prevention program and the emergency response program will be discussed in more detail later on in this executive summary.\nOur facility and the regulated substances handled:\nLawson Products, Inc. is an industrial distributor of maintenance and repair supplies.  We are not a manufacturer.  The facility receives, stores, and ships products.  Our RMP process is the storage of aerosols.  The facility consists of a warehouse and an office.  The warehouse contains storage racks and locations, as well as loading docks for shipping and receiving.  Product is moved throughout the warehouse via forklifts and conveyors.  For chemical storage, the warehouse has an aerosol cage, an aerosol room, and a flammable storag"
    }
  ]
}