{
  "FacilityID": 1000036204,
  "FacilityName": "Whiting Clean Energy",
  "FacilityStr1": "2155 Standard Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Whiting",
  "FacilityState": "IN",
  "FacilityZipCode": "46394",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.673889",
  "FacilityLongDecDegs": "-087.477556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.bp.com",
  "FacilityEmailAddress": "Curtis.Hartsook@bp.com",
  "FacilityDUNS": 37656068,
  "ParentCompanyName": "BP Alternative Energy",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BP Alternative Energy",
  "OperatorStr1": "2155 Standard Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Whiting",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46394",
  "OperatorZipCodeExt": null,
  "RMPContact": "Erika Harding",
  "RMPTitle": "General Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176445",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T0892988500449",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-09-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.67389,
  "FRS_Long": -87.47756,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044393,
      "AltID": "Anhydrous NH3 storage tnk",
      "FacilityID": 1000036204,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000044815,
          "ProcessID": 1000044393,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053437,
          "ProcessID": 1000044393,
          "ChemicalID": 56,
          "Quantity": 57000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000553437,
          "ProcessID": 1000044393,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036204,
      "SummaryText": "The BP Whiting Clean Energy facility is a 525-megawatt gas-fired, combined-cycle cogeneration facility that produces steam for the adjacent BP Whiting Refinery. The facility is located on the BP Whiting Refinery property at 2155 Standard Avenue in Whiting, Indiana. BP Whiting Clean Energy is owned and operated by BP Alternative Energy.\n\nBP Whiting Clean Energy uses selective catalytic reduction (SCR) to control emissions of nitrogen oxides (NOX) from the facility's two heat recovery steam generators. The SCR system reduces NOX emissions by reacting ammonia with exhaust gas NOX in the presence of a catalyst to yield elemental nitrogen and water vapor.\n\n\n\nAnhydrous ammonia, a liquefiable colorless gas with a sharp, intensely irritating odor, is stored in a 13,000-gallon storage tank located at the Whiting Clean Energy facility. The tank can be charged to 85% of its fill capacity (11,050 gallons) in accordance with 29 CFR 1910.111 Section (b)(11)(ii). At full capacity, the tank can store 57,000 pounds of anhydrous ammonia (assuming a density of 5.15 lb/gallon at 60? F).\n\n\n\nBP Whiting Clean Energy stores more than 10,000 pounds of anhydrous ammonia in a 13,000-gallon pressurized tank. Anhydrous ammonia is listed in 40 CFR 68.130 (Table 1) as a regulated toxic substance with a threshold quantity of 10,000 pounds The facility's use and storage of anhydrous ammonia is therefore a covered process and is subject to the risk management program requirements.\n\n\n\nAccidental Release Prevention Program\n\n\n\nBP Whiting Clean Energy is committed to the safe operation of the SCR anhydrous ammonia process at the Whiting facility. This commitment is demonstrated by the resources BP Whiting Clean Energy has invested in accident prevention, personnel training, and considering safety in the design, installation, operation, and maintenance of the anhydrous ammonia storage tank. BP Whiting Clean Energy's policy is to implement reasonable controls to prevent releases of regulated substances. H"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036204,
      "SummaryText": "owever, if a release does occur, the BP Refinery HAZMAT Team will respond to, contain, and control the release.\n\n\n\nBP Whiting Clean Energy has developed a written PSM program to protect employees and the surrounding community from exposure to an accidental release of anhydrous ammonia. BP Whiting Clean Energy's implementation of the PSM program includes employee education in the hazards of anhydrous ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia. The plan includes preventive maintenance programs (mechanical integrity) for the anhydrous ammonia system that incorporates inspections of the system in accordance with recognized standards of equipment inspection within the ammonia industry, as well as tests of system components in accordance with component manufacturers' recommendations.\n\n\n\nFive-year Accident History\n\n\n\nThe RMP regulations require facilities to compile a five-year accident history. This is defined as \"all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage\" (40 CFR Part 68.42). Since the submission of the September 2008 update of the BP Whiting Clean Energy RMP, no accidental releases of anhydrous ammonia resulting in the consequences listed in 40 CFR Part 68.42 have occurred.\n\n\n\nEmergency Response Program\n\n\n\nBP Whiting Clean Energy's emergency response plan stresses handling of accidental releases of anhydrous ammonia and coordination with local emergency response agencies. The response plan details the emergency response organizational structure and includes personnel responsibilities and procedures within that structure. The procedures address all aspects of emergency response including proper first aid, medical treatment for exposures, evacuation plans, accounting for missing employees, and notification of local"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036204,
      "SummaryText": " emergency response agencies and the public if a release occurs. The plan also includes procedures for notification of local agencies in the event of an incident, facility evacuation, and decontamination. Finally, the plan discusses emergency preparedness and planning, including plans for conducting emergency response team training and drills.\n\n\n\nThe management of BP Whiting Clean Energy is committed to supporting the emergency response team and its prescribed functions. The emergency response team operates in conjunction with the BP Whiting Refinery HAZMAT Team, the local Whiting Fire Department and the Lake County LEPC."
    }
  ]
}