{
  "FacilityID": 1000037545,
  "FacilityName": "South Coles Levee Gas Plant - California Re",
  "FacilityStr1": "10 Miles West Old River Rd,Hwy 119",
  "FacilityStr2": "25761 Hwy 119",
  "FacilityCity": "Tupman",
  "FacilityState": "CA",
  "FacilityZipCode": "93276",
  "Facility4DigitZipExt": "0219",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.251722",
  "FacilityLongDecDegs": "-119.279639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "holly.arnold@crc.com",
  "FacilityDUNS": 17101887,
  "ParentCompanyName": "California Resources Corporation",
  "Company2Name": null,
  "CompanyDUNS": 70142740,
  "Company2DUNS": 0,
  "OperatorName": "California Resources Elk Hills, LLC",
  "OperatorStr1": "28590 Highway 119",
  "OperatorStr2": null,
  "OperatorCity": "Tupman",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93276",
  "OperatorZipCodeExt": null,
  "RMPContact": "Micky Nelson",
  "RMPTitle": "Operations Manager",
  "FTE": 566,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000112576",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "S-40",
  "SafetyInspectionDate": "2013-04-25 00:00:00",
  "SafetyInspectionBy": "Environmental Health Hazardous Material Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-11-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-03-08 00:00:00",
  "DeRegistrationEffectiveDate": "2017-02-07 00:00:00",
  "AnniversaryDate": "2018-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.2924,
  "FRS_Long": -119.3264,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "0.6",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000046042,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 1000037545,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000046444,
          "ProcessID": 1000046042,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000055690,
          "ProcessID": 1000046042,
          "ChemicalID": 155,
          "Quantity": 387887.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000048301,
              "ProcessChemicalID": 1000055690,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048302,
              "ProcessChemicalID": 1000055690,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048303,
              "ProcessChemicalID": 1000055690,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048304,
              "ProcessChemicalID": 1000055690,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000555690,
          "ProcessID": 1000046042,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037545,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies\n\nCalifornia Resources Elk Hills, LLC. (CREH) is strongly committed to employee and  public safety, as well as\n\nsound environmental practices.  This commitment is demonstrated by our comprehensive accidental release\n\nprevention program that covers areas such as design, installation, operating procedures, maintenance, and\n\nemployee training associated with the processes at our facility. It is our policy to implement appropriate\n\ncontrols to prevent possible releases of regulated substances.\n\n\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nThe CREH stationary source contains  processes related to natural gas production  Within this process,\n\nCREH has identified flammable substances that are present in amounts that exceed the threshold quantities. \n\nThe process are assigned to a Level 1 Prevention Program as 1) there have been no accidents in the\n\npast five (5) years that resulted in significant off-site impacts, 2) there are no public receptors within the\n\nworst case scenario endpoint distances, and 3) the emergency response plan has been coordinated with local\n\nresponders.  \n\n\n\n3.  The Worst Case Release Scenario, including administrative controls and mitigation measures to limit the\n\ndistances for each reported scenario.\n\nWorst Case Scenarios, which involve release of the entire contents of the largest vessels and pipelines, were\n\nmodeled for regulated toxic and flammable substances in each process using the EPA RMP Offsite\n\nConsequence Analysis Guidance tables and equations.  Administrative controls considered in the analysis\n\ninclude inventory limitations for storage vessels based upon high level alarms and shut-downs to ensure\n\nadequate \"head space\".  No mitigation measures were considered that would serve to limit the distances for\n\nthese scenarios.  Worst case scenario analysis determined that there are no public receptors or\n\nenvironmental receptors within the distance to the to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037545,
      "SummaryText": "xic or flammable substance endpoints.\n\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps Our\n\nfacility has taken all steps necessary to comply with the accidental release prevention requirements set out\n\nunder 40 CFR part 68 of the EPA.\n\nThe following sections briefly describe the elements of the release prevention program that is in place at\n\nCREH. These elements are the basis for Process Safety Management system as required under 29 CFR\n\n1910.119 / CalOSHA ? 5189.\n\n\n\nProcess Safety Information\n\nCREH maintains a detailed record of safety information that describes the hazards of the chemicals used in\n\nthe processes, information regarding the technology of the process (process chemistry, process flow\n\ndiagrams, safe upper and lower limits for process parameters, etc.), and detailed equipment information\n\n(materials of construction, piping and instrument  diagrams, design codes and standards, safety systems,\n\netc.).\n\n\n\nProcess Hazard Analysis\n\nCREH conducts comprehensive studies to ensure that hazards associated with processes are identified and\n\nappropriately managed. The primary methodology used to conduct these analyses is Hazard And Operability\n\n(HAZOP) studies.  The studies are undertaken by a team of qualified personnel with expertise in engineering\n\nand process operations and are revalidated at a regular interval of 5 years.  Findings related to the hazard\n\nanalysis are addressed in a timely manner based on relative risk of potential hazards.\n\nOperating Procedures\n\nFor the purpose of safely conducting activities within covered processes, OEHI maintains written operating\n\nprocedures. These procedures address various modes of operation such as initial startup, normal operations,\n\ntemporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a\n\nturnaround. The information is regularly reviewed and is readily accessible to operators involved in the\n\nprocesses.\n\n\n\nTraining\n\nCREH has"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037545,
      "SummaryText": " a comprehensive training program in place to ensure that employees who are operating processes\n\nare competent in the operating procedures associated with these processes as well as emergency response\n\nactivities. Refresher training is provided every 3 years.\n\nMechanical Integrity\n\nCREH carries out documented inspections, tests, and maintenance checks of process equipment to ensure\n\nadequate mechanical integrity.  These activities are conducted by the Mechanical Integrity group and\n\nMaintenance persons.  Only qualified personnel are permitted to carry out inspections, tests, and\n\nmaintenance activities on process equipment and systems such as pressure vessels, storage tanks, piping\n\nsystems, relief and vent systems, emergency shutdown systems, pumps, compressors and electrical\n\nequipment. Specialized training is provided as needed for certain maintenance checks.  Equipment\n\ndeficiencies identified by the maintenance checks are tracked to completion through the company\n\nmaintenance work order system and corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nA Management of Change program is in place at OEHI to manage changes in process chemicals, technology,\n\nequipment, procedures, and personnel. Process operators, maintenance personnel or any other employee\n\nwhose job tasks are affected by a modification in process conditions are promptly made aware of and trained\n\non the modification.\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications of established processes are\n\nconducted whenever there is a change in the safety information as part of the Management of Change\n\nprocess. These reviews are conducted to confirm that construction, equipment, operating and maintenance\n\nprocedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nCREH conducts internal audits on a regular basis to verify compliance and effectiveness of the prevention\n\nprogram elements defined by the RMP ru"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000037545,
      "SummaryText": "le and OSHA Process Safety Management.  Although compliance\n\naudits are required at least every 3 years under OSHA PSM, current practice is to conduct audits on an annual\n\nbasis.  Corrective actions required as a result of the audits are tracked to completion through the company\n\naction tracking system.\n\nIncident Investigation\n\nCREH promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic\n\nrelease of a regulated substance. These investigations are undertaken to identify the situation leading to the\n\nincident as well as any corrective actions to prevent future releases. All reports are retained for a minimum of\n\n5 years.\n\n\n\nEmployee Participation\n\nCREH believes that process safety management and accident prevention is a team effort. Company\n\nemployees are strongly encouraged to express their views concerning accident prevention issues and to\n\nrecommend improvements. In addition, employees have access to all information created as part of the\n\nfacility's implementation of the RMP rule, including Process Hazard Analyses (PHAs).\n\nContractors\n\nCREH utilizes contractors to conduct specialized maintenance and construction activities. Prior to selecting a\n\ncontractor, a thorough evaluation of safety performance of the contractor is carried out. OEHI has a strict\n\npolicy of informing the contractors of known potential hazards related the contractor's work and the\n\nprocesses. Contractors are also informed of all the procedures for emergency response should an accidental\n\nrelease of a regulated substance occur.\n\n\n\n5.  Five-year Accident History\n\nCREH has had an excellent record of preventing accidental releases during the last 5 years. Due to effective\n\nrelease prevention program elements, there has been no accidental releases during this period that meet the\n\nRMP reporting requirements.\n\n\n\n6.  Emergency Response Plan\n\nCREH maintains a written emergency response plan (Emergency Management Plan) that covers accidental\n\nreleases of ha"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000037545,
      "SummaryText": "zardous materials. The plan includes all aspects of emergency management, including adequate\n\nfirst aid and medical treatment, evacuations, notification of local emergency response agencies and the\n\npublic, as well as post-incident decontamination of affected areas. To ensure proper functioning, emergency\n\nresponse equipment is regularly inspected and serviced. In addition, the Emergency Management Plan is\n\nregularly updated to reflect any pertinent changes taking place within our processes that would require a\n\nmodified emergency response.\n\n\n\n"
    }
  ]
}