{
  "FacilityID": 1000096051,
  "FacilityName": "Phillips 66 Pasadena Terminal",
  "FacilityStr1": "233 N. Phillips Road",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77506",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Southeast Regional LEPC",
  "FacilityLatDecDegs": "29.722830",
  "FacilityLongDecDegs": "-95.165121",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Phillips 66 Pipeline LLC",
  "Company2Name": null,
  "CompanyDUNS": 135473770,
  "Company2DUNS": 0,
  "OperatorName": "Phillips 66 Pipeline LLC",
  "OperatorStr1": "2231 City West Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77042",
  "OperatorZipCodeExt": null,
  "RMPContact": "Alonzo Techeira",
  "RMPTitle": "Terminal Supervisor",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000233598",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-106",
  "SafetyInspectionDate": "2016-09-14 00:00:00",
  "SafetyInspectionBy": "Texas Railroad Commission",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-09-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119120,
      "AltID": "Butane Blending System",
      "FacilityID": 1000096051,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000120452,
          "ProcessID": 1000119120,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000148952,
          "ProcessID": 1000119120,
          "ChemicalID": 118,
          "Quantity": 500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000648952,
          "ProcessID": 1000119120,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096051,
      "SummaryText": "The Phillips 66 Pasadena Terminal is committed to providing a safe work environment for employees and to being a responsible corporate citizen. Phillips 66 believes that excellent performance in the areas of health, environment, safety, and security goes hand-in-hand with operational excellence and financial success. In fulfilling this commitment, the Phillips 66 Pasadena Terminal will comply with regulatory requirements and provide and maintain a safe working environment using acceptable and proven business practices. All Phillips 66 employees will strive to identify and eliminate hazards which could result in injury and illness, damage to the environment, property damage, and security losses. The Phillips 66 Pasadena Terminal is operated and maintained in a manner that protects the environment, as well as the health and safety of its employees, contractors, and the community in which it operates. Phillips 66 promotes health, safety, and the environment through programs of awareness, compliance, prevention and protection. These programs include a combination of accidental release prevention and emergency response planning. This summary provides a brief overview of the risk management activities that we have designed and implemented. \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES \n\nPhillips 66 Pasadena Terminal is a light product, bulk petroleum storage facility used for storage and distribution of petroleum products to retail and commercial end-users in the vicinity of Pasadena, OK. The Terminal handles and stores various grades of unleaded gasoline, low-diesel fuel, and additives. The Phillips 66 Pasadena Terminal complies with Process Safety and RMP Regulations in the covered process which encompasses the Butane unloading station, Butane storage vessels, valves, pump, associated piping and ancillary equipment. Butane is stored in two vessels and transferred to/blended with gasoline (product rack injection) using a fixed piping system and an injection skid. The on"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096051,
      "SummaryText": "ly covered substance on site above threshold quantities is butane. \n\n\n\nHAZARD ASSESSMENT RESULTS\n\nThe objectives of this hazard assessment are twofold: (1) satisfy the requirements of the RMP regulation and (2) provide Offsite Consequence Analysis (OCA) information that will help local emergency planning officials improve community emergency response in the event of an accidental release at the refinery. Due to the nature of covered substance (butane), OCA focused on potential releases of flammable materials. In modeling flammable materials, the stationary source is required to present distances to endpoints resulting from any of the following: \n\n- Explosion: Overpressure of 1 Psig \n\n- Radiant Heat/Fire: Radiant heat of 5 kW/m2 for 40 seconds. \n\n- Lower Flammability Limit: a lower flammability limit as provided in NFPA documents or other generally recognized sources.\n\n \n\nThe facility has submitted to the EPA a worst case and alternative release scenario for the regulated substance held in the covered process. The facility has modeled alternative release scenarios (ARSs) to show release scenarios that may have a more realistic chance of occurrence. Even the ARSs are rare events. The details of the process release conditions assumed for the hazard scenarios and assumptions made are provided in the Worst and Alternative Case Release Scenarios sections of the 2021 RMP Resubmission. \n\nSince no changes in inventory of the regulated substance or the operating conditions of the covered process have occurred in the last 5 years, the facility revalidated the Worst-Case and Alternate Scenarios that were modeled for the 2016 submission.  \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS \n\nPhillips 66's accidental release prevention programs and emergency planning and response programs help effectively manage the hazards posed by the facility's regulated substance to employees, contractors, the public, and the environment. The covered process is regulated by the EPA RMP regulat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096051,
      "SummaryText": "ion 40 CFR Part 68 and the OSHA Process Safety Management Standard 29CFR 1910.119. Due to that fact, the accident prevention and risk management plan is organized to be consistent with the PSM regulation requirements. The following accident prevention programs are in place at the Phillips 66 Pasadena Terminal: \n\n1.Employee Participation, \n\n2.Process Safety Information, \n\n3.Process Hazard Analysis (PHA), \n\n4.Standard Operating Procedures,\n\n5.Operator Training, \n\n6.Contractors, \n\n7.Pre-startup Safety Review, \n\n8.Mechanical Integrity,\n\n9.Hazardous Work Authorization (Hot Work, etc.), \n\n10.Management of Change,\n\n11.Incident Investigation, \n\n12.Emergency Procedures/Planning, \n\n13.Compliance Audits, and \n\n14.Trade Secrets\n\n\n\nFIVE YEAR ACCIDENT HISTORY \n\nThe RMP rule requires facilities to compile a 5-Year Accident History for all RMP regulated substances in covered processes at the facility. As part of the ongoing PSM Program, the facility documents and tracks all incidents and near misses that occur within the facility. This incident database serves as the basis for the five-year accident history. \n\nRMP requires facilities to report any incident from a covered process involving a regulated substance and resulting in any of the following:\n\n- Onsite deaths, injuries, or significant property damage \n\n- Offsite deaths, injuries, property damage, evacuations, sheltering-in-place, or environmental damage\n\nThe covered process/stationary source started operations in September 2016. Since the initial startup no accidents, as defined in 40 CFR Part 68.42, have occurred. \n\n\n\nEMERGENCY RESPONSE PROGRAM \n\nThe Phillips 66 Pasadena Terminal Facility Response Plan provides the essential planning and training for protecting employees, the public, and the environment during emergency situations. Contained within the Plan are written procedures that outline the actions to be taken for various types of emergencies that could occur in the facility. These emergencies may include airborne rele"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096051,
      "SummaryText": "ases of chemical substances or flammable materials, spills to the water or ground, fires, explosions, and personnel medical emergencies. \n\nAs a responsible owner operator of a stationary source, in compliance with 68.210(b), the terminal will hold a public meeting to provide information required under ?68.42(b), no later than 90 days after any RMP reportable accident at the stationary source with any known offsite impact specified in ?68.42(a) (i.e., known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage). The terminal also holds annual meeting and communication with the county LEPC\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY EPA FACILITY \n\nPhillips 66 is continually striving to make the Phillips 66 Pasadena Terminal the safest and most reliable workplace possible for its employees, neighbors, and community. The facility's focus is safe, reliable, and environmentally sound operations. The goal of the Phillips 66 Pasadena Terminal is to demonstrate continuous improvement in its health, environmental and safety performance. In addition, Phillips 66 will work cooperatively with our neighbors to ensure the health, environment, safety and security of the Phillips 66 Pasadena Terminal and surrounding community. Since the initial startup one PHAs revalidation have been conducted to improved process safety using LOPA for assessing high consequence scenarios. In 2020, a new IPL was added to the covered process to prevent loss a primary containment due to pump seal failures.\n\n\n\n"
    }
  ]
}