{
  "FacilityID": 1000066057,
  "FacilityName": "BARD MADISON OPERATIONS",
  "FacilityStr1": "1211 MARY MAGNAN BLVD",
  "FacilityStr2": null,
  "FacilityCity": "MADISON",
  "FacilityState": "GA",
  "FacilityZipCode": "30650",
  "Facility4DigitZipExt": "4775",
  "FacilityCountyFIPS": "13211",
  "LEPC": "Morgan Cty Em Mgmt Agency",
  "FacilityLatDecDegs": "33.5718",
  "FacilityLongDecDegs": "-83.4632",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "IO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CR BARD, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BARD MADISON OPERATIONS",
  "OperatorStr1": "8195 Industrial Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Covington",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30014",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nadia Carrillo",
  "RMPTitle": "EHS&S Program Leader",
  "FTE": 20,
  "OtherEPAFacilityID": "30650BRDMD1211M",
  "EPAFacilityID": "100000236737",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-11-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-11-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-07-02 00:00:00",
  "DeRegistrationEffectiveDate": "2019-06-18 00:00:00",
  "AnniversaryDate": "2022-11-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000082797,
      "AltID": "EO for product sterili",
      "FacilityID": 1000066057,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000083999,
          "ProcessID": 1000082797,
          "NAICSCode": "339112",
          "_desc": {
            "NAICS_CODE": "339112",
            "NAICS_DESCRIPTION": "Surgical and Medical Instrument Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000102946,
          "ProcessID": 1000082797,
          "ChemicalID": 9,
          "Quantity": 10200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000602946,
          "ProcessID": 1000082797,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066057,
      "SummaryText": "C R Bard, Inc. (Bard) uses ethylene oxide (EO) to sterilize packaged medical equipment, supplies and devices.  The facility operates seven sterilization vessels.  EO is fed to Vessels 1 through 6 from a drum manifold room.  The drum manifold room contains twelve drums that contain EO in liquid phase, with six vaporizers (one vaporizer per vessel, with two drums per vaporizer) containing EO liquefied under pressure.  EO is fed to the seventh vessel from a separate drum manifold room, with one vaporizer and two drums.\n\n\n\nEach drum is a 400-pound capacity steel double-walled drum.  The maximum EO capacity of the Vessel 1 - 6 drum manifold room is 4,800 pounds.  The maximum EO capacity of the seventh vessel drum manifold room is 800 pounds.  In addition, EO drums are stored in an open, fenced area outside the main building.  Total mass of EO onsite will periodically exceed 10,000 pounds.\n\n\n\nIn accordance with 40 CFR 68.10(b), the facility is eligible for Program 1 since:\n\n\n\n? For the five years prior to submission of this RMP, the process has not had an accidental release of a regulated substance where exposure to the substance, its reaction products, overpressure generated by an explosion involving the substance, or radiant heat generated by a fire involving the substance led to any offsite deaths, injuries or response or restoration activities for an exposure of an environmental receptor;\n\n? The distance to a toxic endpoint for a worst-case release assessment is less than the distance to any public receptor; and\n\n? Emergency response procedures have been coordinated between the facility and local emergency planning and response organizations.\n\n\n\nThe worst-case release scenario for this facility is severing of a ?-inch line from an EO drum when it is full, resulting in a release of 400 pounds of EO gas within 12 minutes, followed by vapor cloud dispersion.  The distance to the toxic endpoint of 0.09 mg/L under the worst-case scenario was calculated using the ALOHA (Are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066057,
      "SummaryText": "al Locations of Hazardous Atmospheres) modeling software, version 5.4.6, developed by USEPA Office of Emergency Management and NOAA Emergency Response Division.  The distance to the toxic endpoint is 0.27 miles for the worst-case scenario.  There are no public or environmental receptors within this distance. \n\n\n\nAlthough not required for facilities subject to Program 1 requirements. Bard has identified and analyzed an alternative case scenario, which 40 CFR 68.28 describes as a release scenario that is more likely to occur than the worst-case release scenario and that will reach an endpoint offsite.  The selected scenario includes failure of a sterilization chamber, resulting in release of the maximum contents of a chamber during the sterilization process, or 17 pounds of EO.  The ALOHA model predicted a distance to the toxic endpoint of 0.2 miles for the alternative scenario.  There are no public or environmental receptors within this distance.\n\n  \n\nThe subject Bard facility has never had an accident involving EO that caused deaths, injuries, property, or environmental damage, evacuations or shelterings-in-place.\n\n  \n\nIn the event of an emergency involving the EO system, it is Bard's policy to notify the Morgan County Fire Department and request that they respond to the emergency.  Bard has discussed this policy with the fire department and members of the fire department have inspected the EO system. They have the equipment necessary to control an emergency of this magnitude and Bard has documentation from them verifying this.\n\n"
    }
  ]
}