{
  "FacilityID": 1000076060,
  "FacilityName": "City of Kerrville - Water Treatment Plant",
  "FacilityStr1": "1000 Thompson Drive",
  "FacilityStr2": null,
  "FacilityCity": "Kerrville",
  "FacilityState": "TX",
  "FacilityZipCode": "78028",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48265",
  "LEPC": "Kerr County LEPC",
  "FacilityLatDecDegs": "30.052778",
  "FacilityLongDecDegs": "-99.166944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kerrvilletx.gov",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 99576241,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Kerrville",
  "OperatorStr1": "701 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Kerrville",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78028",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Loveland",
  "RMPTitle": "Asst Director of Public Works",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062941",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-12-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-02-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-02-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-02-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-02-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.04744,
  "FRS_Long": -99.15363,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094617,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 1000076060,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000095879,
          "ProcessID": 1000094617,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118387,
          "ProcessID": 1000094617,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618387,
          "ProcessID": 1000094617,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000076060,
      "SummaryText": "City of Kerrville\n\nWater Treatment Plant\n\nRISK MANAGEMENT PROGRAM\n\nEXECUTIVE SUMMARY\n\n\n\nCity of Kerrville owns and operates a municipal water treatment facility in the City of Kerrville, Kerr County, Texas. City of Kerrville has reviewed its obligations under EPA's Risk Management Program Rule (RMP Rule, Section 112(r) of the Clean Air Act). The City of Kerrville Water Treatment Plant is committed to the safety of our workers, the public, and the environment.  The resources invested in the prevention of accidental releases of hazardous substances demonstrate this commitment.  The City of Kerrville Water Treatment Plant implements reasonable controls, such as training of personnel and the safe design, installation, operation and maintenance of our processes.  Our policy is to make every effort to prevent the release of hazardous substances but in the event of a release, our trained personnel and local emergency response agencies will respond to control and contain the release in a manner that will be safe for workers and will help prevent injuries to the public or the environment.\n\n\n\n\n\nCity of Kerrville has implemented safety precautions to prevent and mitigate any release. In addition to maintenance, training, and inspection procedures, City of Kerrville has an active monitoring and alarm system that will detect a release and sound a local alarm and send an alarm notification. \n\nCity of Kerrville has coordinated with local emergency responders for the City.\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\n\n\nThe RMP Rule requires that a prevention program be established for The City of Kerrville Water Treatment Plant water treatment processes.  The following details the prevention program elements at The City of Kerrville Water Treatment Plant that apply to these processes.\n\n\n\n1.    Safety Information\n\n\n\nThe City of Kerrville Water Treatment Plant maintains a variety of technical documents that are used to help ensure safe operation of T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000076060,
      "SummaryText": "he City of Kerrville Water Treatment Plant processes.  Safety data sheets (SDSs) document the physical and chemical properties of hazardous substances handled at The City of Kerrville Water Treatment Plant.  The engineering design documents include the operating parameters, the design basis and configuration of the equipment in each covered process, and references to applicable codes and standards.\n\n\n\n\n\n2.    Hazard Review\n\n\n\nThe City of Kerrville Water Treatment Plant performs and periodically updates hazard reviews of the covered processes to help identify and control process hazards.  The City of Kerrville Water Treatment Plant operates and maintains the equipment in a manner consistent with the applicable design specifications, codes, standards, and regulations.\n\n\n\n3.    Operating Procedures\n\n\n\nThe City of Kerrville Water Treatment Plant develops and maintains operating procedures to define how tasks related to process operations should be performed.  The operating procedures are used to:\n\n\n\na) train employees and contractors, and\n\nb) serve as reference guides for appropriate actions to take during both normal and abnormal process conditions.\n\n\n\n4.    Training\n\n\n\nThe City of Kerrville Water Treatment Plant trains personnel in the operating procedures to help ensure safe and effective performance of their assigned tasks. A record of all training is maintained to help ensure new and refresher training is provided on a timely basis.\n\n\n\n5.    Maintenance\n\n\n\nThe City of Kerrville Water Treatment Plant properly maintains the equipment in our processes.  The City of Kerrville Water Treatment Plant maintenance program includes:\n\n\n\na)    procedures to safely guide workers in their maintenance tasks,\n\nb)    worker training in the maintenance procedures, and\n\nc)    inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\n\n\n6.     Emergency Response Programs\n\n\n\nThe City of Kerrville Water Treatment Plant has prepared a written emergency action pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000076060,
      "SummaryText": "n that complies with the RMP Rule.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  The City of Kerrville Water Treatment Plant periodically conducts emergency drills to test our emergency plan and coordinate these drills with the local fire department.\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}