{
  "FacilityID": 1000067598,
  "FacilityName": "Brandt Consolidated, Inc",
  "FacilityStr1": "12222 Avenue 352",
  "FacilityStr2": null,
  "FacilityCity": "Visalia",
  "FacilityState": "CA",
  "FacilityZipCode": "93291",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.429496",
  "FacilityLongDecDegs": "-119.298851",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "AO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.brandt.co",
  "FacilityEmailAddress": "Rick.Cathcart@brandt.co",
  "FacilityDUNS": 25758475,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brandt Consolidated, Inc.",
  "OperatorStr1": "12222 Avenue 352",
  "OperatorStr2": null,
  "OperatorCity": "Visalia",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93291",
  "OperatorZipCodeExt": null,
  "RMPContact": "Felipe Beccera",
  "RMPTitle": "Plant Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000237727",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-10 00:00:00",
  "SafetyInspectionBy": "Ransome Manufacturing",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-02-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-02-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-02-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-02-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000084909,
      "AltID": "Ag Fertilizer Blending",
      "FacilityID": 1000067598,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086119,
          "ProcessID": 1000084909,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000105969,
          "ProcessID": 1000084909,
          "ChemicalID": 56,
          "Quantity": 78200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000605969,
          "ProcessID": 1000084909,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067598,
      "SummaryText": "This report has been developed to satisfy the requirements of the California Accidental Release Prevention (CalARP) regulation to prepare and submit a Risk Management Program (RMP) document. This RMP document describes Anhydrous Ammonia storage at Brandt Consolidated (hereafter referred to as Brandt) facility located at 12222 Avenue 352 Visalia, CA 93292 figure 1. A site vicinity map is included as Figure 2.\n\n\n\nThe CalARP program has three program levels that could apply. This facility does not qualify for Program 1 since the distance to a toxic endpoint for a worse-case release is more than the distance to any public receptor. The facility also does not meet the requirements for Program Level 2.  Due to process quantity and impact to receptors the facility process meets the requirements listed in 2735.4 (e) as a CalARP Program Level 3, which includes process safety management standards. \n\n\n\nA.    The Accidental Release Prevention and Emergency Response Policies at the Stationary Source. \n\n\n\nBrandt is committed to being a responsible member of the community in which it operates and is prepared to give top priority to operating in a safe and environmentally sound manner. Brandt will assure that adequate training is provided to employees to minimize accidental release of materials which are deemed hazardous.\n\n\n\nB.    A Description of the Stationary Source and Regulated Substances Handled\n\n\n\n1.    Description of the Stationary Source \n\nBrandt produces agricultural fertilizers'. Brandt currently uses 100% Anhydrous Ammonia to prepare fertilizer products for wholesale. Their fertilizer products are prepared by mixing reagents that are manufactured at other facilities; no chemical reagents are manufactured at the Brandt Visalia Facility.\n\n\n\n2.    Description of Process\n\nThe storage of Anhydrous Ammonia is the process covered by this RMP. There is one nominally sized 18,000-gallon vessel dedicated to the storage of Anhydrous Ammonia; the verified capacity of the vessel is 18,000 gallo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067598,
      "SummaryText": "ns, only one vessel is used therefore the maximum volume of Anhydrous Ammonia is considered in the covered process is 18,000 gallons (92,700 pounds). The Anhydrous Ammonia storage vessel is identified in red in Figure 3; only one vessel is considered the covered process. It should be noted that the maximum fill is approximately 85% for safe operation of the vessel\n\n\n\nC.    The Worst-Case Release Scenario(s) and the Alternative Release Scenario(s) (2745.4)\n\nWell-documented offsite consequence analyses are essential to adequate communication of potential hazards at the stationary source. Brandt conducted offsite consequence analysis, using the Environmental Protection Agency's (EPA's) RMP Offsite Consequence Analysis Guidelines for the Worst-Case Scenario (WCS), and using Aloha 5.4.7 as the dispersion model for the Alternative Release Scenario (ARS).\n\nBrandt developed these analyses to determine a reasonable \"outer bound\" for emergency response planning and for explaining potential hazards to the community if affected. \n\n\n\n1.    Worst-Case Scenario\n\nThe Worst-Case Scenario (WCS) for toxic substances at Brandt is the release of the total contents of single storage vessel capable of containing 18,000 gallons (92,700) of 100% Anhydrous Ammonia.  A safe fill level of 85%, results in a calculated maximum of 79,560 pounds of Anhydrous Ammonia. No Credit was taken for passive mitigation measures such as the existing containment area as the area was assumed destroyed due to earthquake or tornado. Modeling using default conditions generated the maximum distance to the toxic end point of 0.14 ppm (Appendix A to Title 19, Division 2, Chapter 4.5, Subchapter 1 Table of Toxic Endpoints) for this WCS is 5.1 miles. Using census data from WWW.CENSUS.GOV, the estimated population within the WCS toxic endpoint circle is 4586 persons.\n\n\n\n2.    Alternative Release Scenario\n\nThe Alternative Release Scenario (ARS) for toxic substances at Brandt is the release of  a portion of a single storage vesse"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067598,
      "SummaryText": "l capable of containing 79,560 Anhydrous Ammonia. Credit was taken for an excess flow valve serving as passive mitigation, and as a result the quantity released would be 36,000 pounds. Modeling using these more likely conditions generated the maximum distance to the toxic endpoint 0.14 ppm (Appendix A to Title 19, Division 2, Chapter 4.5, Subchapter 1 Table of Toxic Endpoints) as 0.5 mile.\n\nUsing census data from WWW.CENSUS.ORG, the estimated population within the toxic endpoint circle is 4586 persons.\n\n\n\nD.    The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps. \n\n\n\n1.    Management System \n\n\n\nA management system has been developed to satisfy the requirements of Section 2735.6 of the CalARP regulation and ensures that the risk management program elements are developed and continually improved. All records associated with the prevention program elements are retained for a minimum of five years unless and for some items they must be retains for the life of the process.  \n\n\n\nThe Plant Manager is the person with overall responsibility for the CalARP program elements at Brandt. The Plant Manager is responsible for activities include: Planning, Organizing, Implementing and Controlling CalARP Program.  Additional items: process training, process maintenance, process access control.\n\n&#8195;\n\n2.    Chemical-Specific Prevention Steps\n\n\n\nBrandt has assembled the Process Safety Information, performed hazard reviews and has developed written standard operating procedures that address the potential failure modes identified in the hazard reviews so that the potential for release will be minimized. The storage area has been provided with a limited containment area so as to reduce the potential impact of a release should one occur.  \n\n\n\nBrandt believes that employees who clearly understand how to safely operate the Anhydrous Ammonia system can significantly decrease the number and severity of incidents, and increase efficiency. Therefore, a thorough tra"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067598,
      "SummaryText": "ining program focused on procedures is a key element of an effective prevention program.\n\n\n\n3.    Prevention Program Elements\n\n\n\nBrandt Prevention Program Elements consist of:\n\n\n\na.    Safety Information\n\n\n\nBrandt maintains the following safety information related to the regulated substances, processes, and equipment:\n\n\n\n1.    Safety Data Sheets\n\n2.    Maximum intended inventory of equipment: Maximum intended inventory of Anhydrous Ammonia will be 18,000 gallons (93,600 lbs) adjusted to 79,560 for maximum safe fill.\n\n3.    Safe upper and lower temperatures, pressures, flows, and compositions have been determined and are listed in program consisting of temperature, pressure or flow rates that are set for this process.\n\n4.    Equipment specifications; and,\n\n5.    Codes and standards used to design, build, and operate the process.\n\n\n\nb.    Hazard Review\n\nA hazard review was undertaken of the Anhydrous Ammonia process. Areas within the process which may pose some hazards have been identified and mitigation measures have been scheduled for implementation. \n\n\n\n1.    Accidental release of Anhydrous Ammonia \n\na)    Scheduled equipment inspection and maintenance\n\nb)    Clear labeling of equipment\n\nc)    Improved spill response equipment.\n\nd)    Improved spill response training\n\n2.    Accidental mixture with incompatible substance\n\na)    Establishment of clear standard procedures\n\nb)    Enforcement of clear labeling of materials\n\nc)    Exclusion of incompatible materials from the process area\n\n\n\nLabeling of all valves, pumps and pipelines will assist consistent compliance with the                                                               standard operating procedure for the processes which include Anhydrous Ammonia, reducing accidental release of materials.\n\n\n\nc.    Operating Procedures \n\n\n\nA written set of standard operating procedures has been prepared for each process which uses Anhydrous Ammonia. These documents will be utilized during initial training and any subsequent training of operators and will be available for re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000067598,
      "SummaryText": "ference at all times. Standard operating procedures will be updated whenever a major change occurs in the process.\n\n\n\nd. Training \n\n\n\nBrandt has developed a written training program, satisfying the requirements of Section 2760.4 of the CalARP regulation that is comprised of the following:\n\n\n\n1.    Initial employee training;\n\n2.    Refresher training (at least every 3 years)\n\n3.    Training in updated or new procedures.\n\n4.    Training documentation\n\n\n\nAll operators receive training specific to the operations of the Anhydrous Ammonia system    prior to being assigned to the system. In addition, operators must be trained on any procedures developed in the hazard review. Training must be conducted to comply with Cal/OSHA's Hazard Communication standard (T8 CCR 5194). This training is conducted by knowledgeable in-house personnel and by equipment vendors. The Plant Manager maintains initial and refresher training records including content of training, instructor, and means used to verify competency for maintenance employees.  \n\n\n\ne.    Maintenance \n\n\n\nDocumented procedures for maintaining the mechanical integrity of process equipment is maintained on-site and maintenance personnel are trained in the maintenance procedures. A schedule for inspecting and testing equipment associated with covered process has been established, per Section 2760.5 of the CalARP regulation.\n\n\n\nf.     Compliance Audit \n\n\n\nThe RMP for the covered process is new; therefore, it will be audited three years from the date submitted.\n\n\n\ng.    Incident Investigation \n\n\n\nEach incident that resulted in. or could have resulted in (i.e., near miss) a catastrophic release of Anhydrous Ammonia, must be investigated to satisfy the requirements of the Section 2755.7 of the CalARP regulations. Personnel will identify underlying cause(s) and develop and implement actions to prevent reoccurrence of the incident, or similar incidents corrective actions to prevent reoccurrence of the incident, or similar incidents.\n\n\n\nThe Plant Manager"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000067598,
      "SummaryText": " conducts incident investigations. A procedure/checklist for conducting the investigation is being developed. Employees (including contract employees if they were involved) knowledgeable in the operation, design, and maintenance of the process may participate in the investigation depending upon the severity and complexity of the incident. The Site Manager is responsible for initiating as soon as possible but definitely within 48 hours of the time of the incident or near miss.\n\n\n\nWritten near misses' reports are generated and discussed with appropriate personnel. The incident investigation team prepares a written summary at the conclusion of the investigation that includes at a minimum: five\n\n\n\n?    Description of the incident including Date and Time;\n\n?    Date and Time the investigation was initiated;\n\n?    Team members and expertise;\n\n?    Factors that contributed to the incident or near miss and;\n\n?    Recommendations formulated as a result of the investigation.\n\n\n\nE.     The Emergency Response Program\n\n\n\nBrandt has a Consolidated Emergency Response/Contingency Plan that has been included under the California Environmental Reporting System (CERS). The plan lists emergency containment and cleanup procedures, emergency equipment on-site and a list of the telephone numbers of to contact in the event of an emergency. Internal response will occur and evacuation maps are posted on-site. Neighboring facilities that may be affected by an off-site release will be contacted via telephone. The most recent review or update of the emergency response plan will be conducted on Approx. March 15, 2018. Employee training on the Plan that will take place on March 15, 2018. The primary local emergency response agency with which the Plan is coordinated is Tulare County Environmental Services (EHS) as well as the Tulare County Fire Department. There is no known other federal or state emergency plan requirements to which the stationary source is subject.\n\n\n\nF.    Planned Changes to Improve Safety\n\n\n\nBrandt"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000067598,
      "SummaryText": " has established an increased schedule in safety training events to assure emergency preparedness. Additional activities are those presented in Section 3.B above.\n\n"
    }
  ]
}