{
  "FacilityID": 1000060821,
  "FacilityName": "3M Technical Ceramics",
  "FacilityStr1": "3250 South 614 Road",
  "FacilityStr2": null,
  "FacilityCity": "Quapaw",
  "FacilityState": "OK",
  "FacilityZipCode": "74363",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40115",
  "LEPC": "Ottawa LEPC",
  "FacilityLatDecDegs": "36.976667",
  "FacilityLongDecDegs": "-94.769753",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.3M.com/ceradyne",
  "FacilityEmailAddress": "dlamb@mmm.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "3M",
  "Company2Name": null,
  "CompanyDUNS": 50791177,
  "Company2DUNS": 0,
  "OperatorName": "Brian Daugherty",
  "OperatorStr1": "3250 South 614 Road",
  "OperatorStr2": null,
  "OperatorCity": "Quapaw",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74363",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dustin Lamb",
  "RMPTitle": "EHS Supervisor",
  "FTE": 93,
  "OtherEPAFacilityID": "OKD980623037",
  "EPAFacilityID": "100000095871",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-06-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.97399,
  "FRS_Long": -94.7672,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076009,
      "AltID": "Boron Trifluoride",
      "FacilityID": 1000060821,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077191,
          "ProcessID": 1000076009,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094156,
          "ProcessID": 1000076009,
          "ChemicalID": 52,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 52,
            "ChemicalName": "Boron trifluoride  [Borane, trifluoro-]",
            "CASNumber": "7637-07-2",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594156,
          "ProcessID": 1000076009,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060821,
      "SummaryText": "Introduction\n\n\n\n3M has long recognized the necessity for responsible environmental management and conservation of resources. 3M has also recognized the global nature of environmental matters and the importance of constructive cooperation in achieving international environmental conservation. 3M will continue to demonstrate leadership through our commitment to environmental management and the principles of sustainable development.  The Quapaw facility of Ceradyne Inc., a 3M company (Quapaw), is committed to the protection of the safety, health and environment of all individuals affected by our business activities, including employees, visitors, contractors, customers and the communities in which we operate.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nIn accordance with 3M's Safety and Health Policy, Quapaw is committed to: \n\n\n\n? Designing, maintaining and operating equipment, facilities and processes in a safe manner.\n\n\n\n? Using process hazard management systems to prevent hazardous chemical releases or conditions that have the potential to cause fires or explosions.\n\n\n\n? Participating in safety incident and illness investigations, audits and follow-up activities.\n\n\n\nCeradyne Inc. Quapaw Facility and RMP Regulated Substances\n\n\n\nQuapaw purchases and utilizes boron trifluoride (BF3) as a raw material feedstock into its boron isotopic separation process. Boron trifluoride is delivered to the site as a compressed gas in tube trailers consisting of 6 individual tubes, containing 3500 pounds of BF3 gas at a pressure of 1800 psig. The BF3 gas is transferred from a single tube of the tube trailer into the production area; tubes are used sequentially. Quapaw sells isotopically enriched boron trifluoride into global semiconductor markets. Final product gas is stored and transported in portable compressed gas cylinders packaged in accordance with USDOT Hazardous Materials regulations.\n\n\n\nQuapaw maximum BF3 inventory storage, consisting of one to two tube"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060821,
      "SummaryText": " trailers, BF3 contained in-process equipment, and final product BF3 inventory for sale, does not exceed 50,000 pounds.\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nQuapaw's boron trifluoride process area is considered a \"covered process\" under OSHA's Process Safety Management (PSM). Ceradyne Inc. Quapaw Facility has a fourteen element PSM program that includes process hazard analysis, operating procedures and safe work practices, training, emergency response, incident and \"near miss\" investigation and contractor management. 3M's PSM Audit program is designed to ensure continuous improvement of Quapaw's PSM program. Quapaw's process improvement initiatives include prevention focused maintenance and equipment reliability improvements focusing on 100% prevention of chemical spills and releases.\n\n\n\nThe Five-Year Accident History\n\n\n\nQuapaw has had no RMP reportable \"accidents\" in the last 5 years. All incidents and \"near misses\" that occur at the Quapaw facility are promptly contained, investigated and corrected to prevent recurrence.\n\n\n\nEmergency Response Program\n\n\n\nQuapaw has developed, and maintains, a working relationship with local emergency responders and the Local Emergency Response Coordinator to ensure openness of communication of the hazards associated with the Quapaw facility and appropriate emergency response procedures in the event of an emergency.\n\n\n\nIn order to ensure compliance with all emergency response regulatory requirements, Quapaw is committed to continual improvement of its Crisis Management Plan (CMP). Key elements of Quapaw's CMP include emergency recognition, emergency action (including but not limited to containment, mitigation, public communication), training, drills and incorporating \"lessons learned\" into the continuous improvement of the CMP. All facility personnel are trained in the hazardous chemical awareness and emergency response (evacuation) procedures. Individuals who respond to an emergency or "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060821,
      "SummaryText": "to manage an incident scene, are trained as required to comply with Hazardous Waste Operations and Emergency Response (HAZWOPER) and related regulations.\n\n"
    }
  ]
}