{
  "FacilityID": 1000060577,
  "FacilityName": "Americold - Gouldsboro",
  "FacilityStr1": "91 First Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Covington Township",
  "FacilityState": "PA",
  "FacilityZipCode": "18424",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42069",
  "LEPC": "Lackawanna County LEPC",
  "FacilityLatDecDegs": "41.266464",
  "FacilityLongDecDegs": "-075.499452",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.americold.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Americold Logistics, LLC",
  "Company2Name": null,
  "CompanyDUNS": 58149378,
  "Company2DUNS": 0,
  "OperatorName": "Americold Logistics, LLC",
  "OperatorStr1": "10 Glenlake Parkway",
  "OperatorStr2": "Suite 600, South Tower",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30328",
  "OperatorZipCodeExt": null,
  "RMPContact": "Linda McDaniel",
  "RMPTitle": "Sr. Regional PSM Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197119",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-02-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-10-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075705,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000060577,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076887,
          "ProcessID": 1000075705,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000093812,
          "ProcessID": 1000075705,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000593812,
          "ProcessID": 1000075705,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060577,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAmericold Logistics, LLC is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  The facility maintains a Safety Committee whose members are involved in reviewing the PSM  Program.  Americold Gouldsboro has an Emergency Response Plan (Plan) in effect, which is detailed in the Emergency Planning and Response section of the PSM document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes,and ammonia health hazards. This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\n\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe facility is located on a 90 acre site, 0.25 miles east of Route 435 in the city of Gouldsboro, Pennsylvania. The cold areas are refrigerated using anhydrous ammonia as the refrigerant.  The system was constructed in accordance with all applicable federal, state, and local regulations including the International Fire and Mechanical Codes (IMC).\n\n\n\nThe facility utilizes an ammonia refrigeration system (a maximum of 28,000 pounds of ammonia) for dock operations, ice making, and cooler/freezer storage.  The majority of each system is located in the machine room including vessels and compressors.  The condensers are mounted on the roof, and all of the evaporators are located in their respective cold areas.  The ice makers are located in the ice maker room.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Americold Gouldsboro ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. \n\n\n\nThe Process"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060577,
      "SummaryText": " Safety Management program ensures that all security and safety procedures are addressed.  Staff are trained in operation, maintenance and emergency procedures related to the operation of the ammonia refrigeration system.  All refrigeration equipment and ammonia vessels are equipped with automatic pressure safety relief devices to prevent pressure build-up beyond safe equipment operation levels.  Condensers are equipped with hydrostatic relief valves, which will prevent ammonia releases to the atmosphere.  A preventative maintenance program assures that equipment is maintained and serviced on a regular schedule and that worn, ageing, or defective components are replaced as required to maintain equipment in good operating condition.  Controls and safety devices are tested regularly to ensure proper operation.\n\n\n\nIn addition to the 2000 IMC, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines. \n\n\n\nGiven the presence of anhydrous ammonia, Americold Gouldsboro has in place a Process Safety Management program to ensure the safety of employees and the general public in the vicinity.  This program addresses items related to the operation of ammonia based refrigeration systems including but not limited to the handling of the chemical, operator training, equipment selection and maintenance, contractor qualifications, preventative maintenance programs, routine and emergency operating procedures and emergency planning and response.  Versacold also has an emergency action plan in effect, which is designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\n\n\nAmmonia has a strong pungent odor which is detectable at very low concentration levels when released to the atmosphere.  The refrigeration system is designed such that under normal operating conditions, no ammonia is released to the atmosph"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060577,
      "SummaryText": "ere.  However, unforseen circumstances or system upset could lead to leakage of a portion of the ammonia from the system.  Given the strong odor of ammonia, even a small quantity of released ammonia will be detected at some distance from the source of the leak.  Ammonia is detectable by its odor at levels well below that which will raise health concerns.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere is no accident history to report at the time of this writing.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Americold Gouldsboro facility is a non responding facility.  However, communication with the County Haz Mat team is continuos and clearly defined.  The facility has an emergency evacuation plna and has several trained personnel to assist in an orderly evacuation as well as to diagnose the alarm condition.  The facility employs a total of 330 people full-time.  \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Initial Process Hazard Analysis for the system, performed on July 12, 2006, and September 7,2006, generated mitigation measures (recommendations) to improve safety at the Versacold facility located in Gouldsboro, Pennsylvania. The mitigation measures generated from this study include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The Versacold safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\nA?  Continue to train all employees in the facility Safety Plan/Programs.\n\n\n\nA?  Continue to have employee involvement in Safety Plan Development.\n\n\n\nA?  Continue employee involvement through safety team participation.\n\n\n\nA? Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}