{
  "FacilityID": 1000044078,
  "FacilityName": "Nestle Prepared Foods Company (CA)",
  "FacilityStr1": "9601 Canoga Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chatsworth",
  "FacilityState": "CA",
  "FacilityZipCode": "91311",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.244361",
  "FacilityLongDecDegs": "-118.599472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.nestle.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8256224,
  "ParentCompanyName": "Nestle USA",
  "Company2Name": null,
  "CompanyDUNS": 8256224,
  "Company2DUNS": null,
  "OperatorName": "Nestle USA",
  "OperatorStr1": "9601 Canoga Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Chatsworth",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91311",
  "OperatorZipCodeExt": null,
  "FTE": 354,
  "OtherEPAFacilityID": "CAL912203653",
  "EPAFacilityID": "100000128578",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-08-09 00:00:00",
  "SafetyInspectionBy": "Los Angeles Fire Department CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-10-02 00:00:00",
  "DeRegistrationEffectiveDate": "2014-09-25 00:00:00",
  "AnniversaryDate": "2019-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.244361,
  "FRS_Long": -118.599472,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054453,
      "AltID": "Frozen Food Manufacturing",
      "FacilityID": 1000044078,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066277,
          "ProcessID": 1000054453,
          "ChemicalID": 56,
          "Quantity": 38500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000055248,
          "ProcessID": 1000054453,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000045615,
              "Process_NAICS_ID": 1000055248,
              "SafetyReviewDate": "2014-03-10 00:00:00",
              "PHA_Date": "2013-12-13 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Site Inspection",
              "PHACompletionDate": "2014-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Manual emergency shut off switch will shut the system down. Seismic switches isolate liquid ammonia supply in case of an earthquake.  Common Ammonia Pump-down Vessel for oil removal.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Ammonia detection in engine room, freezers, and cooler rooms.",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Procedural and policy modifications to enhance the safety and operability of the refrigeration system.",
              "OpProceduresReviewDate": "2014-05-20 00:00:00",
              "TrainingReviewDate": "2014-05-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Classroom and hands-on refrigeration training is provided.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-03-10 00:00:00",
              "EquipmentInspectionDate": "2014-05-11 00:00:00",
              "EquipmentTested": "change oil & filter on BC-2 compressor",
              "ChangeMgmtDate": "2014-01-02 00:00:00",
              "ChangeMgmtReviewDate": "2013-11-12 00:00:00",
              "PreStartupReviewDate": "2014-01-10 00:00:00",
              "ComplianceAuditDate": "2014-02-12 00:00:00",
              "AuditCompletionDate": "2015-02-12 00:00:00",
              "IncidentInvestigationDate": "2013-07-25 00:00:00",
              "InvestigationChangeDate": "2014-05-21 00:00:00",
              "ParticipationPlansReviewDate": "2008-09-17 00:00:00",
              "HotWorkPermitReviewDate": "2014-05-21 00:00:00",
              "ContractorSafetyReviewDate": "2013-04-17 00:00:00",
              "ContractorSafetyEvalDate": "2013-07-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000055050,
                  "PreventionProgram3ID": 1000045615,
                  "ProcessChemicalID": 1000066277
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044078,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": "2014-06-11 00:00:00",
    "ERTrainingDate": "2014-05-29 00:00:00",
    "CoordinatingAgencyName": "LA City Fire Dept -- Station 96",
    "CoordinatingAgencyPhone": "8187568696",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CalOSHA, CCR Title 8, Section 3220; Title 19, Division 2 Chapter 4.5 CalARP Sections 2735.1-2785.1; CCR Title 8, Section 5189; CCR Title 8, Section 5192; CCR 66261; CCR Title 19, Sec. 2729-2732"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044078,
      "SummaryText": "clude compressors, condensers, pressure-rated vessels, heat exchangers, piping and valves, instrumentation and controls, and other miscellaneous components.  The need to recharge the system with ammonia is very infrequent, but it is done by tank truck as necessary.\r\n\r\nAnhydrous ammonia refrigerant (Ammonia) is not used in any chemical reactions.  Ammonia is used to transfer heat away from the freezers and coolers in a continuous cycle of evaporation, condensation, and compression, similar to the cycle utilized by a household refrigerator.  The ammonia is continuously cycled throughout the system, so that make-up or replacement of ammonia is done infrequently.  Anhydrous ammonia is a clear colorless gas with a characteristic odor and, although it is classified as a nonflammable gas, it can burn within certain vapor concentration limits (assuming the presence of an ignition source), and the fire hazard will increase with the presence of oil or other combustible materials.  It is shipped as a liquid under pressure and it is soluble in water forming a corrosive liquid.  Although ammonia vapor is lighter than air, the vapors from a leak are typically cold and will initially hover near the ground until they warm up and mix with air.\r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\r\nNestle USA has integrated program elements described in the RMP to deal with the risks involved with the storage and handling of ammonia throughout the refrigeration process.  In this way, overall plant, worker, and public safety is promoted.  The program elements include:\r\n\r\nProcess Safety Information - The ammonia refrigeration process has been designed and installed by reputable vendors who are well known in the refrigeration industry.  It is required that information on the design and operation of the facility be documented and maintained for as long it is in operation. A major component of the PSI are the piping and instrumentation diagrams, which are kept current based on any changes that o"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000044078,
      "SummaryText": "updated based on process changes."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044078,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nNestle USA produces a large variety of frozen foods at its Chatsworth Facility that are frozen and then shipped to various points around the country.  The facility covers approximately eight acres and has approximately 710 employees employed at the facility on a rotational shift basis seven days per week.  The facility operates under strict federal, state, and company regulations for safety of its employees, its products and the environment.\r\n\r\nNestle USA uses ammonia as a refrigerant in its frozen food processes.  By maintaining a comprehensive safety program for ammonia and documenting the program in this Risk Management Plan, Nestle USA complies with Cal-OSHA's Process Safety Management (PSM) standards and California's and EPA's Risk Management (RMP) program regulations.\r\n\r\nNestle USA realizes that constant diligence in operation and proper maintenance of the ammonia system can reduce risks to its Associates and to the public.  This RMP documents the procedures and controls in place to ensure that potential accidental releases of ammonia are prevented and to promptly respond to and mitigate any incident that might occur.\r\n\r\nThe RMP and PSM programs are applied to all on-site activities that could involve or affect the ammonia system.  The safety programs prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities or pieces of equipment.  These rules are reviewed at regular intervals and modified if required and they are communicated to, accepted, and practiced by all employees at the facility.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\r\nAmmonia is handled at the facility as a refrigeration medium in a closed circuit system.  No chemical reactions or venting occurs in the normal operation of the system.  A total system capacity of approximately 38,500 pounds of ammonia is the maximum inventory maintained at the site.  System components in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044078,
      "SummaryText": "ccur to the design of the refrigeration process.\r\nProcess Hazard Analysis - The ammonia refrigeration system at the facility has been thoroughly analyzed for potential hazards using a trained team of facility personnel and experienced hazard analysis leaders.  The PHA studies are revalidated at least every 5 years, plus any time significant changes are made to the system.\r\nOperating Procedures - Formal written procedures for operation and maintenance of our ammonia refrigeration system have been developed as part of our RMP.  Procedures provide steps for each operating phase, they also document operating limits, safety and health considerations, and safety systems and their functions.  All Utility Mechanics review the written Operating Procedures to ensure the staff is properly trained.\r\nTraining - Nestle USA's refrigeration technicians have many years of experience in operating ammonia refrigeration systems.  Several of them have 4 year degrees in technical subjects in addition to their work experience.  Nestle USA certifies that their operators are competent.  As required by Nestle USA, all technicians have proper training either before or after they are hired and periodic refresher training is conducted at the facility.  Industry training certificates such as RETA CIRO have been achieved by most (if not all) ammonia operators on-site.\r\nMechanical Integrity - Preventive maintenance practices have been in place for a number of years at Nestle USA.  Routine safety checks, inspections and preventive maintenance tasks on refrigeration systems are conducted to reduce the likelihood and severity of equipment failures. Outside experts, including pressure vessel and piping inspectors, are employed as needed to provide ongoing verification of the integrity of the system.  Hot work procedures, Lockout/Tagout procedures and others are used to document and control safe work practices.  Ammonia operators conduct and document daily inspections of the ammonia equipment in additi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044078,
      "SummaryText": "on to the electronic recordkeeping that is done via the facility's computerized maintenance management software (CMMS).\r\nManagement of Change - Changes to the process, including chemicals, technology, equipment and procedures and changes to equipment that could affect the ammonia system are managed through use of a written management of change procedure.  Designated management personnel must authorize changes under this program element.  \r\nPre-startup Safety Review - Before a major change can be instituted, Pre-startup Safety Review requires that construction and equipment is in accordance with design specifications, procedures are in place and adequate, process hazard analysis is performed and recommendations resolved and training is conducted.\r\nCompliance Audits - Under RMP, Nestle is required to evaluate compliance with the RMP regulations at least every three years. The most recent audit was conducted in February 2014.\r\nIncident Investigation - The RMP requires that incidents which resulted in or could reasonably result in a catastrophic release of ammonia be investigated promptly by a team of investigators with the appropriate knowledge and experience to thoroughly investigate and analyze the incident. \r\nEmployee Participation - Employees (Associates) are encouraged and required to participate in program development and enforcement.  A documented system is in place that verifies employee participation and awareness with each program element. \r\nHot Work Permit - Before work is performed which involves a potential source of ignition, designated personnel must inspect the work area, review the procedures and document the precautions necessary to prevent fires or explosions.  The written permit authorizes work on specific dates and on specific equipment. \r\nContractors - Nestle USA has adopted the recommended practices of the International Institute of Ammonia Refrigeration's recommended practices for managing contractors in the workplace.  The contractor's safety r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044078,
      "SummaryText": "ecord, training program and procedures are evaluated before they are hired and periodically during the course of the contract. \r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\nEPA's RMP regulation defines accident as the following:\r\n  The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\r\n  The release must have caused at least one of the following:\r\n     - On-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n     - Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\r\n\r\nBased on the above definition and an investigation into the facility's accident history and incident investigation records, the Nestle facility in Chatsworth has not had an accident within the last 5 years (June 2009 -- June 2014).\r\n\r\nPLANNED AND COMPLETED CHANGES TO IMPROVE THE SAFETY OF THE SYSTEM\r\nThrough the process of developing and implementing Process Safety Management and Risk Management Programs, a number of improvements have been identified and either implemented or are in the process of being implemented, including the following:\r\n- The facility implements monthly PSM/RMP Committee Meetings to stay abreast of ongoing issues at the facility, including all elements of the PSM and RMP programs.  Outstanding corrective actions are reviewed and tracked to ensure expeditious completion of items on a priority basis.\r\n- Ammonia Detection systems have been installed and are planned to be enhanced.\r\n- Non-destructive testing of vessels and other equipment is conducted periodically.\r\n- All relief valves in ammonia service are on a routine replacement schedule.\r\n- The training program is periodically reviewed with detailed refrigeration training for the refrigeration technicians, including certification under the RETA accredited training program.\r\n- Operating and maintenance procedures are reviewed and updated as required.\r\n- Process safety information is"
    }
  ]
}