{
  "FacilityID": 1000009367,
  "FacilityName": "Pinova, Inc.",
  "FacilityStr1": "2801 Cook Street",
  "FacilityStr2": null,
  "FacilityCity": "Brunswick",
  "FacilityState": "GA",
  "FacilityZipCode": "31520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13127",
  "LEPC": "Brunswick-Glynn County LEPC",
  "FacilityLatDecDegs": "31.163558",
  "FacilityLongDecDegs": "-081.479218",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "plgrozier@pinovasolutions.com",
  "FacilityDUNS": 1315647,
  "ParentCompanyName": "Pinova, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5003264,
  "Company2DUNS": 5003264,
  "OperatorName": "Hercules Incorporated",
  "OperatorStr1": "2801 Cook Street",
  "OperatorStr2": null,
  "OperatorCity": "Brunswick",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31520",
  "OperatorZipCodeExt": null,
  "RMPContact": "Patick L. Grozier",
  "RMPTitle": "Plant Manager",
  "FTE": 216,
  "OtherEPAFacilityID": "31520HRCLS2801C",
  "EPAFacilityID": "100000144863",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "28611270002V020",
  "SafetyInspectionDate": "2009-10-20 00:00:00",
  "SafetyInspectionBy": "Burea of Explosives",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-02-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 31.16589,
  "FRS_Long": -81.47469,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010993,
      "AltID": "Terpene Resins",
      "FacilityID": 1000009367,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011394,
          "ProcessID": 1000010993,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012519,
          "ProcessID": 1000010993,
          "ChemicalID": 14,
          "Quantity": 36250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 14,
            "ChemicalName": "Trimethylchlorosilane  [Silane, chlorotrimethyl-]",
            "CASNumber": "75-77-4",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512519,
          "ProcessID": 1000010993,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000010994,
      "AltID": "Stabybelite",
      "FacilityID": 1000009367,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011395,
          "ProcessID": 1000010994,
          "NAICSCode": "325191",
          "_desc": {
            "NAICS_CODE": "325191",
            "NAICS_DESCRIPTION": "Gum and Wood Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012520,
          "ProcessID": 1000010994,
          "ChemicalID": 149,
          "Quantity": 12400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512520,
          "ProcessID": 1000010994,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009367,
      "SummaryText": "Executive Summary\n\n\n\nFacility Description:\n\n\n\nPinova Inc. is nearly the only one of its kind in the world today that transforms abandoned pine stumps into industrial chemicals ultimately used in hundreds of consumer products, such as adhesives, sealant, chewing gum, toothpaste, citrus drinks, cleansers, and many other goods.\n\n\n\nIn making these products, the facility uses and stores (2) chemicals subject to the EPA's Risk Management Program Rule.  These chemicals are hydrogen and trimethylchlorosilane.  Carbon disulfide and hydrazine are also used at the site but are stored in quantities below the RMP threshold.  Hydrogen is used to hydrogenate (add hydrogen atoms to) the resins extracted from the pine stumps.  Trimethylchlorosilane is used as a processing aid in the production of polymeric terpene resins.\n\n\n\nHydrogen is stored in a bulk storage tank with a maximum capacity of 12,400 pounds.  This tank is owned and maintained by Air Products Corporation but is located on Pinova property.  \n\n\n\nTrimethylchlorosilane (TMCS) is handled in portable containers weighting 725 pounds.  While the number of TMCS containers onsite may vary at any one time, with the maximum number of containers exceeding the RMP threshold quantities, only one container is connected to the process at a time.\n\n\n\nPolicy:\n\n\n\nThe Corporate Policy on Safety, Health and Environment states:\n\n\n\nAt the Pinova facility, we manufacture chemical specialty products.  We do so with full commitment to the chemical industry's Responsible Care initiative.  In keeping with this commitment, we are dedicated to providing a safe and healthful environment for our employees, customers, and communities.  To do this, we are dedicated to and working toward continuous improvement in our operations to prevent pollution; to reduce risk; and to enhance safety, health, and environmental performance.  By incorporating these beliefs and attitudes into the way we do things at Pinova, we take a key step forward in minimizing the en"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009367,
      "SummaryText": "vironmental impact of our operations, satisfying customer needs, and creating shareholder value.\n\n\n\nWe will adhere to the following basic principles in managing our business worldwide:\n\n\n\n-We will comply with the letter and spirit of all applicable safety, health, and environmental laws, regulations, and corporate guidelines.\n\n\n\n-We will define strategic objectives, develop tactical plans, identify clear accountability, provide necessary resources, and measure our progress on safety, health, and environmental matters on an ongoing basis.  Our planning will consider both business goals and significant safety, health, and environmental aspects of our products and operations.\n\n\n\n-We will evaluate the safety, health, and environmental impacts of new and existing products and operations and will work to reduce the adverse impacts. \n\n\n\n-We will provide for an open dialogue on safety, health, and environmental issues relating to our products and operations with our stakeholders, including shareholders, employees, customer, suppliers, government agencies, and communities.\n\n\n\n-We will work to continually reduce workplace injuries; incidents with the potential for causing property damage, material loss, or interruption of our business; waste; and releases to the environment.\n\n\n\n-We will emphasize product stewardship and advocate its importance to our suppliers, distributors, and customers.\n\n\n\nEvery employee has a role to play.  All of us are responsible and accountable for adhering to the letter and spirit of this policy.  All of us must incorporate safety, health, and environmental considerations into our daily business activities.  It takes a total team effort to truly be a Responsible Care company.\n\n\n\nWorst-Case Scenarios:\n\n\n\nFollowing the process detailed in the EPA's Off-Site Consequence Guidance, the off-site impacts were determined for each regulated substance utilized at the Pinova Plant.   The Pinova has one toxic chemical, Trimethylchlorosilane, and one flammable ch"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009367,
      "SummaryText": "emical, hydrogen that are in considered covered processes under the RMP rule.  The facility examined worst-case and alternative case scenarios for both chemicals using the EPA's RMP*COMP program.  The chemical or substance that resulted in the most significant off-site impacts under the worst-case release scenario was Trimethylchlorosilane.  A hydrogen worst-case release scenario was also reported but its impacts were less than the toxic chemical. \n\n\n\nThe worst-case scenario for Trimethylchlorosilane is the instantaneous release of a 725-pound cylinder.  The impact of such a release using the EPA specified meteorological conditions would result in a vapor cloud that would reach off-site receptors.  No active or passive mitigation efforts were considered for the scenario.  \n\n\n\nAlternative Case Scenarios:\n\n\n\nThe alternate case scenario for Trimethylchlorosilane involves the release of half the contents of a cylinder (360 pounds).  More typical meteorological conditions for the Brunswick area were used such as those used by the alternative case guidance specified by EPA.  Such a release would result in minimal off-site impacts, just beyond the Pinova fence line.   \n\n\n\nThe alternate case scenario for Hydrogen would was a vapor cloud explosion that was released over 60 minutes at a release rate of 206 pounds per minute considering alternative case meteorological conditions as specified by EPA.  Such a release would result in minimal off-site impacts, just beyond the Pinova fence line.   \n\n\n\nAccident Prevention Program:\n\n\n\nEach of the processes, which uses one or more of the regulated substances, is subject to the OSHA Process Safety Management (PSM) Standard (29 CFR 1910.119) and has a complete process safety management system in place.  This includes the use of process hazard analyses to identify and address potential hazards, management of change to control modifications, mechanical integrity procedures for minimizing mechanical failures, detailed operating procedures "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009367,
      "SummaryText": "for process control, operator training for the personnel involved in the process and contractor safety assessments to closely monitor activities by non-Pinova personnel.\n\n\n\nFive Year Accident History:\n\n\n\nIn the past five years, the Pinova Plant has not had any accidental releases of hydrogen or trimethylchlorosilane that have resulted in on-site injuries or any off-site impacts.\n\n\n\nEmergency Response Program:\n\n\n\nThe Pinova Plant has an emergency response program in place to minimize on-site, as well as off-site, impacts from the release of any of the regulated substances or any chemical utilized in the plant processes.\n\n\n\nWhile significant efforts are practiced to prevent all releases, Pinova is cognizant of the fact that they can and do occur.  To prepare to respond to a release, the plant has a very detailed emergency response program in place.  The key elements of this emergency response program are:\n\n\n\n-Written emergency response plans that provide a written step by step procedure for responding to the various types of emergency situations that may arise (fire, spills, hurricanes, etc).\n\n\n\n-Emergency Response Contractors that provide twenty four hour, seven day a week response to spill or releases. Fire response is conducted at the incipient level by plant employees and at the structural level by the Brunswick Fire Department whose response time to the site is approximately 5 minutes.  \n\n\n\n-All of the emergency response activities are and will continue to be coordinated with the various local agencies."
    }
  ]
}