{
  "FacilityID": 1000024031,
  "FacilityName": "TRANSFLO Wilmington NC",
  "FacilityStr1": "1100 Old Mill Road NE",
  "FacilityStr2": null,
  "FacilityCity": "Navassa",
  "FacilityState": "NC",
  "FacilityZipCode": "28541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37019",
  "LEPC": "Brunswick County LEPC",
  "FacilityLatDecDegs": "34.262725",
  "FacilityLongDecDegs": "-78.014890",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.transflo.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7941321,
  "ParentCompanyName": "TRANSFLO Terminal services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TRANSFLO Terminal Srvices, Inc.",
  "OperatorStr1": "500 Water Street, J-975",
  "OperatorStr2": null,
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jan M. Barnes",
  "RMPTitle": "Director- HS&E and Quality",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215812",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-09-27 00:00:00",
  "SafetyInspectionBy": "NC Department of Agriculture- LPG Inspector",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-09-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-09-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-08-13 00:00:00",
  "DeRegistrationEffectiveDate": "2013-08-09 00:00:00",
  "AnniversaryDate": "2016-09-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029417,
      "AltID": "LPG Products Transfer",
      "FacilityID": 1000024031,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029678,
          "ProcessID": 1000029417,
          "NAICSCode": "48821",
          "_desc": {
            "NAICS_CODE": "48821",
            "NAICS_DESCRIPTION": "Support Activities for Rail Transportation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035259,
          "ProcessID": 1000029417,
          "ChemicalID": 118,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000035260,
          "ProcessID": 1000029417,
          "ChemicalID": 98,
          "Quantity": 1800000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000035261,
          "ProcessID": 1000029417,
          "ChemicalID": 129,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535259,
          "ProcessID": 1000029417,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535260,
          "ProcessID": 1000029417,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535261,
          "ProcessID": 1000029417,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024031,
      "SummaryText": "Executive Summary (40 CFR 68.155)\n\n\n\nBackground Data\n\n\n\nIn accordance with Title 40 of the Code of Federal Regulations, chapter 68 (40 CFR 68) promulgated by the Federal Environmental Administration (EPA), TRANSFLO Terminal Services, Inc. has prepared this Risk Management Plan (RMP) for operations involving Liquefied Petroleum Gas (LPG) at their Leland, NC facility.  The TTSI terminal provides transloading services of bulk products between rail and truck transportation modes.  The Leland TRANSFLO terminal has been in operation since 1988.  The terminal is located at 1100 Old Mill Road,, N.E., Navassa, NC 28541.\n\n\n\nAccidental Release Prevention and Emergency Response Policy\n\n\n\nTRANSFLO is committed to protecting the health and safety of its employees, contract operators, the surrounding community and the environment; therefore it is TRANSFLO policy to maintain compliance with 40 CFR 68.\n\n\n\nStationary Sources and Regulated Substances\n\n\n\nTRANSFLO will handle liquefied petroleum gas (LPG) products at this terminal, transloading product from railroad tank cars into highway cargo trailers in quantities in excess of 8,000 gallons per cargo trailer which will exceed the 10,000 pound threshold quantity listed in 40 CFR 68, Appendix A.\n\n\n\nWorst Case Scenario\n\n\n\nAs required by 40 CFR 68 Subpart B, TRANSFLO has evaluated a worst-case release scenario for LPG products using the parameters specified by the EPA.  TRANSFLO's worst-case release scenario is the rupture of a single railroad tank car with subsequent product release over a 10-minute period.  In developing the release parameters of the worst-case scenario, TRANSFLO has not considered any passive mitigation measures.  Using the EPA's RMP*Comp software program, it was determined that the distance to the toxic endpoint in this scenario has the potential to result in a release with offsite consequences.  The worst-case release scenario was developed following EPA regulations and is considered to have an extremely low probabi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024031,
      "SummaryText": "lity of occurrence.\n\n\n\nAlternative Release Scenario\n\n\n\nTRANSFLO also evaluated several other release scenarios considered to have a higher level probability of occurrence (although a very low probability) based upon a review of over 10 years of incident data from chemical transloading operations.  This 10 year period included the safe handling of over 500,000 rail to truck chemical transloads.  After a careful review of both the worst-case and alternative release scenarios, TRANSFLO has decided to include one alternative release scenario into the RMP document.  \n\n\n\nThe alternative release scenario identified by TRANSFLO is the failure of a product transfer hose.  In developing the parameters of Alternative Release Scenario 1, TRANSFLO considered the average response time of terminal personnel to control the release and safely shut the transfer unit down.   Using the EPA RMP*Comp software program and EPA's RMP offsite Consequence Analysis Guidance Document, the distance to the flammable endpoint in the alternative release scenario has the potential to result in minor site consequences at a distance much less than the worst-case scenario and would largely be limited to terminal property itself.\n\n\n\nAccidental Release Prevention Program\n\n\n\nTo prevent and mitigate accidental releases of LPG products, TRANSFLO has implemented several precautionary measures:\n\n\n\nA?    TRANSFLO has developed standard operating procedures (SOP'S) for the Transloading of LPG products from railcar to highway cargo tank for use by trained and qualified personnel.\n\nA?    TRANSFLO encourages contract operator employees to voice concerns, offer suggestions and contribute to procedures, policies and processes involving this product.  Employees are expected to follow established procedures until employee driven process changes are implemented, training conducted and communicated to all affected persons.\n\nA?    TRANSFLO conducts operational audits and inspections to insure compliance with established operating"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024031,
      "SummaryText": " procedures, maintenance of transfer equipment and facility physical systems.\n\nA?    A documented inspection and maintenance program for the transfer unit, railcars and cargo tanks used for this operation is in place and will be maintained for the life of this operation.  These processes include preventative maintenance of the transfer unit to maintain on-board safety and control systems.\n\n\n\nThe transfer unit has been designed and constructed to meet or exceed the requirements outlined in the National Fire Protection Association (NFPA) Liquefied Petroleum Gas (LPG) Code (2008 ed.).  A review of the National Fire Code finds this operation is in compliance with all requirements of the code.\n\n\n\nTRANSFLO will conduct initial familiarization sessions with the local emergency responders as part of the terminals emergency action plan (EAP).   In addition, the following agencies inspect the TRANSFLO terminal on a regular basis:\n\n\n\nU.S. Department of Transportation- Federal Railroad Administration- Hazardous Materials Inspectors  \n\n\n\n    North Carolina Department of Agriculture, LPG Deal License\n\n\n\n\n\n\n\nFive- Year Accident History\n\n\n\nTRANSFLO has not handled LPG at this facility on a routine basis during the past five years.  There are no accidents or releases to report.\n\n\n\nEmergency Response Program\n\n\n\nTRANSFLO and the contract operator have documented emergency response plans and procedures in place at this facility to respond to and safety mitigates any release or accident involving LPG products.  Included in the emergency response plan are measures to be taken internally by TRANSFLO contract operators to control the release, if possible, and to make initial notification to local responders and to TRANSFLO headquarters.\n\n\n\nOperator personnel at the terminal are trained to the Hazardous Materials Operations level as outlined in 29 CFR 1910.120 Hazardous Waste Operations and Emergency Response.  These employees may also perform activities under the specialist employee definition a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024031,
      "SummaryText": "s defined by 1910.120.  These personnel receive annual training on activation of the facility emergency action plan, their roles in an emergency and accident notification procedures.\n\n\n\nTo assure that the local municipal response agencies are familiar with TRANSFLO emergency response procedures and copies of the Emergency Action plan (EAP) have been shared with and reviewed by local responders.  In the event of a significant release of LPG products that involve off site populations, these populations will be notified through the LEPC.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nTRANSFLO and its contract operators have implemented a continuous training program for employees and preventative maintenance procedures for the transfer unit to ensure a high level of safety performance and regulatory compliance.\n\n\n\n\n\nTRANSFLO Change Record\n\n7/05/13  Updated terminal email, updated WI review (Tampa PSSR) date."
    }
  ]
}