{
  "FacilityID": 1000062743,
  "FacilityName": "Intel Corporation NM Site",
  "FacilityStr1": "4100 Sara Road",
  "FacilityStr2": "M/S RR5-491",
  "FacilityCity": "Rio Rancho",
  "FacilityState": "NM",
  "FacilityZipCode": "87124",
  "Facility4DigitZipExt": "1025",
  "FacilityCountyFIPS": "35043",
  "LEPC": "Sandoval LEPC",
  "FacilityLatDecDegs": "35.2246",
  "FacilityLongDecDegs": "-106.6569",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "LC",
  "FacilityURL": "www.intel.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78355664,
  "ParentCompanyName": "Intel Corporation",
  "Company2Name": null,
  "CompanyDUNS": 47897855,
  "Company2DUNS": null,
  "OperatorName": "Intel Corporation",
  "OperatorStr1": "2200 Mission College Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Santa Clara",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95054",
  "OperatorZipCodeExt": "1549",
  "FTE": 1100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217222",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-11-20 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-08-29 10:45:44",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-07-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-07-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 35.23133,
  "FRS_Long": -106.65608,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078652,
      "AltID": "F11X Bulk HCL",
      "FacilityID": 1000062743,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000097782,
          "ProcessID": 1000078652,
          "ChemicalID": 54,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000079835,
          "ProcessID": 1000078652,
          "NAICSCode": "334413",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000066094,
              "Process_NAICS_ID": 1000079835,
              "SafetyReviewDate": "2017-07-10 00:00:00",
              "PHA_Date": "2017-07-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Layers of Protection Analysis (LOPA)",
              "PHACompletionDate": "2017-07-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Gas detection with auto shut-down",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "CCTV cameras monitored by security",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Implementation of additional procedural controls",
              "OpProceduresReviewDate": "2017-03-27 00:00:00",
              "TrainingReviewDate": "2016-03-04 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Web Based Training",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Web Based Test",
              "MaintenanceReviewDate": "2017-03-27 00:00:00",
              "EquipmentInspectionDate": "2017-05-07 00:00:00",
              "EquipmentTested": "HCl supply line integrity inspection",
              "ChangeMgmtDate": "2017-06-15 00:00:00",
              "ChangeMgmtReviewDate": "2016-03-04 00:00:00",
              "PreStartupReviewDate": "2012-07-13 00:00:00",
              "ComplianceAuditDate": "2015-11-20 00:00:00",
              "AuditCompletionDate": "2016-03-04 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-03-04 00:00:00",
              "HotWorkPermitReviewDate": "2016-03-04 00:00:00",
              "ContractorSafetyReviewDate": "2016-03-04 00:00:00",
              "ContractorSafetyEvalDate": "2016-03-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000081692,
                  "PreventionProgram3ID": 1000066094,
                  "ProcessChemicalID": 1000097782
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000062743,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-03-21 00:00:00",
    "ERTrainingDate": "2017-03-21 00:00:00",
    "CoordinatingAgencyName": "Rio Rancho Fire and Rescue",
    "CoordinatingAgencyPhone": "5058919501",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000062743,
      "SummaryText": "cilities and equipment installation in the virtual factory.\r\n4.\tEnvironmental, health, and safety concerns are addressed in each change.\r\n\r\nIncident Investigation \r\n\r\nIntel's Corporate Incident Investigation Standard defines how personnel conduct occupational injury and illness investigations that lead to root cause analysis and corrective action implementation.  In addition, it assists in collection of complete and accurate documentation associated with injury and illness incidents.  The Global EHS Event Management System Standard ensures that significant Environmental, Health, & Safety incidents are appropriately resolved and learning's from these incidents are communicated to prevent the reoccurrence at any site. This program requires immediate investigation and initial notification to management within 24 hours of a serious incident.\r\n\r\n\r\nEmergency Planning and Response\r\n\r\nAll Intel sites have a formal Emergency Management Plan, which includes the formation of an Emergency Operations Center (EOC), Incident Command Center (ICC), and Emergency Response Team (ERT). ERT members act as first responders to provide immediate assessment, assistance and event mitigation.  ERT coordinates with the EOC and has direct interface with outside agency responders (fire dept). ERT Members receive extensive training before they participate in the ERT. This includes a five day foundation course covering emergency response procedures, radio use, first aid/CPR, use of breathing apparatus, fire safety, chemical spill cleanup, and gas leak detection.  \r\n\r\nCompliance Audits\r\n\r\nAn internal compliance focused self-assessment audit of the Process Safety Management (PSM) program is conducted by site at a minimum of every three years.  External compliance audits are conducted every 3 years by New Mexico OSHA to recertify the Intel NM site as a site certified under the Voluntary Protection Program (VPP).  PSM is a major component of this audit and certification.  In addition, an Intel Corpora"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062743,
      "SummaryText": "rientation is site safety rules.\r\n3.\tThe Intel Contractor Sponsor evaluates the performance of contract employers in fulfilling their obligations as specified in this section quarterly.  Part of this evaluation includes contract employee injury and illnesses, near misses, or other incidents related to the contractor's work.\r\n\r\nPermit to Work and Restricted Access\r\n\r\nIntel has the following elements to control certain work activities that could cause incidents on processes that utilize flammable, toxic, or reactive chemistries.  This includes:\r\n1.\tAll hot work operations conducted on or near a covered process shall utilize the Intel Hot Work Program which requires that all non-electrical hot work must be permitted by use of a Non-Electrical Hot Work Permit\r\n2.\tWork on any portion of the  manufacturing process included on the Site Incident Prevention Program (SIPP).  SIPP provides a permitting system to ensure that all work near or on manufacturing processes or equipment are reviewed by the area and system for impacts to production or safety.\r\n3.\tAll Hazard Production Material (HPM) rooms are accessible only to trained and approved personnel via card reader access/control.\r\n\r\nManagement of Change\r\n\r\nThe design, operation, and maintenance of all the manufacturing process and facilities systems and equipment are controlled by the Intel Facilities Change Control Board (FCCB) Whitepaper process.   The FCCB is responsible for documenting new facilities systems (design and qualification), controlling changes in facilities systems, documenting POR (Plan of Record), and controlling changes in manufacturing process equipment installations. The FCCB attempts to ensure that:\r\n1.\tFactories that run the same process are designed and operated such that the process sees no difference from one factory to the next.\r\n2.\tThe process is duplicated in each factory by understanding and controlling process equipment installation changes. \r\n3.\tCopy Exactly! is maintained long term for fa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000062743,
      "SummaryText": "te Audit team is established that conducts formal EHS program audits on a periodic basis.  PSM/RMP is one of the protocols of this audit."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062743,
      "SummaryText": "ocured and designed facilities systems. This starts with outlining process safety expectations early in the Request for Proposal (RFP) and Request For Quote (RFQ) from each supplier, and ends in the final design of the equipment. \r\nProcess equipment and facilities equipment must all reside within the walls of the actual fabrication facilities. EHS has integrated its requirements through the EHS Master Design Standard (MDS). The EHS MDS defines the requirements and expectations for the fabrication facilities.  This standard is used to support all applicable codes, standards, and regulations that drive the design of our facilities. \r\n\r\nProcess Hazard Analysis\r\n\r\nAll new facilities systems utilizing high hazard chemicals have a formal Process Hazard Analysis (PHA) conducted to assess the upset conditions the equipment may present, the controls in place, and the adequacies of these controls to prevent events with high or catastrophic potential. This process is a 3 step approach:\r\n1.  An initial process hazard analysis (hazard evaluation) is required on all new chemical facilities systems regardless of the  and applicability to OSHA PSM or EPA RMP.  One or more of the following methodologies are utilized to determine and evaluate the hazards of the process being analyzed:\r\n- What-If Checklist\r\n- Hazard Mode Effects Analysis (FMEA)\r\n- Layers of Protection Analysis (LOPA)\r\n- Hazard and Operability Study (HAZOP)\r\n2.   Conduct consequence analysis (dispersion modeling) of credible release scenarios identified in the PHA.  The goal is to have adequate safeguards in place to prevent an impact to the local community.\r\n3.  After the PHA is conducted, a Layers of Protection Analysis (LOPA) is conducted on all severe/catastrophic scenarios (including any potential off-site impacts) to ensure that the controls are sufficient to meet the internal Corporate Risk Tolerance Criteria.\r\n\r\nPre-Startup Safety Review \r\n\r\nAfter the integration of EHS requirements into the procurement, design"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062743,
      "SummaryText": ", and engineering aspects is complete, it is critical to ensure that these new facilities are constructed to the design, and that all safety systems are in place and functional prior to startup. This is especially important for high hazards chemical and gas systems. Intel has a formal Commissioning Program for all facilities systems which integrates the Environmental, Health, and Safety aspects of startup.  This includes a startup after a system modification.  This is to ensure:\r\n¿\tConstruction and equipment is installed in accordance with design specifications\r\n¿\tSafety, operating, maintenance, and emergency procedures are in place and adequate\r\n¿\tSafety systems and controls are tested and functional\r\n¿\tFor new facilities, a process hazard analysis has been performed and recommendations have been resolved or implemented before startup\r\n¿\tModified facilities meet the Management of Change (MOC) requirements\r\n\r\nProcess Safety Information, Operation Procedures, and Mechanical Integrity\r\n\r\nAll required Process Safety Information is maintained and transferred to all manufacturing sites through the Technology Transfer Process.  All documentation is controlled through this formal process and utilizes the Intel Master Design Standards and Intel Master Construction Specifications for each system.  This includes operating procedures, response flow charts, and maintenance and testing procedures are required for the critical safety equipment of these systems.\r\n\r\nContractors\r\n\r\nThe Contractor Safety Program has the following elements to ensure that contractors are provided a safe work environment, and to ensure that only contractors that have good safety programs and performance are conducting work on Intel sites:\r\n1.\tWhen selecting a contractor Intel goes through a formal selection process to evaluate information regarding the contract employer's safety performance and programs.\r\n2.\tAll suppliers go through a formal New Contractor/Supplier Orientation.  The main focus on this o"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062743,
      "SummaryText": "Executive Summary - Risk Management Plan\r\n\r\nIntel has a comprehensive Environmental, Health, and Safety Program that addresses all aspects of the life cycle of its processes, facilities, and products.  Its Process Safety/Risk Management program described here addresses how Intel manages the risks associated with high hazard chemical processes to prevent accidental releases, fires, or injuries related to process upsets with high or catastrophic potential.  Intel's advanced processes are consuming higher volumes of some hazardous gases than previous process technologies.  To accommodate this increased demand without increasing exposure risk, Intel has implemented an industry standard offering of DOT ISO module/trailer and ISOtainer/trailers to provide the process gas delivery and replace smaller industry standard cylinders.  Doing this will increase the volume of the gas delivery package, but it will also reduce projected package change frequency at advanced process factories, in some cases by 25X.  It is well known in the gas industry that the package change represents the highest risk for a release potential.   Intel has conducted numerous hazard assessments in conjunction with the ISO module and ISOtainer suppliers and our Architectural and Engineering (A&E) consultant. This included conducting numerous HazOp studies, consequence analysis on numerous scenarios, and a Layers of Protection Analysis (LOPA) in order to determine the risk management and control strategies.  The following describes the comprehensive Process Safety and Risk Management Program elements for all of these high hazard chemical systems.\r\n\r\nSafety in Facilities and Equipment Design\r\n\r\nToday's semiconductor facilities utilize toxic, corrosive, pyrophoric, and flammable materials. These materials are inherently hazardous, sometimes in small quantities, and therefore safety engineering is required to contain the hazard, reducing the risk to meet acceptable risk levels. The risk management and contr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062743,
      "SummaryText": "ol of these risks starts by integrating EHS systems into the procurement and installation of process equipment, facilities design, the safe commissioning and pre-startup safety process of these new facilities.\r\n\r\nIntel's EHS requirements for the procurement of process equipment are primarily driven to the front of the supplier chain through the Semiconductor Equipment Manufacturers Institute (SEMI) guideline process, an organization that develops standards for its members. EHS requirements such as SEMI S2 (safety), SEMI S8 (ergonomics), and S10 (hazard classification) are part of the S series of SEMI guidelines intended to define these industry safety standards for process equipment. In addition, Intel-specific requirements are included to address other risks. These include combustible material restrictions to reduce fire risk and environmental characterization and emissions requirements to control and manage our site environmental permitting requirements for air, waste, and water emissions.\r\n\r\nAfter the procurement of process equipment, it must be installed and integrated into facility systems. To accomplish this, EHS has integrated its requirements into the process equipment installation standards. This includes ergonomic clearances for safe maintenance and operation, ventilation, spill control, gas detection, and all EHS aspects related to how the process equipment is  installed. After these requirements have been established for equipment installations at the Technology Development site, they are transferred via the Master Design Package, which documents how all process equipment is installed at high volume manufacturing sites.\r\n\r\nSemiconductor process equipment is supported by larger facilities systems that perform gas distribution, bulk chemical delivery, and waste treatment. EHS requirements are integrated into the design of this equipment through the Intel EHS Facilities Equipment Procurement Process, which is an Intel master specification for all newly pr"
    }
  ]
}