{
  "FacilityID": 1000023956,
  "FacilityName": "The Gilman Brothers Company",
  "FacilityStr1": "Gilman Road",
  "FacilityStr2": null,
  "FacilityCity": "Gilman",
  "FacilityState": "CT",
  "FacilityZipCode": "06336",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09011",
  "LEPC": "Bozrah LEPC",
  "FacilityLatDecDegs": "41.580671",
  "FacilityLongDecDegs": "-72.198563",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.gilmanbrothers.com",
  "FacilityEmailAddress": "sales@gilmanbrothers.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Gilman Brothers company",
  "OperatorStr1": "Gilamn Road",
  "OperatorStr2": null,
  "OperatorCity": "Gilman",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06336",
  "OperatorZipCodeExt": "0038",
  "RMPContact": "Evan Gilman",
  "RMPTitle": "President",
  "FTE": 75,
  "OtherEPAFacilityID": "0901105073",
  "EPAFacilityID": "100000215536",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "013-0007",
  "SafetyInspectionDate": "2009-01-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-01-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-01-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-01-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029224,
      "AltID": "Isopentane Storage & Use",
      "FacilityID": 1000023956,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029486,
          "ProcessID": 1000029224,
          "NAICSCode": "326199",
          "_desc": {
            "NAICS_CODE": "326199",
            "NAICS_DESCRIPTION": "All Other Plastics Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034948,
          "ProcessID": 1000029224,
          "ChemicalID": 115,
          "Quantity": 95000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534948,
          "ProcessID": 1000029224,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023956,
      "SummaryText": "Founded in 1897, the Gilman Brothers Company (GBC) owns and operates a facility (Facility) located at Gilman Road, Gilman, CT to manufacture foam board products for signage, display and graphics.  Prior to receiving recent authorization from the Connecticut Department of Energy and Environmental Protection (Department) to increase production, the Facility was registered under the Department's General Permit to Limit Potential to Emit as a minor source of air pollution. As with the increased production the Facility is considered a major source of air pollution, GBC has applied for a Title V permit for the Facility.  The application is currently under review by the Department.\n\n\n\nThe foam boards are manufactured by extruding polystyrene and isopentane and are subsequently laminated with adhesives.  Isopentane, which functions as a physical foaming agent in the manufacturing process, is the only 40 CFR 68.130 listed substance used at the Facility.  Isopentane is a volatile liquid hydrocarbon chemical and is classified as flammable liquid/gas in accordance with 29 CFR 1910.1200(c).  As the quantity of Isopentane present at the Facility exceeds 10,000 pounds, the Facility is required to develop and implement both a Process Safety Management (PSM) system in accordance with of 29 CFR 1910.119 and a Risk Management Plan RMP in accordance with 40 CFR 68.150.  The Facility already has a PSM system in place, which was last reviewed on February 2, 2002.  The Facility has also developed and implemented a RMP, which is summarized in this submission. \n\n\n\nThe covered process at the Facility involves \"Isopentane Storage and Use\".  Isopentane is stored in an 18,000 gallon tank, outside of the building and is transferred through a series of pumps to the primary extruder, where it is dispersed into the melted polystyrene by injection at high temperature and high pressure.  The thoroughly blended polystyrene /isopentane melt is then pumped to the secondary extruder, where it is cooled a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023956,
      "SummaryText": "nd conditioned and forced through a die to form a web.  When exposed to much lower atmospheric pressure and temperature at the die exit, isopentane expands and forms foam bubbles and the melt solidifies as foam board.\n\n\n\nThe Facility has performed the hazard analysis in accordance with the applicable provisions of 40 CFR 68 Subpart B.  The off-site consequence analysis (OCA) was performed using the United States Environmental Protection Agency's (USEPA\"s) RMP*Comp software.  The worst case release scenario involves tank rupture resulting in vapor cloud explosion.  The end point of the scenario is 0.4 miles from the tank and may potentially affect a population of 41 in residences within the end point.  The alternate release scenario, which is the most likely worst case scenario, involves pipe leakage resulting in vapor cloud fire.  The end point of the scenario is 0.1 miles from the tank and there are no public receptors within the end point.  The Facility has not had a release from the covered process.\n\n\n\nGBC and the Facility personnel are fully committed to operating the covered process safely.  The Facility personnel have been trained in proper operating and emergency procedures.  The covered process equipment is built and installed in accordance with the appropriate codes.  The covered process is equipped with gas detection systems, emergency relief valves, excess flow valves, automatic interlocks and alarms to prevent and/or minimize the impact from a release and provide warning.  The Facility is inspected on a regular basis to ensure that all process and emergency equipment is operating properly.\n\n"
    }
  ]
}