{
  "FacilityID": 1000104894,
  "FacilityName": "Iron Horse Complex",
  "FacilityStr1": "3646 South Fidlar Road",
  "FacilityStr2": null,
  "FacilityCity": "South of Vernal",
  "FacilityState": "UT",
  "FacilityZipCode": "84078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49047",
  "LEPC": "Uintah County LEPC",
  "FacilityLatDecDegs": "40.036170",
  "FacilityLongDecDegs": "-109.454827",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.mplx.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 968042542,
  "ParentCompanyName": "Andeavor Logistics LP",
  "Company2Name": "MPLX, LP",
  "CompanyDUNS": null,
  "Company2DUNS": 78542035,
  "OperatorName": "Andeavor Field Services, LLC",
  "OperatorStr1": "1515 Arapahoe St.",
  "OperatorStr2": "Tower 1, Suite 1600",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": "2136",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203246",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-03-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-04-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-04-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-04-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-04-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.03617,
  "FRS_Long": -109.454827,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130903,
      "AltID": "NGL Recovery and Storage",
      "FacilityID": 1000104894,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000164105,
          "ProcessID": 1000130903,
          "ChemicalID": 155,
          "Quantity": 2200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000146334,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000146333,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000146332,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000146331,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000146330,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000146329,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000146328,
              "ProcessChemicalID": 1000164105,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000132336,
          "ProcessID": 1000130903,
          "NAICSCode": "21113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000112790,
              "Process_NAICS_ID": 1000132336,
              "SafetyReviewDate": "2023-02-17 00:00:00",
              "PHA_Date": "2025-04-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-08-17 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Gas detection and fire-eye detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-12-28 00:00:00",
              "TrainingReviewDate": "2023-01-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer Based Training Quiz",
              "MaintenanceReviewDate": "2022-05-26 00:00:00",
              "EquipmentInspectionDate": "2023-04-06 00:00:00",
              "EquipmentTested": "C-101",
              "ChangeMgmtDate": "2023-03-07 00:00:00",
              "ChangeMgmtReviewDate": "2021-07-23 00:00:00",
              "PreStartupReviewDate": "2023-03-20 00:00:00",
              "ComplianceAuditDate": "2022-09-07 00:00:00",
              "AuditCompletionDate": "2025-09-07 00:00:00",
              "IncidentInvestigationDate": "2022-06-05 00:00:00",
              "InvestigationChangeDate": "2022-09-06 00:00:00",
              "ParticipationPlansReviewDate": "2021-04-28 00:00:00",
              "HotWorkPermitReviewDate": "2021-12-31 00:00:00",
              "ContractorSafetyReviewDate": "2023-03-09 00:00:00",
              "ContractorSafetyEvalDate": "2021-06-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000141637,
                  "PreventionProgram3ID": 1000112790,
                  "ProcessChemicalID": 1000164105
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104894,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Uintah LEPC",
    "CoordinatingAgencyPhone": "4357815466",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 11,
      "FacilityID": 1000104894,
      "SummaryText": "equired, the study team was composed of participants with expertise in engineering and process operations. The results of the PHA yielded a total of 23 recommendations. The recommendations are being addressed and tracked to completion with the latest planned completion date of April 30, 2025.\n\nMPLX believes that diligent compliance with our PSM Program forms the framework that allows for the continued improvement to the level of safety at the Iron Horse Gas Plant. Some of the key components of the program that will help maintain and, where applicable, improve safety are:\n\nThe Management of Change provisions ensure that the Iron Horse Gas Plant considers the potential safety and health impacts of each change made to chemicals, technology, equipment or procedures.\n\nThe PHA provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in safety standards.\n\nThe Mechanical Integrity provisions ensure that equipment and instrumentation are designed, constructed, installed, and maintained to minimize the risk of hazardous release thereby serving as an integral part to the safety program.\n\nInternal and third-party compliance audits will ensure that the Iron Horse Gas Plant maintains and increases the level of safety protection.\n\nCERTIFICATION\nMPLX certifies that the Iron Horse Gas Plant (Title V Facility) is in-compliance with all requirements of 40 CFR Part 68 including the registration and submission of the RMP. \n\nDOCUMENTATION OF CALCULATIONS WILL BE PROVIDED UPON REQUEST"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000104894,
      "SummaryText": "ility personnel are not trained to be first responders to large fires, and should a release occur from one of the vessels, the Iron Horse Plant would rely on the local fire department and Butler County HAZMAT to respond.\n\nEmployees receive training in the procedures to be followed when certain employees must remain to operate critical process operations before they evacuate.  The Iron Horse Gas Plant has around the clock communication capability with appropriate emergency response organization (e.g., Fire Department). This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  \n\nThe overall emergency response program for the Iron Horse Gas Plant is coordinated with the Uintah County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials and local government officials.  The Iron Horse Gas Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., Fire Department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Iron Horse Gas Plant conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the facility performs annual notification drills with local emergency responders.\n\nMANAGEMENT SYSTEM\n\nThe Operations Director has overall responsibility for the development, implementation, and integration of the RMP. Specific responsibilities are summarized in the supporting documentation associated with this RMP.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nMPLX held the most recent PHA study sessions in August 2022 to identify process hazards associated with Iron Horse Train 2 process. The methodology and content of the PHA met the requirements of 29 CFR 1910.119(e). As r"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000104894,
      "SummaryText": "ent failures and human errors.\n\nSPECIALIZED SAFETY FEATURES\n\nThe Iron Horse Gas Plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered process:\n\nRelease Detection\n1) Hand-held hydrocarbon detectors operated by facility personnel.\n2) Fire and gas detection systems interlocked with plant process controls and ESD system.\n3) Facility wide ESD system with process interlocks and strategic location of emergency pull stations.\n\nRelease Containment/Control\n1) Valves to permit isolation of the process (manual and automated).\n2) Automated shutdown systems for specific process parameters (e.g., high temperature)\n3) Curbing or dykes to contain liquid releases.\n4) Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system).\n\nRelease Mitigation\n1) Fire extinguishing systems for specific equipment.\n2) Trained emergency response personnel will be utilized.\n3) Personal protective equipment (e.g., chemical protective clothing).\n\nFIVE-YEAR ACCIDENT HISTORY\n\nIn the last five years, the Iron Horse Gas Plant has had no reportable accidental releases from covered processes that resulted in death, injury or significant property damage on site, or known off site death, injury, evacuation, sheltering in place, property damage or environmental damage.\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Iron Horse Gas Plant is a Non-Responding Facility as per 48 CFR 68.90(b).  The facility maintains a written emergency action plan (EAP), which is in place to protect worker and public safety as well as the environment.  The identifies steps to be taken in case of an accidental release including the following: evacuation plans, accounting for personnel after an evacuation, and notification of company staff, local emergency response agencies and the public if a release occurs.  However, fac"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000104894,
      "SummaryText": "CTICES\n\nMPLX has long-standing safe work practices as mandated by OSHA, Industrial Standards, and Good Engineering Practice in place to help provide employee, public and process safety.\n\nCONTRACTORS \n\nThe Iron Horse Gas Plant uses contractors to supplement its workforce during periods of increased or specialized maintenance or construction activities. Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors: perform their work in a safe manner; have the appropriate knowledge and skills; are aware of the hazards in their workplace; understand what they should do in event of an emergency; understand and follow site safety rules; and inform facility personnel of the hazards that they find during their work. This is accomplished by providing contractors with: a process overview; information about potential fire, explosion, or toxic release hazards; emergency response plan requirements; and safe work practices prior to their beginning work. In addition, the Iron Horse Gas Plant will only select contractors who submit certification that employees are trained in specifics and safe work practices associated with their job, and that provide safety performance documentation from the previous three years. Finally, facility personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Iron Horse Gas Plant have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUNIVERSAL PREVENTION ACTIVITIES\n\nThe accident prevention program summarized previously is applied to the RMP-covered process at the Iron Horse Gas Plant. Collectively, these prevention program activities prevent or mitigate potential accident scenarios that could be caused by equipm"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000104894,
      "SummaryText": "person knowledgeable in the process, and other members with appropriate experience to investigate and analyze the incident. The team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to facility management for resolution. Corrective actions that are identified will be promptly addressed, resolved and tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with facility employees (including contractors) whose job tasks are relevant to the investigation. Incident investigation reports are retained for at least five years so that the reports can be reviewed during PHAs and PHA revalidations.\n\nEMPLOYEE PARTICIPATION\n\nMPLX encourages employees to participate in the facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a PHA team. Employees will be provided with the information created as part of the facility accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the facility. Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.\n\nHOT WORK PERMIT\n\nMPLX uses a hot work permit for hot work operations including grinding, welding, and spark producing activities conducted on or near a covered process. The hot work permit documents the fire prevention and protection requirements prior to beginning hot work operations. The permit indicates the days on which hot work may be performed and the object upon which hot work is to be performed. Hot work permits are kept in a place that is easily accessible for the workers and on file at the office until the completion of hot work operations.\n\nSAFE WORK PRA"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000104894,
      "SummaryText": "during the management of change process. The PSSR will ensure that: modifications were installed as described; no other changes were made outside the original scope of work; operating procedures have been modified and communicated to operating and maintenance personnel; necessary tests have been completed prior to start-up; site safety, fire protection, and environmental issues have been addressed; the startup plan has been reviewed; pertinent drawing have been red-lined or updated to as-built requirements; vendor files have been updated; and training of affected personnel has been performed and documented. Ultimately, these reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCOMPLIANCE AUDITS\n\nTo help ensure compliance with the RMP, MPLX periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every three years. Team membership will include at least one person knowledgeable of the system being audited. One member of the team must be qualified to lead the audit and be familiar with the auditing protocol being administered. The Plant will maintain a listing of non-conformances identified during an audit and document closure of compliance audit action items. The two most recent audit reports will remain on file with the documentation of closed items.\n\nINCIDENT INVESTIGATION\n\nMPLX promptly investigates incidents that resulted in, or reasonably could have resulted in, a fire/explosion, release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts, determine what error states led to the incident and to develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team consists of the immediate supervisor, one"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000104894,
      "SummaryText": "erify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment. \n\nAnother integral part of the mechanical integrity program is quality assurance. The Iron Horse Gas Plant incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nMANAGEMENT OF CHANGE\n\nMPLX has a comprehensive system to manage changes to the covered processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to ensure that adequate controls are in place to manage new hazards and to verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained on the specifics of the modification.\n\nPRE-STARTUP SAFETY REVIEWS (PSSRS)\n\nMPLX conducts a PSSR for a new facility or facility modification that requires a change in the process safety information. The PSSR confirm that construction was completed in accordance with design specifications, that safety, operating, maintenance, and emergency procedures are in place and are adequate. The PSSR will be reviewed and appropriately updated"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104894,
      "SummaryText": "and accurate by revising them as necessary to reflect changes made through the management of change process. The operating procedures are centrally located and accessible to employees.\n\nTRAINING\n\nTo complement the written procedures for process operations, the Iron Horse Plant has implemented a comprehensive training program for the employees involved in operating a process. New employees receive basic training in facility operations unless they provide written certification that they have the required knowledge, skills and abilities to safely carry out their specific duties and responsibilities. MPLX employees at the Iron Horse Gas Plant will be trained in PSM/RMP requirements upon hire as part of their qualification to work in PSM/RMP processes. Operations employees will undergo refresher training at least every three years. A training attendance record will be kept for training activities and a verification of understanding will be conducted by a performance evaluation or through testing.\n\nMECHANICAL INTEGRITY\n\nMPLX has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: training; written procedures; inspections and tests; correcting identified deficiencies; and applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on an overview of the process, safety and health hazards, applicable maintenance procedures, emergency response plans, and applicable safe work practices to help ensure that they can perform their jobs in a safe manner. Job plans/written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to v"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104894,
      "SummaryText": "he following:\n1) hazards of the process,\n2) previous incidents with likely potential for catastrophic consequences,\n3) consequences of failure of engineering and administrative controls,\n4) engineering and administrative control applicable to the hazards and their inter-relationships,\n5) facility siting issues, and\n6) human factors.\n\nThe PHA team findings are compiled in a written report and are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned that highest risk receive immediate attention. Approved mitigation options in response to PHA team findings are tracked until they are completed. The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the facility periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operative. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\nOPERATING PROCEDURES\n\nMPLX maintains written procedures that address various modes of operations, such as: unit startup; normal operations; temporary operations; emergency shutdown; normal shutdown; emergency operations, startup after a turn around, and initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104894,
      "SummaryText": "ed safety-related limits for specific process parameters (e.g., temperature, level, composition) in key process parameter documents. The facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\nThe facility also maintains numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nPROCESS HAZARD ANALYSIS (PHA)\n\nMPLX has a comprehensive program to help ensure that hazards associated with the process are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nMPLX will use one or more of the following techniques to identify hazards: what-if, checklist, what-if/checklist, hazard and operability (HAZOP), failure mode and effects analysis (FMEA), or fault tree analysis (FTA). HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques and will be utilized for each major process change or renovation. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nEach PHA will address t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104894,
      "SummaryText": "ieve dehydration system. The temperature of the gas stream exiting the dehydration system is dropped significantly through expansion. The closed-loop hot oil system supplies heat to multiple process vessels to aid in preventing freezing. The hot oil system is also utilized to increase the temperature of the gas stream throughout the process to facilitate the recovery of NGLs. Iron Horse Train 2 is designed to process 165 MMSCF/D.  The process description and routing of process streams are identical to that of Iron Horse Train 1.\n\nFive Year Accident History:\nNo accidents involving regulated substances that resulted in onsite injuries, significant property damage, or offsite response have occurred since startup.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place for the process at the facility. This summary addresses each of the Occupational Safety and Health Administration (OSHA) process safety management (PSM) elements and describes the management system in place to implement the accident prevention program since the process at the facility that is regulated by the EPA's RMP regulation is also subject to the OSHA's PSM standard.\n\nPROCESS SAFETY INFORMATION\n\nMPLX keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. The reference documents are maintained on file at the facility to provide open access.\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDS’s). This information is supplemented by documents that specifically address known corrosion concerns and known hazards associated with the inadvertent mixing of chemicals. For the process, the facility has document"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104894,
      "SummaryText": "RMP Executive Summary\nIron Horse Complex\nAndeavor Field Services, LLC (owned by MPLX)\n\nLocation and Regulated Substances:\nMPLX owns and operates the Iron Horse Complex, a natural gas processing facility, located approximately 30 miles south of Vernal, Utah (40.036170 N latitude, -109.454827 W longitude).    The Iron Horse Complex began operations in July 2008 and is comprised of three gas processing trains: Stagecoach, Iron Horse 1, and Iron Horse 2. \n\nThe Stagecoach Train is designed to process 200 million standard cubic feet of gas per day (MMSCF/D).  The gas is delivered from pipelines and various compressor stations.  To reduce the dew point of the gas, the facility uses a propane refrigeration system to chill the inlet gas, which first flows through a slug catcher to remove bulk liquids from the gas stream.  Ethylene glycol (EG) is injected into the inlet stream to help prevent formation of hydrates.  Natural Gas Liquids (NGL) are removed and processed to meet industry specifications.  Condensate, also removed in the process, is stabilized and removed from the site via tanker truck. \n\nNGLs are removed by significantly lowering the temperature of the inlet gas stream via propane refrigeration.  The propane system is close-looped, and the refrigerant is circulated throughout the system by a compressor.  The chilled gas stream and its associated liquids pass through a three-phase cold separator where the gas exits off the top and leaves the facility by way of the sales line.\n  \nIron Horse Train 1 is designed to process 165 MMSCF/D.  The inlet stream enters the facility and is directed through a separate slug catcher. Condensate and water are directed from the slug catcher to the separator of the Stagecoach train. The gas stream is routed from the slug catcher to an inlet filter separator/coalescer system and then to an adsorbent treater for the removal of impurities, including mercury and hydrogen sulfide, if present. The gas stream is then routed to a molecular s"
    }
  ]
}