{
  "FacilityID": 1000039715,
  "FacilityName": "McGean-Rohco, Inc.",
  "FacilityStr1": "2910 Harvard Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Cleveland",
  "FacilityState": "OH",
  "FacilityZipCode": "44105",
  "Facility4DigitZipExt": "3010",
  "FacilityCountyFIPS": "39035",
  "LEPC": "Cuyahoga County LEPC",
  "FacilityLatDecDegs": "41.446944",
  "FacilityLongDecDegs": "-081.665833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.mcgean.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77758753,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "McGean-Rohco, Inc.",
  "OperatorStr1": "2910 Harvard Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Cleveland",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44105",
  "OperatorZipCodeExt": "3010",
  "FTE": 69,
  "OtherEPAFacilityID": "44109MCGNR2910",
  "EPAFacilityID": "100000129611",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-03-22 11:39:24",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-03-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.446944,
  "FRS_Long": -81.665833,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048868,
      "AltID": "Epichlorohydrin",
      "FacilityID": 1000039715,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059287,
          "ProcessID": 1000048868,
          "ChemicalID": 21,
          "Quantity": 54000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000049307,
          "ProcessID": 1000048868,
          "NAICSCode": "32518",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000049308,
          "ProcessID": 1000048868,
          "NAICSCode": "32519",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000048870,
      "AltID": "Vinyl Acetate Monomer",
      "FacilityID": 1000039715,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059289,
          "ProcessID": 1000048870,
          "ChemicalID": 29,
          "Quantity": 58000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000049311,
          "ProcessID": 1000048870,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000049312,
          "ProcessID": 1000048870,
          "NAICSCode": "32518",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039715,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-12-11 00:00:00",
    "ERTrainingDate": "2018-10-29 00:00:00",
    "CoordinatingAgencyName": "Cuyahoga County LEPC",
    "CoordinatingAgencyPhone": "2168987713",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039715,
      "SummaryText": "are Epichlorohydrin and Vinyl Acetate Monomer.\r\n\r\nThe facility covered by the RMP submission includes eight buildings located on a seventeen-acre site in Cleveland, Ohio.  Three of the buildings are devoted to processing chemicals.  One building contains administrative staff and the remaining buildings are used for warehousing or are vacant.  The manufacturing areas include standard chemical processing equipment, such as storage and mixing tanks, reactors, heat exchangers and pumps.\r\n\r\nThe EPA OFFSITE CONSEQUENCE ANALYSIS GUIDANCE was used in determining if there could be offsite impact in a worst-case scenario.  A worst-case scenario model was developed for each of the two RMP regulated chemicals.  In each case, it was shown that there are no public receptors within the worst-case scenario consequence area.  \r\n\r\nOur Cleveland, Ohio facility developed and employs procedures to control, manufacturing and equipment operation.  In addition, operating procedures have been developed to manage emergencies and prevent chemical spills.  Chemical storage tanks containing RMP chemicals are protected by concrete dikes, and some tanks are also enclosed in buildings. Transfers of raw materials and finished products are controlled by instrumentation integrated with various safety interlocks. \r\n \r\nThe emergency procedures were developed with local emergency responders to address any incidents that may occur.  Employees at McGean-Rohco are trained to notify the appropriate responders and other agencies as needed. These are listed in the McGean-Rohco Emergency Action Plan.\r\n\r\nWe have not experienced any accidental releases of RMP chemicals in the last five years.  \r\n\r\nMcGean-Rohco works closely with the Cuyahoga Heights Fire & Police Departments and with its neighbors in training and sharing of information.  Employees have received both on-and off-site training.  Employee training programs are in compliance with the required OSHA regulations and are conducted on a regular basis."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039715,
      "SummaryText": "Drills are conducted with local fire departments, hazardous materials teams and industrial neighbors.  Public notification would be through the local fire department and LEPC.  \r\n\r\nWe periodically review safety procedures and programs and update them as necessary. McGean-Rohco management tracks safety and environmental performance and sets challenging goals to improve the safety and environmental performance.  Process Hazard Analyses, training, quality upgrades and procedural methods are all used to ensure all of McGean-Rohco's facilities operate safely and responsibly."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039715,
      "SummaryText": "April 28, 2004\r\n\t\r\nExecutive Summary for RMP\r\n\r\nMcGean-Rohco, Inc. develops specialty chemical application technologies, manufactures organic and inorganic chemicals, and provides technical services on a worldwide basis through a network of technical sales representatives, distributors and affiliates. Principal industries served include: general metal finishing of ferrous and non-ferrous metals and other materials, fabricating of printed circuits and electronics, manufacturing glass and fiberglass, preparing dyes, pigments and catalyst, and the manufacturing and maintenance of commercial and military aircraft.\r\n\r\nMcGean-Rohco, Inc. is a member of the Synthetic Organic Chemical Manufacturers Association (SOCMA).  SOCMA is a partner in Responsible Care guiding principles of Chemical Manufactures Association (CMA).  We are committed to supporting and continuing efforts to improve the industry's management of chemicals. We pledge to manage our business according to the guiding principles.\r\n\r\nMcGean-Rohco management is sincerely concerned about the health, safety, and environmental well-being of fellow employees, customers and the community. At McGean-Rohco, Inc. safety is a way of life on the job and hopefully at home.  We believe that accidents are preventable and that no job is so important that it should be performed in an unsafe manner.  McGean-Rohco's corporate policy is that safety is each employee's first and most important job responsibility.  If at any time, an employee believes a work assignment is dangerous to them personally, or to others around them, it is their duty and responsibility to speak about the problem with management to find a better and safer way to complete the work assignment.\r\n\r\nUnder the USEPA Risk Management Programs (RMPs), our Cleveland, Ohio manufacturing facility is required to develop and submit RMP information. Our Cleveland, Ohio facility handles various types of chemicals, three of which are subject to RMP requirements. They"
    }
  ]
}