{
  "FacilityID": 1000048261,
  "FacilityName": "Foppiano Farms",
  "FacilityStr1": "500 N. Jacktone Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Linden",
  "FacilityState": "CA",
  "FacilityZipCode": "95236",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland region 4 LEPC",
  "FacilityLatDecDegs": "37.977509",
  "FacilityLongDecDegs": "-121.145508",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Morada Produce Co.",
  "OperatorStr1": "500 N. Jacktone Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Linden",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95236",
  "OperatorZipCodeExt": null,
  "RMPContact": "Skip Foppiano",
  "RMPTitle": "Partner/Owner",
  "FTE": 330,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207634",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-10-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "2009 Update",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-02-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-02-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060392,
      "AltID": "NH3 Refrigeration",
      "FacilityID": 1000048261,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061537,
          "ProcessID": 1000060392,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073956,
          "ProcessID": 1000060392,
          "ChemicalID": 56,
          "Quantity": 26084.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573956,
          "ProcessID": 1000060392,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048261,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nExecutive Summary \n\n\n\nThe Risk Management Program at Morada Produce Co. complies with California Accidental Release Prevention (CAL ARP) and Federal RM program requirements. This facility processes, packs and stores vegetables and fruit consistent with SIC Code 0723 on a seasonal basis.\n\nIn 2003 Morada Produce complied with the RM Program regulations by completing the following major steps:\n\n1.    Identify Covered Processes\n\n2.    Determine Program Level\n\n3.    Establish a Management System\n\n4.    Conduct a 5 year Accident History\n\n5.    Perform Hazard Assessments\n\n6.    Develop an Accident Prevention Program\n\n7.    Develop an Emergency Response Program and\n\n8.    Prepare a Risk Management Plan (RMP)\n\n\n\nAt that time we were a Program 2 with inventories less than 10,000lbs of anhydrous ammonia used as a refrigerant in a closed loop refrigeration system. Expansion plans underway will increase the inventory to more than10,000 lbs. of anhydrous ammonia.\n\n\n\nPublication or sharing of OCA portions of RMP materials can be in violation of the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). \n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nWe at Morada Produce Co. are strongly committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance demonstrates this commitment, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nOur facility?s primary activities encompass vegetable and fruit, packing and storage.  We have 1 regulated substance above threshold quantities present at our facility.  This substance is Ammonia (anhydrous) used for a refrigerant. We have inventories "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048261,
      "SummaryText": "greater than 10,000 lbs. requiring compliance as Program 3 level.\n\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nThe worst-case release scenario mandated by the RMP Rule is a standardized hypothetical situation intended to promote ?dialogue?. According to the International Institute of Ammonia Refrigeration ?The worst-case situation represents an extremely improbable (and for many facilities impossible) set of circumstances rather than a credible accident scenario. Release quantities and hazard distances derived therefrom for the worst-case scenario should not be used as a basis for emergency response planning.?\n\nTo evaluate the worst and alternate case scenarios, we have used the EPA?s RMPComp software.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from the high-pressure receiver. In this scenario Ammonia (anhydrous) is released from the system.  In typical operation only 10-20% of this amount is present at one time in the receiver. The toxic liquid released is assumed to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  At Class F atmospheric stability, urban location due to trees/orchards in the area providing obstacles and 1.5 m/s windspeed, the maximum distance is obtained corresponding to a toxic endpoint of 0.14 mg/L.  Population estimates for the entire area is included in the study. Actual number affected by a worst case release is only 10% of this amount that would be in the plume footprint. The plume footprint is an oblong area starting at the release point getting the widest ? the distance to the toxic endpoint and then narrowing again.\n\nThe alternative release scenario for Ammonia (anhydrous) involves a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048261,
      "SummaryText": " compressor shaft seal failure.  The scenario involves the release of 291lb. of   Toxic vapor inside the machine room in direct contact with outside air. The release is stopped after 30 minutes by manual isolation.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L of Ammonia (anhydrous) is < .1 miles. Actual distances less than .1 mile is recorded as .1 miles. No public receptors are in the distance to toxic endpoint. In this release it would just reach the property boundary. \n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\n\nMorada Produce  maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 3 years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 4/8/09. All possible conditions that could upset the system and natural disasters like fire and earthquake were considered.\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Morada Produce Co. maintains"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048261,
      "SummaryText": " written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\nMorada Produce Co. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\n\nMorada Produce Co. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. A refrigeration contractor performs all line opening operations and inspections.\n\nCompliance Audits\n\nMorada Produce Co. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nMorada Produce Co. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All rep"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048261,
      "SummaryText": "orts are retained for a minimum of 5 years.\n\n5.    Five-year Accident History\n\nMorada Produce Co. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.    Emergency Response Plan\n\nMorada Produce carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nCounty of San Joaquin is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.    Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Installing better identification of critical isolation valves, daily checklists,painting pipes and installing labels. These changes are to be implemented in 2015."
    }
  ]
}