{
  "FacilityID": 1000093305,
  "FacilityName": "El Dorado Operating LLC",
  "FacilityStr1": "1401 South Douglas Road",
  "FacilityStr2": null,
  "FacilityCity": "El Dorado",
  "FacilityState": "KS",
  "FacilityZipCode": "67042",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20015",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "37.795586",
  "FacilityLongDecDegs": "-96.872062",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://hollyfrontier.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Holly Energy Partners, L.P.",
  "Company2Name": "HollyFrontier Corporation",
  "CompanyDUNS": 144818395,
  "Company2DUNS": 8965808,
  "OperatorName": "El Dorado Operating LLC",
  "OperatorStr1": "1401 South Douglas Road",
  "OperatorStr2": null,
  "OperatorCity": "El Dorado",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67042",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "110067553908",
  "EPAFacilityID": "100000232517",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0150004",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-04-26 14:48:12",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-26 14:48:12",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-04-26 14:48:12",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 37.799722,
  "FRS_Long": -96.866667,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115832,
      "AltID": "NAPHTHA FRAC",
      "FacilityID": 1000093305,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144769,
          "ProcessID": 1000115832,
          "ChemicalID": 155,
          "Quantity": 240000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000128085,
              "ProcessChemicalID": 1000144769,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000128086,
              "ProcessChemicalID": 1000144769,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117244,
          "ProcessID": 1000115832,
          "NAICSCode": "32411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000099097,
              "Process_NAICS_ID": 1000117244,
              "SafetyReviewDate": "2020-11-16 00:00:00",
              "PHA_Date": "2020-11-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-11-16 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire water system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Personal H2S Monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-04-03 00:00:00",
              "TrainingReviewDate": "2017-11-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-03-03 00:00:00",
              "EquipmentInspectionDate": "2020-07-21 00:00:00",
              "EquipmentTested": "PSV-14556",
              "ChangeMgmtDate": "2020-12-31 00:00:00",
              "ChangeMgmtReviewDate": "2020-10-07 00:00:00",
              "PreStartupReviewDate": "2020-10-07 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-08-14 00:00:00",
              "HotWorkPermitReviewDate": "2020-10-05 00:00:00",
              "ContractorSafetyReviewDate": "2020-10-15 00:00:00",
              "ContractorSafetyEvalDate": "2020-09-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000124219,
                  "PreventionProgram3ID": 1000099097,
                  "ProcessChemicalID": 1000144769
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093305,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-05-28 00:00:00",
    "ERTrainingDate": "2021-04-12 00:00:00",
    "CoordinatingAgencyName": "El Dorado Fire Department",
    "CoordinatingAgencyPhone": "3163219100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093305,
      "SummaryText": "Executive Summary\r\nThis document outlines a Risk Management Program (RMP), prepared in accordance with 40 CFR Part 68. This document has been prepared to consider the naphtha fractionation unit as single RMP Program 3 process.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nThe HollyFrontier El Dorado Refining LLC's (HFEDR's) refinery in El Dorado, Kansas has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, training personnel and considering safety in the design, installation, operation, and maintenance  activities. The goal is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, refinery personnel have been trained on the proper response to control and contain the release.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\nHollyFrontier Corporation established the naphtha fractionation unit under a master limited partnership, El Dorado Operating LLC, a subsidiary of Holly Energy Partners (HEP), which owns two process units within the HFEDR refinery. Of the two units, only the naphtha fractionation unit is an EPA RMP covered process. Regulated flammable mixtures above threshold quantities are processed in the Naphtha Fractionation Unit.\r\n\r\nGENERAL ACCIDENTAL RELEASE/CHEMICAL SPECIFIC PREVENTION PROGRAM STEPS\r\nThe facility is subject to the EPA Risk Management Program (RMP) regulation and the OSHA Process Safety Management (PSM) standard. Therefore, there is a management system in place to address each element and to implement the accident prevention program. A brief discussion follows for each of these areas. Employee participation is encouraged in the development, review and application of procedures and information regarding the various PSM and RMP elements. Some of the more significant opportunities for active participation are Process Hazard Analysis studies, Management of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093305,
      "SummaryText": "Change, Pre-Startup Safety Reviews, Incident Investigation, Operating Procedures and Training.\r\n\r\nDocumentation is an important aspect in the operation of a petroleum refinery and Process Safety Information is maintained for safety and operational reasons. The information regarding chemicals, process chemistry and refinery equipment is extensive and is continuously being verified and updated.\r\n\r\nIdentifying potential hazards is a critical element of the safety process at the HFEDR refinery. Process Hazard Analysis studies have been performed on all covered processes at the refinery and are revalidated on a 5 year schedule. Hazard analysis is also performed on changes through the Management of Change process. Recommendations resulting from the studies are addressed and actions taken to address the recommendations are documented.\r\n\r\nOperating Procedures have been developed to provide instructions for safely operating the unit. These procedures serve as a consistent basis for training new operators and for reference by experienced operators. The procedures are periodically reviewed, are considered in the management of change process and are annually certified as current and accurate.\r\n\r\nOperator Training is conducted in coordination with the operating procedures. New employees receive foundational training on refinery operations and unit specific training. All operators receive refresher training to ensure operating skills and knowledge are maintained and enhanced. Training requirements are also considered when changes are made to the process.\r\n\r\nThe facility uses contractors to supplement its workforce and because this work is often on or near process equipment, there are specific requirements for contractors. Contractor safety programs, performance and training are evaluated prior to allowing them to perform work in the refinery. The contractors are made aware of refinery safety rules and evacuation plans and are informed of potential hazards related to their work."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093305,
      "SummaryText": "Contractor activities are monitored while in the refinery to ensure they are fulfilling their safety obligations.\r\n\r\nThe facility reviews process changes through the Management of Change and Pre-Startup Safety Review process. The review and authorization process makes provisions for reviewing the change from several aspects, including the potential hazards, safety and health effects, procedural updates and training requirements. The pre-startup safety review provides a final safety review of the change prior to startup.\r\n\r\nMechanical Integrity programs are necessary to provide for the on-going integrity of process equipment and instrumentation. Experienced employees and qualified contractors perform maintenance work on the equipment and instrumentation. Inspection and tests are performed in accordance with plant and industry standards and quality assurance is incorporated in new construction and maintenance activities.\r\n\r\nIncident Investigations are valuable learning tools in determining facts regarding incidents and in developing corrective actions to prevent recurrence. The refinery has personnel trained in incident investigation techniques and they are assigned as required to form teams, investigate incidents and report on the findings. The report and any recommendations are then acted on to improve the safety of the unit and the refinery.\r\n\r\nSafe Work Practices at the HFEDR refinery are long-standing practices to help ensure operations and maintenance activities are performed safely. These are periodically reviewed and updated.\r\n\r\nTo help ensure that the accident prevention program is functioning properly, audits are periodically conducted to confirm the procedures and practices required by the accident prevention program are being implemented. The findings are forwarded to management for resolution. Corrective actions taken in response to the audit team findings are tracked until they are complete. The final resolution of each finding is documented, and the two"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093305,
      "SummaryText": "most recent audit reports are retained. \r\n\r\nCHEMICAL SPECIFIC PREVENTION STEPS\r\nThe equipment at the facility have hazards that must be managed for continued safe operation. The accident prevention program summarized previously is applied to the naphtha fractionation unit. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors. In addition to the accident prevention program activities, the facility has safety features to help contain/control a release, quickly detect a release and reduce the consequences or mitigate the consequences of a release.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\nThere has been no accident with the naphtha fractionation unit involving releases from the covered process that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\nThe emergency response plan for naphtha fractionation unit is documented in the El Dorado Emergency Response Plan and in the Emergency Reference Manual covering the HFEDR refinery. These form an organizational plan designed to manage an emergency situation by setting up effective communications, establishing a management plan, coordinating necessary resources and allowing coordination with any municipal/state/federal emergency response agency that may respond to an emergency at the refinery.\r\n\r\nThe HFEDR refinery emergency response organization starts with members of the Safety Department and the Emergency Response Team (ERT). Fire\\Safety Specialists are on duty 24 hours a day, 7 days a week and serve as the Operations Chief in an incident. They are trained Industrial Fire Officers and Emergency Medical Technicians. They are rapidly supplemented by volunteer members of the Emergency Response Team that are on each shift. They may be further supplemented by calling out"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093305,
      "SummaryText": "additional members of the ERT and members of the management team.\r\n\r\nThe emergency response team members have a number of skills and training including rescue operations, emergency medical treatment, fire suppression and hazardous material response. Emergency response drills and training are conducted periodically to evaluate and enhance the HFEDR refinery's overall emergency response program. Some of the training and drills include weekly table-top exercises, periodic fire training, periodic emergency response training, periodic rescue training, and periodic hazardous material training. Employees are also sent to off-site training sessions in these same areas. The training and drills have often been coordinated with the El Dorado Fire Department, Butler County Emergency Management, Butler County LEPC, Butler County Rescue Squad and Butler County Sheriff's Department.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nEl Dorado Operating LLC will continue to seek improvement in safety for the facility and surrounding community. Areas of focus include:\r\n\r\n- Operation Excellence with continuing improvement in operating discipline, procedures/training, and process monitoring;\r\n- Mechanical Integrity with finishing the retro-PMI programs, completing implementation of the RBMI program, and improvements in the PSV program management; and \r\n- The Process Safety group efforts will include updating and implementing procedures in process hazard analysis, management of change, and facility siting evaluation process."
    }
  ]
}