{
  "FacilityID": 1000088253,
  "FacilityName": "Malaga Power, LLC",
  "FacilityStr1": "2611 E. North Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "93725",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.692560",
  "FacilityLongDecDegs": "-119.741030",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Malaga Power Holdings, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Malaga Power, LLC",
  "OperatorStr1": "14950 W Schulte Rd",
  "OperatorStr2": null,
  "OperatorCity": "Tracy",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95377",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Archibald",
  "RMPTitle": "Plant Manager",
  "FTE": 3,
  "OtherEPAFacilityID": "CAL000405327",
  "EPAFacilityID": "100000191865",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "C-4305",
  "SafetyInspectionDate": "2018-05-17 00:00:00",
  "SafetyInspectionBy": "Fresno County CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000109884,
      "AltID": "Ammonia System",
      "FacilityID": 1000088253,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111181,
          "ProcessID": 1000109884,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137226,
          "ProcessID": 1000109884,
          "ChemicalID": 57,
          "Quantity": 76357.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637226,
          "ProcessID": 1000109884,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088253,
      "SummaryText": "Executive Summary\n\n\n\nIntroduction\n\nMalaga Power, LLC (Malaga Power) is located at 2611 E. North Street in Fresno, California. The facility stores and uses aqueous ammonia (29.4-percent aqueous ammonia solution) with Selective Catalytic Reduction (SCR) technology to control nitrogen oxide (NOx) emissions. A Risk Management Plan (RMP) is required due to the presence of 29.4-percent aqueous ammonia at the site. Malaga Power stores approximately 10,200 gallons of 29.4-percent aqueous ammonia in a 12,000-gallon storage tank.\n\n \n\nUsing and storing aqueous ammonia can be a hazard if it is not handled properly. Malaga Power personnel take their safety obligations very seriously and ensure that operators involved in the use of aqueous ammonia are trained and knowledgeable in the chemical hazards associated with their jobs. The following RMP describes what could happen if there were to be an accident, some of the steps taken to ensure a safely operating power plant, and how chemical emergencies are handled. This RMP complies with the US EPA Risk Management Plan regulations in 40 CFR 68 and California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Malaga Power accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices. Applicable procedures of the State of California are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\n\n\nMalaga Power management recognizes the responsibility to make the environment, community, and employee safety a primary part of daily concerns. Malaga Power is committed to being a responsible member within the community by giving top priority to operating in a safe and environmentally sound manner. Malaga Power is dedica"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088253,
      "SummaryText": "ted to developing an environmentally responsible energy resource compatible with community needs. The prevention of accidents and protection of its employees, property and the general public are essential to the efficient and successful completion of every project undertaken by Malaga Power.\n\n\n\nIt is the policy of Malaga Power that every employee is entitled to a safe and healthful place in which to work and live. As part of Malaga Power's obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and efficiently utilize those resources, Malaga Power will:\n\n?    Comply fully with laws regulating environmental protection and employee health and safety.\n\n?    Furnish workplaces free of recognized hazards likely to cause injury to employees, the public, or the environment.\n\n?    Train employees in safe and environmentally conscious practices and require compliance with environmental, health, and safety regulations, policies, and procedures.\n\n?    Provide a professional staff to maintain and support environmental, health, and safety programs.\n\n\n\nGeneral Facility and Regulated Substances Information\n\nMalaga Power has a nominal 97-megawatt, natural gas-fired, simple-cycle peaking power plant in Fresno County, California. The Facility is located on approximately 19 acres south of the City of Fresno near the community of Malaga. The facility consists of two General Electric LM6000 natural gas-fired combustion turbine generators (CTGs).  The facility is manned 24 hours a day, seven days a week.  The North American Industrial Classification System (NAISC) number for the Facility is 221112, Fossil Fuel Electric Power Generation.\n\n  \n\nThe facility is subject to CalARP because the amount of ammonia stored on site (12,000 gallons of 29.4 percent ammonia, or approximately 22,449 pounds as ammonia) exceeds the CalARP threshold quantity (TQ) of 500 pounds.  The facility is also subject to the federal Chemical Accident Prevention Provisions of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088253,
      "SummaryText": " Code of Federal Regulations (CFR) Title 40 Part 68 because the concentration of ammonia in aqueous solution is greater than 20 percent and exceeds the aqueous ammonia RMP TQ of 20,000 pounds.  Malaga Power has prepared this RMP to satisfy CalARP and federal RMP requirements for the aqueous ammonia process at the facility. The aqueous ammonia process at Malaga Power qualifies for Program Level 2.\n\n\n\nAqueous ammonia is used at Malaga Power in an SCR system to control emissions of NOx from natural gas combustion. Aqueous ammonia is vaporized and injected into the exhaust gas stream from the CTGs and then passed through a catalyst bed. In the presence of the catalyst, the ammonia and NOx react to form nitrogen and water vapor, thereby reducing NOx emissions.\n\n\n\nSummary of the Five-Year Accident History\n\nMalaga Power has had no accidents involving aqueous ammonia that have resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nSummary of the Emergency Response Program\n\nMalaga Power has developed an Emergency Action Plan, which establishes emergency response procedures designed to protect personnel, limit damage to the environment, and ensure that proper notifications are made to the appropriate government agencies. The Emergency Action Plan includes information such as response procedures, alarms, and regulatory notification requirements. The Emergency Action Plan also identifies emergency assembly areas, evacuation routes, and related procedures to be undertaken during emergency scenarios. \n\n\n\nIn the event of an aqueous ammonia release, the highest-ranking Malaga Power operations employee onsite will assess whether the release is controllable or uncontrollable. If the release is controllable, trained Malaga Power personnel will perform the tasks necessary to accomplish containment and mitigation of the release. If the release is uncontrollable"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000088253,
      "SummaryText": ", the highest-ranking Malaga Power operations employee onsite will notify the Fresno Fire Department Authority (FFD). The FFD will handle spill/release response and mitigation. \n\n\n\nThe Emergency Action Plan is coordinated (reviewed) by the Fresno County Department of Environmental Health Hazardous Materials Division (DEH HMD), which is a member of the Local Emergency Planning Committee. Malaga Power works closely with the FFD to coordinate response actions by submitting the Hazardous Materials Business Plan to the HMD and inviting FFD staff to tour and inspect Malaga Power and the aqueous ammonia system. Additionally, employees are trained on the Emergency Action Plan when initially hired, and all employees receive annual refresher training on emergency response.\n\n\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nThe prevention program for the aqueous ammonia process is briefly summarized below.  \n\n?    Safety Information.  Malaga Power compiles and maintains up-to-date safety information related to the regulated substances, processes, and equipment. \n\n?    Hazard Review.   Malaga Power conducts hazard reviews to improve safety and reduce the consequences of accidental releases of aqueous ammonia. A hazard review was most recently conducted in June 2020.\n\n?    Operating Procedures.  Malaga Power maintains written operating procedures and checklist that provide clear instructions for the aqueous ammonia process. \n\n?    Training.  Employees are trained on aqueous ammonia operating or maintenance procedures, safety and health hazards, and safe work practices before they can operate or maintain the covered process. \n\n?    Maintenance.  Malaga Power implements the maintenance program to ensure the continued integrity of the equipment in the aqueous ammonia process. An effective maintenance program addresses equipment testing \n\n        and inspection, preventative maintenance schedules, personnel training, and correction of equipment deficie"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000088253,
      "SummaryText": "ncies. \n\n?    Compliance Audits.   Compliance audits are completed and documented for the covered process at least once every three years.  The compliance audits evaluate the prevention program elements and their \n\n        implementation for compliance with the CalARP and EPA regulations. \n\n?    Incident Investigation.  Following an incident that resulted in or could have reasonably resulted in a release of aqueous ammonia, Malaga Power staff will initiate incident investigation procedures and \n\n        ensuring that any resulting corrective actions are addressed and documented. There have been no incident investigations since the facility has been in operation.\n\n\n\nPlanned Changes to Improve Safety \n\nMalaga Power conducted aqueous ammonia hazard review in June 2020 to assess the safety of the process and identify causes of potential aqueous ammonia releases. The hazard review team developed a list of risk reduction measures to improve safety at Malaga Power. Recommendations from the hazard review include reviewing operating procedures, conducting a seismic assessment and conducting an inventory of personnel protective equipment supplies.  \n\n  \n\n"
    }
  ]
}