{
  "FacilityID": 1000105806,
  "FacilityName": "Texon Barstow Station",
  "FacilityStr1": "864 FM 516 S",
  "FacilityStr2": "Lakeview Drive",
  "FacilityCity": "Barstow",
  "FacilityState": "TX",
  "FacilityZipCode": "79719",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48475",
  "LEPC": "Ward County LEPC",
  "FacilityLatDecDegs": "31.442866",
  "FacilityLongDecDegs": "-103.375060",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Texon Distributing, L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Texon Distributing, L.P.",
  "OperatorStr1": "11757 Katy Freeway, Suite 1400",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77079",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000251363",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-05-25 00:00:00",
  "SafetyInspectionBy": "Texas Railroad Commission and Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132129,
      "AltID": "Butane Injection System",
      "FacilityID": 1000105806,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165571,
          "ProcessID": 1000132129,
          "ChemicalID": 118,
          "Quantity": 245721.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133562,
          "ProcessID": 1000132129,
          "NAICSCode": "21112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000080852,
              "Process_NAICS_ID": 1000133562,
              "SafetyReviewDate": "2023-05-23 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2023-04-27 00:00:00",
              "ChangeCompletionDate": "2023-06-12 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-06-13 00:00:00",
              "TrainingReviewDate": "2023-06-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-06-13 00:00:00",
              "EquipmentInspectionDate": "2023-06-12 00:00:00",
              "EquipmentTested": "Butane storage tank, piping, pumps, injection skid",
              "ComplianceAuditDate": "2023-05-25 00:00:00",
              "AuditCompletionDate": "2023-06-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000081680,
                  "PreventionProgram2ID": 1000080852,
                  "ProcessChemicalID": 1000165571
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105806,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-06-13 00:00:00",
    "ERTrainingDate": "2023-06-13 00:00:00",
    "CoordinatingAgencyName": "Reeves County Emergency Response",
    "CoordinatingAgencyPhone": "4329431966",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105806,
      "SummaryText": "Texon Distributing, L.P. (Texon) owns and operates the Texon Barstow Station (facility), a butane storage and injection facility, located approximately 1.75 miles southeast of Barstow, Texas.  The incoming butane liquids are stored in a pressurized tank and are injected into a private pipeline for sales.  Based on criteria outlined in the Accidental Release Prevention (ARP) Program, the butane injection system is not subject to the requirements of OSHA\u0092s Process Safety Management (PSM) Standard under 29 CFR 1910.119.  However, Texon has implemented certain key elements of the PSM program in order to manage and mitigate risk at the facility.  Further, the facility is subject to US EPA\u0092s Risk Management Program (RMP) and accordingly has developed and implemented the RMP. \n\nStorage of Hazardous Material and Potential Exposure:\nThe regulated flammable substance identified at the facility is Butane. For the purpose of identifying the maximum release quantity for use in determining potential off-site impacts, it is assumed that the entire contents of the system are released to the atmosphere, presenting a worst-case scenario (WCS) of release through vapor cloud explosion.\n\nFive-Year Accident Facility:\nThe Texon Barstow Station is a new facility; therefore, this facility has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40 CFR 68.42.\n\nEmergency Response Planning:\nThe Texon Barstow Station will coordinate the emergency response activities with the Reeves County Emergency Services, the Ward County Sheriff\u0092 office and other agencies as appropriate.  The emergency response plan developed for the facility includes information regarding adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public and decontamination of the affected area after the incident has occurred.\n\nGeneral Accidental Release Prevention Program:\nThe Texon Barstow Station is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105806,
      "SummaryText": "subject to EPA's RMP regulations; therefore, this summary addresses each of the required elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation:\nAll line level of employees and contract employees are encouraged to participate in making a safe work environment.  Employees are asked to provide opinions concerning accident prevention issues and to recommend improvements.   Employees are expected to maintain rule compliance based on their knowledge, experience and job responsibilities.\n\nProcess Safety Information:\nThe Texon Barstow Station maintains a detailed record of information for identifying and understanding the chemical hazards, operating parameters and equipment designs associated with the facility processes.\n\nProcess Hazard Analysis (PHA):\nTexon conducts comprehensive studies to help ensure that hazards associated with various processes are identified and controlled efficiently.  These studies are completed by a team of qualified personnel with expertise in engineering and process operations.  To help ensure that the process controls and/or process hazards do not eventually deviated from the original designed safety features, the handling facility updates and revalidates the hazard analysis at least every five years.\n\nOperating Procedures:\nThe Texon Barstow Station maintains written procedures that identify various modes of process operation, such as initial startup, normal/temporary operations, emergency/normal shutdown, and startup following a turnaround or emergency shutdown.  Operating procedures are frequently reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary.\n\nTraining:\nTexon has a comprehensive training program in place to ensure that employees are competent in the operating procedures associated with the facility.\n\nHot Work Permit:\nThe Texon Barstow Station issues hot work permits for all how work operations and provided a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105806,
      "SummaryText": "ll employees with hot work permit training.\n\nContractors:\nOn occasion, contractors are hired to conduct specialized maintenance and construction activities. The Barstow Station has procedures in place to ensure that contractors are trained in the work practices of the facility, follow the safety rules of the facility, advise the facility employees of any unique hazards presented by the contractor and notify the facility of all illnesses and injuries that occur in process areas.\n\nPre-Startup Safety Reviews (PSSRs):\nThe facility conducts a PSSR for facility modifications that require a change in the process safety information.  The PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  A standard checklist is used to document compliance.\n\nMechanical Integrity:\nDocumented maintenance checks on all equipment are completed at the facility to ensure proper operations.  Equipment examples include pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps, valves and temperature and pressure switches.   Maintenance operations are completed by qualified personnel with training in maintenance practices.  Maintenance personnel receive training on the process, process hazards and procedures applicable to the employee's job tasks.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\nThe Texon Barstow Station has written procedures in place to manage and document changes to all covered processes.  To control and manage facility changes, a systematic approach is followed to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment or the environment.  Any employees, process operators or maintenance personnel whose job tasks are affected by a modification in process conditions are promptly made aware"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105806,
      "SummaryText": "of and offered training to deal with the modification.\n\nIncident Investigation:\nTexon promptly investigates all incidents that result in, or could reasonably result in, a catastrophic release of a regulated substance.   The investigation is led by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  These investigations are completed to identify the situation leading to the incident, as well as corrective actions that could prevent the release from reoccurring.  The findings of the investigation are documented and the results are reviewed by all employees who have the potential to be affected by the findings.\n\nEmergency Planning and Response:\nThe facility keeps a written emergency response plan onsite which includes the designated actions the company and all employees will take to ensure personal safety from fire and other emergencies.   The plan outlines actions that employees are to take when there is a release and facilitates the prompt evacuation of employees when necessary.\n\nCompliance Audits:\nTexon will conduct audits to determine whether the procedures and practices required by the accident prevention program are being properly implemented. The audit team will include individuals knowledgeable in the process, operations personnel and at least one employee with training in audit techniques and practices.   These audits will be completed at least every three years and any required corrective action will be completed in a safe and prompt manner.\n\nChanges to Improve Safety:\nTexon is committed to operating the Texon Barstow Station in a safe manner for employees, the public and the environment.  The facility will conduct compliance audits and hazard reviews as required and will make improvements to safety based on the findings from the audits and reviews."
    }
  ]
}