{
  "FacilityID": 1000008546,
  "FacilityName": "Anheuser-Busch Inc. - Fairfield Brewery",
  "FacilityStr1": "3101 Busch Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fairfield",
  "FacilityState": "CA",
  "FacilityZipCode": "94534",
  "Facility4DigitZipExt": "9726",
  "FacilityCountyFIPS": "06095",
  "LEPC": "Solano County Envrnmtal Mngmt",
  "FacilityLatDecDegs": "38.237785",
  "FacilityLongDecDegs": "-122.094610",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.anheuser-busch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6288799,
  "ParentCompanyName": "Anheuser-Busch Companies",
  "Company2Name": null,
  "CompanyDUNS": 98630254,
  "Company2DUNS": 98630254,
  "OperatorName": "Anheuser-Busch Inc.",
  "OperatorStr1": "P.O. Box AB",
  "OperatorStr2": null,
  "OperatorCity": "Fairfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94534",
  "OperatorZipCodeExt": null,
  "FTE": 311,
  "OtherEPAFacilityID": "94533NHSRB3101B",
  "EPAFacilityID": "100000052426",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A0606",
  "SafetyInspectionDate": "2008-12-15 00:00:00",
  "SafetyInspectionBy": "Solano County Env. Mgmt.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-12-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.23864,
  "FRS_Long": -122.08446,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009851,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000008546,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011207,
          "ProcessID": 1000009851,
          "ChemicalID": 56,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000010173,
          "ProcessID": 1000009851,
          "NAICSCode": "31212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000008084,
              "Process_NAICS_ID": 1000010173,
              "SafetyReviewDate": "2008-12-15 00:00:00",
              "PHA_Date": "2007-08-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-19 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-11-18 00:00:00",
              "TrainingReviewDate": "2008-12-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-12-15 00:00:00",
              "EquipmentInspectionDate": "2009-05-26 00:00:00",
              "EquipmentTested": "PRV",
              "ChangeMgmtDate": "2008-07-30 00:00:00",
              "ChangeMgmtReviewDate": "2008-12-15 00:00:00",
              "PreStartupReviewDate": "2008-11-12 00:00:00",
              "ComplianceAuditDate": "2007-06-28 00:00:00",
              "AuditCompletionDate": "2007-08-30 00:00:00",
              "IncidentInvestigationDate": "2009-03-13 00:00:00",
              "InvestigationChangeDate": "2009-04-28 00:00:00",
              "ParticipationPlansReviewDate": "2008-12-15 00:00:00",
              "HotWorkPermitReviewDate": "2008-12-15 00:00:00",
              "ContractorSafetyReviewDate": "2008-12-15 00:00:00",
              "ContractorSafetyEvalDate": "2008-12-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anheuser-Busch has implemented a comprehensive program to prevent accidental releases.  Designed to reduce both the likelihood and severity of releases of ammonia, this program integrates technology, procedures, and management practices.  This prevention program ensures the safe design principles and practices are followed for the brewery ammonia system and related projects by properly managing change to the system, as well as ensuring proper operation, maintenance and control of hazards.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000009278,
                  "PreventionProgram3ID": 1000008084,
                  "ProcessChemicalID": 1000011207
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000008546,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-12-15 00:00:00",
    "ERTrainingDate": "2009-01-01 00:00:00",
    "CoordinatingAgencyName": "Solano County Dept. of Envir. Mgt.",
    "CoordinatingAgencyPhone": "7074216765",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008546,
      "SummaryText": "Risk Reduction Policies\n \nThe management of the Anheuser-Busch brewery in Fairfield, CA, recognizes and shares the community's interest in safe operation of our facility.  We have completed this report under the U.S. Environmental Protection AgencyA?s (EPA) risk management program (RMP) to communicate our efforts to achieve a safe workplace.  \n\nThe brewery uses ammonia as a key part of the cooling system that maintains beer at the proper temperature during certain stages of the brewing process.  Ammonia is one of the materials covered under the U.S. Occupational Safety and Health Administration's Process Safety Management standard (PSM) and U.S. Environmental Protection Agency's Risk Management Program regulations.  The brewery follows these regulations, as well as others, to ensure that it safely handles, uses, and stores ammonia and other potentially hazardous chemicals safely.  The brewery has had no releases of ammonia that resulted in injuries to people, harm to property, or damage to the environment since it opened in 1976.\n\nOur corporate environmental, health, and safety (EHS) policy and requirements promote the overall safety of this brewery, employees, and the public.  This policy includes risk reduction programs that provide assurance for the safe management of process risks to prevent environmental, health and safety incidents and to protect the workplace, the community and the environment. These programs enable the brewery to prevent the occurrence, or minimize the consequences of, significant releases of ammonia.  \n \nIt is Anheuser-Busch's policy to conduct our business in accordance with all applicable laws, regulations, and permits and to promote a safe workplace and a quality environment.  Each employee is trained and required to comply strictly with this policy.  We do not allow production goals or financial objectives to over-ride safety and environmental concerns.  \n \nAlso, it is Anheuser-Busch's policy to lead by example so that other companies, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008546,
      "SummaryText": "including vendors and suppliers, are similarly interested in protecting the health and safety of employees and safeguarding the environment.  We are committed to the spirit as well as the letter of our EHS policy and promote, throughout the organization, responsibility and accountability for strict compliance with that policy.  Anheuser-Busch employees whose actions in the performance of their duties may affect the environment and/or public health are trained sufficiently to permit them to comply strictly with our EHS policy. \n\nIn conducting our businesses, we continue to seek and implement cost effective methods to reduce the EHS impact of our operations.  We integrate EHS considerations into our business planning and decision-making processes, including product research and development, packaging, and new manufacturing methods.  Our continuous EHS improvement goals include pollution prevention and resource conservation.  We ask our contractors to adopt EHS standards, ethics, and policies similar to our own and we will give preference to suppliers that do so.\n \nWe encourage our employees, customers, and the public to share with us their EHS concerns.  We continually talk with local authorities in communities in which we operate to share ideas about preventing incidents with materials we use or store.\n \nAmmonia System\n \nAmmonia is used in the refrigeration system of the brewery.  As part of the brewing process, the beer is cooled to ensure its consistency, flavor and overall quality.  The beer packaged in kegs also is stored in a refrigerated area in our facility until it's shipped.  Because of the characteristics of ammonia, our employees observe certain safety precautions to prevent unnecessary human and environmental exposure, both within the brewery and in the surrounding community.\n  \nAccidental Release Prevention Program\n \nAnheuser-Busch has years of experience operating ammonia-based refrigeration systems at its breweries.  This experience has helped bring ab"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008546,
      "SummaryText": "out designs and operating plans that produce a safe system.  No ammonia releases from any of the companyA?s breweries have ever resulted in consequences off brewery property.  The following elements have produced this safe operating record:\n\nProcess hazard analysis and review, including corrective action follow-up requirements:\nStandard operating procedures that all operators of the refrigeration system must follow;\nFormal operator training (40 hours minimum);\nPreventative maintenance to ensure that the entire refrigeration system is mechanically sound;\nProcedures to ensure that changes to the refrigeration system are managed so ammonia flow remains safe;\nSafety review prior to the startup of new or modified equipment;\nAudits of the PSM and RMP programs;\nIncident investigations to ensure that lessons are learned to prevent future incidents;\nEmployee involvement in risk reduction programs;\nContractor safety procedures are reviewed to ensure outside workers exercise the same safety consciousness as brewery employees;\nA work permit system that ensures all welding work is conducted safely.\n\nProcess safety information and Emergency planning and response.\n \nThe brewery additionally complies with the requirements of the OSHA PSM standard (40 CFR 1910.119), the EPA RMP rules (40 CFR 68), and the ANSI/IIAR 2-1992 standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.\n \nFive-Year Accident History\n  \nThe brewery has had no releases that have caused on-site or off-site injuries, or damage to property or the environment.  In fact, the brewery has never had releases with these impacts since it began operation in 1976.\n \nEmergency Response Program\n \nThe Fairfield brewery has in place a variety of emergency response procedures in the event of an incident involving ammonia.  The emergency response program is based on OSHA's requirements for emergency action plans (29 CFR 1910.38) and HAZWOPER (29 CFR 1910.120).  We have trained employees for em"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008546,
      "SummaryText": "ergency response and maintain a \"Environmental Incident and Community Response Plan (EICRP)  which will be supplied to, and discussed with, Solano County OES, Solano County Environmental Management Department, and the City of Fairfield Fire Department.  We will conduct annual drills with local agencies to help us remain prepared to implement the EICRP at the brewery. \n \nBrewery personnel notify local agencies when emergency response is needed.  Local agencies determine if the public needs to be notified.  If it is determined that the public needs to be notified, the local agencies perform the notification task.\n \nPlanned Changes to Improve Safety\n \nAnheuser-Busch's Fairfield brewery ammonia refrigeration system is periodically modified to improve safety.  In the late 1990's, the ammonia refrigeration pressure relief valves were all inspected and upgraded, where necessary.  \n\nConclusion\n\nAnheuser-Busch is pleased to share its record of safe operations with the citizens of Fairfield.  We believe the Risk Management Plan under which we are providing this information is an important tool for encouraging communications with our neighbors.  Although we are confident the worst case and alternative scenarios presented in this report are highly unlikely, we want youA?our neighbors to know we are prepared to respond quickly and effectively should one ever occur.  Anheuser-Busch has worked hard over the years to ensure the highest standard of safety.  Our goal is to continue the excellent and safe track record."
    }
  ]
}