{
  "FacilityID": 1000033302,
  "FacilityName": "Shoup Gas Processing and Fractionation Plant",
  "FacilityStr1": "802 McKinzie Road",
  "FacilityStr2": null,
  "FacilityCity": "Corpus Christi",
  "FacilityState": "TX",
  "FacilityZipCode": "78410",
  "Facility4DigitZipExt": "9705",
  "FacilityCountyFIPS": "48355",
  "LEPC": "Nueces County LEPC",
  "FacilityLatDecDegs": "27.799706",
  "FacilityLongDecDegs": "-097.565569",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise GC. LP",
  "Company2Name": "Enterprise Hydrocarbons, LP",
  "CompanyDUNS": 946306834,
  "Company2DUNS": 946306834,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089281",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-3321",
  "SafetyInspectionDate": "2010-11-29 00:00:00",
  "SafetyInspectionBy": "ABS Consulting",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Enterprise 2007 Re-submission",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-03-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-03-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-03-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 27.79722,
  "FRS_Long": -97.56361,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040653,
      "AltID": "NGL Production",
      "FacilityID": 1000033302,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048891,
          "ProcessID": 1000040653,
          "ChemicalID": 155,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000041609,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000041610,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000041611,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000041612,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000041613,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000041614,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000041615,
              "ProcessChemicalID": 1000048891,
              "ChemicalID": 115
            }
          ]
        },
        {
          "ProcessChemicalID": 1000048892,
          "ProcessID": 1000040653,
          "ChemicalID": 155,
          "Quantity": 85000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000041616,
              "ProcessChemicalID": 1000048892,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000041617,
              "ProcessChemicalID": 1000048892,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000041618,
              "ProcessChemicalID": 1000048892,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000041619,
              "ProcessChemicalID": 1000048892,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000041620,
              "ProcessChemicalID": 1000048892,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000041621,
              "ProcessChemicalID": 1000048892,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041074,
          "ProcessID": 1000040653,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000040654,
      "AltID": "NGL Product Fractionation",
      "FacilityID": 1000033302,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048893,
          "ProcessID": 1000040654,
          "ChemicalID": 155,
          "Quantity": 76000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000041622,
              "ProcessChemicalID": 1000048893,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000041623,
              "ProcessChemicalID": 1000048893,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000041624,
              "ProcessChemicalID": 1000048893,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 1000048894,
          "ProcessID": 1000040654,
          "ChemicalID": 155,
          "Quantity": 77000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000041625,
              "ProcessChemicalID": 1000048894,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000041626,
              "ProcessChemicalID": 1000048894,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000041627,
              "ProcessChemicalID": 1000048894,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000041628,
              "ProcessChemicalID": 1000048894,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000041629,
              "ProcessChemicalID": 1000048894,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000041630,
              "ProcessChemicalID": 1000048894,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 1000048895,
          "ProcessID": 1000040654,
          "ChemicalID": 155,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000041631,
              "ProcessChemicalID": 1000048895,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000041632,
              "ProcessChemicalID": 1000048895,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 1000048896,
          "ProcessID": 1000040654,
          "ChemicalID": 155,
          "Quantity": 1600000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000041633,
              "ProcessChemicalID": 1000048896,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000041634,
              "ProcessChemicalID": 1000048896,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000041635,
              "ProcessChemicalID": 1000048896,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000041636,
              "ProcessChemicalID": 1000048896,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041075,
          "ProcessID": 1000040654,
          "NAICSCode": "324199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033302,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Corpus Christi Fire Department",
    "CoordinatingAgencyPhone": "3618263900",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033302,
      "SummaryText": "Shoup Fractionation and Cryogenic Gas Plant\n\nEnterprise Products Operating LLC\n\nExecutive Summary\n\nRisk Management Plan\n\nEPA Identifier:  1000 0008 9281\n\n\n\n\n\nAccidental Release Prevention and Response\n\n\n\nThe Shoup Fractionation and Cryogenic Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facility's processes.  It is the practice of Enterprise Products Operating LLC. (Enterprise) to implement reasonable controls to prevent foreseeable releases of substances.  However, if a release does occur, trained personnel will respond to, control and contain the release.\n\n\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nThe Shoup Fractionation and Cryogenic Gas Plant located in Nueces County, Texas is owned by Enterprise Gas Processing L.L.C. and is operated by Enterprise.\n\n\n\nThe Shoup Plant is a combined processing complex comprised of a cryogenic natural gas liquid recovery plant and natural gas liquids fractionation equipment.  The natural gas liquid recovery plant is designed to utilize the cryogenic turbo expander process to recover natural gas liquids from the inlet gas, and is assembled primarily from prefabricated, skid-mounted process components.     Produced natural gas is delivered to the facility from a gas gathering system and inlet gas pipeline.  The plant processes the gas utilizing a cryogenic turbo expander to remove recoverable natural gas liquids from the inlet gas.  The plant also receives additional recovered natural gas liquids from other gas processing plants in South Texas via several inlet hydrocarbon liquid pipelines.  The mixed hydrocarbon liquid streams produced at or delivered to the Shoup facility are fractionated into individual, purified ethane, propane, butane and pentane-plus natural gas liquid streams.  Finishe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033302,
      "SummaryText": "d products are residual natural gas from the cryogenic plant and fractionated hydrocarbon liquids which are removed from the plant by pipeline systems and, in the case of the propane, butane and pentane-plus liquids, also by tractor trailer trucks.\n\n\n\nThe Shoup Plant was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities kept on site based on process knowledge.  Listed flammable substances which are stored above the threshold quantities at the Shoup Plant are natural gas (methane), ethane, propane, iso-butane, normal butane, iso-pentane and pentane.  The Plant is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standard and is classified as a Program Level 3 site under the EPA RMP program.\n\n\n\n\n\nOffsite Consequence Analysis Results\n\n\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\n\n\n\n\n\nGeneral Accident Release Prevention Program\n\n\n\nThe following is a summary of the accident prevention program in place at the Shoup Fractionation and Process Plant.  The processes at the plant are regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation, and are also subject to the OSHA PSM standard.  This summary addresses each of the PSM program elements and describes the management system in place to implement the accident prevention program.\n\n\n\nEmployee Participation\n\n\n\nEnterprise strongly promotes employee involvement in safety issues through existing programs.  These programs include regularly scheduled safety meeting, tail-gate safety meetings, hazard communications, a \"near-miss\" reporting system and special training programs such as emergency response training, first aid training, etc.\n\n\n\nEnterprise activ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033302,
      "SummaryText": "ely seeks employee involvement in the development and conduct of all accident prevention activities through the appropriate existing safety programs.  Employees are encouraged to discuss accident prevention with their supervisors and to bring any questions, comments or suggestions forward for open discussion.\n\n\n\nProcess Safety Information\n\n\n\nEnterprise keeps a variety of technical documents that are used to help maintain a safe operating process.  These documents address chemical properties and associated hazards, limits for key process parameters, specific chemicals inventories and equipment design basis/configuration information.  Chemical specific information, including exposure hazards and emergency response/ exposure treatment considerations is provided in material safety data sheets (MSDS).\n\n\n\nEnterprise also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure ratings, temperature ratings and electrical rating of equipment.  \n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\nEnterprise primarily uses the hazard and operability (HAZOP) and What-if/Checklist method analysis technique to perform these evaluations.  The analyses are conducted using a team of Enterprise staff which has operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes recommendations for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\n\n\nThe PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps insure that potential accident scenarios assigned the highest risk receive immediate attention.  All approv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033302,
      "SummaryText": "ed mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each finding is documented and retained.  \n\n\n\nAs part of Enterprise Process Hazard Analysis program, the plant periodically updates and revalidates the hazard analysis results.  \n\n\n\nOperating Procedures\n\n\n\nThe Shoup Fractionation and Process Plant maintains written procedures that address various modes of process operations such as; (1) start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown and (6) initial startup of a new process.  These procedures provide guidance for experienced operators and also provide the basis for training new operators.  Operating procedures include applicable safety precautions that must be taken in the operation of the facility.  The procedures are periodically reviewed and annually certified as current and accurate.  The review and certification process involves both operators and technical staff.\n\n\n\nTraining\n\n\n\nIn addition to training on operating procedures, the Shoup Fractionation and Process Plant has a comprehensive training program for all employees involved in operating the process.  New employees receive basic training in pipeline, storage, propane dehydration and terminal operations.  In addition, all operators receive refresher training on the operating procedures at least every three years to insure that their skills and knowledge are maintained at an acceptable level.  \n\n\n\nContractors\n\n\n\nThe Shoup Fractionation and Process Plant uses contractors during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the plant has procedures in place to insure that contractors (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specif"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033302,
      "SummaryText": "ic safety rules and (6) inform plant personnel of any hazards that they find while performing their work.  This is accomplished by providing contractors with an orientation session that covers (1) a process overview, (2) information about the safety and health hazards, (3) emergency response plan requirements and (4) safe work practices prior to beginning their work.  In addition, Enterprise evaluates contractor safety programs and performance during the contractor selection process.  Enterprise personnel periodically monitor contractor performance to insure that contractors are fulfilling their safety obligations.\n\n\n\nPre-Startup Safety Review (PSSR)\n\n\n\nThe Shoup Fractionation and Process Plant conducts a PSSR prior to the startup of all new facilities or any modification that requires a change in process safety information.  The purpose of the PSSR is to insure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  \n\n\n\nMechanical Integrity\n\n\n\nThe Shoup Fractionation and Process Plant has well established practices and procedures for maintaining process equipment.  The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies, when identified and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\n\n\nSafe Work Practices\n\n\n\nThe Shoup Fractionation and Process Plant has safe work practices in place to help insure worker and process safety.  Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to insure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000033302,
      "SummaryText": "activities (i.e. hot work) and (5) a permit and procedure to insure that adequate precautions are in place before entry into a confined space.  These procedures, along with training of affected personnel, form a system to help insure that operations and maintenance activities are performed safely\n\n\n\nManagement of Change\n\n\n\nThe Shoup Fractionation and Process Plant uses Enterprise software-based change approval system to manage change to all covered processes.  This system requires that changes to items such as process equipment, technology, procedures and other facility changes be properly reviewed and authorized before being implemented to insure that the safety of the facility is not compromised by the change.  Operating and maintenance personnel are provided any necessary training on any changes as part of the change management process.\n\n\n\nIncident Investigation\n\n\n\nThe Shoup Fractionation and Process Plant promptly investigates all incidents that resulted in or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The investigation team documents its findings, develops recommendation(s) to prevent a reoccurrence and forwards these results to the business management team for resolution.\n\n\n\nCompliance Audits\n\n\n\nTo help insure that the accident prevention program is functioning properly, Enterprise periodically conducts an audit of the program to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every three years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to operations or facility management for resolution.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\n\n\nChemical Specific Prevention Steps\n\n\n\nThe processes at the Shoup Fractionation and Process"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000033302,
      "SummaryText": " Plant have hazards that must be managed to insure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\n\n\nUniversal Prevention Activities\n\n\n\nThe accident prevention program summarized previously is applied to all RMP covered processes at the Shoup Fractionation and Process Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\n\nSpecialized Safety Features\n\n\n\nThe Shoup Fractionation and Process Plant has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\n \n\n\n\nRelease Detection\n\n\n\n* Hydrocarbon (hazardous gas) detectors and alarms\n\n* Fire detectors inside plant compressor buildings.\n\n\n\nRelease Containment and Control\n\n\n\n* Process relief valves that discharge to a flare to capture and incinerate episodic releases.\n\n* Valves to permit isolation of the process (manual or automated).\n\n* Automatic shutdown systems for specific process parameters (e.g., high temperature).\n\n* Curbs or dikes to contain liquid releases.\n\n* Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system) \n\n* Atmospheric relief devices.\n\n\n\nRelease Mitigation\n\n\n\n* Hand-held fire extinguishers \n\n* Personnel trained in emergency response and procedures.\n\n* Personnel protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus, etc.)\n\n\n\nFive Year Accident History\n\n\n\nOver the past five years there have been no large or small releases which resulted in any injuries, property damage or offsite consequences.  \n\n\n\nEmergency Procedures Information\n\n\n\nThe Shoup Plant maintains a written emergency procedure, which is in place to protect worker and public "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000033302,
      "SummaryText": "safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \n\n\n\nThe overall emergency procedure program for the Shoup Plant is coordinated with the Nueces County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives.  The Shoup Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Shoup Plant conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the Shoup Plant provides periodic refresher training to local emergency responders regarding the hazards of regulated substances in the plant.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Shoup Plant resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Shoup Fractionation and Process Plant.  \n\n\n\n* Enterprise is currently in the process of reviewing and revising the entire safety management / accident prevention program to ensure that the program can be fully administered across the diverse nature of the facilities owned or operated by the company."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000033302,
      "SummaryText": "  All elements of the revised program are expected to be implemented at Shoup Plant within the next year. \n\n"
    }
  ]
}