{
  "FacilityID": 1000030618,
  "FacilityName": "Washington, Indiana CO2 Plant",
  "FacilityStr1": "1285 S. 300 W",
  "FacilityStr2": null,
  "FacilityCity": "Washington",
  "FacilityState": "IN",
  "FacilityZipCode": "47501",
  "Facility4DigitZipExt": "9633",
  "FacilityCountyFIPS": "18027",
  "LEPC": "Daviess County LEPC",
  "FacilityLatDecDegs": "38.638611",
  "FacilityLongDecDegs": "-087.222500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.mathesongas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Matheson Tri-Gas, Inc",
  "Company2Name": null,
  "CompanyDUNS": 179092028,
  "Company2DUNS": null,
  "OperatorName": "Matheson Tri-Gas, Inc",
  "OperatorStr1": "150 Allen Road",
  "OperatorStr2": null,
  "OperatorCity": "Basking Ridge",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07920",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": "INR000105502",
  "EPAFacilityID": "100000176622",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-09-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-09-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-09-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-09-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 38.638611,
  "FRS_Long": -87.2225,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000037306,
      "AltID": "ammonia refrigeration",
      "FacilityID": 1000030618,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044940,
          "ProcessID": 1000037306,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000037668,
          "ProcessID": 1000037306,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000032637,
              "Process_NAICS_ID": 1000037668,
              "SafetyReviewDate": "2016-09-23 00:00:00",
              "PHA_Date": "2016-06-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "sump",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-01 00:00:00",
              "TrainingReviewDate": "2016-03-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training (CBT)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-05-29 00:00:00",
              "EquipmentInspectionDate": "2007-04-15 00:00:00",
              "EquipmentTested": "major equipment turnaround",
              "ChangeMgmtDate": "2007-05-10 00:00:00",
              "ChangeMgmtReviewDate": "2007-05-31 00:00:00",
              "PreStartupReviewDate": "2009-02-02 00:00:00",
              "ComplianceAuditDate": "2016-09-22 00:00:00",
              "AuditCompletionDate": "2017-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-04-08 00:00:00",
              "HotWorkPermitReviewDate": "2001-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2012-08-15 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000038682,
                  "PreventionProgram3ID": 1000032637,
                  "ProcessChemicalID": 1000044940
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000030618,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-04-08 00:00:00",
    "ERTrainingDate": "2011-07-15 00:00:00",
    "CoordinatingAgencyName": "Washington Fire Department",
    "CoordinatingAgencyPhone": "8122541172",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030618,
      "SummaryText": "The Matheson Tri-Gas, Inc. CO2 plant at Washington, IN (Washington Plant) produces carbon dioxide used in the carbonation of beverages, food processing and preservation, pH control of water, fire protection and other applications. The plant was started up in 2000, anhydrous ammonia is the RMP regulated substance which is used in the process as a refrigerant to cool and liquefy CO2.   The site has 19 employees.\r\n\r\nGeneral Accidental Release Prevention Program\r\nThe Washington CO2 plant is covered by EPA RMP regulations and subject to OSHA PSM standard. The summary below discusses the management system in place to implement the accidental release prevention program.\r\n\r\nEmployee Participation\r\nAt the Washington Plant, employees are expected to participate in accidental release prevention program (PSM/RMP). Plant employees are trained on and provided access to the plant Process Safety Information.  The specific ways an employee can be involved in the accident prevention program are documented in the Employee Participation plan.  The employees participate in monthly safety meetings where process safety issues are discussed and corrective actions are developed. The employees are involved in the review of the covered process operating procedures annually to ensure they are correct and recommend any necessary changes. \r\n\r\nProcess Safety Information (PSI)\r\nThe Washington Plant keeps a variety of technical documents onsite and in the company's electronic document control system that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, equipment design/configuration information, specific chemical inventories and operation limits for key process parameters.  The PSI provides key operating limit information to the process operating procedures.  \r\n\r\nProcess Hazard Analysis\r\nMatheson Tri-Gas, Inc. has a risk management program to help ensure that hazards associated with the various processes are identified an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030618,
      "SummaryText": "d managed. The ammonia refrigeration process has undergone an initial Process Hazard Analysis (PHA) and periodic review/re-validation at least every 5 years. The PHA team consists of members with the knowledge and experience to define the hazards and mitigating controls of the process and also represents a cross section of the employees working in the process.  Local and corporate management review the PHA team findings and a resolution action plan for each item is documented, tracked and ultimately closed in tracking system.  The most recent revalidation of the Washington CO2 plant ammonia refrigeration process PHA was completed in June of 2016. \r\n\r\nOperating Procedures\r\nThe Washington CO2 Plant maintains written procedures that address various modes of ammonia refrigeration process operations, such as (1) Unit Startup, (2) Unit Normal Operation Procedures, (3) Unit Shut-Down, (4) Emergency Shutdown, and (5) Startup following an Emergency Shutdown.  These procedures are used by experienced operators and provide a basis for consistent training of new operators. These procedures are reviewed and annually certified as current and accurate.\r\n\r\nTraining\r\nThe Washington CO2 plant has implemented a training program for all employees involved in operating the CO2 Plant's ammonia refrigeration process. All employees receive training on plant orientation, site rules and practices, process safety information, normal and emergency operating procedures, health and safety consideration, use of safety procedures and equipment, incident investigation and the emergency response plan.  In addition all operators are required to attend periodic refresher training. Training is documented locally and in the Matheson electronic document system. \r\n\r\nContractors\r\nThe Washington CO2 plant uses contractors to supplement its own work force when maintenance activities exceed the capabilities or time available for their own operators. Contractors are made aware of the potential dangers involved"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030618,
      "SummaryText": "with a system covered by Process Safety Management (PSM).  Procedures have been put in place to provide that contractor owners and their employees (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, and (4) understand what they should do in the event of an emergency, prior to their beginning work. Once contractors are approved, they are periodically evaluated to insure that both their safety performance and training required for work on the Washington CO2 plant meet the safety standards of Matheson Tri-Gas, Inc.\r\n\r\nPre-startup Safety Reviews (PSSRs)\r\nThe Matheson Pre-startup Safety review (PSSRs) program is intended to re-enforce process safe through the review and confirmation of: (1) construction and equipment are in accordance with design specifications; (2) safety, operating, maintenance and emergency procedures are in place and adequate; (3) process hazard analyses (PHAs) have been performed and recommendations resolved before startup of new plants or processes; (4) management of change (MOC) requirements have been satisfied for modified facilities; and (5) training has been completed for affected employees.\r\n\r\nMechanical Integrity (MI)\r\nThe Washington CO2 plant has established a preventative maintenance program with procedure and interval frequencies for the PSM covered process equipment and associated systems to inspect, test and maintain the mechanical integrity of the ammonia refrigeration process as a whole.  The Mechanical Integrity program provides for the verification of suitability of new and/or modification of existing equipment, as well as, the quality control of spare parts.\r\n\r\nSafe and Hot Work permit system\r\nThe Washington CO2 plant has a safe and hot work permit system in place to help ensure worker and process safety. This system is comprised of a group of corporate procedures and standards under the Life Safety program.  Procedures included: (1) Energy Control"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000030618,
      "SummaryText": "(2) Safe work permit; (3) Hot work permit procedure; and (4) Confined Space Entry procedure; for the safe management of personnel and equipment prior to maintenance activities. The plant personnel are trained on these safe work practices to ensure that operations and maintenance activities are performed safely.\r\n\r\nManagement of Change\r\nThe Matheson Management of Change (MOC) procedure has established a system to ensure that proposed process changes to equipment, operating limits and/or systems are evaluated, approved, communicated and documented prior to implementation. All MOC's are submitted, approved, tracked and closed.  Personnel, whose assigned tasks safety may be affected by the MOC are briefed and trained in the requirement of the MOC prior to performing their assigned task. \r\n\r\nIncident Investigation\r\nMatheson defines through its Incident Investigation and Reporting procedures the requirements for communicating, reporting and investigating incidents at all facilities. Matheson documents the incident, the subsequent investigation, follow up action and investigation closure in its electronic document system.  The resulting findings and corrective actions are shared with employees who safety may be affected by the findings. \r\n\r\nCompliance Audits\r\nTo help insure the accident prevention program is functioning properly.  Matheson conducts audits to determine whether the procedures and practices required by the accidental release prevention program are being implemented. Compliance audits are conducted at least every 3 years.  Resolutions to the recommendations are documented, tracked and closed.\r\nChemical Specific Prevention Steps\r\nThe following are examples of the types of safety features put in place at the Washington CO2 plant to prevent accident scenarios that could be caused by (1) equipment failures and (2) human errors.\r\n\r\n¿\tAmmonia detectors located inside process equipment enclosure and in the control room are set to detect and alarm.\r\n¿\tAutomatic contr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000030618,
      "SummaryText": "ol and manual valves to provide for isolation of the ammonia refrigeration process equipment  \r\n¿\tThe placement of the ammonia process equipment and system liquid receiver within the Washington CO2 plant process equipment building allows for limited containment of an ammonia leak.\r\n¿\tEstablishment of contracted emergency response specialist to support the Washington Plant emergency response plan\r\n¿\tPersonal protective equipment (e.g., protective clothing, and Air-Line respirators)\r\n\r\nFive-Year Accident History\r\nThe Washington CO2 plant has had no accident resulting in either on or offsite effects in the last 5 years.\r\n\r\nEmergency Response Program Information\r\nThe Washington CO2 plant has developed an emergency response plan.  The plan outlines action to be taken at the plant and the communication to emergency responder, local response agencies, and outside agency notification procedures in the event of an ammonia release. The emergency plan provides for the evacuation of Washington CO2 plant personnel and visitors.  The Washington CO2 plant has provided the emergency response plan to the Washington Fire Department.  Should an emergency involving the release of ammonia occur that will have off-site consequences Matheson will contact the Washington Fire Department, who will coordinate action for the affected community. \r\n\r\nAdditional Activities Planned to Improve Safety\r\n¿\tThe Washington CO2 plant resolves all findings from PHAs, some of which result in modifications of the process.\r\n¿\tReview of ammonia relief valve per ASHRAE 15 \r\n¿\tReview and addition of outside area lighting \r\n¿\tReview and addition of ammonia header monitor for PSV venting.\r\n¿\tUpdate of alarm and troubleshooting for consequence of deviation and actions"
    }
  ]
}