{
  "FacilityID": 1000047286,
  "FacilityName": "SSI Food Service, L.L.C.",
  "FacilityStr1": "22303 Hwy. 95 North",
  "FacilityStr2": null,
  "FacilityCity": "Wilder",
  "FacilityState": "ID",
  "FacilityZipCode": "83676",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16027",
  "LEPC": "Canyon County LEPC",
  "FacilityLatDecDegs": "43.695554",
  "FacilityLongDecDegs": "-116.912848",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 121647663,
  "ParentCompanyName": "CTI Foods",
  "Company2Name": null,
  "CompanyDUNS": 808128966,
  "Company2DUNS": null,
  "OperatorName": "CTI Foods L.L.C.",
  "OperatorStr1": "22303 Highway 95 North",
  "OperatorStr2": null,
  "OperatorCity": "Wilder",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83676",
  "OperatorZipCodeExt": null,
  "FTE": 575,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059633",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-10-13 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-03-09 17:17:17",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-10-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.696145,
  "FRS_Long": -116.913795,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059016,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000047286,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072110,
          "ProcessID": 1000059016,
          "ChemicalID": 56,
          "Quantity": 83000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000060083,
          "ProcessID": 1000059016,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000049134,
              "Process_NAICS_ID": 1000060083,
              "SafetyReviewDate": "2014-06-26 00:00:00",
              "PHA_Date": "2014-10-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Facility Inspection",
              "PHACompletionDate": "2015-10-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-06-26 00:00:00",
              "TrainingReviewDate": "2014-06-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-06-26 00:00:00",
              "EquipmentInspectionDate": "2014-10-22 00:00:00",
              "EquipmentTested": "Installation of new Compressor control panels",
              "ChangeMgmtDate": "2013-07-29 00:00:00",
              "ChangeMgmtReviewDate": "2014-06-26 00:00:00",
              "PreStartupReviewDate": "2013-07-14 00:00:00",
              "ComplianceAuditDate": "2014-06-25 00:00:00",
              "AuditCompletionDate": "2015-06-25 00:00:00",
              "IncidentInvestigationDate": "2010-10-06 00:00:00",
              "InvestigationChangeDate": "2010-10-18 00:00:00",
              "ParticipationPlansReviewDate": "2014-06-26 00:00:00",
              "HotWorkPermitReviewDate": "2014-06-26 00:00:00",
              "ContractorSafetyReviewDate": "2014-01-09 00:00:00",
              "ContractorSafetyEvalDate": "2014-06-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000059795,
                  "PreventionProgram3ID": 1000049134,
                  "ProcessChemicalID": 1000072110
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047286,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-06-26 00:00:00",
    "ERTrainingDate": "2014-10-08 00:00:00",
    "CoordinatingAgencyName": "Canyon County LEPC",
    "CoordinatingAgencyPhone": "2084547531",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047286,
      "SummaryText": "s are assessed for leaks, integrity, material deformity daily;  pressure relief valves are replaced on a five year preventative maintenance schedule.  Ammonia leak detectors are located in the machinery room and at the pressure relief headers that trigger local audible and visual alarms.  Machinery room ventilation systems operate continuously and are designed for heat removal exhaust rates which exceed the emergency exhaust requirements.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nTo deal with the risks involved with ammonia refrigeration, programs have been developed to prevent the occurrence of a release and or minimize the consequences of a significant release of anhydrous ammonia, fires, explosions, and other types of catastrophic accidents.  Programs developed for the PSM/RMP plan include employee participation, process safety information, process hazard analysis, pre-startup safety review, standard operating procedures, training, management of change, mechanical integrity, hot work permit, contractor qualifications, and incident investigation.  To help coordinate the plan, a management program has been established as well as an internal audit program which will help identify compliance status and possible deficiencies in the program.  In the event of a toxic release, an emergency response plan coordinated with the local emergency planning commission (LEPC), rural fire department and trained company personnel has been written and implemented.  The ultimate goal for SSI's PSM/RMP plan is to prevent accidental fatalities, injuries / illnesses, and to avoid physical damage to the environment.  These programs enable our facility to operate a refrigeration system safely because they are based on the rules, procedures, and guidelines that govern the industry.\r\n\r\nThe SSI Food Service ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047286,
      "SummaryText": "operation of the system. The SSI Food Service facility, including the ammonia system, was designed and constructed in accordance with the Uniform Mechanical Code and ANSI/IIAR 2-1992, which specifically outline requirements for the safe operation of ammonia refrigeration systems.  Safety features include ammonia sensors in the machinery room and relief headers, continuous automated ventilation, microprocessor controlled compressor safeties, 250 psig rated storage vessels, and emergency stop controls.  The majority of the ammonia inventory is centrally located inside the machine room.  All pressure vessels are equipped with pressure relief valves (that automatically engage in case of a high pressure situation to protect the vessel's integrity) that discharge to common headers that are monitored by ammonia sensors. \r\n\r\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases (with exception of the normal automatic purging operation that removes air from the system).  Any leaks are noted and repaired immediately.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nEPA's RMP regulation defines accident as the following: \r\n\r\nThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \r\n\r\n-\tOn-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n-\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)). \r\n\r\nAn investigation into the facility's accident history during the PHA Revalidation study performed on October 22-23, 2014, revealed that there have been no releases of ammonia"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000047286,
      "SummaryText": "ing procedures, improving documentation and recordkeeping, and updating preventative maintenance policies. SSI Food Services is proceeding with the few remaining mitigation measures associated with these studies.\r\n\r\nCorporate representatives also provide guidance and assistance for the facility personnel to ensure outstanding issues are resolved and that the facility remains in compliance. In addition, the facility is planning to complete the following items over the next year in our continued effort to provide a safe work environment for employees:\r\n\r\n1. Continue to train all employees in Risk Management Program / Process Safety Management and the facility's Safety Programs.\r\n2. Continue to have employee involvement in Safety Plan development.\r\n3. Continue employee involvement through safety team participation.\r\n4. Continue internal and external safety audits / inspections and implement changes accordingly.\r\n5. Installation of a state-of-the-art refrigeration control system with remote monitoring and shutdown capabilities."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047286,
      "SummaryText": "PURPOSE:\r\n\r\nSSI Food Services L.L.C. is committed to protect the health and safety for all on site personnel, visitors, the environment, and local community.  To ensure the safe operation of our ammonia processes, SSI has complied with OSHA's Process Safety Management (PSM) Title 29 Code of Federal Regulation (CFR) 1910.119, EPA's Risk Management Program regulations (RMP) Title 40 CFR Part 68, and ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems. \r\n\r\nThe plan was designed to meet the following objectives:\r\n\r\n1) To save lives.\r\n2) To minimize and avoid injuries.\r\n3) To protect the environment.\r\n4) To minimize property damage.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nSSI Foods Service L.L.C. processes fresh meat products and uses anhydrous ammonia refrigeration systems for freeze tunnels, storage, and plant cooling.  The maximum intended inventory of ammonia at the facility is 83,000 pounds.\r\n\r\nThe accidental release prevention program in general starts with good operating and manufacturing practices.  All ammonia process equipment, piping, and valves are inspected on a regular schedule depending on manufacturer and industry recommendations.  For example; all compressors are inspected on a monthly basis for oil leaks, pressure and temperature gauge calibrations, vibration analysis, oil pressure, and amp reading for motors;  alignment of compressor motor and compressor, filter change, vibrating readings and sensor calibrations are performed every 6 months;  the condenser 24 point air purger system is inspected weekly (this includes checking and cleaning nozzles and strainers),  motors are greased, fans are checked for cracks, and piping is inspected for leaks;  low and intermediate pressure receiver oil pots are drained, pump pressure is recorded and pumps and valves are defrosted for excessive ice build up weekly;  visual inspection for equipment and vessel operating limit conditions, piping and valve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047286,
      "SummaryText": "over the past five years (October 2009 - October 2014) that exceeded the Federal Reportable Quantity of 100 pounds in 24 hours or that meet the EPA reporting criteria for the Five-Year Accident History as specified above. In addition, there have been no injuries resulting from a release of ammonia.\r\n\r\nContinued improvement for the ammonia refrigeration systems is a top priority for SSI Food Services LLC.  The management plan, internal audits, Process Hazard Analysis, as well as our prevention programs will be monitored and updated as necessary to ensure that all elements for the PSM/RMP plan are complete.\r\n\r\nEMERGENCY RESPONSE PROGRAM  \r\n\r\nThe facility's emergency response plan is based on OSHA requirements for Emergency Action Plan (29 CFR 1910.38 and 1910.119) and HAZWOPER (29 CFR 1910.120).  The Emergency Response Plan is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained at the facility. On-site personnel have been trained and are qualified to respond aggressively to isolate and control a release.  Equipment such as self contained breathing apparatus (SCBA), respirators, serivex body suits, encapsulated level A suits, gloves, boots, and personal leak monitors are available for the emergency response team (ERT).\r\n\r\nSSI coordinates emergency response efforts with the local fire department(s) and the area HazMat Response Team as the responding agency's scheduling permits.\r\n\r\nGeneral production and office employees are also trained in evacuation procedures including the cause to evacuate (alarm or verbal command), and the area(s) that are designated for evacuation assembly.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe facility has worked to address safety issues as they arise in a continued effort to ensure a safe work environment. Compliance Audits and PHA Revalidation studies have generated recommendations to improve safety at the facility. These include enhancing employee training policies, revising standard operat"
    }
  ]
}