{
  "FacilityID": 1000084814,
  "FacilityName": "T/A TERMINALS, INC./MEREDOSIA TERMINAL",
  "FacilityStr1": "1994 OLD GRACE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "MEREDOSIA",
  "FacilityState": "IL",
  "FacilityZipCode": "62665",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17137",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "39.81361",
  "FacilityLongDecDegs": "-90.561351",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "NA",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "T/A TERMINALS, INC.",
  "Company2Name": null,
  "CompanyDUNS": 73520066,
  "Company2DUNS": 0,
  "OperatorName": "Lemm Corporation - Operations",
  "OperatorStr1": "P.O. Box 3075",
  "OperatorStr2": null,
  "OperatorCity": "Cordova",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38088",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": "NA",
  "EPAFacilityID": "100000132037",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-11-15 00:00:00",
  "SafetyInspectionBy": "IL State Fire Marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.81136,
  "FRS_Long": -90.56136,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105962,
      "AltID": "AMMONIA  TERMINAL",
      "FacilityID": 1000084814,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132702,
          "ProcessID": 1000105962,
          "ChemicalID": 56,
          "Quantity": 73000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000107235,
          "ProcessID": 1000105962,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000089822,
              "Process_NAICS_ID": 1000107235,
              "SafetyReviewDate": "2019-02-22 00:00:00",
              "PHA_Date": "2016-09-08 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Water Spray",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-03-10 00:00:00",
              "TrainingReviewDate": "2019-06-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-03-10 00:00:00",
              "EquipmentInspectionDate": "2020-01-08 00:00:00",
              "EquipmentTested": "Ammonia Sensors",
              "ChangeMgmtDate": "2019-11-19 00:00:00",
              "ChangeMgmtReviewDate": "2018-03-20 00:00:00",
              "PreStartupReviewDate": "2019-11-19 00:00:00",
              "ComplianceAuditDate": "2019-02-22 00:00:00",
              "AuditCompletionDate": "2020-12-31 00:00:00",
              "IncidentInvestigationDate": "2011-03-04 00:00:00",
              "InvestigationChangeDate": "2016-02-02 00:00:00",
              "ParticipationPlansReviewDate": "2019-05-27 00:00:00",
              "HotWorkPermitReviewDate": "2019-02-13 00:00:00",
              "ContractorSafetyReviewDate": "2019-02-13 00:00:00",
              "ContractorSafetyEvalDate": "2019-02-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia (anhydrous) is the only hazardous chemical present at this facility subject to risk management planning.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000111878,
                  "PreventionProgram3ID": 1000089822,
                  "ProcessChemicalID": 1000132702
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084814,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Morgan County LEPC",
    "CoordinatingAgencyPhone": "2174794616",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084814,
      "SummaryText": "This document contains all required information in order to meet 40 CFR 68 \"Risk Management Program\". This document consists of the executive summary and registration data elements (68.155 through 68.185).\n\n\n\n1.0    RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe Lemm Corporation - Operations (\"Lemm\") operates the T/A Terminals, Inc. Ammonia Terminal (\"T/A Terminals\") located in Meredosia, Illinois. Lemm operates this facility under an environmental, health, and safety management system framework to prevent and mitigate incidents. Lemm deems operating in a safe and environmentally sound manner as both a moral obligation and sound business practice and the only acceptable standard of performance for every Lemm employee.\n\n\n\nAnhydrous ammonia (ammonia) is stored at the T/A Terminals Ammonia Terminal above the threshold quantity (TQ) of 10,000 pounds (LBS) therefore making the site subject to the Environmental Protection Agency (EPA) Chemical Accident Provision Provisions under 40 CFR ?68 and the Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) regulation under 29 CFR ?1910.119. \n\n\n\nLemm has written a corporate PSM/RMP compliance program to provide information to employees about the risks involved with the storage and handling of regulated substances subject to PSM/RMP. The program is comprised of 14 chapters and covers each required RMP element. Each chapter defines the roles and responsibilities and specific tasks that must be satisfied to implement Lemm's PSM/RMP compliance program and satisfy all regulatory requirements.  This compliance program contains written programs for conducting RMP activities in covered process areas as required by the RMP regulation with explanations of how to interpret and implement performance-based aspects of the regulation.\n\n\n\nAs required under 40 CFR ?68.190(b)(1), this submittal is the five-year update of the initial RMP submittal for the Terminal. In accordance with the 2004 amendment to the R"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084814,
      "SummaryText": "MP regulations, this executive summary does not include the off-site consequence analyses (OCAs). \n\n\n\n2.0    PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\n\n\nThe T/A Terminals, Inc., Ammonia Terminal is located at 1994 Old Grace Road, Meredosia, IL. An insulated pipeline connects the facility to a barge dock on the Illinois River owned by Trammo Terminal Meredosia, Inc. The facility is also served by the Norfolk/Southern Railroad. Agricultural-grade ammonia is the only regulated substance at the Terminal and is used primarily as an agricultural nitrogen fertilizer. The Terminal receives the ammonia by a pipeline from barges at the riverport dock, in pressurized rail containers, and in pressurized truck containers. The ammonia is stored on site at (-28oF) in 2 atmospheric tanks (one 20,000-ton tank and one 16,000-ton tank) and then transferred to customers by truck, rail, or pipeline. The peak shipping periods are in the spring and fall when ammonia (82% nitrogen) is applied by farmers for agricultural use.\n\n\n\n3.0    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL - SPECIFIC PREVENTION STEPS\n\n\n\nAnhydrous ammonia falls under the RMP Program 3 Prevention Program provisions because it is subject to OSHA Process Safety Management regulation. The RMP Rule requires the development of a prevention program with 13 elements: (1) process safety information; (2) process hazard analyses; (3) operating procedures; (4) training; (5) mechanical integrity; (6) management of change; (7) pre-startup safety reviews; (8) compliance audits; (9) incident investigation; (10) employee participation; (11) non-routine work authorizations; and (12) contractors; and (13) emergency planning and response. Lemm has written and implemented a corporate PSM/RMP program to provide information to employees about the risks involved with the storage and handling of regulated substances covered under PSM/RMP. The program emphasizes the development and application of management and engineering controls"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084814,
      "SummaryText": " and operating procedures to address risks associated with handling or working near ammonia to prevent adverse impact to themselves, their fellow employees, their community, the environment, and the company (Lemm) and its assets. The program includes a Risk Management Plan (RMP) comprised of all information required by 40 CFR ??68.155 through 68.185. The RMP documents how to respond to a release of ammonia at the Terminal and the information to be provided to emergency responders. \n\n\n\nSite- and process-specific operating procedures are written for the T/A Terminals Ammonia Terminal that clearly detail the execution of required routine tasks as well as supplemental information needed to safely and efficiently conduct operations. Operating instructions for each task address process health and safety concerns (e.g., applicable engineering and administrative controls such as needed PPE); define safe operating limits (e.g., pressure limits, temperature ranges, flow rates); safety systems and their functions (e.g., interlocks and appropriate employee response); and contain information on the consequences and safety implications of deviations from operating limits (e.g., what alarms and instruments are pertinent if an upset condition occurs). Operating procedures address operating steps for each operating mode (e.g., initial startup, normal operations, emergency operations, normal shutdown, emergency shutdown, temporary operations, and return to service after a shutdown) and operating limits because different parameters are required and encountered during different operating modes. Operating procedures for computerized process control systems describe the logic of the software as well as the relationship between the equipment, the operator, and the control system. For RMP-covered processes, written operating procedures address discharge, release control, containment, and recovery procedures.\n\n\n\nAdditionally, Lemm has developed and implemented a corporate Loss Control Manua"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084814,
      "SummaryText": "l written pursuant to OSHA 29 CFR ?1910, Occupational Safety and Health Standards. Several RMP elements are satisfied by Loss Control Manual standards (e.g., non-routine work authorizations, management of change, pre-startup safety reviews, and incident investigation). The thorough planning, execution, and completion of all tasks involving hazardous chemicals using the proper tools and equipment while adhering to established safety rules and procedures ensures the prevention and/or minimization of accidents, incidents including releases, personal injury, and/or loss of property or revenue. Corporate requirements are broadly defined allowing the T/A Terminals Ammonia Terminal to develop site-specific requirements and safety procedures based on the structure and hazardous chemicals at the site while satisfying corporate and regulatory requirements. Under Loss Control Manual policy, every employee is given the responsibility and authority to stop work when that employee believes a situation exists that: places them, their coworker(s), contracted personnel, the public, or the environment at risk or in danger; could adversely affect safe operation or cause serious damage to the facility; or could result in a release of a regulated substance.\n\n\n\n4.0    FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no reportable releases from the T/A Terminals Ammonia Terminal in the past five years.\n\n\n\n5.0    EMERGENCY RESPONSE PLAN\n\n\n\nThe Terminal has developed and implemented an Emergency Action Plan (EAP) written pursuant to 29 CFR ?1910.38, Emergency Action Plans, to specify how employees will respond to different types of emergencies based on the Terminal's specific worksite layout, structural features, and emergency systems. The EAP includes personnel roles and lines of authority; procedures for emergency recognition, reporting, and notification (including emergency contact telephone numbers); procedures for employee evacuation and sheltering-in-place; approved escape routes and assembly "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084814,
      "SummaryText": "areas; and methods to account for employees after evacuation or when sheltering-in-place. Implementing the EAP with proper employee training and drills ensures Terminal employees will respond appropriately to any potential emergency at the site to minimize the number and severity of injuries and damages. \n\n\n\nWhile compliance with the OSHA EAP regulation does not satisfy RMP emergency response program requirements (i.e., the development of an emergency response plan), EPA RMP policy does allow non-responding stationary sources (facilities) to develop EAPs rather than emergency response plans provided those sources coordinate with local emergency response agencies to include the source in the community emergency response plan and participate in routine coordination activities and notification exercises. T/A Terminals is a non-responding facility; employees are not trained or equipped to respond to catastrophic releases of regulated substances or major fire episodes. Therefore, the Terminal maintains a site-specific EAP and also coordinates with local response agencies to ensure they are aware of the hazards presented by the site and will be prepared to respond to and mitigate the threat posed by a release of ammonia or a major fire at the facility as required by RMP regulation. Coordination with local responders entails routinely communicating and conducting joint drills with the Morgan County Local Emergency Planning Committee (LEPC) and Meredosia fire department. \n\n\n\n6.0    PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSince the last submission, T/A Terminals has replaced all process instrumentation, installed a Distributed Control System (DCS), and implemented a Safety Instrumented System (SIS) designed to take control action to prevent risks and safeguard the process when abnormal conditions are present. \n\n"
    }
  ]
}