{
  "FacilityID": 1000043365,
  "FacilityName": "Bob Derrington Water Reclamation Plant",
  "FacilityStr1": "9600 South County Road 1325",
  "FacilityStr2": null,
  "FacilityCity": "Odessa",
  "FacilityState": "TX",
  "FacilityZipCode": "79766",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48329",
  "LEPC": "Ector County LEPC",
  "FacilityLatDecDegs": "31.820278",
  "FacilityLongDecDegs": "-102.254167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.odessa-tx.gov",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Odessa",
  "Company2Name": null,
  "CompanyDUNS": 81084055,
  "Company2DUNS": 0,
  "OperatorName": "City of Odessa",
  "OperatorStr1": "P.O. Box 4398",
  "OperatorStr2": null,
  "OperatorCity": "Odessa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79760",
  "OperatorZipCodeExt": null,
  "RMPContact": "Thomas G. Kerr, P.E.",
  "RMPTitle": "Director of Utilities",
  "FTE": 28,
  "OtherEPAFacilityID": "TX0072800",
  "EPAFacilityID": "100000073314",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 31.82028,
  "FRS_Long": -102.25417,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "PUBLIC LAND SURVEY - FOOTING",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053505,
      "AltID": "Wastewater Treatment Plan",
      "FacilityID": 1000043365,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054269,
          "ProcessID": 1000053505,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065086,
          "ProcessID": 1000053505,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565086,
          "ProcessID": 1000053505,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043365,
      "SummaryText": "The City of Odessa operates a wastewater treatment plant located southeast of the City in western Midland County.  Chlorine is used to disinfect the effluent, for algae control, and control of sludge bulking.  Residual chlorine in the effluent is removed using sulfur dioxide prior to discharge from the plant to the receiving stream.  Chlorine is currently stored onsite in one ton containers up to a maximum of 20,000 pounds.  Sulfur dioxide is not included in this submittal since it will not be stored in quantities which exceed the reportable quantity of 5000 pounds.\n\n\n\nDue to the presence of these chemicals at the facility, the City of Odessa has developed a program to ensure the safe handling of the chemicals.  The safety program has been reviewed in accordance with the Environmental Protection Agency's Risk Management Program and revised to comply with its provisions and enhance the existing program.  The City of Odessa is committed to allocating the manpower and financial resources required to implement all facets of the Risk Management Program and thereby reduce the potential for an accidental release of any toxic substance.\n\n\n\nThe off-site consequency analyses, including one worst-case scenario and alternative scenario were originally developed by the independent consulting firm of Alan Plummer & Associates using a computer air dispersion model (ALOHA) in June of 1999, the year of original RMP submission.  The analyses define the area potentially affected by the release of a toxic substance allowing the identification of residential populations, public and environmental receptors such as industrial and commercial, and natural sites such as parks. The analyses were reviewed and updated (no changes were necessary) for the RMP 5-yr re-submission.  The model was reviewed in light of the current processes at the Bob Derrington Plant. No changes in the chlorine process has have been made. No changes in inventory have occurred. The results are still valid.\n\n\n\nAs a par"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043365,
      "SummaryText": "t of the City's Risk Management Program, the City reviewed the most recent  five-year period to determine if any accidental releases or incidents which could have resulted in a reportable accidental release had occurred. No incidents were identified.\n\n\n\nThe Accidental Release Prevention Program for the City of Odessa contains several facets.  The chemical storage areas were designed in accordance with the Standard Building, Plumbing, Mechanical, and Gas codes, as well as the National Electrical Code.  The established maintenance program ensures that the equipment is maintained in a manner which allows its safe operation.  Standard operating procedures have been developed for the delivery of the hazardous gases, operation of the chlorine system, management of change to processes, and the investigation and correction of leaks.  Training programs have been implemented to ensure that employees have initial and ongoing training in the operation and maintenance of the hazardous gas system and proper response to an accidental release.  This training not only includes plant personnel but also other personnel (e.g. Fire Department and contractors) who are instrumental to the overall success of the safety and emergency response programs.  To ensure continued compliance with the conditions of the prevention program, periodic compliance audits are conducted and any deficiencies addressed.\n\n\n\nAn emergency response program is also in place.  Trained plant personnel will address minor leaks while the Emergency Response Team of the Fire Department will address major leaks.  Leak detectors are in place that will alert plant personnel and Public Communication of a leak.  Emergency Services will dispatch the Fire Department and notify key personnel.  If needed, the public in the affected area can be alerted through the Dialogic Communicator Corporation (DCC) or similar system.  The Emergency Plan has also been coordinated with the Ector County Local Emergency Planning Group.\n\n\n\nThe Ci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043365,
      "SummaryText": "ty conducts periodic evaluations of its hazardous gas system.  We ensure that the leak detection system is maintained, ongoing training provided and Standard Operating Procedures reviewed and updated as needed.  In summary, the City of Odessa has implemented a Risk Management Plan as defined by the Environmental Protection Agency to address a potential accidental release from the chlorine system operated at the Bob Derrington Water Reclamation Plant.  The complete report is on file at the City of Odessa Utilities Department."
    }
  ]
}