{
  "FacilityID": 1000018701,
  "FacilityName": "City of Fort Bragg Wastewater Treatment Plant",
  "FacilityStr1": "Vicinity of Soldier Point",
  "FacilityStr2": "101 West Cypress Street",
  "FacilityCity": "Fort Bragg",
  "FacilityState": "CA",
  "FacilityZipCode": "95437",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06045",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "39.438889",
  "FacilityLongDecDegs": "-123.813333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 980585038,
  "ParentCompanyName": "Vicinity of Soldier Point",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Fort Bragg",
  "OperatorStr1": "416 N Franklin Street",
  "OperatorStr2": null,
  "OperatorCity": "Fort Bragg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95437",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165457",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-06-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-11-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-11-30 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-11-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-12-18 00:00:00",
  "DeRegistrationEffectiveDate": "2015-12-18 00:00:00",
  "AnniversaryDate": "2015-11-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.438779,
  "FRS_Long": -123.81446,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000022827,
      "AltID": null,
      "FacilityID": 1000018701,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000026991,
          "ProcessID": 1000022827,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000023129,
          "ProcessID": 1000022827,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000019296,
              "Process_NAICS_ID": 1000023129,
              "SafetyReviewDate": "2010-10-20 00:00:00",
              "PHA_Date": "2010-11-24 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-11-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "vehicle impact, sabotage, confusion during emergency, long REHIT response time",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-11-23 00:00:00",
              "TrainingReviewDate": "2010-11-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-11-05 00:00:00",
              "EquipmentInspectionDate": "2010-11-16 00:00:00",
              "EquipmentTested": "checked V10K Chlorinator, valves, and piping. Vacuum system checked prior to gas hookup, double check after gas hookup with ammonia",
              "ChangeMgmtDate": "2010-10-13 00:00:00",
              "ChangeMgmtReviewDate": "2010-11-23 00:00:00",
              "PreStartupReviewDate": "2010-11-23 00:00:00",
              "ComplianceAuditDate": "2010-05-10 00:00:00",
              "AuditCompletionDate": "2012-11-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-11-29 00:00:00",
              "HotWorkPermitReviewDate": "2010-11-29 00:00:00",
              "ContractorSafetyReviewDate": "2010-11-29 00:00:00",
              "ContractorSafetyEvalDate": "2010-11-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000022860,
                  "PreventionProgram3ID": 1000019296,
                  "ProcessChemicalID": 1000026991
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000018701,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-11-29 00:00:00",
    "ERTrainingDate": "2010-10-27 00:00:00",
    "CoordinatingAgencyName": "Fort Bragg Fire Department",
    "CoordinatingAgencyPhone": "7079612831",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 12,
      "FacilityID": 1000018701,
      "SummaryText": "y point to learn the details of the release.  Emergency responders would either be the staff of the FBFD, for small leaks and REHIT for sustained releases.  \n\nFifth will be notification of a hazardous materials release to those capable of assessing and handling environmental health following a hazardous materials release (REHIT) who will be notified by the 911 call.  So as soon as possible after actions and communications that bring about immediate safety of staff and citizenry, Mendocino County Department of Public Health Services should be notified and the REHIT notification confirmed.  Every uncontrolled release must be reported to the State of California's Certified Unified Program Agency (CUPA) for Mendocino County which is the Environmental Division of the Mendocino County Department of Public Health Services.  Conveniently, Mendocino County Department of Public Health Services is also the contact for REHIT.  These notifications logically follow immediate safety steps because the CUPA, Environmental Health, and REHIT are all based in Ukiah, California - a significant distance from the WWTF requiring hours in response time.\n\nSixth will be notification to comply with State and Federal notification requirements.  California State Warning Center (California Emergency Management Agency or EMA) and the National Response Center must be notified of the release. \n\nNotification Phone List:\n911 for emergency response    964-0200 local police department              \nFort Bragg Fire Department:     961-2831\nCUPA and REHIT in Ukiah, CA:  (707) 463-4466\nCalifornia Response Center:  (800) 852-7550 or (916) 845-8911\nNational Response Center:  (800) 424-8802\n\n\n\t\n1.7:  Planned Changes to Improve Safety:\nCurrent applicable codes and regulations are reviewed under the Process Hazard Analysis (PHA) element as part of Process Safety Management (PSM) to determine if changes need to be made to increase operational safety for the chlorine and sulfur dioxide systems.  Changes recommend"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000018701,
      "SummaryText": "ed will be added to the list of prevention and mitigation measures for accidental chlorine and sulfur dioxide releases.  \n\nCCR Title 19, Division 2, Chapter 4.5 requires a Compliance Audit at least every three years.  A Compliance Audit and Off Site Consequence Analysis evaluation was conducted on May 10, 2010, which was well attended by a complimentary team of operations personnel, the local Fire and Police departments, Mendocino County Sheriff department and OES totaling 13 persons.  The results of the 2010 Compliance Audit, Offsite Consequence Analysis evaluation, and PHA are included in the body of this report.\n\nThe following recommendations were made to improve operational and public safety: \n1)  The highest risk to the site may be its vulnerability to unauthorized access.  It is recommended that a high perimeter fence and automatic gate open/close feature be installed (5-10-10 Audit).\n2)  Improve speed of notification to vulnerable citizenry.  Develop a recorded message to shelter in place for radio broadcast and a reverse 911 system to improve response time in contacting vulnerable citizenry of a chlorine gas release prioritized to call those numbers in the prevailing wind direction first.  Shelter in Place means to stay inside where you are and don't go out to be exposed to gas, and to tune your radio to KOZT (95.3) for future instructions (OSCA 5/10/10).\n3)  Improve operator safety callout codes.  In the event an operator is called out from home in an emergency, the responding operator inserts his/her code indicating the callout is being answered.  The recommendation is that a second callout code be entered that would indicate that the emergency situation was resolved and if no such code is entered that a 911 callout is automated (5-10-10 Audit)."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000018701,
      "SummaryText": "total release quantity of 1374 pounds of chlorine.  The distance to the 0.0087 mg/l chlorine toxic endpoint for the Alternative Release scenario is 0.2 miles or 1,056 feet.  This chlorine release will extend beyond the boundaries of the WWTF and into the open space around it but is not predicted to enter populated areas (Figure 9).  The Alternative Release OSCA scenario is used because a broken pipe is the most probable location in the system that chlorine can be released under normal operating conditions.  Since the vacuum systems were installed in 2005, it is more likely that any chlorine released would be a smaller volume at a lesser rate and so constitute a smaller toxic gas plume which would dissipate in a shorter distance than what might have happened prior to vacuum system installation. \n\nThe WWTF is presently surrounded by a naturalizing area that was once the Georgia-Pacific (G-P) mill site, with the exception of its complete western side which is all Pacific Ocean.  Lands that were once used to mill and store lumber are now open space for a distance of about 0.4 miles to the north, east, and south.  It is predicted that the area to the southeast of the WWTF will be re-developed into an urban complex with open spaces at some point in the future along with public access along the coastal trail.  The area beyond the 0.4 mile radius to the north, east, and south is where a gas release would begin affecting the local urbanized human community.  \n\nThe Alternative Release scenario for sulfur dioxide for the one-ton container located at the WWTF assumes a release from a sheared pipe, resulting in an estimated average release of 13.4 pounds per minute.  The period of release is estimated to be 1 hour in duration, resulting in a total release quantity of 804 pounds of sulfur dioxide.  The distance to the 0.0078 mg/l endpoint for the Alternative Release scenario is 0.2 miles or 1,056 feet.  This sulfur dioxide release will extend beyond the boundaries of the WWTF and"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000018701,
      "SummaryText": "into the open space but is not predicted to reach populated areas (Figure 11).  The Alternative Release OSCA scenario used the valve as its site because it is the most probable location in the system that sulfur dioxide can be released outside of normal operating conditions.  \n\n1.3.4:  Mitigation Measures:\nMitigation measures exist to restrict, avoid, or minimize the amount of chlorine and/or sulfur dioxide released IF a release were to occur.  The mitigation measures are based upon the design, inspection, testing, and maintenance of the chlorine and sulfur dioxide systems and their related equipment and components. \n\nA gas vacuum system was installed in 2005 following a recommendation from the 2005 WWTF RMP.  This vacuum system now minimizes the volume of chlorine gas and/or sulfur dioxide gas that could potentially be released and is a significant improvement over the old system.  The old system used residual pressure as a mechanism to move chlorine gas into and through the chlorinators.  That system risked continued toxic gas exposure in the event of a leak because gas escaping from any break in the transmission line would be replaced until pressure in the in-service chlorine container reached equilibrium with atmospheric pressure.  The new vacuum system avoids this risk by utilizing a vacuum regulator on the tank.  If the distributor line is severed, the regulator will close and the remaining gas in the line will be removed by the vacuum created by the injector.\n\n1.4:  General Accidental Release Prevention Program and Chemical Specific Prevention Steps:\nThis facility complies with all applicable federal and state codes and regulations.  There are safety meetings and safety training programs with mandatory attendance for all WWTF employees.  The Process Safety Management (PSM) program implemented at the WWTF for chlorine and sulfur dioxide related activities and equipment represents a commitment to an accidental release prevention program.\n\nRegularly scheduled m"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000018701,
      "SummaryText": "eetings were administered by the Superintendent up until summer 2010.  Reorganization brought this task to the Lead WWTF Operator.  Training materials are available for this purpose.  The change in personnel and revision of this RMP has brought a schedule of trainings that will be implemented beginning in December, 2010 along with an employee participation program that certifies that each employee participated in the training along with examinations and on the job demonstration of the newly learned skill sets.\n\nPHA results are as follows.  Risk rankings of 9 and above were looked at more closely and the safeguards and mitigation measures already in place were evaluated for effectiveness.  Recommendations were also made where appropriate.\n\nRisks with Rankings of 9\nÂ¿\tDuring delivery, a container ruptures while offloading.  The probability of this happening is low; however, the consequence of this occurring is high.  The safeguards against this scenario occurring are staff training and SOPs for one-ton toxic gas container delivery that should lessen the likelihood of container damage through rough and/or improper handling.\nÂ¿\tTerrorists.  The WWTF is surrounding by the closed G-P mill property which has security 24-hours a day, but the WWTF itself is not staffed at night and the facility's perimeter fencing is in poor repair.  It would be possible for terrorists to access the site and the gaseous chlorine, and the consequence of a deliberate release would be high.  Detectors and alarms would activate, however, response times would be very long because emergency responders are almost two hours away.  It is recommended that perimeter fencing be repaired or replaced where necessary In the very short term.  \nÂ¿\tImpact from aircraft.  There is an old airstrip just south of the WWTF that is shown on many maps.  The site is overflown by USGC helicopters and coastal surveying aircraft, and while an impact by aircraft is possible, it is not very likely.  \nRisks with Rankings o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018701,
      "SummaryText": "delivery truck.\n\nThe toxic gas storage building is not in an area subject to ordinary vehicular traffic.  Normally, only maintenance vehicles, the WWTF tractor, and gas delivery vehicles operate near the toxic gas storage building.  No unauthorized personnel are allowed entry into the building.\nChlorine and sulfur dioxide gas are stored in pressurized one-ton containers.  Both gases are withdrawn from a one-ton in-service container by vacuum.  This vacuum opens the vacuum regulator diaphragms and withdraws the gas from the one-ton container in service at controlled feed rates.  The feed rates are controlled by individual metering devices and are adjusted by the operators according to waste stream flows.  The regulator controls the rate at which gas enters the chlorinator for chlorine gas and the sulfonator for sulfur dioxide gas.  \n\nThe chlorinator mixes chlorine gas with process water and injects chlorinated water into the wastewater stream.  The sulfonator mixes sulfur dioxide gas with process water which is then fed into the wastewater stream as the chlorinated wastewater leaves the chlorine contact chamber.  The sulfur dioxide is used to dechlorinate the wastewater effluent before it is discharged to the Pacific Ocean.\nThe receipt, storage, and handling of chlorine and sulfur dioxide are considered parts of a single process.\n\n1.3:  Release Scenarios:\nIn 2005, the 1999 release scenarios were reexamined using the U.S. EPA / NOAA ALOHA (Areal Locations of Hazardous Atmospheres) computer model Version 5.3.1.  This model made predictions for only a few select geographic locations.  The predictions are made for Eureka, California and are assumed to be applicable to Fort Bragg.  The release scenarios developed in 1999 used ALOHA Version 5.2.3 and did not take local weather data into consideration.  ALOHA Version 5.3.1 yielded different (more conservative) results from for 2005 than the earlier versions of the model.  In 2010 release scenarios were examined using the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018701,
      "SummaryText": "default parameters identified in CalARP and EPA guidance documents instead.\nPrevailing wind conditions and potentially affected populations have not changed appreciably since 2005, however maximum air temperatures are commonly higher than 630 F reported in 2005 from the Point Arena weather buoy and do occasionally reach 770 F so the OSCAs were run in 2010 using RMPComp and default air temperature and wind speed and F stability class as is encouraged by both EPA and CalARP. Wind roses presented in the 2005 RMP were presented again in 2010 because the monthly and seasonal windroses predict the direction that predominant wind conditions blow from. \n\nA vacuum system was installed in 2005 to improve on safe use of a toxic gas.  Since that time it is more likely that any chlorine release would generate a smaller volume of toxic gas at a lesser rate.  In this way this active mitigation reduced the potential toxic gas plume resulting in a smaller potential toxic gas plume which would then dissipate with the wind in a shorter distance than what might have occurred prior to vacuum system installation.\n\n1.3.1:  Meteorological conditions:\nThe City's WWTF is located on a bluff overlooking the Pacific Ocean and winds from the ocean dominate the site.  There are no extensive records of wind conditions on or near the site, but National Data Buoy Center Station 46014 is located off Point Arena at latitude 39.22 N and longitude 123.97 W, 17.35 miles southwest of the site.  Station 46014 records wind speed and intensity at a height of four meters every ten minutes and air temperature hourly.  Data from Station 46014 were used for the release scenarios developed in 2005.  However in 2010 the City utilized the default conditions identified in CAL ARP and in EPA guidance documents instead.\n\n1.3.2:  Worst Case Release Scenarios:\nThe assumptions for Worst Case Release scenarios are specified in 40 CFR 68.  Requirements define a Worst Case Release as the venting of the contents of one of th"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000018701,
      "SummaryText": "years, or whenever a change in the operation or in the process would warrant a review.  \n\n1.5:  Five Year Accident History:\nThere have been no accidents involving the release of chlorine or sulfur dioxide within the past five years at the WWTF.\n\n1.6:  Emergency Response Program:\nNo WWTF operators are trained in controlling sustained releases of chlorine or sulfur dioxide.  There are no emergency kits designed to enable qualified staff to contain leaks greater than 10 ppm on the site.  Therefore, all sustained releases, no matter if they are from fusible plugs, leaks in container sidewalls, or from valves, require evacuation of the WWTF by all people on the premises.  All sustained leaks will trigger the Emergency Response Program.\n\nThe Emergency Response Program has six parts:  \nFirst, when a leak is discovered, the person discovering the leak must notify all personnel on the WWTF premises that a leak has occurred and direct staff to the appropriate assembly point considering real time wind direction.  \n\nSecond, everyone on the WWTF premises must gather at the designated assembly point.  The most upwind assembly point will be selected for safety of all staff and responders.  That assembly point would be whichever of the three assembly points listed below is upwind at the time of the release.  Three potential assembly points have been pre-determined; the manned guard shack at the Cypress Street gate to the G-P mill site, the unmanned Oak Street gate to the G-P mill site, and Soldier's Point (figure 11).\n\nThird, a WWTF staff person must notify the emergency responders of the leak, the need for an emergency response, the assembly location, and how to contact the evacuated WWTF staff.  This can be done by calling 911.  Additionally, City Hall and the guard stationed at the Cypress Street G-P guard shack shall be notified that an emergency response is in progress and of the designated assembly point.\n\nFourth, emergency responders must contact WWTF staff at the assembl"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018701,
      "SummaryText": "Section 1:\tExecutive Summary:\n1.1:  Accidental Release Prevention and Emergency Response Policies:\nThe City of Fort Bragg (City) owns and operates a Wastewater Treatment Facility (WWTF) located at 101 West Cypress Street, Fort Bragg, California (AP 008-020-07-00).  The WWTF handles gaseous chlorine and sulfur dioxide, regulated substances which are considered hazardous materials.  Both chlorine and sulfur dioxide are considered in this Risk Management Plan (RMP).  As an owner/operator, the City has a general duty to identify hazards and minimize them to maintain a safe facility for staff and the general public. \n\nThe properties of chlorine and sulfur dioxide make it necessary to observe safety precautions during handling to prevent human exposure and to reduce the threat to the facility's workers and nearby members of the community.  Safety depends upon using safe procedures when handling chlorine and sulfur dioxide; using the safety devices and safety systems designed and constructed into the facility; and upon the training of pertinent personnel.\n\n1.2:  Stationary Source and Regulated Substances Handled:\nPlant description:\nThe City's WWTF is designed to treat 1.0 million gallons per day (MGD) of wastewater from the residences and businesses of the City.  The treatment process consists of headworks screening, a primary clarifier, two trickling filters, a secondary clarifier, a chlorine contact chamber, and a dechlorination system.  Treated effluent is gravity fed through the WWTF outfall to the Pacific Ocean.  Solids removed from the waste stream are pumped to a primary anaerobic digester.  Supernatant from the primary digester flows to a secondary anaerobic digester, and solids removed from the secondary digester are dewatered using a belt press and stored in drying beds until removal offsite.  \n\nThe WWTF operates automatically twenty four hours per day, seven days per week.  Personnel are present for about nine hours per day on weekdays (7:00 AM to 4:00 PM) and f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018701,
      "SummaryText": "or about four to five hours per day on the weekends.  Weekend staff may not be present at the WWTF for continuous periods of time, as they are responsible for keeping the City's water treatment plant in operation as well as the WWTF.\nChlorine use:\n\nChlorine is used to disinfect the treated wastewater to prevent the spread of pathogenic organisms.  Chlorine is delivered by a commercial supplier in one-ton containers for use at the WWTF.  An electric hoist is used to off-load the one-ton containers from the commercial delivery vehicle.  All one-ton chlorine containers are placed inside the toxic gas storage building and at any given time, a single chlorine container is on-line.  Three additional chlorine containers are either full and on standby, or they are empty and awaiting replacement.  The physical  and configuration of the toxic gas storage building limits the amount of chlorine at the facility to no more than four one-ton chlorine containers for a total of 8,000 pounds.\n\nSulfur dioxide use:\nBecause chlorine is toxic to aquatic life, sulfur dioxide is used to neutralize residual chlorine in the treated wastewater before the effluent is discharged into the Pacific Ocean.  Sulfur dioxide is delivered by a commercial supplier in one-ton containers for use at the WWTF.  The same electric hoist used to handle one-ton chlorine containers is used to off-load the one-ton containers of sulfur dioxide.  At any given time, a single sulfur dioxide container is on-line.  The other two sulfur dioxide containers are either full and on standby, or they are empty and awaiting replacement.  \n\nThe physical  and configuration of the toxic gas storage building at the WWTF limits the number of one-ton containers inside the structure itself to six.  Staff policy is to store all four full containers of chlorine inside the structure, which limits the amount of sulfur dioxide stored inside the building to no more than two one-ton containers.  Three one-ton containers, for a total of 6,00"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018701,
      "SummaryText": "0 pounds, are normally kept on hand, making it necessary to store the third sulfur dioxide container outside the toxic gas storage building.  This extra sulfur dioxide container is placed last in the line of full containers, just outside the building, and is securely fastened down with the other containers and coned off.  When the first gas container is emptied, either chlorine or sulfur dioxide, the empty container is moved to the outside of the toxic gas storage building and the extra full container of sulfur dioxide is moved inside.\n\nToxic gas handling procedures\nBoth the chlorine and sulfur dioxide one-ton containers are delivered during normal working hours.  The paved approach to the toxic gas storage building provides just enough room to park the delivery truck during the off-loading of the full one-ton containers and loading of the empty one-ton containers.  Two WWTF operators are required to be present at the toxic gas storage building when the delivery truck moves into the off-loading position.  Prior to off-loading, each container is inspected for signs of a leak.  Both operators are required to have their respirators readily available.  One operator is inside the toxic gas storage building and operates the hoist used to move the one-ton containers.  The second operator fills out the procedure form and either assists in attaching the lifting bar to the container to be loaded while helping control the suspended container, or provides visual safety for the off-loading process.  The container delivery is then logged in the chlorine and sulfur dioxide book and in the operations log book.\nThe delivery truck is required to park such that there is room to escape the building in the event of a gas release.  With the delivery truck parked correctly there would be three points of escape from the building; (1) under the delivery truck's trailer, (2) between the south wall of the building and the delivery truck, and (3) between the north wall of the building and the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000018701,
      "SummaryText": "e largest containers used on site within a ten-minute period.  Requirements specify that the potential impacted area be identified using Emergency Response Planning Guidelines. \nChlorine:\n\nThe one-ton (2,000 pounds) chlorine container is the largest, and only, vessel  used in the chlorination system located at the WWTF.  The one-ton (2,000 pound) chlorine container is the largest, and only, vessel  used in the chlorination system located at the WWTF.  The Worst Case release scenario to be modeled for the one-ton chlorine container assumes that the full 2,000 pounds of chlorine is released over a ten minute period resulting in a release rate of 200 pounds per minute.  The distance to the endpoint of 0.0087 mg/l for the Worst Case scenario is 3.0 miles. This chlorine release will extend beyond the boundaries of the WWTF and could potentially cloud the City as well as outlying areas beyond Virgin Creek to the north and beyond Digger Creek to the south (Figure 7).  \n\nSulfur dioxide:\nThe one-ton (2,000 pound) sulfur dioxide container is the largest, and only, vessel  in the dechlorination system located at the WWTF.  The Worst Case release scenario to be modeled for the one-ton sulfur dioxide container assumes that the full 2,000 pounds of sulfur dioxide is released over a ten minute period resulting in a release rate of 200 pounds per minute.  The distance to the endpoint of 0.0078 mg/l for the Worst Case scenario is 3.1 miles.  This sulfur dioxide release will extend beyond the boundaries of the WWTF and could potentially cloud the entire City as well as outlying areas beyond Virgin Creek to the north and beyond Digger Creek to the south (Figure 8).\n\n1.3.3:  Alternative Release Scenarios:\nThe Alternative Release scenario for chlorine for the one-ton container located at the WWTF assumes a release from a sheared valve packing, resulting in an estimated average release of 22.9 pounds per minute.  The period of release is estimated to be 1 hour in duration resulting in a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000018701,
      "SummaryText": "f 12\nÂ¿\tPressure in one-ton container in storage is too high.  There are no pressure relief fuses and there would be no way of knowing if the pressure was too high.  Containers are supplied by the vendor and it is assumed that the containers comply with the vendor's SOPs.  Each container has fusible plugs that melt at 158o F.  If there were a fire near the storage building hot enough to melt the fusible plugs there could be a chlorine release.\nÂ¿\tEarthquake for the storage of containers and the feed system.  An earthquake of a magnitude to cause significant damage is likely, but with the conversion of the system from pressure to vacuum, the consequence is considered to be less than it was in the past.  With the present system, any breaking of the lines would cause the flow of chlorine or sulfur dioxide gas to stop and a release is less likely to occur.\nÂ¿\tVehicle impact.  This is a possibility.  Whereas, vehicle traffic is restricted in the area of the toxic gas storage building, City service trucks, backhoes, and tractors are used around the building.  This risk could be mitigated by installing removable bollard posts in front of the toxic gas storage building. \nRisks with Rankings of 18\nÂ¿\tVandalism or sabotage.  As was discussed for terrorism, the WWTF is surrounding by the closed G-P mill property which has security 24-hours a day, but the WWTF itself is not staffed at night, the facility's perimeter fencing is in poor repair, and emergency responders are far away.  The consequence of a deliberate release is the same as for terrorism, however, the occurrence of vandalism or sabotage is considered more likely than terrorists striking Fort Bragg, thus the higher ranking.  It is recommended that perimeter fencing be repaired or replaced where necessary in the very near future.\nÂ¿\tConfusion in an emergency situation.  The probability of confusion during an emergency is likely and the consequence of confusion and uncertainty is high.  The deterrence for confusion is"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000018701,
      "SummaryText": "adherence to SOPs, staff safety training, and emergency response training.  Regularly scheduled safety and emergency response training will be implemented with documentation of said training kept in the WWTF office and shared on the Z drive.\nÂ¿\tEarthquake during a delivery.  An earthquake of a magnitude to cause significant damage is likely, but with the conversion of the system from pressure to vacuum, the consequence is considered to be less than it was in the past.  However, the consequence of an earthquake during a delivery is higher than for either storage or the feed system because there is a likelihood that more gas containers than usual would be on site during a delivery.\nÂ¿\tFire external to the toxic gas storage building.  Each one-ton container has fusible plugs that melt at 158o F.  If there were a fire near the storage building hot enough to melt the fusible plugs there could be a chlorine release.\nRisks with Rankings of 27\nÂ¿\tLong response time for first responders.  This is the highest risk determined during the 2010 PHA.  Fort Bragg Fire Department (FBFD), personnel have Class B personal protective equipment and are trained and equipped to respond to minor chlorine or sulfur dioxide leaks.  The role of first responders to major releases is assigned to the Redwood Empire Hazardous Response Team (REHIT), based at California Department of Forestry (CDF) Howard Forest station on US 101 between Willits and Ukiah.  REHIT has pre-positioned Class A personal protective equipment and Emergency Kit B at the FBFD but personnel are at least an hour and a half away. \n\nRecommendations have been made with various commitment times and schedules. The City's Director of Public Works will assure that mitigation measures are implemented according to the commitments recorded in the PHA and not later than two years from the date that the certified RMP is submitted to the Mendocino County Department of Environmental Services (11-29-2010).\n\nThe PHA will be updated every five"
    }
  ]
}