{
  "FacilityID": 1000011135,
  "FacilityName": "City of Oswego Water Treatment Facility",
  "FacilityStr1": "30 Sheldon Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Oswego",
  "FacilityState": "NY",
  "FacilityZipCode": "13126",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36075",
  "LEPC": "Oswego County LEPC",
  "FacilityLatDecDegs": "43.457111",
  "FacilityLongDecDegs": "-076.535472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.oswegony.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Oswego, New York",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brian J. Folgherait",
  "OperatorStr1": "13 West Oneida St.",
  "OperatorStr2": "City Hall",
  "OperatorCity": "Oswego",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13126",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian J. Folgherait",
  "RMPTitle": "Plant Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136658",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-09-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-09-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.45711,
  "FRS_Long": -76.53547,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-NEAREST INTERSECTION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013267,
      "AltID": "Chlorine Injection System",
      "FacilityID": 1000011135,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013628,
          "ProcessID": 1000013267,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015283,
          "ProcessID": 1000013267,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515283,
          "ProcessID": 1000013267,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011135,
      "SummaryText": "Executive Summary\n\n\n\nWatts Engineers was subcontracted by Pratt and Huth Associates, LLP to provide the City of Oswego a Level 3 Risk Management Program (RMP) and a Process Safety Management (PSM) Program in accordance with 40 CFR 68 Risk Management Programs for Chemical Accidental Release Prevention and 29 CFR 1910.119 Process Safety Management for it's Water Treatment Facility (WTF) located at Shelton Avenue in the City of Oswego, New York. This evaluation was performed to assure that the facilities chlorine injection system complies with applicable regulations. Key elements of the Risk Management Plan provided by Watts Engineers included: a review of the accidental release prevention and emergency response policies; a review of the regulated substance handled; a worst-case and an alternative release scenario; a review of the general accidental release prevention program and chemical-specific prevention steps; a review of the five-year accident history; a review the emergency response program; and participation in meetings and planning changes to improve the Process Safety Program. Watts Engineers will electronically submit this Risk Management Plan to the Environmental Protection Agency (EPA) by June 21, 1999.  The City of Oswego submitted an RMP update during June of 2004, during July of 2009, and will be submitting another update by September 30, 2014.\n\n\n\nThe Oswego WTF is located on the West Side of the City of Oswego between the Niagara Mohawk Power Station and the State University of New York at Oswego. It employs approximately fourteen (14) full-time employees. Activities at the facility include the treatment of water from Lake Ontario, clarification and filtration, and treated with chlorine gas before being released to the municipal water supply.\n\n\n\nChlorine is considered a regulated substance under the Risk Management and Process Safety Programs. Characteristics of this gas or liquid include a pungent suffocating odor. It is irritating to the mucous membr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011135,
      "SummaryText": "anes. When chlorine reacts with water, it forms hydrochloric acid. Hydrochloric acid gas is a toxic and corrosive fume. The odor threshold for chlorine is about 0.5 ppm. Long term exposures to small concentrations or short-term exposures to high concentrations may result in adverse health effects. Since chlorine gas is heavier then air, It can settle in low spots along the ground, therefore, care should be exercised while working in confined spaces or low lying areas.\n\n\n\nThe City of Oswego and senior management at the Water Treatment Facility have a strong commitment to the overall safety of its employees, the public, and the environment. It is the policy of the WTF to train each employee and contractor about safety considerations and emergency procedures in the unlikely event of a discharge. A maximum of twelve thousand (12,000) pounds of chlorine gas in six (6) tanks gas are either used or stored at one time at the facility. Each tank contains two thousand (2,000) pounds of chlorine gas. The chlorine is composed of 99.5 percent chlorine and 0.5 percent inert ingredients. The tanks are located in the chlorinator room with the empties stored on a pad behind the facility. Chlorine is being delivered by truck and unloaded using a two-ton crane onto a set of steel rails where the gas tank is stored until it is ready for use. Each end of the rails are chocked to prevent the gas tanks from rolling. Each gas tank has it's own valve guard to prevent objects from coming in contact with the valves.  When a chlorine tank is needed, a two-ton crane lifts the cylinder to move onto the tank scales. \n\n\n\nThe chlorine room is fully enclosed. The room is labeled \"chlorine hazard\" and emergency instructions are posted at the door. Material Safety Data Sheets (MSDS) are located on the wall inside the pumphouse.  Here, the chlorine is injected into the injection water through a series of valves and PVC tubes.\n\n\n\nThe chlorine tanks are stored on a calibrated scale, designed to hold four"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011135,
      "SummaryText": ", two thousand pound tanks on roller trunnions. The chlorine containers have two valves in each head, with the tank in a horizontal position and the valves in a vertical line; they deliver gas from the upper valve and liquid from the lower valve. Five hundred (500) psig stainless steel tubing fitted with a special adapter is used to connect the tank to the tubing system. To connect the line to the container, a valve protection hood and the valve outlet cap are removed. A wrench is used to connect the valving to the yoke. A new gasket, which is supplied with the container, is used each time a connection is made. As part of the Process Safety Management Program leaks are then checked using ammonia vapor. The appearance of white vapor indicates a chlorine leak. A protective suit, gloves, and a self-contained breathing apparatus (SCBA) are worn by the operator and a chlorine tank repair kit are kept on hand in the unlikely event of a chlorine leak while changing tanks. In the past five years, this facility has had no accidental releases of chlorine.\n\n\n\nThe City of Oswego Water Treatment plant maintains a general accidental release prevention program and chemical specific prevention steps. As a part of this program, a chlorine alarm system is in place at the facility. The chlorine meter and alarm are located on the wall outside of the chlorine injection room. The chlorine sensors are located in the chlorine room. In the event of a chlorine leak, an audio alarm will sound. The monitor is maintained and calibrated by an outside contractor. The calibration frequency is yearly as recommended by the manufacturer. Literature and information on the alarm system is kept on file by the superintendent of the facility. All employees are trained yearly on the chlorine alarm system. An operator receiving an alarm is to call the Oswego Fire Department immediately. In the event that the chlorine alarm system is inoperable, an operator will check the chlorine room hourly with a portable"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011135,
      "SummaryText": " chlorine meter. The operator also carries a radio to communicate with another plant personnel should a leak be discovered.\n\n\n\nThe chlorine injection system itself operates under a vacuum produced by the injector mechanism. Gas leaves the tank through a vacuum-regulating valve. A diaphragm senses vacuum on one side and atmospheric pressure on the other. A spring-loaded stem off the seat is displaced by force on the diaphragm. Gas moves toward the flow control components and proper vacuum is maintained. While under vacuum, gas enters the rotameter where its flow is measured. Gas flow rate is controlled by a v-notch orifice and either manual or automatic positioning of the v-grooved plug in its ring. A differential regulating valve is located after the orifice which maintains the proper vacuum across the v-notch. A pressure-relief valve vents to the atmosphere if a malfunction occurs and pressure builds. Gas is then dissolved in the water stream at the injector. Check valves are in place and designed to close on injector shutdown. There are no lines carrying gas under pressure in this system. Loss of vacuum for any reason causes the vacuum-regulating valve to shut off the gas supply.\n\n\n\nThe facility also complies with the Occupational Safety and Health Process Safety Management rule. Management believes that the training of its employees and its contractors is crucial to maintaining a safe environment and continuing it's accident-free record for the chlorine system. Training of all employees consists of a general orientation of the chlorine system first. They are then instructed on the hazards and proper and safe handling of the chlorine system. The following courses are administered to all employees and refreshed yearly:\n\n\n\nGeneral Safety Training\n\nDEC Wastewater Operator Renewal Training Hazard Communication Training\n\nConfined Space Training\n\nRespiratory Protection Program Training Lock-out/Tag-out\n\nChlorine Tank Handling and Connections Hearing Protection Program\n\n"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011135,
      "SummaryText": "Personal Protective Equipment Program\n\n\n\nA record is kept of the training and placed in the training files. The record contains the employee or contractor name, title of course, date the course was held, name of the trainer, and results of any written, oral, or hands-on exam.\n\n\n\nAccidents are also prevented by good administrative controls. Standard Operating Procedures (SOPs) are kept on hand and are easily accessible to the workers. Each operator is trained in the applicable aspects of their job functions. Those operators whose work is involved with any aspect of the chlorine injection system are thoroughly trained in those specific SOPs. Workers who need to be inside the chlorine room are provided chlorine specific training.\n\n\n\nThe City of Oswego Water Treatment Plant maintains an Emergency Management Program. In the event of a chlorine leak, the operator will first notify the other employees by sounding a general alarm and then determine the location and magnitude of the leak. The magnitude is broken down to minor leaks; no yellowish gas is visibly present, and major leak; yellowish gas is visibly present. For a minor leak, two trained operators will don SCBAs and protective gear and using the ammonia and water vapor bottle, find where the leak is and rectify the situation. In the event of a major leak, the operator will call the Oswego Fire department immediately and then notify the other workers in the plant of the major chlorine leak. The operator will designate one location that is upwind from the chlorine leak for all personnel to assemble and remain until the fire department informs the operator otherwise. The superintendent will then be called and informed of the situation. The Oswego Fire Department will be in charge of the scene until they depart. The approximate response time is less than five minutes.\n\n\n\nEach member of the fire department is trained to at least HazMat Level I. Two members are trained to the Technician Level, and eleven members are trai"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011135,
      "SummaryText": "ned to the Specialist Level. The fire department has toured the plant to become familiar with what is on site, and develop different leak scenarios and practice emergency response measures. In June of 1996, a HazMat drill with the Fulton Fire Department HazMat Team was conducted. The HazMat Team was activated. The scenario staged was that a tank while being changed, started leaking. A full decon was set up. The entry personnel used the chlorine kit to stop the tank from leaking. A full critique was conducted, and everyone at the scene reviewed the site. On March 18, 1997, seven members of the HazMat Team conducted a drill at the treatment plant. This scenario was a leak in the feed line. The crew followed SOPs to fix the problem. In August and September 1997, all four fire department shifts conducted a mock drill of a worker overcome by chlorine while in a confined space. Monitoring equipment, rigging, and harnesses were used in the entry. The fire department also has a chlorine tank simulator that they practice using an \"A\" and a \"B\" chlorine tank repair kit on.  During September of 2007 there was drill utilizing the Oswego County Hazmat Response Team to address an injuried person during a chlorine leak incident.\n\n\n\nIn the attached Risk Management Plan, toxic worst case and toxic alternative release scenarios were examined. The scenarios were developed based on a two thousand pound tank filled with 99.5 percent chlorine. The quantity released was the full two thousand pounds at a release rate of two hundred pounds per minute for ten minutes. The meteorological factors were an atmospheric stability class of \"F\" and a wind speed of 1.5 meters per second. The topography is urban. The release is assumed to be at ground level. The toxic endpoint is 0.0087mg/L (3ppm). These airborne concentrations are the maximum airborne concentrations that most people can be exposed to for up to one hour without experiencing serious or irreversible effects or symptoms. The calculated d"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000011135,
      "SummaryText": "istance to endpoint is 1.3 miles.\n\n\n\nThe alternate release scenario for the chlorine injection system is one that is more likely to occur than the worst-case scenario that reaches an end point off-site. A chlorine leak caused by piping or valve failure is used in the alternative scenario. A hole diameter of 1/4 inch on the piping or valve could theoretically occur. The release rate for this scenario is 9 pounds per minute for 222.2 minutes. The meteorological conditions were atmospheric stability class of \"D\" and a wind speed of 3.0 meters per second. The topography is urban. Again the toxic endpoint is 0.0087 mg/L (3 ppm). The calculated distance to endpoint for the alternative scenario is 0.10 miles. Methodology for determining distance to endpoints was done by referencing Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\n\n\n\nThe chemical of concern at the Water Treatment Plant is chlorine. Chlorine can be toxic if not handled properly, however, the City of Oswego has a reasonable program in place to minimize the potential risks to a chlorine gas release. A training program combined with required record keeping, administrative controls, an effective emergency management program, a local HazMat team, and an alarm system all address and meet the needs of the applicable regulations as defined under 40 CFR 68 and 29 CFR 1910.119. The Water Treatment Plant is currently evaluating improvements to their safety program. They are investigating expanding the area that the chlorine sensors monitor along with visual, as well as audio alarms. They are also taking this opportunity to improve and expand their training programs, to make their employees further aware of the continued necessity for the safe use of chlorine.\n\n"
    }
  ]
}