{
  "FacilityID": 1000031816,
  "FacilityName": "Inergy Terminal",
  "FacilityStr1": "10523 East County Road 975 North",
  "FacilityStr2": null,
  "FacilityCity": "Seymour",
  "FacilityState": "IN",
  "FacilityZipCode": "47274",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18071",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "39.023056",
  "FacilityLongDecDegs": "-085.844917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Inergy Propane, LLC",
  "Company2Name": null,
  "CompanyDUNS": 54331868,
  "Company2DUNS": 0,
  "OperatorName": "Paul Lemert",
  "OperatorStr1": "3825 US 6 East",
  "OperatorStr2": null,
  "OperatorCity": "Waterloo",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46793",
  "OperatorZipCodeExt": "0490",
  "RMPContact": "Paul Lemert",
  "RMPTitle": "Safety Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167268",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-02-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-02-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-02-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 39.02306,
  "FRS_Long": -85.84492,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000038864,
      "AltID": null,
      "FacilityID": 1000031816,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000039226,
          "ProcessID": 1000038864,
          "NAICSCode": "454312",
          "_desc": {
            "NAICS_CODE": "454312",
            "NAICS_DESCRIPTION": "Liquefied Petroleum Gas (Bottled Gas) Dealers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000046688,
          "ProcessID": 1000038864,
          "ChemicalID": 98,
          "Quantity": 83504256.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000546688,
          "ProcessID": 1000038864,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000031816,
      "SummaryText": "General Executive Summary for Propane Storage and Distribution Facilities of Inergy Terminal, Seymour, IN.\n\n\n\n1.  Accidental Release Prevention and Emergency Response Policies.\n\nThe primary function of Inergy Terminal is to act as a propane distribution facility.  By virtue of the flammable effects associated with propane, it is necessary to observe certain safety precautions in handling propane to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as the health of our co-workers, and to reduce the threat to nearby members of the community.  We are strongly committed to employee, public and environmental safety.  Safety at our facility depends upon the manner in which we handle propane as well as on the various safety devices incorporated into the design of our equipment.  Furthermore, comprehensive training received by our employees adds to the inherent safety of our distribution facility.\n\n\n\nOur emergency response program is based upon the NPGA?s LP-Gas Safety Handbook, Guidelines for Developing Plant Emergency Procedures, How to Control LP-Gas Leaks and Fires, State and Local Regulations, and Company Policy.  In addition to the presence of appropriate controls to prevent possible release of propane, if a release does occur, our highly trained local emergency response personnel are at hand to control and contain the effects of the release.  We are also completely coordinated with Jackson County LEPC which provides additional emergency response expertise.\n\n\n\n2. The Stationary Source and the Regulated Substance Handled.\n\nThe primary purpose of this facility is to repackage and distribute propane to both retail and wholesale customers for use as a fuel.  Propane arrives at our facility via pipeline and transport and is stored in a 21,000,000 gallon underground cavern and (40) - 34,500 gallon storage tanks.  This facility has equipment for unloading transports and receiving propane from pipeline facilities and equipment to load"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000031816,
      "SummaryText": " transports and containers.  Access to this site is restricted to authorized facility employees, authorized management personnel and authorized contractors.\n\n \n\nThe regulated substance handled at this facility is propane.  The maximum amount of propane that can be stored at this plant is 83,504,256 lb., comprised of 78,355,200 lb. in underground storage and 5,149,056 in aboveground storage.\n\n\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including Administrative Controls and Mitigation Measures to Limit the Distances for each Reported Scenario.\n\nWe have calculated worst case release scenarios based on the EPA?s Guidance for Propane Storage Facilities Reference Tables or Equations energy method.  For alternative release scenario analyses, we have employed the equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios. \n\n\n\nThe worst case release scenario submitted for propane involves a catastrophic release from Propane Storage.  The scenario involves the release of 128,726 lbs. of propane.  The release quantity has been limited by 88 percent resulting from written procedural mechanisms.  It is assumed that the entire quantity is released as a vapor that finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather, the maximum distance of .4 miles was obtained corresponding to a flammable endpoint of 1 psi overpressure.\n\n\n\nThe alternative release scenario submitted for Program 2 and 3 flammable substances involves a release from Propane Storage resulting in a Vapor Cloud Explosion.  In this scenario 200lb. Of propane is released in 5 minutes.  Passive mitigation controls such as none are taken into account to calculate the scenario.  The release is also controlled by active mitigation measures that include excess flow valve(s).  Under neutral weather conditions, the maximum d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000031816,
      "SummaryText": "istance to the flammable endpoint of the lower flammability limit of 2.1% volume is, <0.1 miles.\n\n\n\n4.   The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps.   Our facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standards and State and Local Codes.\n\n\n\nThe following sections briefly describe the release prevention program that is in place at our stationary source.\n\n\n\nSafety Information\n\nInergy Terminal maintains a detailed record of written safety information, which describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.\n\n\n\nHazard Review\n\nHazard reviews focus on operating procedures, equipment functions and handling practices to identify possible hazards.  The studies are undertaken by a team of qualified personnel with extensive knowledge of facility operations.  Any findings related to the hazard reviews are addresses in a safe and timely manner.\n\n\n\nOperating Procedures\n\nFor the purpose of safely conducting activities within our covered processes, Inergy Terminal; maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and readily accessible to operations involved with the processes.\n\n\n\nTraining\n\nInergy Terminal has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on- the- job supervision until they are deemed competent to work independently.  \n\n\n\nMaintenan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000031816,
      "SummaryText": "ce\n\nInergy Terminal carries out maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with previous training in these practices.  Furthermore, personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nIncident Investigation\n\nInergy Terminal promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of propane.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\n\n\n5.  Five-year Accident History\n\nInergy Terminal has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\n6.  Emergency Response Plan\n\nInergy Terminal carries a written emergency response plan to deal with accidental releases of propane.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nOur facility?s emergency response plan is based upon the NPGA?s LP-Gas handbook, Guidelines for Developing Plant Emergency Response Procedures, How to Control LP-Gas Leaks and Fires, State and Local Codes, and company safety and operating procedures.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nJackson County is the Local emergency Planning Committee (LEPC) with which our emergency plan h"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000031816,
      "SummaryText": "as been coordinated and verified.\n\n\n\n7.  Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.   We will have a propane detection system installed by June 30, 2005 to detect below the LFL of propane.\n\n\n\n8.  Certification Statement\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\n\n\nName:  Andy Sandlin\n\nSignature:\n\nTitle Terminal Operator\n\nDate signed:  5/05/2005"
    }
  ]
}