{
  "FacilityID": 1000042559,
  "FacilityName": "Vertex Chemical Corporation Dupo, IL",
  "FacilityStr1": "3101 Carondelet Road",
  "FacilityStr2": null,
  "FacilityCity": "Dupo",
  "FacilityState": "IL",
  "FacilityZipCode": "62239",
  "Facility4DigitZipExt": "1176",
  "FacilityCountyFIPS": "17163",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "38.522580",
  "FacilityLongDecDegs": "-90.215014",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.vertexchemical.com",
  "FacilityEmailAddress": "vertexchemical@vertexchem.com",
  "FacilityDUNS": 115843724,
  "ParentCompanyName": "Hawkins, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 41199639,
  "Company2DUNS": 0,
  "OperatorName": "Vertex Chemical Corporation",
  "OperatorStr1": "3100 E Hennepin Ave",
  "OperatorStr2": null,
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55413",
  "OperatorZipCodeExt": "2922",
  "RMPContact": "Mike Donaldson",
  "RMPTitle": "HSE Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "62239VRTXEASTC",
  "EPAFacilityID": "100000060961",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-06 00:00:00",
  "SafetyInspectionBy": "DOT - FRA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-12 00:00:00",
  "ErrorReportDate": "2009-06-17 00:00:00",
  "ReceiptDate": "2014-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 1,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 1,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.52358,
  "FRS_Long": -90.21208,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "12",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052470,
      "AltID": "Bleach Handling",
      "FacilityID": 1000042559,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053376,
          "ProcessID": 1000052470,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063604,
          "ProcessID": 1000052470,
          "ChemicalID": 62,
          "Quantity": 1782000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000563604,
          "ProcessID": 1000052470,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042559,
      "SummaryText": "This facility is owned and operated by Vertex Chemical Corporation (based in Minneapolis, Minnesota) which is a subsidiary of Hawkins, Inc.  Vertex was purchased by Hawkins in 2011.  \n\n\n\nHISTORY:  Hawkins and Vertex are very similar in nature, both in how they started out, and chemicals handled.  Both started out as small family owned businesses (Hawkins started in 1938 and Vertex in 1949).  Both have a long history of manufacturing sodium hypochlorite and using chlorine - the one chemical regulated by RMP at this facility.  Both are active members in the Chlorine Institute and adhere to their guidelines.  The merging of these two companies has made both companies stronger as best practices are reviewed and the utilization of combined resources occur (employee knowledge, equipment, outside resources, etc.).  Hawkins/Vertex is now a publicly traded company.\n\n\n\nThe RMP regulated chemical at this facility is chlorine.  This facility handles other chemicals for use in the water treatment, pool treatment, pulp and paper industries, to name a few, but they are not regulated by RMP at this time.\n\n\n\nCHLORINE USE:  The only use of chlorine at this facility is in the manufacture of industrial bulk and household bottled sodium hypochlorite \"bleach\".  Chlorine is delivered in 90-ton railcars and is stored in said railcars until the product is piped directly into a batch tank for manufacturing.  The railcars meet DOT standards and are owned and maintained by the chlorine vendor.  The chlorine car is stored outside of the manufacturing building, the piping goes from the railcar into the manufacturing building and directly into the batch tank.  The distance from the railcar to the batch tank allows for 35 pounds of chlorine to be in the pipe.  \n\n\n\nPROCESS:  Sodium hydroxide is cut with water to the correct concentration and transferred from the sodium hydroxide storage tank into the batch tank.  The chlorine is then transferred to the batch tank where there is a chemical reaction "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042559,
      "SummaryText": "and the chlorine, water and sodium hydroxide changed into sodium hypochlorite.  The by-product is heat.  Non-contact cooling water and heat exchangers are used to keep the temperature down during the process.  Once the product has been changed into sodium hypochlorite, the product is filtered and moved out of the batch tanks into storage tanks. \n\n\n\nSAFETY DEVICES:  Vertex has several types of safety devices in place to prevent a release of chlorine.  There are five chlorine sensors (each side on the ground around the railcar and one on top of the car next to the unloading flex transfer line) around the railcar and one inside the building on the ground floor.  The sensors are calibrated monthly.  The chlorine unloading station has stairs and a platform for ease and safety to get to the chlorine valves quickly.  Automatic electric actuator valves are used on the unload line.  This system is tested daily to verify that the valve closes and opens fully. The chlorine sensors will signal a warning light in the manufacturing area if .5 ppm chlorine is detected.  An alarm will sound at 1 ppm and the automatic actuator valve will close the unloading valve if chlorine is detected.   Another safety device that Vertex uses is a sodium hypochlorite batch controller (Oxygen Reduction Potential (ORP) system). The chlorine content of the bleach is measured by the ORP utilizing silver and platinum electrodes immersed in the bleach solution.  The ORP unit monitors the temperature of the batch and will automatically set off an alarm when it reaches the set point millivolt.  The automatic electric actuator valve on the chlorine railcar will automatically shut off the flow of the chlorine to the batch if the set point is met.\n\n  \n\nSECURITY:  The manufacturing building is within a secured fenced perimeter and is restricted to approved personnel only.  There is a second fence around the chlorine unloading area to prevent anyone from tampering with the chlorine cars while they are being un"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042559,
      "SummaryText": "loaded.  The access to the chlorine unloading area from the manufacturing area is limited to the chemical operators and managers.  The doors into the area are alarmed if they are opened without the proper code being entered.\n\n\n\nEMERGENCY RESPONSE:  Vertex has a written emergency response plan that is reviewed regularly.  Vertex employees receive regularly scheduled safety and security training; participate in procedure review, hazard assessments and incident reviews.  A trained hazardous materials response team, made up of employees and managers at this site, participate in quarterly drills and annual exercises.  Vertex works closely with the Local Emergency Planning Committee (LEPC) and other local emergency responders (including local Fire, EMS and Police), regulatory bodies, businesses and neighbors to make sure everyone is prepared for an emergency at this location.  Annually we host a seminar at our facility, to which these organizations are invited and have attended for Hazmat education and facility tour.  Location and type of chemicals are discussed at that time.\n\n\n\nMANAGEMENT SYSTEM:  Vertex has implemented and maintains the elements of the Vertex Risk Management Program in its policies and procedures which makes up its management system.  Senior management leadership implements through these policies and procedures, participation, communications and resource commitment, continuous improvement of performance to control risks of any sort to the community that could be controlled by Vertex.  \n\n\n\nIt is Vertex policy to adhere to all applicable federal, state and local rules and regulations.  Vertex is committed to a secure and safe environment, which depends upon the manner in which we handle the covered chemical, the safety devices inherent in the design of this facility, the safe handling procedures that we use, and the training of our personnel.\n\n"
    }
  ]
}