{
  "FacilityID": 1000018677,
  "FacilityName": "Babcock & Wilcox (B&W) Conversion Services, LLC",
  "FacilityStr1": "5600 Hobbs Road (C-1100)",
  "FacilityStr2": "P.O. Box 399",
  "FacilityCity": "Kevil",
  "FacilityState": "KY",
  "FacilityZipCode": "42053",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21145",
  "LEPC": null,
  "FacilityLatDecDegs": "37.106338",
  "FacilityLongDecDegs": "-88.815864",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 831343814,
  "ParentCompanyName": "Babcock & Wilcox Technical Services Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 938356771,
  "Company2DUNS": 0,
  "OperatorName": "B&W Conversion Services, LLC",
  "OperatorStr1": "1020 Monarch Street, Suite 300",
  "OperatorStr2": null,
  "OperatorCity": "Lexington",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40513",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213468",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Department of Energy",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-12-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-12-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000023024,
      "AltID": "DUF6 Conversion Facility",
      "FacilityID": 1000018677,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000027270,
          "ProcessID": 1000023024,
          "ChemicalID": 55,
          "Quantity": 660000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059305,
          "ProcessID": 1000023024,
          "NAICSCode": "32518",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000018677,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-07-01 00:00:00",
    "ERTrainingDate": "2014-06-10 00:00:00",
    "CoordinatingAgencyName": "DOE Paducah Portsmouth Project Offi",
    "CoordinatingAgencyPhone": "2704416815",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018677,
      "SummaryText": "BWCS RMP Executive Summary\n\n\n\n1.0    Accidental Release Prevention and Emergency Response Policies at the Stationary Source\n\n\n\nBabcock & Wilcox Conversion Services, LLC (BWCS) is committed to conducting work in a manner that protects workers, the public, and the environment.  This commitment is demonstrated in the resources invested in safety throughout facility design, construction, operation and maintenance.  BWCS has developed detailed programs and procedures to effectively implement this commitment.  The programs and procedures systematically integrate safety, health, environmental protection and quality assurance into all levels of management and work practices.  \n\n\n\n2.0    Stationary Source and Regulated Substances Handled\n\n\n\nBWCS operates a Depleted Uranium Hexafluoride (DUF6) conversion facility for the U.S. Department of Energy (DOE) at the DOE Paducah site in Kevil Kentucky, to disposition DUF6 stored at the DOE site.  The facility employs a dry conversion process that utilizes a one-step fluidized bed unit to convert DUF6 to uranium oxide powder that is collected and packaged for reuse or disposal. This is accomplished by reacting DUF6 gas with steam and hydrogen that produces hydrofluoric acid as a saleable end product.   \n\n\n\nA byproduct of the DUF6 conversion process is the production of 55 wt% HF acid. A total maximum quantity of 660,000 pounds of HF acid (55 wt%) is temporarily staged on site in several tanks before transfer to tankers for offsite shipment.  This amount exceeds the threshold quantity specified in 40CFR68.   Further evaluation indicated that the Conversion Facility is subject to Program 1 requirements of 40CFR68.  HF acid (55 wt%) is the only chemical associated with the DUF6 Conversion Facility that exceeds the threshold quantities specified in 40CFR68.\n\n\n\n3.0    General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nBWCS has addressed identification and evaluation of potential accidents and associated preventi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018677,
      "SummaryText": "on and mitigation features in Documented Safety Analyses (DSA) documents prepared for and approved by the DOE.  BWCS has implemented the required controls through an extensive set of programs and procedures.  These programs and procedures also apply for the management of structures, systems, programs, and components that pertain to Risk Management Plan (RMP) covered process and related activities.\n\n\n\nAs part of the DSAs, process safety analyses have been conducted to identify potential hazards in the process and associated controls to prevent and mitigate releases.  These controls include passive barriers, active features, and operator actions.\n\n\n\nThe primary controls associated with the storage of HF acid (55 wt%) are the HF storage tanks.  These tanks are designed to contain the HF acid under all conditions including credible natural phenomena events.  A dike around each tank provides secondary containment for any leak.  HF vapor detectors and tank level sensors provide indication of a leak and should a leak occur, actuate valves to isolate the HF storage tanks.  Operators are required to monitor transfers from the HF storage tanks to the rail or truck tankers and stop the transfer should a leak occur during the transfer.  Installed pumps and piping can be used to immediately pump leaked material back to any of the HF storage tanks.\n\n\n\nIn addition to the aforementioned controls, BWCS also has programs to ensure safe and effective operations.  These programs include but are not limited to the following: Radioactive and Hazardous Waste Management; Industrial Safety, Initial Testing, In-Service Surveillance, and Maintenance; Fire Protection; Procedures and Training; Emergency Management; Configuration Management; Conduct of Operations; Unreviewed Safety Question; and Quality Assurance.\n\n\n\nOperating and maintenance procedures have been established and operators have been trained on routine evolutions as well as process startup, shutdown, maintenance and emergency oper"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018677,
      "SummaryText": "ations.  All work is performed in accordance with preapproved written procedures or work packages.\n\n\n\n\n\n4.0    The Five Year Accident History\n\n\n\nThere have been no releases of HF acid at the facility.\n\n\n\n5.0    The Emergency Response Program - \n\n\n\nBWCS has developed a written emergency plan to provide a comprehensive description of emergency preparedness and response to operational emergencies at the DUF6 Conversion Facility.  The plan flows down the applicable requirements of the United States Enrichment Corporation (USEC) Paducah Emergency Plan and describes the DUF6 Paducah Project emergency management program.   USEC is the lead organization responsible for managing the overall direction and control of emergency responses at the Paducah site.  BWCS is responsible for overall compliance of the program with applicable regulations and implementation of the USEC plan, while ensuring DOE requirements are met. \n\n\n\nThis program has been established to manage and respond in a consistent and integrated way to accidents or other emergency situations that may occur at the site. The structure of this program is intended to ensure that the consequences of emergencies are promptly mitigated and that the health and safety of the public, personnel on the surrounding DOE reservation, plant personnel, and environment are protected, regardless of the cause or nature of the emergency.  The Emergency Management organization is responsible for maintaining and updating the Emergency Plan as appropriate.\n\n\n\nThe emergency plan describes the emergency response structure and roles and responsibilities prior to, during, and after an emergency.  The plan describes the actions during an emergency which include the following: Declaration of an emergency, Activation of the Emergency Operation Center (EOC), emergency response, reentry, and event termination.  Upon notification of an event, the field Emergency Response Organization (ERO) is activated for response to the scene and mitigation of the inc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018677,
      "SummaryText": "ident.   Emergencies are classified through a site-wide standardized system that uses Emergency Action Levels (EALs) as criteria for equating an incident to a specific emergency classification level.  Using the specific criteria outlined in the EALs, the Plant Shift Superintendent (PSS) determines the level of response required and determines if the event meets the proper criteria to classify the event as an Alert or a Site Area Emergency (SAE). Upon determination of event classification, the Incident Commander (IC) makes notifications to off-site agencies and activates the EOC Cadre.  \n\n\n\nEmergency response facilities have been pre-designated and equipped for use in an emergency. In some instances, emergency response facilities are continuously staffed, performing \"routine\" response-related activities, such as handling requests for ambulances or dispatching protective force personnel. Dedicated facilities are immediately available to support emergency operations upon arrival of staff.  A non-dedicated facility has procedures in place to convert it into the appropriate configuration to support emergency response activities in a timely manner.\n\n\n\nPrompt notification of on-site personnel, emergency responders, and off-site organizations and agencies is critical during an emergency event. The USEC PSS is responsible for notifying the ERO using the plant radio system, pagers, Public Address (PA) system and/or the plant telephone system.\n\n\n\nThe severity of some emergencies onsite may warrant the use of off-site individuals, organizations, and agencies. As a result, agreements with off-site support agencies have been developed and are maintained by USEC.  USEC Emergency Management is the primary interface with off-site Federal, State, and local emergency response agencies and organizations.  These support services include medical assistance, fire control, evacuation, law enforcement and ambulance services. \n\n\n\nDuring emergencies, the USEC PSS, (or designee), or Crisis Man"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018677,
      "SummaryText": "ager (CM) must determine the best initial protective actions to limit exposure of on-site and off-site personnel to potential or actual threats. Specific procedures have been developed for the protection of on-site and off-site personnel.  Protective actions for on-site personnel include alerting, assembly/accountability, sheltering in place, evacuation, monitoring, and decontamination.\n\n\n\nUSEC maintains medical coverage consistent with the activities being conducted onsite.  In an emergency, off-duty medical personnel are notified and directed to required locations, if needed.\n\n\n\nUSEC maintains and updates the  Emergency Public Information (EPI) Plan. The purpose of the Paducah EPI Plan is to establish a basis for providing timely, accurate, and relevant information to personnel and the public who may be affected by an emergency at the site.\n\n\n\nWhen corrective and protective actions have established an effective control over the situation, and emergency conditions no longer exist, the emergency response shifts into the recovery phase. It is the responsibility of the USEC CM to determine when the recovery phase of the emergency can be initiated.\n\n\n\nThe USEC Emergency Management Manager is responsible for administering the Emergency Management training program for EOC cadre personnel and Joint Public Information Center (JPIC) personnel.  Course modules have been developed to ensure personnel functioning in these roles receive adequate training.  All BWCS personnel who are involved in emergency planning possess experience or a combination of experience, training, and education commensurate to their job assignment. Management for each individual's training plan for continuing professional development identifies any required additional technical course requirements.\n\n\n\nUSEC manages the Emergency Management Drill and Exercise Program at the Paducah site. Drills and exercises are conducted to develop, maintain, and test the response capabilities of emergency personnel, fa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000018677,
      "SummaryText": "cilities, equipment, procedures, and training. BWCS performs small limited scope drills for the BWCS managed areas/buildings.  The USEC Drill and Exercise committee plan and conduct biennial exercises.  An exercise tests the integrated capability of all or most of the basic elements existing within the emergency plan and procedures. Exercises use scenarios that are wider in scope than drills and may involve off-site response personnel and agencies. \n\n\n\nUSEC Emergency Management is responsible for maintaining and updating the USEC Emergency Plan as appropriate. The BWCS Safeguards and Security/Emergency Preparedness Manager is responsible for maintaining the BWCS Emergency Plan and program. \n\n\n\n6.0    Planned Changes to Improve Safety    \n\n\n\nBWCS utilizes a variety of feedback and continuous improvement methods to evaluate on an ongoing basis the adequacy and effectiveness of the Conversion Facility programs, processes and procedures to assure continuous improvement.  Data is collected at the program and task levels.\n\n\n\nBWCS management systems for feedback and continuous improvement include; assessments, subcontract submittals, and reporting protocols. These management systems provide ongoing evaluation of both BWCS and subcontractor performance to assure conformance to specified requirements and effective implementation. Examples of these systems include self assessments and independent assessments to provide ongoing, formal feedback. Issues identified from assessments are documented, causal analyses are performed, and corrective actions developed and tracked to closure. Analyses are conducted on a regular basis to identify trends for management action. Data from these processes are evaluated by senior management to identify opportunities for improvement. \n\n\n\n"
    }
  ]
}