{
  "FacilityID": 1000084821,
  "FacilityName": "Chemsolv Rock Hill Facility",
  "FacilityStr1": "120 East Mt Gallant Road",
  "FacilityStr2": null,
  "FacilityCity": "Rock Hill",
  "FacilityState": "SC",
  "FacilityZipCode": "29730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45091",
  "LEPC": "York County LEPC",
  "FacilityLatDecDegs": "34.9486138",
  "FacilityLongDecDegs": "-80.9862555",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 98448251,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Glenn Austin",
  "OperatorStr1": "1140 Industry Avenue, SE",
  "OperatorStr2": null,
  "OperatorCity": "Roanoke",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24013",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227373",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-11-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105971,
      "AltID": "Aqua Ammonia",
      "FacilityID": 1000084821,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132715,
          "ProcessID": 1000105971,
          "ChemicalID": 57,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000107243,
          "ProcessID": 1000105971,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000066060,
              "Process_NAICS_ID": 1000107243,
              "SafetyReviewDate": "2020-01-11 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2019-08-13 00:00:00",
              "ChangeCompletionDate": "2019-08-20 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "per shift tank inspection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-07-12 00:00:00",
              "TrainingReviewDate": "2019-06-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-08-05 00:00:00",
              "EquipmentInspectionDate": "2019-10-17 00:00:00",
              "EquipmentTested": "Forklifts",
              "ComplianceAuditDate": "2017-09-29 00:00:00",
              "AuditCompletionDate": "2017-09-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2019-07-11 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000066848,
                  "PreventionProgram2ID": 1000066060,
                  "ProcessChemicalID": 1000132715
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084821,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-06-20 00:00:00",
    "ERTrainingDate": "2019-11-20 00:00:00",
    "CoordinatingAgencyName": "Rock Hill Fire Department",
    "CoordinatingAgencyPhone": "8033297220",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084821,
      "SummaryText": "Section 112(r) of the Clean Air Act (CAA) requires the United States Environmental Protection Agency (EPA) to publish rules and guidance for the prevention of chemical accidents.\n\nThe EPA issued a mandate requiring facilities handling, storing, manufacturing or using certain toxic or flammable substances listed in Title 40 of the Code of Federal Regulations (CFR), Part 68 to develop and implement a Risk Management Program.\n\n\n\nThis regulation, \"Chemical Accident Prevention Provisions\" applies to a wide variety of facilities that handle, manufacture, store or use toxic substances, including Ammonia (Aqua Ammonia). \n\n\n\nThe objective of the Risk Management Program is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to lessen the severity of releases that do occur.\n\n\n\nIn general, the regulation requires:\n\n>    Covered facilities to develop and implement a Risk Management Plan (RMP) and to maintain documentation of the program at the site. The RMP includes an analysis of potential off-site consequences of an accidental release, five-year accident history, a release prevention program and an emergency response program.\n\n>    Covered facilities must also submit the RMP, which includes registration information, to the EPA no later than June 21, 1999, or the date on which the facility first has more than a threshold quantity in a process, whichever, is later. The RMP provides a summary of the Risk Management Program and will be available to federal, state and local government agencies and the public for emergency planning.\n\n>    Covered facilities also must continue to implement the Risk Management Program and update their RMPs every five years or when processes change, as required by the rule.\n\n \n\nGeneral Provisions\n\nFacility Evaluation to Identify Covered Process\n\n\n\nChemsolv Inc. operates multiple distribution facilities that either store or package chemicals. Each of these facilities, as the RMP"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084821,
      "SummaryText": " rule is written, is a covered stationary source.\n\nTo determine applicability to the rule, the following was applied:\n\n>    Determine if each facility is a stationary source;\n\n>    Review the list of regulated substances that may be at each facility;\n\n>    Define each of the processes for the regulated substances to determine their applicability to the rule; and\n\n>    Review the inventory for any of the regulated substances that may be above the threshold quantity in a process.\n\n\n\nEach facility owned and operated by Chemsolv Inc. is a stationary source and uses and/or handles one or more of the regulated substances in a process. The Rock Hill facility has one of the listed substances in a regulated process above the threshold quantity:\n\n\n\nAqueous Ammonia, >20%   \n\nRMP Threshold Quantity = 20,000 lbs. \n\nNCAIS Code: 42469\n\n\n\nProgram Levels\n\n\n\nThe RMP imposes different requirements based on the potential for public impacts and the level of effort needed to prevent accidents involving the regulated substances.\n\n\n\nThe EPA has set three program levels:\n\n\n\nProgram Level 1:     No public receptors within the distance to the toxic endpoint from a worst-case release and no accidents with specific off-site consequences within the past five years.\n\nProgram Level 2:     Process not eligible for Program 1 or subject to Program 3.\n\nProgram Level 3:     Processes not eligible for Program 1 and either subject to OSHA's Process Safety Management Standard (PSM) under federal or state OSHA program or in ten North American Industry Classification System (NAICS).\n\n\n\nProgram Level 2 is applicable to this facility for Aqueous Ammonia. Program 3 is not applicable because the process operation is not covered by the PSM rule or within the ten listed NAICS codes. Program 1 is not applicable because the facility is located in an area where a worst case release of a regulated substance would impact a public receptor off-site. In this case, the receptor is identified as neighboring commercial businesses.\n\n\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084821,
      "SummaryText": "\n\nProcesses\n\nUnder the RMP rule, a process is defined as any activity involving a regulated substance including:\n\n\n\n>    Use\n\n>    Storage\n\n>    Manufacturing\n\n>    Handling\n\n>    On-site movement\n\n>    Or any combination of these activities\n\n\n\nA regulated process is defined as any group of vessels that are interconnected, or separate vessels that are located such that a regulated substance could be involved in a potential release. A vessel is defined as a blend or storage tank, pipe, hose, drum, tote, tanker or railcar when uncoupled from the motive power.\n\n\n\nAn example of a regulated process would be storage of Aqua Ammonia, with a concentration of greater than 20%, in an aboveground storage tank containing 22,500 pounds of the regulated substance. The threshold is 20,000 pounds and therefore, exceeds the threshold by 2,500 pounds.\n\n\n\nThe regulated process at the Rock Hill facility includes on-site movement of Aqua Ammonia, 29.4%.  This process requires a worst case and alternate scenario consequence analysis to determine the impact to off-site receptors. The analysis involves the development of scenarios depicting a release from a vessel or several vessels in a group to determine the extent of impact to the public.\n\n\n\nA worst case scenario involving ammonia is considered to be the entire release of the contents from a tote at night, during the summer, with stable atmospheric conditions. The gas would extend to a distance of 0.1 miles (the toxic endpoint), disperse slowly because of low wind conditions and potentially impact an approximate number of persons in the area surrounding the release.\n\n\n\nThere were two total scenarios developed for the facility to comply with the RMP: worst case and alternate.\n\n\n\nFive-Year Accident History\n\nThere is no accident history to report for this facility.\n\n\n\n\n\nAccidental Release Prevention Program\n\nProgram 2 requires a prevention program that establishes a systematic approach to compliance. The Chemsolv Rock Hill facility implements an accident pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084821,
      "SummaryText": "evention program consisting of seven elements, as required in 40CFR Part 68Subpart C. A brief summary is provided below and covered in more detail within the individual Plan chapters.\n\n\n\n1)  Safety. Ensures availability of current Material Safety Data Sheets (MSDS), provides for appropriate equipment inventory/specifications and ensures adherence to proper up-to-date codes/standards for the covered process. (40CFR68.48)\n\nMost Recent Review Date: 01/11/2020 \n\n\n\n2) Hazard Review. Includes the identification of process hazards, the identification of opportunities for malfunctions or human errors leading to an accidental release, the identification of controls needed to allay the aforementioned opportunities for error and identification of the steps to detect or monitor releases. (40CFR68.50)\n\nMost Recent Review Date: 08/13/2019\n\n\n\n3) Operating Procedures. Clear, written procedures for safely conducting activities associated with the covered process. (40CFR68.52)\n\nMost Recent Review Date: 07/12/2019\n\n\n\n4) Training. All employees operating the covered process must be trained and tested competent in the operating procedures, including refresher training at least every three years. (40CFR68.54)\n\nMost Recent Review Date: 06/16/2019 \n\n\n\n5) Maintenance. To ensure on-going mechanical integrity of process equipment, including training to perform the required maintenance and implementation of regular equipment inspections. (40CFR68.56)\n\nMost Recent Review Date: 08/05/2019 \n\n\n\n6) Compliance Audits. Evaluate compliance with regulations for RMP every three years, report audit findings and document appropriate response to the audit findings. (40CFR68.58)\n\nMost Recent Audit Date: NA - never exceeded threshold to implement RMP. RMP in place prior to if plant exceeds aqua ammonia threshold in the future. \n\n\n\n7) Incident Investigations. Promptly investigate each release incident (within 48 hours), prepare an incident summary, address findings/recommendations and review all with affected"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084821,
      "SummaryText": " personnel. (40CFR68.60)\n\nMost Recent Review Date: Not applicable - no incidents at this facility to report.\n\n\n\nEmergency Response Program\n\n\n\nThe Chemsolv Rock Hill facility adheres to a detailed emergency response program (Chapter 10), as required for a Program 2 Process (40CFR68.180). The emergency response program consists of an emergency response plan, emergency response equipment procedures, employee training and procedures to ensure the program is up-to-date. The program is designated for employees who will respond to releases involving regulated substances. The emergency response program also includes contact information for informing the public and local emergency response agencies about accidental releases.\n\nIn addition to Chapter 10 in this Plan, an emergency response plan is included in the manual titled Sara Title III, Community Awareness and Emergency Response. The document is available at each Chemsolv facility to provide guidance in the event of an emergency and as a training tool to prepare employees and the public in the event of an incident.\n\nMost Recent Plan/Plan Review Date: 01/13/2020\n\n\n\nProgram Implementation Responsibility\n\n\n\nManagement's commitment to process safety is a critical element of our risk management program. This commitment does not end with the information provided in this manual or at the conclusion of training. Each and every employee must remain committed to the program elements with effective implementation into our daily operations. This commitment with management oversight must be a continual process.\n\n\n\nBy following these implementation rules we are ensuring that:\n\n>    The Risk Management Program elements are integrated and implemented on an ongoing basis; and\n\n>    All groups within our organization understand the levels of responsibility and communication.\n\n\n\nThe chart on the following page is intended to define the levels of responsibility for the Risk Management Program to ensure:\n\n>    Effective communication about process cha"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000084821,
      "SummaryText": "nges within our organization;\n\n>    Clarification of the roles and responsibilities related to process safety issues at the facility;\n\n>    Elimination of conflict between individuals responsible for implementing the risk management program; and\n\n>    Program elements are integrated into an ongoing approach to identifying hazards and managing risk.\n\n\n\nAll personnel positions identified in the chart will report their progress and issues associated with risk management to the next level of management and ultimately to the General Manager who has overall responsibility for performance of the program.\n\n\n\nPresident      \n\n\n\nPosition\n\n-Coordinates development of operating procedures.\n\n\n\nPrimary Responsibility \n\n-Oversight of facility management activities. \n\n-Verifies training effectiveness through the Regulatory Affairs Manager\n\n-Distribution of process safety information. \n\n-Delegating responsibility for process hazard analysis and incident investigations. \n\n-Oversight for change management and pre-startup procedures.       \n\n\n\nChanges\n\n-New equipment -New process parameters \n\n-New procedures -Process changes -Maintenance procedures \n\n-New regulatory requirements            \n\n\n\nCommunication of Change \n\n-Notify Regulatory Affairs Manager\n\n-Notify Plant Manager -Notify maintenance\n\n\n\nRegulatory Affairs Manager           \n\n\n\nPosition\n\n-Responsible for the implementation of all phases of the risk management program. -Ensures training program implementation. \n\n\n\nPrimary Responsibility \n\n-Verifies information provided by the Plant Manager related to RMP activities. \n\n-Inform General Manager of required maintenance.\n\n-Conducts compliance audits. \n\n\n\nChanges\n\n-New equipment -New process parameters \n\n-New procedures -Process changes                                      \n\n\n\nCommunication of Change \n\n-Notify Plant Manager -Notify facility maintenance department or contractor\n\n\n\nPlant Manager           \n\n\n\nPosition\n\n-Oversee operator-training program.\n\n\n\nPrimary Responsibility \n\n-Coordinat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000084821,
      "SummaryText": "e contractor activity.\n\n-Inform Regulatory Affairs Manager of\n\nrequired maintenance.\n\n-Exercise emergency response activities and train responders.\n\n-Maintain ER equipment.\n\n-Select participants in incident investigation.\n\n-Manage facility documents.  \n\nChanges\n\n-New equipment -New process parameters \n\n-New procedures -Process changes                                      \n\nCommunication of Change \n\n-Notify facility personnel\n\n\n\nMaintenance Supervisor       \n\n\n\nPosition \n\n-Implement maintenance schedules. \n\n\n\nPrimary Responsibility \n\n-Document maintenance activities. \n\n-Revise schedules as necessary.\n\n-Inform facility of schedule changes.            \n\n\n\nChanges\n\n-New equipment -New process parameters \n\n-New procedures -Process changes                                      \n\n\n\nCommunication of Change \n\n-Notify Plant Manager\n\n"
    }
  ]
}