{
  "FacilityID": 1000008473,
  "FacilityName": "Land Application System",
  "FacilityStr1": "2101 Riverbend Rd",
  "FacilityStr2": null,
  "FacilityCity": "Dalton",
  "FacilityState": "GA",
  "FacilityZipCode": "30722",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13313",
  "LEPC": null,
  "FacilityLatDecDegs": "34.7092744",
  "FacilityLongDecDegs": "-84.9364096",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dalton Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dalton Utilities",
  "OperatorStr1": "1200 V. D. Parrott Jr Parkway",
  "OperatorStr2": "PO Box 869",
  "OperatorCity": "Dalton",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30722",
  "OperatorZipCodeExt": "0869",
  "RMPContact": null,
  "RMPTitle": " Regulatory Compliance Manager",
  "FTE": 31,
  "OtherEPAFacilityID": "GA02-056",
  "EPAFacilityID": "100000175428",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.70283,
  "FRS_Long": -84.93378,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009760,
      "AltID": "LAS Chlorination",
      "FacilityID": 1000008473,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010080,
          "ProcessID": 1000009760,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011070,
          "ProcessID": 1000009760,
          "ChemicalID": 62,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511070,
          "ProcessID": 1000009760,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008473,
      "SummaryText": "Dalton UtilitiesA? Risk Management Plan for Safe Chlorine Handling at the Land Applica-tion System (LAS) involves a unified approach that integrates technologies, procedures, and management practices to monitor potential chlorine hazards and minimize the risk of accidental chlorine releases.  All applicable procedures of 40 CFR 68.170 are addressed in the plan, which seeks to provide for employee safety, public health, and response agency interaction.\n\nThe Dalton Utilities Land Application System (LAS) is contained within a 9,200-acre site bounded on three sides by the Conasauga River.  The site is fenced and public access is controlled.  The site consists of primarily forested land and most of the bordering prop-erty is also forested; much of it in commercial timber production.  \n\nThe LAS utilizes chlorine to disinfect treated effluent from its three wastewater treatment plants prior to land application.  The chlorine is introduced at Pump Stations B and C.  These pump stations have similar configurations and pump the disinfected wastewater out to the individual spray fields via a pipeline distribution system for spray irrigation. The chlorination process is identical at Pump Stations B and C and includes chlorine cyl-inders, chlorination equipment, electrical equipment, and process specific safety equip-ment.  Chlorination for disinfection of treated wastewater is not part of the SIC codes listed by EPA in 68.10(d), and the municipal facility is not subject to OSHA Process Safety Management (PSM) requirements.  Consequently, this qualifies the LAS chlorina-tion process as a Program 2 process.\n\nFor each chlorination process, accidental release modeling was performed for the respec-tive area to determine potential consequences associated with operating failures resulting in an accidental chlorine release.  The first A?worst caseA? scenario, defined by EPA, states that A?the owner or operator shall assume that the A? maximum quantity in the largest ves-sel A? is rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008473,
      "SummaryText": "ased as a gas over 10 minutes.A?  The A?alternative scenarioA? is defined as A?more likely to occur than the worst-case release scenarioA?.  The chlorination process be-gan onsite in 2001. To date, there have been no accidents at these facilities, and therefore, an incident history review was not applicable.  However, valuable experience in chlorine handling and use at our water treatment plants has been applied to these facilities.\n\nIn each accidental release modeling case, atmospheric dispersion modeling was per-formed with the use of RMP*COMP software to determine the distance traveled by the chlorine released before its concentration decreased to a theoretical A?no effect levelA?.  This is defined by the American Industrial Hygiene Association as A?the maximum air-borne concentration below which it is believed that nearly all individuals could be ex-posed for up to one hour without experiencing or developing life-threatening health ef-fects.A?  The residential population within a perimeter corresponding to the no effect level distance was defined to estimate the population potentially affected.\n\nThe worst case release scenarios were determined for each of the two pump stations.  Though unlikely, the worst case release scenario would possibly result from a 2,000 pound loss of liquid chlorine due to the failure of a faulty packing nut on the cylinder valve stem assembly.  For each pump station, a no effect distance of 3.0 miles was ob-tained for the described worst case release scenario.    \n\nThe alternative release (more likely) scenario for the chlorination process at each pump station involves the mechanical failure of one flexible manifold connection (pigtail) al-lowing an accidental release from one ton cylinder of chlorine over a ten minute period, at which time the failure is repaired.  Under these conditions, similar atmospheric model-ing was performed with the RMP*COMP software.  For each pump station, a release ra-dius of less than 0.2 miles was obtained"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008473,
      "SummaryText": ".  Within this radius, any impact to residential population is highly improbable due to the lack of any nearby residents. \n\nThe Dalton UtilitiesA? Risk Management Program includes Emergency Response Proce-dures in Appendix A is supported by the following key elements to mitigate the effects of potential chlorine release hazards:\nA?    Operator training,\nA?    Preventive maintenance program,\nA?    Process specific safety equipment,\nA?    Safe and effective standard operating procedures, and\nA?    Hazard review of equipment and procedures.\n\nFurther, Dalton Utilities has an active environmental, health and safety program (see En-vironmental, Health and Safety Standard Operating Procedure) with the following ele-ments specifically supporting the safe handling of chlorine and the chlorination process:\nA?    Safe Work Multi-Permitting,\nA?    Line and Equipment Opening,\nA?    Lock Out/Tag Out System,\nA?    Auditing and Inspection Program, \nA?    Chemical Right to Know Program,\nA?    Respiratory Protection (SCBA) Program,\nA?    Personal Protective Equipment Program,\nA?    Emergency Medical Response,\nA?    CPR/First Aid,\nA?    Emergency Organization, and\nA?    Incident Reporting and Investigation.\n\nThe LAS pump station chlorination system has been reviewed with the Whitfield County Fire Department, Whitfield County Local Emergency Planning Committee (LEPC), and our HAZWOPER contractor, Remtech Engineers (1-800-377-3648).  This review in-cluded a facility tour, overview of training program, and a discussion about release re-sponse.\n\nDalton Utilities takes a proactive approach to risk management and emergency response through information sharing sessions between Dalton Utilities' employees, our HAZ-WOPER qualified emergency response contractor and local response agencies.  These preventative measures provide for the continuous improvement of communications and maintain effective procedures for the safe handling of and timely emergency response to potential chlorine hazards.\n"
    }
  ]
}