{
  "FacilityID": 1000092948,
  "FacilityName": "Air Products, Granite City, IL",
  "FacilityStr1": "2200 Monroe Street",
  "FacilityStr2": null,
  "FacilityCity": "Granite City",
  "FacilityState": "IL",
  "FacilityZipCode": "62040",
  "Facility4DigitZipExt": "0695",
  "FacilityCountyFIPS": "17119",
  "LEPC": "Madison County Emer Mgt Agency",
  "FacilityLatDecDegs": "38.699722",
  "FacilityLongDecDegs": "-090.138889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "AB",
  "FacilityURL": "www.airproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6306922,
  "ParentCompanyName": "Air Products and Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 3001070,
  "Company2DUNS": 3001070,
  "OperatorName": "Air Products Manufacturing Corp.",
  "OperatorStr1": "2200 Monroe Street",
  "OperatorStr2": null,
  "OperatorCity": "Granite City",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62040",
  "OperatorZipCodeExt": "0695",
  "RMPContact": "Alex Harting",
  "RMPTitle": "Site Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "62040RPRDC2200",
  "EPAFacilityID": "100000009796",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-06-26 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.6998,
  "FRS_Long": -90.13885,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115369,
      "AltID": "LH2 Storage and Blending",
      "FacilityID": 1000092948,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116802,
          "ProcessID": 1000115369,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144231,
          "ProcessID": 1000115369,
          "ChemicalID": 149,
          "Quantity": 18446.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644231,
          "ProcessID": 1000115369,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092948,
      "SummaryText": "Executive Summary\n\n\n\n\n\nAir Products and Chemicals, Inc.\n\nGranite City, Illinois Facility\n\n\n\n\n\n1.  Accidental release prevention and emergency response policies:\n\n\n\nThis facility is predominantly an air separation plant manufacturing nitrogen, oxygen and argon through the liquefaction and distillation of air. These gases are for use by the adjacent steel mill and for the merchant market.  Annealing gas (a blend of nitrogen and hydrogen) is also produced for use by the steel mill. The hydrogen is stored onsite in liquid form.  Hydrogen, in the amounts handled by our facility, exceeds the threshold quantity set by EPA.  It is our policy to adhere to all applicable Federal and state rules and regulations.  Air Products manages the safety of the regulated process by means of operating procedures, equipment testing and inspections, safety devices (e.g., alarms, shutdowns, instrumentation, relief devices) inherent in the design of this facility and other controls and systems designed to prevent accidental release of hazardous chemicals.  Safe work practices and training of our personnel supplement the inherent safe design of the plant.\n\n\n\nOur emergency response program is based upon OSHA's HAZWOPER regulation.  The emergency response plan includes procedures for the notification of the local fire authority and Hazardous Materials unit so that appropriate measures can be taken by local responders to control accidental releases.\n\n\n\nThis document has been prepared in accordance with the EPA's Risk Management Plan regulation (40 CFR, Part 68).  The substances and processes considered during the preparation of this RMP and the scenarios described were selected based on criteria established in the regulation.\n\n\n\n2.  The stationary source and regulated substances handled:\n\n\n\nThe primary purpose of this facility is to manufacture industrial gases for the steel mill and merchant market.  Annealing gas is produced for the steel mill by blending together nitrogen and hydrogen gas.  T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092948,
      "SummaryText": "he hydrogen is supplied from a liquid hydrogen storage system consisting of a 20,000 gallon liquid hydrogen tank, a 9,000 gallon liquid hydrogen storage tank, a bank of ambient air vaporizers, and a blending skid.  The liquid hydrogen is delivered to our site by tank truck, and the annealing gas blend is delivered to our customer by pipeline.  Hydrogen tube trailers (for the merchant market) are filled at this facility by pumping and vaporizing the liquid.\n\n\n\nThe regulated process at this facility is the liquid hydrogen storage system and associated gaseous hydrogen equipment and piping.  Hydrogen is the only  regulated substance handled at this facility in an amount exceeding the threshold quantity.  The maximum amount of hydrogen at this facility is 18,446 pounds.\n\n\n\n3.  The general accidental release prevention program and specific prevention steps:\n\n\n\nThe facility developed prevention program elements based on the Federal EPA's Accidental Release Prevention Plan and OSHAA?s Process Safety Management (PSM) regulation.  This facility was designed and constructed to comply with applicable state and industry codes.\n\n\n\n4.  Five-year accident history:\n\n\n\nThe 20,000 gallon liquid hydrogen tank was installed in April, 1996.  In the last five years there have been no accidents involving, or accidental releases of, flammable gas that resulted in any deaths, injuries, or significant property damage on site; or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\n5.  The emergency response program:\n\n\n\nThe facility's emergency response program is based upon OSHA's HAZWOPER standard.  At this site, employees are trained to recognize emergencies and initiate emergency response from outside agencies.  They have been trained to OSHA's First Responder Awareness Level.  The employees receive annual refresher training in their role in the emergency plan.  Emergency response activities have also been coordinated with the Gra"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092948,
      "SummaryText": "nite City Fire Department for fires related to the flammable process.  Periodic drills are conducted to review the effectiveness of our emergency procedures.  \n\n\n\n6.    Planned changes to improve safety:\n\n\n\nThe facility resolves recommendations from PHAs and incident investigations, some of which may result in modifications to the plant design and operating procedures."
    }
  ]
}