{
  "FacilityID": 1000043571,
  "FacilityName": "Jarden Zinc Products",
  "FacilityStr1": "2500 Old Stage Road",
  "FacilityStr2": "P.O. Box 1890",
  "FacilityCity": "Greeneville",
  "FacilityState": "TN",
  "FacilityZipCode": "37744",
  "Facility4DigitZipExt": "1890",
  "FacilityCountyFIPS": "47059",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "36.195556",
  "FacilityLongDecDegs": "-082.742222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.jarden.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 53983862,
  "ParentCompanyName": "Jarden Corporation",
  "Company2Name": null,
  "CompanyDUNS": 801875980,
  "Company2DUNS": 0,
  "OperatorName": "Thomas J. Wennogle",
  "OperatorStr1": "2500 Old Stage Road",
  "OperatorStr2": "P.O. Box 1890",
  "OperatorCity": "Greeneville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37744",
  "OperatorZipCodeExt": "1890",
  "RMPContact": "Jeffery Winters",
  "RMPTitle": "Director EHS Regulatory Compliance",
  "FTE": 205,
  "OtherEPAFacilityID": "TND053983862",
  "EPAFacilityID": "100000039362",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.19556,
  "FRS_Long": -82.74361,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053794,
      "AltID": "Chlorine Rail System",
      "FacilityID": 1000043571,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054578,
          "ProcessID": 1000053794,
          "NAICSCode": "33149",
          "_desc": {
            "NAICS_CODE": "33149",
            "NAICS_DESCRIPTION": "Nonferrous Metal (except Copper and Aluminum) Rolling, Drawing, Extruding, and Alloying"
          }
        },
        {
          "Process_NAICS_ID": 1000054579,
          "ProcessID": 1000053794,
          "NAICSCode": "332813",
          "_desc": {
            "NAICS_CODE": "332813",
            "NAICS_DESCRIPTION": "Electroplating, Plating, Polishing, Anodizing, and Coloring"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065470,
          "ProcessID": 1000053794,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565470,
          "ProcessID": 1000053794,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043571,
      "SummaryText": "Jarden Zinc Products\n\nRisk Management Program\n\nGeneral Executive Summary\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies. Jarden Zinc Products is strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled. We have one (1) regulated substances present at our facility.  This substance is Chlorine.  The regulated substance at our facility is involved in a single use.  Chlorine is used for wastewater treatment.\n\nThe maximum inventory of Chlorine at our facility is 360,000 pounds.\n\n\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario. To perform the required offsite consequence analysis for our facility, we have used the calculations derived from the RMP*Comp software program supplied by EPA.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case release scenario submitted for Program 3 toxic substances as a class involves a catastrophic release from Chlorine Storage.  The scenario involves the release of 180,000 lbs of Chlorine in a gaseous form over 10 minutes.  Under Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of >25 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L.\n\n\n\nOne or more alternative release scenarios have been submitted for each toxic substance present in Program 3 processes cumulatively.\n\n\n\nOne alternative release scenario for Chlorine involves a release from Rail Car Station #1 or #2 in the Chlorine Storage proc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043571,
      "SummaryText": "ess.  The scenario involves the release of (30) pounds of Chlorine in a gaseous form over 0.2 minutes.  Under class D weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L is 0.2 miles.\n\n\n\n4.  The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps. Our facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.\n\nThe following sections briefly describe the elements of our release prevention program that are in place at our stationary source.\n\n\n\nProcess Safety Information\n\n\n\nJarden Zinc Products maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\n\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is \"What-if\" Analysis. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at least every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nFor the purposes of safely conducting activities within our covered processes, Jarden Zinc Products maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a shutdown.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\n\n\nTraining\n\n\n\nJarden Zinc "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043571,
      "SummaryText": "Products has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity\n\n\n\nJarden Zinc Products carries out highly documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\n\n\nWritten procedures are in place at Jarden Zinc Products to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and receive training regarding the modification.\n\n\n\nPre-startup Reviews\n\n\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Jarden Zinc Products.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\n\n\nJarden Zinc Products conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at l"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043571,
      "SummaryText": "east every three (3) years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\n\n\nJarden Zinc Products promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five (5) years.\n\n\n\nEmployee Participation\n\n\n\nJarden Zinc Products believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule in particular information resulting from process hazard analyses.\n\n\n\nContractors\n\n\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Jarden Zinc Products has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n5. Five-year Accident History\n\nJarden Zinc Products, LLC has had an excellent record of preventing accidental releases over the last five (5) years.  Due to our stringent release prevention policies, there has been no reportable quantity releases during this period.\n\n\n\n6. Emergency Response Plan\n\nJarden Zinc Products maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response includi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043571,
      "SummaryText": "ng adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. To ensure proper functioning, our emergency response equipment is regularly reviewed and inspected. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nGreenville County Fire Department is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n7. Planned Changes to Improve Safety\n\nA few minor changes will be made to our RMP/PSM program as a result of an internal review/audit. These modifications will be implemented by the facility EHS Director, Engineering Manager, Maintenance Manager and support staff.\n\n\n\nRev: June 3, 2014\n\nSupersedes: January 8, 2014\n\n\n\n\n\n"
    }
  ]
}