{
  "FacilityID": 1000043230,
  "FacilityName": "Birds Eye Foods LLC - Waseca Plant",
  "FacilityStr1": "400 4th Street SW",
  "FacilityStr2": null,
  "FacilityCity": "Waseca",
  "FacilityState": "MN",
  "FacilityZipCode": "56093",
  "Facility4DigitZipExt": "0518",
  "FacilityCountyFIPS": "27161",
  "LEPC": "Waseca Fire Department",
  "FacilityLatDecDegs": "44.075660",
  "FacilityLongDecDegs": "-093.514560",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "pinnaclefoods.com",
  "FacilityEmailAddress": "doug.emmett@pinnaclefoods.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Birds Eye Foods LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 2212611,
  "OperatorName": "Birds Eye Foods LLC",
  "OperatorStr1": "399 Jefferson Road",
  "OperatorStr2": null,
  "OperatorCity": "Parsippany",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07054",
  "OperatorZipCodeExt": null,
  "RMPContact": "Frank Shipley",
  "RMPTitle": "Plant Manager",
  "FTE": 157,
  "OtherEPAFacilityID": "56093GNRLF4THS",
  "EPAFacilityID": "100000058046",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-03-26 00:00:00",
  "SafetyInspectionBy": "Insurance Inspection (by Swiss re)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.07504,
  "FRS_Long": -93.51181,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053308,
      "AltID": "ammonia refrigeration",
      "FacilityID": 1000043230,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054066,
          "ProcessID": 1000053308,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064687,
          "ProcessID": 1000053308,
          "ChemicalID": 56,
          "Quantity": 95000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564687,
          "ProcessID": 1000053308,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043230,
      "SummaryText": "Executive Summary\n\n\n\nINTRODUCTION\n\n\n\nThis is to inform all interested persons, including employees, that Birds Eye Foods (Waseca), herein referred to as BEF, facility is complying with OSHA's Process Safety Management Standard, Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations, Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals.\n\n\n\n\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nBEF is committed to providing a safe workplace that is operated in an environmentally responsible manner. BEF strives to protect all its valuable resources and assets - both personnel and property. We live and have families in this community. We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment. BEF is also committed to complying with all applicable laws and regulations relating to safety in the workplace and the protection of the environment. Through training and various safety devices and procedures, we work to minimize potential releases.\n\n\n\nIt is BEF policy to promote overall public and associate safety by developing, implementing and maintaining all required elements of the EPA's RMP provisions and OSHAs PSM standard regarding the storage, handling, and processing of anhydrous ammonia used at this facility. The incorporation of these programs helps to prevent the occurrence, and minimize the consequences, of significant releases of highly hazardous materials as well as fires, explosions, and other types of catastrophic incidents.\n\n\n\nThis facility incorporates a comprehensive management system to oversee the continued development, Implementation and maintenance of the RMP. The Plant Manager is responsible for the implementation of the RMP. In turn, he has designated the facility Environmental Health & Safety Manager as the PSM Coordinator having overal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043230,
      "SummaryText": "l authority for and oversight of the Facility PSM program and the RMP program. As part of the PSM and RMP, the facility has an Emergency Action and Response Plan which provides instructions and responsibilities required of facility personnel in case of the following plant emergencies: employee illness/injury, ammonia release, fire, and severe weather. The management team is committed to safety and the implementation of safe procedures at the facility.\n\n\n\n\n\nB. FACILITY OVERVIEW AND REGULATED SUBSTANCES HANDLED\n\n\n\nThe BEF facility processes fresh green beans and peas from July- November and packages frozen vegetables and ready to eat meals year round. We utilize anhydrous ammonia for refrigeration for space cooling of production areas and storage areas for incoming food ingredients and finished product. Ammonia is also used in processing of the ingredients going into the frozen meal products and for freezing, primarily, of peas and corn. The Environmental Protection Agency (EPA) considers anhydrous ammonia an extremely hazardous substance.\n\n\n\nAnhydrous ammonia is the only RMP regulated substance (toxic or flammable) above the applicable threshold that is used at our facility. The quantity of ammonia refrigerant at the facility is approximately 95,000 lbs. The ammonia refrigeration process consists of various pumps, compressors, evaporators, condensers, piping and valves, electrical supply, controls, sensors, ventilation, and other related equipment. Cooling is achieved by the system changing the state of the ammonia from a gas to a liquid and back in a closed-loop system.\n\n\n\nThe engine room is located within the plant building but along exterior walls. The engine room is enclosed and has mechanical ventilation and ammonia detection systems. Access to the site is restricted to company employees and authorized contractors and visitors.\n\n\n\n\n\nC. FIVE-YEAR ACCIDENT HISTORY\n\n\n\nNo major releases of ammonia have occurred that have resulted in: deaths, injuries, significant pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043230,
      "SummaryText": "operty damage on site or off site.\n\n\n\n\n\n\n\n\n\n\n\nExecutive Summary\n\n\n\n\n\nD. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\n\n\n\nThe general accident prevention program and ammonia-specific prevention steps were developed in accordance with OSH PSM Standard 29 CFR 1910.110 and EPA Risk Management Program regulations in 40 CFR Part 68. The key prevention steps at the facility consist of the following elements of the PSM program which also address the corresponding counterparts of the RMP:\n\nEmployee Participation\n\nProcess Safety Information\n\nProcess Hazard Analysis\n\nOperating Procedures\n\nTraining\n\nContractor Requirements\n\nPre-Startup Safety Review\n\nMechanical Integrity\n\nHot Work \n\nManagement of Change\n\nIncident Investigation\n\nEmergency Planning and Response\n\nCompliance Audits\n\n\n\nThe facility strives to comply with applicable Federal, State and Local regulations including the EPA's Accidental Release Prevention Rule. Personnel are trained about this during our Hazard Communications Training and through access to our written programs.\n\n\n\nA management system has been established to maintain the elements of the PSM and Risk Management Programs. Applicable written elements of the PSM and the Risk Management Program are readily accessible by employees.\n\n\n\n\n\nE. THE EMERGENCY RESPONSE PROGRAM\n\n\n\nThe Emergency Action and Response plan covers the ammonia refrigeration system regarding the Process Safety and Risk Management. Our emergency plan has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies. If a release of ammonia is detected by the ammonia detection system or by employees, the procedures within this manual will be followed including notification of hazardous materials responders (refrigeration technicians) by radio and as required, the involvement of the incident commander. The manual describes the level of personal protective equipment to be used to respond to ammonia incidents. Facility responder"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043230,
      "SummaryText": "s have received initial and annual refresher training in accordance with 29 CFR 1910.120. Facility-wide training regarding emergency procedures and evacuation routes occurs annually.\n\n\n\nThe facility has an in-house HAZMAT team that initially responds and works in conjunction with the Waseca Voluntary Fire Department and the Local Emergency Planning Committee (LEPC) on emergency preparedness. The Waseca Fire Department will handle public notification in coordination with the LEPC. We meet periodically with representatives of each to address any changes in the facility or any new concerns.  BEF will work with these agencies as necessary to notify the public about an ammonia release. The manual also contains procedures for emergency alerting and response procedures for on-site personnel, off-site emergency contacts, and adjacent plants. Senior management will handle media relations.\n\n\n\nWe strive to minimize off-site consequences through the implementation of emergency response program elements: pre-emergency planning, facility evacuation procedures, emergency response procedures, emergency medical and first aid procedures, post-emergency guidelines, and training program.\n\n\n\n\n\nF. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nBEF manages all the plant processes through the implementation of Continuous Improvement programs. We continue to improve the safety of the system by implementing recommendations from various PSM program elements such as Standard Operating Procedures (SOP) reviews, PSM/RMP audits, Process Hazardous Analysis (PHA), and Mechanical Integrity Assessments (MIA). Our Refrigeration staff is kept current with industry changes through on-the-job training, offsite seminars and provided with access to the International Institute of Ammonia Refrigeration (IIAR) and the Industrial Refrigeration Consortium (IRC) publication and training materials.\n\n"
    }
  ]
}