{
  "FacilityID": 1000098243,
  "FacilityName": "Atlantic Beach WWTP # 1",
  "FacilityStr1": "City of Atlantic Beach WWTP # 1",
  "FacilityStr2": "1100 Sandpipper Lane",
  "FacilityCity": "Atlantic Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32233",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12031",
  "LEPC": "District 4 LEPC",
  "FacilityLatDecDegs": "30.335387",
  "FacilityLongDecDegs": "-81.4088604",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.coab.us",
  "FacilityEmailAddress": "tstephens@coab.us",
  "FacilityDUNS": 81944514,
  "ParentCompanyName": "City Of Atlantic Beach",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Atlantic Beach",
  "OperatorStr1": "902 Assisi Lane",
  "OperatorStr2": null,
  "OperatorCity": "Atlantic Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32233",
  "OperatorZipCodeExt": "2855",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000121361",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-03-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-12-13 11:23:03",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-12-13 11:23:03",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-12-13 11:23:03",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-12-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.335556,
  "FRS_Long": -81.408889,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121670,
      "AltID": "Sewage Treatment Faciliti",
      "FacilityID": 1000098243,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152332,
          "ProcessID": 1000121670,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000152333,
          "ProcessID": 1000121670,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000123043,
          "ProcessID": 1000121670,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000076533,
              "Process_NAICS_ID": 1000123043,
              "SafetyReviewDate": "2021-09-30 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2021-09-30 00:00:00",
              "ChangeCompletionDate": "2021-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Man Made/ Terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-09-30 00:00:00",
              "TrainingReviewDate": "2021-09-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-09-30 00:00:00",
              "EquipmentInspectionDate": "2021-11-21 00:00:00",
              "EquipmentTested": "hoist inspection",
              "ComplianceAuditDate": "2021-09-30 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000077262,
                  "PreventionProgram2ID": 1000076533,
                  "ProcessChemicalID": 1000152332
                },
                {
                  "PrimaryKey": 1000077261,
                  "PreventionProgram2ID": 1000076533,
                  "ProcessChemicalID": 1000152333
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000098243,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-09-30 00:00:00",
    "ERTrainingDate": "2021-09-30 00:00:00",
    "CoordinatingAgencyName": "Jacksonville Fire Department",
    "CoordinatingAgencyPhone": "9046302472",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000098243,
      "SummaryText": "g: \r\no\tHot Work Permits, \t\r\no\tLock Out /Tag Out Permits, \r\no\tVessel Entry Permits, \r\no\tSite Security, and \r\no\tBreaking Into Chemical Lines.\r\n\r\nContractors must meet COAB safety and technical standards as part of selection and ongoing evaluations. \r\n\r\nb.\tCHEMICAL-SPECIFIC RESPONSE PROGRAM \r\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the chlorine- and sulfur dioxide-specific programs. These include:\r\n¿\tSpecific procedures for the operation of the chlorine and sulfur dioxide processes.\r\n¿\tCompletion of a Pre-startup Safety Review prior to startup of the modified chlorine and sulfur dioxide systems.  The latest review was conducted in April 2009.\r\n¿\tSpecific emergency response procedures for chlorine and sulfur dioxide releases as outlined under both operating procedures and in the emergency response procedures.\r\n¿\tSpecific training in the properties, hazards, handling requirements, and leak repair for chlorine and sulfur dioxide.\r\nFinally, the details of both facility and equipment design are key to the safe operations of the chlorine and sulfur dioxide systems.\r\ni.\tFacility Design\r\nThe plant and support equipment of the chlorine and sulfur dioxide storage and control buildings meet and exceed design codes standards and good engineering practices. The buildings are equipped with ambient ventilation storage area and a fan ventilated control room.\r\nii.\tEquipment Design\r\nThe low pressure chlorine and sulfur dioxide systems operate under a vacuum pressure of 13 inches of mercury. All the pipe, tubes, and equipment are chlorine- and sulfur dioxide-compatible nonmetallic piping. The system is designed with a safety factor covering the typical vacuum pressure in it. There are monitors that detect the presence of chlorine and/or sulfur dioxide in the storage building rooms. The audible alarms and lights in the plant alert employees of a potential leak, and are connected to the SCADA system to alert operator"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000098243,
      "SummaryText": "l are the key resource of COAB prevention program. Our employees make up the operators of the chlorine handling equipment. The City of Atlantic Beach fosters involvement in every aspect of the chlorine system operations including participation in:\r\n¿\tDevelopment of operating procedures,\r\n¿\tCompliance audits,\r\n¿\tHazard evaluations, and\r\n¿\tOn-going training of the operators and other involved staff.\r\n\r\n11.\tCHANGES TO IMPROVE SAFETY \r\nThe City of Atlantic Beach continually reviews implemented and potential safety improvements for all of its operations, to minimize consequences in the event of a release of chlorine."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000098243,
      "SummaryText": ". The site is bordered by Sandpiper Lane on the east, Jordan Road on the north and west, and Donner Road on the south. The Plant includes chlorine and sulfur dioxide storage and distribution systems contained in a specially designed storage and process buildings. The boundaries of the systems subject to the RMP regulation include the Bulk Chlorine and Sulfur Dioxide Storage and Feed Control rooms and the associated vent make up and exhaust systems. These are detailed in the Process and Instrument Drawings (P&IDs) which are part of the plant Process Safety Information (PSI).\r\nCOAB WWTP# 1 employs five full-time employees engaged in wastewater treatment plant and field operations. Chlorine and sulfur dioxide are used as part of the treatment process.\r\n\r\n5.\tREGULATED SUBSTANCES \r\nChlorine and sulfur dioxide are the only regulated substances on-site which exceed the 40 CFR 68 threshold quantities. The COAB chlorine and dechlorination processes were installed as part of the process of treating wastewater to meet strict FDEP discharge permit requirements.  The facility operates under permit from the State of Florida Department of Environmental Protection (FDEP). The chlorine and sulfur dioxide are received, stored and distributed to two process control systems.  \r\n\r\nChlorine is an EPA and OSHA-listed toxic chemical. It is an irritant and it is corrosive. Chlorine is a halogen with the formula Cl2. It is a chlorinating or oxidizing agent that is not flammable. It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 4, severe; with immediate and delayed health hazards. Chlorine is not a carcinogen.  \r\n\r\nSulfur dioxide is an EPA-and OSHA-listed toxic chemical.  It is an irritant and it is corrosive.  Sulfur dioxide is a gas or liquid under pressure with the formula S02.  It is a dechlorinating or oxidizing agent that is not flammable.  It has a 5 ppm OSHA PEL and a NFPA health rating of 4, severe; with immediate and delayed health hazards.  S"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000098243,
      "SummaryText": "s even if the plant is unmanned.\r\n\r\n8.\tFIVE-YEAR ACCIDENT HISTORY \r\nThe City of Atlantic Beach Water Plant #1 had no accidental releases of chlorine or sulfur dioxide in the past five years per 40 CFR 67.42 (a).\r\n\r\n9.\tEMERGENCY RESPONSE PROGRAM \r\nEmergency response procedures are described in the City of Atlantic Beach Emergency Response Plan.  Emergency phone numbers are posted at each facility, indicating who to call first and what to do if that person is unreachable. The Jacksonville Fire Department (911) is the first call listed.  The Plant also has site specific emergency actions defined in the plant operating procedures. Emergency response drills and drill evaluations are conducted annually by the operating department. Emergency operation and response procedures are reviewed and updated based on the results of the drill.\r\n\r\nThe emergency response program is reviewed by the Jacksonville Fire Department, which coordinates with local Duval County Emergency Response Planning Committee (LEPC) and Jacksonville Fire Department HazMat Team, all located in Duval County, Florida. Copies of the program are given to key local agencies including the fire, medical, rescue, management, and police departments in Atlantic Beach. Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the City of Atlantic Beach WTP # 1.\r\n\r\nThe Contingency Plan procedures detail the actions and responses to chlorine and sulfur dioxide spills (releases). The plan includes training of all chlorination and dechlorination-area operators. The primary response team is the Jacksonville Fire and Rescue, plus the HazMat Team, who respond to severe leak situations. A Chlorine B Leak Repair Kit is maintained on site to aid in stopping leaks. Public notification is facilitated through the Atlantic Beach Police Department, which has an automated emergency dialing message system for public notification.\r\n\r\n10.\tPERSONNEL \r\nPersonne"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000098243,
      "SummaryText": "ton-containers. This failure is equal to creating a 1/16 inch diameter hole in the yoke assembly, the drip tube, a pipe, or even the container. Assessment using the EPA guidance demonstrated the rate of chlorine release is 20.0 lb/min. The toxic endpoint distances determined is ___ miles. The residential population potentially that would be impacted by this release is _____.\r\n\r\n7.\tACCIDENTAL RELEASE PREVENTION PROGRAM \r\nThe COAB Accidental Release Prevention Program is based on the OSHA PSM Standard.  Since the facility is a public owned entity, it is subject to the EPA RMP Level 2 Prevention Program. The COAB Prevention Program has been in place and effectively used since the RMP rule was promulgated. It is part of the plants operating culture. There are two parts to the program. The first is the general overall City wide and WWTP #1 site program. The second is the chlorine-specific actions within the site program coordinated with the City of Jacksonville Fire Department.\r\n\r\na.\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \r\nPlant-wide, many elements of the prevention program are used for all operations. The overviews of these programs are listed below:\r\n¿\tCOAB has detailed process safety information on each of its operations.\r\n¿\tThe DMS is integral to the management of change for all operations on-site control.\r\n¿\tTraining is the backbone of employee knowledge, job operations and is ongoing in each area.\r\n¿\tEmployee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used.\r\n¿\tRoutine and preventive maintenance are used for each piece of equipment, with the goal of maintaining mechanical integrity. \r\n¿\tIncident investigations of accidents and near-miss incidents ensure that lessons are learned from each event as well as the root causes of the incident.\r\n¿\tEmployees participate in all aspects of the plant as listed under emergency response.\r\n¿\tSafe work practices are used throughout the facility includin"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000098243,
      "SummaryText": "The City of Atlantic Beach (COAB) Public Works Department operates the COAB Wastewater                           Treatment Plant (WWTP) #1 located at 1100 Sandpiper Lane, Atlantic Beach, Duval Country, Florida. This plant is one of five water and wastewater plants operated by COAB. WWTP #1 and three other plants have quantities of regulated hazardous chemicals above the EPA threshold. COAB has a unified Risk Management Program which applies to each plant. Only WWTP # 1 operations and policies are presented in this Plan.\r\n\r\n1.\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \r\nThe City of Atlantic Beach (COAB), Florida, Water Treatment Plant (WTP) #1 Accidental Release Prevention Program involves a unified approach that integrates technologies, procedures and management practices. The prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR 68.\r\n\r\n2.\tMANAGEMENT SYSTEM \r\nCOAB has a management system in place which is led by the Deputy Public Works Director, who oversees the implementation and on-going use of the RMP elements. This program, along with other City-wide and plant-specific policies, eliminates and /or reduces the likelihood of a hazardous chemical release at the plant.\r\n\r\n3.\tPREVENTION PROGRAM LEVEL 2 \r\nCOAB maintains policies, procedures, and systems as part of their prevention program. These are applied to WWTP #1 and each COAB treatment plant. The COAB program addresses each of the elements needed to implement the EPA RMP Program Level 2, which are also addressed in the OSHA Process Safety Management (PSM) program. Being a public entity, COAB is subject to only the EPA RMP Level 2 Prevention Program. The policies and procedures are maintained in the COAB Document Management System (DMS).\r\n\r\n4.\tSITE DESCRIPTION \r\nThe site is owned and operated by the City of Atlantic Beach. The site is located at 1100 Sandpiper Lane, Atlantic Beach, Duval County, Florida"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000098243,
      "SummaryText": "ulfur dioxide is not a carcinogen.\r\n\r\n6.\tWORST AND ALTERNATIVE CASE RELEASE SCENARIOS \r\nTwo offsite consequence analyses were conducted which include two chlorine release scenarios, since chlorine has the lower PEL.  A sulfur dioxide release would have similar consequences.  \r\n\r\nThe first is a worst case release. The second is a more probable alternative release scenario. The first scenario is defined by EPA, which states that the ... shall assume that the ... maximum quantity in the largest vessel ... is released as a gas over 10 minutes due to an unspecified failure.  The alternative scenario is defined as more likely to occur than the worst case scenario.  An atmospheric dispersion assessment was performed to determine the distance traveled by the chlorine released before its concentration decreases to the toxic endpoint. The EPA-selected endpoint for chlorine is 0.0087 mg/l or  3 parts per million (ppm). The 3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG- 2). This is defined by the American Industrial Hygiene Association (AIHA) as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action. The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, to estimate the population potentially affected.\r\na.\tWORST CASE \r\nAn atmospheric dispersion assessment for the worst case scenario was performed using the EPA assumptions. Results demonstrate a distance of ____ miles to the toxic endpoint. The residential population that could potentially be affected by the release is estimated at ______ people.\r\nb.\tALTERNATIVE CASE \r\nThe alternative release scenario involves the failure of the yoke assembly regulator of the vacuum system connected to one of the one"
    }
  ]
}