{
  "FacilityID": 1000081343,
  "FacilityName": "Pyramid Peak Water Treatment Plant",
  "FacilityStr1": "28101 N. 63rd Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85083",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.738333",
  "FacilityLongDecDegs": "-112.190278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.glendaleaz.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77523579,
  "ParentCompanyName": "City of Glendale",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Glendale Water Services Dpt",
  "OperatorStr1": "28101 N. 63rd Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85083",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106912",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-17 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.73833,
  "FRS_Long": -112.19028,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101660,
      "AltID": "Chlorine",
      "FacilityID": 1000081343,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127411,
          "ProcessID": 1000101660,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000102922,
          "ProcessID": 1000101660,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000085875,
              "Process_NAICS_ID": 1000102922,
              "SafetyReviewDate": "2019-06-12 00:00:00",
              "PHA_Date": "2019-05-29 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-05-29 00:00:00",
              "TrainingReviewDate": "2019-05-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-06-12 00:00:00",
              "EquipmentInspectionDate": "2019-03-19 00:00:00",
              "EquipmentTested": "scrubber, chlorine leak detectors",
              "ChangeMgmtDate": "2019-06-12 00:00:00",
              "ChangeMgmtReviewDate": "2019-06-12 00:00:00",
              "PreStartupReviewDate": "2019-06-12 00:00:00",
              "ComplianceAuditDate": "2017-06-27 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": "2017-07-06 00:00:00",
              "InvestigationChangeDate": "2017-07-11 00:00:00",
              "ParticipationPlansReviewDate": "2019-06-12 00:00:00",
              "HotWorkPermitReviewDate": "2019-06-12 00:00:00",
              "ContractorSafetyReviewDate": "2019-06-12 00:00:00",
              "ContractorSafetyEvalDate": "2019-06-11 00:00:00",
              "CBI_Flag": 0,
              "Description": "Pyramid Peak Water Treatment Plant has a process safety management program.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000107135,
                  "PreventionProgram3ID": 1000085875,
                  "ProcessChemicalID": 1000127411
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081343,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-02-28 00:00:00",
    "ERTrainingDate": "2019-01-30 00:00:00",
    "CoordinatingAgencyName": "Glendale and Phoenix Fire Dept.",
    "CoordinatingAgencyPhone": "6239303400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "OSHA Regulations at 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081343,
      "SummaryText": "Executive Summary\n\n\n\n\n\nThis document is an update to the Pyramid Peak Water Treatment Plant (PPWTP) Risk Management Program (RMP) that was submitted to U.S. EPA in May 1999 and periodically amended.   Prior to this update in 2019, the most recent submittal to EPA was in June 2015 to update emergency contact information for the RMP Manager.  In accordance with RMP guidance documents and regulations, all administrative and operational changes at the facility since 1999 are documented.\n\n\n\nIn June 1996, the U.S. Environmental Protection Agency (EPA) issued Risk Management (RM) program regulations (40 CFR, Part 68).  Regulated under the Clean Air Act Amendments (CAAA), Section 112(r), the RMP requires facilities that store large amounts of listed hazardous chemical substances to prepare and implement risk management plans to reduce the probability of accidental releases and minimize the health risks to the public and the environment.  \n\n\n\nThe RMP regulates 77 listed toxic substances and 63 listed flammable substances.  Of the 140 toxic and flammable chemicals regulated by the RMP, the PPWTP has only one such listed chemical (anhydrous chlorine) which is used to disinfect drinking water provided to the residents of Glendale.  The terms anhydrous chlorine and chlorine are used interchangeably and specifically refer to a chemical listed in the RMP regulations.  When used as a disinfectant, chlorine prevents the spread of waterborne diseases and has been used for years in the water treatment industry.  When properly used, chlorine has proven to be both safe and effective. \n\n\n\n\n\nMinimizing Risk\n\nThe major driving force in the development of the RMP regulations is reducing the risk to public health by minimizing the potential of a chemical release.  At PPWTP, there is a multi-layer system in place to meet this goal.  The RMP includes the following: (1) properly trained operators to safely handle chlorine; (2) chlorine detectors located where chlorine is stored and/or used; (3)"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081343,
      "SummaryText": " failsafe equipment design and installation of back-up safety equipment including emergency scrubber; and (4) an automated warning system that notifies both on-site and off-site personnel of a potential release.  Trained personnel respond to chlorine alarms to assess whether a chlorine release poses an imminent danger to employees or the public.  While a significant release is unlikely, emergency response plans have been developed.  The emergency response plans include procedures to be followed by operators trained to take appropriate action such as contacting the local fire department (FD).  The FDA's emergency response time to the PPWTP is 10 minutes.\n\n\n\n\n\nManagement Plan\n\nWithin the management and administrative roles of the PPWTP, responsibility has been defined to coordinate and implement the RMP.  Overall development and management of the RMP is the responsibility of the RMP Manager.  The RMP Coordinator reports to the RMP Manager and is responsible for coordinating the implementation of the RMP.  The PPWTP Supervisor is the RMP Coordinator and responsible for the day-to-day implementation of the RMP.  The PPWTP Safety Administrator (Chief Plant Operator) is responsible for the overall recordkeeping of the RMP and reports to the RMP Coordinator.  Additional program oversight is provided by the City of Glendale's Environmental Resources staff and the Water Services Safety & Security Coordinator who act as external auditors of the program's implementation and overall quality.\n\n\n\nFor the PPWTP, the following personnel have been assigned to coordinate and implement the RMP:\n\n\n\n-The Superintendent of Plant Operations is the designated RMP Manager\n\n-The PPWTP Plant Supervisor is the designated RMP Coordinator\n\n-The PPWTP Chief Plant Operator is the designated PPWTP Safety Administrator \n\n\n\nWhereas the Superintendent of Plant Operations is the RMP Manager, the Water Services Safety & Security Coordinator is the delegated manager for the Occupational Safety and Health"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081343,
      "SummaryText": " Administration (OSHA) Process Safety Management (PSM) program in place at PPWTP.  The requirements of the PSM program largely parallel RMP requirements.  Because of the similarities in the two programs, the RMP Coordinator will be referred to as the RM/PSM Program Coordinator throughout this document. \n\n\n\n\n\nWorst Case and Alternate Case Release Scenarios\n\nPPWTP modeled two potential release events for chlorine and followed EPA guidance to identify a worst case release scenario (WCS) and alternate case release scenario (ACS) as defined by the EPA regulations.  Toxic endpoints were identified using EPA-approved methods.\n\n\n\nA worst case scenario is defined by the EPA as the result of a release from the largest container and/or pipe over a span of 10 minutes.  The distance to a toxic endpoint is defined by emergency response planning guidelines level 2 (ERPG-2) as a concentration a person can be exposed to for up to 1 hour without experiencing serious health effects.  The distance to a toxic endpoint is used to determine the affected geographical area and population for emergency planning purposes.  The ERPG-2 value for chlorine is 3 parts per million by volume (ppmv) or 0.0087 milligrams per liter (mg/L).\n\n\n\nEPA states that a WCS is useful for encouraging community dialogue.  However, because the WCS does not necessarily represent events likely to occur, it is more useful for discussion purposes than for emergency planning purposes.  An alternative case release scenario is a release scenario more likely than the WCS and can be used for emergency response planning.\n\n\n\nThe WCS for the PPWTP is a release of 2,000 pounds of chlorine in 10 minutes.  The distance to the toxic endpoint for the WCS is 1.3 miles, affecting approximately 5.31 square miles and an estimated population of 7,684.\n\n\n\nThe ACS is based on an operator opening the chlorine container valve before connecting the flexible piping (pigtail) resulting in a release of gaseous chlorine.  The ACS does not consid"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081343,
      "SummaryText": "er the active and passive mitigation systems in place at the PPWTP.  The ACS resulted in an endpoint distance of 1.1 miles.  A population of approximately 5,273 could potentially be affected if this scenario were to occur without mitigation systems. \n\n\n\n\n\n5-Year Accident History\n\nSince PPWTP opened in 1986, there has not been a release resulting in off-site property damage or health consequences requiring medical treatment. \n\n\n\n\n\nChemical Release Prevention Program\n\nThe PPWTP has a chemical release prevention program in place for the chlorine process.  This program is required by both the RMP and OSHA PSM regulations.  The prevention program for the chlorine process has been in place since 1995.  Key provisions of the PPWTP prevention program are as follows:\n\n\n\n-Written procedures have been prepared for the covered process, including directions for safe start-up and shutdown operations and emergency shutdown.\n\n\n\n-PPWTP employees who operate the chlorine system must receive training initially and periodically on safe start-up and shutdown operations and emergency shutdown.  \n\n\n\n-Incidences, including minor releases, are investigated to improve the safety of the process.  \n\n\n\n-Once completed, incident investigations are shared with employees.  \n\n\n\n-Employees participate in a process hazard analysis (PHA) which identifies potential hazards and ways to improve the safety of the process every five years, or when significant changes are made to the process.\n\n\n\n-The PPWTP has a management of change (MOC) program in place that mandates changes to the chlorine system are reviewed prior to the change to ensure that the change will not compromise safety.\n\n\n\n-An equipment design and maintenance program is in place.  Equipment design and maintenance practices consider guidance from industry experts such as the Chlorine Institute.\n\n\n\n-A preliminary start-up review is also completed prior to returning the covered equipment to service after a major change or prior to a new covered "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081343,
      "SummaryText": "process coming on-line.  \n\n\n\n-A hot work permit program is in place. \n\n\n\n-Contractors who work on or near the RMP process are advised of the hazards of chlorine, provided evacuation instructions in case an incident occurs, and must certify that they are qualified to work near hazardous materials.\n\n\n\n\n\nEmergency Response Program\n\nThe PPWTP has an emergency response program in place for the chlorine process.  This program consists of personnel trained to recognize releases, assess the situation, and engage the proper emergency response personnel.  When external emergency response is required, plant personnel will notify the FD then establish an incident command system that is transferred to the FD upon their arrival.  Once the FD establishes command, it is supported by PPWTP personnel familiar with the affected process.  The FD has access to additional emergency response resources, including the local police department, Red Cross, Arizona Department of Environmental Quality, and other agencies, as needed.\n\n\n\n\n\nImprovements Since Last Report Submission\n\nThe PPWTP installed Vent Exhaust Gas Arrestors (VEGA).  The VEGA neutralizes chlorine gas that is vented from the piping during the cylinder switch-over process. \n\n"
    }
  ]
}