{
  "FacilityID": 1000084643,
  "FacilityName": "Forum Clackamas Freezer",
  "FacilityStr1": "9810 SE Mangan Way",
  "FacilityStr2": null,
  "FacilityCity": "Clackamas",
  "FacilityState": "OR",
  "FacilityZipCode": "97015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41005",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "45.401267",
  "FacilityLongDecDegs": "-122.564308",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Forum Clackamas Campus",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "KG Investment Properties",
  "OperatorStr1": "16800 SE Evelyn St.",
  "OperatorStr2": "Suite 195",
  "OperatorCity": "Clackamas",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97015",
  "OperatorZipCodeExt": null,
  "RMPContact": "Maija Mueller",
  "RMPTitle": "Director - Real Estate",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190624",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-10-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105730,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 1000084643,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000107003,
          "ProcessID": 1000105730,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132432,
          "ProcessID": 1000105730,
          "ChemicalID": 56,
          "Quantity": 23300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632432,
          "ProcessID": 1000105730,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084643,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nForum Clackamas Freezer management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Forum Clackamas Freezer's safety and environmental policies are administered by the Senior Property Manager and Senior Operating Engineer, who conducts periodic inspections of the facility to ensure compliance, and oversees the entire safety and environmental programs, including the PSM/RMP Program.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Forum Clackamas Freezer facility is located at 9810 SE Mangan Way in Clackamas, Oregon. The facility is approximately 0.25 miles east of Interstate 205, and 1 mile south of the junction of Interstate 205 and Highway 224.  The immediate area is urban with primarily commercial and light residential areas.  The regulated material present at the facility and the focus of this study is anhydrous ammonia. The facility uses a maximum of 18,000 pounds of ammonia as a refrigerant within a closed system. The system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for freezer & cooler areas and associated dock operations. Typical operating conditions range from approximately 0 psig on the low pressure side of the system to approximately 150 psig on the high side.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION\n\nSTEPS\n\nThe Forum Clackamas Freezer ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, the facility operates in accordance with OSHA's Process Safety Management regulation. The facility "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084643,
      "SummaryText": "conducts preventative maintenance and any necessary minor repairs in house, but an outside contractor is hired for major repairs or maintenance. The facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code applicable at the time of construction, which specifically outlines requirements for the safe operation of the ammonia refrigeration system. These safety features include ammonia sensors in the engine room. In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (condensers). All pressure vessels are equipped with pressure relief valves. All of the relief valves are tied into a common relief header that vent to the Ammonia Dump Tank.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nEPA's RMP Program defines \"accident\" as the following:\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\nThe release must have caused at least one of the following:\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\nBased on the above definition and upon confirmation with the facility on January 15, 2020, there have been no releases of ammonia that meet this criteria in the past five years (January 2015 - January 2020). In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation. \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Forum Clackamas Freezer facility has an emergency response plan in effect. The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.\n\nThis Plan was designed to meet the following objectives:\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084643,
      "SummaryText": " property damage.\n\n\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility. The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations. In case of an ammonia emergency, the facility plans to evacuate all employees and contractors and activate the facility's response plan to respond to the situation. If necessary, they will alert the local emergency responders (fire department) for assistance. The facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazards Analysis, conducted on April 12-13, 2018, including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the Forum Clackamas Freezer facility. The Forum Clackamas Freezer safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees. These changes include the following items:\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}