{
  "FacilityID": 1000025259,
  "FacilityName": "Sunoco Logistics Newark NJ Terminal",
  "FacilityStr1": "436 Doremus Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Newark",
  "FacilityState": "NJ",
  "FacilityZipCode": "07105",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34013",
  "LEPC": "City of Newark Emerg Mgmt LEPC",
  "FacilityLatDecDegs": "40.717608",
  "FacilityLongDecDegs": "-074.124953",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sunocologistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 64717981,
  "ParentCompanyName": "Sunoco Partners Marketing and Terminal LP",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sunoco Partners Newark Terminal",
  "OperatorStr1": "436 Doremus Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Newark",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07105",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "NJD980650154",
  "EPAFacilityID": "100000216456",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "PI#07733",
  "SafetyInspectionDate": "2010-08-10 00:00:00",
  "SafetyInspectionBy": "US Coast Guard",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-02-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-01-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2022-02-24 00:00:00",
  "AnniversaryDate": "2017-01-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 40.717408,
  "FRS_Long": -74.122894,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000031035,
      "AltID": null,
      "FacilityID": 1000025259,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000037566,
          "ProcessID": 1000031035,
          "ChemicalID": 118,
          "Quantity": 250000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000031339,
          "ProcessID": 1000031035,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000026902,
              "Process_NAICS_ID": 1000031339,
              "SafetyReviewDate": "2011-05-31 00:00:00",
              "PHA_Date": "2011-04-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-10-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hydrocarbon detector (pump area), flow monitor along with temperature, pressure and liquid level indicators.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Vessel",
              "OpProceduresReviewDate": "2011-05-31 00:00:00",
              "TrainingReviewDate": "2009-10-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-11-02 00:00:00",
              "EquipmentInspectionDate": "2011-10-01 00:00:00",
              "EquipmentTested": "All operational components including ESDs and alarms",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-05-31 00:00:00",
              "HotWorkPermitReviewDate": "2011-02-18 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2008-12-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000032286,
                  "PreventionProgram3ID": 1000026902,
                  "ProcessChemicalID": 1000037566
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000025259,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-06-29 00:00:00",
    "ERTrainingDate": "2011-04-22 00:00:00",
    "CoordinatingAgencyName": "City of Newark Fire Department",
    "CoordinatingAgencyPhone": "9737337424",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025259,
      "SummaryText": "Sunoco Partners Marketing & Terminals LP\r\nNewark Terminal\r\nRMP EXECUTIVE SUMMARY\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\r\n\r\nSunoco Logistics - Newark Terminal is a refined petroleum product distributor. The Newark Terminal is an onshore, light products, bulk petroleum storage terminal used in the storage and distribution of petroleum products to retail and commercial end-users in the vicinity of Newark, NJ. The Terminal handles and stores various grades of unleaded gasoline, low-sulfur diesel, No. 2 fuel oil, butane, ethanol, and various other petroleum based additives.\r\n\r\nAt Sunoco Partners Marketing & Terminals LP- Newark Terminal in Newark, NJ, hereafter referred to as the Newark Terminal, we are committed to operating and maintaining our processes in a safe, reliable and environmentally sound manner. We believe that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding HES performance is of paramount importance.\r\n\r\nThe Newark Terminal is designed, operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community in which we operate. We promote health, safety, and the environment through programs of awareness, compliance, prevention and protection.  These programs include a combination of accidental release prevention and emergency response planning.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\nA. A description of our facility and the use of regulated substances\r\nB. An overview of our accidental release prevention programs\r\nC. A five-year accident history for accidental releases of regulated chemicals\r\nD. An overview of our emergency response program\r\nE. An overview of planned changes to improve safety\r\n\r\nA. STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe primary function of the Newark Termin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025259,
      "SummaryText": "al, located in Newark, New Jersey is to act as a refined petroleum distribution facility. The butane blending process has been classified as Program level 3. No Program 1 or 2 processes containing regulated substances were identified. By virtue of the flammable effects associated with butane, it is necessary to observe certain safety precautions in handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community. Sunoco Partners Marketing & Terminals LP- Newark Terminal is strongly committed to employee, public, and environmental safety and health. Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process.  Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Newark Terminal.\r\n\r\nThe facility has fixed inventories of butane. Butane is received by truck (transports) and stored in one (1) 60,000-gallon storage vessel. Specifically, liquefied butane is off-loaded by truck for storage under pressure (pressure reliefs set at 250 psi on the storage vessel). The butane is pumped to a blending skid for direct injection into regular and premium unleaded gasoline lines feeding the site gasoline truck-loading rack.  Injection quantities are controlled via the blending skid and Bartec-Benke Analyzer. Process safety controls include excess flow valves, low-melting point (<250oF) feeds to pneumatic valves (fail closed), 85% fill shut-off (80% alarm) on the vessel, emergency shut-off devices on the system and video display terminal, line thermal (pressure) reliefs, and grounding/interlock devices. Access to the Newark Terminal is restricted to authorized employees, management personnel, authorized contractors/visitors and tenants. Tenants include: Atlantic Star, who conducts transportation and shipping of non- hazard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025259,
      "SummaryText": "ous goods via truck and container and Wing Electrical, who is an electrical contractor and does not store hazardous materials on site.\r\n\r\nB. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC\r\nPREVENTION MEASURES\r\n\r\nThe following is a summary of the general accident prevention programs in place at Newark Terminal.  The covered process at the Terminal is regulated by the EPA RMP regulation 40 CFR Part 68, as well as NJDEP Toxic Catastrophe Prevention Act program N.J.A.C. 7:31 (1-6) and the OSHA Process Safety Management standard 29CFR 1910.119. The following summary addresses the combined elements of these three programs and describes the activities surrounding the implementation of each element. These programs constitute the framework by which process safety and accident prevention are managed in the facility.\r\n\r\nThe Newark Terminal complies with the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA-58 [2008]) requirements for LP-Gas storage. In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, an Integrated Contingency Plan (ICP) is in place for the Facility and response activities are coordinated with the Newark City Fire Department and Newark City Emergency Planning.\r\n\r\n1. Employee Participation\r\n\r\nThe Newark Terminal involves employees in the programs developed to support process safety management and accident prevention. Employees are included in every element of the program, from development, to active participation, to program updates. They are members of the process hazard analysis (PHA) team, the compliance audit team and make up the safety and emergency response teams. They implement the mechanical integrity, operator training and contractor safety programs. Employees have access to information created as part of this accident prevention program.\r\n\r\n2. Process Safety Information\r\n\r\nProcess Safety Information (PSI) is compiled and is made"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000025259,
      "SummaryText": "available to all facility personnel. This may be done by physical records and internal computer-based records. PSI includes information pertaining to the hazards of the highly hazardous chemicals used by the process, information pertaining to the technology of the process, and information pertaining to the equipment in the process. This information is essential for supporting all of the other elements of our accidental release prevention programs.\r\n\r\n3. Process Hazard Analysis (PHA) with Risk Assessments\r\n\r\nProcess Hazards Analyses (PHAs) are performed by experienced employee teams. Our PHA teams are composed of personnel with engineering and process operating experience and a trained PHA team leader.  Studies are conducted according to an established schedule, and each study is updated/revalidated at least every five years (or more often if necessary because of process changes). These comprehensive studies systematically review each unit to identify and assess hazards in the design or operation of the units. Additional controls are recommended for any unmitigated hazards that are identified. Results of the PHAs are documented in reports that are made available to personnel.\r\n\r\n4. Standard Operating Procedures\r\n\r\nWritten standard operating procedures are developed and implemented. The procedures, written by experienced operating personnel and reviewed by a technical team, describe the detailed steps to carry out the principal modes of operation. Procedures are used to (1) train our personnel before they perform tasks in the field, (2) serve as reference guides for personnel performing tasks, (3) specify what to do if an upset or operating emergency occurs and (4) provide reference guides in the startup and shutdown of equipment. These procedures are periodically reviewed and annually certified as current and accurate.\r\n\r\n5. EHS Operator Training\r\n\r\nEmployees who are responsible for safe operation of the facility are provided with comprehensive initial training and p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000025259,
      "SummaryText": "eriodic refresher training. This training includes a general overview of the process, properties, safety and health hazards of chemicals in the process, as well as a detailed understanding of the process operating procedures and safe work practices. Training is conducted using a combination of classroom training, computer based training, and on-the-job training. Written and hands-on testing is performed to validate that training requirements have been met.\r\n\r\n6. Mechanical Integrity with Preventive Maintenance\r\n\r\nThe Mechanical Integrity of process equipment is maintained to ensure that the potential for spills and releases is minimized. Programs include an inspection and testing program, a preventive maintenance program, and a quality assurance program. Procedures & guidelines describe the methods used to perform inspections, tests, and preventive maintenance tasks of existing process equipment, to verify the proper fabrication and installation of new process equipment, and to properly document all activities. The procedures & guidelines follow generally accepted engineering practices that employ both industry and company standards. Personnel performing MI/PM activities are trained on the procedures & guidelines and in the hazards of the process to ensure that job tasks are performed safely.\r\n\r\n7. Management of Change\r\n\r\nPermanent or temporary changes may inadvertently introduce new hazards or compromise safeguards built into the original design of an area. A written Management of Change procedure has been established and implemented to manage changes to process chemicals, technology, and equipment. The procedure provides guidance, designates responsibilities and establishes steps to implement changes. This program helps ensure that inadvertent or unintended changes are prevented, that any safety and health impacts are addressed, that affected procedures are updated, and that employees are informed of and trained in the approved changes.  The Newark Terminal uses a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000025259,
      "SummaryText": "computer-based software program to assist in tracking and processing change requests. Results of the Management of Change process are documented and maintained in the software program, and made available to all personnel.\r\n\r\n8. Pre-startup Safety Review\r\n\r\nPre-startup Safety Reviews are performed by experienced teams as a final check to ensure the safety of new or modified process facilities before they are placed in service. The review ensures that the following requirements are confirmed prior to start-up: construction and equipment are in accordance with design specifications; safety, maintenance, operating, and emergency procedures are in place and are adequate; PHAs have been performed on new processes and all recommendations have been resolved; PSI documentation has been properly updated and made available to personnel; MOC requirements have been satisfied for modified processes; and training has been completed (and documented) for affected employees.\r\n\r\n9. Compliance Audits\r\n\r\nCompliance Audits ensure that the procedures and practices developed under the accidental release prevention programs are being followed. A formal evaluation and certification of the programs is conducted every year by an audit team. The compliance audit team seeks to confirm that practices are consistent with written programs that the programs adequately address all requirements of the process safety regulations, and that management systems are in place to ensure continued compliance. Management promptly reviews the audit findings, determines an appropriate response for each finding, assigns responsibility for implementation of a corrective action, and tracks all findings until they are resolved.\r\n\r\n10. EHS Accident or Potential Catastrophic Event Investigation\r\n\r\nAn experienced team promptly initiates an investigation of incidents (within 48 hours) that result in, or could reasonably have caused, a catastrophic release, fire or injury. A systematic investigation process is used to de"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000025259,
      "SummaryText": "termine the root cause of an event, analyze them and develop solutions to correct the situation and prevent it from recurring. The investigation team then recommends and implements additional controls in order to mitigate hazards associated with the incident. Incident causes are tracked and published. The published reports are shared with employees and relevant findings are communicated throughout the Sunoco organization.\r\n\r\n11. Hot Work Permits\r\n\r\nHot work permits are issued for any work that could create a source of ignition on or near process units. The hot work permit program ensures that OSHA's fire prevention and protection precautions, specified in 29 CFR 1910.252(a), are in place before hot work (work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operation) begins on or near a process unit. The permit describes work being performed, authorized dates and all fire prevention and protection requirements.\r\n\r\n12. Contractors\r\n\r\nContractors are employed to supplement the work force during periods of increased maintenance or construction activities. A contractor screening procedure is used to help ensure that contractors are hired who accomplish the desired job tasks without compromising the safety and health of employees, the public, or the environment. Safety regulations are sent with all bid packages, and an evaluation of the contractor safety record and training program is used in selecting a contracting company. The safety regulations require contractors to train their employees in the safe work practices and safety rules of the Terminal. The program also includes a test to ensure they understand the material presented.\r\n\r\n13. Emergency Response\r\n\r\nOur Emergency Response Programs assure the readiness of employees to respond appropriately and safely to emergencies involving highly hazardous chemicals. The Emergency Response Programs are an integrated set of actions that start at the incident source, and initiates actio"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000025259,
      "SummaryText": "ns throughout the facility as appropriate. Additional details about our Emergency Response Programs are presented later in this document.\r\n\r\n14. Trade Secrets\r\n\r\nThe Terminal is required to make available all information necessary to those persons responsible for compiling the process safety information, those assisting in the development of the process hazards analysis, those responsible for developing operating procedures and those involved in incident investigations, emergency planning and response, and compliance audits, without regard to possible trade secret status of such information. Our facility openly provides this necessary information to all responsible persons to comply with these requirements.\r\n\r\nThese fourteen (14) individual elements of our prevention programs work together to prevent accidental chemical releases. Our company and our employees are committed to the standards required by these management programs. In addition to the above elements, we also have specific prevention measures that are employed as part of our operating procedures and engineering and administrative controls to help contain/control a release, quickly detect a release, and reduce the consequences of (mitigate) a release. These are briefly summarized as follows:\r\n\r\nGeneral Risk Reduction and Safety Measures\r\n\r\n-Engineering and construction in accordance with recognized industry and company standards\r\n-Equipment properly designed with protection from overpressure (pressure safety relief valves, etc.)\r\n-Updated technical drawings, Piping & Instrument Diagrams and Process Flow Diagrams\r\n-Operating systems monitored and controlled 24 hrs a day by trained Operators\r\n-Computerized monitoring and control of process operation\r\n-Redundant control systems with battery back-ups\r\n-Automatic and manual shutdown devices for critical systems\r\n-Scheduled inspection and testing of instruments, analyzers, and safety devices\r\n-Vehicular traffic prohibited from critical areas\r\n-Limited facility a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000025259,
      "SummaryText": "ccess\r\n-Regular safety meetings and safety awareness programs\r\n-Routinely scheduled safety inspections and audits\r\n-Radio communication system\r\n-Television surveillance capabilities\r\n-Frequent unit surveillance by operators\r\n\r\nGeneral Release Mitigation\r\n\r\n-Automatic and remotely operated shut-offs to limit release quantity\r\n-Strategically located valves to isolate leaks\r\n-Hydrocarbon detectors at key areas to warn of a chemical release\r\n\r\nGeneral Emergency Response\r\n\r\n-Emergency alert system\r\n-Periodic emergency training for employees\r\n-Communication systems with local emergency responders and regulatory agencies\r\n-Emergency drills with plant personnel, regulatory agencies, and community emergency responders to enhance\r\nresponse skills and coordination among agencies\r\n-Mutual Aid with Local Fire Departments\r\n-Participation with the Local Emergency Planning Committee (LEPC)\r\n\r\nC. FIVE YEAR ACCIDENT HISTORY\r\n\r\nThe Newark Terminal has an excellent record of accident prevention. The terminal keeps records for all significant accidental chemical releases that occur at our facility. This is a \"new\" butane blending process; consequently, there have been no accidents within the past five (5) years resulting from the chemical release of materials covered under the EPA RMP regulation and NJDEP Toxic Catastrophe Prevention Act program.\r\n\r\nD. EMERGENCY RESPONSE PROGRAM\r\n\r\nResponse actions are coordinated with the Newark City Fire Department An Integrated Contingency Plan (ICP) is in place to inform employees what to do in case of a release, fire, and to notify emergency responders when there is a need for a response.\r\n\r\nThe Terminal maintains compliance with local, state and federal regulations including OSHA CFR 1910.120, and Sara Title III. The programs are reviewed and updated on an annual basis, or more often if required. Our Discharge Prevention, Containment and Countermeasure Plan (DPCC) and Facility Response Plan (FRP) provide the essential planning and training for pro"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000025259,
      "SummaryText": "tecting employees, the public, and the environment during emergency situations. Contained in these Plans are written procedures that outline the actions to be taken for various types of emergencies that could occur at the terminal. These emergencies include: airborne releases of chemical substances, spills to the water or ground, fires, explosions. The Programs address all aspects of emergency response including:\r\n\r\n- Roles and responsibilities of personnel responding to the incident\r\n- Procedures for notifying employees that a release has occurred\r\n- Procedures for terminal evacuation and accounting of personnel\r\n- Procedures to notify local emergency response organizations and other appropriate authorities that a release has occurred\r\n- Guidance on proper first aid treatment\r\n- Procedures for post incident cleanup and decontamination\r\n\r\nThe terminal also maintains its own dedicated emergency response equipment. This equipment includes portable fire extinguishers, flame retardant clothing and first aid equipment. An inspection, testing and maintenance program is in place for emergency response equipment. Fire extinguishers are inspected monthly and receive annual maintenance per the international fire code. Inspection reports for emergency response equipment are filed onsite.\r\n\r\nIn the event of an emergency involving the Newark Terminal butane blending system, it is the policy of the Facility to initially contact the Newark Fire Department and request their assistance. The Facility maintains a trained (annually) incipient fire capability. The Facility's emergency response plans are coordinated with the Newark Fire Department and LEPC. The Newark Fire Department also maintains a full hazardous material response team, is aware of the Facility's butane blending system access and sources. Sunoco Logistics-Newark Terminal maintains a vegetation control program to minimize plant growth within 10 feet of the system.\r\n\r\nWe also maintain a relationship with the Newark Local"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000025259,
      "SummaryText": "Emergency Planning Committee (LEPC). Tours and drills with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with the hazards, equipment, resources and personnel in the terminal.\r\n\r\nE. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nWe are continually striving to make the Sunoco Logistics- Newark Terminal the safest and most reliable workplace possible for our employees, our neighbors and our community. The facility's focus is \"Nobody Gets Hurt\".\r\n\r\nThe goal of the Sunoco Logistics- Newark Terminal is to demonstrate continuous improvement in our health, environmental and safety performance. In addition, we will work cooperatively with the community to address any concerns. Should there be any question or comments on the contents of our Risk Management Plan, please contact Robert Gray, Northeast Terminals Manager at 610-859-5740."
    }
  ]
}