{
  "FacilityID": 1000049960,
  "FacilityName": "Glenpool Terminal",
  "FacilityStr1": "1605 West 131st Street",
  "FacilityStr2": null,
  "FacilityCity": "Jenks",
  "FacilityState": "OK",
  "FacilityZipCode": "74037",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "35.974303",
  "FacilityLongDecDegs": "-96.009592",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "jferguson@texonlp.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Texon, LP",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Texon, LP",
  "OperatorStr1": "11757 Katy Freeway, Suite 1400",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77079",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000229601",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-02-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-05-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-05-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-05-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 35.97379,
  "FRS_Long": -95.968572,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000062812,
      "AltID": "Butane Blending",
      "FacilityID": 1000049960,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000077596,
          "ProcessID": 1000062812,
          "ChemicalID": 118,
          "Quantity": 3500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000063934,
          "ProcessID": 1000062812,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052183,
              "Process_NAICS_ID": 1000063934,
              "SafetyReviewDate": "2015-02-13 00:00:00",
              "PHA_Date": "2014-11-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-04-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Terrorism",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-05-13 00:00:00",
              "TrainingReviewDate": "2015-05-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-05-13 00:00:00",
              "EquipmentInspectionDate": "2015-05-12 00:00:00",
              "EquipmentTested": "Vessels, piping/hoses, valves, gauges and reliefs",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2015-05-05 00:00:00",
              "PreStartupReviewDate": "2015-05-14 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-02-13 00:00:00",
              "HotWorkPermitReviewDate": "2015-05-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2015-05-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064092,
                  "PreventionProgram3ID": 1000052183,
                  "ProcessChemicalID": 1000077596
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000049960,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Glenpool Fire Department",
    "CoordinatingAgencyPhone": "9183222172",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CFATS"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049960,
      "SummaryText": "ng butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community. Texon, LP is strongly committed to employee, public, and environmental safety and health. Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process. Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Facility.\r\n\r\nThe facility maintains 9 x 90,000 horizontal, storage vessels. Specifically, liquefied butane is off-loaded via truck tanker to the vessels and then pumped off-site for injection. Process safety controls include excess flow valves, low-melting point (<250 Degrees Fahrenheit) feeds to pneumatic valves (fail-safe), emergency shut-off devices on the system, line thermal (pressure) reliefs, and grounding devices. Access to Glenpool Terminal is restricted to authorized employees, management personnel, authorized contractors/visitors and tenants.\r\n\r\nB. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC\r\nPREVENTION MEASURES\r\n\r\nTexon, LP accidental release prevention programs and emergency planning programs provide for effective management of the hazards posed by regulated substances to Facility employees, the public, and the environment. The covered process is regulated by the EPA RMP (40 CFR Part 68), as well as the OSHA Process Safety Management standard (29CFR1910.119). The following accident prevention program elements are in place at the Glenpool Terminal:\r\n\r\n1) Employee Participation\r\n2) Process Safety Information\r\n3) Process Hazard Analysis (PHA) with Risk Assessments\r\n4) Standard Operating Procedures\r\n5) Operator and Contractor Training\r\n6) Contractors\r\n7) Pre-startup Safety Review\r\n8) Mechanical Integrity with Preventive Maintenance\r\n9) Safe Work Permits\r\n10) Management of Change\r\n11) Accident or Potential Catast"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049960,
      "SummaryText": "rophic Event Investigation\r\n12) Emergency Action Planning\r\n13) Compliance Audits\r\n14) Trade Secrets\r\n\r\nThese fourteen (14) individual elements of the prevention program work together to prevent accidental chemical releases. The Glenpool Terminal and its employees are committed to the standards required by these management programs. In addition to the above elements, the Facility also has specific prevention measures that are employed as part of the operating procedures inclusive of engineering and administrative controls to help quickly detect a release, contain/control a release and reduce the consequences of a release. These are briefly summarized as follows:\r\n\r\nGeneral Risk Reduction and Safety Measures\r\n\r\n-Engineering and construction in accordance with recognized industry and company standards\r\n-Equipment properly designed with protection from overpressure (pressure safety relief valves, etc.)\r\n-Updated technical drawings, Piping & Instrument Diagrams and Process Flow Diagrams\r\n-Systems monitored and controlled by trained Operators/Contractors\r\n-Redundant control systems\r\n-Automatic and manual shutdown devices for critical systems\r\n-Scheduled inspection and testing of safety devices\r\n-Unauthorized vehicular traffic prohibited from critical areas\r\n-Limited facility access\r\n-Regular safety meetings and safety awareness programs\r\n-Routinely scheduled safety inspections and audits\r\n-Radio communication system\r\n-Frequent process surveillance by operators\r\n-Process butane leak detection devices\r\n\r\nGeneral Release Mitigation\r\n\r\n-Automatic and manually operated emergency shut-offs to limit release quantity\r\n-Leak detection with automatic shutoff\r\n-Remote monitoring from Houston, TX office\r\n\r\nGeneral Emergency Response\r\n\r\n-Emergency contact system\r\n-Periodic emergency training for employees\r\n-Communication systems with local emergency responders and regulatory agencies\r\n-Emergency drills with Facility personnel, regulatory agencies, and community emergency responders to"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049960,
      "SummaryText": "RMP EXECUTIVE SUMMARY\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\r\n\r\nTexon, LP - Glenpool Terminal is a butane blending (storage and truck offload) facility.  The facility pipes butane off-site for blending into distillates.\r\n\r\nAt Texon, LP - Glenpool Terminal, hereafter referred to as the Glenpool Terminal or Facility, management and employees are committed to operating and maintaining this process in a safe, reliable and environmentally sound manner. Glenpool Terminal believes that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding safety and environmental performance is of paramount importance.\r\n\r\nThe Facility is designed, operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community in which it operates. Texon, LP promotes health, safety, and the environment through programs of awareness, compliance, prevention and protection. These programs include a combination of accidental release prevention and emergency response planning. This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\nA. A description of the facility and the use of regulated substances\r\nB. An overview of our accidental release prevention programs\r\nC. A five-year accident history for accidental releases of regulated chemicals\r\nD. An overview of the emergency response program\r\nE. An overview of planned changes to improve safety\r\n\r\nA. STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe primary function of Glenpool Terminal, located in Jenks, Oklahoma is to act as a Butane Blending (offload and storage) facility. The butane process has been classified as Program level 3. No Program 1 or 2 processes containing regulated substances are identified. By virtue of its flammable effects, it is necessary to observe certain safety precautions in handli"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049960,
      "SummaryText": "enhance response skills and coordination among agencies\r\n-Mutual Aid with Local Fire Departments\r\n-Participation with the Tulsa Area Emergency Management Agency (Tulsa Area EMA)\r\n\r\nFurther, the Glenpool Terminal complies with the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA-58) requirements for LP Gas storage and transfer. In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, an Emergency Response Action Plan (ERAP) is in place for the Facility with response activities being coordinated with the Glenpool Fire Department and Tulsa Area EMA.\r\n\r\nC. FIVE YEAR ACCIDENT HISTORY\r\n\r\nTexon, LP has an excellent record of accident prevention. The Facility maintains records for all significant accidental chemical releases. This is a new process with no accidents within the past five (5) years resulting from the chemical release of materials covered under the EPA RMP regulation.\r\n\r\nD. EMERGENCY RESPONSE PROGRAM\r\n\r\nResponse actions are coordinated with the Glenpool Fire Department. An ERAP is in place to inform employees what to do in case of a release, fire, and to notify emergency responders when there is a need for a response.\r\n\r\nThe Facility maintains compliance with local, state and federal regulations including OSHA CFR 1910.38, and SARA Title III. The Glenpool ERAP provides the essential planning and training for protecting employees, the public, and the environment during emergency situations. Contained in these Plans are written procedures that outline the actions to occur for various types of emergencies that could occur at the Facility. These emergencies include: releases of chemical substances, fires, explosions, and medical events. The Programs address all aspects of emergency actions including:\r\n\r\n- Roles and responsibilities of personnel in the event of an incident;\r\n- Procedures for notifying employees that a release has occurred;\r\n- Procedures for evacuatio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000049960,
      "SummaryText": "n and accounting of personnel;\r\n- Procedures to notify local emergency response organizations and other appropriate authorities that a release has occurred;\r\n- Guidance on proper first aid treatment; and\r\n- Procedures for post incident actions.\r\n\r\nThe Glenpool Terminal also maintains its own dedicated emergency response equipment. This equipment includes portable fire extinguisher and first aid equipment. An inspection, testing and maintenance program is in place for emergency response equipment. Fire extinguishers are inspected monthly and receive annual maintenance per the International Fire Code and NFPA. Inspection reports for emergency response equipment are filed on-site. Three wet hydrants are also located on-site for fire department use.\r\n\r\nIn the event of an emergency involving the Glenpool Terminal butane blending system, it is the policy of the Facility to initially contact the Glenpool Fire Department and request their assistance. The Facility maintains a trained (annually) incipient fire capability. The Facility's emergency action plans are coordinated with the Fire Department and EMA. The Glenpool Fire Department is aware of the Facility's butane system, facility access and water sources. Glenpool Terminal maintains a vegetation control program to minimize plant growth within 10 feet of the butane systems.\r\n\r\nTexon, LP maintains a relationship with the Glenpool Fire Department. Tours and drills with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with the hazards, equipment, resources and personnel in the Facility.\r\n\r\nE. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nTexon, LP is continually striving to make the Glenpool Terminal the safest and most reliable workplace possible for its employees, neighbors and community. This includes all elements of the previously mentioned prevention program inclusive of periodic hazard reviews and periodic activities with loc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000049960,
      "SummaryText": "al 1st responders.\r\n\r\nThe goal of Texon, LP is to demonstrate continuous improvement in its health, environmental and safety performance. In addition, the Facility will work cooperatively with the community to address any concerns."
    }
  ]
}