{
  "FacilityID": 1000089982,
  "FacilityName": "WestRock CP,LLC",
  "FacilityStr1": "One Everitt Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Panama City",
  "FacilityState": "FL",
  "FacilityZipCode": "32401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12005",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.141667",
  "FacilityLongDecDegs": "-085.620833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.westrock.com",
  "FacilityEmailAddress": "tracie.norwood@westrock.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "WestRock Company",
  "Company2Name": null,
  "CompanyDUNS": 3289725,
  "Company2DUNS": 0,
  "OperatorName": "WestRock CP, LLC",
  "OperatorStr1": "One Everitt Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Panama City",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32401",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brett Tremblay",
  "RMPTitle": "General Manager",
  "FTE": 450,
  "OtherEPAFacilityID": "FDL962080129",
  "EPAFacilityID": "100000090956",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0050009-043-AV",
  "SafetyInspectionDate": "2016-01-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-10-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-10-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-10-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-10-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.1458,
  "FRS_Long": -85.62113,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111909,
      "AltID": "Water Treatment",
      "FacilityID": 1000089982,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000113222,
          "ProcessID": 1000111909,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        },
        {
          "Process_NAICS_ID": 1000113223,
          "ProcessID": 1000111909,
          "NAICSCode": "32213",
          "_desc": {
            "NAICS_CODE": "32213",
            "NAICS_DESCRIPTION": "Paperboard Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139911,
          "ProcessID": 1000111909,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639911,
          "ProcessID": 1000111909,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000111910,
      "AltID": "Pulp Bleaching",
      "FacilityID": 1000089982,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000113224,
          "ProcessID": 1000111910,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        },
        {
          "Process_NAICS_ID": 1000113225,
          "ProcessID": 1000111910,
          "NAICSCode": "32213",
          "_desc": {
            "NAICS_CODE": "32213",
            "NAICS_DESCRIPTION": "Paperboard Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139912,
          "ProcessID": 1000111910,
          "ChemicalID": 71,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639912,
          "ProcessID": 1000111910,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089982,
      "SummaryText": "EXECUTIVE SUMMARY\n\nWESTROCK CP, L.L.C (WESTROCK)\n\nPANAMA CITY MILL\n\n \n\nCorporate Policies\n\n \n\nThere are written WestRock Corporate Safety Guidelines and Programs that all facilities must follow. The guidelines also describe senior management's commitment to safety. The safety guidelines assign the responsibility and authority to the management team at each facility for conducting an effective safety program. \n\n \n\nPanama City Mill Policy\n\n \n\nIt is the policy of WestRock Panama City Mill to conduct its business to insure the likelihood of a release of chlorine or chlorine dioxide is reduced and if there is a release, the offsite consequence will be minimized. The chlorine and chlorine dioxide systems are maintained according to good engineering and maintenance practices. Our operating and maintenance employees utilizing the chlorine and the chlorine dioxide systems have been trained in the safe handling and use of chlorine and chlorine dioxide.\n\n \n\nIt is the policy of WestRock to promote employee participation in all programs, including the EPA Risk Management Program (RMP) and OSHA's Process Safety Management (PSM) program.\n\n \n\nDescription of Panama City Operations\n\n \n\nWestRock's Panama City facility is an integrated pulp and paper mill that produces Kraft linerboard and Bleached Market Pulp. Finished products are shipped via rail, truck and ship to customers all over the world. \n\n \n\nDescription of RMP-Covered Processes\n\n \n\nChlorine - Water Treatment\n\n \n\nThere are two locations on the mill site where chlorine is used to treat process water. The two systems are identical and located less than 500 feet apart. Chlorine is used from one-ton cylinders; two cylinders connected at each location. Chlorine vapors pass through an in-line electric heater, a regulator and vacuum shutoff valve, a flow meter, a flow control valve, a water driven vacuum inductor and are then injected into the process water line.\n\n \n\nChlorine Dioxide - Bleaching\n\n \n\nChlorine dioxide is generated on "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089982,
      "SummaryText": "site in a process using sodium chlorate and methanol in a strong sulfuric acid solution. Chlorine dioxide is removed, as generated, by vacuum and absorbed in cold water (38-40 F) to a concentration of 9 to 10 grams/liter.  The chlorine dioxide solution is stored for use in several bleaching stages throughout the Bleach Plant. \n\n \n\nFive-Year Accident History\n\n \n\nThere have been no releases of chlorine or chlorine dioxide that meet the reporting requirements of the RMP rule in the last five years  (2015-2020).\n\n \n\nGeneral Accidental Release Prevention Program\n\n \n\nChlorine Dioxide-Bleaching and Chlorine- Water Treatment\n\n \n\nWestRock, Panama City has an OSHA PSM program in place covering its chlorine dioxide and chlorine operations. This PSM Level 3 Prevention Program meets the requirements of EPA's RMP rule and is utilized as the accident prevention section of the Panama City facility's RMP.\n\n \n\nGeneral Accidental Release Prevention Activities at the Mill\n\n \n\nThe mill has a staff of experienced and knowledgeable employees that receive safety and environmental training annually on numerous EPA and OSHA related programs. Each employee working with chlorine or chlorine dioxide has experience and training in the hazards associated with these chemicals.   Each covered process is manned 24 hours a day by experienced operators that are knowledgeable in the emergency shut down procedures necessary to mitigate releases to the environment.\n\n\n\nEmergency Response Program\n\n\n\nThe mill has a trained Emergency Response Team that is qualified at the Haz-Mat Technician level.  These employees will respond to an emergency release of chlorine or chlorine dioxide. Annual confined space rescue and Haz-Mat training for the Emergency Response Team has been delayed this year due to the COVID 19 pandemic.  If allowed by Corporate Safety precautions, this will be scheduled for Dec. 2020.\n\n\n\nIn the event of  possible offsite consequence from the release of chlorine or chlorine dioxide, the Bay Co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089982,
      "SummaryText": "unty Emergency Management Center will be notified by calling 911. Bay County Emergency Management Agency has been informed of the use of one-ton cylinders of chlorine and a 244,000-gallon tank of a water solution of chlorine dioxide.\n\n \n\nInitial response to a 911 call will come from the City of Springfield Fire Department. If the incident requires additional equipment or manpower, the Springfield Fire Department will call the Bay County Emergency Management Agency for the needed support.\n\n \n\nThe mill has a written Emergency Response Plan and there are copies maintained throughout the mill.  \n\n \n\nAny event involving a release of chlorine or chlorine dioxide will be investigated by a qualified team and a root cause will be determined. An incident investigation team comprised of Safety Department personnel, production management and hourly operators will be formed.  All findings and recommendations of the investigative team will be presented to facility management and promptly addressed.\n\n \n\nThe Bay County Emergency Management Agency and local responding Fire Department are given the opportunity to inspect the site and make recommendations for inclusion in the Risk Management Program development. These agencies are invited to familiarize their teams with the facility on an annual basis.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe WestRock Company's Safety Code of Conduct states, in part, \"We hold safety and health as our highest core value.\" The Panama City mill is constantly improving upon its safety program. A monthly Safety and Housekeeping Calendar ensures all safety systems are maintained in the highest level of effectiveness and preparedness.  We have instituted Safety Thursdays where all maintenance work is aimed at safety work orders in a particular department. We have also added personnel from the hourly ranks as Safety Advocates in a full-time position.  We have added another safety professional to our Safety Department to assist with the daily management of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089982,
      "SummaryText": "our safety programs.  As process and systems change, so does our methodology for protecting our employees. The safety of our employees is our number one priority. As a residual effect, our neighbors in the community and the surrounding area benefit. Less likelihood of problems within the mill means less likelihood of problems for our neighbors. We will continue to find ways to actively engage our work force in the safety process and continue our Behavior-Based safety observation program. We have created a new observation form to assist all employees in documenting their safety observations.  It's a pocket sized card that walks the employee through the \"Take Two\" steps to review jobs prior to commencement.  Our mill remains one of the best in our Division for safety related metrics.\n\n"
    }
  ]
}