{
  "FacilityID": 1000039382,
  "FacilityName": "South Jersey Terminal",
  "FacilityStr1": "1709 South Burlington Road",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeton",
  "FacilityState": "NJ",
  "FacilityZipCode": "08302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34011",
  "LEPC": "Upper Deerfield Twp OEM",
  "FacilityLatDecDegs": "39.456960",
  "FacilityLongDecDegs": "-75.203365",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.crestwoodlp.com",
  "FacilityEmailAddress": "Joseph.Maher@crestwoodlp.com",
  "FacilityDUNS": 79163032,
  "ParentCompanyName": "Crestwood Services, LLC",
  "Company2Name": "Crestwood Equity Partners, LP",
  "CompanyDUNS": 0,
  "Company2DUNS": 39949222,
  "OperatorName": "Crestwood Services, LLC",
  "OperatorStr1": "P.O. Box 430",
  "OperatorStr2": "9224 Tupman Road",
  "OperatorCity": "Tupman",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93276",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216394",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-09-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-10-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-03-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048350,
      "AltID": "LPG Transloading/Storage",
      "FacilityID": 1000039382,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000058742,
          "ProcessID": 1000048350,
          "ChemicalID": 155,
          "Quantity": 3032640.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000050938,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 129
            },
            {
              "FlamMixChemID": 1000050939,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000050940,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000050941,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000050942,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 95
            },
            {
              "FlamMixChemID": 1000050943,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000050944,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000050945,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 154
            },
            {
              "FlamMixChemID": 1000050946,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 131
            },
            {
              "FlamMixChemID": 1000050947,
              "ProcessChemicalID": 1000058742,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000048793,
          "ProcessID": 1000048350,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000041961,
              "Process_NAICS_ID": 1000048793,
              "SafetyReviewDate": "2014-11-21 00:00:00",
              "PHA_Date": "2013-01-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-07-07 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": "Terrorism",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Temperature, pressure, & liquid level indicators",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Installation of MCC center for increased electrical safety",
              "OpProceduresReviewDate": "2014-01-14 00:00:00",
              "TrainingReviewDate": "2014-11-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "hands on/peer mentoring",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-01-20 00:00:00",
              "EquipmentInspectionDate": "2014-02-22 00:00:00",
              "EquipmentTested": "Monthly PM - crankcase, V-belt, anchor bolt inspection on Compressor #1",
              "ChangeMgmtDate": "2014-01-09 00:00:00",
              "ChangeMgmtReviewDate": "2014-11-21 00:00:00",
              "PreStartupReviewDate": "2012-10-24 00:00:00",
              "ComplianceAuditDate": "2013-10-28 00:00:00",
              "AuditCompletionDate": "2014-10-31 00:00:00",
              "IncidentInvestigationDate": "2014-01-10 00:00:00",
              "InvestigationChangeDate": "2014-01-10 00:00:00",
              "ParticipationPlansReviewDate": "2014-11-21 00:00:00",
              "HotWorkPermitReviewDate": "2014-11-21 00:00:00",
              "ContractorSafetyReviewDate": "2014-11-21 00:00:00",
              "ContractorSafetyEvalDate": "2013-10-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "LPG Storage and Loading\n\n\n\nThis facility provides for the transfer of liquefied butane (normal, iso, and mixed), propane, propylene, and  propane ? propylene mix. (hereafter referred to as LPG) under pressure from stationary (detached from locomotive) pressure tank/rail cars (maximum inventory of ten [10] units, at approximately 31,000 gallons of LPG per unit [33,600 gallons of water capacity]. The LPG is transferred to storage vessels consisting of four (4) 60,000 gallon LPG storage cylinders and four (4) 30,000 LPG storage cylinders via four[4] transloading towers. In addition, liquid transfers can occur directly from the railcars via one (1) of five [5] total transloading towers to transport vehicles without prior transfer to a storage cylinder.  The stored liquefied gases are loaded to transport vehicles from the storage cylinders via six (6) loading stations. Liquid transfer is also available via five (5) unloading stations for transport vehicles.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000050025,
                  "PreventionProgram3ID": 1000041961,
                  "ProcessChemicalID": 1000058742
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039382,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-11-21 00:00:00",
    "ERTrainingDate": "2014-12-23 00:00:00",
    "CoordinatingAgencyName": "Upper Deerfield Twp. OEM",
    "CoordinatingAgencyPhone": "8564513811",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "DHS Chemical Facility Anti-Terrorism Standard"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039382,
      "SummaryText": "Executive Summary:  Crestwood Services LLC dba South Jersey Terminal was constructed in accordance with the National Fire Protection Association (NFPA Code) #58 (2004 Edition) for Liquefied Petroleum Gas Storage, and it is the facility's policy to adhere to all applicable federal, state and local laws/codes. It is the intent of South Jersey Terminal to incorporate the most recent construction and procedural guidance (NFPA #58-2011) into this process.  \n\n\n\nSouth Jersey Terminal provides for the transfer of liquefied butane (normal, iso, and mixed), propane, propylene, and  propane - propylene mix. (hereafter referred to as LPG) under pressure from stationary (detached from locomotive) pressure tank/rail cars. The LPG is transferred to storage vessels via transloading towers. In addition, liquid transfers can occur directly from the railcars via transloading towers to transport vehicles without prior transfer to a storage vessel.  The stored liquefied gases are loaded to transport vehicles from the storage vessels via loading stations.  Most of these stations use fixed facility equipment for transfer power, but two of the stations at the former Modern Gas setting, use the truck pumps to provide pressure for the liquid transfer. Liquid transfer is also available via unloading stations for transport vehicles to offload primarily in the case of over loading for most tanks, but the Modern Gas tanks can only be filled via transport.  They are not hard piped to the rail load system. For modeling purposes, the flammable mixture was modeled as butane, the component of single greatest consequence.\n\n\n\nEmergency Contacts\n\nThere are two Crestwood employees who serve as the primary emergency contacts during off hours: the Terminal Supervisor and the Senior Environmental, Safety, and Regulatory Adviser. Both employees can be reached 24 hours per day and are local to the facility.\n\nEmergency planning has started with the local fire department and Office of Emergency Management.\n\nAn "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039382,
      "SummaryText": "environmental cleanup company is under contract to provide additional assistance in the event of an emergency.\n\n\n\nEmployee Participation Plan\n\nThe written employee participation plan outlines the various ways that employees are involved in the overall risk management plan. There is a copy of the written plan in the office trailer. The Terminal Supervisor is charged with implementing the plan. The employees are not covered by a collective bargaining agreement.\n\nAn e-mail is sent to the employees as a reminder twice per year asking them for their suggestions and input for the risk management program. Additionally, the Terminal Supervisor maintains an open door policy, and the operators may make suggestions at any time. There is a daily \"tool box\" meeting covering environmental, safety, and health issues at which any questions or suggestions regarding risk management can be raised.\n\n\n\nProcess Safety Information\n\nThe required Process Safety Information has been accumulated by the Engineering Department, is stored on site, and is available to employees. The process safety information was also available during the completion of the process hazard analysis. The Terminal Supervisor is responsible for maintaining the process safety information.\n\n\n\nProcess Hazard Analysis\n\nThe initial process hazard analysis using the HAZOP methodology was completed on January 7, 2013. Non-critical recommendations were developed from the process hazard analysis. The process hazard analysis and list of recommendations are stored on site. The Terminal Supervisor is responsible for resolving\n\nthe recommendations.\n\n\n\nOperating Procedures\n\nComprehensive operating procedures have been developed by a team of Crestwood employees. The\n\nprocedures include all of the operations covered by the regulation. There is a procedure outlining how the operating procedures will\n\nbe reviewed annually to ensure they are current and updated as necessary to reflect current conditions. The written operating procedures"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039382,
      "SummaryText": " are maintained on site, and the Terminal Supervisor has the responsibility of maintaining them.\n\n\n\nTraining\n\nEmployees have been trained and tested as required by the training procedure. Training was performed in both the classroom and on the job format. Testing includes written tests, oral exams, and demonstration.\n\nSuccessful completion of the training program and passing the exams results in certification. The training program and associated documentation are kept on site, and the Terminal Supervisor has the responsibility of ensuring compliance with the training program.\n\n\n\nContractors\n\nContractors working on the regulated equipment are not expected. However, if it would be necessary, there is a comprehensive contractor program. The program includes: procedures for selecting contractors based on their safety and health performance and safety and health systems; a background check of both the contractor company as well as the individual contractor employee(s) that will work at the facility; an annual\n\ntraining program covering applicable risk management program training, as well as safety and health and emergency information; an annual written test with a required minimum passing score of 80%; and a contractor auditing procedure to ensure contractors are working in compliance with Crestwood requirements while on site. The Environmental safety and Regulatory Group is responsible for selecting contractors to work\n\non site and ensure the background checks are completed. That information is forwarded to the Terminal Supervisor and kept on site along with the other contractor information.\n\n\n\nPre-Start-up Safety Review\n\nThe PSSR is kept on site, and the Terminal Supervisor is responsible for maintaining records including resolution of the action items.\n\n\n\nMechanical Integrity\n\nThere is not much regulated equipment associated with this operation. However, a mechanical integrity program has developed to ensure equipment is inspected and maintained properly. Personnel ch"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039382,
      "SummaryText": "arged with inspecting and maintaining the regulated equipment has been trained. The mechanical integrity information is kept on site, and the Terminal Supervisor is responsible for implementation of the program.\n\n\n\nSafe Work Practices\n\nCrestwood has long maintained a corporate safety manual that includes written safe work practices. The applicable safe work practices applicable to this facility include hot work and lockout/tag out. There are no plans to break into piping or enter confined spaces at this time, so those programs are not included in the safe work practices. If this were to change in the future, the programs will be added and employees trained. The written safe work practices are kept on site, and the Terminal Supervisor is responsible for their implementation.\n\n\n\nManagement of Change\n\nThere is a written management of change process, which fully defines the scope of what changes are covered and the process necessary to approve implementation of those changes. A comprehensive risk evaluation checklist is included as part of the procedure and approval by the Terminal Supervisor, operator, and Senior Environmental Safety and Regulatory Adviser are required before the change can be made. The management of change process has not been used. All management of change documentation is maintained on site, and the Terminal Supervisor ensure compliance with the procedure.\n\n\n\nIncident Investigation\n\nThere is a written incident investigation procedure and investigation form. Incidents are investigated by a team including the Terminal Supervisor and operator, plus anyone involved and any witnesses. Specialists or subject matter experts can be added to the team if necessary. There have not been any incidents requiring investigation. The Terminal Supervisor has the responsibility for ensuring investigations are completed and maintain the records on site.\n\n\n\nEmergency Response\n\nOn site employees are trained to the basic first aid/CPR, incipient firefighting, and HAZMAT A"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039382,
      "SummaryText": "wareness level. Crestwood has met with and coordinated emergency preparedness and response operations with the local fire department and office of emergency management. The Terminal Supervisor maintains the written plan and records on site.\n\n\n\nCompliance Audits\n\nNo previous compliance audits have been completed. There is a written procedure outlining out the audit will be completed in three years as required by the regulation. The audit will be completed by a team including at least one operator. The Terminal Supervisor is responsible for maintaining the records on site and implementing the procedure.\n\n\n\nRelease Scenarios\n\nThe worst case scenario involved a vapor cloud explosion. There are approximately 277 residential population within the distance to the endpoint.\n\nThe alternate release scenario involved a BLEVE. There are approximately 430 residential population within the distance to the endpoint.\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}