{
  "FacilityID": 1000028291,
  "FacilityName": "Rynel Inc.",
  "FacilityStr1": "11 Twin Rivers Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Wiscasset",
  "FacilityState": "ME",
  "FacilityZipCode": "04578",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23015",
  "LEPC": "Lincoln County LEPC",
  "FacilityLatDecDegs": "43.962029",
  "FacilityLongDecDegs": "-69.695767",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.molnlycke.com",
  "FacilityEmailAddress": "Info@rynel.com",
  "FacilityDUNS": 77477412,
  "ParentCompanyName": "Molnlycke Health Care US, LLC",
  "Company2Name": null,
  "CompanyDUNS": 165301032,
  "Company2DUNS": 0,
  "OperatorName": "Rynel Inc.",
  "OperatorStr1": "11 Twin Rivers Drive",
  "OperatorStr2": null,
  "OperatorCity": "Wiscasset",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04578",
  "OperatorZipCodeExt": null,
  "FTE": 67,
  "OtherEPAFacilityID": "04578RYNLN11TWI",
  "EPAFacilityID": "100000217865",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-14 00:00:00",
  "SafetyInspectionBy": "Safety Works",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-05-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-05-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034542,
      "AltID": "foam production",
      "FacilityID": 1000028291,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041798,
          "ProcessID": 1000034542,
          "ChemicalID": 44,
          "Quantity": 55226.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000041799,
          "ProcessID": 1000034542,
          "ChemicalID": 20,
          "Quantity": 13806.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000034898,
          "ProcessID": 1000034542,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028291,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-08-22 00:00:00",
    "ERTrainingDate": "2014-08-14 00:00:00",
    "CoordinatingAgencyName": "Lincoln County EMA",
    "CoordinatingAgencyPhone": "2078827332",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Code of Maine Rules Chapter 851 and 855 (applicable sections only)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028291,
      "SummaryText": "Executive Summary for Risk Management Plan\n\nRynel Inc.\n\nWiscasset, Maine\n\n\n\nRynel Inc. (Rynel) has prepared the following elements of an Executive Summary in accordance with 40 CFR Section 68.155 as a component of its Risk Management Plan (RMP):\n\n\n\nA.    Accidental Release Prevention and Emergency Response Polices at Rynel\n\nRynel takes the onsite storage and use of toluene diisocyanate very seriously and has developed and incorporated safety and emergency response procedures in its operating procedures to ensure the safety of its employees and the surrounding community.  Rynel has conducted a hazard analysis of storing TDI drums in their warehouse and has implemented additional safety procedures to minimize the accidental release of TDI.  Some of these procedures include TDI drum designation and segregation, secondary containment, protection from fork lift driver error, storage location away from shipping doors, etc.).  Spill response equipment is readily available and fully stocked and inspected monthly.  Rynel has prepared a neutralizing solution that can be applied immediately to any TDI spill.  Once applied, the neutralizing solution will react with TDI removing its toxic component.  Employees who work with TDI have received Hazard Communication and respirator training.  Rynel has a written respiratory program and respirator fit test and pulmonary tests are conducted on applicable employees annually.  The employees (who work with TDI and Emergency Responders) have received training on the proper application of the neutralizing solution.  As mentioned below, Rynel conducts annual training on the implementation of its Integrated Contingency Plan (which includes the Facility Emergency Response Plan for TDI) and a mock drill of the ICP with emergency responding agencies.  Rynel also conducts annual exercise of its Emergency Evacuation Plan.   Rynel has employees with considerable education (2 PhD Chemists, chemists and engineers) and experience and are very knowledgeab"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028291,
      "SummaryText": "le working with TDI.\n\n\n\nB.    Regulated Substances Handled at Rynel\n\nRynel stores and uses Mondur Grade B (Mondur) which contains 80% 2,4-toluene diisocyanate (TDI) and 20% 2,6-TDI, both of which are listed in 40 CFR Section 68.130 as regulated substances under the RMP.  Since Rynel stores 10,000 pounds or more of Mondur in an area within their warehouse, it is required to comply with EPA's RMP.  Mondur is used in manufacturing operations at the facility to produce medical and cosmetic-grade hydrophilic polyurethane foam products. Included in Rynel's product lines are advanced wound care products which were developed to meet the medical market demand for wound care devices.\n\n\n\nC.    The General Accidental Release Program and Chemical-Specific Prevention Steps\n\nIn addition to being subject to EPA's RMP at the Program 1 Level, Rynel is subject to 29 CFR 1910.38, OSHA's Emergency Action Plan, CMR Chapter 851 and 855 for Hazardous Waste Contingency Planning and Title 37-B M.R.S.A. Section 795(1) and EPCRA for Facility Emergency Response Planning for an Extremely Hazardous Substance (TDI).  Rynel conducts periodic internal environmental and safety audits that review environmental and safety requirements for the storage of TDI on site. \n\n\n\nD.    The Five-Year Accident History\n\nRynel has not had any accidents that have resulted in any offsite death, injury or response or restoration activities at an environmental receptor that were associated with the release of Mondur since it began operations in 1973.\n\n\n\nE.    The Emergency Response Program\n\nRynel has developed an Integrated Contingency Plan (ICP) which incorporates a Hazardous Waste Contingency Plan (in accordance with 40 CFR 264.52), a Spill Prevention Control and Cleanup Plan for Hazardous Matter (in accordance with Title 38 M.R.S.A., Section 1318-C) and a Facility Emergency Response Plan (in accordance with Title 37-B, Section 795).  This ICP addresses the storage, handling and management requirements of Mondur as well as the em"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028291,
      "SummaryText": "ergency response procedures and protocols for managing a release of Mondur.  Emergency Coordinators and other responsible persons are trained annually on the implementation of the ICP including the types of response required for managing an incidental release of Mondur or one requiring an emergency response. Rynel conducts a mock drill of the ICP on an annual basis in accordance with Title 38 M.R.S.A., Section 795(2) and invites representatives from the Town of Wiscasset Fire and Police departments, and the Lincoln County Emergency Management Agency (LCEMA) to participate.  Rynel also maintains annual emergency response agreements with the Town of Wiscasset Fire and Police departments, LCEMA, ENPRO Services, Inc. (local emergency response contractor), Mid Coast Hospital and the Maine Department of Environmental Protection.\n\n\n\nF.    Planned Changes to Improve Safety\n\nThere have been no accidents or accidental (non-incidental) releases of TDI at Rynel since it began manufacturing operations at its Wiscasset facility in 2005.  Currently there are no planned changes to improve safety at this time."
    }
  ]
}