{
  "FacilityID": 1000044786,
  "FacilityName": "Eustace Gas Processing Plant",
  "FacilityStr1": "16401 CR 2854",
  "FacilityStr2": null,
  "FacilityCity": "Eustace",
  "FacilityState": "TX",
  "FacilityZipCode": "75124",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48213",
  "LEPC": "Henderson County LEPC",
  "FacilityLatDecDegs": "32.265833",
  "FacilityLongDecDegs": "-096.038889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tristream East Texas, LLC",
  "OperatorStr1": "16401 CR 2854",
  "OperatorStr2": null,
  "OperatorCity": "Eustace",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75124",
  "OperatorZipCodeExt": null,
  "FTE": 31,
  "OtherEPAFacilityID": "TXD000750703",
  "EPAFacilityID": "100000063432",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "SOP-00863",
  "SafetyInspectionDate": "2014-02-10 00:00:00",
  "SafetyInspectionBy": "Texas Railroad Commission",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 32.278099,
  "FRS_Long": -96.037435,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055413,
      "AltID": "NGL Extraction",
      "FacilityID": 1000044786,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067551,
          "ProcessID": 1000055413,
          "ChemicalID": 155,
          "Quantity": 90000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000057498,
              "ProcessChemicalID": 1000067551,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000057499,
              "ProcessChemicalID": 1000067551,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000057500,
              "ProcessChemicalID": 1000067551,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000057501,
              "ProcessChemicalID": 1000067551,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000057502,
              "ProcessChemicalID": 1000067551,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000057503,
              "ProcessChemicalID": 1000067551,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 1000067552,
          "ProcessID": 1000055413,
          "ChemicalID": 98,
          "Quantity": 51000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000056302,
          "ProcessID": 1000055413,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000046332,
              "Process_NAICS_ID": 1000056302,
              "SafetyReviewDate": "2009-09-21 00:00:00",
              "PHA_Date": "2010-04-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-09-21 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "H2S Monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-06-11 00:00:00",
              "TrainingReviewDate": "2014-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-09 00:00:00",
              "EquipmentInspectionDate": "2014-06-09 00:00:00",
              "EquipmentTested": "#2 Electrical Generator",
              "ChangeMgmtDate": "2013-06-17 00:00:00",
              "ChangeMgmtReviewDate": "2013-06-17 00:00:00",
              "PreStartupReviewDate": "2013-06-17 00:00:00",
              "ComplianceAuditDate": "2014-04-23 00:00:00",
              "AuditCompletionDate": "2014-07-15 00:00:00",
              "IncidentInvestigationDate": "2014-03-13 00:00:00",
              "InvestigationChangeDate": "2014-03-20 00:00:00",
              "ParticipationPlansReviewDate": "2014-03-14 00:00:00",
              "HotWorkPermitReviewDate": "2014-06-10 00:00:00",
              "ContractorSafetyReviewDate": "2013-06-17 00:00:00",
              "ContractorSafetyEvalDate": "2014-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000055960,
                  "PreventionProgram3ID": 1000046332,
                  "ProcessChemicalID": 1000067551
                },
                {
                  "PrimaryKey": 1000055961,
                  "PreventionProgram3ID": 1000046332,
                  "ProcessChemicalID": 1000067552
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044786,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-10-21 00:00:00",
    "ERTrainingDate": "2013-10-28 00:00:00",
    "CoordinatingAgencyName": "Henderson County LEPC",
    "CoordinatingAgencyPhone": "9036777242",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044786,
      "SummaryText": "ment.   This participation begins with well-established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining PSM rule compliance based on their knowledge, skill, job responsibilities, and experience.  \r\n\r\nProcess Safety Information \r\n\r\nTristream maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as design basis/configuration information for key process parameters.  Specific departments within the plant are assigned responsibility for maintaining up-to-date process safety information.  \r\n\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDSs).  This information is supplemented, when required, by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  In addition, the plant has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\r\n\r\nThe plant also maintains documentation that provides information about the design and construction of process equipment.  Equipment information includes construction materials, design pressure, and temperature and electrical ratings.  This information provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nProcess Hazard Analysis (PHA)\r\n\r\nThe Eustace Gas Processing Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each proces"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044786,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nTristream East Texas, LLC (Tristream) has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility¿s processes.  The Tristream policy is to implement reasonable controls to prevent foreseeable releases of substances.  \r\n\r\nDESCRIPTION OF THE STATIONARY SOUCE AND REGULATED SUBSTANCES\r\n\r\nTristream operates the Eustace Gas Processing Plant located in Henderson County, Texas.  This facility receives wellhead gas from wells via pipeline.  The raw gas is dehydrated and contaminants removed.  Marketable natural gas is delivered via pipelines.  Natural gas liquids are extracted and stored on site.  The extracted natural gas liquids include ethane, propane, butanes, and pentanes as pure products or in mixtures that are delivered to market via pipeline and transport vehicles.  The Eustace Gas Processing Plant does not use or store any regulated toxic substances above the EPA set threshold levels.  This facility is classified as a Program Level 3.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe Eustace Gas Processing Plant has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40 CFR 68.42.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe following is a summary of the accident prevention program in place at the Eustace Gas Processing Plant.  Because plant processes are subject to EPA¿s RMP regulations and to OSHA¿s PSM standards, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEmployee Participation\r\n\r\nTristream and the Eustace Gas Processing Plant actively encourage all levels of employees and contract employees to participate in creating a safe work environ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000044786,
      "SummaryText": "eable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nTristream is committed to operating the Eustace Gas Processing Plant in a safe manner for workers, the public, and the environment.  Tristream personnel utilize auditing processes to ensure the plant complies with safe operations of its processes.  In the event improvements in safety can be realized through auditing efforts, actions are planned and instituted to respond to safety enhancements of operating practices.  Improvements to safety are a continual process at the plant."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044786,
      "SummaryText": "s is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\n\r\nThe Eustace Gas Processing Plant primarily uses the What If/Checklist technique to perform these evaluations.  This technique is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating and maintenance experience, as well as engineering expertise.  This team identifies and evaluates hazards of the process, as well as accident prevention and mitigation measures and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nThe PHA team findings are promptly and systematically addressed.  The Eustace Gas Processing Plant assures that the recommendations are documented and resolved in a timely manner. This documentation includes the actions to be taken and a written schedule of completion dates.   The plant also provides proof of communication with operating, maintenance, and other employees whose work assignments are in the process and who may be affected by the recommendations. \r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years by the PHA team.  \r\n\r\nOperating Procedures\r\n\r\nThe Eustace Gas Processing Plant maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are perio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044786,
      "SummaryText": "dically reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary through the management of change process. \r\n\r\nTraining\r\n\r\nTo complement the written process operation procedures, the Eustace Gas Processing Plant has implemented a comprehensive training program for all employees. New employees receive job specific basic training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\r\n\r\nHot Work Permit\r\n\r\nThe Eustace Gas Processing Plant issues a hot work permit for all hot work operations conducted on or near a covered process.  The Eustace Gas Processing Plant provides Hot Work Permit training to all plant employees. Copies of issued work permits are maintained in Operations and Maintenance for a period of 1 year following completion of work.\r\n\r\nContractors\r\n\r\nThe Eustace Gas Processing Plant periodically uses contractors to perform maintenance or repair, turnaround, major renovations, or specialty work on or adjacent to a covered process.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) are trained in the work practices necessary to safely perform his/her job, (2) have received and understood the training required and carry a training document card while on location, (3) follow the safety rules of the location including the safe work practices, (4) advise the plant of any unique hazards presented by the contractor, and (5) notify the facility of all illnesses and injuries that occur in the process areas.  \r\n\r\nPre-Startup Safety Reviews (PSSRs)\r\n\r\nThe Eustace Gas Processing Plant conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044786,
      "SummaryText": ", procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an additional check to make sure that construction and equipment are in accordance with design specification, that adequate safety, operating, maintenance, and emergency procedures are in place, and that training of each employee involved in operating the process or equipment has been completed. A standard checklist is used to document compliance.\r\n\r\nMechanical Integrity\r\n\r\nThe Eustace Gas Processing Plant has well-established programs, procedures and practices that are required to ensure that equipment used to process, store, or handle lightly hazardous chemicals and/or flammable gas or liquid is designed, constructed, installed, and maintained to minimize the risk of a release. Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e., monitoring devices, sensors, alarms, and interlocks).\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employee¿s job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to ensure safe operation.\r\n\r\nManagement of Change \r\n\r\nThe Eustace Gas Processing Plant has a comprehensive system to manage and document changes to all covered processes. A systematic approach is followed to control and manage facility changes in order to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment, or the environment.  Employees involved in process operation"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000044786,
      "SummaryText": "s and maintenance and contract employees whose job tasks might be affected by process changes are informed of and trained in the change prior to process start-up.\r\n\r\nIncident Investigation\r\n\r\nThe Eustace Gas Processing Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. \r\n\r\nEmergency Planning and Response\r\n\r\nThe Eustace Gas Processing Plant retains a written site specific formal emergency response plan which includes the designated actions the company and all personnel will take to ensure personal safety from fire and other emergencies.  The plan outlines actions that company technicians and contract employees are to take when there is an unwanted release of highly hazardous chemicals.  The intent of this plan is to facilitate the prompt evacuation of employees when necessary and to account for all personnel.  The emergency plan also includes procedures for handling small releases.\r\n\r\nCompliance Audits\r\n\r\nTo help ensure that the accident prevention program is properly functioning, the Eustace Gas Processing Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  The audit team includes those knowledg"
    }
  ]
}