{
  "FacilityID": 1000091525,
  "FacilityName": "Rust-Oleum Corporation",
  "FacilityStr1": "16410 Industrial Lane",
  "FacilityStr2": null,
  "FacilityCity": "Williamsport",
  "FacilityState": "MD",
  "FacilityZipCode": "21795",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24043",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "39.59836",
  "FacilityLongDecDegs": "-077.80147",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5094420,
  "ParentCompanyName": "RPM, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 114155651,
  "Company2DUNS": 0,
  "OperatorName": "Rust-Oleum Corporation",
  "OperatorStr1": "11 Hawthrone Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Vernon Hills",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60061",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Shepherd",
  "RMPTitle": "Plant Manager",
  "FTE": 203,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119604",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-10-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-01-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-01-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-01-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.598,
  "FRS_Long": -77.80316,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000113712,
      "AltID": "Aerosol Filling",
      "FacilityID": 1000091525,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115085,
          "ProcessID": 1000113712,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000142074,
          "ProcessID": 1000113712,
          "ChemicalID": 155,
          "Quantity": 133857.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000125809,
              "ProcessChemicalID": 1000142074,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000125810,
              "ProcessChemicalID": 1000142074,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000642074,
          "ProcessID": 1000113712,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091525,
      "SummaryText": "The Rust-Oleum's Hagerstown facility produces a variety of solvent and water-based paints and coatings for both brush and aerosol applications.  The 13.14 acre site has a manufacturing plant with associated parking lots and currently houses both the administrative office and the plant manufacturing operations.  A Risk Management Program (RMP) has been implemented at facility for the prevention of a release of RMP regulated flammable substances.  In addition, the groups within the facility understand the lines of responsibility and communication relative to an accidental release of RMP regulated flammable substances; and emergency response protocols have been developed and coordinated with offsite responders, including the Williamsport Fire Department and Williamsport Police Department.  \n\n\n\nA.  HAGERSTOWN'S POLICIES FOR ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE \n\n    In addition to this RMP, the facility is also subject to the OSHA Process Safety Management (PSM) requirements (40 CFR 1910.119), and as such, the facility's policy is to comply with each of the 14 elements of its PSM management system.  Each of the 14 elements has been complied with and applied to the propellant storage tank, which is an integral part of the aerosol filling operation.  The propellant storage tank and its ancillary systems have also been incorporated into the facility Spill Prevention Control and Countermeasure (SPCC) Plan and Storm Water Pollution Prevention Plan (SWP3), both of which are designed to minimize any release to the environment and exposure to the plant personnel.  \n\n\n\n    The facility, as a matter of policy, has also developed, implemented and maintained an Emergency Response Plan detailing the response actions of plant personnel to fire, incidents/accidents, explosion, releases, spills, severe weather, and natural disasters. The facility trains all plant personnel on all of these items on an annual basis in addition to providing fire extinguisher training for incipie"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091525,
      "SummaryText": "nt fires and conducting emergency response drills.  The facility also has an Emergency Response Team (ERT).  If an emergency were to occur, the facility policy is for the ERT to respond, and if needed, to contact the Washington County Fire Department.  \n\n\n\n    Emergency response protocols have been developed and coordinated with offsite responders, including the Williamsport Fire Department and Williamsport Police Department.  As part of its emergency response and preparedness efforts, the facility invited the Williamsport Fire Department to attend a tour and emergency preparedness discussion at the facility on September 14, 2020.  ERT and safety professionals from the facility showed and discussed the facility hazards with the fire department's firefighters and leadership, including the RMP and PSM regulated flammable substances and locations; discussed the facility emergency response protocols; and sought input from the Williamsport Fire Department on how to continuously improve its emergency protocols and coordination of unified command.     \n\n\n\nB.  STATIONARY SOURCE AND REGULATED CHEMICAL(S)\n\n    The facility is a paint manufacturing plant that produces aerosols.  The facility utilizes a flammable mixture of propane (71% v/v) and butane (29% v/v) as aerosol propellant.  The propellant system consists of a 30,000 gallon outside storage tank with subsequent ancillary piping system to two (2) gas houses where the aerosol cans are pressurized with the propellant.  Both the propane and butane are RMP regulated flammable substances.  The amount of the propellant stored onsite at any one time is approximately 133,857 lbs.  This exceeds the threshold quantity for accidental release prevention of the 10,000 lbs for either propane or butane, and thus makes the facility subject to the RMP.  The propellant mixture is the only applicable RMP regulated substance at the facility.  \n\n\n\n    The aforementioned flammable mixture handled at the plant is operated and maintained in accordance"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091525,
      "SummaryText": " with NFPA 58: Standard for Storage and Handling of Liquefied Petroleum Gases, as well as equipment manufacturer operation and maintenance requirements and recommendations and with appropriate and applicable industry standards and practices.  \n\n\n\nC.  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n    The prevention program utilized by the facility covers not only the propellant system, but the entire paint manufacturing and aerosol filling processes.  Specific actions to prevent the accidental release of the regulated chemicals are associated with the implementation of the SPCC, SWP3, and PSM Plans and Programs.  Training is provided for all appropriate personnel on each of these programs on an annual basis.  This systemic approach to process safety involves all employees and strives for continuous improvement in the facility's overall safety program and culture.  The training and safety awareness of our operations, maintenance, and management personnel are key elements in reducing and mitigating accidents. \n\n\n\nD.  FIVE YEAR ACCIDENT HISTORY\n\n    This facility has reported no incidents/accidents during the previous five-years, prior to this plan submission that resulted in a release from a covered process that incurred injuries, deaths, significant property damage or environmental impacts either on site or offsite.  \n\n\n\nE.  PLANNED CHANGES TO IMPROVE SAFETY\n\n    The facility will continue to perform frequent training on each of the programs mentioned above that affect safety and accidental release prevention.  EHS and plant leadership will continue to be involved with Engineering, Maintenance, and Operations at the facility to ensure that the process and process modifications are designed and modified to account for and mitigate recognized hazards and loss of containment.  \n\n"
    }
  ]
}