{
  "FacilityID": 1000065183,
  "FacilityName": "Global Fort Edward Rail Yard",
  "FacilityStr1": "446 Lock 8 Way",
  "FacilityStr2": null,
  "FacilityCity": "Hudson Falls",
  "FacilityState": "NY",
  "FacilityZipCode": "12839",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36115",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "43.278061",
  "FacilityLongDecDegs": "-73.570118",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.globalp.com",
  "FacilityEmailAddress": "tkeefe@globalp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Global Companies LLC",
  "Company2Name": null,
  "CompanyDUNS": 19177757,
  "Company2DUNS": 0,
  "OperatorName": "Global Companies LLC",
  "OperatorStr1": "800 South Street",
  "OperatorStr2": null,
  "OperatorCity": "Waltham",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02454",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sid Decell",
  "RMPTitle": "Terminal Manager",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236407",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-08-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-08-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-08-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-08-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081739,
      "AltID": "LPG Rail Storage",
      "FacilityID": 1000065183,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000082981,
          "ProcessID": 1000081739,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101801,
          "ProcessID": 1000081739,
          "ChemicalID": 98,
          "Quantity": 6165000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601801,
          "ProcessID": 1000081739,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065183,
      "SummaryText": "Accidental release prevention and emergency response policy: \n\n\n\nGlobal intends to operate the facility in a manner that prevents significant incidents or substantial threats of incidents through adherence to legal requirements, management systems, procedures and personnel training.  Global understands the shared value of safety and environmental protection for our employees, the public and the communities we serve as a vital component of our energy infrastructure. \n\n\n\nStationary Source and Regulated Substance: \n\n\n\nThe Global Fort Edward Rail Yard is leased and operated by Global Companies LLC (Global), headquartered in Waltham, Massachusetts. Railroad operations at the site are performed by SMS Rail Services, Inc. (SMS).  At the rail yard, railcars of liquefied petroleum gas (LPG) are stored on railroad tracks, while awaiting future transportation to another storage location or destination facility for off-load.  Propane is the only Chemical Accident Prevention (CAP) regulated chemical stored at the rail yard which exceeds a threshold quantity.   \n\n\n\nGeneral accidental release prevention program and chemical-specific prevention steps: \n\n\n\nThe Global Fort Edward Rail Yard is normally unmanned by Global personnel.  The site is visited periodically by Global employees for inspection purposes and to perform operating and maintenance tasks.  As such, the facility is considered a normally unoccupied remote facility and is not subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program. \n\n\n\nThe Global Fort Edward Rail Yard is regulated as a Program Level 2, CAP facility.  General accidental release prevention programs and propane-specific release prevention steps incorporated for the covered process include the following: \n\n\n\n--The rail yard is a secured facility, with locked gates to limit entry to authorized personnel only.  In addition to periodic inspections conducted by Global personnel, the site is also occupied by SMS"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065183,
      "SummaryText": " employees on a routine basis.  An adjacent rail yard facility operated by Canada Pacific Railroad is also frequently occupied.  These entities can contact Global immediately if there are indications of a release, safety hazard or other condition which could reasonably be assumed to result in a hazardous situation. \n\n--Periodic railcar inspections are conducted per an established schedule and in compliance with United States Department of Transportation (DOT) regulations. \n\n--While the railcars are in the yard, Global conducts periodic safety inspections of the railcars and surrounding property \n\n--Global conducts, or arranges for, railcar maintenance as needed while the railcars are on site based on inspection results or established maintenance intervals \n\n--Safety information has been developed for the covered process chemical, process, and equipment \n\n--A hazard review consisting of a Fire Safety Analysis (FSA) and hazard analysis checklist  \n\n\n\nFive-year accident history: \n\n\n\nThis is a new facility.  There have been no accidental releases from the covered process that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage within the last five years.  This statement does not incorporate other processing operations at the location not under the control of Global or any other previous site operators. \n\n\n\nEmergency Response Program: \n\n\n\nThe facility has developed an Emergency Response Action Plan (ERAP), which has been coordinated with local emergency response groups, including the Fort Edward Fire Department.  Global has also contracted with a private hazardous material response contractor who is available 24-hours per day on an on-call basis.  Global is responsible for coordinating the notifications required to initiate an emergency response. The ERAP provides the essential planning for effectively protecting the public and the environment d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065183,
      "SummaryText": "uring emergency situations. \n\n\n\nPlanned Changes to Improve Safety: \n\n\n\nRailcar storage at this facility was initiated in August of 2017.  Compliance with Global environmental, health, and safety standards and expectations forms the framework for continuous safety improvement.  \n\n\n\nSpecific actions that will be taken in the future to improve the level of safety at the facility include: \n\n--Compliance audits will be conducted to evaluate compliance with the CAP provisions and to evaluate improvement opportunities \n\n--Coordination with the Fort Edward Fire Department will continue to ensure a constant state of readiness to respond to any potential emergencies \n\n--Additional improvements will be implemented as a result of FSA and hazard review recommendations \n\n\n\nRegistration: \n\n\n\nThis registration includes the required information referenced in 40 CFR ?68.160(b)(1) through (20) to be reported for a Program 2 process. \n\n\n\nOffsite Consequence Analysis: \n\n\n\nAs a Program 2 process with a regulated flammable substance, an offsite consequence analysis (OCA) has been performed for one worst-case release scenario and one alternative release scenario.  The required data from the OCA is contained within this Risk Management Plan. \n\n\n\nPrevention Program 2: \n\n\n\nThis Risk Management Plan includes the required information referenced in 40 CFR ?68.170(b) through (k) to be reported for a Program 2 process. \n\n\n\nEmergency Response Program: \n\n\n\nThis Risk Management Plan includes the required information referenced in 40 CFR ?68.180 to be reported for a Program 2 process. \n\n\n\nCertification: \n\n\n\nThis submittal includes the required certification that, to the best of the signer's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n"
    }
  ]
}