{
  "FacilityID": 1000081677,
  "FacilityName": "HRSC Milk Plant",
  "FacilityStr1": "10010 Clay Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77080",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-City Of Houston",
  "FacilityLatDecDegs": "29.831944",
  "FacilityLongDecDegs": "-095.541111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "HEB.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "H. E. Butt Grocery Company",
  "Company2Name": null,
  "CompanyDUNS": 7924756,
  "Company2DUNS": null,
  "OperatorName": "H. E. Butt Grocery Company",
  "OperatorStr1": "4300 Industry Park",
  "OperatorStr2": "Seasonal Warehouse - 2nd Floor",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78218",
  "OperatorZipCodeExt": null,
  "FTE": 1950,
  "OtherEPAFacilityID": "TXD987983202",
  "EPAFacilityID": "100000124965",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-12-16 00:00:00",
  "SafetyInspectionBy": "Jensen Hughes",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-02-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-02-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.837103,
  "FRS_Long": -95.539522,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102061,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000081677,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127921,
          "ProcessID": 1000102061,
          "ChemicalID": 56,
          "Quantity": 127000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000103342,
          "ProcessID": 1000102061,
          "NAICSCode": "49312",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000103343,
          "ProcessID": 1000102061,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000086254,
              "Process_NAICS_ID": 1000103343,
              "SafetyReviewDate": "2021-07-14 00:00:00",
              "PHA_Date": "2021-07-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-07-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-09-08 00:00:00",
              "TrainingReviewDate": "2021-12-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-09-08 00:00:00",
              "EquipmentInspectionDate": "2019-02-19 00:00:00",
              "EquipmentTested": "All engine room equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2021-07-12 00:00:00",
              "PreStartupReviewDate": "2019-02-19 00:00:00",
              "ComplianceAuditDate": "2021-12-16 00:00:00",
              "AuditCompletionDate": "2024-12-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-09-26 00:00:00",
              "HotWorkPermitReviewDate": "2021-11-18 00:00:00",
              "ContractorSafetyReviewDate": "2021-11-15 00:00:00",
              "ContractorSafetyEvalDate": "2018-03-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000107613,
                  "PreventionProgram3ID": 1000086254,
                  "ProcessChemicalID": 1000127921
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081677,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-09-08 00:00:00",
    "ERTrainingDate": "2021-08-19 00:00:00",
    "CoordinatingAgencyName": "Harris County - City of Houston",
    "CoordinatingAgencyPhone": "7132367750",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 16,
      "FacilityID": 1000081677,
      "SummaryText": "TION POLICY\r\nThis facility follows a rigorous fourteen volume Process Safety Program to prevent the accidental release of ammonia. This RMP also addresses the PSM program in compliance with Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the both process safety programs to maintain a work environment that is safe to employees, the community, and the environment.\r\n\r\n1.3\tEMERGENCY RESPONSE POLICY\r\nThe facility has a comprehensive emergency response plan that meets established criteria. The plan is available for local Fire Department and LEPC review.\r\n\r\n\r\n1.4\tPROCESS OVERVIEW \r\nThe process is the standard refrigeration cycle. It uses anhydrous ammonia as the refrigerant. The only substance inside the refrigeration system is ammonia. \r\n\r\nThe process causes the ammonia to boil into a gas and then cool into a liquid and then repeats the process. The refrigeration system lowers the liquid pressure to lower the boiling point and then evaporates the ammonia within the system using room air as the heat source. It then compresses the ammonia into a high pressure/temperature and cools the gas until it condenses. The condensed liquid is pumped to a low pressure part of the system where the pressure is lowered and the cycle starts all over. The ammonia changes state from a liquid to a gas and back to a liquid. It does not chemically change; it is not consumed and does not wear out. It continuously circulates throughout the system.\r\n\r\nThe process is the standard refrigeration cycle. It uses anhydrous ammonia as the refrigerant. The only extremely hazardous substance inside the refrigeration system is ammonia. \r\n\r\nThe process causes the ammonia to boil into a gas and then cool into a liquid and then repeats the process. The refrigeration system lowers the liquid pressure to lower the boiling point and then evaporates the ammonia within the system using room air as the hea"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081677,
      "SummaryText": "The HRSC Milk Plant is a milk products manufacturing and distribution facility that contains refrigerated areas.  The refrigerated areas are cooled by an anhydrous ammonia refrigeration system.  Anhydrous ammonia, a substance regulated by EPA, is one of the most economical refrigerants available.  However, the properties of ammonia makes it necessary to observe certain safety precautions while operating the refrigeration system to prevent employee exposure, and to reduce the threat of exposure to nearby members of the community.\r\n\r\n\tThe HRSC Milk Plant chose to follow the EPA's Chemical Accident Prevention Rule, Program Level 3, to prevent a release of ammonia from the refrigeration system.  The Milk Plant ammonia refrigeration system of the Houston Retail Support Center (HRSC) of H.E. Butt Grocery Company (HEB) has a maximum intended inventory of 23,000 pounds in the  refrigeration systems.\r\n\r\n\tThe HRSC Milk Plant complies with EPA's Accidental Release Prevention Rule, and applicable state codes and regulations to prevent a catastrophic release of ammonia.  The ammonia refrigeration system has been constructed according to the International Institute of Ammonia Refrigeration guidelines (IIAR).  The operators of the systems are required to complete a training and certification program to operate the ammonia refrigeration system.\r\n\r\n\tThe Accidental Release Prevention Program does not guarantee against an accidental release.  An offsite consequence analysis was completed using a computer model to simulate a release of the ammonia from the refrigeration system.  The worst case scenario considered the loss of 6,500  pounds of anhydrous ammonia in the refrigeration system over a 10 minute period.  The analysis showed that the ammonia vapor could travel approximately 1.0 miles.   There are other public receptors (schools, day cares, nursing homes, recreational areas, hospitals, and industrial/commercial buildings) in the potentially affected area.\r\n\r\n \tThe alternative rel"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081677,
      "SummaryText": "ease scenario, which is the most likely scenario, considered a release of ammonia from a broken pipe inside the building.  A release of 2,250 pounds of ammonia over a 15 minute period was considered.  The computer model showed that the ammonia vapor could travel approximately 0.1 mile.  There are residents and other public receptors (recreational areas and industrial/commercial buildings) located in the potentially affected area.  No administrative controls or mitigation measures were used to limit the chemical release distances for either scenario.\r\n\r\n\tThe HRSC Milk Plant has an established Emergency Action Plan to respond to emergencies.  The plan was developed in accordance with 29 CFR 1910.38 Emergency Action Plan.  The plan requires employees to exit the facility during a fire or ammonia release to a safe area.  The emergency agencies will be notified of the emergency.  The emergency agencies will notify any potentially affected neighbors.  Maintenance personnel will be available as a resource during an ammonia release emergency.  The plan also addresses natural hazard emergencies, fires, bomb threats, civil disturbances, and utility outages.\r\n\r\n\tThis location has not experienced an ammonia release in the past 5 years.\r\n\t\t\r\n\tThe HRSC Milk Plant wanted to evaluate the potential failures of the refrigeration system, and if the safeguards were sufficient to prevent a catastrophic release of ammonia.  An updated Process Hazard Analysis was completed on the refrigeration system.  Planned changes to improve safety resulting from this analysis are documented in the Process Hazard Analysis report in the Accidental Chemical Release Prevention Program.  Also, the guidelines from the International Institute of Ammonia Refrigeration (IIAR) will be followed where applicable, to manage the refrigeration system.\r\n\r\nThis process includes a Frozen Food Warehouse.  \r\nThis Risk Management Program is designed to comply with the Environmental Protection Agency regulations\r\ndetailed"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081677,
      "SummaryText": "in 40 CFR Part 68. The stationary source is the Houston Retail Support Center located at 4625 Windfern Road, Houston, TX. The site is owned and operated by HEB Grocery Company. The only RMP regulated substance at this facility is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure. This is a revised RMP submission for a cold storage warehouse.  The refrigeration system in this facility has a maximum intended inventory of 18,000 pounds of anhydrous ammonia. This process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard. Therefore, this RMP is written to meet the EPA Program 3 level of compliance.\r\n\r\nACCIDENTAL RELEASE PREVENTION POLICY\r\nThis facility follows a rigorous thirteen volume Process Safety Management Program to prevent the accidental release of ammonia. The PSM program is in compliance with Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the PSM program to maintain a work environment that is safe to employees, the community, and the environment.\r\n\r\nEMERGENCY RESPONSE POLICY\r\nThe facility has a comprehensive emergency response plan that meets established criteria. The plan is being provided to the local LEPC for review.\r\n\r\nPROCESS OVERVIEW\r\nThis food distribution facility operates a two temperature, single stage, anhydrous ammonia (R-717)refrigeration system with an engine room capacity of 314.8 TR @ +19°F medium temperature suction and 300.2 TR @ -27°F low temperature suction. This refrigeration system is a liquid recirculation system and is designed to operate at an overfeed ratio of approximately 4:1 for all evaporators. Anhydrous ammonia (R-717) refrigerant is a Group II refrigerant. Rotary screw compressors are used in the refrigeration system. This system operates at two different suction temperatures both as single stage systems. The ammonia\r\nrefrigeration system contains six"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081677,
      "SummaryText": "interconnected sub-systems:\r\n1. Low temperature system (-27°F @ 0.4 PSIG).\r\n2. Medium temperature system (+19°F @ 32.5 PSIG).\r\n3. Thermosyphon pilot receiver system (95°F @ 181.1 PSIG).\r\n4. Condenser system (95°F C.T. 80°F W.B.).\r\n5. Compressor low-temperature system (-29°F @ 0.8 \" hg.).\r\n6. Compressor medium-temperature system (+17°F @ 30.4 PSIG).\r\nMajor equipment located inside the engine room includes: \r\n· Two low-temperature compressors ( both are FES model 400-GLE Compressor packages, each rated @ 150.1\r\nTR/ 449.2 BHP ).\r\n· One medium-temperature compressor ( FES model 290-GLE Compressor package, rated @ 314.8 TR/ 360.6\r\nBHP).\r\n· One 36\" dia. X 8'-0\" thermosyphon pilot-receiver.\r\n· One 48\" dia. x 11'-0\" OAL vertical accumulator package +17°F .\r\n· One 60\" dia. x 12'-9\" OAL vertical pump re-circulator package -29°F .\r\n· One-Hansen APC Auto-Purger.\r\nMajor equipment located outside on the roof includes:\r\n· One evaporative condenser (BAC CXV-610, rated @ 7,865 MBH, for +95° FCT/ 80° FWB).\r\nMITIGATION MEASURES\r\nThere are some mitigating measures in place. The location of the ammonia vessels is inside the engine room.\r\nAlthough there are doors and windows, the overall enclosure acts as a dike creating liquid pooling and limiting the liquid run-off. Ammonia leak detection is installed in this area that sounds alarms and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air through the roof which creates a lower level of concentration in the engine room for responders. It also starts air dispersion at lower concentration levels and disperses the ammonia with greater air turbulence.\r\n\r\nSUMMARY OF HAZARD ASSESSMENT\r\nThis hazard assessment was conducted to meet the RMP Off-site Consequence Analysis requirements for the ammonia refrigeration system. The only RMP regulated substance at this facility is anhydrous ammonia which is classified is as a toxic substance, liquefied under pressure. The definitions and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081677,
      "SummaryText": "parameters for the following release scenarios are based on the \"Risk Management Program Guidance for Ammonia Refrigeration\" as described in Chapter 4: Off-site Consequence Analysis.  The worst-case release scenario (OCA-1) used in this assessment identifies the low temperature recirculator (V-3) as the vessel with the potential to hold the largest quantity of ammonia. This is based on the system \r\ndesign that uses this vessel as a pump-down holding receiver. The worst-case release scenario is based on over-filling this vessel causing the released quantity to be 6,000 pounds with no piping volume included. The distance to toxic end point of 0.9 miles.\r\n\r\nThe alternative release scenario evaluated in this hazard assessment is the direct release of ammonia vapor from the largest pressure relief valve with a duration of 15 minutes. The quantity of the release is based on the rated capacity of the pressure relief valve (150 lbs/min) with a release duration of fifteen (15) minutes and travel distance of 0.1 mile.\r\n\r\nACCIDENT PREVENTION PROGRAM\r\nThis facility follows the OSHA Process Safety Management Program. Various special elements have been incorporated into this program to meet the additional EPA requirements for the RMP. Following is an overview.\r\nParticipation - The Participation Program is an asset to both employees at the site and to the community as a whole. As a general rule, employees who are fully involved have a greater sense of responsibility; they are more likely to catch the problems that can cause accidents. Employee awareness is for employees, not directly involved with the process, this includes knowing the hazards, the safety rules, warning signs, and evacuation procedures. All employees have access to the PSM Program. Involved employees participate\r\ndirectly in every phrase of the PSM program, including conducting the PHA, developing or reviewing operating procedures, reviewing incident investigations, and conducting mechanical integrity and complian"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081677,
      "SummaryText": "ce audits.\r\n\r\nCommunity involvement is through coordination and cooperation with the local Fire department and LEPC.\r\n\r\nProcess Safety Information - Process Safety Information includes a wide variety of books, manuals, and process information. These are available to employees that operate, maintain, or repair the process equipment or piping. There are three major categories of information: ammonia data such as MSDS, safety information, first aid, chemical properties, IIAR safety bulletins, etc.; process information such as piping & instrumentation diagrams (P&ID's), block flow diagram, mass flow balance, design codes and standards, pressure safety relief settings, safety system/devices, ventilation system design, operating procedures, safe\r\noperating limits, and ramification of process deviation; and process equipment information such as equipment specifications, electrical classifications, materials of construction, installation manuals, operating and maintenance manuals, and manufacturer's manuals.\r\n\r\nProcess Hazard Analysis - A Process Hazard Analysis (PHA) was completed using the \"What-if\" technique. This addressed hazards, engineering and administrative controls, consequences of failure of engineering and administrative controls, facility siting, human factors, and a qualitative evaluation of the possible safety and health impact. The results of the PHA were prioritized and incorporated into a PHA Findings Report for follow-up as a corrective action log.\r\n\r\nStandard Operating Procedures - SOPs are provided for each compressor, condenser, ammonia vessel and oil pot, and evaporator. Topics include general information such items as objectives, hazards, location, equipment needed, P&ID's, task flow diagrams, and step-by-step procedures with specific warnings and comments. The SOPs cover different phases of operations such as: initial startup; normal, temporary and emergency operations; emergency shutdowns; and startup following a shutdown.\r\n\r\nTraining - All employe"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000081677,
      "SummaryText": "es are who are involved with anhydrous ammonia have been properly trained, at a minimum, in understanding the MSDS, routine refrigeration system operation, emergency refrigeration system operation, emergency and normal refrigeration safety practices, and, if appropriate, the individual's role in the emergency response plan.\r\nContractors - This site follows strict guidelines for qualifying contractors who directly influence the safety of the process or the system. The contractor qualification procedure ensures that contractors and their employees are fully aware of the potential dangers involved with the ammonia process, that contractors understand their responsibility and train their people, and that a contractor's safety record is considered in reviewing the bids.\r\n\r\nPre-Startup Review - Pre-startup safety reviews are required on all new or modified equipment/systems. This involves process safety information, process hazard analysis, training, safety procedures, operating procedures, and verification that construction and equipment are in accord with the design specifications.\r\n\r\nMechanical Integrity Audits - The purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working condition. These are performed on all compressors, condensers, evaporators, pressure vessels, piping system, relief and vent systems and devices, emergency shutdown systems, controls, and pumps.\r\n\r\nHot Work Permits - This permit process is to protect against fire, explosion and other dangers resulting from hot work (welding and cutting outside the designated areas). Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules are met. Permits indicate the appropriate dates and the work to be done.\r\nThe permits are kept on file until workers have completed the hot work operations.\r\nManagement of Change - The Management o"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000081677,
      "SummaryText": "f Change (MOC) procedure requires that all changes (even \"replacement in kind\") be reviewed to see if there is a possible negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operating procedures, and authorization requirements for the proposed change. Employees affected by the change are informed of the change before startup and trained in the proper procedures.\r\n\r\nIncident Investigation - An incident investigation shall be performed any time there is an incident which resulted in, or which could reasonably have resulted in, a catastrophic release of ammonia. The purpose is to gain information that could prevent further accidents and to identify weaknesses in the emergency response plan that need to be addressed. Investigations are initiated promptly using a trained team. The findings and recommendations will be studied and appropriate corrective action taken.\r\n\r\nEmergency Response Plan - This facility has a comprehensive emergency response plan that meets established criteria. This plan will be provided to the local fire department and the Local Emergency Planning Committee (LEPC).\r\n\r\nCompliance Audits and RMP Revisions - To insure that all the other 12 areas of PSM program are followed, the company requires compliance audits. At a minimum, these must be completed every three years. Resubmission of the RMP shall be done according to Section 6.2 to meet the OCA requirements.\r\n\r\nACCIDENT HISTORY - LAST FIVE YEARS\r\nThere have been no RMP reportable accidents within the past five years.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nWe have reviewed the PSM and RMP programs and are making all necessary revisions. The PHA was recently updated. Recommendations are being addressed.\r\n\r\nThis process includes a Retail Distribution Center. The HRSC Retail Distribution Center #1 Combo/Produce(RDC#1) is a refrigerated warehouse and distribution facility that contains refrigerated areas. The refrigerated areas ar"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000081677,
      "SummaryText": "e cooled by an anhydrous ammonia refrigeration system. Anhydrous ammonia, a substance regulated by EPA, is one of the most economical refrigerants available. However, the properties of ammonia makes it necessary to observe certain safety precautions while operating the refrigeration system to prevent employee exposure, and to reduce the threat of exposure to nearby members of the community.\r\nThe HRSC RDC#1 chose to follow the EPA's Chemical Accident Prevention Rule, Program Level 3, to prevent a release of ammonia from the refrigeration system. The Retail Distribution Center (RDC#1) ammonia refrigeration system at the Houston Retail Support Center (HRSC) of H.E. Butt Grocery Company (HEB) has a maximum intended inventory of 28,000 pounds in the refrigeration system.\r\nThe HRSC RDC#1 complies with EPA's Accidental Release Prevention Rule, and applicable state codes and regulations to prevent a catastrophic release of ammonia. The ammonia refrigeration system has been constructed according to the International Institute of Ammonia Refrigeration guidelines (IIAR). The operators of the systems are required to complete a training and certification program to operate the ammonia refrigeration system.\r\nThe Accidental Release Prevention Program does not guarantee against an accidental release. An offsite consequence analysis was completed using a computer model to simulate a release of the ammonia from the refrigeration system. The worst case scenario considered the loss of 3,700 pounds of anhydrous ammonia in the refrigeration system over a 10 minute period. The analysis showed that the ammonia vapor could travel approximately 0.8 miles. There are residents which could be potentially affected in the identified radius. There are other public receptors (schools, day cares, nursing homes, recreational areas, hospitals, and industrial/commercial buildings) in the potentially affected area.\r\n\r\nThe alternative release scenario, which is the most likely scenario, considered a rele"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000081677,
      "SummaryText": "ase of ammonia from a broken pipe inside the building. A release of 1500 pounds of ammonia over a 15 minute period was considered. The computer model showed that the ammonia vapor could travel approximately 0.1 mile.  There are residents and other public receptors (recreational areas and industrial/commercial buildings)are located in the potentially affected area. No administrative controls or mitigation measures were used to limit the chemical release distances for either scenario.\r\n\r\nThe HRSC RDC#1 has an established Emergency Action Plan to respond to emergencies. The plan was developed in accordance with 29 CFR 1910.38 Emergency Action Plan. The plan requires employees to exit the facility during a fire or ammonia release to a safe area. The emergency agencies will be notified of the emergency. The emergency agencies will notify any potentially affected neighbors. Maintenance personnel will be available as a resource during an ammonia release emergency. The plan also addresses natural hazard emergencies, fires, bomb threats, civil disturbances, and utility outages. This location has not experienced an ammonia release in the past 5 years.  The HRSC RDC#1 wanted to evaluate the potential failures of the refrigeration system, and if the safeguards were sufficient to prevent a catastrophic release of ammonia.  An updated Process Hazard Analysis was completed on the refrigeration system. Planned changes to improve safety resulting from this analysis are documented in the Process Hazard Analysis report in the Accidental Chemical Release Prevention Program. Also, the guidelines from the International Institute of Ammonia Refrigeration (IIAR) will be followed where applicable, to manage the refrigeration system.\r\n\r\nThis process includes a Milk and Dairy Center MDC Warehouse.  This Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68. The stationary source is the Houston Retail Support Center locate"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000081677,
      "SummaryText": "d at 4625 Woodfern Road, Houston, TX. The site is owned and operated by HE Butt Grocery Company. The only RMP regulated substance at this facility is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure.\r\nThe refrigeration system in this facility has a maximum intended inventory of 13,000 pounds of anhydrous ammonia. This process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard. Therefore, this RMP is written to meet the EPA Program 3 level of compliance.  \r\n\r\nACCIDENTAL RELEASE PREVENTION POLICY\r\nThis facility follows a rigorous thirteen volume Process Safety Management Program to prevent the accidental release of ammonia. The PSM program is in compliance with Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the PSM program to maintain a work environment that is safe to employees, the community, and the environment.\r\n\r\nEMERGENCY RESPONSE POLICY\r\nThe facility has a comprehensive emergency response plan that meets established criteria. The plan has been provided to the local LEPC for review.\r\n\r\nPROCESS OVERVIEW\r\nThis food distribution facility operates a multi-temperature, single stage, anhydrous ammonia (R-717) refrigeration system with a refrigeration load of 550 TR and an engine room compressor capacity of 1465 TR @ +20°F suction temperature.This refrigeration system is a liquid recirculation system and is designed to operate at an over-feed ratio of approximately 3:1 for all evaporators. Anhydrous ammonia (R-717)refrigerant is a Group II refrigerant. Rotary screw compressors are used in the refrigeration system.\r\nThis ammonia refrigeration system contains four interconnected sub-systems:\r\n1.Evaporator system (+20°F @ 33.5 PSIG).\r\n2.High-pressure receiver system (95°F @ 181 PSIG).\r\n3.Condenser system (95°F C.T. 79°F W.B.).\r\n4.Compressor system (+20°FST/+95°FCT).\r\nMajor equipment located ins"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000081677,
      "SummaryText": "ide the engine room includes:\r\n·One compressor package (FES model 400GL compressor rated @ 437 TR/ 471.5 BHP).\r\n·Two compressor packages (both are FES model 475GL packages, each rated @ 514.8 TR/ 541.8 BHP).\r\n·One 48\" dia. X 10'-0\" thermosyphon high-pressure receiver.\r\n·One 84\" dia. X 13'-10\" OAL vertical pump re-circulator package +20°F.\r\n·One-Hansen APC Auto-Purger.\r\nMajor equipment located outside on the roof includes:\r\n·Three evaporative condensers (all Imeco XLP-XL-710, each rated for 6,690 MBH @ +95° FCT/ 79° FWB).\r\n\r\nMITIGATION MEASURES\r\nThere are some mitigating measures in place. The location of the ammonia vessels is inside the engine room. Although there are doors and windows, the overall enclosure acts as a dike creating liquid pooling and limiting the liquid run-off. Ammonia leak detection is installed in this area that sounds alarms and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air through the roof which creates a lower level of concentration in the engine room for responders. It\r\nalso starts air dispersion at lower concentration levels and disperses the ammonia with greater air turbulence.\r\n\r\nSUMMARY OF HAZARD ASSESSMENT\r\nThis hazard assessment was conducted to meet the RMP Off-site Consequence Analysis requirements for the ammonia refrigeration system. The only RMP regulated substance at this facility is anhydrous ammonia which is classified is as a toxic substance, liquefied under pressure. The definitions and parameters for the following release scenarios are based on the \"Risk Management Program Guidance for Ammonia Refrigeration\" as described in Chapter 4: Off-site Consequence Analysis.\r\n\r\nThe worst-case release scenario (OCA-1) used in this assessment identifies the high temperature recirculator (V-1) as the vessel with the potential to hold the largest quantity of ammonia. This is based on the system design that uses this vessel as a pump-down holding receiver. The worst-c"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000081677,
      "SummaryText": "ase release scenario is based on over-filling this vessel causing the released quantity to be 7,500 pounds equal to the total vessel volume with\r\nno piping volume included, the ammonia vapor could travel 1.0 mile.\r\n\r\nThe alternative release scenario evaluated in this hazard assessment is the direct release of ammonia vapor from the largest pressure relief valve. The release is based on the release rate of 157 lbs/min with a release duration of fifteen minutes traveling 0.1 mile.\r\n\r\nACCIDENT PREVENTION PROGRAM\r\nThis facility follows the OSHA Process Safety Management Program. Various special elements have been incorporated into this program to meet the additional EPA requirements for the RMP. Following is an overview.\r\n\r\nParticipation - The Participation Program is an asset to both employees at the site and to the community as a whole. As a general rule, employees who are fully involved have a greater sense of responsibility; they are more likely to catch the problems that can cause accidents. Employee awareness is for employees, not directly involved with the process, this includes knowing the hazards, the safety rules, warning signs, and evacuation procedures. All employees have access to the PSM Program. Involved employees participate\r\ndirectly in every phrase of the PSM program, including conducting the PHA, developing or reviewing operating procedures, reviewing incident investigations, and conducting mechanical integrity and compliance audits.\r\n\r\nCommunity involvement is through coordination and cooperation with the local Fire department and LEPC.\r\n\r\nProcess Safety Information - Process Safety Information includes a wide variety of books, manuals, and process information. These are available to employees that operate, maintain, or repair the process equipment or piping. There are three major categories of information: ammonia data such as SDS, safety information, first aid, chemical properties, IIAR safety bulletins, etc.; process information such as piping & i"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000081677,
      "SummaryText": "nstrumentation diagrams (P&ID's), block flow diagram, mass flow balance, design codes and standards, pressure safety relief settings, safety system/devices, ventilation system design, operating procedures, safe\r\noperating limits, and ramification of process deviation; and process equipment information such as equipment specifications, electrical classifications, materials of construction, installation manuals, operating and maintenance manuals, and manufacturer's manuals.\r\n\r\nProcess Hazard Analysis - A Process Hazard Analysis (PHA) was completed using the \"What-if\" technique. This addressed hazards, engineering and administrative controls, consequences of failure of engineering and administrative controls, facility siting, human factors, and a qualitative evaluation of the possible safety and health impact. The results of the PHA were prioritized and incorporated into a PHA Findings Report for follow-up as a corrective action log.\r\n\r\nStandard Operating Procedures - SOPs are provided for each compressor, condenser, ammonia vessel and oil pot, and evaporator. Topics include general information such items as objectives, hazards, location, equipment needed, P&ID's, task flow diagrams, and step-by-step procedures with specific warnings and comments. The SOPs cover different phases of operations such as: initial startup; normal, temporary and emergency operations; emergency shutdowns; and startup following a shutdown.\r\n\r\nTraining - All employees are who are involved with anhydrous ammonia have been properly trained, at a minimum, in understanding the MSDS, routine refrigeration system operation, emergency refrigeration system operation, emergency and normal refrigeration safety practices, and, if appropriate, the individual's role in the emergency response plan.\r\nContractors - This site follows strict guidelines for qualifying contractors who directly influence the safety of the process or the system. The contractor qualification procedure ensures that contractors and the"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000081677,
      "SummaryText": "ir employees are fully aware of the potential dangers involved with the ammonia process, that contractors understand their responsibility and train their people, and that a contractor's safety record is considered in reviewing the bids.\r\n\r\nPre-Startup Review - Pre-startup safety reviews are required on all new or modified equipment/systems. This involves process safety information, process hazard analysis, training, safety procedures, operating procedures, and verification that construction and equipment are in accord with the design specifications.\r\n\r\nMechanical Integrity Audits - The purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working condition. These are performed on all compressors, condensers, evaporators, pressure vessels, piping system, relief and vent systems and devices, emergency shutdown systems, controls, and pumps.\r\n\r\nHot Work Permits - This permit process is to protect against fire, explosion and other dangers resulting from hot work (welding and cutting outside the designated areas). Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules are met. Permits indicate the appropriate dates and the work to be done.\r\nThe permits are kept on file until workers have completed the hot work operations.\r\n\r\nManagement of Change - The Management of Change (MOC) procedure requires that all changes (even \"replacement in kind\") be reviewed to see if there is a possible negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operating procedures, and authorization requirements for the proposed change. Employees affected by the change are informed of the change before startup and trained in the proper procedures. \r\n\r\nIncident Investigation - An incident investigation shall be performed any time there is an i"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000081677,
      "SummaryText": "ncident which resulted in, or which could reasonably have resulted in, a catastrophic release of ammonia. The purpose is to gain information that could prevent further accidents and to identify weaknesses in the emergency response plan that need to be addressed. Investigations are initiated promptly using a trained team. The findings and recommendations will be studied and appropriate corrective action taken.\r\n\r\nEmergency Response Plan - This facility has a comprehensive emergency response plan that meets established criteria. This plan will be provided to the local fire department and the Local Emergency Planning Committee (LEPC).\r\n\r\nCompliance Audits and RMP Revisions - To insure that all the other 12 areas of PSM program are followed, the company requires compliance audits. At a minimum, these must be completed every three years.\r\n\r\nResubmission of the RMP shall be done according to Section 6.2 to meet the OCA requirements.\r\n\r\nACCIDENT HISTORY - LAST FIVE YEARS\r\nThere have been no RMP reportable accidents within the past five years.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nNone at this time.\r\n\r\n\r\n1.0\tEXECUTIVE SUMMARY\r\n1.1.\tGENERAL\r\nThis Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is Retail Distribution Center (RDC-2) as an additional ammonia refrigeration system in this complex. It is operated by HEB Grocery Company, 4625 Windfern Road, Houston, TX 77041. The only RMP regulated substance in this building is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure. \r\nThis is an additional food distribution facility.  The refrigeration system for this facility has a maximum intended inventory of  36,000 pounds of anhydrous ammonia. The process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance.\r\n\r\n1.2\tACCIDENTAL RELEASE PREVEN"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000081677,
      "SummaryText": "t source. It then compresses the ammonia into a high pressure/temperature and cools the gas until it condenses. The condensed liquid is pumped to a low pressure part of the system where the pressure is lowered and the cycle starts all over. The ammonia changes state from a liquid to a gas and back to a liquid. It does not chemically change; it is not consumed and does not wear out. It continuously circulates throughout the system.\r\n\r\nThis food distribution facility operates a single-stage, anhydrous ammonia refrigeration system with a capacity of approximately 945 TR at a +15&#61616;F suction temperature. This refrigeration system uses ammonia pumps to feed flooded evaporator coils. Anhydrous ammonia (R-717) refrigerant is a Group II refrigerant. \r\nThe NEC electrical classification for this ammonia compressor room is General Industry. This classification applies only if the Compressor Room ventilation and ammonia detection systems are maintained in continuous operation and fully functional as per ASHRAE 15.\r\nThis is a single-stage ammonia refrigeration system containing six interconnected sub-systems:\r\n1.\tHigh-temperature re-circulator system (+15&#61616;F @ 28.4 psig).\r\n2.\tCompressor high-temperature system (+15&#61616;F @ 28.4 psig).\r\n3.\tCondenser system (90&#61616;F C.T. 80°F W.B.)\r\n4.\tHigh-pressure receiver system (90&#61616;F @ 165.9 psig).\r\nMajor equipment located inside the engine room includes:\r\n¿\tThree compressors are FES 290GLX screw compressor packages rated at 315TR each.\r\n¿\tOne 36\" dia. X 10'- 0\" horizontal thermosyphon pilot-receiver.\r\n¿\tOne 96\" dia. X 16'- 0\" vertical high-pressure receiver.\r\n¿\tOne 96\" dia. X 20'- 0\" horizontal re-circulator package.\r\n¿\tOne-Hansen APC Auto-Purger.\r\nMajor equipment located on roof includes: \r\n¿\tTwo Evapco model PMC-852E condensers.\r\n\r\nThe thermosyphon pilot-receiver is a horizontal vessel. The volume of this vessel at maximum allowable liquid level (50% of total vessel volume) is 32.3 cu-ft. It operates at a saturated"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000081677,
      "SummaryText": "liquid temperature of +90°F at approximately 181 psig. All ammonia liquid from the condensers drains through this vessel. The thermosyphon pilot-receiver stores a supply of ammonia liquid coming from the condenser to use for compressor oil cooling. All liquid ammonia not needed by the thermosyphon pilot-receiver drains to the high-pressure receiver. This vessel has connection with the high-pressure receiver, compressors, and the condensers.\r\n\r\nThe high-pressure receiver is a vertical vessel. The volume of this vessel at maximum allowable liquid level (80% of total vessel volume) is 575.0 cu-ft. It operates at a saturated liquid temperature of +90°F at approximately 166 psig. The high-pressure receiver stores the ammonia liquid coming from the condenser through the thermosyphon pilot-receiver. All liquid ammonia not needed by the thermosyphon pilot-receiver drains to this receiver. This vessel has connection with the thermosyphon pilot-receiver, condensers, and the accumulator.\r\nThe accumulator is a horizontal pressure vessel. The volume of this vessel at maximum allowable liquid level (80% of total vessel volume) is 736.0 cubic feet. It operates at a saturated liquid temperature of +15°F. The high-temp ammonia liquid is pumped from this vessel to the evaporative air units the liquid ammonia is evaporated. The vapor is returned to this vessel. The ammonia pumps provide a liquid supply to the evaporators. The compressors pull the ammonia vapor out of this vessel, maintain a constant vessel pressure, and compress the vapor to approximately 181 psig. This vessel has connection with the high-stage compressors, high-pressure liquid from the HPR, with the high-temp pumped liquid, and the high-temp dry suction piping from the air units.\r\nThe evaporative condensers use axial fans in a draw-through configuration. High-pressure ammonia vapor flows from the high-temperature compressors to the evaporative condenser where heat is removed, condensing the vapor to a high-pressure l"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000081677,
      "SummaryText": "iquid. High-pressure liquid from the condenser is drained to the thermosyphon pilot-receiver and the high-pressure receiver. Saturated condensing temperature is 95°F (181 PSIG) at a corresponding 80°F WB. The condenser has connections with the compressor discharge line, thermosyphon pilot-receiver, and the condenser drain lines go to the high-pressure receiver.\r\nThis system incorporates an automatic gas purger for removing non-condensable gases from the ammonia system. The presence of non-condensable gases in the condenser penalizes the system performance through the artificial elevation of condensing pressure. The non-condensable gases add their partial pressures to the ammonia partial pressure against which the compressors must pump. The system has several purge point connections, typically at each of the condenser liquid outlet pipes. \r\nThe compressor discharge hot gas is used to defrost the evaporators. During the defrost cycle, the hot gas refrigerant gives up heat and condenses. With the fans shut down, the ability of the coil to transfer that heat to the air is severely limited. Thus, the heat from the hot gas is absorbed by metal in the coil. As the metal absorbs heat, its temperature rises. Once the surface temperature is high enough, any ice and/or frost on the coil surface will melt and drain off. Defrosting the evaporators occurs automatically on a time sequence by individual sequence timers.\r\nIn this facility, the evaporators are fed from liquid pumps. The evaporators are re-circulated with an over-feed rate of about 3:1. The +15°F re-circulating system includes nine dock air units and 12 storage areas ranging from +34'F to +55'F.\r\nThe ammonia piping and valves in the system are labeled. The identification system is recognized by IIAR. P&ID prints are available for review. Pipe, fittings, and connections specifications for ammonia refrigeration systems shall meet or exceed ASME/ANSI B31.5 specifications.\r\n\r\n\r\n\r\n1.5.\tSUMMARY OF HAZARD ASSESSMENT\r\nThis ha"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000081677,
      "SummaryText": "zard assessment was conducted to meet the RMP Off-site Consequence Analysis requirements for the ammonia refrigeration system. The only RMP regulated substance at this facility is anhydrous ammonia and is classified as a toxic substance, liquefied under pressure. The definitions and parameters for the following release scenarios are based on the \"Risk Management Program Guidance for Ammonia Refrigeration\" as described in Chapter 4: Off-site Consequence Analysis.\r\n\r\nThe worst-case release scenario (OCA-1) used in this assessment identifies the +15'F Re-circulator as the vessel with the potential to hold the largest quantity of ammonia. This is based on the system design using this vessel as a pump-down holding receiver capable of holding up to 919.9 cubic feet of ammonia. The worst-case release scenario is based on filling this vessel with the total system ammonia inventory of 28,700 pounds of ammonia.\r\nThe alternative release scenario (OCA-2) is the direct release of ammonia vapor from the largest pressure relief valve. This scenario was chosen as the most probable source of an ammonia release that would have the potential of offsite consequences based on the number of relief valves and on the high summer operating pressures. The size of the release is based on the rated capacity of the pressure relief valve (90.5 lbs./min.) having a worst-case release-duration of ten minutes.\r\nSome of the other alternate release scenarios considered included transfer hoses splitting or uncoupling, piping failures from flanges, joints, welds, valves, and valve seals, leaking drains or vents, vessel or pump releases due to cracks, seal failures or drain, bleed or plug failures, and shipping container mishandling and breakage leading to a spill. \r\nTable 1.  Off-site Consequence Analysis Results\r\n\r\nData & Results  Worst-case Scenario OCA-1\tAlternate Scenario OCA-2\r\n\r\nReleased Quantity (lbs.)28,700\t                        905\r\n                                                \r\nRelease Ra"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000081677,
      "SummaryText": "te (lbs./min.)2,870 \t                        90.5\r\n\t\r\nLevel of Concern (ppm)\t200                             200\r\n\t\r\nDistance to Toxic Endpoint (miles)  2.0\t                0.1\r\n\t\r\nPopulation at Risk*\t9,354                           0\r\n\t\r\n1.6    Accident History - Last Five Years\r\n       This facility has had no RMP reportable accident in the last five years.\r\n\r\n1.7    Planned Changes To Improve Safety\r\n       An ongoing review of safety programs is in progress.\r\n\r\n2.0\tMANAGEMENT PROGRAM\r\n2.1.\tPURPOSE \r\nThis facility has developed a management system to oversee the implementation of the risk management program. The focus of the Management Program is on tracking, reporting, and documenting the operation and maintenance of the ammonia refrigeration system. Management is fully committed to the Risk Management Program and sees it as a vital and integrated part of general operations.  Management does provide the support and the resources to implement these procedures on an ongoing basis.\r\n\r\n2.2.\tAUDITS AND REVIEWS\r\nThe company's policy is to take federal regulations seriously, knowing that these regulations can protect life and property.  The Facilities Manager will review RMP compliance on an on-going basis.\r\nThe Facilities Manager conducts compliance audits every three years for the entire program. Annual updates will also be performed for elements of the RMP.\r\n\r\n3.0\tHAZARD ASSESSMENT\r\nAnhydrous ammonia is the toxic substance for which this hazard assessment is done. The LOC for ammonia is 200 ppm.  The urban OCA establishes Areas of Concern with a radius of 1.5 miles for the Worst-case Scenario and a radius of 0.1 miles for the Alternate Release Scenario. The affected populations are estimated at 23,745 people for the Worst-case Scenario and 0 people for the Alternate Release Scenario. There are no environmental receptors within the Areas of Concern that could possibly be affected.\r\n\r\n3.1.\tMITIGATION MEASURES\r\nAmmonia leak detection is installed in this area that soun"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000081677,
      "SummaryText": "ds alarms and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air and creates a lower level of concentration in the engine room for responders. It also starts air dispersion at lower concentration levels and disperses the ammonia with greater air turbulence.\r\n\r\n3.2  \tRELEASE SCENARIOS\t\t\t\t\t\r\n3.2.1.\tWorst Case Scenario\r\nThe worst-case release scenario used in this assessment identifies the +15'F Re-circulator as the pump-down vessel with the potential to hold the largest quantity of ammonia. This scenario looks at a full system ammonia release occurring from this vessel during a pump-down procedure when this vessel may contain all 28,700 pounds of ammonia held in this system. \r\nDuring normal operation, the inventory of ammonia is continuously circulated throughout the refrigeration system and this vessel would hold about 8,000 pounds of ammonia. The design of this vessel allows it to be used as a pump-down ammonia holding vessel during infrequent installation or maintenance procedures. The maximum intended holding capacity is eighty percent of total volume. It is only during this pump-down procedure when the greatest volume of liquid ammonia is present. \r\nThe size of this vessel is ninety-six inches in diameter with an overall length of twenty feet - zero inches (96\" X 20'-0\"). It has a total volume calculated to be 919.9 cubic feet with a potential 100% capacity of 37,405 pounds of liquid ammonia at a saturated condition of +15&#61616;F. \r\nThe maximum intended inventory of this system is 28,700 pounds of ammonia. The duration of the release used for calculations is ten minutes for a release rate of 2,870 pounds of ammonia per minute. RMP*Comp was used to determine the distance to the toxic endpoint.\r\n\r\n3.2.2.\tAlternate Release Scenario\r\nThe alternative release scenario is the direct release of ammonia vapor from a pressure relief valve. This scenario was chosen as the most probable source of an ammoni"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000081677,
      "SummaryText": "a release that would have the potential of offsite consequences based on the number of relief valves and on the high summer operating pressures. The size of the release is based on the rated capacity of the pressure relief valve (90.5 lbs./min.) having a worst-case release-duration of ten minutes. RMP*Comp was used to determine the distance to the toxic endpoint. \r\nThis scenario is used for RMP Submit since it is the most probable occurrence although the duration is expected to be significantly shorter due to the refrigerating effect on reducing pressures. Some of the other alternate release scenarios considered included transfer hoses splitting or uncoupling, piping failures from flanges, joints, welds, valves, and valve seals, leaking drains or vents, vessel or pump releases due to cracks, seal failures or drain, bleed or plug failures, and shipping container mishandling and breakage leading to a spill.\r\n\r\n4.0  \tACCIDENT PREVENTION PROGRAM\r\nThis facility follows the EPA's 40CFR68 Risk Management Plan and OSHA's 29CFR1910.119 Process Safety Management Program.  The documentation requirements of these two programs have been consolidated in the documenting and record filing process. \r\n\r\nThe Accident Prevention Program documents and records are kept as identified in each element of the program. \r\n\r\nThe following identifies the practices and procedures for:\r\n \r\n\tProcess Safety Information\r\n\tProcess Hazard Analysis\r\n\tOperating Procedures\r\n\tTraining\r\n\tMechanical Integrity\r\n\tManagement of Change\r\n\tPre-Startup Review\r\n\tCompliance Audits\r\n\tIncident Investigations\r\n\tEmployee Participation\r\n\tHot Works\r\n        Contractors\r\n\r\n5.0\tEMERGENCY RESPONSE PLAN\r\nThe Emergency Response Plan meets the following criteria: \r\n\r\n¿\t29 CFR 1910.38 Employee Emergency Plan and Fire Protection Plan \r\n¿\t29 CFR 1910.119 Process Safety Management of Highly Hazardous Chemicals\r\n¿\t29 CFR 1910.120 (g) Hazardous Waste Operations and Emergency Response \r\n¿\t40 CFR Part 68 Risk Management Program with spe"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000081677,
      "SummaryText": "cific criteria for identifying and notifying the community and off-site receptors.\r\n\r\nACCIDENT HISTORY - LAST FIVE YEARS\r\nThere have been no RMP reportable accidents within the past five years.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nNone at this time.\r\n\r\nThis process includes a Bakery.  \r\nThis Risk Management Program is designed to comply with the Environmental Protection Agency regulations\r\ndetailed in 40 CFR Part 68. The stationary source is the Houston Retail Support Center located at 4625 Windfern Road, Houston, TX. The site is owned and operated by HEB Grocery Company. The only RMP regulated substance at this facility is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure. This is a revised RMP submission for a cold storage warehouse.  The refrigeration system in this facility has a maximum intended inventory of 9,000 pounds of anhydrous ammonia."
    }
  ]
}