{
  "FacilityID": 1000013602,
  "FacilityName": "United Wisconsin Grain Producers",
  "FacilityStr1": "W1231 Tessman Road",
  "FacilityStr2": null,
  "FacilityCity": "Friesland",
  "FacilityState": "WI",
  "FacilityZipCode": "53935",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55021",
  "LEPC": "Columbia County LEPC",
  "FacilityLatDecDegs": "43.577583",
  "FacilityLongDecDegs": "-089.052194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 159166276,
  "ParentCompanyName": "United Wisconsin Grain Producers, LLC",
  "Company2Name": null,
  "CompanyDUNS": 159166276,
  "Company2DUNS": 0,
  "OperatorName": "United Wisconsin Grain Producers",
  "OperatorStr1": "W1231 Tessman Road",
  "OperatorStr2": null,
  "OperatorCity": "Friesland",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53935",
  "OperatorZipCodeExt": null,
  "FTE": 38,
  "OtherEPAFacilityID": "111030040",
  "EPAFacilityID": "100000191552",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-02-23 00:00:00",
  "SafetyInspectionBy": "ERI Safety Group",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-02-14 00:00:00",
  "DeRegistrationEffectiveDate": "2011-11-15 00:00:00",
  "AnniversaryDate": "2015-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016874,
      "AltID": "Production of ethanol",
      "FacilityID": 1000013602,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020058,
          "ProcessID": 1000016874,
          "ChemicalID": 56,
          "Quantity": 91000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000017256,
          "ProcessID": 1000016874,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000013924,
              "Process_NAICS_ID": 1000017256,
              "SafetyReviewDate": "2010-02-23 00:00:00",
              "PHA_Date": "2010-04-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-05-18 00:00:00",
              "TrainingReviewDate": "2010-02-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-02-11 00:00:00",
              "EquipmentInspectionDate": "2005-04-19 00:00:00",
              "EquipmentTested": "Piping for leaks - PSSR Inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-02-11 00:00:00",
              "PreStartupReviewDate": "2005-04-19 00:00:00",
              "ComplianceAuditDate": "2009-02-23 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-02-11 00:00:00",
              "HotWorkPermitReviewDate": "2010-02-23 00:00:00",
              "ContractorSafetyReviewDate": "2010-02-23 00:00:00",
              "ContractorSafetyEvalDate": "2010-05-03 00:00:00",
              "CBI_Flag": 0,
              "Description": "Production of ethanol from corn using anhydrous ammonia for pH adjustment",
              "_chemicals": [
                {
                  "PrimaryKey": 1000016688,
                  "PreventionProgram3ID": 1000013924,
                  "ProcessChemicalID": 1000020058
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000013602,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Columbia County Emergency Managemen",
    "CoordinatingAgencyPhone": "6087424166",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013602,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT OUR FACILITY\n\nUnited Wisconsin Grain Producers, Inc. (UWGP), is committed to preserving the safety of its associates, the surrounding community and the environment, through the implementation of environmental, health and safety (EH&S) management systems and procedures.  We have developed a system to manage the hazards of our process and to respond to potential releases of hazardous materials.  All of our associates are aware of potential hazards associated with our ethanol production process and our release prevention program.  We encourage our associates to be involved in the program and offer feedback.\n\nOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED \n\nUWGP manufactures ethanol from corn.  The plant is located south-east of Friesland, WI.  Corn is milled to a course flour and mixed with water and enzymes to form a mash.  The mash is processed through cooking and pH adjustment using anhydrous ammonia.  The mash is then fermented using yeast and enzymes.  The fermentation process converts glucose into alcohol and carbon dioxide.  At this point, the mash is called beer, which is sent to a distillation process to separate the alcohol from the beer and turn it into 200 proof alcohol.  The 200 proof alcohol is blended with a denaturant to make fuel ethanol for shipment from the facility.  Solids are separated and sold as animal feed.  The Risk Management program covered substance at our facility is anhydrous ammonia, which is stored in an 18,000-gallon storage tank. The level in the tank is maintained by administrative controls at a maximum of 87% of the total, or 16,000 gallons (approximately 91,000 pounds).  Anhydrous ammonia is a gas at atmospheric pressure and normal temperatures, but is maintained in a liquid state by pressure.  \n \n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nOur facility is subject to two major chemical accident prevention rules:\n- "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013602,
      "SummaryText": "The Environmental Protection AgencyA?s Risk Management Program (RMP) rule, found at 40 CFR 68, due to the use of anhydrous ammonia, and;\n\n- The Occupational Safety and Health AdministrationA?s (OSHA) Process Safety Management (PSM) rule found at 29 CFR 1910.119.  The PSM program is applicable due to both the use of anhydrous ammonia, and the use of flammable liquids above the PSM threshold quantity.\n\nWe are in full compliance with these regulations and have implemented steps as required, to reduce the likelihood and impact of potential releases as follows:\n\n- Employee Participation: Employees are encouraged to participate in identifying and mitigating potential hazards involved in the ethanol process.\n\n- Process Safety Information: We maintain information on the hazards of substances used in the process, the technology of the process, and equipment utilized in the process. \n\n- Process Hazard Analysis (PHA): A team of UWGP personnel examined our  process, using a HAZOP audit.  The team used process safety information for the ammonia and flammable liquids, to arrive at potential release scenarios, the consequences if the scenario were to occur, and existing safeguards in place.  The risk of each scenario was ranked according to likelihood and severity.  The team then decided if existing safeguards were adequate and if not, a recommendation for improvement was developed.  Recommendations are promptly resolved.  All associates have access to the results of the PHA.\n\n- Operating Procedures.  We have developed safe operating procedures for the ethanol process.  These procedures include: initial start-up; normal start-up and shutdown; normal operations; temporary operations; emergency shutdowns and operations; start-up following normal or emergency shutdown or major change; consequences of deviation from normal operations; and equipment inspections.  All of our operating personnel are part of an on-going training program for operating procedures.\n\n- Mechanical Integrity. W"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013602,
      "SummaryText": "e have implemented a program to inspect and maintain all critical components of the ethanol process covered by RMP and PSM.  This program utilizes the manufacturer's operations and maintenance recommendations, good engineering practice, and our own maintenance experience to regularly inspect and assess the condition of process equipment. We repair or replace any equipment that does not meet our specifications.\n\n- Management of Change. We have implemented a system to ensure that any changes to the ethanol process are analyzed for potential hazards not previously considered.  This system also helps us to ensure that our program is current.  Before we start a new process, or after a significant change to the system, we complete a formal pre-startup safety review.\n\n- Incident Investigation.  We investigate all incidents and near miss incidents involving the ethanol process. Our investigation allows us to learn more about the process, to prevent recurrence or similar incidents.  We review the results of our investigation with associates and contractors, if involved.\n\n- Contractors.  We recognize that contractors or visitors may not be familiar with the hazards of our ethanol process.  To help assure the safety of our associates, visitors and contractors, we have implemented a contractor safety program whereby contractors are pre-qualified, informed as to the hazards, and periodically evaluated while on site. \n\n- Safety Systems.  Our ethanol process has been equipped with certain safety systems intended to prevent, or minimize the effects of a release.  Examples of these systems are: excess flow valves on the ammonia system, pressure relief valves, level controls and alarms.  We also have written emergency procedures, in case the system approaches unsafe limits.\n\nFIVE YEAR ACCIDENT HISTORY\nWe have not had any releases of covered chemicals in the last five years, that are reportable under the Risk Management Program rule.\n\nOUR EMERGENCY RESPONSE PROGRAM\nWe are a defensive "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013602,
      "SummaryText": "responder to releases of hazardous materials.  We have developed and implemented an emergency action plan, which details the steps we take in an emergency.  This plan specifies that we call 911 to summon emergency services in case of a release.  A trained HAZMAT team will respond to the release, and our associates will evacuate to a safe area.  The Local Area Planning Commission (LEPC) is familiar with our Risk Management Plan, and will arrange for notification of the public, if necessary.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nWe continually strive to improve the safety of our operations through regular audits along with suggestions and observations from emplyees.  In addition, EH&S improvements will be made as a result of incident investigations from near misses and accidents."
    }
  ]
}