{
  "FacilityID": 1000013740,
  "FacilityName": "Farmers Union Oil Company, Wegdahl NH3 Plant",
  "FacilityStr1": "710 Railroad Ave",
  "FacilityStr2": null,
  "FacilityCity": "Montevideo",
  "FacilityState": "MN",
  "FacilityZipCode": "56265",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27023",
  "LEPC": "Chippewa Cty LEPC-Marv Garbe",
  "FacilityLatDecDegs": "44.888343",
  "FacilityLongDecDegs": "-95.642445",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Glen C. Moe",
  "OperatorStr1": "710 Railroad Ave",
  "OperatorStr2": null,
  "OperatorCity": "Montevideo",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56265",
  "OperatorZipCodeExt": null,
  "RMPContact": "Glen C. Moe",
  "RMPTitle": "General Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000032877",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-12-30 00:00:00",
  "DeRegistrationEffectiveDate": "2010-12-28 00:00:00",
  "AnniversaryDate": "2015-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.8935,
  "FRS_Long": -95.64725,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017106,
      "AltID": "Ammonia (anhydrous)",
      "FacilityID": 1000013740,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017502,
          "ProcessID": 1000017106,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020338,
          "ProcessID": 1000017106,
          "ChemicalID": 56,
          "Quantity": 131000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520338,
          "ProcessID": 1000017106,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013740,
      "SummaryText": "Farmers Union Oil Company, Montevideo, MN, Wegdahl NH3 Plant, Chippewa County\n\nEXECUTIVE SUMMARY - AMMONIA (anhydrous)\n\nTHE ACCIDENT RELEASE PREVENTION AND EMERGENCY RESPONSE & CONTINGENCY POLICIES FOR OUR FACILITY\n\nThis facility complies with the 1989 ANSI K61.1 \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\".\nIn addition, it is our policy to adhere to all applicable federal, state, and local laws.\n\nOne of our company Goals states, \"To provide for the Safety and Security of our employees, our customers, the general\npublic and to be good stewards of the environment for which we serve\".  To fulfill these goals, we enroll in regulatory\nmanagement service that assists in maintaining and administering comprehensive safety and environmental programs,\nprocedures and training courses.  We perform a thorough annual audit program and monitor facility compliance with the\nsafety standards and overseen assistance with this specialty firm.  The program consists of internal audit utilizing checklist\nsurvey forms that are reviewed regularly and updated as necessary to ensure all applicable federal, state, and local regulations\nare covered.  These checklists are used to measure regulatory compliance including those governing the safe handling and\nstorage of anhydrous ammonia.  Procedures require a timely response and correction of all recommendations resulting\nfrom these audit checklists.  \n\nA \"Site Safety Coordinator\" is identified and used as an extension of the general manager and management service personnel\nfor a \"hands on\" manager of the day to day safe working activities, maintains the required regulatory recordkeeping, conducts\nemployee training, and acts as the location's contact during emergency incidents that are rehearsed biannually.\n\nA DESCRIPTION OF THE FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nThe facility is a wholesale farm supply and distribution center and as such we store and distribute a wide variety of pesticides\nand fertilizers in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013740,
      "SummaryText": "cluding anhydrous ammonia.  Anhydrous Ammonia is received by truck, is handled and stored on-site and is a\nregulated substance by the EPA requiring us to comply with this Risk Management Program.  We sell anhydrous ammonia\nto growers in nurse tanks manufactured to the requirements to do such.  The customer applies the ammonia into the soil as\na needed source of nitrogen fertilizer for growing agricultural crops.  Ammonia is also used for blending into mixed grade\nliquid fertilizers for crop production nutrients.\n\nAnhydrous Ammonia is stored in 1 stationary storage tank with a capacity of 30,000 gallons.  131,000 pounds of Anhydrous\nAmmonia is the maximum storage capacity of this stationary storage tank.\n\nWORST CASE SCENARIO\n\nOur worst case scenario is the loss of the total contents of the 30,000 gallon storage tank, when filled to the greatest amount\nallowed (85% if capacity), released as a liquid over 10 minutes, resulting in total vaporization.  The maximum quantity released\nwould be 131,000 pounds.  According to DEGRADIS modeling, the distance to the endpoint (point of dispersion to 200 PPM)\nwould have off-site impact.  It should be noted that our company has never had a total release of an entire storage tank.\n\nALTERNATE RELEASE SCENARIO\n\nThe most common alternate release scenario(s) from an anhydrous ammonia storage facility would not reach an endpoint\noff-site.  The alternate release scenario modeled for the purpose of this plan is a three-minute release from a stationary storage\ntank representing a valve and hose failure requiring a manual shutdown.  The total amount of anhydrous ammonia released in\nthis scenario would be 300 pounds from a storage tank.  The distance to the endpoint would not have an impact.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe ammonia storage system is designed, installed and is maintained in accordance with ASTM standards and the ASME\ncodes.  This facility complies with the ANSI K61.1 st"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013740,
      "SummaryText": "andards (1989 edition), OSHA - 29 CFR 1910.111, EPA's Accidental\nRelease Prevention Rule as well as applicable federal, state, and local codes and regulations.\n\nOur ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, manual\nshutoffs and emergency shutoff valves.  The load-out risers used for the purpose of filling the nurse tanks are protected by\nexcess flow valves and fill line breakaways to immediately stop the flow of ammonia is a line or a hose would fail.  All of the\nmain storage tank valves and the riser load valves are locked when not in use.  Lighting for the facility has increased to\ndiscourage the increase of meth theft.\n\nOur anhydrous ammonia system is inspected on a regular basis with maintenance and preventive maintenance scheduled\nand documented.  Liquid and vapor valves, hoses, excess flow valves, gauges, and relief valves are replaced when necessary\nand/or according to the guidelines within the ANSI standards.\n\nTraining is provided to all employees at least annually, whenever there is a change in the process or whenever competency\nwith the regulations are questioned.  In accordance with the 1989 ANSI standards, training is also offered for all ammonia\ncustomers to attend on a regular basis and offered to the local fire department personnel during their annual tour of our\nfacility and operations.  These training courses consist of classroom lecture, current and approved videos or compact disc,\ntesting both verbally and written, demonstration and observation for each person working with the process that are certified\nwhile on-going job training is always improved upon.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere has been no accidents involving anhydrous ammonia that has caused deaths, recordable injuries, property or\nenvironmental damage including evacuations on or off site.\n\nThe \"EMERGENCY RESPONSE AND CONTINGENCY PLAN\"\n\nIn the event of an emergency involving our ammonia system, it is our policy to notif"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013740,
      "SummaryText": "y the local community fire department and\nrequest that they respond to the emergency with the facility's personnel assistance.  In preparation for this, we have coordinated\nwith all of the local response agencies by providing information and facilty tours annually to ensure that they are familiar with\nand properly prepared for an incident at our facility.  This will help ensure that our community has the strategy for responding\nto a mitigating the threat posed by an ammonia release.  This complies with the requirement of our facility to be included in\nthe community emergency response plan prepared under EPCRA and coordinated with our LEPC.\n\n\n\n\nCERTIFICATION LETTER\n\nCERTIFICATION STATEMENT FOR PROGRAM LEVEL 2 PROCESS\n\nTo the best of the undersigned's knowledge, information and belief formed after reasonable inquiry, the information submitted\nis true, accurate, and complete.\n\n\n\n\n\n_______________________________________________________________________________________________________\nSignature                                                                                                             Print Name\n\n\n\n\n\n\n______________________________________________________________________________________________________\nTitle                                                                                                                    Date\n\n\n\n\n\nEPA FACILITY ID# 1000 0003 2877"
    }
  ]
}