{
  "FacilityID": 1000033456,
  "FacilityName": "NEW Cooperative, Inc. - LANYON",
  "FacilityStr1": "2024 390th Street",
  "FacilityStr2": null,
  "FacilityCity": "Harcourt",
  "FacilityState": "IA",
  "FacilityZipCode": "50544",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19187",
  "LEPC": "Region 5 LEPC",
  "FacilityLatDecDegs": "42.223932",
  "FacilityLongDecDegs": "-94.199776",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NEW Cooperative, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 22354377,
  "Company2DUNS": 0,
  "OperatorName": "NEW Cooperative, Inc.",
  "OperatorStr1": "2626 1st Ave S",
  "OperatorStr2": null,
  "OperatorCity": "Fort Dodge",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Knight",
  "RMPTitle": "Safety Director",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000219916",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-08-28 00:00:00",
  "SafetyInspectionBy": "IA Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-05-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-05-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-05-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040824,
      "AltID": null,
      "FacilityID": 1000033456,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000041246,
          "ProcessID": 1000040824,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049048,
          "ProcessID": 1000040824,
          "ChemicalID": 56,
          "Quantity": 547830.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000549048,
          "ProcessID": 1000040824,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033456,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE FOR NEW COOPERATIVE, INC., LAYON, IA.\n\n\n\nThis facility complies with the ANSI Standard k-61.1-1995 requirements for Anhydrous Ammonia storage. It is NEW Cooperative, Inc.'s policy to adhere to all applicable Federal, State, and local regulations. If an emergency were to occur, it is our policy to immediately vacate the premises, move to a safe location, and notify the HARCOURT Volunteer Fire Department (via a 911 call) and request that it respond to the emergency. Incidental to the notification to the fire department, a call to the Region 5 LEPC will be made. \n\n\n\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be different and cannot be ensured to duplicate what may have been planned. In reality, the situation that develops may not happen in a manner in which it has been planned. In that event, what we may have planned will serve only as a guideline to follow. \n\n\n\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals, tornadoes, bomb threats, vandalism, or other accidents or acts of God which might occur on our premises. \n\n\n\nThe primary emergency response coordinator for the Lanyon, IA location is Tyler Toyne, Location Manager. His work and 24-Hour emergency response telephone numbers are provided in the Registration Section of this document. The 24-Hour emergency response number provided in that section also provides a telephone tree for additional individuals who are available and can respond to an emergency at that location. \n\n\n\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT NEW COOPERATIVE, INC., LANYON, IA.\n\n\n\nThis facility is a bulk anhydrous ammonia storage and distribution plant. The anhydrous ammonia that is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033456,
      "SummaryText": " stored at this facility is distributed to agricultural crop producers in the surrounding area who utilize the anhydrous ammonia for crop nutrient purposes. \n\n\n\nThe system consists of two (2) storage tanks with associated piping, valves, liquid pumps(s), and other miscellaneous equipment and a various number of nurse tanks. The anhydrous ammonia plant is only operated on a seasonal basis (Spring and Fall). Full-time equivalent employee numbers were computed on that basis. At a maximum, the plant operates a total of three (3) months (1/4 of the year). The FTEs for this company location is one (1).\n\n\n\nTHE WORST-CASE RELEASE SCENARIO\n\nThe worst-case scenario is the failure of the largest storage tank when filled to the greatest amount allowed (85% capacity), resulting in the release of the total volume in a gaseous (hazardous ammonia vapor cloud) form. According to EPA's RMP*Comp (Version 2.01), the distance to the endpoint is 4.4 miles. The alternative release scenario involves the transport delivery vehicle pulling away from the intake lines into the storage plant without disconnecting the transfer hoses. The resulting release (according to EPA's RMP*Comp Program) has a distance endpoint of 0.1 miles. \n\n\n\nSince this facility is located in relative close proximity to the town of Harcourt, IA and the unincorporated community of Lanyon, IA, provisions have been designed to notify all affected persons. An evacuation plan is in place. \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThis facility complies with EPA's accident prevention regulation and all applicable State and Local regulations. The anhydrous ammonia system is designed, installed, and maintained in accordance with ANSI Standard k-61.1-1999 and State Law.\n\n\n\nIn addition the company has specific operating procedures in place intended to minimize the potential for an accidental release of anhydrous ammonia. Finally, NEW Cooperative, Inc. has extended to the Harcourt Vol"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033456,
      "SummaryText": "unteer Fire Department the opportunity to visit our anhydrous ammonia plant, to participate in mock emergency simulation training, and to avail themselves of specific anhydrous ammonia health hazard information and training provided by the company. \n\n\n\nFIVE YEAR ACCIENT HISTORY\n\nNEW Cooperative, Inc., Lanyon, IA has never had an accident involving anhydrous ammonia that caused death, injuries, property or environmental damage, evacuations or sheltering in place. \n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nIn the event of an emergency involving our anhydrous ammonia system, it is the policy of NEW Cooperative, Inc. to immediately notify the Harcourt Volunteer Fire Department and the Region 5 LEPC to request that they respond to the emergency. In the unlikely event that the Harcourt Volunteer Fire Department is unable to adequately respond to an emergency at our Lanyon location, mutual aid (reciprocal agreement between neighboring fire departments) will be summoned. We have discussed this policy with the fire department and Region 5 LEPC. Members of the fire department and the LEPC have inspected our anhydrous plant. \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nNone at this time. \n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}