{
  "FacilityID": 1000094330,
  "FacilityName": "Wilako Wastewater Treatment Plant",
  "FacilityStr1": "P. O. Box 69",
  "FacilityStr2": "2909 Elmore Road",
  "FacilityCity": "Wetumpka",
  "FacilityState": "AL",
  "FacilityZipCode": "36092",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01051",
  "LEPC": "Elmore County LEPC",
  "FacilityLatDecDegs": "32.522700",
  "FacilityLongDecDegs": "-086.220900",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "LF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 872890454,
  "ParentCompanyName": "Water & Sewer Board of the City of Wetumpka",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Water &Sewer Board City of Wetumpka",
  "OperatorStr1": "P. O. Box 69",
  "OperatorStr2": null,
  "OperatorCity": "Wetumpka",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36092",
  "OperatorZipCodeExt": null,
  "RMPContact": "Christopher M. Bowar",
  "RMPTitle": "Wastewater Superintendent",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000029113",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-11-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-07-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.52964,
  "FRS_Long": -86.26619,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117089,
      "AltID": "Chlorine",
      "FacilityID": 1000094330,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000118503,
          "ProcessID": 1000117089,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146475,
          "ProcessID": 1000117089,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000646475,
          "ProcessID": 1000117089,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094330,
      "SummaryText": "Section 1    Executive Summary\n\n\n\nThe Water & Sewer Board of the City of Wetumpka developed a Risk Management Plan (RMP) to be implemented at the Wilako Wastewater Treatment Plant in an effort to protect human health, to protect the environment and meet applicable federal regulations. This plant is operated by the Water & Sewer Board and has a capacity to process 4.5 million gallons of domestic wastewater per day. It is located in Section 22, Township 18 North, Range 18 East, just south of Alabama Highway 14 approximately 2.25 miles west of the downtown Wetumpka area. The plant address is 2909 Elmore Road, Wetumpka, Elmore County, Alabama.\n\n\n\nThis RMPlan has been developed to meet the standards published in the 40 Code of Federal Register (CFR) part 68. These regulations were promulgated by the EPA to cover the accidental release preventive under the Clean Air Act #112&reg;(7). These require facilities that exceed the cited threshold quantities for certain chemicals to develop a RMPlan. The goal of a RMPlan is to focus on reducing the risk of accidental releases of certain chemicals; thereby, preventing harm to employees as well as potentially catastrophic impacts on the public. Over 60 accidental releases of RMPlan regulated chemicals at waste treatment plants (WTP's) and wastewater treatment facilities in the United States were reported between 1986 and 1995.\n\n\n\nThe chemicals currently used in the wastewater process at this site covered by the regulation is chlorine. The maximum potential amount of chlorine to be present on site at any one time is 4,000 pounds. Chlorine is stored in one ton cylinders, and although there is potential for 4,000 pounds to be present on the site at any one time, typically, at least one of the cylinders is half empty so usually less than 3,000 pounds is on site. \n\n\n\nIn order to illustrate the areas that could be impacted from a release of the chemicals onto the atmosphere, offsite consequence analyses were conducted. Two offsite conseq"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094330,
      "SummaryText": "uence analyses were performed for the chemical of chlorine. The first release scenario is the case defined by the EPA as the worst case scenario. This scenario assumes that the largest vessel of each chemical is full and it releases the entire contents of the containers during a ten minute period. The second scenario is based on a situation more likely to occur which will cause a release of chemicals at the facility. The radius of impact was determined based on the guidance provided in Chapter 4:  Offsite Consequence Analysis of the General Guidance for RMPlans dated October 27, 1998.\n\n\n\nIn all releases scenarios, the toxic end point concentration remains the same. The toxic end point for chlorine is 3 ppm. The American Industrial Hygiene Association has listed these concentration as the maximum airborne concentration, at which nearly all individuals could be exposed to for up to 1 hour without experiencing or developing life threatening health effects. Results of the off-site consequence analyses for the EPA worst case scenario led to an area defined by a 3 mile radius for chlorine. These 3 mile radius encompass the majority of the Wetumpka Incorporated area that includes a population of approximately 6,500 people (according to 2010 census data). The alternative off-site consequence analysis yields significantly smaller areas. The off-site analysis for chlorine indicates a 1.4 mile radius to the end point concentration.\n\n\n\nThe Key to a successful RMPlan is to first define hazard, risk and undertake a comprehensive approach to prevention. The Center of Chemical Process Safety has defined hazard as: (A chemical or physical condition that has the potential for causing damage to people, property or the environment.)\n\n\n\nOnce hazards are identified on the site, then, an evaluation of the risk involved will lead to a systematic identification, evaluation, and control of potential losses that may arise in operation from future events such as fires, explosions, or toxic che"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094330,
      "SummaryText": "mical release. The Water & Sewer Board has a safety program for the Wilako WWTP that is a integral part of the RMPlan. The safety program sets forth inspections and maintenance requirements of equipment, employees training and periodically reviewing readiness. Throughout this RMPlan, the emergency readiness procedures and regular training schedules are emphad. One of the goals of implementing these procedures and schedules is to minimize the chance of a release occurring. If the plant employees practice preventative maintenance and are well trained in emergency procedures, if a release occurs, they will be successful in preventing and minimizing personnel injury.\n\n\n\nAll employees of the Water Works are required to know the locations of the emergency telephone numbers and names of individuals to contact in case of a release. If an emergency occurs, each employee will have an assigned task. This risk management program enhances the safety plan already in operation because it provides a clear checklist that identifies predetermined individuals and agencies that require notification and coordination. This RMPlan details which individuals will respond to the release to stop it and it outlines the agencies that will be responsible for evacuating the appropriate areas, and for sounding the \"all clear\" once a leak is contained. The plan also includes procedures for the periodic review of readiness.\n\n\n\nThe Wilako Wastewater Treatment Plant has been operational for approximately 20 years, and to date, there have not been any major reported releases from this facility. The primary purpose of this Risk Management Plan is to maintain the plant's current high level of safety and safety record.\n\n"
    }
  ]
}