{
  "FacilityID": 1000036203,
  "FacilityName": "Hanover Regional Wastewater Treatment Facility",
  "FacilityStr1": "End of O'Brien Lane",
  "FacilityStr2": null,
  "FacilityCity": "McSherrystown",
  "FacilityState": "PA",
  "FacilityZipCode": "17334",
  "Facility4DigitZipExt": "7749",
  "FacilityCountyFIPS": "42001",
  "LEPC": "Adams County LEPC",
  "FacilityLatDecDegs": "39.8042",
  "FacilityLongDecDegs": "-077.0306",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.hanoverboroughyorkcountypa.info/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Borough of Hanover",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Borough of Hanover",
  "OperatorStr1": "44 Frederick Street",
  "OperatorStr2": null,
  "OperatorCity": "Hanover",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17331",
  "OperatorZipCodeExt": "3598",
  "RMPContact": "Timothy L. Mayers",
  "RMPTitle": "Wastewater Superintendent",
  "FTE": 12,
  "OtherEPAFacilityID": "PA0026875",
  "EPAFacilityID": "100000081797",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-12-04 00:00:00",
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-11-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-11-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-11-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-11-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.8052,
  "FRS_Long": -77.0186,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044391,
      "AltID": "Disinfection System",
      "FacilityID": 1000036203,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000044813,
          "ProcessID": 1000044391,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053435,
          "ProcessID": 1000044391,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000553435,
          "ProcessID": 1000044391,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000044392,
      "AltID": "Dechlorination System",
      "FacilityID": 1000036203,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000044814,
          "ProcessID": 1000044392,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053436,
          "ProcessID": 1000044392,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000553436,
          "ProcessID": 1000044392,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036203,
      "SummaryText": "The Borough of Hanover owns and operates a Wastewater Treatment Plant (WWTP). The plant service area includes Hanover Borough and a portion of Penn Township in York County, and a portion of McSherrystown Borough and Conewago Township in Adams County, Pennsylvania.  The WWTP, located at the end of O'Brien Lane in Conewego Township, is permitted for an Annual Average Flow of 5.6 million gallons per day of wastewater and discharges to the South Branch Conewego Creek under NPDES Permit No. PA0026875.  Wastewater treatment processes include grit and screenings removal, primary clarification, activated sludge treatment process, final clarification, denitrification filters, disinfection, and de-chlorination.  Biosolids are stabilized in anaerobic digesters, dewatered, and utilized for agricultural purposes through land application.  The plant is operated 24 hours per day, 365 days per year.\n\n\n\nThe WWTP includes a disinfection system comprised of a chlorine container room, which contains two (2) one-ton containers of chlorine liquefied under pressure, a chlorinator, various safety equipment, and instrumentation consisting of flow recorders, electrical panels, and a gas detector/alarm unit.  Up to six (6) one-ton containers may be on-site simultaneously.  The chlorinator system extracts chlorine gas from the storage containers through vacuum regulators and dissolves this gas in water to form a disinfection solution that is used to kill pathogenic bacteria and microorganisms in the treated wastewater effluent prior to its discharge into the receiving stream. Treatment plant operators regularly check the chlorinator room and its equipment, inventorying the rate of chlorine use and adjusting the rate as necessary.  The maximum intended inventory for planning purposes is 12,000 pounds.\n\n\n\nTo improve the water quality of the effluent discharged to the receiving stream, the WWTP utilizes sulfur dioxide gas, another regulated substance, to de-chlorinate its effluent through a proce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036203,
      "SummaryText": "ss called \"sulfonation\".  The sulfonator is similar to the chlorinator and injects sulfur dioxide gas into wastewater to remove excess chlorine.  A maximum of four (4) one-ton containers may be on-site simultaneously; therefore, the maximum intended inventory for planning purposes is 8,000 pounds. \n\n\n\nAtmospheric dispersion modeling was performed using the RMP*Comp program distributed by the Chemical Emergency Preparedness and Prevention Office of the United States Environmental Protection Agency (USEPA).  This model determines the distance traveled by chlorine and sulfur dioxide released until concentrations decrease to the \"toxic endpoint\" of 0.0087 milligrams per Liter (mg/L) and 0.0078 mg/L, respectively, as selected by USEPA.  The chlorine toxic endpoint of 0.0087 mg/L in air and sulfur dioxide toxic endpoint of 0.0078 mg/L in air both represent the American Industrial Hygiene Association (AIHA) Emergency Response Planning Guideline (ERPG)-2, defined as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action\".  This amount corresponds to 3.0 parts per million by volume.   \n\n\n\nThe Hanover WWTP Accidental Release Prevention Program is based upon the following elements:\n\n1.    Routine training for the operators;\n\n2.    Preventative maintenance program for equipment;\n\n3.    Use of industry-standard process and safety equipment;\n\n4.    Use of effective standard operating procedures, written with the participation of the operators;\n\n5.    Performance of a Hazard Review of the equipment and procedures; and\n\n6.    Implementation of an auditing and inspection program.\n\n\n\nChemical specific prevention steps include availability of self contained breathing apparatus (SCBA), awareness of the hazards and toxic properties of chlorine and sulfur dioxide, and the presen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036203,
      "SummaryText": "ce of gas detectors.\n\n\n\nNo accidental releases of chlorine have occurred at this facility since the WWTP went into service in 1986.  No accidental releases of sulfur dioxide have occurred at this facility since the WWTP started to use sulfur dioxide in March 1999.  Therefore, there have been no accidental releases of chlorine or sulfur dioxide within the 5-year review period stipulated for this RMP.\n\n\n\nThe facility has an emergency response program that has been reviewed and coordinated by the Adams County Local Emergency Planning Committee (LEPC) in Gettysburg, Pennsylvania.  The operation and response procedures are reviewed and updated on an annual basis by the Adams County LEPC.  The Adams County Hazardous Materials (HAZMAT) team is the designated first-responder in the event of a chlorine or sulfur dioxide leak incident.  The Adams County HAZMAT team is trained only at the Technician Level and, therefore, is not state certified; however, they can provide limited support for leak containment.  Under a mutual aid agreement between Adams County and York County, the York County HAZMAT team will provide additional support for chlorine or sulfur dioxide leak.  The York County HAZMAT team is state certified and undergoes extensive training in dealing with a variety of hazardous material incidents, including chlorine and sulfur dioxide gas leaks. \n\n\n\nRecommendations to improve safety were made following a June 25, 2013 inspection of the chlorination and dechlorination facilities by the Borough's Consulting Engineer.  These recommendations include routine review, and updating as necessary, of the written emergency standard operating procedures (SOPs), continued implementation of the operator training program, and increased documentation of routine functions related to the performance of the two (2) regulated processes.\n\n"
    }
  ]
}