{
  "FacilityID": 1000096334,
  "FacilityName": "FNA Nashua Transflow",
  "FacilityStr1": "57 Crown Street",
  "FacilityStr2": null,
  "FacilityCity": "Nashua",
  "FacilityState": "NH",
  "FacilityZipCode": "03060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33011",
  "LEPC": "Nashua LEPC",
  "FacilityLatDecDegs": "42.75852",
  "FacilityLongDecDegs": "-71.44339",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "http://www.ferrellgas.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 69859903,
  "ParentCompanyName": "FNA",
  "Company2Name": "Ferrellgas Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ferrellgas",
  "OperatorStr1": "PO Box G",
  "OperatorStr2": null,
  "OperatorCity": "Chepachet",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02814",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ryan Avila",
  "RMPTitle": "Director of Supply",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000231313",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-07-15 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration (FRA)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119489,
      "AltID": "Propane transloading",
      "FacilityID": 1000096334,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000120842,
          "ProcessID": 1000119489,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149488,
          "ProcessID": 1000119489,
          "ChemicalID": 98,
          "Quantity": 403800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000649488,
          "ProcessID": 1000119489,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096334,
      "SummaryText": "The Employees at Ferrellgas (FG) Nashua, NH are strongly committed to employee, public, and environmental safety. This facility is operated to comply with all applicable federal, state, and local laws and is designed and operated in accordance with NFPA 58 Liquefied Petroleum Gas Code requirements. In addition, FG Nashua operates this facility in accordance with our internal standards that employs good engineering practice and industry accepted principles and codes. FG Nashua has instituted operating and training procedures that are designed to provide a safe work environment and protect our neighbors.\n\n\n\nFG Nashua operates a propane transloading facility located in the Pan AM railcar yard. It is comprised of one Risk Management Plan (RMP)-covered process involving propane. The primary purpose of this facility is to distribute propane to wholesale customers. All propane is delivered to the facility by railcar, and transloaded into trucks. No other RMP regulated substances are handled at this facility.\n\n\n\nTo evaluate the worst-case release scenario and alternative release scenario, we used the EPA's RMP*COMP TM software and followed the EPA RMP guidance for Propane Storage Facilities. The following paragraphs provide details of the chosen scenarios.\n\n\n\nIn accordance with RMP guidelines, the worst-case scenario for a flammable substance release from this facility is a release from a railcar. In this scenario 115,000 lb. of Propane is released. A worst-case release is defined by the rule as the loss of the contents of the single largest vessel (or piping) containing the regulated substance.  For propane and other flammable substances, the released substance is assumed to explode and generate a pressure wave that can damage people or structures.  The rule requires you to determine the distance to a 1 psi overpressure (at 1 psi, windows will break). The distance of 0.4 miles is obtained corresponding to an endpoint of 1 psi overpressure.\n\n\n\nThe alternative release scenar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096334,
      "SummaryText": "io submitted for Program 2 flammable substances involves a release from a pipe break on the transloader. If a 3 inch pipe breaks, it could result in 4,612 lb. per minute release.  The amount of time the release would occur is dependent upon when the excess flow valve, or the Emergency Safety Valve (ESV) would automatically close, or when a manual ESV could be closed.  It is anticipated it would take less than 5 minutes.  The entire release is expected to be 23,060 pounds of LPG. This incident was used in an attempt to obtain a release quantity sufficient to predict an offsite impact in a vapor cloud explosion. Active mitigation systems, excess flow valves and ESV systems, were considered in this case. The distance of 0.2 miles is obtained corresponding to an endpoint of 1 psi overpressure.\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with NFPA-58 Standard. \n\n\n\nFG Nashua has had an excellent record of preventing accidental releases over the last five years. Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\nFG Nashua coordinates emergency response with the City of Nashua Fire Marshal's Office and the Fire Department to deal with accidental releases of propane. We have coordinated our activities for emergency planning and our facility is included in the community emergency response plan.  We communicate with the fire department every time we transload propane.  FG Nashua does not perform emergency response as defined by EPA RMP rules. Our Employees perform incidental response, which is limited to actions that can be safely taken to stop or prevent a minor release of propane. \n\n\n\nWe constantly review our propane operations and procedures to improve safety.  There are no current plans to change our currrent operation.\n\n"
    }
  ]
}