{
  "FacilityID": 1000036620,
  "FacilityName": "DyStar LP",
  "FacilityStr1": "209 Watlington Industrial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Reidsville",
  "FacilityState": "NC",
  "FacilityZipCode": "27320",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37157",
  "LEPC": "Rockingham County LEPC",
  "FacilityLatDecDegs": "36.321868",
  "FacilityLongDecDegs": "-79.649677",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dystarlp.com",
  "FacilityEmailAddress": "bumgarner.marc@dystarlp.com",
  "FacilityDUNS": 45057155,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Marc Bumgarner",
  "OperatorStr1": "209 Watlington Industrial Drive",
  "OperatorStr2": null,
  "OperatorCity": "Reidsville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27320",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000222966",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "09535R02",
  "SafetyInspectionDate": "2013-05-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-10-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-10-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-10-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-02-08 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-06 00:00:00",
  "AnniversaryDate": "2018-10-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "90",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044868,
      "AltID": "Resinbond K-250",
      "FacilityID": 1000036620,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054234,
          "ProcessID": 1000044868,
          "ChemicalID": 1,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045273,
          "ProcessID": 1000044868,
          "NAICSCode": "32519",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000045274,
          "ProcessID": 1000044868,
          "NAICSCode": "32519",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000039098,
              "Process_NAICS_ID": 1000045274,
              "SafetyReviewDate": "2013-10-03 00:00:00",
              "PHA_Date": "2013-08-20 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-08-20 00:00:00",
              "TrainingReviewDate": "2013-09-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-20 00:00:00",
              "EquipmentInspectionDate": "2013-08-20 00:00:00",
              "EquipmentTested": "Reactor 107",
              "ChangeMgmtDate": "2013-08-20 00:00:00",
              "ChangeMgmtReviewDate": "2013-08-20 00:00:00",
              "PreStartupReviewDate": "2013-08-20 00:00:00",
              "ComplianceAuditDate": "2013-08-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-08-20 00:00:00",
              "HotWorkPermitReviewDate": "2013-08-20 00:00:00",
              "ContractorSafetyReviewDate": "2013-08-20 00:00:00",
              "ContractorSafetyEvalDate": "2013-08-20 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Resinbond K-250 process takes place in a single vessel. The vessel is a 9100 gallon stainless steel batch reactor. This process is regulated due to two chemicals. The first chemical being Formaldehyde 50% solution and second chemical being Acetone. The preventive safeguard systems in place for this process are as follows:\n\n- A Process Hazard Analysis(PHA) was conducted on August 20, 2013\n\n- The batch reactor R-107 has a pressure relief device (or pressure safety valve) installed\n\n- All fixtures in and around the R-107 reactor area are intrinsically safe / explosion proof\n\n- Reactor R-107 is a stainless steel jacketed vessel that will allow for rapid cooling to assist with the inhibition of a runaway reaction\n\n ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000046465,
                  "PreventionProgram3ID": 1000039098,
                  "ProcessChemicalID": 1000054234
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036620,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2013-06-28 00:00:00",
    "ERTrainingDate": "2013-10-01 00:00:00",
    "CoordinatingAgencyName": "Reidsville Fire Department",
    "CoordinatingAgencyPhone": "3363491024",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036620,
      "SummaryText": "Dystar's RMP Executive Summary for the \n\nResinbond K-250 Process\n\n\n\n\n\nOverall approach to chemical safety. \n\n\n\nDystar LP is committed to meeting and (or) exceeding all regulatory requirements in regards to Chemical Safety. Dystar has a comprehensive Environmental Health & Safety (EH&S) program that takes a proactive approach towards employee safety as well as the surrounding community. \n\n\n\nAs part of the Senior management team, Dystar's Reidsville, NC location, Site Manager who answers directly to the President and CEO of Dystar is ultimately responsible for the EH&S programs at the covered process site. The Site Manager is intimately involved in all EH&S programs including Risk Management Planning (RMP) and Process Safety Management (PSM) and communicates all aspects of the EH&S programs to senior level management. \n\n\n\nSenior Management commitment provides the motivating force and resources for organization and controlling activities within Dystar's facilities.  Senior management must act as a role model for how all employees should work to &#8232;create a safe work environment. \n\nDystar's Active Senior Management leadership includes:\n\n?    Implementation of a comprehensive safety and health management program. &#8232;\n\n?    Providing appropriate financial, human, and organizational resources to ensure a top-notch EH&S program is in place. &#8232;\n\n?    Issuance of a written safety and health policy as a value of the organization as included in the Safety / Environmental Policy, Program, and Procedure Manual. &#8232;\n\n?    Define roles, assigning responsibilities, establishing accountability and delegating authority. &#8232;\n\n?    Integrate the safety and health goals' objectives into the organization's business systems and processes. &#8232;\n\n?    Discuss safety and health processes and improvements regularly during staff or employee meetings. &#8232;\n\n?    Ensure management is held accountable for accident-prevention processes. &#8232;\n\n?    Assess the success of the safety and health p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036620,
      "SummaryText": "rocesses through audits. &#8232;\n\n?    Encourage employees to take an active part in maintaining a safe and healthy workplace. &#8232;\n\n?    Follow established safety and health rules and procedures. &#8232;\n\n?    Discuss openly safety and health issues with employees during meetings. &#8232;\n\n?    Establish a system for effective communication. &#8232;\n\n?    Recognize employees for their safety and health efforts during employee review process.\n\n?    All employees are provided equally high quality safety and health &#8232;protection.\n\n\n\nWritten Safety and Health Policy\n\nDystar has a written safety and health policy that clearly states the company's commitment to effective safety and health management and to providing a safe and healthy working environment. .  Additionally, Dystar has a formal written Process Safety Management Program that begins with the General Safety Statement regarding PSM / RMP chemicals\n\nAccessibility\n\nDystar has an open door policy for reporting and (or) discussing EH&S related issues and (or) concerns. \n\nProgram Evaluation\n\nDystar management ensures a sound EH&S program is in place and working properly by contracting with a third party EH&S consultant. The third party EH&S consultant performs periodic audits / assessments to ensure effectiveness of EH&S programs as they apply.\n\nRecognition of Employee Safety and Health Efforts\n\nDystar addresses employee safety and health efforts at a minimum of once a year during the employee's annual performance review. Additionally, supervisors are encouraged to recognize and praise employees for following specific safety and health work practices. \n\nCommunication\n\nDystar's approach to managing safety and health includes verbal and written communication as a two-way &#8232;process between employer and employees.  Dystar keeps employees informed and invites feedback and suggestions.\n\n\n\n\n\n\n\n\n\n\n\n \n\nDystar's regulated substances \n\n\n\nDystar L.P. located at 209 Watling Industrial Drive in Reidsville; North Carolina is a chemical "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036620,
      "SummaryText": "manufacturing facility. Dystar manufactures auxiliary chemicals for the textile industry and the leather industry as well as custom chemical manufacturing.\n\n\n\nDystar's manufacturing plant operates batch reactors that synthe chemicals to support the textile and leather industry. Dystar is subject to the requirements of RMP due to the Resinbond K-250 process. This process is carried out as follows:\n\n\n\nResinbond K-250\n\n1.    A load of Formaldehyde 50% solution is brought onsite via over-the-road cargo tanker (MC-307/DOT-407)\n\n2.    The amount of Formaldehyde varies based on supplier but the average poundage received onsite is 45,000lbs\n\n3.    The entire cargo tanker of Formaldehyde 50% solution is offloaded into a reactor (a large sealable mixing vessel) utilizing vacuum as the offloading method as opposed to pumping or pressurizing.\n\n4.    Through a formula (or batch recipe) procedure, additional chemicals are added in a designated sequence.\n\n5.    Acetone in excess of 10,000lbs is added as part of the process. The acetone is charged into the reactor utilizing a vacuum process the same as Formaldehyde. The acetone is transferred from a storage tank via jumper hose that is not permanently connected. For safety purposes, the headspace in the acetone storage tank is blanketed with Nitrogen thus removing all oxygen and preventing possibility of ignition\n\n6.    Additional constituents are added per operating procedures. No additional constituents fall under the RMP requirements.\n\n7.    The end product is a non DOT regulated intermediate for paper adhesive\n\n\n\n\n\n\n\n\n\n\n\nGeneral accidental release prevention program and chemical-specific prevention steps\n\n\n\nDue to the aforementioned covered process, Dystar complies with EPA 40 CFR part 68 and 29 CFR 1910.119. Our Process Safety Management (PSM) enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents. Overall, th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036620,
      "SummaryText": "e PSM prevents accidental fatalities, injuries and illnesses and avoids physical property damage.\n\nThe \"process\" part of the Process Management Program is any activity involving a highly hazardous chemical including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities. Any group of vessels that are interconnected and separate vessels that are located such that a highly hazardous chemical could be involved in a potential release shall be considered a single process.\n\nOur PSM / RMP prevents accidents because it focuses on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment. These rules are detailed and improved as necessary. They are also communicated to and accepted by all persons at the facility.\n\nAt the same time, our PSM / RMP covers not only highly hazardous chemicals, but also those that may be harmless in terms of flammability, explosiveness, or toxicity, but, when mixed with another substance, can produce a highly hazardous substance or situation. The accidental mixing of some reactive chemicals can cause explosions or the release of toxic vapors - situations that are clearly a threat to the life and health of workers at the site.\n\nLike all PSM / RMP written programs, Dystar's contains at a minimum the following major elements:\n\n?    Purpose statement, \n\n?    Employee participation plan, \n\n?    Process safety information, \n\n?    Process hazard analysis records, \n\n?    Operating procedures, \n\n?    Training, \n\n?    Contracting, \n\n?    Process equipment integrity maintenance procedures, \n\n?    Non-routine work, \n\n?    Management of change procedures, \n\n?    Incident investigation reports, \n\n?    Compliance audit reports, and \n\n?    Emergency Action Plan\n\n\n\nAdditional Prevention Program Practices\n\n \n\n?    A formal Process Hazard Analysis (PHA) is performed using Hazard Review Leader software and a diverse team of subject matter experts\n\n?    Corrective action is taken as needed based on r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036620,
      "SummaryText": "esults from PHA\n\n?    Site specific and process specific training is performed for all affected employees\n\n\n\n\n\n\n\n\n\nFive-year accident history\n\n\n\nThis is a first time RMP submittal for this process and the first time Dystar LP has met the RMP covered process submission requirements. Any accidents occurring in the future will be investigated, documented, and followed up with for root cause determination and initiation of preventive measures. This information will be included in the five-year revalidation process.\n\n \n\n\n\nEmergency Response Program\n\n\n\nDystar has a comprehensive Integrated Contingency Plan (ICP). This emergency plan addresses all elements of the OSHA mandated Emergency Action Plan (EAP), Fire Prevention Plan (FPP), and the Resource Conservation recovery Act (RCRA) Contingency Plan. This plan meets and (or) exceeds the requirements of emergency action for PSM / RMP covered processes. The elements of the plan are as follows:\n\n\n\nEmergency Action Job Descriptions - Identifies key personnel and their respective roles during and emergency situation\n\n\n\nProcedures for Emergency Notification - Identifies who needs to be notified during an emergency and includes their updated contact information\n\n\n\nProcedures for Chemical Emergency - Includes procedures to be followed in the event of a chemical emergency situation\n\n \n\nProcedures for Fire Emergency - Includes procedures to be followed in the event of a fire related emergency situation\n\n\n\nProcedures for Emergency Response - Describes Dystar's policy and procedures for actual response to an emergency situation including limitations\n\n\n\n\n\nProcedures for Evacuation / Accountability - Includes procedures for evacuation of the facility due to an emergency situation and includes accountability of personnel. Also, this section includes information regarding audible / visual warning systems in the event of an emergency\n\n\n\nProcedures for Other Emergencies - Addresses emergency action for other emergency situations\n\n\n\nIncident Inv"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000036620,
      "SummaryText": "estigation - Indicates Dystar's policy and process for conducting an investigation of an emergency including a root cause and prevention recommendations\n\n\n\n\n\nAdditional Elements of Dystar's Response Program:\n\n\n\n?    Dystar has mailed a copy of the ICP to all public safety partners and requested acknowledgement. Most public safety partners responded and a letter of acknowledgement is on file for those that did respond.\n\n?    Dystar employees have been trained on the PSM / RMP covered process and the respective elements\n\n?    Dystar is an active member of the Rockingham County Local Emergency Planning Committee (LEPC)\n\n?    Plant evacuation drill are conducted periodically\n\n?    Public notification (if necessary) will be handled by Rockingham County Emergency services. Most likely the form of Public notification will be the reverse 911 system in conjunction with other methods as determined by the local response agencies.\n\n\n\n\n\n\n\nPlanned changes to improve safety\n\n\n\nDystar management as previously mentioned is committed to employee safety as well as the community. Through a formal Process Hazard Analysis (PHA) minor action items were identified for review and possible corrective action. Each action item was assigned to a responsible individual(s).  \n\n\n\nDystar committed to continuous improvement especially as it relates to EH&S systems and processes. \n\n"
    }
  ]
}