{
  "FacilityID": 1000080538,
  "FacilityName": "Kagome Foods, Inc",
  "FacilityStr1": "710 North Pearl Street",
  "FacilityStr2": null,
  "FacilityCity": "Osceola",
  "FacilityState": "AR",
  "FacilityZipCode": "72370",
  "Facility4DigitZipExt": "0368",
  "FacilityCountyFIPS": "05093",
  "LEPC": "Mississippi County LEPC",
  "FacilityLatDecDegs": "35.710036",
  "FacilityLongDecDegs": "-089.964589",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7028160,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Luis DeOliveira",
  "OperatorStr1": "333 Johnson Road",
  "OperatorStr2": null,
  "OperatorCity": "Los Banos",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93635",
  "OperatorZipCodeExt": "9768",
  "RMPContact": "Mike Anderson",
  "RMPTitle": "COO",
  "FTE": 185,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000095602",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-03-28 00:00:00",
  "SafetyInspectionBy": "Garden City Ammonia Program",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.70847,
  "FRS_Long": -89.96419,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100601,
      "AltID": "Refrigeration",
      "FacilityID": 1000080538,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101842,
          "ProcessID": 1000100601,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125983,
          "ProcessID": 1000100601,
          "ChemicalID": 56,
          "Quantity": 28400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625983,
          "ProcessID": 1000100601,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080538,
      "SummaryText": "Kagome Foods Inc., P O BOX 368, OSCEOLA, ARKANSAS  72370\n\nEPA ID #: 100000095602\n\n\n\nFACILITY DESCRIPTION, REGULATED SUBSTANCE, ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\n\n\nKagome Foods Inc. (KFI) manufactures consumer, foodservice and industrial food products under both house and private labels.  While most products are primarily edible oil based, many are also tomato, dairy and sugar based.  The regulated stationary source at this facility is the anhydrous ammonia, and is utilized at the facility as a refrigerant to cool the building and freezers. This substance is listed as a Regulated Toxic Substance under 40 CFR Part 68 and is present in quantities that exceed the threshold for Accidental Release Prevention. \n\n\n\nKFI'scommitment to providing a safe, healthy work environment for employees as well as providing a safe, healthy environment for the surrounding community is supported by KFI continually looking for ways to install the latest technology in process controls and monitoring detection systems. The properties of ammonia that make it valuable as a refrigerant, make it necessary to observe certain safety precautions to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community. \n\n\n\nKFI policy in the event of an uncontrolled accidental release of ammonia is to respond to the release with trained emergency personnel (Hazwopper).  Local emergency agencies will be contacted for assistance as well as necessary contractors needed to respond, clean up and restore facility functions to normal.  KFI adheres to all applicable Federal, State and local safety and environmental regulations for the prevention of releases of this chemical.\n\n\n\nACCIDENT RELEASE PREVENTION PROGRAM:\n\n\n\nKFI complies with the Process Safety Management rule of OSHA standard 29 CFR 1910.119 for the prevention of hazardous chemical releases.  The Process Safety Managemen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080538,
      "SummaryText": "t Plan is a comprehensive program with fourteen elements, including process hazard analysis, employee training, operating procedures, mechanical integrity, pre-safety startup, contractor safety, emergency planning and response, compliance auditing, and employee participation.  The Process Safety Management Program ensures that the process and the equipment in the process is designed, constructed, and maintained according to industry codes and standards and that the process is operated according to good engineering practices.  The mechanical integrity element of the program includes scheduled inspections and tests of equipment and of monitoring devices in the process to detect any deficiencies or defects in equipment.  Preventative maintenance and replacement policies of parts and equipment ensures that deficiencies are addressed and corrected before they could potentially contribute to a release incident.   All elements of the Process Safety Management Program help to ensure an uncontrolled release of anhydrous ammonia is prevented.\n\n\n\nThe EPA's RMP*Comp program was used to calculate the worst case and alternative release scenario's.  Based on the  of the largest tank ammonia tank onsite, and company operating procedures, the worst case scenario was a release of 14,200 lbs of ammonia for a release duration of 10 minutes.  The estimated distance to toxic endpoint was 1.5 miles.  A residential population of 6,475 within the radius was estimated using MARPLOT.\n\n\n\nThe alternative scenario was based on a pipe leak, with a release of 1,420 lbs of ammonia over a 10 minute period.  The estimated distance to toxic endpoint was 0.1 miles.  A residential population of 128 withing the radius was estimated using MARPLOT.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\n\n\nNo accidental releases of anhydrous ammonia have occurred at KFI in the past five years that has resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080538,
      "SummaryText": "in place, property damage, or environmental damage.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\n\n\nKFI has developed an emergency response plan (in accordance with 29 CFR 1910.38 and 29 CFR 1910.120) that includes provisions to respond to chemical emergencies on site with trained KFI personnel and provisions to evacuate non-responding employees from the facility in the event of an uncontrolled accidental release of a hazardous chemical.   The emergency response team is trained to respond to chemical emergencies involving spills, fire, confined space rescue, etc. at the facility.  It is also KFI policy to contact the local emergency planning committee, and the local fire department in the event of a hazardous chemical release. KFI has coordinated with the local emergency planning committee on its emergency response plan, and in the unlikely event of an uncontrolled release, the local authorities will be notified by KFI and a joint decision will be made on whether local areas will be evacuated.  The local authorities will notify any affected neighbors or surrounding properties if an evacuation is necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\n\n\nKFI is committed to continuous efforts to improve the safe operation of the anhydrous ammonia process by implementing preventative maintenance programs, inspection programs, and employee training in the safe operation of the equipment and the system.  The anhydrous ammonia process is designed in accordance with good engineering practices.  Periodic auditing of the Process Safety Management Prevention Program ensures that any system changes or modifications are evaluated and necessary safety precautions and or safety improvements are made before the process is placed into operation.\n\n\n\nEXECUTIVE SUMMARY - CONTINUED"
    }
  ]
}