{
  "FacilityID": 1000018017,
  "FacilityName": "Marietta Plant",
  "FacilityStr1": "1525 Church Street Extension",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "GA",
  "FacilityZipCode": "30060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13067",
  "LEPC": "Cobb County Resource Council",
  "FacilityLatDecDegs": "33.977973",
  "FacilityLongDecDegs": "-084.558388",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.kemira.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 86961729,
  "ParentCompanyName": "Kemira Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33870585,
  "Company2DUNS": 33870585,
  "OperatorName": "Kemira Chemicals, Inc.",
  "OperatorStr1": "1000 Parkwood Circle",
  "OperatorStr2": "Suite 500",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30339",
  "OperatorZipCodeExt": null,
  "FTE": 66,
  "OtherEPAFacilityID": "GAD003268885",
  "EPAFacilityID": "100000051392",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-15 00:00:00",
  "SafetyInspectionBy": "PHMSA - US Dept Trans. Pipeline & HAZMAT Safety",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-10-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-11-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-11-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-11-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.977973,
  "FRS_Long": -84.558388,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000022086,
      "AltID": "Ammonia Neutralized",
      "FacilityID": 1000018017,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000026109,
          "ProcessID": 1000022086,
          "ChemicalID": 57,
          "Quantity": 74753.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000022387,
          "ProcessID": 1000022086,
          "NAICSCode": "32519",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000018597,
              "Process_NAICS_ID": 1000022387,
              "SafetyReviewDate": "2010-07-16 00:00:00",
              "PHA_Date": "2011-05-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-07-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Foam Suppression System",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable Multi-Gas Detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-12-05 00:00:00",
              "TrainingReviewDate": "2010-05-31 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Circulation of documentation",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-07-20 00:00:00",
              "EquipmentInspectionDate": "2009-05-21 00:00:00",
              "EquipmentTested": "Aqua Ammonia Storage Tank 1C119",
              "ChangeMgmtDate": "2010-10-30 00:00:00",
              "ChangeMgmtReviewDate": "2010-09-02 00:00:00",
              "PreStartupReviewDate": "2009-05-21 00:00:00",
              "ComplianceAuditDate": "2010-03-26 00:00:00",
              "AuditCompletionDate": "2010-11-02 00:00:00",
              "IncidentInvestigationDate": "2010-10-26 00:00:00",
              "InvestigationChangeDate": "2010-10-26 00:00:00",
              "ParticipationPlansReviewDate": "2010-09-02 00:00:00",
              "HotWorkPermitReviewDate": "2009-03-31 00:00:00",
              "ContractorSafetyReviewDate": "2010-10-11 00:00:00",
              "ContractorSafetyEvalDate": "2010-06-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000022021,
                  "PreventionProgram3ID": 1000018597,
                  "ProcessChemicalID": 1000026109
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000018017,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-10-29 00:00:00",
    "ERTrainingDate": "2010-10-12 00:00:00",
    "CoordinatingAgencyName": "Cobb County Fire & Emergency Servic",
    "CoordinatingAgencyPhone": "7705288000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018017,
      "SummaryText": "Kemira Chemicals, Inc. RMP Submission - 2012 Update\r\nMarietta Plant \r\n\r\nExecutive Summary \r\n\r\nKemira Chemicals, Inc. is a chemical manufacturing company with headquarters based in Atlanta, GA.  We produce products for several diverse industries, including the paper manufacturing, mining, textile sizing, paint manufacturing, water treatment, oil and gas industries, and agricultural pest control.\r\n\r\nThe portion of the plant that is covered by Risk Management makes acrylic polymers that are sold to companies in the above markets.  The polymer production facility has been in operation for 36 years, utilizing process control instrumentation as well as emissions control units including various packed scrubbers, a thermal oxidation unit and an onsite wastewater pretreatment plant.\r\n\r\nOSHA regulations (Process Safety Management) for several years have required that multiple Layers of Protection be included during design, before startup and to continue through operations and training of all employees.  These Layers of Protection are maintained today as part of our Risk Management Programs.   The polymer plant currently uses one raw material that is covered under Risk Management: ammonia solution.  \r\n\r\nAmmonium Hydroxide Solution:\r\nColorless liquid with a pungent, ammonia odor\r\nLiquid ammonium hydroxide is lighter than water\r\nAmmonia vapor is lighter than air\r\nContact with the eyes can result in severe irritation or blindness\r\nContact with the skin can cause burns or blistering\r\nInhalation of high concentrations can cause respiratory distress\r\n\r\nAs part of Kemira's stewardship and safety programs, we recognize the hazards of handling and processing ammonia.  The design of our ammonia storage and handling systems takes all of the hazards of each material into consideration.  Materials handling, from unloading through process vessels are in closed venting systems or when venting is required, is routed through scrubbers designed to minimize emissions to the atmosphere.  We recei"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018017,
      "SummaryText": "ve tank truck shipments of refrigerated ammonium hydroxide solution.  Our storage tank is insulated and temperature controlled.\r\n\r\nThe polymer reaction systems (as well as loading and unloading systems) are monitored by computers and by trainer operators.  Interlocks in the computer logic, for example, are designed to prevent a storage tank from being overfilled.  Operator double-checks are in place to assure all valves are in the proper position and that all safety observations and checks are properly completed.\r\n\r\nAll material transfers are through closed systems.  Vapor return lines are used in most unloading procedures to return the displaced vapor to the delivery vehicle.  Additionally, all reaction vessels use a series scrubber unit complete with a hydrocarbon analyzer to measure the VOC output on a continuous basis.  Vent lines to the monomer storage tanks and monomer feed tanks are hard piped to the scrubber, after which residual vapors pass through the thermal oxidation unit.\r\n\r\nOffsite Consequence Analysis:\r\nWorst Case Scenario - Toxic Chemical Analysis of our processes showed the Worst Case Scenario to be the sudden and complete loss of a truck of ammonia solution.  The only safety precautions that Risk Management allows to be considered in the Worst Case Scenario are passive mitigation devices.  In our case, the ammonia storage tank is surrounded by concrete dike containment, however the truck sits in a separate contained are outside of the tank dike.  The contents of a ruptured or leaking truck would empty into the contained unloading pad, which would drain into sumps and eventually a containment pond.  This routing would limit the surface area from which ammonia could evaporate.  Based on EPA's Offsite Guidance, we estimate evaporated ammonia would travel approximately 0.2 miles.  This distance is based on the assumption of urban terrain.  Within the affected area, a population of only 4 (based on Landview Census 2000 Population Estimator) would potent"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018017,
      "SummaryText": "ially be affected, which includes primarily commercial and industrial facilities.  There could potentially be a higher number of people affected during business hours or passing through the area on local roads.\r\n\r\nAlternative Scenarios:  While the alternative scenario is still unlikely to occur, it is more likely to happen than the Worst Case Scenario discussed above.  In the Alternative Case Scenario for ammonia solution, EPA's Offsite Guidance allows us to presume our Layers of Protection, our safety processes, our safety programs, our safety equipment, and our people will be available for response.  While this scenario is more likely to happen than the Worst Case and is the scenario used for Emergency Planning, our safety systems are designed to prevent them from happening.\r\n\r\nAlternative Case Scenario - Analysis of our systems indicate that the most likely toxic scenario would be a liquid release from an open 3/4 vent, a drain valve, or a small rupture in transfer piping, or a failed gasket at the storage tank.   A release of this magnitude, occurring in such a manner would be contained within the tank's diked area.  Mitigation systems include a concrete containment dike.  A sprinkler system, a deluge system, water curtain, and foam suppression exist as emergency shutdown systems.  These mitigation systems are not used (except for the containment dike) in calculating the endpoint because it is assumed the event would go unnoticed, although this is unlikely for the time duration of the event.  Using EPA's Offsite Guidance, we estimate the ammonia vapor would travel 0.1 miles before the concentration dispersed to a level considered by EPA to be non-hazardous.  Within this area, a population of 4 would potentially be affected, including primarily commercial and industrial facilities.  Again, a higher number of people could be affected during business hours as noted in the Worst Case Scenario discussion.\r\n\r\nScenarios with Flammables:  We have materials at the Marie"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018017,
      "SummaryText": "tta facility that are flammable.  These other flammable materials, however, are not regulated under RMP.  Regardless, we have systems in place for these flammable materials that are designed to prevent accidents and to respond to accidents if they occur.\r\n\r\nThe polymer plant at Marietta is designed to prevent releases and to minimize hazards from flammable materials.  Where flammable materials are stored or processed, inert (gas) padding systems are employed to minimize the potential for fires or explosions.  In addition, vessels and piping are grounded to minimize static or electrical ignition such as from lightning strikes.  \r\n\r\nIn the event of a fire on the plant site, our emergency response teams are trained to evaluate the magnitude of the fire and if it is within their capability, to fight it until outside assistance arrives.  Our fire fighting systems include a four team incipient Fire Brigade with a plant-wide response time of less than three minutes, 24 hours per day, seven days per week.  Capabilities include water supply from two different headers coming into the plant and two auxiliary pumping systems; both with internal emergency power.\r\n\r\nAccident History:  In the past five years, this facility has had no incidents with RMP regulated materials causing an offsite consequence.  We have experienced occasions when citizens have reported objectionable odors coming from the Marietta plant.  There have been no reported offsite consequences.  Regardless, we have an obligation to determine the source(s) of these odors and to take actions to prevent a recurrence.  In each instance of an odor complaint, we have investigated the cause and as applicable, corrected the problem and/or taken actions to prevent a recurrence.\r\n\r\n\r\nGoals:  The goal at Kemira is to produce quality products and to produce them safely.  We have systems in place that are designed to prevent accidents to safeguard our employees, our community, and our environment.  Following is a partial list"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018017,
      "SummaryText": "ing of the Layers of Protection that we employ in our everyday activities.\r\n\r\nDesign: Since the inception of OSHA's Process Safety Management requirements, we used best engineering practices to assure our systems would operate as intended.  All changes or additions to the processes undergo a formal review and approval procedure.  This triggers hazard analysis and design safety reviews as necessary.  We have concrete dikes to catch any spilled materials.\r\n\r\nAll of our valve systems are designed to fail in safe positions.  This means that in the event of a computer failure or loss of electrical or air power, valves will return open or closed as necessary to the safe position.  In addition, we have both backup battery systems for computers and an auxiliary generator in case of power failure.\r\n\r\nOn a regular schedule, we are required to complete a comprehensive review of the hazards and operability of our entire production system.  If we find a valve, pipe, tank, or pump that might fail and allow a release or an incident, we will correct it immediately.\r\n\r\nMaintenance:  We have formal mechanical integrity and preventative maintenance programs in place.  Tanks and piping undergo thickness testing for assessing life and to determined needs for repair or replacement before failure.  Our operators will recheck equipment before operating it, after maintenance has been performed on it.  Using a combination of safety and quality programs, all of our instruments are calibrated and our storage and transfer systems are tested on a regular basis.\r\n\r\nSafe Operations:  Our employees are essential to the safe operation of our plant.  Their training, their experience, their observations, and their knowledge of how to respond to situations is the basis of safe operations.  These people apply their knowledge and training in their everyday actions.  All activities in the polymer plant - from unloading railcars to filling trucks with finished product - are restricted to trained, designa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000018017,
      "SummaryText": "ted employees.\r\n\r\nActivities in the polymer plant are computer aided.  This means that some actions taken by an operator are checked against an internal list in the computer's memory as well as with remote sensors to make sure it is the correct action.  On plant operations designated as having high risk potential, we have systems designed to automatically manage emergency interlocks that will shut down selected transfers to some vessels, shut down pumps, or automatically cool vessels.\r\n\r\nThe equipment and systems that contain these materials are closed; that is, the materials are contained in equipment that is designed to prevent materials from reaching the atmosphere or environment.  This extends from the time we unload a railcar of raw materials until we move them through storage tanks to the processing vessels.\r\n\r\nAuditing:  Kemira's Quality System at Marietta is certified according to ISO9001 standards.  While directed at quality, the training and documentation requirements of ISO guidelines are quite similar to those for OSHA and EPA under Process Safety Management and Risk Management.\r\n\r\nIn addition to the audits required by all three of these guidelines, we are regularly visited, inspected and/or audited by regulatory agencies.\r\n\r\nEmergency Response:  Our operators are trained to identify unusual occurrences.  We have Emergency Response Teams in place at the Marietta plant.  These individuals undergo significantly more training than do operators; have cell phone/two-way radio capabilities and a designated and fully equipped Emergency Operations Center from which to operate.\r\n\r\nIn the event of an incident on the plant site, our Emergency Response Plan tells us to take the following actions: An alarm system will notify all employees that an event has occurred.  Monitors include automatic detectors, computer systems, and visual inspection by our operators.\r\nThe Emergency Response Team will assess the magnitude of the incident and determine if it is within our co"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000018017,
      "SummaryText": "ntrol.  If the incident is within plant control a response plan will be developed.  If not, the Emergency Response Team will Shelter in Place with the plant population.  Operators will shut down transfer systems as they evacuate the operating portions of our plant.  All employees will Shelter in Place in one of two office areas on the site.  Designated employees will call for fire and emergency services via 911.  We will summon our emergency response contractors and will advise emergency responders of the known hazards and follow their guidance.\r\n\r\nTraining and Preparation:  Certainly all of us want to do everything we can to protect the health and well being of our employees and our community.  We have our Layers of Protection in the plant; we use training exercises to further protect our employees and to reduce the impact of any releases on our neighbors.\r\n\r\nTraining is extended to include local Fire and Emergency Services groups that may service our plant.  Through these training exercises, we are developing and maintaining partnerships.  These partnerships allow us to gain confidence in each other's knowledge and abilities to deal appropriately with incidents.  Shared roles in incident response are intended to assure the public, and ourselves, that we can and will react properly and promptly when necessary.\r\n\r\nKemira Chemicals, Inc. is an active current member of the Cobb County Resource Council, a partnership of government and industry designed to share information, technology, equipment, and resources in the event of an incident."
    }
  ]
}