{
  "FacilityID": 1000044849,
  "FacilityName": "Excelda Manufacturing Warehouse",
  "FacilityStr1": "12389 Emerson Dr",
  "FacilityStr2": null,
  "FacilityCity": "Brighton",
  "FacilityState": "MI",
  "FacilityZipCode": "48116",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26093",
  "LEPC": "Livingston County LEPC",
  "FacilityLatDecDegs": "42.504167",
  "FacilityLongDecDegs": "-083.691389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5320007,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Excelda Manufacturing",
  "OperatorStr1": "12389 Emerson Dr",
  "OperatorStr2": null,
  "OperatorCity": "Brighton",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48116",
  "OperatorZipCodeExt": null,
  "RMPContact": "George Sode",
  "RMPTitle": "Regulatory Affairs Coordinator",
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120852",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-10-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2019-06-03 00:00:00",
  "AnniversaryDate": "2019-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 42.50288,
  "FRS_Long": -83.69017,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055511,
      "AltID": "Flammable Gas Mixture",
      "FacilityID": 1000044849,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056413,
          "ProcessID": 1000055511,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        },
        {
          "Process_NAICS_ID": 1000056414,
          "ProcessID": 1000055511,
          "NAICSCode": "42472",
          "_desc": {
            "NAICS_CODE": "42472",
            "NAICS_DESCRIPTION": "Petroleum and Petroleum Products Merchant Wholesalers (except Bulk Stations and Terminals)"
          }
        },
        {
          "Process_NAICS_ID": 1000056415,
          "ProcessID": 1000055511,
          "NAICSCode": "42495",
          "_desc": {
            "NAICS_CODE": "42495",
            "NAICS_DESCRIPTION": "Paint, Varnish, and Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067666,
          "ProcessID": 1000055511,
          "ChemicalID": 155,
          "Quantity": 800000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000057644,
              "ProcessChemicalID": 1000067666,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000057645,
              "ProcessChemicalID": 1000067666,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000567666,
          "ProcessID": 1000055511,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044849,
      "SummaryText": "Accidental release prevention and emergency response policies:\n\n\n\nOur accidental releases prevention policy is to evaluate conditions at the facility, implement reasonable improvements to mitigate risks, and train associates in procedures developed to minimize and manage the risk of accidental releases due to their assigned job duties.\n\n\n\nOur emergency response policy is to evaluate the emergency, respond to minor situations internally, and to rely on structural features and our local emergency responders for all other situations.\n\n\n\nBusiness Overview of the stationary source and regulated substances handled\n\n\n\nThe facility is a warehousing operation.  The bulk of the operation is the movement of packaged goods from trucks, to racking and floor storage, and back to trucks.  Additional activities include the ?building of mixed pallets? and the processing of single case shipments.  No repackaging is done, except for the processing of damaged/returned materials.  Repackaging is limited to the boxing/re-boxing of containers and the transference of liquids from damaged containers to secure containers.\n\n\n\nThere is only one process at the facility that involves amounts approaching, or exceeding, the threshold levels listed in 40 CFR 68.  This process is the storage of aerosol cans in the facility's \"aerosol room\".  The regulated substance(s) in this process is a flammable mixture containing both propane, isobutane and other liquid chemicals.  This mixture is present as it is used as the propellant in a number of the aerosol products stored at the facility.  These products are typically brake parts and specialty cleaners, lubricating oils, paints, and polishes.  These products packaged in consumer  cans ranging from 4 oz to 20 oz and are packed in DOT 2P and/or 2Q cans and are packed 6 or 12 cans per shipping case.  As a result of this packaging, the distance to the endpoint of a release from the largest single container is less than 0.01 miles (53 ft).  This means that all"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044849,
      "SummaryText": " release are expected to reach their endpoints prior to being released from the building proper and well before the property lines of the facility parcel so there are no expected public receptors to our operations regulated under this RMP.  However, public receptors are considered as part of our overall Environmental Management System.\n\n\n\nBased on the nature of warehousing, the actual volume at the facility may be either greater than, or less than, the threshold level on any given day.  Based on a worst case scenario, the maximum that can be stored on site is 801,000 lbs total product (propane, isobutane, liquid components) with the flammable gases expected to be approximately 120,000 lbs based on a 15% fill rate.  In reality the amount of regulated flammable gases is much less as there are other propellants used in the products stored including carbon dioxide and compressed air.  Also, our normal storage is less than 50% of our maximum capacity.\n\n\n\nWhile our aerosol products are located outside of the aerosol room, this storage is in accordance with NFPA standards for general warehouse storage and are designed to support small order processing and typically only involve 1 to 2 pallets (2,000 to 4,000 lbs of aerosols) and are well below the threshold for a covered process.\n\n\n\nThe covered process \"storage of aerosol cans in the aerosol room\" takes place in a specially designed portion of the facility that was  built to NFPA standards for aerosol warehousing.  Among the features built into this room are the presence of \"blast walls\" to separate it from the main warehousing areas, fire doors that automatically close in the event of a major fire (or extreme heat); extra sprinkler system capacity.  In addition to the sprinkler system there is an adjacent retention pond equipped with a \"dry hydrant\" to provide a ready source of water in the event of a fire.\n\n\n\n\n\nGeneral accidental release prevention program and chemical-specific prevention steps\n\n\n\nPursuant to our acciden"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044849,
      "SummaryText": "tal release prevention policy, there are two major components to our accidental release prevention program.\n\n\n\n  I.  Evaluation of Conditions of the Facility and Implementation of Improvements\n\n\n\nThe facility is evaluated by several different groups within the company, each of which is charged with making recommendations for improvement to the Executive Committee(EC) which determines the reasonableness and feasibility of the recommendation and acts upon them accordingly. \n\n \n\nThe first group is the Steering-Safety Team (SST).  The primary focus of this group is the safety of associates and the safety of our facility.  Members of the SST participate in formal monthly safety walks which are conducted to identify any conditions that might result in a release such as \"buckling uprights\", \"broken pallets on top racks\", as well as to identify any possible improvements in the storage of the substance or the infrastructure of the storage locations.  In addition, the SST receives suggestions from associates which may also pertain to the storage and/or handling of the regulated substance.  \n\n\n\nThe second group is the Environmental Management System Team.  The primary focus of this group is minimizing the adverse environmental impacts of operations including how to prevent releases of materials.  This group conducts periodic walk-throughs as part of our ISO 14001 Environmental Management System to identify any conditions that fails to comply with applicable regulations and/or adopted industrial standards.\n\n\n\nThe third group is the Safety Coordinator & Facility Services Manager.  The primary focus of this group is to coordinate with the local fire department.  This group receives the results of the annual fire department inspections that are conducted by the Green Oak Fire Department as well as the results of the annual inspections of our fire alarm system, sprinkler system and pumps.  While these results are typically reported to the SST, this group may contact the EC directly"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044849,
      "SummaryText": ".\n\n\n\nThe final group is the Executive Committee which directly receives the results of the periodic inspections that are conducted by our insurance carrier.\n\n\n\nResults of this evaluation process have included such previous implementation activities as:\n\n\n\n1.  The addition of strobe lighting and additional alarms to assist in evacuations.\n\n2.  The use of safety screens on high level racks containing unwrapped pallets to prevent cases from falling from heights\n\n3.  The bracing of back-to-back free standing racking to keep racks from shifting so that racked pallets are not pushed off when a pallet is being added to the rack behind it\n\n4.  The setting of  the \"aerosol room\" as an off-limits location to all powered equipment except for properly rated electrical equipment unless a special permit has been issued for a specific task, similar to a hot work permit\n\n\n\n II.  Associate Training\n\n\n\nAccidental release prevention training is conducted both on a general company-wide basis as well as on a job specific basis.\n\n\n\nGeneral company-wide training consists of training for every associate at the facility including those who are not expected to come in contact with the regulated substance on a regular basis.  This training includes:\n\n1.  How to conduct a safety walk\n\n2.  Implications of violating the Facility-wide No Smoking policy\n\n3.  Our OSHA Hazardous Communications Program\n\n\n\nJob specific training consists of specialized training for associates who are expected to come in daily contact with the regulated substance.  This training includes:\n\n \n\n1.  US DOT Hazardous materials training\n\n2.  OSHA Industrial Truck rules and regulations\n\n3.  In-house material handling and transport\n\n4.  SOPs related to the storage of materials, response to spills, fires and severe weather, and general safety\n\n\n\nFive-year accident history\n\n\n\nThere have been no accidental releases of the regulated substance in the past five years that have resulted in any injury to an individual, or damages to p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044849,
      "SummaryText": "roperties. \n\n\n\nEmergency response program\n\n\n\nThe facility is not covered by either OSHA PMS rules, or EPA SPCC rules.  For this reason we have implemented a number of situation specific response procedures which govern the emergency response for each foreseeable emergency.  These emergencies include fire, material releases, and severe weather.  Training in these procedures is company-wide and is both instructional (classroom based) and practical (drill based).\n\n\n\nFire\n\n\n\nIn the event of a fire involving or threatening to involve the regulated substance, the discovering associate determines if the fire is a small fire, or a large fire.  If the associate determines it is a small fire, the associate responds by utilizing the appropriate fire extinguisher to put out the fire.  If the associate determines it is a large fire, the associate implements our evacuation procedure and the local fire department is contacted.\n\n\n\nTraining associated with this emergency includes:\n\n1.  Fire /risk evaluation\n\n2.  Evacuation procedures and routes of egress\n\n3.  Fire extinguisher type, application and use\n\n\n\nMaterial Release\n\n\n\nIn the event of a release of the regulated substance the discovering associate determines if the release is a minor or a major release.  If the associate determines it is a ?minor? release, the immediate area of the release is evacuated and ventilated.   Following ventilation, associates perform clean-up activities while wearing appropriate safety equipment.  If the associate determines it is a major release, or that it appears that a major release is imminent the facility is evacuated and the local fire department is contacted.  It should be noted that the full release from a single container of the regulated substance would be considered a minor release, and any major release involving the regulated substance would require the release of the substance from a number of containers and may be expect to occur in the event of either a fire or a result of severe wea"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000044849,
      "SummaryText": "ther.\n\n\n\nTraining associated with this emergency includes:\n\n1.  Release /risk evaluation\n\n2.  Evacuation procedures and routes of egress\n\n3.  Spill Clean-Up methods\n\n\n\nSevere Weather\n\n\n\nIn the event of severe weather, associate relocate to designated areas to wait out the severe weather conditions.  If the severe weather does not damage the facility, associates return to activities following notice that the severe weather has passed.  If the severe weather damages the facility, associates evacuate the facility upon notice that the severe weather has passed, and the local fire department is contacted.\n\n\n\nTraining associated with this emergency includes:\n\n1.  Severe weather response monitoring\n\n2.  Location of designated shelter areas\n\n3.  Evacuation procedures and routes of egress\n\n\n\nAs the local fire department is a integral part of our emergency response procedures we work in conjunction with both Green Oak Township Fire Department and the Livingston County LEPC to ensure that responders have the information and equipment to provide the services we may require of them.  Information concerning the facility is provided to the LEPC and fire department by the Regulatory Affairs Coordinator through our annual submissions of Tier II reports as well as the completion of periodic fire department surveys.\n\n\n\nPlanned changes to improve safety\n\n\n\nAt this time there are no changes under consideration for safety improvement and there are no outstanding recommendations that have not been resolved."
    }
  ]
}