{
  "FacilityID": 1000046423,
  "FacilityName": "Flexitank Depot",
  "FacilityStr1": "Building 1026 Street #28",
  "FacilityStr2": "Zona Portuaria Puerto Nuevo",
  "FacilityCity": "San Juan",
  "FacilityState": "PR",
  "FacilityZipCode": "00920",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72127",
  "LEPC": null,
  "FacilityLatDecDegs": "18.426242",
  "FacilityLongDecDegs": "-66.101998",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.flexitank.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Flexitank, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Flexitank, Inc",
  "OperatorStr1": "Metro Office Park",
  "OperatorStr2": "Street 1 Lot 5",
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00968",
  "OperatorZipCodeExt": null,
  "RMPContact": "Yarileen Valiente",
  "RMPTitle": "Operations Director",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000220851",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-07-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "30.9",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000057810,
      "AltID": "Storage of Ammonia",
      "FacilityID": 1000046423,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058734,
          "ProcessID": 1000057810,
          "NAICSCode": "48422",
          "_desc": {
            "NAICS_CODE": "48422",
            "NAICS_DESCRIPTION": "Specialized Freight (except Used Goods) Trucking, Local"
          }
        },
        {
          "Process_NAICS_ID": 1000059211,
          "ProcessID": 1000057810,
          "NAICSCode": "48849",
          "_desc": {
            "NAICS_CODE": "48849",
            "NAICS_DESCRIPTION": "Other Support Activities for Road Transportation"
          }
        },
        {
          "Process_NAICS_ID": 1000059212,
          "ProcessID": 1000057810,
          "NAICSCode": "48851",
          "_desc": {
            "NAICS_CODE": "48851",
            "NAICS_DESCRIPTION": "Freight Transportation Arrangement"
          }
        },
        {
          "Process_NAICS_ID": 1000059216,
          "ProcessID": 1000057810,
          "NAICSCode": "49319",
          "_desc": {
            "NAICS_CODE": "49319",
            "NAICS_DESCRIPTION": "Other Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070574,
          "ProcessID": 1000057810,
          "ChemicalID": 56,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570574,
          "ProcessID": 1000057810,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046423,
      "SummaryText": "Executive Summary\n\nEPA Risk Management Program Executive Summary\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nFlexitank, Inc. is a privately held, logistics company located in Guaynabo, Puerto Rico we are committed to operating and maintaining all of our processes related to bulk chemical transportation and storage in a safe and responsible manner. Flexitank complies with applicable federal, state and local regulations. All Flexitank employees are informed of hazards in the workplace and are trained accordingly. Flexitank has procedures in place in the facility, in the unlikely event that hazardous substance releases were to occur, which activates emergency notification and response procedures to ensure the safety of our employees, the community, the environment and property.\n\n\n\n2. Facility and Regulated Substances\n\n\n\nFlexitank is an NVOCC (OTI) that specializes in logistics management. We occasionally store ISO-tanks containing chemical products for our customers as an \"added value\" service in our Depot Facilities located on the Zona Portuaria in San Juan.  \n\nFlexitank Depot receives the bulk liquid cargo by the following modes of transportation: tank trucks, ISO tank containers and flexi-bags (no hazardous products only). The received cargo is stored on-site according to customer-specified requirements, and it is subsequently dispatch on the same transportation modes as originally received. Flexitank, Inc. does not perform any chemical processing, manufacturing nor does product is transferred to intermediate storage containers. \n\n\n\nThe following Regulated Toxic Substances are occasionally stored at Flexitank, Depot facilities and have been identified by the EPA as having the potential to cause significant consequences in the event of a substantial accidental release: \n\n\n\nAnhydrous Ammonia (CAS Number 7664-41-7)\n\n\n\nOur Standard Operating Procedures (SOP) which includes, but are not limited to; Emergency response and contingency plans and t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046423,
      "SummaryText": "raining programs, in combination with our \"on-site\" emergency response HAZMAT team help us effectively manage and minimized the potential hazards posed to our employees, the community, and the environment. \n\n3. Worst-Case and Alternate-Case Release Scenarios\n\n\n\nPlease reference onsite data (Risk Management Plan) at Flexitank's facility.\n\n\n\n4. General Accidental Release Prevention Program and Ammonia Specific Prevention\n\n\n\nFlexitank, Inc. is process of reaching compliance for program 3 of the RMP and OSHA Process Safety Management for Highly Hazardous Chemicals (PSM) standard relative to anhydrous ammonia. Therefore, this facility has programs to ensure proper operation and maintenance of the ammonia ISO-tanks. ISO-tanks are considered portable tanks; they are designed and constructed using IMO and CFR 49 172.101 \"T\"- codes to conform to industry standards. Regulatory inspections of these tanks are performed accordingly, and a \"per trip\" preventive maintenance program is in place to ensure ongoing system integrity and to minimize release incidents. All employees associated with this facility operation have been trained and are knowledgeable in the safe operation of ISO tanks and emergency response procedures in case of a release. \n\n\n\n5. Five Year Accident History\n\nDuring the past five (5) years there have been no accidental releases from RMP covered processes at the Flexitank Depot or off site which resulted in death, injuries, or significant property or environmental damages.\n\n\n\nAll incidents and releases, on site or off site, are formally investigated as part of our facility's QHSSE program to identify corrective and preventive actions for continuous process improvement.\n\n6. Emergency Response Program\n\n\n\nFlexitank maintains an excellent relationship with the local authorities. In the event of an emergency, Flexitank will initiate an evacuation of the facility and notify the proper authorities. Employees are trained to evacuate their respective areas in accordance w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046423,
      "SummaryText": "ith OSHA 1910.38(a). Flexitank's Process Safety Management (PSM) program is in process of been review to reach compliance of Program # by December 31, 2014 and it follows the requirements set forth in 29 CFR 1910.119; it also complies with federal, state, and local regulatory requirements; it includes, but it is not limited to the following:\n\n1)    Prevention & Contingency (SOP GI15) and Emergency Response Plans (SOP GI10); which provides guidelines for responding to various emergencies such as fires, hazardous material spills, personal injuries, severe weather events, and property damage that may occur at the Flexitank Depot and headquarters facilities; \n\n2)    Employees participate (SOP QMD07), at least once a year, on safety and release prevention program; it provides the essential planning and training for effectively protecting our employees, the company, the environment, and the property; before, during and after an emergency situation; \n\n3)    Training (SOP AD15), is provided for all operations personnel such as: drivers, operators, maintenance, equipment control, general operations and customer service personnel; \n\n4)    Our emergency response program (ERT) (SOP GI10); includes Spill Containment and an  \"in-house\" emergency response HAZMAT team (SOP QMD08) and is supported by local Incident and Emergency Response Contractors;\n\n5)    Process Safety Information (SOP GI20) is maintained on ammonia and other hazardous materials;\n\n6)    A Hazard Risk Assessment (SOP GI21)  is conducted periodically to ensure adequacy of controls, and processes; \n\n7)    The Preventive maintenance program (SOP OP09) ensures the mechanical integrity of the equipment and its pressure relief and vapor control systems continue to operate as designed; \n\n8)    Operating SOP's (OP02) provides all personnel with the information necessary to safely transport and store equipment;\n\n9)    Contractors or visitors working on our Depot facility require a work permit (SOP OD19) provided by the QHSSE team. As part of the SOP"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046423,
      "SummaryText": ", all visitors are briefed on the hazards and safety requirements of the job; and are trained to respond in case of release (Safety Briefing SOP GI-05);\n\n10)    Hot Work Permits (SOP OD17) are required whenever welding, cutting, grinding or other activities are conducted that could generate sparks and start a fire;\n\n11)    Formal Incident investigations (SOP GI29) are conducted for incidents involving any and all releases and near misses that endanger employees or the public; \n\n12)    Compliance Audits (SOP QMD03) are conducted periodically to ensure that the prevention program is meeting its objectives; \n\n13)    QHSSE -  Management System (PL-041) is in place as Flexitank Quality Policy;\n\n14)    Management of Change (MOC) under SOP AD32 is in place to ensure project success, avoid loss of employees or customer's due to changes and minimize the impact on productivity\n\n15)    Pre-TRIP Safety Review (PTSR) are created \"custom made\" for ammonia  and other hazardous products or substances. (SOP OD03/0D09)\n\n16)    Departmental / Safety Meetings -QMD02 each department under must perform periodical safety meetings and report finding to the Safety Committee. \n\n17)    Facility Safety Committee is composed of the top managers of the company and meet periodically to discuss reports. (QMD04)\n\n"
    }
  ]
}