{
  "FacilityID": 1000050070,
  "FacilityName": "Trammo Terminal Meredosia, Inc.",
  "FacilityStr1": "1921 Old Naples Road",
  "FacilityStr2": null,
  "FacilityCity": "Meredosia",
  "FacilityState": "IL",
  "FacilityZipCode": "62665",
  "Facility4DigitZipExt": "7261",
  "FacilityCountyFIPS": "17137",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "39.804927",
  "FacilityLongDecDegs": "-90.56829",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "jflemm@lemmcorp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Trammo Terminal Meredosia, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lemm Corporation Operations",
  "OperatorStr1": "1280 Big Orange Road",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "Cordova",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38018",
  "OperatorZipCodeExt": null,
  "RMPContact": "Todd Clayton",
  "RMPTitle": "Facility Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057706",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-02-09 00:00:00",
  "SafetyInspectionBy": "Illinois Dept. of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-08-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-05-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-05-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.80639,
  "FRS_Long": -90.56611,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000062960,
      "AltID": "Ammonia Terminal",
      "FacilityID": 1000050070,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000064115,
          "ProcessID": 1000062960,
          "NAICSCode": "49319",
          "_desc": {
            "NAICS_CODE": "49319",
            "NAICS_DESCRIPTION": "Other Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000077751,
          "ProcessID": 1000062960,
          "ChemicalID": 56,
          "Quantity": 40000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000577751,
          "ProcessID": 1000062960,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050070,
      "SummaryText": "This document contains all required information in order to meet 40 CFR 68 \"Risk Management Program\". This document consists of the executive summary and registration data elements (68.155 through 68.185).\n\n\n\n1.0    RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nLemm Corporation Operations (Lemm) operates an ammonia terminal, Trammo Terminal Meredosia, Inc. located at 1921 Old Naples Road in Meredosia, Illinois.  The terminal stores anhydrous ammonia (ammonia) on site that requires protection as defined under the Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) regulation and the Risk Management Plan (RMP) Threshold Quantity of 10,000 pounds (lbs.).  Lemm has implemented a PSM program to provide information to employees to deal with the risks involved with the storage, handling and processing of highly hazardous materials.  The program emphasizes the application of management controls and standard operating procedures when addressing the risks associated with handling or working near highly hazardous chemicals.  Lemm has also implemented a RMP to document how a response to a release at Trammo Terminal Meredosia, Inc. is conducted and the information to be provided to the emergency response agencies.  This submittal is the update to reflect change of ownership from Agrium U.S., Inc. by Trammo Terminal Meredosia, Inc.\n\n\n\nThe facility has implemented an Emergency Response Program to ensure the safety of its employees, the community, and the environment. This detailed emergency response program includes procedures for handling an emergency.   All of these components make the Emergency Action Plan a thorough and comprehensive plan for release prevention and emergency response. The emergency response policies at Trammo Terminal Meredosia, Inc. ensure that there is emergency response coverage 24 hours - 7 days per week. \n\n\n\nIn accordance with the 2004 amendment to the RMP regulations, the off-site consequence analyses (OCA) are not inc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050070,
      "SummaryText": "luded in this executive summary.\n\n\n\n2.0    PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\n\n\nThe terminal is designed to receive agricultural grade ammonia by barge and stores it at -28 ?F.  It is also designed to transfer ammonia by truck, pipeline, or barge.\n\n  \n\nThe ammonia stored is used primarily as an agricultural nitrogen fertilizer.  Ammonia is received by refrigerated barge through a pipeline from a river port dock to the terminal and may be received by pressurized truck containers.  \n\n\n\nThe maximum inventory of 18,000 tons is contained in one low temperature, low pressure storage tank.\n\n\n\n3.0    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL - SPECIFIC PREVENTION STEPS\n\n\n\nLemm Corporation Operations has developed an OSHA PSM program for Trammo Terminal Meredosia, Inc.  At Trammo Terminal Meredosia, Inc. ammonia falls under the RMP Program 3 Prevention Program, which is identical to the OSHA PSM program. EPA has said that if the process is in compliance with OSHA PSM, then it is compliance with RMP Program 3. Thus, the Trammo Terminal Meredosia, Inc. ammonia PSM has been reviewed and determined to be complete for the RMP document. \n\n\n\n4.0    FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThe Trammo Terminal Meredosia, Inc. facility has an excellent safety record with no deaths or serious injuries to facility personnel since it was constructed in 1964. There have not been any releases from the terminal that require reporting under the RMP five year accident history.  \n\n\n\nIn case of a reportable chemical accident, information in the RMP will be updated within six month of the date the accident occurred. \n\n\n\n5.0    EMERGENCY RESPONSE PLAN\n\n\n\nAs mentioned previously, the Trammo Terminal Meredosia, Inc. facility has developed an Emergency Action Plan. The response plan is a detailed document which discusses the role of employees and management in an emergency situation. The plan outlines specific procedures for evacuations for plant personnel. For all emergencies, the Terminal Sup"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050070,
      "SummaryText": "ervisor, has operating authority for emergency response at the site of release and assumes control of the incident scene beyond the first responder awareness level.\n\n\n\nThis document contains specific information regarding: contact numbers; emergency communication; incident team job descriptions; evacuation zones; emergency evacuation procedures; notification procedures; training; emergency shutdown procedures; personnel roles and lines of authority; emergency recognition and prevention; safe distances and places of refuge; site security and control; medical/first aid treatment; emergency alerting and response procedures; PPE and emergency equipment; and standard operating procedures in the event of an ammonia release.\n\n\n\n6.0    PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nDue to the Trammo Terminal Meredosia, Inc. exemplary safety record no changes to the existing safety plan have been identified.  \n\n"
    }
  ]
}