{
  "FacilityID": 1000077135,
  "FacilityName": "Lynn Water Treatment Plant",
  "FacilityStr1": "390 Parkland Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lynn",
  "FacilityState": "MA",
  "FacilityZipCode": "01905",
  "Facility4DigitZipExt": "1138",
  "FacilityCountyFIPS": "25009",
  "LEPC": "Mystic REPC",
  "FacilityLatDecDegs": "42.476944",
  "FacilityLongDecDegs": "-070.973056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lynnwatersewer.org",
  "FacilityEmailAddress": "rdawe@lynnwatersewer.org",
  "FacilityDUNS": 158642124,
  "ParentCompanyName": "Lynn Water and Sewer Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lynn Water and Sewer Commision",
  "OperatorStr1": "400 Parkland Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Lynn",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01905",
  "OperatorZipCodeExt": "1138",
  "RMPContact": "Richard Dawe",
  "RMPTitle": "Superintendent",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133045",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-11 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.47761,
  "FRS_Long": -70.97281,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095965,
      "AltID": "Disinfection",
      "FacilityID": 1000077135,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097249,
          "ProcessID": 1000095965,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120179,
          "ProcessID": 1000095965,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000620179,
          "ProcessID": 1000095965,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077135,
      "SummaryText": "Executive Summary:\n\n\n\n(a) The Accidental Release Prevention and Emergency Response Policy: It is the policy of the City of Lynn and the Lynn Water and Sewer Commission to operate the Lynn Water Treatment Plant safely, reducing to the greatest extent possible any hazards associated with the chlorine system and reducing any subsequent risk to the surrounding community, personnel, and environment.\n\n\n\nSafe operation depends on proper storage of chlorine, proper handling of the chlorination system, and inherent safety features in the design and operations of the chlorination system.\n\n\n\nSafety in storage and handling is achieved through the use of safe handling procedures and training of personnel.   The accidental release prevention and emergency response policy includes working with the surrounding community and local emergency response agencies to promote a spirit of cooperation and teamwork, to orchestrate an effective contingency plan in the unlikely event of a process incident occurring at the facility. The emergency response plan includes procedures for notifying the Lynn Fire Department, if necessary.\n\n\n\n(b) The Stationary Source and Substance Handled: The Lynn Water Treatment Plant is a stationary source operating for the purpose of treating surface water for use in households, businesses, and industries within the Lynn and surrounding communities.  Chlorine, which is a regulated, toxic substance, is used as part of the treatment process.\n\n\n\n(c) General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  The City of Lynn has implemented a comprehensive program to safely manage chlorine at the Lynn Water Treatment Plant located at 390 Parkland Avenue in Lynn, Massachusetts.\n\n\n\nThe Lynn Water Treatment Plant is a public utility, which is operated by a private contractor (Veolia).  Therefore, operations are subject to OSHA standards enforced through the federal Department of Labor.  There have been no accidents occurring within the last fi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077135,
      "SummaryText": "ve years at the facility and a worst-case release has the potential to affect an off-site public receptor.  Based on the Risk Management Program, Program Level applicability provisions, the covered process at the Lynn Water Treatment Plant meets the criteria of a Program Level 3 process.\n\n\n\nThe Lynn Water Treatment Plant has developed an accidental release prevention program and implemented chemical-specific prevention steps to manage the covered process.  The program includes both a documented compliance manual and administrative procedures to manage the program.  Specific elements of the program include, but are not limited to:\n\n\n\n- A documented management system\n\n- Completion of routine hazard assessments, including an offsite consequence analysis\n\n- Assembly and retention of chlorine safety information and other process safety information\n\n- A process hazard analysis program to evaluate the controls and safeguards of the process\n\n- Written standard operating procedures for chlorine management and operations\n\n- A written training program for the risk management program, inclusive of applicable operating, maintenance, and emergency response procedures\n\n- A chlorine system, mechanical integrity program\n\n- A management of change process to evaluate process changes\n\n- A pre-start-up safety review program to review applicable process changes\n\n- A system for routine compliance audits, inclusive of third-party audits, as applicable\n\n- A written incident investigation program\n\n- A written employee participation program to involve applicable employees in the program\n\n- A hot work permit program, inclusive of hot work permits\n\n- A contractor selection and evaluation program \n\n- A written emergency response program\n\n- A documented Risk Management Plan\n\n\n\nIn addition to the covered process, accidental release prevention program, the facility has an active safety program, involving all site personnel.  All employees have the authority to stop work if deemed unsafe and report "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077135,
      "SummaryText": "the unsafe condition to their Supervisor.\n\n\n\nNew employees receive facility-specific safety training.  Additionally, facility personnel receive ongoing safety training, including First-Aid/CPR, Hazardous Waste Operations and Emergency Response (HAZWOPER), and ongoing training to maintain professional certifications.\n\n\n\n(d) Five Year Accident History:  There have been no accidental releases meeting the definition contained in 40 CFR ?68.42(a) within the last five years of operation, or in the history of the plant.\n\n\n\n(e) The Emergency Response Program: The Lynn Water Treatment Plant has developed a comprehensive Emergency Response Plan. The plan addresses fires, explosions, spills or releases of hazardous chemicals (including chlorine), severe weather, and other potential emergency conditions. The plan details response actions by facility personnel for such emergencies, safety and emergency equipment, communication responsibilities, and coordination with off-site responders, as well as notification of local, state, and federal agencies.\n\n\n\nThe Emergency Response Plan includes emergency response to chlorine releases. Should an emergency release of chlorine occur at the facility, the facility will be evacuated, the Lynn Fire Department will be notified, and the Fire Department will assume Incident Command.\n\n\n\n(f) Planned Changes to Improve Safety: The Lynn Water Treatment Plant completed its most recent Process Hazard Analysis (PHA) in the first quarter of 2019. As a result of the PHA review, a number of improvements to the risk management program have either been completed or are planned.  The improvements are intended to improve the safety of the process and minimize the potential for a release.  Changes primarily include program changes (improved documentation), operating procedure or checklist updates, and employee training.\n\n\n\nRegistration:\n\n\n\nThis Risk Management Plan includes the required registration information referenced in 40 CFR ?68.160(b)(1) through (22) t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077135,
      "SummaryText": "o be reported for a Program 3 process.\n\n\n\nOffsite Consequence Analysis:\n\n\n\nAs a Program 3 covered process with a regulated toxic substance, an offsite consequence analysis has been performed for one worst-case release scenario and one alternative release scenario.  The required data from the offsite consequence analyses is contained within this Risk Management Plan.\n\n\n\nFive Year Accident History:\n\n\n\nThere have been no accidental releases meeting the definition contained in 40 CFR ?68.42(a) within the last five years of operation, or in the history of the plant.\n\n\n\nPrevention Program 3:\n\n\n\nThis Risk Management Plan includes the required information referenced in 40 CFR ?68.170(b) through (p) to be reported for a Program 3 process.\n\n\n\nEmergency Response Program:\n\n\n\nThis Risk Management Plan includes the required information referenced in 40 CFR ?68.180 to be reported for a Program 3 process.\n\n\n\nCertification:\n\n\n\nThis submittal includes the required certification that, to the best of the signer's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n"
    }
  ]
}