{
  "FacilityID": 1000056438,
  "FacilityName": "Clifton C. Williams Wastewater Treatment Facility",
  "FacilityStr1": "1600 Yend St",
  "FacilityStr2": null,
  "FacilityCity": "Mobile",
  "FacilityState": "AL",
  "FacilityZipCode": "36603",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.660200",
  "FacilityLongDecDegs": "-088.036900",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mawss.com",
  "FacilityEmailAddress": "dtillman@mawss.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Mobile Area Water and Sewer System",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mobile Area Water and Sewer System",
  "OperatorStr1": "4725 Moffett Road",
  "OperatorStr2": null,
  "OperatorCity": "Mobile",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36618",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107467",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-03-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-03-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-03-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-03-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.660391,
  "FRS_Long": -88.036898,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070466,
      "AltID": "Sewage Treatment Facility",
      "FacilityID": 1000056438,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087053,
          "ProcessID": 1000070466,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000087054,
          "ProcessID": 1000070466,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000071668,
          "ProcessID": 1000070466,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000044249,
              "Process_NAICS_ID": 1000071668,
              "SafetyReviewDate": "2016-01-28 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2016-03-03 00:00:00",
              "ChangeCompletionDate": "2016-03-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-01-28 00:00:00",
              "TrainingReviewDate": "2016-01-28 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-01-28 00:00:00",
              "EquipmentInspectionDate": "2016-01-28 00:00:00",
              "EquipmentTested": "Chlorinators, Sulfonators, Cl2/SO2 Detectors, Emergency Shut-off Valves, Scrubber System, General System Visual Inspection",
              "ComplianceAuditDate": "2016-03-28 00:00:00",
              "AuditCompletionDate": "2016-04-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000045035,
                  "PreventionProgram2ID": 1000044249,
                  "ProcessChemicalID": 1000087053
                },
                {
                  "PrimaryKey": 1000045036,
                  "PreventionProgram2ID": 1000044249,
                  "ProcessChemicalID": 1000087054
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000056438,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-01-28 00:00:00",
    "ERTrainingDate": "2016-01-29 00:00:00",
    "CoordinatingAgencyName": "Mobile Emergency Management",
    "CoordinatingAgencyPhone": "2514608000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056438,
      "SummaryText": "Introduction\r\n\r\nThe USEPA's RMP regulation, 40 CFR 68, was published in the Federal Register on June 20, 1996, and developed to assist facilities in preventing accidental release of highly toxic or flammable chemicals.  The RMP regulation applies to an owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process per 40 CFR 68.115.\r\n\r\nThe USEPA has established three (3) tiers of requirements to reduce the level of effort for facilities with a lower risk of offsite impacts.  These tiers are known as Programs 1, 2 and 3.  Program 1 is defined by a process that has had no accidental release causing offsite impacts in the past five (5) years or the nearest public receptor is beyond the distance to a toxic or flammable endpoint based on the worst-case release scenario.  Program 3 applies to a process that is subject to Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) or is not classified in any of the Program 3 NAICS codes defined in 40 CFR 68.10(d)(1).  Program 2 applies to processes not defined by Program 1 or 3.  Therefore, the C. C. Williams Wastewater Treatment Facility processes are subject to Program 2 requirements.\r\n\r\nThe Mobile Area Water and Sewer System (MAWSS) operates the C. C. Williams facility located at 1600 Yeend Street in Mobile, Alabama.  Chlorine is used as a disinfectant for treated surface water storing approximately fourteen (14) one-ton cylinders containing chlorine.  In addition to chlorine cylinders, there are six (6) one-ton cylinders of sulfur dioxide stored on-site.  Chlorine is used as a disinfectant in the treatment of wastewater and sulfur dioxide is used for the dechlorination of the wastewater effluent after chlorination and before discharge.  The C. C. Williams facility utilizes more than the threshold quantity of chlorine and sulfur dioxide as defined in 40 CFR 68.150; therefore, the facility is required to submit an RMP including both re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056438,
      "SummaryText": "gulated chemicals.  The initial RMP was submitted by June 21, 1999. A five (5) year update was made by Malcolm Pirnie in January 2005 updating the offsite consequence analyses determining whether the parameters and assumptions used are still valid. To comply with the five (5) year update requirement in 2010, Goodwyn, Mills and Cawood reviewed the offsite consequence analyses to determine whether the parameters assumptions used are still valid and to make any necessary changes to update the RMP. In 2016, Goodwyn, Mills and Cawood reviewed and updated the plan with the assistance of the C.C. Williams plant operators\r\n\r\n     68.155(a) Accidental Release and Emergency Response Policies\r\n\r\nThe C. C. Williams facility has established procedures to ensure the integrity of the chlorination and dechlorination systems, and minimize the potential for releases.  Standard protocols have been established for items such as systems operations, maintenance, training, and incident investigation.  To ensure the safety of the C. C. Williams facility chlorination, the facility relies on the commitment and team effort of its employees and suppliers.\r\n\r\nThe C. C. Williams facility has a minimum of two (2) and a maximum of thirty (30) employees on duty at any given time, which are trained on safe operation of the chlorination and dechlorination systems.  Daily inspections of the areas storing and/or using chlorine and sulfur dioxide are conducted by the facility employees.  The area that stores the containers is fully enclosed and is equipped with a caustic scrubber for control of a chlorine or sulfur dioxide release.  The caustic scrubber system is equipped with detectors that will automatically activate the scrubber system if a chlorine or sulfur dioxide concentration of three (3) parts per million or greater is present.  In addition, MAWSS has installed emergency chlorine and sulfur dioxide valve actuators, which will shut off flow from the ton containers within 30 seconds after detecti"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056438,
      "SummaryText": "ng a leak.  The system also contains an emergency \"panic button\" located outside of the storage area to allow for operator-initiated emergency shut-off.\r\n\r\nAll potential releases from the C. C. Williams facility will be responded to by the Mobile County Emergency Management Agency (MCEMA), whose members are aware of the presence of chlorine at the facility.  The MCEMA would dispatch experienced HAZMAT personnel trained to respond to such emergencies.\r\n\r\n     68.155(b) Stationary Source and Substance Handled\r\n\r\nThe C. C. Williams facility stores and handles chlorine and sulfur dioxide, and is a stationary source potentially subject to 40 CFR 68.  The facility has fourteen (14) one-ton chlorine cylinders and six (6) one-ton sulfur dioxide cylinders connected at all times.  A header pipe supplies chlorine to two locations: the chlorine dioxide generator and the plant filter flume.  Similarly, a header pipe supplies sulfur dioxide in one location: the effluent chlorination/dechlorination flume.  In addition to the four (4) sulfur dioxide cylinders and four (4) chlorine cylinders, up to two (2) additional sulfur dioxide cylinders and ten  (10) additional chlorine cylinders are stored inside the building that are either full waiting to be used or empty waiting to be shipped.  \r\nGaseous chlorine and/or sulfur dioxide is drawn by a vacuum though one of the two rotometers, which serve to feed chlorine at a specified rate to the ejector system.  The gaseous chlorine and sulfur dioxide is mixed with treated water.  The chlorine solution is injected into the water at the beginning of the chlorine contact chamber and the sulfur dioxide is injected at the end of the chlorine contact chamber. The water is then discharged into the Mobile Bay.\r\n\r\n     68.155(c) Worst-Case and Alternative Release Scenarios\r\n\r\nThe worst-case and alternative case release scenarios have been omitted intentionally for security concerns.  The EPA amended the RMP rule in 2004 to exclude a summary of the of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056438,
      "SummaryText": "f-site consequence analysis.\r\n\r\n      68.155(d) Accidental Release Prevention\r\n\r\nWorst-case and alternative case release scenarios were conducted as required for the Prevention Program 2 process.  Emergency response activities have been coordinated with local responders which are also required for the Prevention Program 2 process.  Lastly, a program and document management system is in place.  The Prevention Program 2 process allows streamlined prevention program requirements; however, implementation of the following elements are required: safety information, hazard review, operating procedures, training, maintenance, compliance audits and incident investigations. \r\n\r\nGoodwyn, Mills and Cawood, Inc., with the assistance of C. C. Williams facility management and staff, conducted a compliance audit and a hazard review of the chlorine system using the \"What-If\" analysis.  The results of the audit and hazard review identified recommended changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the chlorine system.  The results of the audit and the hazard review, in addition to recommendations made, are documented and are maintained as part of the RMP records. The 2016 hazard review and audit did not prompt any changes in the operation. \r\n\r\n      68.155(e) Five-Year Accident History\r\n\r\nThe C.C. Williams facility has had no accidental releases of chlorine or sulfur dioxide in the past five (5) years that have caused or resulted in on-site injuries, off-site injuries, property damage or off-site impacts.\r\n\r\n      68.155(f) Emergency Response Program\r\n\r\nIf a release were to occur, a C. C. Williams facility employee would immediately contact the Mobile County Emergency Management Agency (MCEMA), whose members are aware of the presence of chlorine at the facilities.  The MCEMA would dispatch experience HAZMAT personnel trained to respond to such emergencies.  The emergency response procedures are outlined in th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000056438,
      "SummaryText": "e Mobile Area Water and Sewer System Emergency Action Plan.\r\n\r\nThe area that stores the one-ton cylinders is fully enclosed and is equipped with a caustic scrubber for mitigation of a release.  The caustic scrubber system is equipped with chlorine and sulfur dioxide detectors that will automatically activate the scrubber system if a chlorine concentration of three (3) parts per million or great is present.  In addition, MAWSS has installed emergency chlorine and sulfur dioxide valve actuators, which will shut off flow from the one-ton cylinders within 1.5 seconds after detecting a leak.  The system also contains an emergency \"panic button\" located outside of the storage area to allow for operator-initiated emergency shut-off.\r\n\r\n      68.155(g) Safety Improvements\r\n\r\nRecommendations for safety improvements were identified in both the compliance audit and the Hazard Review.  These recommendations, and target dates of implementation, are documented in the RMP. The 2016 audit found no significant improvements required at this time."
    }
  ]
}