{
  "FacilityID": 1000036976,
  "FacilityName": "Fall River Water Filtration Plant",
  "FacilityStr1": "1831 Bedford Street",
  "FacilityStr2": null,
  "FacilityCity": "Fall River",
  "FacilityState": "MA",
  "FacilityZipCode": "02723",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25005",
  "LEPC": "City of Fall River LEPC",
  "FacilityLatDecDegs": "41.699200",
  "FacilityLongDecDegs": "-71.11962",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "Water_filt@fallriverma.org",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Fall River",
  "OperatorStr1": "1831 Bedford Street",
  "OperatorStr2": null,
  "OperatorCity": "Fall River",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02723",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071183",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-12-10 00:00:00",
  "ErrorReportDate": "2004-07-23 00:00:00",
  "ReceiptDate": "2013-10-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-10-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-02-08 00:00:00",
  "DeRegistrationEffectiveDate": "2016-07-25 00:00:00",
  "AnniversaryDate": "2018-10-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 41.6992,
  "FRS_Long": -71.11962,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "0.36",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045264,
      "AltID": "Water Supply",
      "FacilityID": 1000036976,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054728,
          "ProcessID": 1000045264,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045707,
          "ProcessID": 1000045264,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000030129,
              "Process_NAICS_ID": 1000045707,
              "SafetyReviewDate": "2013-10-17 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "AWWA",
              "FR_Comments": "follow guideline in Clean Water Act and American Water Works",
              "HazardReviewDate": "2013-10-17 00:00:00",
              "ChangeCompletionDate": "2013-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Personal Injury",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Emergency Repair B kit, SCBA, Ambient Air Monitor, SOP's",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Repair B Kit",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of new vacuum based feed system with emergency shut off valves, Development of written SOP's and increased operator training",
              "OpProceduresReviewDate": "2013-12-05 00:00:00",
              "TrainingReviewDate": "2013-11-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Vendor, Jones Chemical Company",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-12-05 00:00:00",
              "EquipmentInspectionDate": "2013-07-16 00:00:00",
              "EquipmentTested": "Gas Chlorinators/chlorine detection alarm",
              "ComplianceAuditDate": "2013-10-21 00:00:00",
              "AuditCompletionDate": "2013-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2013-10-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000030515,
                  "PreventionProgram2ID": 1000030129,
                  "ProcessChemicalID": 1000054728
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036976,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-03-23 00:00:00",
    "ERTrainingDate": "2004-03-30 00:00:00",
    "CoordinatingAgencyName": "Fall River Fire Dept.",
    "CoordinatingAgencyPhone": "5083242743",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Safe Drinking Water Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036976,
      "SummaryText": "The purpose of the Risk Management Plan is to provide the Water Department, City of Fall River with a procedure to be followed for containment/control of massive discharge or reaction of Chlorine stock in the water treatment plant and its potentially toxic effect on employees and adjacent populations. The plan has enhanced the Water Departments commitment for a comprehensive written emergency response plan and an employee safety training program to mitigate the consequences of an emergency. The city of Fall River's water filtration plant produces an average of 15 million gallons per day (MGD) and provides safe drinking water to the residents of Fall River and other adjacent communities. The use of chlorine in water treatment is required to control the presence of bacteria and assist in the removal of certain dissolved chemicals from the surface water. It's use is essential to protect the public health and assure water quality. in normal use in drinking water operations chlorine is a safely contained and expertly handled substance. Chlorine is delivered in one ton cylinders and stored inside the chlorine storage room. The storage room has a maximum capacity of six (6) one ton cylinders of liquified gas. Two units are on line at any one time. Empty tanks are labled and stored. To be used, the chlorine must be allowed to expand to a gaseous state and be fed into the treatment plant process in carefully measured amounts. Ths is accomplished in a chlorinator. The delivery system from the tanks, through the auto swich-over valve to the chlorinator is under a vacuum so that if a leak occured ambient air would be drawn into the delivery pipe and not released to the atmosphere. Leaks involving delivery systems to or from chlorinators or valves in the apparatus are uncommon in water treatment plants. Despite the apparently sturdy construction of both cylinders, piping systems and chlorinators, it must be remembered that all components are subject to fatigue by  corrosion or c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036976,
      "SummaryText": "ontinued pressure on weakened plugs or improperly prepared joints. All tanks are inspected for corrosion and other potential defects prior to being accepted and off-loaded.  The major chlorine emergency considered is if a tank in operation severed a line or ruptured a disk on the one ton container. The alternative release scenario is if a container fell off in transfer operations. It is theoreically possible to produce a chlorine emergency by excessive chlorination of the water. If demand exceeds the safe daily draw upon a tank (approximately 400lb./24 hr) a line freeze up may occur. Attempts to correct this situatuion may result in accidental release of chlorine. The worst case release scenario would have an offsite impact to schools,hospitals,state forest,industrial park and in circumference of 0.6 miles, which would effect approximetly 6,100 people. The alternative case would also impact an area of 1.13 miles effectiong 3,100 people. The main treatment plant is equipped with an atmospheric chlorine detector. This must be tested at least quarterly; the alarm will sound internally to the apparatus (located in front of the chlorinator room window) as well as on the air horn. There is a trouble light (for chlorine gas in atmosphere) on the SCADA display panel as well as on the wall adjacent ot the control room. In the event of a presumed chlorine leak or chlorine alarm from the detector, the operator in charge and attendant shall investigate the leak; other personnel will go to the entrance and prepare to evacuate the building. The EPA's RMP comp. model was used to conduct the worst case and alternative release scenarios. The general accident release preventive program and chemical specific preventive steps are as follows: Standrd first aid treatment for chlorine exposure consists of the following: External-flushing with large amounts of water followed, if possible,by washing with diluted mild or lime water. Eyes-flushing with cool water for at least one hour. no oth"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036976,
      "SummaryText": "ency services, the approved chlorine control agency of record, and additional employees as required. these actions constitute declaration of chlorine emergency. The Administration is charged with obtaining appropiate meteorlogical data from a certified source and with the fire department staff,estimating direction and intensity of gas diffusion and travel from the accident site. The authority to evacuate adjacent civilian populations clearly rest with emergency service. Until a chlorine emergency is terminated by contaminent, a member of the administration shall be present on scene or available for consultation. Control of media and press releases concerning any chlorine emergency shall normally be the responsibility of the superintendent of his designate. If a facility must be evacuation. When this is deemed unsafe or unwise, this shall be done on -re -entry in protective gear and in the presence of one other person. Drills conducted for emergency response are planned with the Fall River Fire Department. The supplies of chlorine is required by contract to provide annual safety traing to water department personel. Security alarms have been installed on the chlorinator and chlorine storage room doors."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036976,
      "SummaryText": "er chemicals are to be used in the eye. Respiratory (inhalation)-administration of 100% oxygen by mask; severe exposure may require artificial respiration. Internal- administration of milk or milk products may soothe mucous membranes and reduce the chance for nausea and vomitting. After any chlorine exposure, employees are urged to shower and change clothes. Chlorine exposure victims will recieve examination or definitive care at a local hospital. Many pre-existing heart and lung conditions may be aggravated by chlorine exposure. Protective equipment for chlorine emergencies is located in the main treatment plant at the following locations: at chemical treatment room- 2 MSA packs in carrying cases. in emergency locker,treatment room  disposable coveralls and goggles. Outside of chlorinator room in chemical feed room on floor by chlorinator. room window three canister type chlorine masks ( refill canisters emergency locker). first aid equipment in treatment room, oxygen mask with 15 minute supply and one refill (emergency locker), first aid kit (control room), of windpipe (emergency locker). Chlorine cylinder repair kit- on floor of chlorine room. The Fall River Water department followes the regulations of the Commonwealth of Massachusetts, Department of Labor and Workforce Development, Division of Occupational Safety, Occupational Hygiene Program The city also requires the liquid chlorine and containers shall conform to American Water Works specifications B 301-92, B 301-81, and to the applicable regulations of the department of transportation and loaded and shipped in strict acordance with the lates edition of  Container Procedure at Chlorine Package Plants, as issued by the Chlorine Institute Inc. The Water Deapartment has updated the personal protective equipment for personnel. Eight (SCBA) self contained breathing apparatus have been acquired and hydrostatically tested. The Fall River Fire Department provides training for the use and maintenance of the SCBA's."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036976,
      "SummaryText": "Jones Chemicals (chlorine supplier) provieds annual training for all Water Treeatment Plant staff in the proper procedures to follow when changing chlorine tanks and routine maintenance. A dehumidifier in the chlorine storage room is checked daily. Routine maintenance consists of rebuilding chlorinators, changing o rings, diaphrams, lead washers,cleaning of valves and testing the ambient air chlorine monitor and vacuum and pressure gauges. The chlorination system is maintained by an outside vendor under an annual service contract.  The contractor is available 24-hours per day for any emergency our routine maintenance.  The Fall River Water Department has not had an accidental relaese of chlorine within the last ten years.  \r\nEmergency Response Program (Declaration of Emergency).\r\nIt is the duty of all employees and administrators on the treatment plant site to immediately report and/or investigate signs of a potential chlorine emergency. The operator in charge (OIC)of a shift will normally investigate potential leaks. When there are only two persons on a shift, the operator shall make the investigation keeping visual contact with the attendant on duty. Appropriate safety equipment shall be worn. If a chlorine leak is discovered it's nature and rate shall be determined and attempts shall be made by the employees to control small leaks by such means as: adjustment of apparatus; system change over to standby tank or complete shutdown; termination of entire chlorination process meaning plant shutdown. In every case it shall be the OIC who shall initially determine that leak can not be contained by appropiate small repairs. In such cases, he shall confer with the water treatment plant Supervisor or Director of Treatment and Resources in their absence, the other division Directors or Administrator. Fall River Fire Department shall also be called at this time. One of the members of the administration shall inspect the site and will be responsible for notification of emerg"
    }
  ]
}