{
  "FacilityID": 1000072763,
  "FacilityName": "SALE RANCH GAS PLANT",
  "FacilityStr1": "8.5 MILES NNW OF INTERSTATE 20 AND",
  "FacilityStr2": "1.9 MILES WSW OF FARM ROAD 829",
  "FacilityCity": "NEAR STANTON",
  "FacilityState": "TX",
  "FacilityZipCode": "79782",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48317",
  "LEPC": "Martin County LEPC",
  "FacilityLatDecDegs": "32.210582",
  "FacilityLongDecDegs": "-101.935181",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.wtggasprocessing.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "WTG GAS PROCESSING, L. P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "WTG GAS PROCESSING, L.P.",
  "OperatorStr1": "211 NORTH COLORADO",
  "OperatorStr2": null,
  "OperatorCity": "MIDLAND",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79701",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000097548",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-00205",
  "SafetyInspectionDate": "2003-04-29 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-09-13 18:11:42",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-09-13 18:11:42",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-09-13 18:11:42",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-09-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.215556,
  "FRS_Long": -101.936111,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091020,
      "AltID": "Gas Plant and Assoc. Oper",
      "FacilityID": 1000072763,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113810,
          "ProcessID": 1000091020,
          "ChemicalID": 155,
          "Quantity": 110000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000099589,
              "ProcessChemicalID": 1000113810,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 1000113811,
          "ProcessID": 1000091020,
          "ChemicalID": 155,
          "Quantity": 350000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000099590,
              "ProcessChemicalID": 1000113811,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000099591,
              "ProcessChemicalID": 1000113811,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000099592,
              "ProcessChemicalID": 1000113811,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000099593,
              "ProcessChemicalID": 1000113811,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000099594,
              "ProcessChemicalID": 1000113811,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000099595,
              "ProcessChemicalID": 1000113811,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092262,
          "ProcessID": 1000091020,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072763,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Stanton Fire Department",
    "CoordinatingAgencyPhone": "4237563333",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072763,
      "SummaryText": "Accidental Release Prevention Policy:\r\nProtecting and responsibly managing natural resources demonstrates stewardship and is critical to the quality of life in the communities we serve, to the environment, and to WTG Gas Processing, L.P.'s (WTG's) long-term business success.  Promoting the health and safety of co-workers, contractors, customers, and communities is the responsibility of all WTG employees.  WTG will meet all applicable laws, rules and regulations.\r\n\r\nStationary Source and Regulated Substances Handled:\r\nSale Ranch Gas Plant (Sale Ranch), located in Stanton, Martin County, Texas, is a natural gas liquids (NGL) recovery plant that produces pipeline specification natural gas and NGL, also known as Y-grade, from field gas collected throughout the upstream gathering system.  Sale Ranch processes flammable gas and liquid mixtures in an amount greater than the threshold quantify containing any of the following RMP-regulated constituents:\r\n¿\tMethane\r\n¿\tEthane\r\n¿\tPropane\r\n¿\tIsobutane\r\n¿\tButane\r\n¿\tIsopentane\r\n¿\tPentane\r\n\r\nThe only RMP-regulated toxic constituent present at Sale Ranch, which is part of the amine treating process for the sites' liquid product, is hydrogen sulfide; however, quantities at this facility are well below the threshold quantity. \r\n\r\nAccidental Release Prevention and Emergency Response Policies:\r\nWTG is committed to ensuring a safe work environment for all its employees, contractors, and vendors.  The Sale Ranch Gas Plant has a detailed Emergency Action Plan in which it has coordinated with the community's local responders through mock emergency simulations in order to introduce the local responders to the facility and its personnel.\r\n\r\nGeneral Accidental Release Prevention Program:\r\nThe Sale Ranch process is covered by OSHA 29 CFR 1910.119, Process Safety Management of highly hazardous chemicals (PSM) regulation.  WTG considers the systems developed for compliance with PSM to be the basis for good safety and business practices.  In this"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072763,
      "SummaryText": "effort, WTG identifies opportunities to continuously improve initiatives for each PSM element.  The PSM elements are implemented to satisfy the PSM requirements and are discussed here for completeness only since the Sale Ranch Gas Plant qualifies as a program level 1 RMP process.\r\n\r\nEmployee Participation:\r\nEmployee participation is the foundation block to an evergreen and integrated PSM program.  Thus, the current PSM improvement initiative is heavily focused on this key element as employees are becoming more actively involved in the implementation of each element of PSM.\r\n\r\nProcess Safety Information:\r\nComprehensive reviews of the available process safety information (PSI) have been conducted.  Updates to maximum intended inventory (MII) and piping and instrumentation diagrams (P&IDs) have been completed.  A comprehensive electronic web-based system utilized for timely access to information has been built, implemented, and made available to all personnel involved with operating the process.  \r\n\r\nProcess Hazard Analysis (PHA):\r\nA new PHA team including experienced operating personnel (operations and maintenance), WTG engineers, Process Control personnel, safety representatives, and PSM representatives was utilized to conduct a new PHA in June 2018.  Results and recommendations from these analyses are in process of being shared with employees.  Additionally, a process safety tracking tool has been developed and implemented for the interactive tracking of PHA action items to closure.\r\n\r\nOperating Procedures:\r\nWritten operating procedures reference PSI are available in the site project books.  A mentorship training program has been implemented.  A technical review of operating procedures to ensure current operations are reflected and to incorporate the various modes of process operations will be completed and published to the company's electronic web-based system.\r\n\r\nManagement of Change (MOC) and Pre-Startup Safety Review (PSSR):\r\nImprovements to the MOC procedure an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072763,
      "SummaryText": "d associated checklists are in progress to capture all process related changes.  Requirements for the identification, evaluation, control, and authorization of modifications to plant design and operations prior to the implementation to ensure that the risk of new or existing hazards are properly managed is available to all personnel.  Extensive PSSR checklists for applicable disciplines (electrical, instrumentation, procedures, etc.) have been developed and implemented.  These checklists are Appendices to the Company's MOC procedure and are available online from the company's electronic web-based process library. \r\n\r\nMechanical Integrity (MI):\r\nIn addition to the ultrasonic thickness testing program already in practice at Sale Ranch, a complete third-party MI gap assessment has been completed.  This has resulted in the development of revised comprehensive inspection standards and procedures along with a specialized inspection program structured specifically for Sale Ranch.\r\n\r\nIncident Investigation:\r\nWTG investigates all PSM incidents.  Throughout the PSM program assessment process, incident investigation procedures are being reviewed and will be updated as necessary.  A mix of WTG personnel will be provided investigation methodology training to further enhance the program and ensure root cause is consistently identified.  A process safety tracking tool has been developed and implemented to track action items and incident investigation corrective actions to closure.\r\n\r\nCompliance Audits:\r\nTo meet compliance with PSM, WTG conducts compliance audits every three years to verify all PSM element requirements are being satisfied.  In WTG's general PSM improvement program initiatives, an updated audit protocol has been established and implemented within WTG.  The kickoff meeting for Sale Ranch's next compliance audit was conducted in August 2018 and the audit is scheduled to be completed in September 2018.\r\n\r\nHot Work Permit:\r\nHot work permits are in use and on file.  Thes"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072763,
      "SummaryText": "e permits are uploaded onto the company's electronic web-based process library.  Throughout the PSM program assessment process, all hot work procedures are being reviewed and will be updated as necessary.\r\n\r\nContractors:\r\nWTG has an electronic program for contractors that includes their safety records.  A review of the contractor's safety record both prior to selection and during their time of employment is being developed.\r\n\r\nTraining:\r\nWith the enhancement of various PSM elements such as PSI, PHAs, operating procedures, PSSR, MI, MOC, incident investigations, etc., additional training (computer and classroom based) will be established to ensure all Sale Ranch employees are knowledgeable in these processes.\r\n\r\nChemical Specific Prevention Steps:\r\nThe process at Sale Ranch has hazards that must be managed for continued safe operation.  Following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\r\nUniversal Prevention Activities\r\nThe accident prevention program summarized previously is applied to the RMP-covered process at Sale Ranch.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nSpecialized Safety Features:\r\n\r\nThe Sale Ranch Gas Plant has safety features on many units to help:\r\nI.\tcontain/control a release\r\nII.\tquickly detect a release\r\nIII.\treduce the consequences of (mitigate) a release\r\n\r\nRelease Detection\r\nI.\tHydrocarbon detectors with alarms located throughout the process\r\nII.\tHydrogen sulfide detectors with alarms located in designated process areas\r\nIII.\tRoutine operator rounds/equipment inspections\r\nIV.\tOperators are on-site continually (8,760 hours per year)\r\n\r\nRelease containment/control measures include:\r\nI.\tMain process relief valves that discharge to a flare to capture and incinerate episodic releases\r\nII.\tAutomated and manual valves to permit isolation of the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072763,
      "SummaryText": "process\r\nIII.\tAutomated shutdown systems for specific process parameters (e.g., high temperature)\r\nIV.\tCurbing to contain liquid releases\r\nV.\tRedundant equipment and instrumentation (e.g., uninterruptible power supply for process control system.\r\nVI.\tAtmospheric relief devices\r\n\r\nRelease mitigation measures include:\r\nI.\tFire extinguishing systems\r\nII.\tPersonnel trained in emergency action\r\nIII.\tPersonal protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus)\r\n\r\nEmergency Response Program:\r\nThe overall emergency response program for Sale Ranch has been coordinated with several local emergency responders that include the Stanton Fire Department (\"FD\") and Emergency Medical Services (\"EMS\"), Midland FD, Lenorah FD and EMS.  The Sale Ranch Gas Plant has around-the-clock communications capability with appropriate emergency response organizations (e.g., fire department, Police and Sheriff's office).  This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  Sale Ranch conducts mock emergency drills that involve the LEPC and emergency response organizations and the facility will conduct additional emergency drills annually with local emergency responders regarding the hazards of regulated substances in the facility.\r\n\r\nFive-Year Accident History:\r\nAll incidents that occurred within the previous five years were reviewed to determine whether any are subject to RMP reporting.  There have been no accidental releases of regulated substances meeting the accident reporting criteria of 40 CFR 68.42(a) during the prior five years at the Sale Ranch Gas Plant or any that preclude meeting the program level 1 requirements of 40 CFR 68.10(b)(1).\r\n\r\nPlanned Changes to Improve Safety\r\nWTG Sale Ranch will continue to improve its safety and environmental performance through emphasis on the continued development of it's PSM Program.  Improvement plans include process en"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000072763,
      "SummaryText": "gineering support to update critical PSI data for the site; operating procedures written for each mode of operation and to include consequences of deviations; an operator certification training program established from the new operating procedures, new process hazard analysis (PHA) procedure and team structure ensuring employee involvement, new MI program incorporating the implementation of all new inspection procedures and frequencies all to be carefully reviewed, and recommendations for improvement generated using WTG's new compliance audit process."
    }
  ]
}