{
  "FacilityID": 1000000977,
  "FacilityName": "Fort Riley",
  "FacilityStr1": "Building 2651 Macomb Hill",
  "FacilityStr2": "Camp Forsyth",
  "FacilityCity": "Fort Riley",
  "FacilityState": "KS",
  "FacilityZipCode": "66442",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20061",
  "LEPC": "Geary, Riley, & Clay Counties",
  "FacilityLatDecDegs": "39.078",
  "FacilityLongDecDegs": "-96.82",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Department of the Army",
  "Company2Name": "Department of Defense",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Herb Abel",
  "OperatorStr1": "ATTN: IMNW-RLY-PWE",
  "OperatorStr2": "Building 404, Holbrook Ave",
  "OperatorCity": "Fort Riley",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66442",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ben Wissenburg",
  "RMPTitle": "Air Program",
  "FTE": 28700,
  "OtherEPAFacilityID": "KS6214020756",
  "EPAFacilityID": "100000071254",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1610001",
  "SafetyInspectionDate": "1997-05-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-12-06 00:00:00",
  "DeRegistrationEffectiveDate": "2011-11-18 00:00:00",
  "AnniversaryDate": "2014-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.16667,
  "FRS_Long": -96.75,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001202,
      "AltID": "Water Treatment Plant",
      "FacilityID": 1000000977,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001290,
          "ProcessID": 1000001202,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001247,
          "ProcessID": 1000001202,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501247,
          "ProcessID": 1000001202,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000977,
      "SummaryText": "EXECUTIVE SUMMARY\nRISK MANAGEMENT PLAN\nFOR FORT RILEY\n\n1.  BACKGROUND.  Section 112(r) of the Clean Air Act Amendments of 1990 (CAAA-90) is entitled A?Accidental Release PreventionA?.  This section, commonly referred to as the \"Risk Management Plan\" or RMP, is designed to both prevent and prepare for releases of chemicals or flammable substances that could have an impact on the surrounding public.  Under the regulation, certain facilities are required to submit a RMP that summarizes their Risk Management Program to the U. S. Environmental Protection Agency (EPA).  Army installations that store/use toxic chemicals and flammable substances in quantities meeting the rule's thresholds are required to develop a risk management program and also submit a risk management plan to the EPA.  \n\n2.  PURPOSE.  Fort RileyA?s Risk Management Plan meets the requirements of CAAA-90.  It describes elements of the program, assigns responsibilities for implementation, and clearly communicates Fort RileyA?s commitment to its workers and surrounding communities to minimize the risk of catastrophic releases of chlorine. The electronic submission is a summary of Fort RileyA?s program.\n\n3.  REPORTABLE HAZARDS.  The only toxic chemical in use on Fort Riley meeting the requirements under CAAA-90 for submission of a RMP is chlorine used at the Water Treatment Plant (WTP).\n\n4.  DISCUSSION. \n    \na. Fort Riley Water Treatment Plant (WTP). \n \nThe WTP at Fort Riley employs a conventional treatment process of purification that is in common use throughout the United States.  The WTP has an average daily flow rate of 2.5 million gallons, and serves approximately 29,000 people.  This process normally requires the use of 140-200 pounds of chlorine daily.  The chlorine is stored in four one-ton cylinders.  One of these containers is exhausted every 10-15 days.  The WTP has been operating since December 1992 and has had no chlorine release incidents.\n\nb. Accidental Release Prevention and Emergency Response. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000977,
      "SummaryText": "\n\nDirectorates of Public Works technicians inspect the cylinders at the WTP a minimum of three times daily.  All technicians are certified Class 4 Water Treatment Operators, which exceeds both state and federal regulations for certification. Additionally, there are chlorine detectors with alarms placed in the chlorine feed room and the chlorine storage areas.  The Fort Riley Fire Department is prepared to deal with virtually any HAZMAT situation.  The fire department maintains a 40-person staff, the largest in the local area.  All fire department personnel undergo a minimum of 80 hours of HAZMAT training (many undergo more, some as many as 240 hours of training) and also undergo 24 hours of annual recertification training.  The department also has mutual aid \n \nagreements with all local fire departments and maintains contingency spill plans for potentially hazardous sites.  Finally, in addition to the Fire Department, Fort Riley has a Crisis Management Plan to respond to various emergency situations, which includes an unintentional chlorine discharge. \n\nc. Planned Safety Improvements.\n\nThe Fort Riley Fire Department conducts annual training on the use and maintenance of Self Contained Breathing Apparatus (SCBAA?s), and initial rescue training for all WTP personnel.  Along with training, the WTPA?s SCBAA?s will be incorporated into the Fire DepartmentA?s Air Program, which will ensure all applicable standards and recordkeeping requirements are maintained.  This additional training and SCBA maintenance will improve the safety of all WTP operators during change outs of the one-ton chlorine cylinders.   \n\n5.  CONCLUSIONS.\n\na.  The dangers presented by Fort RileyA?s WTP to the local population are minimal.  Water treatment facilities for drinking water are commonplace throughout society and procedures used on Fort Riley are similar to those in use nation-wide.\n\nb.  Fort RileyA?s RMP is designed to help insure that catastrophic releases of chlorine gases do not occur.  Th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000977,
      "SummaryText": "is is done via the development and implementation of a comprehensive program to manage chemical process risk.  Key participants in this program include Fort Riley's Environmental Quality Control Committee; the Directorate of Public WorksA?s, Divisions of Environmental, and Operations and Maintenance, the Installation Safety Office, Preventive Medicine (Industrial Hygiene); Directorate of Plans, Training, and Mobilization; Directorate of Contracting; Staff Judge Advocate; Public Affairs Office; Directorate of Emergency Services.\n\nc.  Fort Riley is committed to being a safe neighbor and employer.  Prevention of accidents, employee safety and emergency response are all operations, which have command support and visibility.  Fort Riley follows all applicable regulations, requirements and policies designed to provide a safe work environment.\n\n\n\nRichard G. Piscal\nColonel, Armor\nGarrison Commander\n"
    }
  ]
}