{
  "FacilityID": 1000071344,
  "FacilityName": "Oklahoma Liquids Terminal",
  "FacilityStr1": "1605 West 131st Street",
  "FacilityStr2": null,
  "FacilityCity": "Jenks",
  "FacilityState": "OK",
  "FacilityZipCode": "74037",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "35.974303",
  "FacilityLongDecDegs": "-96.009592",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "keyera.com",
  "FacilityEmailAddress": "niall_gleeson@Keyera.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Keyera Energy Inc.",
  "Company2Name": "Keyera Energy Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Keyera Energy Inc.",
  "OperatorStr1": "10613 W Sam Houston Parkway N",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77064",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brad Slessor",
  "RMPTitle": "General Manager, KEI",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000229601",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-07-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089380,
      "AltID": "Butane Blending",
      "FacilityID": 1000071344,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000090604,
          "ProcessID": 1000089380,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000111809,
          "ProcessID": 1000089380,
          "ChemicalID": 118,
          "Quantity": 3500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000611809,
          "ProcessID": 1000089380,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071344,
      "SummaryText": "RMP Executive Summary\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\n\nKeyera - Oklahoma Liquids Terminal Is a butane blending (storage and truck offload) facility. The facility pipes butane off-site for blending into distillates.\n\nAt Keyera - Oklahoma Liquids Terminal, hereafter referred to as the Oklahoma Liquids Terminal or Facility, management and employees are committed to operating and maintaining this process in a safe, reliable and environmentally sound manner.\n\nOklahoma Liquids Terminal believes that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding safety and environmental performance Is of paramount importance.\n\nThe Facility is designed, operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community in which it operates.\n\nKeyera promotes health safety, and the environment through programs of awareness, compliance, prevention and protection. These programs include a combination of accidental release prevention and emergency response planning. This document provides a brief overview of the comprehensive risk management activities that we have designed and Implemented, Including:\n\n\n\nA.    A description of the facility and the use of regulated substances\n\nB.    An overview of our accidental release prevention programs\n\nC.    A five-year accident history for accidental releases of regulated chemicals\n\nD.    An overview of the emergency response program\n\nE.    An overview of planned changes to Improve safety\n\nA, STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe primary function of Oklahoma Liquids Terminal, located in Jenks, Oklahoma Is to act as a Butane Blending (offload and storage) facility. The butane process has been classified as Program level 3, No Program 1 or 2 processes containing regulated substances are Identified. By virtue of lts flammable effects, 1t is necessary to observe certain safety pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071344,
      "SummaryText": "ecautions In handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community, Keyera is strongly committed to employee, public, and environmental safety and health. Safety at the Facility depends upon the manner In which butane Is handled as well as the various safety devices Incorporated Into the design of the process. Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Facility.\n\n\n\nThe facility maintains 9 x 90,000 horizontal, storage vessels. Specifically, liquefied butane Is off- loaded via truck tanker to the vessels and then pumped off-site for injection. Process safety controls Include excess flow valves, low-melting point (<250 Degrees Fahrenheit) feeds to pneumatic valves (fail-safe)1 emergency shut-off devices on the system, line thermal (pressure) reliefs, and grounding devices. Access to Oklahoma Liquids Terminal Is restricted to authorized employees, management personnel, authorized contractors/visitors and tenants.\n\nB, GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION MEASURES\n\nKeyera accidental release prevention programs and emergency planning programs provide for effective management of the hazards posed by regulated substances to Facility employees, the public, and the environment The covered process Is regulated by the EPA RMP (40 CFR Part 68), as well as the OSHA Process Safety Management standard (29CFR1910,119), The following accident prevention program elements are In place at the Oklahoma Liquids Terminal:\n\n1    Employee Participation\n\n2    Process Safety Information\n\n3    Process Hazard Analysis (PHA) with Risk Assessments 4 Standard Operating Procedures\n\nOperator and Contractor Training 6 Contractors 7 Pre-startup Safety Review\n\n8 Mechanical Integrity with Preventive Maintenance 9 Safe Work Permits\n\n10    Management of Change\n\n11    Accident or Potential C"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000071344,
      "SummaryText": "atastrophic Event Investigation 12 Emergency Action Planning 13 Compliance Audits\n\n14 Trade Secrets\n\n \n\nThese fourteen {14/ individual elements of the prevention program work together to prevent accidental chemical releases. The Oklahoma Liquids Terminal and its employees are committed to the standards required by these management programs. In addition to the above elements, the Facility also has specific prevention measures that are employed as part of the operating procedures inclusive of engineering and administrative controls to help quickly detect a release, contain/control a release and reduce the consequences of a release. These are briefly summarized as follows:\n\n\n\nGeneral Risk Reduction and Safety Measures\n\n-Engineering and construction In accordance 'with recognized Industry and company standards\n\n-Equipment property designed with protection from overpressure {pressure safety relief valves, etc.)\n\n-Updated technical drawings, Pir,lng & Instrument Diagrams and Process Flow Diagrams\n\n-Systems monitored and control ed by trained Operators/Contractors\n\n-Redundant control systems\n\n-Automatic and manual shuldo'Ml devices for critical systems\n\n-Scheduled inspection and testing of safety devices\n\n-Unauthorized vehicular traffic prohibited from critical areas\n\n-limited facility access\n\n-Regular safety meetings and safety awareness erograms\n\n-Routinely scheduled safety inspections and audits\n\n-Radio communication system\n\n-Frequent process survelllance by operators\n\n-Process butane leak detection devices\n\nGeneral Release Mitigation\n\n-Automatic and manually operated emergency shut-offs to limlt release quantity\n\n-Leak detection with automatic shutoff\n\n-Remote monitoring\n\nGeneral Emergency Response\n\n-Emergency contact system\n\n-Periodic emergencytrainin9 for employees\n\n-Communication systems With local emergency responders and regulatory agencies\n\n-Emergency drills with Facility personnel, regulatory agencies, and community emergency responders to enhance response skill"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000071344,
      "SummaryText": "s and coordination among agencies\n\n-Mutual Aid with Local Fire Departments\n\n-Participation with the Tulsa Area Emergency Management Agency (Tulsa Area EMA)\n\nFurther, the Oklahoma Liquids Terminal complies 'Mth the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA-58) requirements for LP Gas storage and transfer. In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, an Emer9ency Response Action Plan (ERAP) Is in place for the Facility 'Mth response activities being coordinated with the Glenpool Fire Department and Tulsa Area EMA.\n\nC. FIVE YEAR ACCIDENT HISTORY\n\nKeyera has an excellent record of accident prevention. The Facility maintains records for all significant accldental chemlcal releases.\n\nThis Is a new process with no accidents within the past five\n\n(5) years resulting from the chemlcal release of materials covered under the EPA RMP regulation.\n\nD. EMERGENCY RESPONSE PROGRAM\n\nResponse actions are coordinated with the Glenpool Fire Department. An ERAP ls in place to inform employees Ywhat to do In case of a release, fire, and to notify emergency responders 'Mien there is a need for a response.\n\n\n\nThe Facility maintains compliance Wth local, state and federal regulations including OSHA CFR 1910.38, and SARA Trtle Ill. The Glenpool ERAP provides the essenllal planning and training for protecting employees, the public, and the environment during emergency situations. Contained in these Plans are v.ritten procedures that outline the actions to occur for various types of emergencies\n\n \n\nthat could occur at the Facility. These emergencies include: releases of chemical substances, fires, explosions, and medical evenls. The Programs address all aspects of emergency actions including:\n\n-    Roles and responslbilitles of personnel in the event of an incident;\n\n-    Procedures for notifying employees that a release has occurred;\n\n-    Procedures for evacuation and accounting of pe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000071344,
      "SummaryText": "rsonnel;\n\n-    Procedures to notify local emergency response organizations and other appropriate authorities that a release has occurred;\n\n-    Guidance on proper first aid treatment; and\n\n-    Procedures for post incident actions.\n\nThe Oklahoma Liquids Terminal also maintains its OWTI dedicated emergency response equipment. This equipment Includes portable fire extinguisher and first aid equipment. An inspection, testing and maintenance program Is in place for emer ency response equipment. Fire extinguishers are inspected monthly and receive annual maintenance per the International Fire Code and NFPA. Inspection reports for emergency response equipment are filed on-site. Three \\Yet hydrants are also located on-site for fire department use.\n\n\n\nIn the event of an emergency Involving the Oklahoma Liquids Terminal butane blending system, it is the policy of the Facility to finally contact the Glenpool Fire Department and request their assistance. The Facility maintains a trained (annually) Incipient fire capability. The Facility's emergency action plans are coordinated with the Fire Department and EMA. The Glenpool Fire Department Is aware of the Facility's butane system, facility access and water sources. Oklahoma Liquids Terminal maintains a vegetation control program to minimize plant growth 'within 10 feet of the butane systems.\n\n\n\nKeyera maintains a relationship 'with the Glenpool Fire Department. Tours and drills 'with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with the hazards, equipment, resources and personnel In the Facility.\n\nE. PLANNED CHANGES TO IMPROVE Safely\n\nKeyera Is continually striving to make the Oklahoma Liquids Terminal the safest and most reliable workplace possible for its employees, neighbors and community. This includes all elements of the previously mentioned prevention program inclusive of periodic hazard reviews and periodic activities with lo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000071344,
      "SummaryText": "cal 1st responders.\n\n\n\nThe goal of Keyera is to demonstrate continuous Improvement in its health, environmental and safety performance. In addition, the Facility will work cooperatively 'with the community to address any concerns.\n\n"
    }
  ]
}