{
  "FacilityID": 1000084245,
  "FacilityName": "Moroni Plant",
  "FacilityStr1": "300 West 350 South",
  "FacilityStr2": null,
  "FacilityCity": "Moroni",
  "FacilityState": "UT",
  "FacilityZipCode": "84646",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49039",
  "LEPC": "Sanpete County LEPC",
  "FacilityLatDecDegs": "39.517968",
  "FacilityLongDecDegs": "-111.591179",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pitman Farms",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pitman Farms",
  "OperatorStr1": "PO Box 308",
  "OperatorStr2": null,
  "OperatorCity": "Moroni",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84646",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Christensen",
  "RMPTitle": "Maintenance Director",
  "FTE": 370,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165466",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.51944,
  "FRS_Long": -111.59333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "24",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105233,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000084245,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106546,
          "ProcessID": 1000105233,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131755,
          "ProcessID": 1000105233,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631755,
          "ProcessID": 1000105233,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084245,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Norbest Division Moroni has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Norbest Division Moroni, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that Norbest Division Moroni has updated their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name                 | Process Chemical                | Process Quantity(lbs.)\n\nRefrigeration Process 1        Anhydrous Ammonia                 37,000\n\nRefrigeration Process 2        Anhydrous Ammonia                  6,800 (THIS PROCESS IS NOT SUBJECT TO THE RMP/PSM REGULATION)\n\n\n\n* While it is recognized that Pitman Farms Norbest Division Moroni's Process 2 does not meet the threshold requirement for being subject to the  Federal OSHA PSM and Federal RMP regulations.  Pitman Farms Norbest Division Moroni has chosen to adopt RMP/PSM policy which incorporates elements from Federal OSHA PSM and Federal RMP requirements. This decision was made willingly to enhance the quality of the facility's RMP/PSM program. No Authority Having Jurisdiction (AHJ) has requested Pitman Farms Norbest Division Moroni to ad"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084245,
      "SummaryText": "here to Federal OSHA PSM and Federal RMP requirements. As such, Pitman Farms Norbest Division Moroni should only be held to the OSHA PSM and Federal RMP requirements for Process 1.\n\n\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM regulation that also meets the  RMP obligations \n\n2. Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Descriptions\n\n\n\nPitman Farms Norbest Division Moroni operates a turkey processing plant in Moroni, UT. The facility has an ammonia refrigeration system that provides refrigeration capacity to the following:\n\n\n\nSystem 1\n\n(2) Blast Freezers\n\n(3) Cool Rooms\n\n(2) Freezer Rooms\n\n(1) Processing Room\n\n(1) Production Floor\n\n\n\nSystem 2\n\n(2) Holding Freezers\n\n\n\nMost refrigerated spaces are equipped with air-cooling evaporators, which utilize liquid recirculators as required for liquid overfeed operation. Select portions of the system utilize accumulators as required for flooded operation. Most control valve groups are located inside the building near its corresponding equipment. The refrigeration machinery is contained within or directly above the machinery room. A partial list of system components includes:\n\n\n\nSystem 1\n\nMachinery Room 1\n\n(13) Oil separators\n\n(1) Oil blow tank\n\n(2) Oil coolers\n\n(13) Reci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084245,
      "SummaryText": "procating compressors\n\n(2) Rotary screw compressors\n\n\n\nMachinery Room 2\n\n(6) Oil separators\n\n(2) Oil coolers\n\n(6) Rotary screw compressors\n\n\n\nMachinery Room 4\n\n(1) Auto-purger\n\n(1) Oil separator \n\n(1) Oil cooler\n\n(1) Rotary screw compressor\n\n\n\nAttic\n\n(1) Accumulator\n\n(1) Oil blow tank\n\n(2) Oil separators\n\n\n\nBig Condenser Area\n\n(2) Evaporative condensers\n\n\n\nBlast Freezer 1\n\n(4) Air-cooling evaporators \n\n\n\nBlast Freezer 2\n\n(5) Air-cooling evaporators\n\n\n\nCanopy Room\n\n(1) Recirculator\n\n(1) Oil pot\n\n\n\nCondenser Area\n\n(5) Evaporative condensers\n\n(1) Shell and tube condenser\n\n(1) High pressure receivers\n\n(1) Intercooler\n\n(1) Intercooler oil pot\n\n\n\nCooler Room 2\n\n(1) Accumulator\n\n(1) Air-cooling evaporators\n\n\n\nCut-up Room\n\n(2) Heat-exchangers \n\n\n\nFork-Lift Shop\n\n(1) Recirculator\n\n(1) Oil pot\n\n\n\nMink House Room\n\n(1) Accumulator\n\n(6) Chillers\n\n(1) Oil pot\n\n\n\nNew Room\n\n(1) Accumulator\n\n(1) Liquid transfer vessel\n\n(1) Oil pot\n\n\n\nNorth Greer Freezer\n\n(3) Accumulators\n\n(3) Air-cooling evaporators\n\n\n\nParts Room\n\n(3) Accumulator\n\n(2) Liquid transfer vessels\n\n(1) Water chiller\n\n\n\nProduction Floor\n\n(2) Accumulators\n\n(3) Chillers\n\n(2) Ice makers\n\n\n\nRoof\n\n(1) De-superheater\n\n(1) Oil scrubber vessel\n\n\n\nSouth Greer Freezer\n\n(3) Accumulators\n\n(3) Air-cooling evaporators\n\n\n\nTub Cooler\n\n(2) Air-cooling evaporators\n\n\n\nSystem 2\n\nMachinery Room\n\n(1) Economizer\n\n(2) Heat-exchangers\n\n(1) High pressure receiver\n\n(3) Oil coolers\n\n(1) Oil pot\n\n(3) Oil separators\n\n(1) Recirculator\n\n(3) Rotary screw compressors\n\n(1) Thermosyphon vessel\n\n(1) Transfer vessel\n\n(1) Water sump\n\n\n\nHolding Freezer 1\n\n(2) Air-cooling evaporators\n\n\n\nHolding Freezer 2\n\n(6) Air-cooling evaporators\n\n\n\nRoof Condenser Area\n\n(1) Evaporative condenser\n\n\n\nOutside Machinery Room\n\nDiffusion tank\n\n\n\nSystem 1\n\nThe flooded portion of the system operates as follows: high pressure liquid from the high pressure receiver is piped to each cold room, where it passes through an expansion valve into low temperature and pressure accumulator. From "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084245,
      "SummaryText": "the accumulators, low pressure liquid is circulated through evaporator coils. As heat is absorbed, the liquid ammonia vaporizes to form low temperature and pressure gas which is returned to the accumulator. The suction gas is returned from the accumulators through a suction return line to the high or low suction accumulator. From the high or low suction accumulator, ammonia is piped to the suction inlet on the compressors. The high pressure discharge from the compressors is sent to water-cooled evaporative condensers where the high pressure gas ammonia is cooled, liquefied and returned to the high pressure receivers.\n\n\n\nThe pumped overfeed portion of the system operates as follows: high pressure liquid from the high pressure receiver is piped through a series of liquid feed solenoid valves, an expansion valve, and into a liquid recirculator. From there, low pressure liquid is pumped to each evaporator, where it passes through a solenoid valve, hand expansion valve and into evaporator. Low temperature liquid circulates through the evaporator. As heat is absorbed, the liquid ammonia vaporizes to form low temperature and pressure gas which passes through an isolation valve and is returned to the liquid recirculator. The residual liquid is separated from the gas in the recirculator and the gas is piped to the suction inlet on the compressors which elevate the temperature and pressure of the gas. The high pressure discharge from the compressors is sent to a water cooled evaporative condenser where the high pressure gas ammonia is liquefied and returned to the high pressure receivers. \n\n\n\nSystem 2\n\nHigh pressure liquid from the high pressure receiver is piped through a series of liquid feed solenoid valves, an expansion valve, and into a liquid recirculator. From there, low pressure liquid is pumped to each evaporator, where it passes through a solenoid valve, hand expansion valve and into evaporator. Low temperature liquid circulates through the evaporator. As heat is ab"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084245,
      "SummaryText": "sorbed, the liquid ammonia vaporizes to form low temperature and pressure gas which passes through an isolation valve and is returned to the liquid recirculator. The residual liquid is separated from the gas in the recirculator and the gas is piped to the suction inlet on the compressors which elevate the temperature and pressure of the gas. The high pressure discharge from the compressors is sent to a water cooled evaporative condenser where the high pressure gas ammonia is cooled, liquefied and returned to the thermosyphon vessel and then to the high pressure receiver.\n\n\n\nSafety Devices\n\nThe system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and pressure relief valves which vent to the atmosphere if the pressure in the system exceeds their set point. \n\nThere is one ammonia detector installed inside each refrigeration machinery room. One sensor is set at the OSHA permissible exposure limit of 50 ppm, which will activate an audible alarm/strobe and a call out. Also, the same ammonia detector is installed in each refrigerated area that provides monitoring.\n\nThe ammonia refrigeration system at Pitman Farms Norbest Division Moroni consists of vessels, equipment, and valves which are interconnected by piping. As such, the refrigeration system at Pitman Farms Norbest Division Moroni is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nNorbest Division Moroni has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the publ"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000084245,
      "SummaryText": "ic in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the Norbest Division Moroni facility is an integral part of the overall business and operates most of the year. The ammonia process contains a total charge of approximately 43,800 (LBS). It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep active records of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nNorbest Division Moroni has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\nNorbest Division Moroni's emergency action and response program has been developed to satisfy the following requirements:\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR ?1910.38\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Process Safety Management [Emergency Planning and Response Requirements]- Title 29 CFR ?1910.119(n)\n\n- USEPA Risk Management Program [Emergency Response Program Requirements] - Title 40 CFR ?68.95\n\n- Federal \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 29 CFR ?1910.120(q)\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nE"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000084245,
      "SummaryText": "very year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nNorbest Division Moroni has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Norbest Division Moroni continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Norbest Division Moroni's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Norbest Division Moroni's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nNorbest Division Moroni has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Norbest Division Moroni has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, Norbest Division Moroni now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Norbest Division Moroni employees, but allows for feedback and continual improvement. Through the RMP-PSM program Norbest Division Moroni will continue to maintain overall plant worker and public safety."
    }
  ]
}