{
  "FacilityID": 1017,
  "FacilityName": "City of Alma Water Treatment Plant",
  "FacilityStr1": "200 N. Lincoln",
  "FacilityStr2": null,
  "FacilityCity": "Alma",
  "FacilityState": "MI",
  "FacilityZipCode": "48801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26057",
  "LEPC": "Gratiot County LEPC",
  "FacilityLatDecDegs": "43.325",
  "FacilityLongDecDegs": "-84.665556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Alma",
  "OperatorStr1": "525 E. Superior",
  "OperatorStr2": "PO Box 278",
  "OperatorCity": "Alma",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48801",
  "OperatorZipCodeExt": null,
  "RMPContact": "William Pilmore",
  "RMPTitle": "Waterplant Superintendent",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000011541",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-11-08 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-10-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-10-11 00:00:00",
  "AnniversaryDate": "2004-05-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 43.37766,
  "FRS_Long": -84.66641,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1113,
      "AltID": "Chlorine",
      "FacilityID": 1017,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1132,
          "ProcessID": 1113,
          "NAICSCode": "99999",
          "_desc": {
            "NAICS_CODE": "99999",
            "NAICS_DESCRIPTION": "Unclassified Establishment"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1203,
          "ProcessID": 1113,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501203,
          "ProcessID": 1113,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1017,
      "SummaryText": "1. Accidental release prevention and emergency response policies:\n\nThe City of Alma Water Treatment Plant uses chlorine gas for the purpose of destroying disease causing organisms in the public water supply. The EPA has determined that chlorine is a potential hazard to the community as it relates to air quality when more than 2000 pounds are stored on site. Because of this risk it is necessary to observe safe operating and handling procedures, as well as test and maintain safety devices built into the system. Personnel assigned to handle chlorine storage tanks have attended training seminars related to proper handling procedures. Annual training is also given to all personnel in the use of a Self Contained Breathing Appratus ( Scott Air Pak) should it be needed for rescue or evacuation of the building. Procedures for evacuation and notification should a release occur are also discussed annually.\n\nThe staff of the Water Treatment Plant has made an effort to identify process risks over the years and provide reasonable solutions to minimize these risks. Recent improvements include installation of chlorine resistant exterior fiberglass doors in the chlorine room to help contain a release to the building. in 1994 the original pressure fed chlorinators were scrapped and a vacuum feed system put in its place. This system automatically shuts the chlorine feed valve off should a leak occur in the feed line. Air Quality monitoring devices are installed on the first and second floors of the building. Should a chlorine leak occur these devices activate an audio alarm in the building and a visual alarm outside the building in the form of a blinking red light. Routine maintenance and daily checks are made on thes devices to ensure their reliability. Should an accidental release occur it is the policy of the Water treatment Plant to evacuate the building and notify the local fire department to respond and control the leak.\n\n\n\n2. The stationary source and regulated substances handl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1017,
      "SummaryText": "ed.\n\nThe stationary source is the Water Treatment Plant located in a residential neighborhood at 200 N. Lincoln. Chlorine tanks are shipped to the plant by truck. The Maximum amount of chlorine stored in the building at any one time is 6 tons.\n\n\n\n3. The worst case release scenario and the alternative release, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nThe vulnerable zone for the City of Alma Water Plant was determined by a worse case scenario for a release of chlorine. Utilizing Risk Management Comp. Software, a worst case scenario would involve a complete release of 2000 pounds of chlorine within a 10 minute period. This release could potentially affect a downwind area of .9 miles. Since wind direction is indeterminate, a .9 mile radius around the facility which includes a population of appx. 9,000 people could be affected. It must be recognized that the actual area affected during a release would be dependent on many variables, including atmospheric conditions and release rate. It is the policy of the Water Plant to contain the leak to the chlorine room, no vents to the outside will be turned on while a risk to the community exists.\nAn alternative scenario was also calculated. Again using Risk Management Comp. Software, the alternative scenario would involve a complete release of 2000 pounds of chlorine through a .45 square inch hole in one hour. This would equate to shearing one of the valves off the tank. This release could potentially affect a downwind area of .1 miles. This scenario would be more likely to happen than the worst case scenario.\n\n\n4. The general accidential release prevention program and the specific prevention steps.\nThis facility complies with EPA's Risk Management Plan.\n\n\n5. Five year accident history.\nThe Water Treatment Plant has had no accidents to report in the last 5 years.\n\n\n6. The emergency response program.\nThis facilities emergency response program was developed using "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1017,
      "SummaryText": "the HAZ/MAT response planning workbook provided by the Emergency Management Division of the Michigan State Police.\n\n\n7. Planned changes to improve safety.\nTher are no planned changes to this facilities equipment or process at this time."
    }
  ]
}