{
  "FacilityID": 10200,
  "FacilityName": "Calsilite-Brunswick",
  "FacilityStr1": "2100 Line Street",
  "FacilityStr2": null,
  "FacilityCity": "Brunswick",
  "FacilityState": "GA",
  "FacilityZipCode": "31520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13127",
  "LEPC": "Brunswick-Glynn County LEPC",
  "FacilityLatDecDegs": "31.172222",
  "FacilityLongDecDegs": "-81.373056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Calsilite Manufacturing, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "RAYMOND GAUDIN",
  "OperatorStr1": "2100 LINE STREET",
  "OperatorStr2": null,
  "OperatorCity": "BRUNSWICK",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31520",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Riordan",
  "RMPTitle": "Safety Director",
  "FTE": 122,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014307",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": "3259-063-7602-0",
  "SafetyInspectionDate": "1998-03-10 00:00:00",
  "SafetyInspectionBy": "Office of Commissioner of Insurance - Safety Fire",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMPlanner",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-09-08 00:00:00",
  "DeRegistrationEffectiveDate": "1999-06-21 00:00:00",
  "AnniversaryDate": "2004-05-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 31.17222,
  "FRS_Long": -81.37306,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12724,
      "AltID": "PROPANE SUPPLY SYSTEM",
      "FacilityID": 10200,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13035,
          "ProcessID": 12724,
          "NAICSCode": "327992",
          "_desc": {
            "NAICS_CODE": "327992",
            "NAICS_DESCRIPTION": "Ground or Treated Mineral and Earth Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14523,
          "ProcessID": 12724,
          "ChemicalID": 98,
          "Quantity": 135000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514523,
          "ProcessID": 12724,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10200,
      "SummaryText": "\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Calsilite Group-Brunswick, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of substances regulated by EPA's RMP regulation\n *  A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  The certifications that EPA's RMP rule requires us to provide\n *  The detailed information (called data elements) about our risk management program\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility produces industrial insulation using a variety of chemicals and processing operations.  Our products consist of calcium silicate and expanded perlite shapes manufactured by mechanical press operations.  In our processes, we use the following chemicals that EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release:\n\nFlammables\n\nPROPANE as fuel for boilers\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPA's RMP rule requires that we provide information about the worst-case release scenario(s)"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10200,
      "SummaryText": " and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Release Scenario(s) - Regulated Flammable Chemicals\n\nRupture of 30,000 gallon propane storage with contents discharged within ten minutes and the vapor cloud is the ignited resulting in a vapor cloud explosion. The estimated exposure distance will be 0.41 miles in all directions from the plant. This will impact local businesses and residential housing in the area.\n \nAlternative Release Scenario(s) - Regulated Flammable Chemicals\n\nA rubber fuel transfer hose at the forklift tank filling station ruptures. The operator runs to get help which takes approximately 15 minutes. During this time a motor controller starts and ignites the vapor cloud.\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n *  Process safety information\n *  Process hazard analysis\n *  Operating procedures\n *  Training\n *  Mechanical integrity\n *  Compliance audits\n *  Incident investigation\n *  Contractors\n\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention. \n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10200,
      "SummaryText": "ses that occur at our facility. Calsilite-Brunswick is proud that the facility has not had an accidental chemical release in the past five years and will continue to maintain this record.\n\nEMERGENCY RESPONSE PROGRAM\n\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan.\n\n"
    }
  ]
}