{
  "FacilityID": 10297,
  "FacilityName": "Newton's Gas Company",
  "FacilityStr1": "70 Lee Court",
  "FacilityStr2": null,
  "FacilityCity": "Colchester",
  "FacilityState": "VT",
  "FacilityZipCode": "05446",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "50007",
  "LEPC": "Vermont District 1",
  "FacilityLatDecDegs": "44.594722",
  "FacilityLongDecDegs": "-73.184167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "George Newton",
  "OperatorStr1": "207 Riverside Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Burlington",
  "OperatorStateFIPS": "VT",
  "OperatorZipCode": "05401",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Thompson",
  "RMPTitle": "General Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000022511",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-07-31 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-10 00:00:00",
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 44.59473,
  "FRS_Long": -73.18592,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 12858,
      "AltID": "Propane Bulk Storage",
      "FacilityID": 10297,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13173,
          "ProcessID": 12858,
          "NAICSCode": "454312",
          "_desc": {
            "NAICS_CODE": "454312",
            "NAICS_DESCRIPTION": "Liquefied Petroleum Gas (Bottled Gas) Dealers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14700,
          "ProcessID": 12858,
          "ChemicalID": 98,
          "Quantity": 225000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514700,
          "ProcessID": 12858,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10297,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies:\n\nAt the bulk storage area, we handle propane which is a regulated flammable substance.  It is our policy at Newton's Gas  to provide propane to our customers in the safest possible manner.  We ensure safety to our staff, customers and community by having safety devices on our stationary and portable tanks and practicing safe handling procedures.  Our staff is well trained and experienced propane handlers.\n\nOur emergency response program consists of emergency action guides for our staff and the local fire department; notification procedures; first-aid and medical treatment information; and staff training.    Our notification procedures are in place to inform the Colchester Fire Department and immediate neighbors if there is a release.\n\n2.  About Propane and our Bulk Storage Facility:\n\nOur facility is in a sparsely populated area of Colchester, Chittenden County, Vermont.  We provide propane retail sales service to our local community and three neighboring counties. The propane is used by our customers as a fuel.  We have no customers who have more than 10,000 pounds at one time.  We receive propane by truck transports and store it in two 30,000 gallon storage tanks.  The maximum intended inventory of propane on site in the bulk tanks  is 225,000 pounds.  Propane is delivered to customers by bobtail trucks and service trucks.  Our facility has one bobtail loading and one transport unloading station.  This area is restricted to authorized personnel only by an industrial fence.  Our staff performs all filling and delivery operations.\n\n3.  Off-site Consequence Analysis:\n\nWorst-Case Scenario - Failure of the bulk tank would release a maximum of 110,000 pounds of propane.  Our policy limits the maximum filling capacity to 80%.  It is assumed that the entire contents are released as vapor and finds an ignition source.  The distance to the endpoint of 1 psi overpressure for the worst-case scenario is 0.4 mile"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10297,
      "SummaryText": ".  This distance extends beyond the boundaries of our facility and encompasses several residences, businesses, a day care center and a state road.\n\nAlternative Scenario - A hose rupture caused by a pull away when the driver of the bobtail or transport fails to disconnect the hoses before driving away.  A 4\" 25 feet liquid hose would release 69 pounds of propane.  If the vapor finds and ignition source and ignited, it would affect an area  0.03 mile radius from the tank.  The distance extends beyond the boundaries of our facility and encompasses  State Route 2 and Jasper Mine Road, but does not extend to our nearest neighbor.\n\n4.  Prevention Program:\n\nOur facility complies with EPA's Accidental Release Prevention Rule and with NFPA -58.  Our bulk storage tank and equipment was designed and constructed according to National Fire Protection Association [NFPA] code 58 and  is well maintained.  Our staff are trained on safe handling and emergency procedures.  Our safety information, operating procedures, training, and maintenance inspections are up-to-date.\n\n5. Accident History:\n\nWe have never had an accident at our facility.\n\n6.  Emergency Response Program:\n\nOur emergency response program consists of emergency action guides for our staff and the local fire department; notification procedures; first-aid and medical treatment information; and staff training.  The emergency action guides are based upon the safe response procedure recommendations from the National Propane Gas Association [NPGA] Safety Bulletins and the 1998 North American Field Response Guidebook.  Our notification procedures are in place to inform the Colchester Fire Department and immediate neighbors if there is a release.\n\n7.  Planned Changes to Improve Safety:\n\nWe are evaluating the recommendations from the hazards review and will implement our decisions by June 21, 1999.  Key upgrades include larger pipe support foundations  to deter frost heaving and  tank marking."
    }
  ]
}