{
  "FacilityID": 10323,
  "FacilityName": "Bitter Creek BG Mix Tank",
  "FacilityStr1": "NE1/4SE1/4, Sec. 10, T57N, R73W",
  "FacilityStr2": null,
  "FacilityCity": "Gillette",
  "FacilityState": "WY",
  "FacilityZipCode": "82716",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56005",
  "LEPC": "Campbell County LEPC",
  "FacilityLatDecDegs": "44.93825",
  "FacilityLongDecDegs": "-105.615861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Belle Fourche Pipeline Company",
  "Company2Name": null,
  "CompanyDUNS": 35993575,
  "Company2DUNS": null,
  "OperatorName": "Belle Fourche Pipeline Company",
  "OperatorStr1": "P.O. Drawer 2360",
  "OperatorStr2": null,
  "OperatorCity": "Casper",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82602",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000022664",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "1-30,000 gallon tank",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-12-20 00:00:00",
  "DeRegistrationEffectiveDate": "2010-12-14 00:00:00",
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.4",
  "FRS_Lat": 44.93825,
  "FRS_Long": -105.615861,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12891,
      "AltID": "BG Mix Tank 30,000 gal.",
      "FacilityID": 10323,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 14748,
          "ProcessID": 12891,
          "ChemicalID": 155,
          "Quantity": 100165.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 3815,
              "ProcessChemicalID": 14748,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13207,
          "ProcessID": 12891,
          "NAICSCode": "48611",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10323,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-06 00:00:00",
    "ERTrainingDate": "1999-05-26 00:00:00",
    "CoordinatingAgencyName": "Campbell Co. LEPC",
    "CoordinatingAgencyPhone": "3076867477",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10323,
      "SummaryText": "BELLE FOURCHE PIPELINE COMPANY\n\nEXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policy\n\nBelle Fourche Pipeline Company (BFPL) is committed to providing a safe, accident-free work environment.  A safe and accident free workplace is the result of diligent work and ongoing attention to all company policies.\n\nAll BFPL employees are knowledgeable of the safe work practices applicable to their area or job, and abide by them.  BFPL employees perform their work with maximum regard  for the safety of themselves, co-workers and the general public. \n\nRegulated Substances Handled\n\nThe 112(r) regulated flammable substance managed at this facility is BG mix. The regulated substance  is used as a viscosity reducer  at a breakout facility for a crude oil pipeline.  Approximately 30,000 gallons of BG mix is stored on-site.  \n\nWorst-Case Release Scenario\n\nThe worst-case release scenario was modeled using the EPA Offsite Consequence Analysis Model .  The model assumes the entire quantity of BG mix stored on-site is instantaneously consumed in a fireball tank explosion.  Results of the modeling indicate the worst-case endpoint distance (1 psi overpressure) is 0.37 miles and the distance to the nearest public receptor is ~.39 miles.  These findings indicate that given the rural nature of the facility and the lack of public or environmental receptors, the regulated process poses little risk to the general public or the environment in the event of fire or explosion.\n\nAccidental Release Prevention Program\n\nBFPL field personnel are provided various levels of training dependent on their overall job responsibilities. This training is conducted per the appropriate OSHA regulations, as are refresher classes.  Specific training programs may include respiratory protection, lockout/tagout procedures, personal protective equipment selection, worker right to know/hazard communication standard, hazardous waste operations and emergency response.  Additionally, personnel are kno"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10323,
      "SummaryText": "wledgeable as to the characteristics and hazards of  the flammable material stored at the facility, and any conditions likely to worsen emergencies such as weather or mechanical equipment failure.  BFPL employees know in the event an emergency is identified, the steps necessary to clearly communicate it to the BFPL qualified individual  and the necessary steps to control any accidental product release or to manage a fire or explosion.  BFPL employees are trained in the proper use of chemical extinguishers during the incipient stage of a fire. Inspections of the storage tank, fittings, lines etc. are performed during storage tank filling operations and as part of routine facility inspections by the BFPL personnel. \n\nFive-Year Accident History\n\nThis facility has not had any accidental releases of BG mix in the past five years.\n\nEmergency Response Program\n\nIn the event of  a large fire or explosion, either the qualified individual or dispatcher will immediately notify the appropriate county fire department and  Local Emergency Planning Commission (LEPC). In this case, BFPL will rely on the local emergency response agency to provide fire protection.  In the case of  an explosion, given the remoteness of  the facility, it is likely the facility will be consumed before response personnel could arrive.  \n\nDepending on the severity of the emergency situation, other procedures to be followed by the discovering employee(s) to mitigate the emergency may include:\n\n7 Stop the leak/release if it can be done safely without risk.\n7 If fire has occurred, let tank  burn unless leak can be safely stopped.\n7 Evacuate all nonessential personnel and secure all ignition sources.\n7 No road flares, smoking or other ignition flares allowed in hazard area.\n7 Isolate hazard area and limit entry to emergency responders. \n7 Stay upwind and uphill away from release.\n7 Remain in a safe location until the qualified individual arrives.  Direct and assist with any immediate response, containment, and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10323,
      "SummaryText": "equipment utilization.  Further secure the site from livestock and unauthorized persons.\n\nPlanned Changes in Safety Program\n\nGiven the remoteness of the facility, lack of proximal off-site receptors  and the excellent accident history that has been demonstrated over time, no specific changes in the BFPL safety program are planned.  However, routine training opportunities will continue to be provided to BFPL employees.  If in the future, new safety technology relating to the regulated process is developed,  installation of such technology will be further evaluated."
    }
  ]
}