{
  "FacilityID": 1047,
  "FacilityName": "Burris Refrigerated Logistics,     Chesapeake, Va.",
  "FacilityStr1": "1229 Fleetway Dr.",
  "FacilityStr2": "P.O. Box 6571",
  "FacilityCity": "Chesapeake",
  "FacilityState": "VA",
  "FacilityZipCode": "23323",
  "Facility4DigitZipExt": "1527",
  "FacilityCountyFIPS": "51550",
  "LEPC": "Chesapeake LEPC",
  "FacilityLatDecDegs": "36.791389",
  "FacilityLongDecDegs": "76.3775",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.burrisfoods.com",
  "FacilityEmailAddress": "info@burrisfoods.com",
  "FacilityDUNS": 75479931,
  "ParentCompanyName": "Burris Logistics",
  "Company2Name": "N/A",
  "CompanyDUNS": 75479931,
  "Company2DUNS": 0,
  "OperatorName": "Jim Stutz",
  "OperatorStr1": "1229 Fleetway Dr.",
  "OperatorStr2": "P.O. Box 6571",
  "OperatorCity": "Chesapeake",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23323",
  "OperatorZipCodeExt": "1527",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000001749",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-11-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-07-11 00:00:00",
  "DeRegistrationEffectiveDate": "2010-06-30 00:00:00",
  "AnniversaryDate": "2004-05-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 36.778,
  "FRS_Long": -76.37143,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility was sold on June 29, 2010 to CloverLeaf Cold Storage.",
  "_processes": [
    {
      "ProcessID": 1143,
      "AltID": "Anhdrous Ammonia",
      "FacilityID": 1047,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1232,
          "ProcessID": 1143,
          "ChemicalID": 56,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1162,
          "ProcessID": 1143,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 221,
              "Process_NAICS_ID": 1162,
              "SafetyReviewDate": "1998-08-01 00:00:00",
              "PHA_Date": "1998-08-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Refrigeration monitoring controls",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-08-01 00:00:00",
              "TrainingReviewDate": "1998-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-01 00:00:00",
              "EquipmentInspectionDate": "1998-12-01 00:00:00",
              "EquipmentTested": "Vessels / Compressors / System safety shutdowns",
              "ChangeMgmtDate": "1997-04-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-08-01 00:00:00",
              "PreStartupReviewDate": "1997-04-01 00:00:00",
              "ComplianceAuditDate": "1998-08-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-08-12 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-31 00:00:00",
              "ContractorSafetyReviewDate": "1998-08-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Process Hazzard Analysis",
              "_chemicals": [
                {
                  "PrimaryKey": 264,
                  "PreventionProgram3ID": 221,
                  "ProcessChemicalID": 1232
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1047,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-11-24 00:00:00",
    "ERTrainingDate": "1998-12-01 00:00:00",
    "CoordinatingAgencyName": "Virginia Emergency Response Council",
    "CoordinatingAgencyPhone": "8005350202",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1047,
      "SummaryText": "                                              EMERGENCY PLANNING AND RESPONSE\nPURPOSE:\nThe Plant  Emergency Organization (PEO)  addresses all emergency situations. Incorporated within the PEO are provisions determining who will respond to spills or planned small releases of ammonia and how they are  trained, equipped to respond, and how plant personal shall be protected.\n                                              \n                                                           Process Hazzard Analysis:\nTo ensure a controlled and safe workplace by identifying hazards.  This type of analysis applies to and is required for every hazardous (toxic & reactive) chemical listed in section 1910.119.\n\nProcess Hazard Analysis (PHA)  includes, but is not limited to the following items:\n\n1.  The hazards of each process; both chemical and mechanical hazards should be noted.\n\n2.  Identification/examples of previous incidents which did, or could have become, catastrophic.\n\n3.  The used or site available chemical detection methods.\n\n4.  Consequences of loss of system/process control.  Factors causing loss of control  include both operator and mechanical error/malfunction.\n\n                                                           REQUIREMENTS:\n\nI.  Employer shall perform an initial PHA on all ammonia equipment.  PHA's shall be done as soon as possible and in order of relative danger to personnel and equipment that a failure would cause.\n\nII.  The employer shall use one or more generally accepted methodologies to evaluate the process hazards: What If/Checklist, Hazard and Operability Study (HAZOP), Failure Mode and Effects Analysis (FMEA), Fault Tree Analysis, or other appropriate equivalent methodology.\n\nIII.  The PHA shall address:\n\nA.  Hazards of the process.\nB.  Identification of any previous incident which did or had a likely potential for causing catastrophic consequences in the workplace.\nC.  Engineering and administrative controls applicable to the process (controls, alarms, d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1047,
      "SummaryText": "etection equipment, etc.)\nD.  Consequences of failure.\nE.  Facility siting.\nF.  Human factors.\nG.  Qualitative evaluation of the range of safety and health effects of failure of controls.\n IV. PHA shall be performed by a team with expertise in engineering and process operating and the PHA methodology being used.\n\nV.  The employer shall promptly address the team's findings and recommendations and document actions taken or scheduled to be completed.  The employer shall communicate any changes to all affected employees and update any relevant information (operating procedures, training, etc., refer to Management of Change section).\n\nVI.  Review and update PHA for the entire system on a regular basis.\n\nVII.  Retain PHA information and updates along with all supporting documentation for the life of the process.\n\n                                               PROCESS HAZARD ANALYSIS\n                                                 Content of Hazard Analysis\n\n   A process hazard analysis comprises three parts: 1) preparation (Operating Procedures, \nP & ID's, PSI, etc.), 2) conducting the hazard analysis (PHA Worksheet), and 3) follow-up actions resulting from the hazard analysis (PHA Action Items).\n\n   The preparatory phase for a process hazard analysis requires the gathering of date, drawings, procedures and formation of a team.  Typically, each of the acceptable methods will require up-to-date process flow diagrams, piping and instrumentation drawings, and data regarding process materials and conditions.  Certain hazard analysis techniques may require additional, more detailed materials.\n\n   The hazard analysis is conducted with the clear goal of identifying potential hazards.  Recommendations may be made with the intent of reducing or eliminating a potential hazard .  Items of concern also may be identified for further, more detailed study.\n\n     The follow-up phase involves evaluating the proposed recommendations to determine the appropriate course of action. the actio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1047,
      "SummaryText": "n taken may include:\n\n17accepting and implementing the recommendations as made;\n\n27accepting  the recommendations in principle but developing an alternative approach to meet the intent; or\n\n37accepting the current situation and not implementing the recommendation.  The current situation may be the course of action taken if there appears to be no technically feasible solution for the situation identified, if any recommendation considered would pose additional, more serious hazards, or if it is determined that the reduction in risk is not significant enough to justify implementing any recommendation.  Implementing engineering and/or administrative controls may be used to reduce the risk of hazard.\n\nFurther study may be required to determine if certain hazards identified are indeed significant to exposed workplace employees.  This further study initially may require a more detailed hazard analysis, possibly with a different technique from the group of approved methods, followed by a consequence analysis that will more precisely evaluate the consequences of the potential hazards.\n\nThe type of consequence analysis required will depend upon the identified potential hazards.  For example, hazard involving fires may require evaluation of thermal radiation effects, where toxic release may require the use of vapor dispersion models along with toxicology effect models.\n\nThe follow-up phase of a process hazard analysis is often an iterative process whereby the hazard analysis and/or consequence evaluations are redone as required to ensure that potential hazards are minimized.\n                                             PROCESS HAZARD ANALYSIS\n                                                      Analysis Findings\n\n   After a study has been conducted, the findings and recommendations of the study must be addressed.  For this to be done systematically, a system should be established that covers the following:\n\n17ensures that each recommendation is resolved in a timely manner and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1047,
      "SummaryText": " that the resolution is documented;\n\n27documents the proposed remedial measures or actions undertaken with respect to their recommendations;\n\n37completes actions as soon as possible;\n\n47develops a written schedule of when these actions are to be completed; and\n\n57informs operating, maintenance and other employees who may be effected by the identified potential hazards and the recommendations and/or actions taken.\n\n       Recommendations often are made in a hazard that require more detailed evaluation.  Additional engineering or procedural review may determine that the recommendations are not feasible, are not desirable, or that other, more appropriate changes should be made.  Such determinations do not invalidate the study, but must be weighed carefully in light of the identified potential hazard.  All decisions regarding recommendation, and whether to implement them, should be fully documented.  Such documentation should include the decision, reasons for the decision, planned implementation and final completion dates.  Unnecessary questions of liability may arise if an incident occurs regarding a recommendation that was not implemented, without proper review and documentation to justify the decision.\n\n   OSHA has said that when responding to the team's findings and recommendations, the employer retains the flexibility to not only reject proposals that are erroneous or infeasible, but also to modify a recommendation that may not be as protective as possible or may be no more protective than a less complex or expensive measure.  OSHA's position is that an employer is required to implement the team's findings and recommendations except to the extent an employer can document that an alternative will be at least as effective or efficient in addressing the safety concerns.\n\n     Once action has been taken based upon the recommendations, resulting in either process modifications, new or revised procedures, or both, employees who work in the facility should be properly inf"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1047,
      "SummaryText": "ormed of these changes.  This communication may be handled as part of the standard's requirements for refresher training.\n\n   Once proposed, evaluated and determined appropriate, recommendations should be implemented in a timely fashion.  Recommendations that can be implemented without major shutdowns of the process should be done at the earliest opportunity.  Recommendations that require a facility shutdown may need to wait until the next scheduled process turnaround.  In establishing a schedule for implementation, consideration should be given to the likelihood and severity of the potential hazard.  Recommendations associated with high likelihood and/or severity scenarios should be given a higher priority than recommendations associated with less hazardous scenarios.Regulated Substance Handled\n\n     Burris Refrigerated Logistics (Chesapeake, Va.) located in the Cavalier Industrial Park. Is a public cold storage / frozen food facility. The prime Refrigerant used is Anhydrous Ammonia in a closely controlled and monitored environment. The Refrigeration system is Computer controlled with built in safeguards which is monitored 24 hrs a day, 365 days a year. The facility has personal \"on call\" at all times that are trained and qualified to handle any emergency situation that may arise. The system is monitored in each Room that the process takes place by a computer linked detection system. The machine room, where the compressors and vessels are located has an automatic venting system that incorporates a water curtain should an incident occur.\n     Ammonia is a self-alarming substance with a distinctive pungent odor. Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations (these concentrations would not result in health risks). The Department of Transportation classifies ammonia as a non-flammable. Ammonia will burn however, but only in a very narrow and high range of concentration with high temperature. \n     The"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1047,
      "SummaryText": " U.S. Occupational and Health Administration (OSHA) has made a determination on the permissible exposure of ammonia to people. The maximum allowable exposure for eight hours is 50 PPM (parts per million). \n\n\nWorst case Scenario\n\n     The worst case scenario of ammonia spill at the Chesapeake VA. facility was chosen to be a vessel rupture. We have conducted our own modeling as guidance for this report. The RMP Ammonia Program Plan document was closely followed to ensure compliance.\n     As a result we have found that should a catastrophic incident occur. There would be no private residences in the areas of release.\nThe businesses that would be effected in the industrial park are on a \"call list\" and would be contacted by a designated person if an emergency would occur during normal business hours. The worst case release of Anhydrous Ammonia would come from a rupture of the high pressure vessel that is located in the machine room. The amount of the release in the study was 3,000 pounds. The release rate is 300 pounds of ammonia in a ten-minute period. With a 1.5 MPH wind. The distance to the end point equals 1 mile. There are no Schools, Residences, Hospitals, Prisons, or Recreation areas within the scope of this model. There are however, Office and industrial Buildings in the effected area. Along with the consideration to public receptors. Environmental considerations are. National and state parks, wildlife sanctuaries, and federal wilderness areas.  None of the Environmental Considerations listed above are a factor in this report. \n\n\n                                                                Alternative release Scenario\n\n     The alternative release scenario of Anhydrous Ammonia at the Chesapeake VA. Facility was chosen to be a rupture from a pipe. We have conducted our own modeling as guidance for this report using the same guidelines as in the Worst case scenario. \n     The conciliation of this study has found the same results as in the Worst case scenario. T"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1047,
      "SummaryText": "he amount of release that is used is one pound. The rate of release is .1 lbs./min. And the release duration is 25 minutes. The wind speed is 1.5 MPH. This resulted in an endpoint of contaminated area of .10 mile. \n    The type of mitigation that would be used is as follows: \n1. Sprinkler Systems\n2. Water Curtain\n3. Neutralization\n4. Emergency Shutdown Systems\n\n\n\n\n                                                             Five Year History\n\n     Due to our planned maintenance system, An Audit that is conducted quarterly by Corporate Engineering, And the knowledge and training of the engineering department at Burris Refrigerated Logistics, Chesapeake, VA. There have been no accidental releases of Anhydrous Ammonia from this location in the past five years. Or since the facility was opened in 1991.\n\n\n                                                     Emergency response Program\n\n     The emergency response program at this facility is a current and ongoing process.\n1.  Evacuation drills are conducted semi-annually. This requires the participation of all employees.\n2.  Engineering personal are being sent to a hazardous response school that is dedicated to Ammonia spills and cleanup annually.  \n3.  The Local Hazardous Materials team. Connected with the Fire department have a yearly walk through.\n4.  The call list to surrounding businesses along with the designated person to make the calls is in place.\n5.  Alarms and automated computer controlled safety's are in place.\n\n\n                                            Planned Changes to Improve Safety\n\n     Since Safety is an ongoing concern at Burris Refrigerated Logistics. We are doing all that we can to keep our employees current and up to date with any new laws or procedures that become effective. Keeping the \"information highway\" open is the best way we feel to stay current with any new laws or new ideas that an employee may have to improve safety.RMP Executive Summary \nBurris Refrigerated Logistics, \nChesapeake, Virg"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1047,
      "SummaryText": "inia\n\n\n\nRegulated Substance Handled\n\n     Burris Refrigerated Logistics (Chesapeake, Va.) located in the Cavalier Industrial Park. Is a public cold storage / frozen food facility. The prime Refrigerant used is Anhydrous Ammonia in a closely controlled and monitored environment. The Refrigeration system is Computer controlled with built in safeguards which is monitored 24 hrs a day, 365 days a year. The facility has personal \"on call\" at all times that are trained and qualified to handle any emergency situation that may arise. The system is monitored in each Room that the process takes place by a computer linked detection system. The machine room, where the compressors and vessels are located has an automatic venting system that incorporates a water curtain should an incident occur.\n     Ammonia is a self-alarming substance with a distinctive pungent odor. Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations (these concentrations would not result in health risks). The Department of Transportation classifies ammonia as a non-flammable. Ammonia will burn however, but only in a very narrow and high range of concentration with high temperature. \n     The U.S. Occupational and Health Administration (OSHA) has made a determination on the permissible exposure of ammonia to people. The maximum allowable exposure for eight hours is 50 PPM (parts per million). \n\n\nWorst case Scenario\n\n     The worst case scenario of ammonia spill at the Chesapeake VA. facility was chosen to be a vessel rupture. We have conducted our own modeling as guidance for this report. The RMP Ammonia Program Plan document was closely followed to ensure compliance.\n     As a result we have found that should a catastrophic incident occur. There would be no private residences in the areas of release.\nThe businesses that would be effected in the industrial park are on a \"call list\" and would be contacted by a designated person if an emergency would"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1047,
      "SummaryText": " occur during normal business hours. The worst case release of Anhydrous Ammonia would come from a rupture of the high pressure vessel that is located in the machine room. The amount of the release in the study was 3,000 pounds. The release rate is 300 pounds of ammonia in a ten-minute period. With a 1.5 MPH wind. The distance to the end point equals 1 mile. There are no Schools, Residences, Hospitals, Prisons, or Recreation areas within the scope of this model. There are however, Office and industrial Buildings in the effected area. Along with the consideration to public receptors. Environmental considerations are. National and state parks, wildlife sanctuaries, and federal wilderness areas.  None of the Environmental Considerations listed above are a factor in this report. \n\n\nAlternative release Scenario\n\n     The alternative release scenario of Anhydrous Ammonia at the Chesapeake VA. Facility was chosen to be a rupture from a pipe. We have conducted our own modeling as guidance for this report using the same guidelines as in the Worst case scenario. \n     The conciliation of this study has found the same results as in the Worst case scenario. The amount of release that is used is one pound. The rate of release is .1 lbs./min. And the release duration is 25 minutes. The wind speed is 1.5 MPH. This resulted in an endpoint of contaminated area of .10 mile. \n    The type of mitigation that would be used is as follows: \n1. Sprinkler Systems\n2. Water Curtain\n3. Neutralization\n4. Emergency Shutdown Systems\n\n\n\n\nFive Year History\n\n     Due to our planned maintenance system, An Audit that is conducted quarterly by Corporate Engineering, And the knowledge and training of the engineering department at Burris Refrigerated Logistics, Chesapeake, VA. There have been no accidental releases of Anhydrous Ammonia from this location in the past five years. Or since the facility was opened in 1991.\n\n\nEmergency response Program\n\n     The emergency response program at this facility is "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1047,
      "SummaryText": "a current and ongoing process.\n? Evacuation drills are conducted semi-annually. This requires the participation of all employees.\n? Engineering personal are being sent to a hazardous response school that is dedicated to Ammonia spills and cleanup annually.  \n? The Local Hazardous Materials team. Connected with the Fire department have a yearly walk through.\n? The call list to surrounding businesses along with the designated person to make the calls is in place.\n? Alarms and automated computer controlled safety's are in place.\n\n\nPlanned Changes to Improve Safety\n\n     Since Safety is an ongoing concern at Burris Refrigerated Logistics. We are doing all that we can to keep our employees current and up to date with any new laws or procedures that become effective. Keeping the \"information highway\" open is the best way we feel to stay current with any new laws or new ideas that an employee may have to improve safety.RMP Executive Summary \nBurris Refrigerated Logistics, \nChesapeake, Virginia\n\n\n\nRegulated Substance Handled\n\n     Burris Refrigerated Logistics (Chesapeake, Va.) located in the Cavalier Industrial Park. Is a public cold storage / frozen food facility. The prime Refrigerant used is Anhydrous Ammonia in a closely controlled and monitored environment. The Refrigeration system is Computer controlled with built in safeguards which is monitored 24 hrs a day, 365 days a year. The facility has personal \"on call\" at all times that are trained and qualified to handle any emergency situation that may arise. The system is monitored in each Room that the process takes place by a computer linked detection system. The machine room, where the compressors and vessels are located has an automatic venting system that incorporates a water curtain should an incident occur.\n     Ammonia is a self-alarming substance with a distinctive pungent odor. Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations (these concentration"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1047,
      "SummaryText": "s would not result in health risks). The Department of Transportation classifies ammonia as a non-flammable. Ammonia will burn however, but only in a very narrow and high range of concentration with high temperature. \n     The U.S. Occupational and Health Administration (OSHA) has made a determination on the permissible exposure of ammonia to people. The maximum allowable exposure for eight hours is 50 PPM (parts per million). \n\n\nWorst case Scenario\n\n     The worst case scenario of ammonia spill at the Chesapeake VA. facility was chosen to be a vessel rupture. We have conducted our own modeling as guidance for this report. The RMP Ammonia Program Plan document was closely followed to ensure compliance.\n     As a result we have found that should a catastrophic incident occur. There would be no private residences in the areas of release.\nThe businesses that would be effected in the industrial park are on a \"call list\" and would be contacted by a designated person if an emergency would occur during normal business hours. The worst case release of Anhydrous Ammonia would come from a rupture of the high pressure vessel that is located in the machine room. The amount of the release in the study was 3,000 pounds. The release rate is 300 pounds of ammonia in a ten-minute period. With a 1.5 MPH wind. The distance to the end point equals 1 mile. There are no Schools, Residences, Hospitals, Prisons, or Recreation areas within the scope of this model. There are however, Office and industrial Buildings in the effected area. Along with the consideration to public receptors. Environmental considerations are. National and state parks, wildlife sanctuaries, and federal wilderness areas.  None of the Environmental Considerations listed above are a factor in this report. \n\n\nAlternative release Scenario\n\n     The alternative release scenario of Anhydrous Ammonia at the Chesapeake VA. Facility was chosen to be a rupture from a pipe. We have conducted our own modeling as guidance for thi"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1047,
      "SummaryText": "s report using the same guidelines as in the Worst case scenario. \n     The conciliation of this study has found the same results as in the Worst case scenario. The amount of release that is used is one pound. The rate of release is .1 lbs./min. And the release duration is 25 minutes. The wind speed is 1.5 MPH. This resulted in an endpoint of contaminated area of .10 mile. \n    The type of mitigation that would be used is as follows: \n1. Sprinkler Systems\n2. Water Curtain\n3. Neutralization\n4. Emergency Shutdown Systems\n\n\n\n\nFive Year History\n\n     Due to our planned maintenance system, An Audit that is conducted quarterly by Corporate Engineering, And the knowledge and training of the engineering department at Burris Refrigerated Logistics, Chesapeake, VA. There have been no accidental releases of Anhydrous Ammonia from this location in the past five years. Or since the facility was opened in 1991.\n\n\nEmergency response Program\n\n     The emergency response program at this facility is a current and ongoing process.\n? Evacuation drills are conducted semi-annually. This requires the participation of all employees.\n? Engineering personal are being sent to a hazardous response school that is dedicated to Ammonia spills and cleanup annually.  \n? The Local Hazardous Materials team. Connected with the Fire department have a yearly walk through.\n? The call list to surrounding businesses along with the designated person to make the calls is in place.\n? Alarms and automated computer controlled safety's are in place.\n\n\nPlanned Changes to Improve Safety\n\n     Since Safety is an ongoing concern at Burris Refrigerated Logistics. We are doing all that we can to keep our employees current and up to date with any new laws or procedures that become effective. Keeping the \"information highway\" open is the best way we feel to stay current with any new laws or new ideas that an employee may have to improve safety."
    }
  ]
}