{
  "FacilityID": 1051,
  "FacilityName": "PSO Southwestern Station",
  "FacilityStr1": "PSO Road #1",
  "FacilityStr2": null,
  "FacilityCity": "Anadarko",
  "FacilityState": "OK",
  "FacilityZipCode": "73005",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40015",
  "LEPC": "Anadarko Fire Department",
  "FacilityLatDecDegs": "35.105833",
  "FacilityLongDecDegs": "-98.339444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.csw.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Public Service Company of Oklahoma",
  "Company2Name": "Central and South West",
  "CompanyDUNS": 7907926,
  "Company2DUNS": 6918809,
  "OperatorName": "Public Service of Oklahoma",
  "OperatorStr1": "PO Box 201",
  "OperatorStr2": "212 E 6th    zip 74119",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74102",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Quaid",
  "RMPTitle": "Plant Manager",
  "FTE": 34,
  "OtherEPAFacilityID": "OKD000763797",
  "EPAFacilityID": "100000012345",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-07-23 00:00:00",
  "DeRegistrationEffectiveDate": "2001-07-20 00:00:00",
  "AnniversaryDate": "2004-05-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 35.10583,
  "FRS_Long": -98.33944,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1147,
      "AltID": "Water Treatment",
      "FacilityID": 1051,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1166,
          "ProcessID": 1147,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1236,
          "ProcessID": 1147,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501236,
          "ProcessID": 1147,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1051,
      "SummaryText": "RMP DATA ELEMENT - Executive Summary\n\nPSO Southwestern Power Station\n\nSouthwestern Power Station is a gas fueled power generating station in the Public Service Company of Oklahoma (PSO) subsidiary, which includes a total of six generating facilities located in Oklahoma. This site is located in Caddo County in the city of Anadarko, Oklahoma. The facility has 34 full time employees.\n\nPublic Service Company of Oklahoma (PSO) is an investor-owned utility. The company's common stock is held by Central and South West Corporation, a registered public holding company headquartered in Dallas, Texas and Tulsa, Oklahoma.\n\nThe facility is a three-unit power generation facility with a total generation of  approximately 475 mw.  It burns gas as the primary fuel and fuel oil in emergencies.  Units 1, 2 and 3 are Westinghouse turbines with a Babcock and Wilcox boilers installed in 1952, 1954 and 1967. In addition to the three units, a diesel unit was added in 1966. \n\nThe following information is part of a complete Risk Management Plan (RMP) that was prepared for the PSO Southwestern Power Station outside of Anadarko, Oklahoma.  The information includes accident prevention and safety programs, emergency preparedness and response programs, chemical description, five year accidental release history, alternative release scenario and the worst case scenario.  The sharing of this type of information is a means to improve community safety, not a prediction of the probability that either a worst case or more likely scenario would ever occur.  These scenarios are estimates required by the Environmental Protection Agency and are used to illustrate the importance for risk reduction, safety, prevention and emergency preparedness and response.\n\nSouthwestern Power Station has been producing electricity for over 45 years. During this time, there has not been any chlorine release that adversely impacted the plant or the surrounding community.\n\nThe release scenarios, a worst case scenario and an al"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1051,
      "SummaryText": "ternative release scenario, are designed to be exercises which calculate the potential impact on the community, based upon extreme conditions, defined by the Environmental Protection Agency (EPA).  A worst case scenario is defined as the complete release of the largest inventory of the chemical over 10 minutes under weather conditions that would allow the chemical to travel as far as possible.  The distance(s) used in this plan are from the EPA Offsite Consequence Analysis Guide (May 1996). It also assumes that none of the site's mechanical controls or safety systems are operational for this theoretical exercise. However, the laws of physical science do not allow a complete release of the chemical as described in the worst case scenario.\n\nThe worst case scenario for Southwestern Power Station involves a cylinder containing 2,000 pounds of chlorine. The entire quantity is released and vaporizes over a 10 minute period and the resulting vapor cloud travels down wind.  A level of concern to the community extends 7.4 miles down wind. \n\nGiven these unrealistic guidelines of a worst case scenario, more realistic scenarios or alternative release scenarios were also developed. These scenarios involve smaller releases and allow a site's safety systems to work.  The alternative release scenario may be used by local government and industry to prepare emergency response plans.\n\nThe alternative release scenario for the Welsh Power Plant involves 33 pounds of chlorine released in 60 minutes from a <-inch pigtail or similar connection. The resulting cloud extends 0.68 miles down wind.\n\nPSO's chlorinating systems are built and installed with safety controls designed to prevent accidental releases. Some of the typical safety equipment and systems used at the plant include:\n7 Storage cylinders meeting American Society of Mechanical Engineering requirements\n7 Automatic shut-off devices\n7 Interlocks and relief valves\n7 Specifically designed pressure gauges, fittings, connections, tubin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1051,
      "SummaryText": "g and piping.\n \n Plant employees, including plant operators, electricians, mechanics, and laboratory technicians, receive training in the operation and maintenance of the chlorination system. This training includes emphasis on:\n7 Specific safe work practices\n7 Routine operating procedures\n7 Audit and inspection procedures\n7 Emergency operation including shut down\n7 Alarms and emergency notification procedures.\n \n PSO has an established Preventative Maintenance Procedure specifically developed for the chlorination system. This procedure requires:\n7 Periodic inspection and testing of all mechanical systems \n7 Detailed documentation of all inspection and maintenance activity\n7 Documentation of equipment deficiencies\n7 Timely and appropriate repair of all deficiencies.\n \n A Process Safety Management System has been specifically developed for the chlorination system at this plant in compliance with the Occupational Safety and Health Act Process Safety Management rule. This management system requires:\n7 An initial and periodic analysis of engineering and administrative controls\n7 Investigation procedures designed to resolve and correct potential incidents\n7 Formal audits performed by trained individuals with knowledge of chlorination systems.\n \n All Plant personnel handling chlorine are specially trained. This training includes:\n7 Emergency shutdown\n7 Emergency operation of the chlorinator\n7 Hazards of chlorine\n7 Safety procedures to be followed during normal operations\n7 Emergency Response Procedures\n7 Notification procedures\n7 Evacuation procedures.\n Periodic inspection of the equipment is mandatory. Repairs are required on all items identified as defective during inspections.\n \n If a release occurs, only trained Emergency Response Personnel will respond to assess and stop the leak. In all cases, necessary actions will be taken to control the release of chlorine.\n7 The Plant Control Room will be notified immediately if a chlorine leak is detected.\n7 Control Room personn"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1051,
      "SummaryText": "el will coordinate emergency response procedures.\n7 Emergency response procedures may include:\n7 Notification of authorities\n7 Evacuation of plant personnel\n7 Evacuation of public\n7 Notification of plant and/or company managers.\n\nPublic Service Company of Oklahoma is committed to providing electricity. We understand our responsibility to follow federal, state and local regulations in the most effective manner possible. PSO is doing its part to provide a safe environment for the residents in our community."
    }
  ]
}