{
  "FacilityID": 10540,
  "FacilityName": "ITW Dymon",
  "FacilityStr1": "805 East Old 56 Highway",
  "FacilityStr2": null,
  "FacilityCity": "Olathe",
  "FacilityState": "KS",
  "FacilityZipCode": "66061",
  "Facility4DigitZipExt": "4914",
  "FacilityCountyFIPS": "20091",
  "LEPC": "Johnson County LEPC",
  "FacilityLatDecDegs": "38.866944",
  "FacilityLongDecDegs": "-94.801111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "www.dymon.com",
  "FacilityDUNS": 67952994,
  "ParentCompanyName": "Illinois Tool Works Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5146428,
  "Company2DUNS": 0,
  "OperatorName": "Ken Hedden",
  "OperatorStr1": "P.O. Box 340",
  "OperatorStr2": null,
  "OperatorCity": "Olathe",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66051",
  "OperatorZipCodeExt": "0340",
  "RMPContact": "David Jones",
  "RMPTitle": "Manager of Regulatory Affairs",
  "FTE": 132,
  "OtherEPAFacilityID": "66061DYMNN805EA",
  "EPAFacilityID": "100000049164",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0910126",
  "SafetyInspectionDate": "1999-04-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.86739,
  "FRS_Long": -94.8094,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13388,
      "AltID": "aerosol propellant charge",
      "FacilityID": 10540,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13713,
          "ProcessID": 13388,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 15656,
          "ProcessID": 13388,
          "ChemicalID": 107,
          "Quantity": 57300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15657,
          "ProcessID": 13388,
          "ChemicalID": 98,
          "Quantity": 59700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 515656,
          "ProcessID": 13388,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 515657,
          "ProcessID": 13388,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 13389,
      "AltID": "aerosol warehouse",
      "FacilityID": 10540,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 13714,
          "ProcessID": 13389,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 15658,
          "ProcessID": 13389,
          "ChemicalID": 107,
          "Quantity": 26600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15659,
          "ProcessID": 13389,
          "ChemicalID": 98,
          "Quantity": 10200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 515658,
          "ProcessID": 13389,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 515659,
          "ProcessID": 13389,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10540,
      "SummaryText": "EXECUTIVE SUMMARY\n\nITW Dymon operates a industrial/institutional maintenance product manufacturing facility in the south part of Olathe Kansas.   The facility is located just south of East Old 56 Highway, and approximately < mile west of Interstate 35, and has been at this location for approximately 2 years.  The nature of our business involves blending chemical raw materials at ambient temperature and pressure to form maintenance products for commercial distribution.  Some of the products we manufacture are packaged in hand held aerosol spray containers.  Our facility's aerosol propellant system stores approximately 26,500 gallons of liquefied propane and isobutane gas for use as propellant.  The propellant storage and charging equipment constitute a Program Level 3 process for purposes of complying with the RMP regulatory requirements.\n\nIn addition to the propellant storage and charging process, we also have a warehouse area which is dedicated to storage of aerosol products.  This is a specially caged area (with ceiling to floor chain link fence) along our facility main building's southeast corner.  This area stores only hand held aerosol spray cans, the largest of which contains approximately 1.5 pounds of propellant and product.  This area has the capacity to hold 36,800 pounds of propane and isobutane propellant, and frequently holds in excess of 10,000 pounds of propane alone.  The finished aerosol product storage area constitutes a Program Level 1 process for purposes of complying with the RMP regulatory requirements. \n\nThe horizontal storage aboveground pressure vessels (APVs), referred to as A-49 and A-110 and located southwest of the main facility structure, are used to store the isobutane and popane.  One of these APVs (A-110) holds a maximum quantity of  approximately 10,600 gallons of propane.  The other APV (A-49) holds a maximum quantity of approximately 15,900 gallons of a mixture of propane and isobutane.\n\nITW Dymon is committed to maintaining our p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10540,
      "SummaryText": "ropellant storage and charging equipment in safe condition, and to providing our personnel with training in safe operating practices.  This facility has never had an accidental release of propane or isobutane from our facility which resulted in adverse health effects to the public or to our employees, or to damage to property.           \n \n                           \nWORST CASE SCENARIO; PROPELANT STORAGE AND CHARGING\n                                                                                                                                                               \nThe maximum on-site inventory, in APVs A-49 and A-110, of isobutane and propane at the Olathe ITW Dymon facility is approximately 117,000 pounds.  This quantity is unlikely to ever be reached, because of staggered deliveries of the two propellant materials.  For the worst case scenario analysis, the maximum contents of the vessel capable of containing the greatest quantity of either or both of the materials must be assumed to be catastrophically released, if detonation of the resulting vapor cloud results in the farthest possible endpoint determination for the facility.    \n\nVessel A-49 contains approximately 72,600 pounds of the gases, existing as a mixture (23%/77% propane/isobutane).  The EPA requires that this maximum quantity be considered released in a 10 minute period in order to calculate the worst case scenario.  \n\nEPA has developed a simple model for estimating the endpoints, and provided equations on which the model is based as well as example calculations.  Using the same equations developed for the mixture of propane and isobutane, results in an endpoint of 0.3 miles from the APVs.\n\n\nWORST CASE SCENARIO; FINISHED AEROSOL PRODUCT STORAGE\n\nThe maximum on-site inventory of propane and isobutane in the finished aerosol product warehouse area is 36,800 pounds.  There is normally in excess of 10,000 pounds of isobutane stored in this area (maximum possible = 26,600 pounds), and there coul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10540,
      "SummaryText": "d potentially be greater than 10,000 pounds of propane (maximum possible = 10,200 pounds).  For the worst case scenario analysis, the maximum contents of the vessel capable of containing the greatest quantity of either or both of the materials must be assumed to be catastrophically released, if detonation of the resulting vapor cloud results in the farthest possible endpoint determination for the facility.    \n\nNone of the aerosol finished product containers holds in excess of 1.5 pounds of product and propellant combined.  Should one of these containers be assumed to suddenly release 1 pound of propellant, a subsequent detonation would result in a distance to endpoint of only 3 feet, using EPA's modelling equation.  This distance to endpoint does not reach any points off-site. \n\n  \nALTERNATE SCENARIO\n                                                                                                                                                          \nThe alternative release scenario should reflect an incident that has occurred, or potentially could occur, at ITW Dymon's facility.  In addition, EPA guidance documents state that the scenario should:\n\n7 Be more likely to occur than the worst case scenario, and,\n\n7 Result in a distance to the endpoint exceeding the distance to the facility boundary, unless no such scenario exists.\n\nThe alternative scenario for the Olathe facility is the rupture of the 1 1/4 inch diameter pump discharge piping leading form A-49 to the gashouse.  This scenario is probably more likely to occur than the worst case scenario, and compared to other realistic alternative scenarios, would be relatively likely to result in the maximum (greatest distance to endpoint).  \n\nThere is an excess flow valve in the liquid transfer line, with a rated capacity of 100 gallons per minute (gpm).  A leak of 95 gpm would not activate th excess flow valve.  In this scenario, the manual shutoff valve would need to be closed in order to terminate the release of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10540,
      "SummaryText": "liquid propane from a rupture in the pump discharge piping.  To complete the scenario, it is assumed that an employee in the parking lot behind the main facility notices the leak soon after it begins.  The employee enters the maintenance department (located in the southwest corner of the building) and notifies a maintenance employee of the leak.  The head of maintenance is immediately paged, then the maintenance employee who was first told of the leak proceeds to the tank farm.  \n\nAfter making sure there are no more employees in the parking lot, the maintenance employee closes the manual shutoff valve.  In the scenario, from the time the leak began till the shutoff valve was closed, approximately six minutes elapse.   The amount of propane released would equal the time of the leak multiplied by the leak rate, or approximately 500 gallons.  Assuming that all the released material rapidly forms a vapor cloud within the lower and upper explosive concentration limits, and detonates with a 10% yield factor, the endpoint would be 0.1 mile from the APV.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nOur Safety Team, our Plant Maintenance Supervisor, and all our employees are dedicated to maintaining our propellant storage and charging system in a safe manner.  We have clear lines of authority and responsibility with respect to all aspects of our release prevention program, leading directly to the Department Manager, the Maintenance Manager and the Safety Director.  We maintain current safety information on propane and isobutane, and our propellant charging equipment, and review any potential hazards that may be associated with the storage and potential use of the propellants at our facility.  In addition, we train both our operating and maintenance personnel in our procedures and safe practices.  New employees are trained before being allowed to work alone, and periodic refresher training is provided to all employees.  Any time significant changes occur in equipment or "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10540,
      "SummaryText": "processes which could potentially impact the storage or use of propellant, affected employees are retrained.  We inspect and audit our facility, using both in house staff and trained professionals from outside our company.\n \n\nEMERGENCY RESPONSE\n\nBecause propane and isobutane are flammable substances above EPA's CAA Risk Management Program threshold quantity, the ITW Dymon Olathe facility is required to 1) develop an emergency response program including a written emergency response plan; or 2) coordinate response actions with the Olathe, Kansas Fire Department.  \n\nThe Olathe facility employees are not qualified to respond to an uncontrolled or catastrophic release of propane or isobutane.  The Safety Director has notified the Olathe Fire Department's Hazardous Materials Unit that in the event of a release where potentially catastrophic amounts of propane are released, facility personnel will be instructed to leave the facility, and a 24 hour emergency response contractor will be notified, in addition to 911."
    }
  ]
}