{
  "FacilityID": 10552,
  "FacilityName": "Baker Petrolite Corporation - Barnsdall, OK",
  "FacilityStr1": "820 S. Birch Lake Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Barnsdall",
  "FacilityState": "OK",
  "FacilityZipCode": "74002",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40113",
  "LEPC": "Osage County LEPC",
  "FacilityLatDecDegs": "36.558333",
  "FacilityLongDecDegs": "-96.158333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 72415037,
  "ParentCompanyName": "Baker Hughes",
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": null,
  "OperatorName": "Baker Petrolite Corporation",
  "OperatorStr1": "P.O. Box 669",
  "OperatorStr2": null,
  "OperatorCity": "Barnsdall",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74002",
  "OperatorZipCodeExt": null,
  "FTE": 96,
  "OtherEPAFacilityID": "OKD990697724",
  "EPAFacilityID": "100000052113",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "98-107-TV",
  "SafetyInspectionDate": "1997-07-22 00:00:00",
  "SafetyInspectionBy": "Insurance Company",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "99032RR",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.550658,
  "FRS_Long": -96.156243,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13407,
      "AltID": "Ethylene-Polywax prod.",
      "FacilityID": 10552,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 15801,
          "ProcessID": 13407,
          "ChemicalID": 95,
          "Quantity": 225000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 15802,
          "ProcessID": 13407,
          "ChemicalID": 129,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 13732,
          "ProcessID": 13407,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 6426,
              "Process_NAICS_ID": 13732,
              "SafetyReviewDate": "1998-01-27 00:00:00",
              "PHA_Date": "1998-01-27 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Flammable vapor monitors",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Extensive process instrumentation",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Continued operator certification and training.",
              "OpProceduresReviewDate": "1999-04-12 00:00:00",
              "TrainingReviewDate": "1999-01-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Live fire scenarios",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-08 00:00:00",
              "EquipmentInspectionDate": "1999-02-01 00:00:00",
              "EquipmentTested": "Various system components are visually inspected daily;  major components are also inspected per manufacturers recommendations.",
              "ChangeMgmtDate": "1999-01-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-09 00:00:00",
              "PreStartupReviewDate": "1998-09-11 00:00:00",
              "ComplianceAuditDate": "1998-07-31 00:00:00",
              "AuditCompletionDate": "1999-07-01 00:00:00",
              "IncidentInvestigationDate": "1998-12-19 00:00:00",
              "InvestigationChangeDate": "1999-02-12 00:00:00",
              "ParticipationPlansReviewDate": "1992-08-28 00:00:00",
              "HotWorkPermitReviewDate": "1998-01-18 00:00:00",
              "ContractorSafetyReviewDate": "1998-08-04 00:00:00",
              "ContractorSafetyEvalDate": "1999-03-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8249,
                  "PreventionProgram3ID": 6426,
                  "ProcessChemicalID": 15801
                },
                {
                  "PrimaryKey": 8250,
                  "PreventionProgram3ID": 6426,
                  "ProcessChemicalID": 15802
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10552,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-03 00:00:00",
    "ERTrainingDate": "1999-05-28 00:00:00",
    "CoordinatingAgencyName": "Barnsdall Fire Department",
    "CoordinatingAgencyPhone": "9188472255",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10552,
      "SummaryText": "1.0\tSOURCE AND PROCESS DESCRIPTION\n\n\n\n1.1\tSOURCE\n\nThe Baker Petrolite Corporation (BPC) facility located in Barnsdall, Oklahoma is subject to the U.S. Environmental Protection Agency's (USEPA's) Risk Management Program (RMP) for Accidental Release [40 CFR 68] because its ethylene polywax (EP) production process contains more than the threshold quantities (10,000 lbs each) of ethylene (CAS No. 74-85-1) and propylene (CAS No. 115-07-1).  Ethylene and propylene are both flammable substances which are gases at ambient conditions, but are carefully stored under pressure as liquids at BPC. These monomers are the primary raw materials that are polymerized into the facility's final products (synthetic waxes).  The final product, a synthetic wax (EP), is neither flammable nor toxic.  \n\nA maximum inventory of 60,000 lbs of propylene can be on site at any one time in a single pressure vessel storage tank and piping to the EP process.  Ethylene is stored in two large tanks and can be delivered to the process as a gas after passing through  vaporizers in the feed system.  A maximum of 225,000 lbs of ethylene can be in the process at any one time, with up to 163,000 lbs present in a single storage tank.\n\nThe BPC facility utilizes standard operating procedures, training, administrative and engineering controls, and other safety practices to assure that ethylene and propylene are handled in a safe manner.  There has not been a fire, explosion, or release event at the EP plant in the last five years which has impacted people or property in the City of Barnsdall.  Details of the facility's extensive prevention program are summarized in Section 3.0.\n\n\n1.2\tPROCESS DESCRIPTION\n\nBPC manufactures low molecular weight synthetic waxes, designated as ethylene polywax (EP) products.  The synthetic waxes are produced by polymerizing organic monomers, principally the ethylene and propylene that are subject to this RMP.  The EP finished products are solids at ambient temperature, do not contain"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10552,
      "SummaryText": "hazardous constituents, and have negligible volatility.  \n\nThe following raw materials are used in the EP process:\n\n* Organic monomers (principally, ethylene and propylene)\n* Reaction initiators\n* \nReaction catalyst\n* Carrier solvent\n\nWith the exception of the reaction catalyst, all these raw materials are received and stored in bulk tanks.  The ethylene and propylene bulk storage and feed systems are the RMP-regulated process.  The plant operates two ethylene bulk tanks that are nominally sized at approximately 30,000 gallons water capacity, and one propylene bulk tank nominally sized at 15,000 gallons water capacity.  The reaction initiators and carrier solvent are stored and dispensed from three separate bulk tanks.  The reaction catalyst is received and dispensed from 55-gallon drums.\n\nA description  of each of the major processing steps employed by the BPC plant to produce synthetic waxes are as follows:\n\n\tPolymerization Reaction\n\nThe polymerization reaction is conducted in water-cooled agitated reactor vessels.  In this process, the carrier solvent and initiator are fed to the reactor, then the catalyst and monomer are blended to polymerize the monomer into a long-chain synthetic wax.  The reaction mass is fed to a surge tank or directly to a wash tank for further processing.  The facility can also route the reaction mass to an oxidization vessel to produce high molecular weight alcohols.  These alcohols are very similar to the synthetic waxes, having negligible volatility and no hazardous ingredients.  \n\n\tAqueous Washing\n\nThe reaction mass is fed to a washing system.  The purpose of this step is to remove the water soluble initiator and catalyst compounds from the reaction mass.  Washing consists of sequential water washes followed by phase separation, with the aqueous phase discharging to solvent recovery and the organic phase routed to polymer recovery.\n\n\tPolymer Recovery\n\nThe organic phase discharged from the washing step is initially transferred to a fla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10552,
      "SummaryText": "sh evaporator/condensor system.  This removes the majority of carrier solvent from the polymer product.  The residual carrier solvent is then removed by a steam stripping process.  Overheads from the stripping process are condensed and collected.  The solvent/water mixture from both condensing systems discharge to \"wet\" solvent (solvent with entrained water content) collection tanks.  Polymer from the steam stripping unit discharges to accumulation/ storage tanks where it is tested and then pumped to discharge tanks or the facility's prilling tower where wax beads are formed as the final product.\n\n\tAqueous Phase Solvent Recovery\n\nThe aqueous phase material discharged from the washing system and from the phase separation of the \"wet\" solvent is fed to a flash tank/ condenser system or a steam stripping column/condenser to remove and recover the carrier solvent.  The condensers discharge to the \"wet\" solvent collection tanks.  The stripped aqueous phase discharges to a solid/liquid separator and lagoon system, and is ultimately pumped to a deep well injection system.  \n\n\tSolvent Purification/Drying\n\nThe recovered carrier solvent accumulated in the \"wet\" solvent collection system is allowed to phase separate with the aqueous phase fed to the aqueous solvent recovery systems, and the organic phase fed to a distillation column for purifications.  Overheads from the distillation column are condensed and returned to the \"wet\" solvent collection system.  Purification residuals from the distillation column are accumulated in a tank system and eventually sold to customers as a co-product.  A side draw of the purified solvent is routed to an accumulation tank.  This tank feeds a second distillation column for removal of any residual water.  Solvent from this second drying column is fed to a molecular sieve which further reduces the water content.  Dried purified solvent is then routed to another accumulation tank which recycles the solvent back to the initial polymerization re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10552,
      "SummaryText": "action step.  \n\n\tCo-Product Processing\n\nOff-specification product, line flushings, and tank wash-out solids are recycled by the co-product processing system.  This system separates solids and solvents from the above-listed material using a flash evaporator and condensor.  The condensor discharges recovered solvent back to the \"wet\" solvent collection tanks.  Solids recovered from the system are pumped to a co-product storage tank for shipment to customers.  \n\n\n1.3\tSAFETY SYSTEMS\n\nIn order to prevent potential releases and to reduce the severity of a release, should one occur, the EP process at the Barnsdall facility was designed with various safety systems, including process controls, process instrumentation, mitigation systems, and process area detectors.\n\nProcess controls and instrumentation include:\n\n* Vents, check valves, relief devices, and other manual and automatic shut-offs;\n\n* Process indicators and alarms throughout the process, many of which are interlocked with the shut-off valves;\n\n* An emergency air supply, emergency power, and back-up pumps; and\n\n* A grounded electrical system, including, in some cases, spark/explosion-proof electrical equipment.\n\nMitigation systems include:\n\n* Excess flow devices, quench and purge systems, and a fire sprinkler system; and\n\n* Fire and blast walls in certain areas.\n\nIn addition, flammable vapor monitors are installed in critical locations in the process to detect even small releases and quickly respond to them.\n\n\n\n2.0\tPOTENTIAL RELEASE SCENARIOS \n\n\nThe ethylene and propylene delivery systems are individual, closed systems of tanks and piping, until they reach the EP reactor.  Historically, releases from similar industrial systems most often occur when leaks develop in packing glands and valves, or inadvertent vapor releases during the unloading of liquefied gases from a delivery truck to the storage tank.  While these incidents can impact employees, they seldom lead to a release of a reportable quantity or create an of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10552,
      "SummaryText": "f-site impact.\n\nConsistent with the RMP Rule requirements, two specifically designed release scenarios (a worst case release and an alternative case release) were analyzed for both ethylene and propylene to determine the maximum distance to their flammable endpoints.  These endpoints, as described in the following sections, represent the fire or explosion hazardous which could cause injuries or property damage.  \n\nThe release scenarios analyzed are based upon guidance contained in the USEPA's Off-Site Consequence Analysis Guidance (OCAG) document, dated May 24, 1996.  Release amounts and endpoint distances were calculated using the OCAG equations and guidance, as well as the Automated Resource for Chemical Hazardous Incident Evaluation (ARCHIE) computer program.  The ARCHIE program was developed by the Federal Emergency Management Agency, the U.S. Department of Transportation, and the USEPA, and uses equations and guidance contained in these agencies' Handbook of Chemical Hazard Analysis Procedures, published in 1989.\n\n\n2.1\tWORST CASE RELEASE\n\nThe worst case release is defined by 40 CFR 68 as the catastrophic rupture and complete loss of the contents of the largest vessel in the process, resulting in a vapor cloud which is subsequently detonated, producing an explosion with a 10% efficiency.  The flammable endpoint is defined as the distance at which overpressure from the explosion is reduced to 1 psi (the level at which glass and windows are expected to be broken).  Two worst case releases were considered for the BPC facility, one for ethylene and one for propylene.  For ethylene, the worst case release amount is 163,000 lbs, resulting in a flammable endpoint distance of 0.44 miles.  For propylene, the worst case release amount is 60,000 lbs, resulting in a distance to the flammable endpoint of 0.31 miles.  These distances were calculated using the TNT equivalent methods in OCAG and ARCHIE.\n\nAlthough the worst case consequence analysis is required by 40 CFR 68, it"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10552,
      "SummaryText": "would be a highly unlikely event.  Design, construction, and operation of the ethylene and propylene storage vessels are such that catastrophic failure is extremely remote.  These vessels were designed and constructed in strict accordance with the American Society of Mechanical Engineers' (ASME's) Boiler and Pressure Code, and were certified and stamped by the National Board of Pressure Vessel Inspectors (the National Board).  Third party and State-mandated inspections of the vessels' conditions occurs annually by a Factory Mutual Insurance Company inspector who has been certified by the National Board. \n\nThere are only two plausible cases for a catastrophic loss of containment of an ethylene or propylene storage vessel:\n\n1. If the internal pressure were to increase uncontrollably and rupture the vessel from the inside; or\n\n2. If external rupture of the vessel wall occurred due to inadvertent contact (i.e., vehicle impact).\n\nThe vessels are operated well below their design pressures (i.e., maximum allowable working pressures) and because of the safety factors built into the ASME code, a four-fold pressure excursion would have to occur before catastrophic vessel failure.  Such pressures could not be generated internally.  Moreover, the ethylene vessel is double-walled and should be even more resistant to rupture.\n\nThe only logical external cause of high pressure would be flame impingement or surface radiation from a fire adjacent to the vessel.  If this were to occur, each vessel is equipped with safety relief valves (SRVs) set to relieve at internal pressures at or below the maximum allowable working pressure of the vessel.  A high pressure excursion would not occur as long as the SRV continued to function.  Actuation of the SRV would result in an ethylene or propylene release similar to that described in Section 2.2 for the alternative release scenario.  The SRVs are replaced every ten years, in accordance with the National Fire Protection Association (NFPA) Code r"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10552,
      "SummaryText": "equirements, and are inspected periodically to ensure that they will function properly when required.\n\nThe worst case release scenarios are also unlikely for the following additional reasons:\n\n* The facility has preventive maintenance program in-place to maintain the ongoing integrity of the vessels.\n\n* The facility has a training program designed to ensure that the system is operated by qualified personnel.\n\n* The facility has emergency response procedures which enable trained personnel to quickly respond to and isolate any potential releases.\n\n* Inadvertent vehicular contact with the vessel is unlikely, since the unit is provided with substantial barrier protection to preclude this occurrence.\n\n\n2.2\tALTERNATIVE CASE RELEASE\n\nThe alternative, or more likely, scenario would be an event such as a pipe leak, an inadvertent release during unloading, or release through a SRV.  The BPC facility considered several alternative case release scenarios, based on industry and facility experience.  Most of these scenarios did not result in a flammable endpoint distance which extended beyond the BPC property boundaries.  According to 40 CFR 68, however, an alternative case scenario must be selected with an endpoint beyond the property.  Therefore, release scenarios for ethylene and propylene were considered with significant release amounts (much greater than would be expected from a small piping leak, SRV release, or unloading hose failure).\n\nFor ethylene, a 2,000-lb per minute release rate was assumed to occur for 60 minutes, resulting in a release of 120,000 lbs of the substance.  Based on OCAG guidance, ARCHIE was used to model the resulting vapor cloud to a distance where the ethylene concentration was reduced to below the lower flammability limit (LFL) of 2.7% (i.e., the point at which a vapor cloud fire could extend).  This resulted in an endpoint distance of 0.11 miles, just beyond the BPC property.\n\nA similar release scenario was considered for propylene, however, the 2,"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 10552,
      "SummaryText": "000-lb per minute release was considered to occur for only 30 minutes, because this would result in the release of the entire contents of the propylene system (or 60,000 lbs).  The resulting distance to the flammable endpoint for a vapor cloud fire for propylene (its LFL of 2.0%) was 0.10 miles, also just beyond the BPC property.\n\nThese alternative case release scenarios are highly unlikely because even a complete rupture of the liquid or vapor piping would not result in a 2,000-lb per minute release rate.  An actual release scenario (i.e., an unloading hose rupture or leak through an SRV) would likely result in a release rate of less than 2,000 lbs/min, resulting in a flammable endpoint of 200 to 300 feet, or about one-half the distance from the EP process to the BPC property line.  In addition, the alternative release scenarios are unlikely for the following reasons:\n\n* Industrial standards were followed for the manufacture and quality control of the storage vessels and delivery pipes.\n\n* Most of the lines are elevated or protected to minimize potential damage from forklifts or other vehicles.  \n\n* The facility has a preventive maintenance program in-place to maintain the ongoing integrity of the tanks and piping.\n\n* The facility has a training program designed to ensure that the system is operated by qualified personnel, and that only pre-qualified contractors are allowed to work on or nearby the system.\n\n* The facility has emergency response procedures which enable trained personnel to respond quickly to and isolate any releases from the system.\n\n3.0\tPREVENTION PROGRAM\n\n\nThe facility has carefully considered the potential for accidental releases of ethylene and propylene, such as the occurrence of the worst case and alternative case release scenarios described in Section 2.0.  To help minimize the probability and severity of a release, a prevention program for ethylene, propylene, and other chemicals used in the EP process was developed to satisfy the Occupation"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 10552,
      "SummaryText": "al Safety & Health Administration (OSHA) Rule for Process Safety Management (PSM) of Highly Hazardous Chemicals [29 CFR 1910.119].  The key components of the prevention program are summarized below:\n\n* The development, documentation, and operator availability of critical process safety information regarding the hazards of the chemicals involved, the design basis of the system, and the equipment.  This information is used to fully understand and safely operate the process.\n\n* The development of an extensive employee participation program, which includes employees from all levels of the organization and from all areas within the plant (i.e., production and maintenance).  This program also ensures that employees that most knowledgeable about the EP plant process are ale to effectively, and regularly recommend changes or improvements which enhance operating safety.\n\n* The performance of formal PHA on the various EP plant process systems using the \"What-if?\" technique.  A team with expertise in engineering, operations & maintenance, and safety evaluated the EP plant processes in depth and developed recommendations to improve the safety and operability of the system.  The PHA addressed:  (1)  process hazards; (2) previous incidents; (3) engineering and administrative controls applicable to the hazardous; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) the qualitative evaluation of possible safety & health effects of control system failures.  The PHAs resulted in procedures and/or hardware recommendations to improve safety and operation of the system.  Many of these recommendations have already been resolved.  The PHAs are updated and revalidated every five years.\n\n* Written operating procedures (OPs) are used to provide the basis for proper and safe operation of the EP plant.  The OPs include procedures for normal operations, start-up, shutdown, emergency operations, and emergency shutdown.  They also include safe operating limits f"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 10552,
      "SummaryText": "or temperature and pressure, consequences of operating outside these limits, and a description of safety systems and how they operate.\n\n* EP plant operators receive refresher training at least every three years.  The training content is based on the process safety information and OPs.  The training program ensures that the operators understand the nature and causes of problems arising from the system operations and serves to increase awareness with respect to the hazards particular to the EP plant process.\n\n* Formal authorization systems (i.e., management of change procedures, pre-startup safety review) are in-place to ensure that system changes or expansions are as safe as the original design and that an independent re-check confirms that the changes are consistent with the engineering design and in a condition to be safety operated prior to start-up.\n\n* Events that might (or did) cause an accidental or unexpected release are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent reoccurrence.\n\n* Contractors that are hired  to work on or adjacent to the EP plant process are pre-qualified based on their knowledge of the system, understanding of the applicable codes and standards, and their demonstrated ability to work safely.  In addition, these contractors are periodically evaluated to ensure that they continue to work safely.\n\n* Prior to the performance of any \"hot work\" (i.e., spark- or flame- producing work such as welding, cutting, brazing, or grinding), management must approve the work by executing a written Hot Work Authorization Permit to verify that the precautions to prevent fire have been implemented.\n\n* Periodic walk-throughs to find unusual or increasing vibration, incipient leaks, or other indications of potential upsets or failures that could lead to a release.  Replacement of all pressure relief valves occurs periodically based on schedules developed by manufacturer recommendati"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 10552,
      "SummaryText": "ons or industry standards.  \n\n* Utilization of safety systems including pressure relief valves, excess flow devices, a quench system, emergency power, and other process controls and safety interlocks.\n\n* Regular inspection and calibration of temperature and pressure instruments, sensors, switches, and shutdown devices that have safety implications.\n\n* Periodic inspection of major power equipment, including pumps, fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure.\n\n* Proper design, including adherence to recognized industry standards or safety codes.  \n\n* Adherence to fire codes in preparation for fires, storms, or events which could impact the EP plant process.\n\n* Planning with the local fire department to ensure a rapid response to potential incidents with the system or external events such as floods or tornadoes.\n\n* Prevention program compliance audits performed every three years to verify that appropriate management systems are in-place and are being properly implemented.  Any deficiency found in an audit is corrected.\n\n\n4.0\tACCIDENT HISTORY\n\n\nThere have been no accidental releases of ethylene or propylene at the BPC facility in the last five years that have resulted in death, injury, or significant property damage on-site or off-site death, injury, evacuation, sheltering in-place, property damage, or environmental damage.\n\n\n5.0\tEMERGENCY RESPONSE PROGRAM\n\n\nThe BPC Barnsdall, Oklahoma facility has implemented a detailed Emergency Response Plan (ERP).  The ERP is intended to address all emergencies at the facility, in addition to incidents related to the release of ethylene or propylene.  Moreover, the BPC facility has a trained emergency response team for handling releases of hazardous substances in accordance with OSHA 29 CFR 1910.120, Hazardous Waste Operations and Emergency Response.  The facility also has a fire brigade and equipment to respond to internal fires.  The hazardous materials technicians have re"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 10552,
      "SummaryText": "ceived at least 24 hours of initial training, an 8-hour refresher, and have sufficient competency to implement the ERP and its procedures.\n\nThe ERP includes awareness and response training for employees, coordination with the local fire department, coordination with the Local Emergency Planning Committee (LEPC), and evacuation of the facility and surrounding area.  The Plan details what personal protective equipment and spill response equipment is available; identifies specific individuals, their 24-hour telephone numbers, and their responsibilities; identifies procedures for emergency medical care; and refers to their pertinent elements of the management system (i.e., standard operating procedures and process safety information).\nENVIRONMENTAL RESOURCES MANAGEMENT\t13\tRMP FOR ACCIDENTAL CHEMICAL RELEASE\n\t\tEXECUTIVE SUMMARY\nf:\\cpfiles\\erm\\petro\\99032\\wp\\rpts\\exec summ\\report.doc"
    }
  ]
}