{
  "FacilityID": 10731,
  "FacilityName": "Defense Supply Center Richmond",
  "FacilityStr1": "8000 Jefferson Davis Highway",
  "FacilityStr2": null,
  "FacilityCity": "Richmond",
  "FacilityState": "VA",
  "FacilityZipCode": "23297",
  "Facility4DigitZipExt": "5000",
  "FacilityCountyFIPS": "51041",
  "LEPC": "Chesterfield County LEPC",
  "FacilityLatDecDegs": "37.414833",
  "FacilityLongDecDegs": "-77.435833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Defense Logistics Agency",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Defense Supply Center Richmond",
  "OperatorStr1": "8000 Jefferson Davis Highway",
  "OperatorStr2": null,
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23297",
  "OperatorZipCodeExt": "5000",
  "FTE": 2200,
  "OtherEPAFacilityID": "VA3971520751",
  "EPAFacilityID": "100000064093",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.4189,
  "FRS_Long": -77.4485,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 13748,
      "AltID": "HCl storage:  WH 13",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16472,
          "ProcessID": 13748,
          "ChemicalID": 53,
          "Quantity": 18995.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14079,
          "ProcessID": 13748,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13749,
      "AltID": "HCl storage: WH 13",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16473,
          "ProcessID": 13749,
          "ChemicalID": 53,
          "Quantity": 43160.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14080,
          "ProcessID": 13749,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13750,
      "AltID": "HCl storage: WH 13",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16474,
          "ProcessID": 13750,
          "ChemicalID": 53,
          "Quantity": 43056.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14081,
          "ProcessID": 13750,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13751,
      "AltID": "HCl storage: WH 13",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16475,
          "ProcessID": 13751,
          "ChemicalID": 53,
          "Quantity": 29640.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14082,
          "ProcessID": 13751,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13752,
      "AltID": "HCl storage: POL Shed",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16476,
          "ProcessID": 13752,
          "ChemicalID": 53,
          "Quantity": 16672.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14083,
          "ProcessID": 13752,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13753,
      "AltID": "HCL storage:  POL Shed",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16477,
          "ProcessID": 13753,
          "ChemicalID": 53,
          "Quantity": 18756.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14084,
          "ProcessID": 13753,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13754,
      "AltID": "HCL storage: POL Shed",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16478,
          "ProcessID": 13754,
          "ChemicalID": 53,
          "Quantity": 18756.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14085,
          "ProcessID": 13754,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13755,
      "AltID": "HCl storage:  POL Shed",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16479,
          "ProcessID": 13755,
          "ChemicalID": 53,
          "Quantity": 18756.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14086,
          "ProcessID": 13755,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13756,
      "AltID": "HCl storage:  POL Shed",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16480,
          "ProcessID": 13756,
          "ChemicalID": 53,
          "Quantity": 18756.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14087,
          "ProcessID": 13756,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13757,
      "AltID": "HF storage:  WH 13",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16481,
          "ProcessID": 13757,
          "ChemicalID": 55,
          "Quantity": 1092.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14088,
          "ProcessID": 13757,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13758,
      "AltID": "Hydrogen: Bldg 95",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16482,
          "ProcessID": 13758,
          "ChemicalID": 149,
          "Quantity": 12110.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14089,
          "ProcessID": 13758,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 13759,
      "AltID": "Acetylene:  Bldg 95",
      "FacilityID": 10731,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 16483,
          "ProcessID": 13759,
          "ChemicalID": 96,
          "Quantity": 15554.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14090,
          "ProcessID": 13759,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10731,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1991-09-12 00:00:00",
    "ERTrainingDate": "1999-03-19 00:00:00",
    "CoordinatingAgencyName": "Chesterfield County Fire Department",
    "CoordinatingAgencyPhone": "8047461236",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Clean Air Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10731,
      "SummaryText": "1.  Installation Description\n\nThe Defense Supply Center, Richmond (DSCR) is located in Chesterfield County, Virginia, approximately 11 miles south of the city of Richmond.  DSCR is responsible for logistic support, material management functions, procurement support, storage and transportation functions, contract administration and other services for over 700,000 supply items. Additionally, DSCR houses the Ozone Depleting Substances (ODS) reserve for the military and other federal agencies.  \n\nDefense Distribution Depot Richmond is the largest of the tenant organizations at the Center.  It receives, stores, and ships supply items for all supply centers in the Defense Logistics Agency, and occupies approximately 350 acres of the installation.  Additionally the Depot has acquired the mission for the Defense Reserve for ODS storage for the Department of Defense.  ODS reserve operations consist of receiving, transferring, testing, and storing ODS material recovered at DoD installation for future mission critical uses.  DSCR has numerous buildings and trailers of administrative facilities and warehouse storage.  Additionally, the 83rd Army Reserve Command is situated on approximately 20 acres on the south border of the installation.\n\n2. Types of Chemicals and Processes Present at DSCR\n\nAlthough ozone-depleting substances form a substantial proportion of chemicals stored at DSCR, many other chemicals are present in significant quantities.  Among these chemicals are hydrochloric acid, nitric acid, chlorine, acetylene, hydrogen, propane, formaldehyde, hydrofluoric acid, and ethylene oxide.\n\nOther than storage of ozone-depleting substances, the Defense Distribution Depot performs an important function - the reclamation and refurbishing of ODS and inert gases (such as oxygen, argon, and nitrogen).  While the ODS are recovered, inert gases are bled to the atmosphere.  After the ODS have been reclaimed, the empty cylinders are cleaned, tested, and re-certified (or rejected) by p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10731,
      "SummaryText": "ersons qualified by the Bureau of Explosives.  This process is known as the refurbishment of the ODS cylinders.\n\nAside from the storage of materials and the refurbishment of containers, several other activities occur at the installation that were investigated from the standpoint of the RMP rule.  Located at the Depot are several storage tanks containing propane, which is used as an auxiliary fuel.  (There is also a single propane tank at the Virginia Army National Guard facility located within DSCR.)  Building 80 houses the Equipment Maintenance Branch, consisting of Material Handling & Equipment and the Automotive and Heavy Equipment shop.  While there are many activities here that involve the use of chemicals, such chemicals are typically not covered by the RMP rule.  Examples of the chemicals handled are paints and solvents (in the automotive paint booth), degreasing solvents (mainly containing naphtha), new and spent engine oils, batteries, tires, and other materials generally associated with vehicle maintenance.  The material safety data sheets (MSDS) for these materials did not indicate the presence of any chemicals regulated by the RMP rule.  Similar maintenance activities are occurring at the Virginia Army National Guard facility.\n\nDSCR has a swimming pool and a wading pool in Building 5.  The swimming pool is sterilized by chlorination.  Usually there are 5 cylinders of chlorine connected to the chlorination system, with each cylinder having a capacity of 150 lb.  However, a maximum of 10 cylinders may be present at any given time.  A DSCR directive limits the number of cylinders at this building to 10 at any given time.  The wading pool is disinfected using pellets, and is not considered a process.\n\nBuilding 56 used to house a water treatment plant, which included a chlorination process.  However, for the past 10 years the building has been used simply to store water for fire-fighting purposes.  The building was recently equipped with new emergency electri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10731,
      "SummaryText": "c generators and pumps.  However, no chemicals are used in this building.  The chlorinating equipment is no longer present at this building.\n\nDSCR is engaged in a significant recycling effort, which includes the collection and compaction of many solid wastes.  Such wastes include paper, cardboard, toner cartridges for laser printers, and scrap metal.  The collection of wood is limited to railroad ties.  Used cylinders from the Depot cannot be recycled as scrap metal as there is a risk of chemical contamination.  Such containers are disposed of by the Defense Revitalization and Management Office (DRMO).  A survey of the collection and compacting process and an inventory of materials found that there are no RMP processes in the recycling effort.\n\n3. Distribution and Warehousing of Materials\n\nUpon receipt at DSCR, materials are inventoried, a stock number is assigned, and the materials are distributed to the appropriate warehouse or storage location.  Materials meant for refurbishment are re-directed according to the type of materials.  Ozone-depleting substances typically go to Building 64 in the Depot, where the substances are reclaimed and the cylinders refurbished.  Containers with substances such as propane, acetylene, and chlorine (so-called \"dangerous gases\") are received in the open storage area, from where they are eventually sent to contractors for reclamation and cylinder refurbishment.  These containers are generally considered to be empty, and the quantity of materials remaining in them is marginal.\n\nMaterials meant for re-distribution to other supply centers in the Defense Logistics Agency are stored at various locations throughout the installation.  The following is a list of primary storage locations in the Depot:\n\nWarehouse 4.   This is currently being emptied and turned over to the DRMO.  Two bays will continue to be the responsibility of the Depot.\nWarehouse 8.  This is where flammables, oxidizers, and poisons are stored.\nWarehouse 9.  This is where "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10731,
      "SummaryText": "non-hazardous materials are stored. Warehouse 12.  Non-flammable substances are stored here.\nWarehouse 13.  This building is used to store corrosive materials.\nE07 to E10.  Petroleums, oils, and lubricants (POL) are stored in these locations. Building 54.  Storage of small binable items, station returns, and closed depot stocks.  (Examples of materials stored are gloves, electrical power distributors, track shoes, tents, thermometers, batteries, and lubricating oil.) Building 94D001.  Used primarily for storage of chlorine cylinders.\nBuilding 95D001 and D002.  Cylinders of ozone-depleting substances and hydrogen.\nBuilding 95D003.  Cylinders of acetylene and propane.\nBuilding 95D005.  Cylinders of nitrogen.\nBuilding 95D006.  Cylinders of oxygen, sulfur hexafluoride, and nitrous oxide.\nBuilding 95D007.  Cylinders of ozone-depleting substances and nitrous oxide.\nBuilding 95D008.  Cylinders of argon nitrogen, and sulfur hexafluoride.\nBuilding 95D009 and D010.  Cylinders mainly of oxygen.\nBuilding 95D011 and D012.  Cylinders of oxygen and nitrogen.\n\n4.  Managing of Waste Materials\n\nOutside of the Depot, the only significant areas of storage are managed by the DRMO, which is responsible for handling and disposing of hazardous wastes.  Buildings 74, 51, and a section of Warehouse 4 are managed by the DRMO, which receives \"waste\" materials from the Depot.  The activities in Building 74 are regulated by a permit under Part B of the Resource Conservation and Recovery Act (RCRA).  The permit treats all of the materials in this building as waste.  However, this is considered waste only from the standpoint of the Depot.  The DRMO considers this material as salvageable and having monetary value.  Thus, the agency first attempts to sell the materials before disposing of them as waste.  Only an estimated 5% of the materials received by the DRMO is actually disposed of as waste.\n\nBuilding 74 is typically used to store hazardous materials.  The building has specific storage areas for"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10731,
      "SummaryText": " specific types of substances.  One side of the building is for acids and alkalis (toxics), and the other side is for flammables.  The two parts of the building are separated by a firewall.  Each storage area is separated by a berm, and has an individual floor drain and catch basin.  However, because of on-going construction at the building, it has remained empty for several months.  Even once the building is ready for use it is expected that there will not be any significant RMP processes present.  The DRMO manages a lot of materials using the receipt-in-place concept.  In other words, they take ownership of materials from the Depot, but the materials remain in place at the Depot until they are physically removed.  Therefore, the materials would not typically be found in large quantities in the DRMO storage locations.\n\nThe DRMO also manages Building 51, where \"lower hazard\" materials are stored.  Although this building is used mainly for bin storage, it occasionally receives materials stored in drums.  Examples of materials stored in this building are -- acetic acid (48 containers, 2.5 gal each), methyl isobutyl ketone (15 lb containers), isopropyl alcohol (3 containers, 5 gal. each, which would normally be in Building 74), scale removing compound, cleaning compound, polyurethane, photo developer, toner cartridges, hydraulic fluid, engine and lubricating oil, and batteries.  None of these materials are chemical mixtures that contain RMP-regulated substances.\n\n5. Data Management and Availability of Storage Records\n\nBecause of the large number of items and materials that pass through DSCR, and because of the large volumes of these items and materials, computerized databases were essential to reviewing the installation's inventories.  The Depot has a database known as the Distribution Standard System (DSS).  This system allows data to be sorted by materials, stock number, storage location, hazard code, available balance, and other data fields.  This database was inval"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10731,
      "SummaryText": "uable in identifying RMP-regulated chemicals present at the Depot, their location, and the quantities in which they are being stored.\n\nThe DRMO has paper records of materials it \"owns\". As the main storage location for hazardous materials (Building 74) was empty, and is expected to remain empty for several months, the RMP rule does not apply at the time of preparing this Risk Management Plan.  DSCR will re-evaluate the building once it becomes operational again.\n\n6.  Emergency Response Program\n\nAn emergency response program is currently being implemented at DSCR.  The Fire Prevention and Protection Division (the Fire Department) at DSCR follows written procedures for emergency response notification and coordinates activities related to fire, rescue, and hazardous material response.  A memorandum of understanding (MOU) between DSCR and the County of Chesterfield, VA has been signed.  Mutual Aid agreements for assistance (fire protection, spill response and medical assistance) are established with the Chesterfield County Fire Department and the Chesterfield County medical emergency unit and the DGSC Health Clinic.  DSCR has a good working relationship with the Local Emergency Planning Agency (LEPC)-Chesterfield County Fire Department.  Members of the LEPC attend and conduct training exercises and DSCR personnel participate in the training sessions.\n\n7.  Processes At DSCR Subject To The RMP Rule\n\nAs of April 16, 1999 there were 12 processes at DSCR that were subject to EPA's RMP rules.  All of these processes involve storage of a regulated substance, and directly involve the warehouse operations of DSCR.  A list of these processes, along with their storage locations and quantities of each regulated substance present, is given below:\n\nPROCESSES AT DSCR THAT ARE SUBJECT TO THE RMP RULE\n\nChemical                  Warehouse  Storage Location  Quantity Stored (lb)  Threshold Quantity (lb)\nHydrochloric Acid    13                 P060138AA           18,995                    "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 10731,
      "SummaryText": " 15,000\nHydrochloric Acid    13                 P060138AA           43,160                     15,000\nHydrochloric Acid    13                 P060138AA           43,056                     15,000\nHydrochloric Acid    13                 P060138AA           29,640                     15,000\nHydrochloric Acid    POL Shed     E100318AA           16,672                     15,000\nHydrochloric Acid    POL Shed     E100320AA           18,756                     15,000\nHydrochloric Acid    POL Shed     E100322AA           18,756                     15,000\nHydrochloric Acid    POL Shed     E100324AA           18,756                     15,000\nHydrochloric Acid    POL Shed     E100328AA           18,756                     15,000\nHydrofluoric Acid    13                  P080303CA           1,092                       1,000\nHydrogen                 95                 X020214AA           12,110                     10,000\nAcetylene                95                 X030116AA           15,554                     10,000\n\nA worst-case scenario analysis was conducted on all processes that are subject to the rules.  For each regulated chemical in a process this analysis involved:\n\n1.  determining the largest quantity of the regulated substance that can be released from the process in a 10-minute period;\n2.  applying passive mitigation factors (such as those created by releases in enclosed spaces) to reduce the quantity that escapes into the outdoor atmosphere;\n3.  estimating the area of impact (represented by a circle, with the radius being the distance up to which there could be adverse impacts on human health or the environment);\n4.  estimating the number of people offsite and identifying environmental receptors offsite that would be adversely impacted by an accidental release of the chemical; and\n5.  determining if the process has been involved in any accidental releases during the past five years that resulted in injuries, deaths, evacuations, and other similar emergency situatio"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 10731,
      "SummaryText": "ns offsite, or damage to the environment.\n\nThe analytical procedures outlined above were applied to each of the 12 processes listed above. The results showed that none of the processes has the potential for off-site impacts.  Furthermore, none of these processes has been involved in any accidental release during the past five years that resulted in emergency situations or damage to the environment.  Because DSCR is coordinating its emergency response program with local emergency responders, these results indicate that all processes belong to Program Level 1."
    }
  ]
}