{
  "FacilityID": 10909,
  "FacilityName": "Forest City Distribution Center - 3M Company",
  "FacilityStr1": "806 West Crystal Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Forest City",
  "FacilityState": "IA",
  "FacilityZipCode": "50436",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19081",
  "LEPC": null,
  "FacilityLatDecDegs": "43.253306",
  "FacilityLongDecDegs": "-93.649417",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "Z1",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": "rmp3m@mmm.com",
  "FacilityDUNS": 6326599,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "3M Company",
  "OperatorStr1": "806 West Crystal Lake Road",
  "OperatorStr2": null,
  "OperatorCity": "Forest City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50436",
  "OperatorZipCodeExt": null,
  "FTE": 163,
  "OtherEPAFacilityID": "IAD980686323",
  "EPAFacilityID": "100000074661",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-02 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.246944,
  "FRS_Long": -93.646389,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14077,
      "AltID": "Warehouse",
      "FacilityID": 10909,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 17062,
          "ProcessID": 14077,
          "ChemicalID": 98,
          "Quantity": 26000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 17063,
          "ProcessID": 14077,
          "ChemicalID": 107,
          "Quantity": 920000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 17064,
          "ProcessID": 14077,
          "ChemicalID": 9,
          "Quantity": 370000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 17065,
          "ProcessID": 14077,
          "ChemicalID": 125,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 17066,
          "ProcessID": 14077,
          "ChemicalID": 130,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14414,
          "ProcessID": 14077,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10909,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-11-01 00:00:00",
    "ERTrainingDate": "1998-11-01 00:00:00",
    "CoordinatingAgencyName": "Forest City Fire Dept",
    "CoordinatingAgencyPhone": "5155824121",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10909,
      "SummaryText": "1.  Introduction\n\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan for Forest City Distribution Center - 3M Company.  We take seriously our safety, health and environmental responsibilities to our employees and to the community.  As an operating unit of 3M, we share in a tradition of environmental, health and safety responsibility going back through much of the company's history.  3M was an early pioneer in pollution prevention and created its environmental policy in 1975.  Since 1990, 3M has cut its worldwide volatile organic air emissions 80 percent, and releases to water 75 percent. \n\n2.  Accidental Release Prevention and Emergency Response Policies\n\nIt is our goal to prevent accidental releases of regulated and other materials through the proper design, installation, operation and maintenance of our manufacturing processes and the proper training of our employees.  If, despite our efforts, such a release should occur, our trained emergency response personnel are at hand to control the effects of the release until the local Fire Department and other emergency responders arrive.  We maintain an excellent working relationship with the emergency responders to ensure rapid and effective response. \n \n3.  The Stationary Source and The Regulated Substances Handled\n\nThis location is a distribution center and warehouse for finished goods, primarily in small containers intended for consumer use.  We have five regulated substances at our facility in quantities regulated by EPA's Risk Management Program.  3M employees are trained and experienced in working with these substances and we contribute to safety by providing high quality manufacturing processes, equipment and maintenance. \n\nThe following regulated substances are used at Forest City Distribution Center - 3M Company:\n- Isobutane, pentane, and methyl ether are flammable gases that are used as propellants in aerosol cans.  The maximum container size for this substance is approximate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10909,
      "SummaryText": "ly twenty ounces.  Although pentane and methyl ether are not currently present at this site above the Threshold Quantity, they are included in this plan under the predictive filing option.\n- Ethylene oxide is used in the medical profession to sterilize surgical equipment.  It is a listed RMP toxic substance.  The maximum container size for this substance is approximately six ounces.\n\nAlthough propane is not currently regulated under RMP, 3M has voluntarily included propane in this plan.\n\n\nThis Risk Management plan includes predictive filing for two additional flammable gasses also used as propellants in aerosol cans -  pentane and methyl ether.  Although current inventory data shows that these are not stored at this site, or are stored at levels below the Threshold Quantity, previous data show that they can at times be present above the Threshold Quantity, and they are therefore included in the plan.\n\n4.  Worst Case Release Scenarios\n\nEPA has directed all affected facilities to share with their communities a look at the worst possible accident that could happen at the facility, as unlikely as that might be.  EPA has defined the worst case scenario as the release of the entire contents of the single largest container.  For Forest City Distribution Center - 3M Company, two scenarios were analyzed, one for flammables and one for toxics. \n\nThe worst case scenario analyzed for flammables was the release of the total contents of the largest aerosol can with the highest flammable content.  Propane was selected because it has the highest heat of combustion of the materials stored, and therefore the greatest distance to endpoint.  Analysis was performed using equations provided in EPA guidance documents.  The results show containment well within the limits of the building.  Although there is significant passive mitigation designed into this facility, including red label storage rooms, blast walls, and the building itself, additional credit was not taken for these passive mit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10909,
      "SummaryText": "igation measures in our scenario analysis.\n\nThe worst case scenario analyzed for toxics was the release of the total contents of the largest ethylene oxide cartridge stored at the site.   The results show containment well within the limits of the building.   Although the building itself would serve as passive mitigation, no additional credit was taken for mitigation measures in our scenario analysis.\n\nThe results of the worst case release analyses, combined with the five year history showing no accidental releases, qualify this as a Program 1 process.  Therefore, alternative release scenarios are not required.\n\nIt should be noted that because the regulated substances at this facility are in small containers, the data reported in the scenarios - quantity released, release rate, and distance to endpoint - are the smallest values enterable in RMP*Submit.  The true values are actually less than the reported numbers.\n\n5. Forest City Distribution Center - 3M company Program to Prevent Accidental Releases \n\nAt Forest City Distribution Center - 3M Company, we take great care to prevent accidents, including those not covered under the EPA's Risk Management Program.  Programs are in place to address accidental release prevention measures consistent with appropriate federal, state, and local requirements.  Beyond government requirements, we have 3M internal standards for continuously improving safety at our facility.  \n\nReflecting the low risk and  the five year history showing no accidental releases at this facility, EPA criteria for Program 1 designation are met and specific prevention program elements are not addressed in this plan.\n\n6. Five-year Accident History\n \nAt Forest City Distribution Center - 3M Company, no level of accident is acceptable.  We work continually to reduce the number and severity of accidents at our operations. In the five years preceding submittal of this plan, there were no accidental releases with on-site or off-site consequences meeting EPA criter"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10909,
      "SummaryText": "ia for inclusion in this plan.\n\n7. Emergency Response Plan\n\n3M's first line of defense against accidents is prevention.   At Forest City Distribution Center - 3M Company we also work to ensure that we are prepared for any accident that might happen. We maintain a written emergency response plan that includes arrangements for immediate response from employees, notification of local emergency response agencies and the public, first aid and medical treatment, evacuations, and post-incident decontamination of affected areas.   We conduct regular drills and work with the local Fire Department to ensure the proper execution of our plan.  Our emergency response plan is updated to reflect any pertinent changes  that would require a modified emergency response. \n\n8. Planned Changes to Improve Safety\n\nAt Forest City Distribution Center - 3M Company, we strive to continually improve safety at our facility.  Our efforts range from designing safety into our operations to regular assessments identifying opportunities for safety improvements.  In addition, Forest City Distribution Center - 3M Company is implementing an updated corporate policy to make safety a part of every employee's responsibility.  This policy encourages employees to identify any situations they perceive to be unsafe, as well as any opportunities to improve safety."
    }
  ]
}