{
  "FacilityID": 10920,
  "FacilityName": "Trigas, Inc. (Houston)",
  "FacilityStr1": "2200 Houston Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77007",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Houston LEPC",
  "FacilityLatDecDegs": "29.776417",
  "FacilityLongDecDegs": "95.37225",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71002867,
  "ParentCompanyName": "Nippon Sanso Corporation",
  "Company2Name": null,
  "CompanyDUNS": 170902028,
  "Company2DUNS": 0,
  "OperatorName": "Trigas, Inc.",
  "OperatorStr1": "6225 N State Hwy 161, Suite 200",
  "OperatorStr2": null,
  "OperatorCity": "Irving",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75038",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000076268",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-01 00:00:00",
  "SafetyInspectionBy": "The Yasuda Fire & Marine Co.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-05-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 29.77687,
  "FRS_Long": -95.37232,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14094,
      "AltID": "Fuel Gas Distributor",
      "FacilityID": 10920,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 17099,
          "ProcessID": 14094,
          "ChemicalID": 129,
          "Quantity": 25800.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 17100,
          "ProcessID": 14094,
          "ChemicalID": 96,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14431,
          "ProcessID": 14094,
          "NAICSCode": "454319",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 6370,
              "Process_NAICS_ID": 14431,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Texas Railroad Commission's Regulations on LP Gas",
              "FR_Comments": null,
              "HazardReviewDate": "1997-10-20 00:00:00",
              "ChangeCompletionDate": "1997-12-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Improper filling procedures of propylene and propane.",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Installation of Standard Operating Procedures for cylinder filling to prevent acidental releases caused by overfilling cylinders.",
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "All LP Gas \"pumper\" are required to be certified and licensed in the state of Texas.  Each pupmer is requried to re-certify every year with classroom and demonstration testing.",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "Visually prior to use. (cylinder tare weight, residual liquid in cylinders, cylinder valves) & transfer hose of system,  couplings & valves, etc.",
              "ComplianceAuditDate": "1999-01-01 00:00:00",
              "AuditCompletionDate": "1999-02-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "Trigas, Inc. (Houston) is an industrial gas distributor owned by Trigas, Inc.,  Irving, TX.  This facility distributes pre-packaged acetylene, and packages propylene into cylinders for sale.  This facility also has other gases which they sell, but are not covered under RMP regulations.  This facility falls under the NAICS Code 454319 as a Fuel Gas Dealer.  The safety information was last reviewed on May 1, 1999.  We are subject to the handling codes specified by the Texas Railroad Commission for Liquefied Petroleum Gas (propylene), as well as compressed gas cylinder storage.  These standards, as well as applicable OSHA standards have been implemented through written manuals.  To prevent/limit releases, the Trigas, Inc. (Houston) location uses Standard Operating Procedures for filling LP Gas Cylinders.  These SOPs go through a step-by-step procedure for checking the stamped tare weight of the cylinder, and checking the tare weight of the cylinder to ensure it is properly marked.  Then the valve of the cylinder is checked to ensure it has the correct valve for the product and the service.  The hydrostatic test date will be checked to determine if the hydrotest date is within the retest frequency.  If not, the cylinder must be retested before filling.  After these checks are completed, the cylinder can be filled according to written operating procedures.  All personnel who fill LP gas cylinders are certified and licensed by the Texas Railroad Commission every year.  Personnel go through a classroom training session with a written test and demonstration & observation for competency testing by the TRRC.  Written start-up procedures, troubleshooting guiglines, etc. are written for personnel to use in the prevention of a release of propylene into the atmosphere.  Visual inspections of the operating system (propylene) are completed daily & before filling of cylinders.  These visual inspection involve reading the liquid fill gauge, pressure gauge, fittings, valves, lines, transfere hose, pump, etc.  Any maintenance conducted on the propylene system is as-needed, and is only conducted by a licensed LP Gas Repairman.  The acetylene cylinders are not filled on-site by Trigas, Inc.  These cylinders are filled and shipped to the Trigas, Inc. location by tractor trailer trucks.  The only procdedures followed for acetylene are safe storage, and handling practices conducted by Trigas, Inc.  The cylinders are visually inspected when they are received into the Trigas, Inc. location for defects, and to ensure that there are vavle bonnets on all cylinders.  Other than this visual inspection, there is really no other prevention of releases for the acetylene cylinders, except for safe handling practices.",
              "_chemicals": [
                {
                  "PrimaryKey": 6641,
                  "PreventionProgram2ID": 6370,
                  "ProcessChemicalID": 17099
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10920,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Houston LEPC",
    "CoordinatingAgencyPhone": "7138654178",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10920,
      "SummaryText": "In this industrial fuel gas facility (Trigas, Inc., Houston, TX), we handle propylene and acetylene which are considered hazardous by EPA, OSHA, etc.  The same properties that makes propylene and acetylene valuable as a fuel gas also makes it necessary to observe certain safety precautions when handling and storing these flammable products.  Overall, the prevention of unnecessary human exposures, reducing the threat to our own personal health as well as our coworkers, and reducing the threat to nearby members of the community is the main goal of incorporating this risk management plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle and store propylene and acetylene, combined with the safety devices in the design of the propylene system, with safe operting procedures that we utilizee, along with the training of our personnel.\n\nThe primary purpose of this facility is to sell industrial gases.  The main process affected by the RMP Regulations is the repackaging of propylene, and by receiving acetylene in different sized cylinders where they are stored until sale to end customer.  Propylene is stored in an approved storage vessel until needed to fill smaller cylinders.  The Texas Railroad Commission inspects and approves all LP Gas systems, and ensures that all personnel associated with the filling of LP Gas is licensed and certified by the commission.  Standard operating procedures for the filling of smaller cylinders, as well as the proper safe operating procedures of the propylene system are the prevention program for this facility (Level 2).  Maintenance is conducted as need by a Licensed LP Gas Repairman in accordance with the Texas Railroad Commission's LP Gas regulations.  The maximum amount of propylene that can be stored on-site is 25,800 pounds.  Acetylene is received in different sized continers, the largest being an 850 cubic foot cylinder, wh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10920,
      "SummaryText": "ich can hold 58 pounds of acetylene gas.  These cylinders are visually inspected when they are received at the Trigas, Inc. (Houston) facility until they are sold.\n\nThe employees at Trigas, Inc. (Houston) conduct proper cylinder filling procedures, as well as Standard Operting Procedures when using the Propylene system.  This means that they utilize these procedures on a daily basis to aid in the prevention of a release of propylene during operational periods.  Lock-out / Tag-out procedures are utilized by the Licensed LP Gas Repairmen to aid in the prevention of a release.  All LP gas \"Pumpers\" are licensed by the Texas Railroad Commission for the use of LP Gas Cyloinder filling operations.  These operators are knowledgeable in the start-up and shut-down procedures of the propylene system.\n\nOur emrgency response (action) plan was developed with the assistance of Environmental Data Services, Inc., the Houston LEPC, and the Houston Fire Department.  If a flammable gass release occurs at the 2200 Houston Ave. location, personnel at the facility will be notified of a release.  LP Gas operators will try to stop the release using manual shutdown procedures.  If this mitigation does not work, notification to the Plant Manager, and 911 (Houston Fire Dept.) will be made for an emergency response.\n\nThe worst case scenario for this facility would be the loss of the propylene storage vessel, resulting in a flammabe release of 25,800 pounds of propylene into the atmosphere.  Passive mitigation was not considered for this scenarion.  Active mitigation in the form of excess flow valves would help reduce the release, but in worst case, the release could result in a vapor cloud explosion of 0.24 mile radius.  Within this 0.24 mile radius, there are approximatley 6100 persons affected with approximately 60 households.   These population numbers were baed on Landview III software.\n\nAlternate releases were determined for the Houston Ave. location for both acetylene and propylene.  The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10920,
      "SummaryText": " acetylene cylinders are not used in a process, but are only stored until sold.  An alternate release could be a valve not seated properly, which could result in the loss of up-to 58 pounds of acetylene from an 850 cubic foot cylinder.  This release could impact up to a 0.06 mile radius resulting in an impact of approximately 140 persons, and one household.  \nThe alternate release for propyene would be a transfere hose failure on the propyene filling system.  If this were to occur, the excess flow valve would close, and prevent any further loss of propylene into the environment.  The result could be a release of up-to 500 pounds of propylene.  Thisd release could result in a distance to endpoint of 0.04 mile radius.  This are could affect approximately 60 persons, and one household.  These populations are based on Landview III software.\n\nThere have been no accidental releases of flammable products from this facility in the past five years.  Safe handling and operational procedures by Trigas, Inc. aid in the prevention of releases of propylene and/or acetylene from this location.  Access to this facility is restricted to personnel associated with Trigas, Inc.\n\nThis industrial fuel gas distributor complies with EPA's Accidental Release Prevention Rule, and with all applicable state/federal codes and regulations."
    }
  ]
}