{
  "FacilityID": 10985,
  "FacilityName": "Spokane, WA Facility",
  "FacilityStr1": "11135 W Westbow Lane",
  "FacilityStr2": null,
  "FacilityCity": "Spokane",
  "FacilityState": "WA",
  "FacilityZipCode": "99224",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53063",
  "LEPC": "Spokane County LEPC",
  "FacilityLatDecDegs": "47.584444",
  "FacilityLongDecDegs": "-117.568056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "BFGoodrich Aerospace",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "BFGoodrich Aerospace",
  "OperatorStr1": "11135 W Westbow Lane",
  "OperatorStr2": null,
  "OperatorCity": "Spokane",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99224",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000076632",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "BFGoodrich (ethane only)",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 47.583604,
  "FRS_Long": -117.568511,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14257,
      "AltID": "Ethane Trailers",
      "FacilityID": 10985,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 17311,
          "ProcessID": 14257,
          "ChemicalID": 94,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14598,
          "ProcessID": 14257,
          "NAICSCode": "336413",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 10985,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-29 00:00:00",
    "ERTrainingDate": "1999-03-09 00:00:00",
    "CoordinatingAgencyName": "Spokane County Fire District 3",
    "CoordinatingAgencyPhone": "5092356645",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 10985,
      "SummaryText": "INTRODUCTION\n\nThe BFGoodrich Aerospace Spokane facility produces carbon brakes for aircraft.  Carbon textile material is received by the facility and is first cut, sized and prepared for the brake production process.  The textile is then sent to the furnace deck area where it undergoes carbonization and densification in a series of furnaces.  Next, the densified carbon brake parts are machined to the appropriate configuration.  Finally, the non-wearing surfaces of the brakes are coated with an oxidation inhibitor and mounting hardware is attached.  Some reprocessing of used brakes is also conducted at the facility.  In addition to the direct manufacturing activities, a variety of support operations are involved at the Spokane facility.  On-site laboratories perform both research and development, and quality assurance/quality control functions.  Both routine and non-routine maintenance is also conducted on vehicles and equipment.  \n\nETHANE\n\nThe facility maintains a fleet of three ethane trailers, two of which are on-site at any given time. Each trailer consists of eight storage vessels (maximum capacity 1,875 pounds of ethane). The third trailer is stored off-site, where it is filled by the ethane supplier. Upon notification by the facility, the third trailer is brought on-site and exchanged for an empty trailer. The maximum inventory of ethane is equal to the capacity of two full trailers (30,000 pounds of ethane).\n\nFor a worst-case release scenario, the facility must assume that the entire contents of one of the storage vessels (1,875 pounds) on an ethane trailer is released, a vapor cloud forms, and 10% of the cloud detonates. Other assumptions include Atmospheric Stability Class F, an ambient temperature of 770F, a wind speed of 1.5 meters per second, and 50% relative humidity.  The distance to the endpoint (EP) is defined as the distance an explosion from an accidental ethane release will travel before dissipating to the point that serious injuries from short-te"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 10985,
      "SummaryText": "rm exposures will no longer occur. For ethane, the EP is an overpressure of 1 psi. An overpressure below 1 psi is not likely to cause injuries that result from flying glass from shattered windows or falling debris from damaged structures. EPA's RMP*Comp (a computer software package) calculated the distance to the endpoint for a worst-case ethane release to be 0.1 mile.\n\nThe population affected by a worst-case release scenario for ethane was estimated using information from the 1990 Census data and LandView III, and then modified after comparing to a drive-around survey of the facility and surrounding areas.\n\nLandView III calculates populations within defined impact areas using two methods: the Block Group Uniform Population Density Method and the Block Group Centroid Method. The first method tallies data for each Census Block that has any portion within the defined radius of impact. It then prorates the results based on the ratio of the portion of the Census Block that is actually inside the radius of impact. This method distributes the people in the Census Block evenly across the land area and counts only those assigned within the radius of impact. This method is useful when only small portions of the Census Block are located within the radius of impact.\n\nThe second method, the Group Centroid Method, finds all Census Blocks that have their centers inside the defined radius of impact. The populations of these blocks are added together, regardless of whether the entire block is inside the radius of impact or not. This method is most useful with impact radii greater than 1 mile in densely settled areas. \n\nBecause the worst-case impact area for an ethane release at the facility is relatively small, neither of these population estimation methods provide accurate results. The Group Centroid Method fails to provide any data because there are no centroids located within the radius of impact. The Block Group Uniform Population Density Method estimates two people within the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 10985,
      "SummaryText": "worst-case impact radius. However, surveys of the surrounding area have shown that no residences are located within a 0.1 mile radius of the ethane trailers. The method is more useful for larger radii. Based on drive around surveys, it is appropriate to assign zero population within the ethane worst-case impact radius.  Additionally, there are no public or environmental receptors located in the impact radius.  \n\nThe ethane process is eligible for Program 1 of the Risk Management Program Rule because: (1) there are no residences or other public receptors within the worst-case impact area for ethane, (2) the facility has had no accidental release history with respect to ethane, and (3) the facility has coordinated response activities with local emergency response agencies.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases of ethane at the facility in the last five years that have resulted in injury, death or significant property damage on site or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.\n\nPREVENTION PROGRAM\n\nAlthough a prevention program is not required for the ethane system due to its Program 1 status, the ethane system is subject to OSHA's Process Safety Management regulations, and BFGoodrich has developed prevention program elements to satisfy the PSM requirements for the ethane system.  The key components of the prevention program developed for PSM-regulated processes at the facility are summarized below:\n\n-The development, documentation, and operator availability of critical process safety information regarding the hazards of the PSM-regulated chemicals and the design of the system and equipment.  This information is used to fully understand and safely operate the systems.\n\n-The development of an extensive employee participation program, which includes employees from all levels of the organization and from all areas within the plant (i.e., production and maintenance).  This program also as"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 10985,
      "SummaryText": "sumes that employees that utilize regulated processes are the most knowledgeable about it and are able to easily, effectively, and regularly recommend changes or improvements which enhance safety.\n\n-The performance of a formal process hazard analysis (PHA) on the regulated processes using the Hazard and Operability (HAZOP) study method.  PHAs will address:  (1) process hazards; (2) previous incidents (if applicable); (3) engineering and administrative controls applicable to the hazards; (4) the consequence of control failures; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  PHAs will be updated and revalidated every five years.\n\n-Written operating procedures (OPs) are used to provide the basis for proper and safe operation of the regulated processes.  The OPs include procedures for normal operations, startup, shutdown, emergency operations, and emergency shutdown.  They also describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\n\n-Operations and Maintenance personnel receive refresher training at least every three years.  The training content is based on the process safety information and operating procedures.  The training program ensures that the operators understand the nature and causes of problems arising from system operations and serves to increase awareness with respect to the hazards particular to the regulated processes.\n\n-Formal authorization systems (i.e., management of change procedure, pre-startup safety review) are in place to ensure that system changes or expansions are as safe as the original design and that an independent recheck confirms that the changes are consistent with the engineering design and in a condition to be safely operated prior to startup.\n\n-Events that might (or did) cause an accidental or unexpected release of a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 10985,
      "SummaryText": "hazardous chemical are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent recurrence.\n\n-Contractors that are hired to work on, or adjacent to, regulated processes are \"pre-qualified\" based on their knowledge of the system, understanding of applicable codes and standards, written safety and training programs, and their demonstrated ability to work safely.\n\n-Prior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, grinding), management must approve the work by executing a written hot work authorization permit to verify that precautions to prevent fire have been implemented.\n\n-Periodic inspections of the external surface of tanks and manifolds are used to detect any indication of potential failure that could lead to a release.\n\n-Utilization of safety systems, including pressure relief valves, manual shut-off valves, and safety interlocks.\n\n-Proper design, including adherence to recognized safety codes.\n\n-Adherence to fire codes, including National Fire Protection Association (NFPA) 58, and preparation for fires, storms, or events that could impact regulated processes.\n\n-Planning in accordance with Spokane County Fire District 3 to ensure a rapid response to potential incidents with the regulated processes or external events.\n\n-Prevention program compliance audits performed every three years to verify that the appropriate management systems are in place and are being properly implemented.  Any deficiency found is corrected.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe BFGoodrich Spokane Facility is subject to the following regulations which are related to emergency response:\n\n-OSHA's Emergency Action Plan Regulation - 29 CFR 1910.38(a)\n\n-OSHA's Process Safety Standard - 29 CFR 1910.119\n\n-OSHA's HAZWOPER Regulation - 29 CFR 1910.120\n\n\nThe Spokane Facility has consolidated these requirements into the Safety Manual.  The Safety Manual allows the f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 10985,
      "SummaryText": "acility to effectively manage its emergency response-related efforts while eliminating redundancy and excessive documentation.  \n\nIssues addressed in the facility\u0012s emergency response program include:\n\n7 Emergency escape procedures and emergency escape route assignments;\n\n7 Procedures to be followed by employees who remain to operate critical plant operations before they evacuate;\n\n7 Procedures to account for all employees after emergency evacuation has been completed;\n\n7 Rescue and medical duties for those employees who are to perform them and procedures/facilities for off-site emergency medical care;\n\n7 The preferred means of reporting fires and other emergencies;\n\n7 Names of persons or departments who can be contacted for further information or explanation of duties under the plan;\n\n7 Designation and training of a sufficient number of persons to assist in the safe and orderly evacuation of employees;\n\n7 The names of personnel: (1) responsible for maintenance of equipment and systems installed to prevent or control ignition, and (2) responsible for control of fuel source hazards;\n\n7 Regular and proper maintenance of systems installed on heat producing equipment to prevent accidental ignition of combustible materials;\n\n7 Procedures for handling releases from PSM-regulated processes;\n\n7 Pre-emergency planning and coordination with outside parties (e.g., fire department, police department, hospital);\n\n7 Emergency recognition and prevention;\n\n7 Decontamination;\n\n7 Emergency medical treatment and first aid;\n\n7 Emergency alerting and response procedures; and\n\n7 Personal Protective Equipment (PPE) and emergency equipment."
    }
  ]
}