{
  "FacilityID": 11091,
  "FacilityName": "TruServ Manufacturing",
  "FacilityStr1": "201 Jandus Road",
  "FacilityStr2": null,
  "FacilityCity": "Cary",
  "FacilityState": "IL",
  "FacilityZipCode": "60013",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17111",
  "LEPC": "McHenry County LEPC",
  "FacilityLatDecDegs": "42.205806",
  "FacilityLongDecDegs": "-88.237972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6929681,
  "ParentCompanyName": "TruServ Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6929681,
  "Company2DUNS": 0,
  "OperatorName": "Robert Simmons",
  "OperatorStr1": "201 Jandus Road",
  "OperatorStr2": null,
  "OperatorCity": "Cary",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60013",
  "OperatorZipCodeExt": "2861",
  "FTE": 300,
  "OtherEPAFacilityID": "ILD010238491",
  "EPAFacilityID": "100000083447",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.20659,
  "FRS_Long": -88.23651,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14521,
      "AltID": null,
      "FacilityID": 11091,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 17703,
          "ProcessID": 14521,
          "ChemicalID": 155,
          "Quantity": 250000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 9318,
              "ProcessChemicalID": 17703,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 9319,
              "ProcessChemicalID": 17703,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 14878,
          "ProcessID": 14521,
          "NAICSCode": "32551",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 14879,
          "ProcessID": 14521,
          "NAICSCode": "339994",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11091,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Village of Cary Fire Department",
    "CoordinatingAgencyPhone": "8476390003",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11091,
      "SummaryText": "\n1.0    SOURCE AND PROCESS DESCRIPTION\n1.1    SOURCE\nThe TruServ Manufacturing Company (TruServ) facility located in Cary, \nIllinois, is subject to the United States Environmental Protection Agencys \n(USEPAs) Risk Management Program (RMP) for Accidental Chemical Release \nregulation (40 CFR 68) because it has two independent processes that \ncontain mixtures of propane (Chemical Abstract System [CAS] number 74-\n98-6) and n-butane (CAS number 106-97-8) exceeding 10,000 pounds.  The \nmixtures are used as propellant for aerosol paint cans.  The two processes \nare: (1) propellant injection into aerosol cans (the propellant process), and \n(2) finished goods warehousing.\n\nPropellant is a gas at ambient temperature and pressure and is stored in \nan 18,200-gallon water capacity storage tank at a pressure of \napproximately 70 to 80 pounds per square inch gauge (psig).  \nAdministrative controls in place at the facility, including written loading \nprocedures, limit the tank fill volume to 85 percent of capacity, resulting in \na maximum on-site propellant mass of 68,548 pounds.  The storage tank \nand transfer piping are located outdoors.\n\nFinished goods are transferred to the on-site warehouse for storage and \ndistribution.  Mixtures of propellant, flammable liquids, and paint solids \nare stored in 15- to 20-ounce cans.  Approximately 250,000 pounds of \npropellant may be stored in the well-protected warehouse at any one time.\n\nPropellant is a flammable and potentially explosive gas.  The propellant is \nnot inherently toxic.\n\n1.2    PROCESS DESCRIPTION\nThe TruServ propellant filling system consists of the single storage tank, \npiping from the storage tank to a small propellant fill room, and two \naerosol can filling machines.  A pump is used to transfer the propellant \nfrom the storage tank into the propellant fill room.  The filling machine \nregulates the incoming pressure of the propellant and injects the \npropellant into 15- to 20-ounce aerosol cans.  The equipment and \ninterconnectin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11091,
      "SummaryText": "g piping are part of a closed system, thereby minimizing the \npotential of a large release.\n\nThe propellant filling system is protected by specific safety systems and \nhardware which include safety relief valves, excess flow valves, and safety \ninterlocks and alarms.  Safety relief valves protect the storage tank and the \npiping to the propellant filling machine.  Excess flow valves are located at \nall inlet and outlet connections to the storage tank.  The excess flow valves \nclose if a larger-than-normal flow of propellant from the vessel were to \noccur.  Gas detectors and alarms within the filling room monitor the \nambient air to ensure proper operation of the system.  Abnormally high \nconcentrations of propellant within the propellant fill room will actuate \nspecial exhaust equipment and, if levels continue to rise, shut down the \nprocess.\n\nOnce filled and packaged, cartons of aerosol cans are transferred to the \nfinished goods warehouse.  In the warehouse, the cans are stored in a fully \nsprinklered rack system until they are shipped off site.\n2.0    POTENTIAL RELEASE SCENARIOS\n2.1    PROPELLANT PROCESS\nPropellant filling is accomplished in a closed system.  Historical releases of \npropellant have included only small volumes infrequently released from \nthe filling machine inside the propellant fill house.  While these incidents \ncan impact employees, they have not historically lead to a release that \nwould result in a potential off-site impact.\n\nConsistent with the RMP rule requirements, two specifically defined \nrelease scenarios, a worst-case release and an alternative release, were \nanalyzed to determine the maximum distance to predetermined \nendpoints.  The release scenarios analyzed and the endpoints evaluated \nare based on the guidance contained in the USEPAs Risk Management \nProgram Guidance for Propane Storage Facilities (The Propane Guidance), \ndated March 4, 1998, and the USEPAs Offsite Consequence Analysis \nGuidance (OCAG) dated April 1998.\n\n2.1.1    Wor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11091,
      "SummaryText": "st-Case Scenario\nThe worst-case scenario assumes that a catastrophic failure of the \npropellant storage tank results in a release of the largest quantity of \npropellant stored at the facility.  Administrative controls limit this \nmaximum quantity to 15,470 gallons or 65,548 pounds.  In the worst-case \nscenario, the released material is assumed to form a vapor cloud which \ncomes into contact with an ignition source and detonates.  The endpoint \nfor this release is defined as an overpressure of 1 psi caused by the \nexplosion and is considered the threshold for potential serious injuries to \npeople as a result of property damage caused by an explosion.  The \ndistance to the endpoint for the worst-case scenario is 0.33 miles (1,745 \nfeet).\n\nAlthough the worst-case consequence analysis is required by the RMP \nrule, a worst-case occurrence is considered a highly unlikely event.  The \nlikelihood of a catastrophic failure of the storage tank is extremely remote \nbecause of the following:\n\n  The storage tank is designed and constructed in accordance with the \nAmerican Society of Mechanical Engineers (ASME) Boiler and Pressure \nVessel Code (Section VIII).  The tank is operated well below its design \npressure of 250 psig and, because of safety factors built into the ASME \nCode, significantly higher pressures would be required to cause \ncatastrophic failure of the tank.\n\n  Access to the tank by unauthorized personnel is prevented through \nfencing and guarded entranceways.  The tanks placement separated \nfrom most plant activities minimizes the potential for inadvertent \ncontact with plant traffic.\n\n  The appearance of the external surface of the storage tank is visually \ninspected on a routine basis and repairs are arranged when necessary.\n\n  The vessel is designed, installed, operated, and maintained in \naccordance with National Fire Protection Association (NFPA) Liquefied \nPetroleum Gas Code (NFPA 58).\n\n  The vessel is protected from overpressure through the installation of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11091,
      "SummaryText": "\ntwo safety relief valves (SRVs).\n\n  The propellant is non-corrosive.\n\n2.1.2    Alternative-Release Scenario\nUSEPA specifies that an alternative-release scenario be evaluated that is \nmore likely to occur than the worst-case scenario and is significant \nenough to impact off-site areas (i.e., the endpoint must be located beyond \nthe facility boundary).\n\nBecause the TruServ facility has not experienced a propellant release to \nuse as a model alternative scenario, the scenarios discussed in the \nUSEPAs OCAG and Propane Guidance documents were considered the \nmost appropriate for analysis.  The release scenario chosen assumes that \nthe two safety relief valves lift for a 5-minute period.  The resulting vapor \ncloud is assumed to contact an ignition source and a vapor cloud fire \nresults.  No active  or passive  mitigation is assumed for this scenario.  The \nendpoint for this release, the lower flammability limit (LFL), is considered \nto provide a reasonable, but not overly conservative, estimation of the \npossible extent of a vapor cloud fire.  The LFL for the propellant is 1.8 \npercent.  The distance to the endpoint for the alternative-release scenario is \n0.10 miles (528 feet).\n\nAlthough an alternative-case release consequence analysis is required by \nthe RMP rule, a release that is large enough to reach an endpoint beyond \nthe facility boundary is not likely to occur.  The facility has never \nexperienced an SRV release resulting from vessel overfilling.  \nAdditionally, the facility has a training course for propellant system \noperators that includes the vessel filling task, requires its operators to \nregularly monitor the level gauge during filling operations, and requires \noperators to remain present during all offloading operations.  Also, \npropellant vapor that is released may disperse without harmful effects.\n\n2.2    FINISHED GOODS WAREHOUSE\n2.2.1    Worst-Case Scenario\nConsistent with the RMP rule requirements, a worst-case release from the \nlargest single container w"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11091,
      "SummaryText": "as analyzed to assess the maximum distance to a \nflammable endpoint.  The release scenarios analyzed and the endpoints \nevaluated are based on the guidance contained in the USEPAs Propane \nGuidance and the OCAG.\n\nThe worst-case scenario assumes that failure of the largest single \ncontainer, a 20-ounce aerosol can, results in a release of propellant and \nflammable liquid vapor.  The released material is assumed to form a vapor \ncloud which comes into contact with an ignition source and detonates.  \nThe endpoint for this release is defined as an overpressure of 1 pound per \nsquare inch caused by the explosion and is considered the threshold for \npotential serious injuries to people as a result of property damage caused \nby an explosion.  Based on the contents of a 20-ounce aerosol can, the \ndistance to the endpoint for a worst-case release is 35.3 feet (0.007 miles), \nwhich is contained within the building.  No public receptors are located \nwithin the endpoint distance.  \n3.0    ACCIDENT HISTORY\nThere have been no accidental releases of propellant at the TruServ Cary \nfacility in the last 5 years that have resulted in death, injury, or significant \nproperty damage on site or off-site death, injury, property damage, \nevacuation , sheltering in place, or environmental damage site.\n4.0    PREVENTION PROGRAM\n4.1    PROPELLANT PROCESS\nTruServe has carefully considered the potential for accidental releases of \npropellant, such as the aforementioned occurrences of the worst-case and \nalternative-release scenarios.  To help minimize the probability and \nseverity of a propellant release, a prevention program that satisfies the \nOccupational Safety and Health Administration (OSHA) Process Safety \nManagement (PSM) of Highly Hazardous Chemicals standard \n(29 CFR 1910.119) has been implemented at the Cary, Illinois, facility.  The \nmajor objective of this prevention program is to implement a management \nsystem that prevents releases of propellant, especially in situations that \ncould expo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11091,
      "SummaryText": "se employees and others to serious hazards.  The program \nemploys a systematic approach to evaluating the whole process including \nprocess design, process technology, process changes, operational and \nmaintenance activities and procedures, non-routine activities and \nprocedures, emergency preparedness and procedures, training programs, \nand other interrelated elements that effect the propellant system.\n\nThe key components of the prevention program are summarized below:\n\n  Process safety information regarding the propellant system has been \ndeveloped, documented, and made available to facility operators.  This \ninformation is used to fully understand and safely operate the \npropellant system.\n\n    The performance of a formal process hazard analysis (PHA) on the \npropellant system using the What-if... technique.  A team with \nexpertise in engineering, operations, maintenance, and safety \nevaluates the existing system in depth and developed \nrecommendations to improve the safety and operability of the \npropellant system.  The PHA addresses: (1) process hazards; \n(2) previous incidents; (3) engineering and administrative controls \napplicable to the hazards; (4) the consequence of control failure; \n(5) facility siting; (6) human factors; and (7) a qualitative evaluation of \npossible safety and health effects of control system failures.  The PHA \nresulted in multiple procedural and/or hardware recommendations \nto improve the safety and operation of the propellant system.  \nTruServe has resolved all of the PHA recommendations.  The PHA \nwill be updated and revalidated every 5 years.\n\n    Written standard operating procedures (SOPs) are used to provide the \nbasis for proper and safe operation of the propellant system.  The \nSOPs include procedures for normal operation, startup, shutdown, \nemergency operation, and emergency shutdown.\n\n    Formal authorization systems are in place to ensure that system \nchanges or expansions are as safe as the original design, and that an \nindepe"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11091,
      "SummaryText": "ndent recheck confirms that the changes are consistent with the \nengineering design and can be safely operated prior to startup.\n\n    Operators and mechanics working in the propellant fill building or \nwho are responsible for unloading propellant from tank cars receive \ntraining on the process hazards, process safety information, SOPs and \nemergency response actions related to the propellant system.  The \ntraining program ensures that the operators understand the nature \nand causes of problems arising from system operations and serves to \nincrease awareness of the hazards particular to the propellant system.\n\n    A mechanical integrity program has been implemented and includes:  \n(1) routine system inspections to identify unusual or increasing \nvibration, incipient leaks, or other indications of potential upsets or \nfailures; (2) replacement or testing of pressure relief valves on the \nstorage tank every 10 years; and (3) periodic testing of gauges, \nmonitoring devices, and safety interlocks.\n\n    Prior to the performance of any hot work (i.e., spark or flame \nproducing operations such as welding, cutting, brazing, grinding), the \nwork must be approved by executing a written hot work permit to \nverify precautions have been implemented to prevent fire.\n\n    Contractors that are hired to work on, or adjacent to, the propellant \nsystem are pre-qualified based on their knowledge of propellant \nsystems and their demonstrated ability to work safely.\n\n    All incidents that cause or might have caused an accidental or \nunexpected release of propellant are subject to a formal investigation.\n\n    A compliance audit of the prevention program is completed every \n3 years to verify that the appropriate management systems are in \nplace and are being properly implemented.\n\n    The prevention program includes an extensive employee participation \nprogram involving TruServ employees from all levels of the \norganization and from all areas within the plant (i.e., production and \nmaintenance).  This"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11091,
      "SummaryText": " program considers that employees who work on \nthe propellant system are the most knowledgeable about it and are \nbest able to easily, effectively, and regularly recommend changes or \nimprovements which enhance safety.\n\n4.2    FINISHED GOODS WAREHOUSE \nAlthough a formal, documented prevention program is not required by \nthe RMP rule for Program 1 processes, a number of design and operational \ncontrols are in place to decrease the severity or prevent the occurrence of a \nfire or explosion.  The most significant controls are described below.\n\n    The warehouse is designed as an aerosol storage area per the NFPA \nManufacture and Storage of Aerosol Products (NFPA 30B).\n\n    The rack storage system is designed for flammable materials storage \nper the NFPA Code for the Rack Storage of Material (NFPA 231C).\n\n    Potential sources of ignition are restricted from the warehouse.\n\n     The warehouse and rack system are fully sprinklered.\n5.0    EMERGENCY RESPONSE PROGRAM\nThe TruServ, Cary facility has implemented a detailed written Emergency \nAction Plan (EAP).  The EAP is intended to address all emergencies at the \nfacility, including incidents related to a release of propellant.\n\nThe EAP includes awareness and response training for plant employees, \ncoordination with the local fire department, and evacuation of personnel \nin the facility.  The EAP identifies specific individuals and their \nresponsibilities, and identifies procedures for emergency medical care.\n\n\nCERTIFICATION BY SOURCE\n\n\nIn accordance with 40 CFR 68.185, I hereby certify that the information \nand Risk Management Plan for anhydrous ammonia, contained herein, is \nto the best of my knowledge, information, and belief formed after \nreasonable inquiry, true, accurate, and complete.\n\n\n\n                    ________________________________\n                    Signature\n\n\n                    ________________________________\n                    Robert E. Simmons\n\n\n                    Vice President of Manufacturing\n                    Title\n      Active mitigation means equipment, devices, or technologies that require hu"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11091,
      "SummaryText": "man, \nmechanical, or other energy input to function.  Active mitigation for compressed \ngases may include automatic shut-off valves, rapid transfer systems, and scrubbers.\n      Passive mitigation means equipment, devices, and technologies that function without \nhuman, mechanical, or other energy input.  Examples include enclosures \n(e.g., buildings) for compressed gases and secondary containment dikes for liquids.\n      Please note that the USEPAs RMP*Submit software, version 1.0.7, does not allow \nentry of such a small release amount and endpoint distance.  The release amount in \nthe data elements section of RMP*Submit is, therefore, reported as 1 pound and the \nendpoint distance as 0.01 miles.\n\n"
    }
  ]
}