{
  "FacilityID": 11208,
  "FacilityName": "Natural Gas Odorizing, Inc.",
  "FacilityStr1": "3601 Decker Drive",
  "FacilityStr2": null,
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77522",
  "Facility4DigitZipExt": "1429",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Baytown Area LEP",
  "FacilityLatDecDegs": "29.760833",
  "FacilityLongDecDegs": "-95.0125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.oxychem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 131119299,
  "ParentCompanyName": "Occidental Petroleum Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6908354,
  "Company2DUNS": null,
  "OperatorName": "Occidental Chemical Corporation",
  "OperatorStr1": "3601 Decker Drive",
  "OperatorStr2": null,
  "OperatorCity": "Baytown",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77522",
  "OperatorZipCodeExt": "1429",
  "FTE": 51,
  "OtherEPAFacilityID": "77520NTRLG3601D",
  "EPAFacilityID": "100000097049",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not Available",
  "SafetyInspectionDate": "1999-04-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.76245,
  "FRS_Long": -95.00577,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 14919,
      "AltID": "Mercaptan Manufacturing",
      "FacilityID": 11208,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 18481,
          "ProcessID": 14919,
          "ChemicalID": 122,
          "Quantity": 125000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 18482,
          "ProcessID": 14919,
          "ChemicalID": 131,
          "Quantity": 124000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 18483,
          "ProcessID": 14919,
          "ChemicalID": 105,
          "Quantity": 1600000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 18484,
          "ProcessID": 14919,
          "ChemicalID": 129,
          "Quantity": 108500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15284,
          "ProcessID": 14919,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7594,
              "Process_NAICS_ID": 15284,
              "SafetyReviewDate": "1999-05-07 00:00:00",
              "PHA_Date": "1997-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-05-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-26 00:00:00",
              "TrainingReviewDate": "1999-04-26 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-15 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "V-0100 (Tank Replacement)",
              "ChangeMgmtDate": "1999-04-26 00:00:00",
              "ChangeMgmtReviewDate": "1997-01-01 00:00:00",
              "PreStartupReviewDate": "1999-04-26 00:00:00",
              "ComplianceAuditDate": "1998-05-01 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1999-02-03 00:00:00",
              "InvestigationChangeDate": "1999-02-19 00:00:00",
              "ParticipationPlansReviewDate": "1998-10-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-19 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-25 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10374,
                  "PreventionProgram3ID": 7594,
                  "ProcessChemicalID": 18481
                },
                {
                  "PrimaryKey": 10375,
                  "PreventionProgram3ID": 7594,
                  "ProcessChemicalID": 18482
                },
                {
                  "PrimaryKey": 10376,
                  "PreventionProgram3ID": 7594,
                  "ProcessChemicalID": 18483
                },
                {
                  "PrimaryKey": 10377,
                  "PreventionProgram3ID": 7594,
                  "ProcessChemicalID": 18484
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11208,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-03-10 00:00:00",
    "ERTrainingDate": "1999-03-18 00:00:00",
    "CoordinatingAgencyName": "Baytown LEPC",
    "CoordinatingAgencyPhone": "2814206558",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.119(n), 1910 Subpart L, 40 CFR 355.30"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 11208,
      "SummaryText": "s and actions required to mitigate and control an emergency.  The plan includes utilization of pre-arranged available mutual aid organizations including the OxyChem Houston Regional Emergency Response Organization, Channel Industries Mutual Aid Organization, and the Baytown Fire Department.  If an emergency presents the probability to extend beyond facility boundaries, the local Community Awareness & Emergency Response (CAER) Plan is initiated.  This involves a call to 911 to inform and activate the City of Baytown Emergency Management Organization and alarm system, and another call to a designated CAER line where citizens can call and receive specific information on the emergency.\n\nThe Facility is an active participant in the community:  The Natural Gas Odorizing, Inc. facility is an active participant in plant and community programs which promote education, safety and environmental awareness.  As part of OxyChem's Responsible Care. efforts, the Natural Gas Odorizing, Inc. facility has voluntarily been involved in a Community Advisory Panel (CAP) since 1992. The purpose of this group is to share information regarding plant operations with members of the community and to discuss their concerns.  Through this outreach effort, as well as other community involvement, the plant stays abreast of community concerns and works to address them.  The Natural Gas Odorizing, Inc. facility is also an active participant in the Local Emergency Planning Committee (LEPC) and participates in emergency and event prevention and preparedness planning as well as community outreach education programs.  One example is the LEPC shelter in place program in which local industry employees travel to area elementary schools and conduct training regarding the Baytown emergency alarm system and what actions to take when the alarm sounds.\n\nAlthough the risk management program at Natural Gas Odorizing, Inc. helps provide assurance that the facility is maintained and operated in a safe manner, it is"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11208,
      "SummaryText": "only one component of the safety, health and environmental program at the Natural Gas Odorizing, Inc. facility.  Natural Gas Odorizing, Inc. has a comprehensive safety, health and environmental program in place establishing many levels of safeguards against release of a hazardous substance and injuries and damage from a release of a hazardous substance.  This RMP Plan is primarily intended to describe those parts of the safety, health and environmental program at the Natural Gas Odorizing, Inc. facility that are required by the RMP rule.  \n\n2. The Stationary Source and Regulated Substances Handled (' 68.155(b)):\n\nThe Natural Gas Odorizing, Inc. facility handles four regulated substances in sufficient quantity to be covered by the RMP rule and falls under the Level 3 Program at the plant.\n\n                                                                                                  Largest Vessel\nRegulated Substance                    \t     Process           \t            Inventory, lb.     \t         RMP Threshold, lb.\nButene, 2                                       \t   Storage Tank     \t              125,000                   \t            10,000\nButylene, iso (2-methylpropene)   \t   Storage Tank     \t              124,750                   \t            10,000\nEthyl Mercaptan                             \t   Storage Tank                      161,920                  \t            10,000\nPropylene                                       \t   Storage Tank    \t               108,500                   \t            10,000\n\n2-Butene\n\nThe material 2-butene is used at the Natural Gas Odorizing, Inc. facility as a raw material.  The 2-butene is used in a reaction with hydrogen sulfide to form secondary butyl mercaptan.  The 2-butene is vaporized and mixed with the hydrogen sulfide.  There is no bulk storage of the hydrogen sulfide material, the hydrogen sulfide source is a direct pipeline from a neighboring facility.  The resultant gas mixture flows through a catalytic bed to f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11208,
      "SummaryText": "orm the secondary butyl mercaptan.  The reaction is represented as H2S + 2-C4H8 U C4H10S.  Secondary butyl mercaptan is used as a component in gas odorant blends.\n\n2-Methylpropene\n\nThe material 2-methylpropene, commonly known as isobutylene, is used at the Natural Gas Odorizing, Inc. facility as a raw material.  The isobutylene is used in a reaction with hydrogen sulfide to form tertiary butyl mercaptan.  There is no bulk storage of the hydrogen sulfide material, the hydrogen sulfide source is a direct pipeline from a neighboring facility.  The resultant gas mixture flows through a catalytic bed to form the tertiary butyl mercaptan.  The reaction is represented as H2S + iso-C4H8 U C4H10S.  Tertiary butyl mercaptan is used as a component in gas odorant blends and as a raw material for the manufacture of agricultural products.\n\nEthyl Mercaptan\n\nEthyl mercaptan is a finished product at the Natural Gas Odorizing, Inc. facility.  Ethyl mercaptan is formed by the reaction of ethylene with hydrogen sulfide.  There is no bulk storage of ethylene or hydrogen sulfide, both materials are supplied directly from pipelines.  The ethylene is mixed with the hydrogen sulfide.  The resultant gas mixture flows through a catalytic bed to form the ethyl mercaptan.  The reaction is represented as H2S + C2H4 U C2H6S.  Ethyl mercaptan is used as an odorant in liquefied petroleum gases (propane) and as a raw material for the manufacture of agricultural products.\n\nPropylene\n\nThe material propylene is used as a raw material at the Natural Gas Odorizing, Inc. facility.  The propylene is used in a reaction with hydrogen sulfide to form propyl mercaptan.  There is no bulk storage of the hydrogen sulfide material, the hydrogen sulfide source is a direct pipeline from a neighboring facility.  The propylene is vaporized and mixed with the hydrogen sulfide.  The resultant gas mixture flows through a catalytic bed to form the propyl mercaptan.  The reaction is represented as H2S + C3H6 U C3H8S.  Prop"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11208,
      "SummaryText": "yl mercaptan is used as a component in gas odorant blends.\n\n3.   The Worst-Case Release Scenario(s) and the Alternate Release Scenario(s), Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario (' 68.155(c)):\n\nThe EPA Offsite Consequence Analysis Guidance document was used for evaluating the estimation of distance to overpressure endpoint for the flammable substance worst case scenario.  The worst-case consequence distance for the flammable substance was calculated directly using equation C-1.  The EPA Offsite Consequence Analysis Guidance document was also used for evaluating the estimation of distance to overpressure endpoint as well as estimating the endpoint distance to second degree burns.  United States Geological Survey (USGS) maps were utilized for evaluating the potential public and environmental receptor locations regarding the evaluated distances.\n\nThe following information summarizes the off-site consequence analysis performed by the Natural Gas Odorizing, Inc. facility:\n\n3.1.  Toxic Substances\n\nThere are no regulated toxic substances in quantities above the threshold quantities at Natural Gas Odorizing, Inc. facility.\n\n3.2 Program 3 Processes-Flammable Substances\n\nThe worst case release scenario for flammable substances.  The Natural Gas Odorizing, Inc. facility has derived the most significant flammable worst case release scenario to be the Ethyl Mercaptan flammable substance.  The flammable worst case scenario involves the vaporization of the maximum inventory of Ethyl Mercaptan in accordance with the guidelines specified.  The scenario assumes the instantaneous failure of the Ethyl Mercaptan finished product storage tank and the entire tank contents of 161,920 pounds is spilled and evaporates within 10 minutes forming a combustible vapor cloud mixture.  The scenario assumed failure of all active and passive safety mitigation systems.  The scenario determines the presence of an ignition source cau"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11208,
      "SummaryText": "sing the vapor cloud to explode.  The worst case flammable release impacts a distance from the source of the release of 0.37 miles.  USGS maps indicate that no public receptors such as residences, parks, or schools are located within this distance.  Only two commercial areas are located within this distance.  There are no environmental receptors within this distance.\n\nThe alternative case release scenario for flammable substances.  The Natural Gas Odorizing, Inc. facility also evaluated regulated flammable substances to determine the most significant credible alternative case release scenario.  The alternative scenario for a flammable substance could credibly be the release of Ethyl Mercaptan as a result of a puncture or pipe shear in a 2-inch Ethyl Mercaptan product transfer line.  This scenario considers reasonable alert and emergency response times and is the result of a review of all possible credible release scenarios.  Passive and active mitigation measures were considered and determined to isolate the release in 10 minutes time resulting in 352 pounds of Ethyl Mercaptan released.  The scenario determines the Ethyl Mercaptan evaporates forming a combustible vapor cloud and that an ignition source is present causing the vapor cloud to explode.  The vapor cloud explosion release evaluation impacts a distance of 90 feet from the source.  A pool fire evaluation determined a distance to second-degree burns to be 47 feet.  Both of these distances from the source are determined to be within the boundaries of the Natural Gas Odorizing, Inc. facility.  To comply with the regulatory requirement, no worst case and alternative case release scenarios are presented for other flammable chemicals for the facility.\n\n4. The General Accidental Release Prevention Program and the Specific Prevention Steps (' 68.155(d)):\n\nNatural Gas Odorizing, Inc. has used an on-going prevention program to help prevent accidental releases of hazardous substances in complying with  Extremely Haz"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11208,
      "SummaryText": "ardous Substance Regulations.  This prevention program for the manufacturing and storage processes comply with the 14 elements of the OSHA Process Safety Management (PSM) prevention program.  In 1996, the EPA RMP rule established additional levels of prevention requirements similar to OSHA PSM, except the RMP also focuses on protecting the public and the environment outside the plant's fence line;\n\nThe following sections briefly describe the elements of  EPA's RMP rule prevention program requirements.\n\n4.1 Natural Gas Odorizing, Inc. Prevention Program\n\nThe Natural Gas Odorizing, Inc. Facility's Prevention Program consists of the following 12 elements:\n\n4.1.1  Process Safety Information \nNatural Gas Odorizing, Inc. maintains technical documents which are used to help ensure safe operation of the plant processes. These documents address (1) physical properties of hazardous substances handled at the plant, (2) operating parameters of the equipment used at the plant and (3) design basis and configuration of the equipment at the plant.  The Facility ensures that this Process Safety Information is available to all employees. \n\nMaterial safety data sheets (MSDS's) document the physical properties of the hazardous materials handled at the plant, including regulated substances in covered processes. The information available for each hazardous substance typically includes:\n7 Toxicity information and permissible exposure limits \n7 Physical data (e.g., boiling point, melting point, flash point) \n7 Reactivity and corrosivity data \n7 Thermal and chemical stability data \n7 Hazards of mixing substances in the process\n\nMSDSs for hazardous substances handled in each process are available from the plant's Health, Environmental, and Safety Department.  MSDS's for the hazardous substances within each operating area of the plant are maintained at the Annex Administration building in an open accessible location so that the plant population has ready reference and access to this informati"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 11208,
      "SummaryText": "on.\n\nThe engineering design documents include the operating parameters and the design basis and configuration of the equipment in each covered process.  The available information includes:\n7 Operating parameters\n7 Process flow diagrams\n7 Process chemistry\n7 Maximum intended inventories\n7 Safe upper and lower limits for parameters such as temperature, pressure, or flow\n7 Design basis and configuration of equipment\n7 Piping and instrumentation diagrams, including materials of construction\n7 Electrical classification\n7 Safety systems\n7 Applicable design codes and standards\n7 Design basis for relief and ventilation systems\n\nThese documents are used to (1) train employees, (2) perform process hazards analyses and (3) help maintain the equipment.\n\n4.1.2 Process Hazard Analysis\nNatural Gas Odorizing, Inc. performs and periodically updates process hazard analyses (PHA's) of the covered process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with safety, environmental, engineering, and process operating experience and a leader with process hazard analysis experience is assembled to analyze the hazards of the process.  The plant primarily uses the HAZOP and what-if checklist techniques to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned and, as appropriate, changes to enhance the safety of the process are implemented.\n\n4.1.3 Operating Procedures\nNatural Gas Odorizing, Inc. facility process engineers, operators and supervision work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  Operating procedures  cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or e"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 11208,
      "SummaryText": "mergency shutdown and temporary operations.  The operating procedures are used both to help in operating the plant's processes and as a training guide.\n\n4.1.4 Training\nThe Natural Gas Odorizing, Inc. facility trains its workers to safely and effectively perform their assigned tasks.  The operations training includes (1) a general overview of the process, (2) the properties and hazards of the substances in the process and (3) a review of  operating procedures and safe work practices.  Oral reviews and 90 day peer mentoring reviews are used to demonstrate proficiency and verify that an employee understands the training material before the employee can resume work in the process. \n\n4.1.5 Mechanical Integrity\nThe Natural Gas Odorizing, Inc. facility maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public or the environment.  The mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plant's processes.  The mechanical integrity program includes:\n7 Specifications for inspection and testing of process equipment \n7 Specifications for replacement parts and equipment \n7 Procedures for inspecting, testing and maintaining process equipment \n7 Procedures for safe work practices such as Lock, Tag and Try; Hot Work; Confined Space Entry; and Line Breaking\n7 Training of maintenance personnel \n7 Documentation of maintenance activities\n\n4.1.6 Management of Change\nThe Natural Gas Odorizing, Inc. facility management of change program evaluates and approves all proposed changes to chemicals, equipment and procedures for a covered process to help ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g., repla"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 11208,
      "SummaryText": ".  The plant conducts audits of the contractor's work performance on each job to help ensure that safe practices are followed.\n\n5      Five-year Accident History (' 68.155(e)):\n\nIt is the policy of the Natural Gas Odorizing, Inc. facility to investigate even minor incidents of chemical release in order to learn how to make system improvements.  There have been incidents of this nature investigated in the past 5 years related to the chemicals studied which were not reportable under environmental regulations.  However, there have been no incidents resulting in community impact requiring evacuation, shelter in place, or response assistance from agencies or groups outside the Natural Gas Odorizing, Inc. facility.\n\n6. The Emergency Response Program (' 68.155(f)).\n\nThe Natural Gas Odorizing, Inc. facility has established a written emergency response plan and maintains an emergency response team trained in these emergency response procedures.  All plant personnel are trained in evacuation procedures. The written emergency response plan complies with the following federal and state contingency plan regulations:\n\n7 OSHA 29 CFR 1910.38(a) - Employee Emergency Action Plans\n7 OSHA 29 CFR 1910.119 (n) - Process Safety Management of Highly Hazardous Chemicals\n7 OSHA 29 CFR 1910.120(p) and (q) -  Hazardous Waste Operations and Emergency Response (HAZWOPER)\n7 OSHA 29 CFR 1910, Subpart L - Fire Protection\n7 EPA 40 CFR 302.6 - Notification Requirements\n7 EPA 40 CFR 355.30 - Facility Coordinator and Emergency Response Plan\n7 EPA 40 CFR 355.40 - Emergency Planning and Release Notifications\n7 EPA 40 CFR 112 - Spill Prevention, Control and Countermeasures Plan\n7 EPA 40 CFR 265 - RCRA Sub part D\n7 EPA 40 CFR 68 - Risk Management Programs for Chemical Accidental Release Prevention.\n\nThe Natural Gas Odorizing, Inc. facility Emergency Response Team trains with the OxyChem Houston regional response group.  Scheduled regional training utilizes specialized instructors and regional equipment.  T"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 11208,
      "SummaryText": "cing a valve with an identical valve) are allowed without completing a full management of change program.  All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified or trained (if necessary) of the changes.\n\n4.1.7 Pre-startup Review\nThe Natural Gas Odorizing, Inc. facility performs a Pre-Startup Safety Review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely.  This review confirms that:\n7 Construction and equipment are in accordance with design specifications\n7 Adequate safety, operating, maintenance and emergency procedures are in place\n7 Employee training has been completed \n7 For a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified\n\n4.1.8 Compliance Audit\nThe Natural Gas Odorizing, Inc. facility audits covered processes every 3 years to be certain that the prevention program is effectively addressing the safety issues of operations at the plant.  The results of the audit are documented, recommendations are resolved and appropriate enhancements to the prevention program are implemented.  Both Occidental Petroleum Corporation and Occidental Chemical Corporation perform audits of the facility programs, process and documentation at regular intervals. \n\n4.1.9 Incident Investigation\nThe Natural Gas Odorizing, Inc. facility investigates incidents, including near misses, that could reasonably have resulted in a serious injury to personnel, the public or the environment so that similar incidents can be prevented in the future.  The plant trains employees to identify and report any incident requiring investigation.  An investigation"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 11208,
      "SummaryText": "team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved and appropriate process enhancements are implemented.  The Facility has a formal program including training for incident investigations and the report generation.\n\n4.1.10 Employee Participation\nThe Natural Gas Odorizing, Inc. facility developed a written employee participation program for all covered processes to help ensure that the safety concerns of the plant's workers are addressed.  The plant encourages active participation of personnel in the prevention program activities of all processes at the plant.  Employees are consulted on, and informed about, all aspects of the RMP rule prevention program, including PHAs, MOCs and operating procedures.\n\n4.1.11 Hot Work Permits\nThe Natural Gas Odorizing, Inc. facility established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at the plant.  The plant reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Safe Work Permit Form to comply with these requirements.  Personnel who are to perform hot work are required to obtain a Safe Work Permit for Hot Work from the Production Superintendent designee.  Training in the use of the Hot Work Permit is included in the plant's safe work practices orientation and training.\n\n4.1.12 Contractors\nThe Natural Gas Odorizing, Inc. facility established a program to help ensure that contractor activities at the plant are performed in a safe manner.  The plant explains to the contract supervisors the hazards of the process on which they and their employees will work, the plant's safe work practices, and the plant's emergency response procedures.  The plant requires that the contractor supervisors train each of their employees who will work at the plant before that worker begins work at the plant site"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 11208,
      "SummaryText": "he OxyChem Houston regional response group is committed to provide response hardware and personnel to Natural Gas Odorizing, Inc. events.  The Natural Gas Odorizing, Inc. facility is also a member of the Channel Industries Mutual Aid (CIMA) organization.  CIMA membership provides dedicated emergency response hardware and personnel available to member events.  Natural Gas Odorizing, Inc Emergency Response Team members actively participate in CIMA emergency planning and drills.  The Natural Gas Odorizing, Inc. facility is a part of the OxyChem Houston Strike Team available 24 hours per day to respond to in plant chemical emergencies or off site transportation incidents involving hazardous materials.  The team maintains a  mobile chemical emergency command center equipped with the necessary equipment to respond to spill and release emergencies.\n\nThe emergency response plan has been communicated to local emergency response officials through the LEPC and Baytown Fire Department.  The Natural Gas Odorizing, Inc. facility is also an active member of the Baytown Local Emergency Planning Committee (LEPC).  The Baytown Fire Department visited and attended a special training session at the Natural Gas Odorizing, Inc. facility in 1998 designed specifically to familiarize the Fire Department with the facility, facility chemicals, and facility emergency response procedures.\n\n7. Planned Changes to Improve Safety (' 68.155(g)).\n\nThe Natural Gas Odorizing, Inc. facility constantly tries to improve the safety of the processes through annual reviews of our plant procedures, near misses and incident investigation programs, and by soliciting safety and environmental suggestions from the plant employees. \n\n8.\tCertification (' 68.185).\n\nGeneral Certification.  To the best of my knowledge, information, and belief formed after reasonable inquiry, the information submitted in the RMP is true, accurate, and complete.\n\nSignature: Alan L Truver*            Date Signed: June 16, 1999\n\nTitle: Pla"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 11208,
      "SummaryText": "nt Manager\n\n* The Certification with original signature is presented in the attached cover letter."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11208,
      "SummaryText": "ps manage the risks at the Natural Gas Odorizing, Inc. facility and complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirement Risk Management Programs (the RMP rule), and OSHA 1910.119. This document is intended to satisfy the RMP plan requirement of the RMP rule and to provide the public with a description of the risk management program at the Natural Gas Odorizing, Inc. facility.\n\nThe RMP at the Natural Gas Odorizing, Inc. facility consists of the following three elements:\n7 A hazard assessment to help understand (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule (regulated substances)\n7 A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes)\n7 An emergency response program to help respond to accidental releases of regulated substances from covered processes\nInformation further describing these elements is provided in this RMP Plan.\n\nAlthough the risk management program at Natural Gas Odorizing, Inc. helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety and environmental program at the facility.  Natural Gas Odorizing has a comprehensive safety and environmental program in place, establishing many levels of safeguards against release of a hazardous substance as well as injuries and damage from a release of a hazardous substance.\n\nFacility's policy on the use of hazardous substances:  Before using a hazardous substance,  less hazardous alternatives are always considered.  When a hazardous substance is used, the Natural Gas Odorizing, Inc. facility reviews the potential for an accidental release which could adversely affect plant workers, the public and th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11208,
      "SummaryText": "e environment, and takes steps to prevent any such effects.  This is accomplished through the facility's Management of Change (MOC) and Process Hazard Review (PHR) procedures which are followed for all new installations or modifications of existing processes.\n\nThe Facility strives to prevent accidental releases of  hazardous substances used:  The facility implements reasonable controls to prevent foreseeable releases of hazardous substances. When a hazardous substance is used, the equipment is carefully designed, installed, operated and maintained to reduce the likelihood of an accidental release.  Industry and government standards are closely adhered to in the design, construction and operation of the equipment.  The NGO facility also uses the OxyChem Corporate Fire, Safety and Environmental (FS&E) Guidelines when designing new or making significant modifications to existing processes.  Each project is thoroughly reviewed before approval.  The Facility's mechanical integrity program provides an ongoing process to verify the mechanical integrity of the equipment, piping and instruments to prevent the release of hazardous substances.\n\nThe Facility's goal is to minimize impacts from an accidental release:  In the event of an accidental release, Natural Gas Odorizing, Inc. controls and contains the release in a manner that will be safe for workers and will minimize the impact to the public and the environment. The Facility utilizes emergency response plans as required by government regulations and maintains an active Emergency Response Team which is on call 24 hours a day to respond to an accidental chemical release.  OxyChem also has established a Special Situations Center in the Dallas corporate office to assist in all emergencies. \n\nThe Natural Gas Odorizing, Inc. facility emergency response plan has been developed to meet the emergency planning, response and notification requirements of the Federal, OSHA, and EPA regulations.  This plan outlines the responsibilitie"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11208,
      "SummaryText": "Natural Gas Odorizing, Inc. Risk Management Plan Executive Summary\n\nOccidental Chemical Corporation (OxyChem), a wholly owned subsidiary of Occidental Petroleum Corporation (OPC), owns and operates the Natural Gas Odorizing, Inc. (known as NGO) facility at 3601 Decker Drive in Baytown, Texas.  Natural Gas Odorizing, Inc. has been in business since 1942 and has been at this site location since 1965.\n\nNatural Gas Odorizing, Inc. produces an assortment of mercaptans and sulfides for use as warning agents in natural gas and propane systems.  Some of the products are also sold to agricultural chemical producers for use in herbicides and pesticides.  The major chemicals stored and used within the facility include Propylene, Isobutylene, Ethyl Mercaptan, Butyl Mercaptan, and other mixed Mercaptans.  A Hydrogen Sulfide (H2S) and Ethylene Pipeline from a neighboring facility are the primary feed stocks for the NGO facility. H2S and Ethylene are fed directly into the production process with no storage capabilities on-site.  On a daily basis, the public would encounter NGO products in their natural gas and propane systems.  These products enhance public safety by allowing people to know of the possibility of a leak in their gas systems.  NGO employs 51 people at the facility, and has a sales force to cover North American markets.\n\n1.  Accidental Release Prevention and Emergency Response Policies at the Stationary Source  (' 68.155(a)):\n\nNatural Gas Odorizing, Inc. (NGO) is committed to operating the facility in a manner that is safe for its workers, the public and the environment.  NGO policy is to adhere to all applicable Federal, State and local rules and regulations, industry standards and best practices.  As part of this commitment, NGO has established a system to help ensure safe operation of the processes at this facility which includes the prevention of accidental releases of hazardous substances.  One component of this system is a risk management program (RMP) that hel"
    }
  ]
}