{
  "FacilityID": 11311,
  "FacilityName": "Hopton Technologies, Inc.",
  "FacilityStr1": "555 West Hermitage Road",
  "FacilityStr2": null,
  "FacilityCity": "Rome",
  "FacilityState": "GA",
  "FacilityZipCode": "30161",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13115",
  "LEPC": null,
  "FacilityLatDecDegs": "34.327778",
  "FacilityLongDecDegs": "-85.091667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hoptontech.com",
  "FacilityEmailAddress": "JamesR@Hoptontech.com",
  "FacilityDUNS": 131074494,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Verson Pandian",
  "OperatorStr1": "140 SW Queen Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Albany",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97321",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119258",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-03-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Methyl Formcel Process",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2000-05-02 00:00:00",
  "DeRegistrationEffectiveDate": "2000-03-01 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.3273,
  "FRS_Long": -85.0918,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15158,
      "AltID": "Methyl Formcel Process",
      "FacilityID": 11311,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 18933,
          "ProcessID": 15158,
          "ChemicalID": 1,
          "Quantity": 75000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15534,
          "ProcessID": 15158,
          "NAICSCode": "325998",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11311,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-05-01 00:00:00",
    "CoordinatingAgencyName": "Floyd/Rome Emergency Management Div",
    "CoordinatingAgencyPhone": "7062364543",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 11311,
      "SummaryText": "ible to operators involved in the processes.\n\nTraining:\n\nHopton Technologies, Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.\n\nMechanical Integrity:\n\nHopton Technologies, Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process Equipment examined by these checks includes, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\n\nWritten procedures are in place at Hopton Technologies, Inc. to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-Startup Reviews:\n\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Hopton Technologies, Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits:\n\nHopton Technologies, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result of these audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\n\nHopton Tec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11311,
      "SummaryText": "s calculated to be 9.24.  A distance to endpoint of 0.2 miles is obtained which affects a residential population of 12 within this distance.\n\nToxic Alternative Case Analysis:\n\nNone required for this process.\n\nFlammables Worst Case and Alternative Case Analysis:\n\nNone required for this process.\n\n4.  The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  Two processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information:\n\nHopton Technologies, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis:\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analysis is the What-If/Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every three years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures:\n\nFor the purposes of safely conducting activities within our covered processes, Hopton Technologies, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily access"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11311,
      "SummaryText": "General Executive Summary for Manufacturing:\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nWe at Hopton Technologies, Inc. are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeable, if a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the Floyd/Rome Emergency Management Division which provides additional emergency response expertise.\n\n2.  The Stationary Source and the Regulated Substances Handled:\n\nWe have 1 regulated substance present at our facility which is Formaldehyde (55%).\n\nThe maximum inventory of Formaldehyde (55%) that is expected to be present in this facility based on process/operational requirements is 75,000 lbs.\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario:\n\nTo perform the required off-site consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nToxic Worst Case Analysis:\n\nThe Worst Case scenario involves a catastrophic release from the Methyl Formcel process.  The scenario involves the release of 75,000 lb. of Formaldehyde (55%).  Toxic liquid is assumed to be immediately released to form a pool of 1 cm height, from which evaporation takes place.  The entire pool is estimated to have evaporated over 10 minutes.  The release rate (lbs/min) i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11311,
      "SummaryText": "hnologies, Inc. promptly investigates any incident that has resulted in, or could reasonable result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation:\n\nHopton Technologies, Inc. truly believes that process safety management and accident prevention are a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors:\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Hopton Technologies, Inc. has a strict policy of informing the contractors of know potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures from emergency response, should an accidental release of a regulated substance occur.\n\n5.  Five-Year Accident History:\n\nHopton Technologies, Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases during this period.\n\n6.  Emergency Response Plan:\n\nThis facility is included in the written community ER Plan.  This facility has its own written ER Plan.  The ER Plan includes specific actions to be taken in response to accidental releases of regulated substances.  The ER Plan includes procedures for informing the public and local agencies regarding an accidental chemical release.  The ER"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11311,
      "SummaryText": "Plan includes information on emergency health care.\n\nDate of most recent review/update of ER Plan:   4/1/1999\nDate of most recent ER training of employees:    5/1/1999\n\nThe local agency coordinating the ER Plan is the Floyd/Rome Emergency Management Division, which has the phone number: 706-236-4543.\n\n7.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Additional training for handling hazardous substances is scheduled for July 1999.  In addition, we are investigating expanding our site passive mitigation and containment capabilities to reduce the effect in the event of an off-site release."
    }
  ]
}