{
  "FacilityID": 11319,
  "FacilityName": "Delicato Monterey Winery",
  "FacilityStr1": "51955 Oasis Road",
  "FacilityStr2": null,
  "FacilityCity": "King City",
  "FacilityState": "CA",
  "FacilityZipCode": "93930",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.1725",
  "FacilityLongDecDegs": "-121.122222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.delicato.com",
  "FacilityEmailAddress": "wine@delicato.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Delicato Vineyards, A Corporation",
  "Company2Name": null,
  "CompanyDUNS": 9188111,
  "Company2DUNS": null,
  "OperatorName": "Delicato Vineyards, A Corporation",
  "OperatorStr1": "12001 South Highway 99",
  "OperatorStr2": null,
  "OperatorCity": "Manteca",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95336",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119855",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-27 00:00:00",
  "SafetyInspectionBy": "County Health Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.172467,
  "FRS_Long": -121.123251,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15196,
      "AltID": "Refrigeration",
      "FacilityID": 11319,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 18981,
          "ProcessID": 15196,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15573,
          "ProcessID": 15196,
          "NAICSCode": "31213",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7769,
              "Process_NAICS_ID": 15573,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "PHA_Date": "1999-06-02 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-08-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Vandalism",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Drain and sump system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-02 00:00:00",
              "TrainingReviewDate": "1999-06-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-02 00:00:00",
              "EquipmentInspectionDate": "1999-03-30 00:00:00",
              "EquipmentTested": "FES Compressor",
              "ChangeMgmtDate": "1999-06-02 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-02 00:00:00",
              "PreStartupReviewDate": "1999-06-02 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-02 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10760,
                  "PreventionProgram3ID": 7769,
                  "ProcessChemicalID": 18981
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11319,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1999-04-28 00:00:00",
    "CoordinatingAgencyName": "Dept. of Forestry Fire Protection",
    "CoordinatingAgencyPhone": "8313856437",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 11319,
      "SummaryText": "ns are separated into specific lots for crushing. The crushing process separates the thousands of gallons of juice from the skins, seeds and stems of the grapes to prepare the juice to become wine. This conversion process of juice to wine is called fermentation, and is accomplished with a microscopic organism called yeast. Wine lots of 6,400 to 49,000 gallons are then moved through various processes to clarify, consolidate, blend and finish into a product that is ready for our customers to consume. Many thousands of gallons of wine flow through miles of pipelines and numerous pieces of equipment and tanks of various shapes and sizes before reaching the final destination, the customer's glass.\n\nAnhydrous Ammonia Processes\n\nDuring our winemaking process there are many stages where refrigeration of the juice or wine is important to retain certain quality characteristics. Several systems installed around our facility to perform this task utilize anhydrous ammonia as the refrigerant chemical.\n\nThe United States Environmental Protection Agency lists anhydrous ammonia as an Extremely Hazardous Substance with a Threshold Planning Quantity of 10,000 pounds. The process refrigeration equipment at Delicato Monterey Winery uses ammonia as the refrigerant gas.  There is one ammonia refrigeration system at this facility and the largest vessel contains approximately 10,262 pounds of anhydrous ammonia.\n\nThe ammonia refrigeration system is a fixed installation set on a concrete foundation according to Seismic Zone 4 specifications. It consists of a compressor, condenser, evaporator, associated piping, valves, electrical power and controls for safe operation.  It is dedicated to processes for in-place cooling of wine contained in jacketed tanks and cooling juice as it is pumped through a heat exchanger prior to fermentation. The thermodynamic reaction cycles of ammonia expansion from a liquid to a gas, and compression of the gas back into a liquid all within a closed system, provides"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11319,
      "SummaryText": "the necessary removal of heat from our wine and juice products. The period of heaviest refrigeration use is during the grape harvest season, usually from August through November.\n\nAnhydrous ammonia has been a commonly used refrigerant gas for decades because it is highly efficient. Ammonia is a naturally occurring compound, and some scholars believe the atmosphere of the earth was originally composed of ammonia (NH3) and water (H2O). Ammonia has also been extensively used as a primary fertilizer in our country's prosperous agriculture industry for many years through a process of direct injection into the soil. It is commonly used in many households as a cleaner for windows, floors and countertops. Treated with respect, ammonia provides tremendous benefit in the processes in which it is used to enhance our country's economy.\n\nBeing classified as a hazardous material, ammonia can be dangerous if it is mishandled. The concentrated liquid can freeze tissue and cause chemical burns. In a gaseous form of sufficient strength, it can be inhaled to cause immediate burning of lung tissue. This is why extensive safety precautions and equipment are in place at all facilities using anhydrous ammonia.\n\nInterestingly, ammonia-related deaths and injuries are more common from misuse of household ammonia used for cleaning purposes than from the millions of tons of anhydrous ammonia used around the world for industrial and agricultural processes.\n\nRelease Scenarios\n\nIn this document, we have the opportunity to review scenarios that describe worst-case releases and alternative releases for the anhydrous ammonia we use at our winery. These selected accidental release scenarios are hypothetical estimates of what could happen, given the quantity of the material used on site. For the system at our winery using anhydrous ammonia, the worst-case scenario is more appropriately termed as a least-likely event and alternative scenarios as being more-likely. They are intended to depict what effe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11319,
      "SummaryText": "cts would be experienced, should the remote chance of an accidental release occur. \n\nIt should be noted that a release of a worst-case magnitude has not been experienced in this area, in spite of many years of handling large quantities of anhydrous ammonia. For all scenarios, the actual number of individuals affected during an accidental release would be much smaller than the total number of people within the calculated impact zone. This is because local wind would transport a release plume from the center of the zone in a specific direction to the outer limit of the zone, not affecting entire region. Therefore, only individuals in the path of the plume would be affected, not the entire population residing within the zone as is reported in Sections 2 and 3 of this document.\n\nTo determine the consequences of various release scenarios, we contracted with an air quality specialist to calculate the air modeling effects. A site evaluation was performed to collect the necessary data about the process using anhydrous ammonia, along with data about local geography, topography and meteorology. Through the use of mathematical models, areas of vulnerability were determined that would be affected by a released plume of the chemical at toxic levels.\n\nAnhydrous Ammonia Release Scenarios\n\nFor anhydrous ammonia, the worst-case scenario describes a catastrophic tank failure that causes the release of 10,262 lbs. from the largest vessel in a 10-minute period. A release of this magnitude can be expected to travel approximately 0.68 miles. The population estimated to reside within the impact zone is zero. A release of this magnitude is highly unlikely due to the design and engineering that is involved in the construction and operation of these kinds of installations. Additionally, no historical account of such a release is known to occur in this area.\n\nThe alternative release scenario for anhydrous ammonia is more credible. Ammonia refrigeration systems are designed with safety devices"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11319,
      "SummaryText": "RMP Executive Summary\n\nThe business of Delicato Monterey Winery is to produce and market fine California wines. From the grapes grown in our vineyards we follow an age-old enjoyable tradition of human activity in producing delicious wines to celebrate life.  Located just southwest of the King City in the fertile Salinas Valley of California, our winery is a significant contributor to the state's economy as a part of the wine industry.  In association with our parent company, we are included in the top ten wineries of the United States based on our combined 40 million-gallon storage capacity. Together, we produce a large quantity and variety of wines for our international customer base.\n\nThe values and guiding principles adopted for operating the winery are incorporated into our mission and vision statements. In addition to supplying quality services and products, Delicato is committed to providing a quality work environment where safety, honesty, respect and fairness are the foundation of the relationship between customers, employees, owners, and suppliers. The company meets all regulatory requirements and ensures that a full exchange of information pertaining to compliance is maintained. The company and employees dedicate themselves to be active, good citizens in their community and industry. All employees are encouraged to be active participants in endeavors directed toward improving the quality of life or supportive of growth in the community or industry.\n\nOur business begins with the soil in which we grow many acres of vines that produce high quality grapes. The vines are tended and nurtured throughout the growing season by following up-to-date, progressive agricultural practices, which provide optimum development of the fruit. During the fall harvest season, the grapes are picked according to specific quality criteria and delivered to the winery to be processed into wine. Transported from the vineyard by trucks, grapes of many varieties arriving in 6-ton bi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11319,
      "SummaryText": "called pressure relief valves to prevent explosion of components in the event of a system failure that results in over pressurization. Industry history also supports a release of this nature to be a more likely scenario. The scenario involves a pressure relief valve to be stuck in the open position on the largest vessel for approximately 40 minutes in the presence of more typical weather conditions for our region, and releasing gaseous ammonia totaling 10,262 pounds for the period. The release duration is estimated with the consideration that emergency response from employees on site will have the release controlled within the period. The potential harmful effect is expected to be within a radius of 0.26 miles and affect a population of zero.\n\nThe Five-Year Accident History\n\nDuring the last five years there have been no reportable accidents involving anhydrous ammonia at our winery. \n\nEmergency Response Program\n\nIn the event of an emergency situation involving an accidental release of anhydrous ammonia, Delicato Monterey Winery will activate components of its Emergency Response Plan. The plan is intended to minimize the serious effects of an event through preparation and training. Components of the Plan that accomplish this are as follows:\n\n( Pre-emergency planning, including scenario drills and coordination with outside emergency providers.\n( \n( Definition of personnel roles for recognizing, preventing, and maintaining site security and control.\n( \n( A communication system for alerting personnel for response procedures, evacuation to safe refuges and coordination with outside responders.\n( \n( Provisions for medical treatment, first aid, and decontamination.\n( \n( Organization and training of Emergency Response Team with necessary personal protective and other emergency equipment.\n( \nThe majority of Production and Maintenance personnel make up the Emergency Response Team and all have training to the Hazardous Materials Technician level as specified in 29CFR1910.120("
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11319,
      "SummaryText": "q).\n\nPlanned Safety Improvement\n\nContinuous improvement in facility safety is realized from strengthening employee knowledge and ability through regular training. Operations and Maintenance personnel receive training through monthly safety meetings and periodic processing review sessions. The group of employees who compose the Emergency Response Team participate in periodic emergency preparedness training throughout the year. Improvements in preventative maintenance tracking are also providing a more thorough ability to repair worn parts in systems before they have a chance to fail. As referenced in the beginning from our mission and vision statements, Delicato is committed to operating an environmentally safe winery."
    }
  ]
}