{
  "FacilityID": 11320,
  "FacilityName": "Beaver Creek Gas Plant",
  "FacilityStr1": "380 Beaver Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Riverton",
  "FacilityState": "WY",
  "FacilityZipCode": "82501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56013",
  "LEPC": "Fremont County LEPC",
  "FacilityLatDecDegs": "42.845833",
  "FacilityLongDecDegs": "-108.312639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Santa Fe Snyder Corporation",
  "Company2Name": null,
  "CompanyDUNS": 7923683,
  "Company2DUNS": null,
  "OperatorName": "Santa Fe Snyder Corporation",
  "OperatorStr1": "1625 Broadway, STE 2200",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119917",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "30-046",
  "SafetyInspectionDate": "1999-04-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-10-11 00:00:00",
  "DeRegistrationEffectiveDate": "2018-08-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.8468,
  "FRS_Long": -108.312,
  "FRS_Description": null,
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15197,
      "AltID": "NGL Extraction",
      "FacilityID": 11320,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 18982,
          "ProcessID": 15197,
          "ChemicalID": 155,
          "Quantity": 550000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 11880,
              "ProcessChemicalID": 18982,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 11881,
              "ProcessChemicalID": 18982,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 11882,
              "ProcessChemicalID": 18982,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 11883,
              "ProcessChemicalID": 18982,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 11884,
              "ProcessChemicalID": 18982,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 11885,
              "ProcessChemicalID": 18982,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 18983,
          "ProcessID": 15197,
          "ChemicalID": 155,
          "Quantity": 320000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 11886,
              "ProcessChemicalID": 18983,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 11887,
              "ProcessChemicalID": 18983,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 11888,
              "ProcessChemicalID": 18983,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 11889,
              "ProcessChemicalID": 18983,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 11890,
              "ProcessChemicalID": 18983,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 18984,
          "ProcessID": 15197,
          "ChemicalID": 155,
          "Quantity": 290000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 11891,
              "ProcessChemicalID": 18984,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 11892,
              "ProcessChemicalID": 18984,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 11893,
              "ProcessChemicalID": 18984,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 11894,
              "ProcessChemicalID": 18984,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 11895,
              "ProcessChemicalID": 18984,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15574,
          "ProcessID": 15197,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11320,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-01-18 00:00:00",
    "ERTrainingDate": "1998-11-19 00:00:00",
    "CoordinatingAgencyName": "Fremont County LEPC",
    "CoordinatingAgencyPhone": "3078573671",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11320,
      "SummaryText": "Beaver Creek Gas Plant Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies:\n\nSanta Fe Snyder Corporation's (SFS) continued strength depends in a large part on our ability to prevent, prepare for, respond to, and mitigate emergencies arising from our operation.  The cornerstone of this assurance is prevention.\n\nPrevention is accomplished through properly maintained equipment, trained and competent employees, sound policies, well thought out programs, and ongoing programs for risk reduction.  All of these building blocks of accident prevention are cemented together by the firm commitment to safety by senior corporate management and all subsequent levels of supervision.\n\nEqually important is our business' emergency response readiness and capability.  Santa Fe Snyder Corporation will be prepared to respond in the most efficient, effective manner to mitigate crisis incidents as rapidly as possible, while minimizing the impact on people, property, the environment, and our reputation.  Our goal is to assure the facility has adequately planned and prepared for emergencies.\n\nSanta Fe Snyder Corporation endorses the following four principles as they relate to crisis management and emergency preparedness:\n\n1. Vigilance:  All employees are responsible for assuring that their actions are in compliance with applicable laws, regulations, and corporate policies.  All are encouraged to promptly report events or situations that may create unsafe conditions.  No disciplinary action or retribution will be imposed on any employee for vigilance; but failure to act on this responsibility may have severe consequences.\n2. Responsiveness:  Santa Fe Snyder endorses the principle of effective over-response and will bring the full resources of the corporation to bear in supporting local emergency response efforts.  In addition, SFS is committed to maintaining open communication with those affected by an emergency both inside and outside the corporation.\n3. Unity:  A"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11320,
      "SummaryText": "major crisis affects the whole of Santa Fe Snyder and requires unified response.  Only by communicating and pulling together across normal organizational lines can SFS withstand a major crisis.  Employees at all levels are expected to perform beyond their regular duties.  However, under no circumstances are personnel expected to perform any task that places them at undue risk.\n4. Accountability:  Santa Fe Snyder's staff is accountable to the public and to each other.  Our constituents include employees, customers, shareholders, industry regulators, and the public at large.  Therefore, our decisions in an emergency situation should be guided accordingly.\n\n\nThe Facility and the Regulated Substances Handled:\n\nThe Beaver Creek Gas Plant is a remote natural gas processing facility that has been in operation for approximately 40 years.  In July of 1998, Snyder Oil Corporation became the operator of the facility.  Since then, Snyder Oil Corporation has merged with Santa Fe Energy Resources and the new corporation is known as Santa Fe Snyder Corporation.\n\nThe purpose of this remote natural; gas processing facility is to take raw field natural gas and process it into pipeline quality natural gas (like that used to heat homes).  In addition, during the processing of the raw field natural gas, natural gas liquids (NGLs) are removed, separated and stored. \n\nThe pipeline quality natural gas, composed primarily of methane and ethane, is not stored at this facility but is sold into a natural gas pipeline.  This pipeline quality natural gas is then distributed to companies who sell it as fuel for heating homes and industrial purposes.  Natural gas volume estimates do not reach threshold quantities.\n\nThe natural gas liquids are typically stored in pressurized storage tanks until it is sold and transported away from the facility by truck transports. The NGLs produced at the Beaver Creek Gas Plant are generally known as propane, butane, and natural gasoline.  These NGL products are s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11320,
      "SummaryText": "sonnel training, management of change, and others.  All of these tools aid in preventing an accidental release.\n\nOther practices in use at this facility to reduce the potential for an accidental release and minimize potential impacts if a release did occur are:\n\n1. Standard operating procedures, such as not filling the pressurized storage tanks beyond a safe level (i.e., 89% of capacity for propane), to allow for potential thermal expansion of the NGL in the tank.\n2. Proper inspection and testing procedures, such as the inspection and testing of the pressure safety valves used to prevent any potential overpressure and possible rupture of the storage tanks.\n3. Mitigation measures, such as surrounding the storage tanks in a bermed area that restricts the spreading of a liquid release and establishes a barrier to reduce the potential for a vehicle impacting a storage tank.\n\nFive-year Accident History:\n\nDuring the operation of this facility by Santa Fe Snyder Corporation (formerly Snyder Oil Corporation) there have been no accidental releases of a regulated substance that have lead to any on or offsite deaths, injuries, or environmental impacts.  In addition, records and reports from personnel familiar with the operation of this facility confirm that no accidents occurred involving a regulated substance in the approximately four years prior to Santa Fe Snyder becoming responsible for the facility.\n\nEmergency Response Program:\n\nThe Emergency Response Plan for this facility:\n\n1. Establishes an On-site Emergency Response Team, comprised of key personnel familiar with this facility.  Their primary responsibility is to assume immediate command during emergency situations and be responsible for the protection and welfare of personnel and community, controlling property damage, securing the facility, and coordination of public relations efforts.  If necessary they will also activate the Regional Emergency Response Management Team.\n2. Identifies potential emergency situations a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11320,
      "SummaryText": "nd the possible worst case scenario associated with each emergency situation.\n3. Provides procedures for initial response actions.  These procedures include such key points as protection of life (administer first aid and request of emergency medical services), safely mitigate circumstances, communication and securing the site.\n4. Institutes notification procedures that include key information that needs communicated, guidance in assessing the magnitude of the emergency, both internal and external notification steps, and lists of internal and external contact names and telephone numbers.\n5. Details evacuation information that include evacuation routes, maps locating briefing both primary and alternate briefing areas, on-scene command posts and procedures.\n6. Outlines general containment, cleanup and recovery techniques depending on the type and location of the release.\n7. Establishes lists of available on-site safety and response equipment and outside resources that may be mobilized if necessary.\n8. Provides guidance on media communication procedures.\n9. Requires incident documentation and sets up procedures for conduction follow-up investigations of incidents including coordination with federal. State, and local officials.\n10. Implements training requirements for all emergency response personnel either employed or deployed by Santa Fe Snyder Corporation.  Included are requirements for emergency response drills or exercises.\n\nPlanned Changes to Improve Safety:\n\nThe facility is currently installing a new Y2K compliant automation control system that monitors and controls the processes at this facility."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11320,
      "SummaryText": "old and transported from this facility for use as industrial feedstock, LP-gas type fuel, and motor fuel components.  It is the NGL product that is estimated to reach threshold quantities.\n\nThe NGL products mentioned above are considered flammable.  Since the separation process is not exact, these products are typically mixtures of various hydrocarbon components (i.e., propane, butane, iso-butane, pentane, etc.).  The significant quantities of these products are located in the pressurized storage tanks described above.  These tanks are co-located inside a large bermed area, a safe distance from the processing plant.\n\nThe Worst Case Release Scenario:\n\nThe worst case release scenario for the process contained in this risk management plan was calculated using the RMP*comp software, version 1.06.  It modeled the worst case release of a flammable mixture composed primarily of propane.\n\nThe worst case release modeled the catastrophic failure of one of the pressurized propane storage tanks containing a maximum of 1,071 barrels of propane.  (The 1,071 barrels is an over estimate of what actually would be released from one tank since it is standard operating procedure to not fill the pressurized tanks beyond 89% of capacity.)  In addition, it assumed approximately 100 barrels of product would also be released from associated piping and processes.  No benefit was taken for the potentially reduced surface area caused by the bermed storage area.\n\nThe worst case estimated distance to the 1 psi overpressure endpoint of the vapor cloud explosion was 0.5 miles (0.8 kilometers).  There are no apparent offsite impacts associated with this worst case release due to the remote and rural location of this facility.\n\nAccident Release Prevention Program and Chemical-specific Prevention Steps:\n\nThis facility is subject to OSHA's Process Safety Management program.  Therefore, it utilizes such prevention tools as process hazard analysis, mechanical integrity testing, maintenance programs, per"
    }
  ]
}