{
  "FacilityID": 11342,
  "FacilityName": "Goldwell Cosmetics (USA), Inc.",
  "FacilityStr1": "981 Corporate Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Linthicum Heights",
  "FacilityState": "MD",
  "FacilityZipCode": "21090",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24003",
  "LEPC": "Anne Arundel LEPC",
  "FacilityLatDecDegs": "39.208333",
  "FacilityLongDecDegs": "-76.675",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "goldwellusa.com",
  "FacilityDUNS": 147255103,
  "ParentCompanyName": "Goldwell GMBH - Germany",
  "Company2Name": "Kao Corporation - Japan",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Goldwell Cosmetics (USA), Inc.",
  "OperatorStr1": "981 Corporate Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Linthicum Heights",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21090",
  "OperatorZipCodeExt": null,
  "FTE": 115,
  "OtherEPAFacilityID": "MDR000005835",
  "EPAFacilityID": "100000121389",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "County Environmental Agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-23 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-18 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.20914,
  "FRS_Long": -76.67105,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15245,
      "AltID": "Aerosol can filling",
      "FacilityID": 11342,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19036,
          "ProcessID": 15245,
          "ChemicalID": 98,
          "Quantity": 7750.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 19037,
          "ProcessID": 15245,
          "ChemicalID": 107,
          "Quantity": 7750.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15623,
          "ProcessID": 15245,
          "NAICSCode": "32562",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7819,
              "Process_NAICS_ID": 15623,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "PHA_Date": "1999-05-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-17 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Explosion suppression system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Preventative maintenance program",
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-06-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-11 00:00:00",
              "EquipmentInspectionDate": "1999-06-17 00:00:00",
              "EquipmentTested": "Storage vessel, piping, valves, pumps, detectors, suppression system, interlocks",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-17 00:00:00",
              "PreStartupReviewDate": "1995-11-09 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-28 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10814,
                  "PreventionProgram3ID": 7819,
                  "ProcessChemicalID": 19036
                },
                {
                  "PrimaryKey": 10815,
                  "PreventionProgram3ID": 7819,
                  "ProcessChemicalID": 19037
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11342,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-04-30 00:00:00",
    "ERTrainingDate": "1999-03-01 00:00:00",
    "CoordinatingAgencyName": "Anne Arundel County Fire Department",
    "CoordinatingAgencyPhone": "4109874010",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 11342,
      "SummaryText": "igger audible and visual alarms within our facility, and send a signal to an outside agency that continuously monitors our systems 24 hours per day, 7 days per week.  These systems are inspected and maintained on an annual basis by an outside contacting company.\n\n\nPlanned Changes\n\nThere are not any planned changes to the aerosol can charging process at this time.  We will continue to review and update our procedures, preventive maintenance program, and training programs.  \n\nDuring the last 2 weeks of June, we are having 2 inspections by outside agencies: a fire inspection by the Anne Arundel County Fire Department and a consultation inspection by Maryland Occupational Safety and Health.  We will utilize these inspections as tools to improve safety and immediately correct any concerns that are noted during those inspections.\n\nDuring the next year, we will perform a thorough process hazard analysis of our hair color manufacturing process which uses the ammonium hydroxide solution."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11342,
      "SummaryText": "Stationary Source\n\nGoldwell Cosmetics (USA), Inc. is a manufacturer of hair care cosmetics.  The principal products manufactured at this facility include hair color, hair color developers, styling products, shampoos, conditioners, and perm products.  The NAICS code for the products manufactured is 32562, Toilet Preparation Manufacturing.   \n\nGoldwell Cosmetics (USA), Inc. is guided by a four member steering committee.  The steering committee mandated that the this facility be designed, constructed,  and operated in such a manner as to provide a safe and healthful work environment for our employees, protect our neighbors and the citizens of the local community, and protect our environment.  There are 2 buildings at this location, a headquarters building with approximately 45 employees, and a manufacturing building with approximately 70 employees.  The facility was built from the ground up and was completed in 1995.  It was designed and constructed with state of the art process equipment, safety systems, and fire protection systems.    \n\nThe steering committee has also mandated that we continue to operate this facility safely and in full compliance with applicable safety and environmental regulatory requirements.  They have committed the resources that will enable us to continue to maintain the integrity and proper function of our process equipment and safety systems, provide training for our employees, and ensure the safe handling and use of our hazardous materials.\n\nThis facility currently utilizes two processes which involve chemicals that are on the List of Regulated Substances and Threshold Quantities for Accidental Release Prevention.  One process uses a 29% ammonium hydroxide solution and the other process uses a liquified petroleum gas mixture composed of propane and isobutane.\n\nThe ammonium hydroxide solution is used as an ingredient in one of our hair color lines.  The 29% solution is stored in an 8,000 gallon underground storage tank and is used in a batch"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11342,
      "SummaryText": "process.  The maximum quantity of the solution on site at any one time is 50,000 pounds, therefore, the maximum quantity of ammonia at any one time is 14,500 pounds.  That quantity is less than the 20,000 pound threshold quantity for ammonia in a 20% or greater solution that is provided on the List of Regulated Substances and Threshold Quantities for Accidental Release Prevention.  The process is designed, constructed and operated to ensure the safe handling and use of the material and minimize the potential for accidental release. \n\nThe liquified petroleum gas is used to expel hair color products from an aerosol can.  The liquified petroleum gas is a flammable mixture consisting of approximately 50% propane and 50% isobutane.  The liquified petroleum gas is brought on site by a transport and transferred through an unloading station to a 4,000 gallon storage tank.  The maximum quantity on site at any one time is 3,400 gallons or 15,500 pounds.  The liquified petroleum gas is transferred through piping to a filling machine located within a gas house which is attached to the rear of the manufacturing building.  Cans of hair color enter the gas house on a conveyor, are charged with liquified petroleum gas in the filling machine, and exit the gas house.  The flow of liquified petroleum gas from the storage vessel into the gas house and the filling machine is low as the maximum quantity of propellant charged into one can of hair color is about 8 grams.  The filling machine is capable of charging approximately 27 cans per minute which would equate to a total volume of about 0.5 pounds of liquified petroleum gas being charged per minute.           \n\n\nWorst-Case Release  Scenario\n\nThe worst-case release scenario for this process involves a vapor cloud explosion that could potentially occur if the storage vessel were full and the entire 3,400 gallons were to be released at one time.  The estimated distance to an overpressure of 1 psi is 0.2 miles, based on the EPAs RMP*Comp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11342,
      "SummaryText": "model.  \n\nThere is one industrial occupancy that is located within that distance.  It is located on the opposite side of our manufacturing building from the storage vessel so it would be shielded in the event of an explosion.   There are two (2) other public receptors within 0.2 miles that are currently under construction.  One is an industrial park type occupancy that is also located on the opposite side of our manufacturing and \nheadquarters buildings from the storage vessel.  The other is an office building that is being constructed \nadjacent to our property and would not be shielded in the event of an explosion.  The area directly behind the storage vessel is wooded and this area could potentially become involved in a fire scenario in the event of an explosion at the storage vessel.  A residential community is located on the opposite side of that wooded area and there are approximately 90 homes within the 0.2 mile range in which we would expect an overpressure of 1 psi.  Based on an average of 4.7 persons per household in Anne Arundel County,  there are approximately 430 residents in those homes.  Some of those homes border the wooded area and could be at risk if the wooded area were involved in a fire scenario.       \n\nTo prevent this type of occurrence, the process was designed and constructed in accordance with NFPA 58, Standard for the Storage and Handling of Liquified Petroleum Gases, and other good engineering practices.  There are no passive mitigation systems in place.  There is a pressure relief valve on the vessel and active mitigation systems in the form of excess flow valves where lines enter the vessel, to prevent discharge of product in the event of piping or valve failure.  There is also a preventive maintenance program in place to periodically inspect and test the process equipment and safety systems ensuring that the mechanical integrity and proper function of the storage vessel is maintained.  The vessel and piping are inspected and leak teste"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11342,
      "SummaryText": "d bi-annually with a soap solution and painted as necessary to prevent corrosion.  The relief valve is inspected on a quarterly basis.  In addition, there is a written procedure in place to limit the quantity of material in the storage vessel to a maximum of 3,400 pounds, which is 85% of the tank capacity.  The procedure also requires the vessel to be vented back to the transport during the transfer operation to prevent overpressure and overfilling.       \n\n\nAlternative Release Scenario\n\nThe most probable alternative release that would occur at this facility would involve the rupture or disconnection of a hose during the transfer of liquified petroleum gas from a transport to the storage vessel.   The product released could potentially find an ignition source and result in a vapor cloud fire.  Active mitigation systems that are in place to prevent or minimize a release of product include emergency shut off valves on the transport, an excess flow valve on the transport, and a backflow check in the transfer line from the unloading station to the storage vessel.  With these active mitigation systems in place, the estimated quantity of product that would be released in the event of hose rupture or disconnection would be approximately 10 gallons or 45 pounds.  The lower flammability limit for propane is 36.0 milligrams per liter and the distance to reach that endpoint would be less than 0.1 miles based on the EPAs OCA guidance reference tables.  There are no public receptors within that distance, however, the wooded area behind the facility could potentially become involved in a vapor cloud fire scenario and place the residential homes on the opposite side at risk of fire.     \n\n\nAccidental Release Prevention Program\n\nThe aerosol filling operation is subject to the requirements of OSHAs Process Safety Management rule.  A process hazard analysis has been conducted to identify and control potentially catastrophic events that could result from a release of liquified petrole"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11342,
      "SummaryText": "um gas at our facility.  \n\nThe PHA documented that the necessary safety and active mitigation systems are in place.  The equipment and safety systems for our aerosol can filling process were designed and installed in accordance with NFPA 58,Standard for the Storage and Handling of Liquified Petroleum Gases and other good engineering practices.  Several groups were consulted during the design and construction phases, such as the Factory Mutual Insurance Company, the Anne Arundel County Fire Marshall, and the supplier of the liquified petroleum gas.\n\nThe storage vessel is constructed of carbon steel and the piping and fittings are schedule 80.  The transfer system is equipped with process controls such as emergency isolation valves, excess flow valves, backflow check valves, pressure relief devices, and vents.  There is a back-up generator to provide auxilliary power in case of power failure.  \n\nThe aerosol filling room is equipped with state of the art equipment and safety systems.  There are gas detection devices to detect the build-up of liquified petroleum gas and the room has a ventilation system that provides 1 complete air change per minute.  If a gas monitor detects 20% of the lower explosive limit, the ventilation rate will automatically increase to 2 air changes per minute and audible and visual alarms are triggered to alert employees.  If a gas monitor detects 40% of the lower explosive limit, the process equipment automatically shuts down, air actuated valves close and prevent additional gas from leaving the storage vessel and entering the building, and audible and visual alarms alert employees.  These alarms are monitored by an outside agency 24 hours per day, 7 days per week.  The gas house is protected by a state of the art explosion suppression system in which infrared detectors are positioned within the room to detect a source of ignition.  When a detection is made, the suppression system is triggered within a second and class B detonators expel the e"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11342,
      "SummaryText": "xtinguishing agent which is water.   \n    \nOperational procedures have been developed to control the activities of employees working on or in close proximity to this process.  The procedures detail start-up, normal and shut down operations, temporary system shut downs, emergency operations, and special operations such as hot work.  \n\nA preventive maintenance program has been implemented to regularly inspect and test the process equipment and safety systems.  That program will ensure that the mechanical integrity of the process equipment is maintained and ensure that the safety systems are functioning properly.  The storage vessel and piping are leak tested bi-annually with a soap solution.  The components are inspected during the bi-annual test and painted as necessary to prevent corrosion.  The emergency stop buttons and the automatic emergency isolation valves are tested quarterly to ensure their proper function.  The pressure relief valve on the storage vessel is inspected quarterly to ensure that it does not leak continuously or lift prematurely.  The gas house safety systems are tested, repaired and maintained quarterly to ensure that all of the components are in proper operating condition and the system is functioning as designed.  These maintenance functions are performed by qualified technicians from the company who installed the system.  \n\n\nFive Year Accident History\n\nThis facility and the aersol propellant filling process is 4 years old.  There have not been any accidental releases from this process.\n\n\nEmergency Response Program\n\nThe Environmental, Health & Safety Manager is the facility Emergency Coordinator.  The Emergency Coordinator is responsible for assessing each emergency and determining the appropriate response action.  Internally, we have 4 emergency response teams: an evacuation team, a spill response team, a first aid team, and a building protection team.  Each team has been trained to perform their specific job functions in the event of an eme"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11342,
      "SummaryText": "rgency.  The local external agencies that may be called upon in the event of an emergency at our facility include the Anne Arundel County Fire, Police, Health, and Public Works Departments, and the Maryland Department of the Environment.  For medical emergencies, we will use a  local medical  center or the hospital.  The emergency coordinator will identify and contact the internal and external resources necessary to handle a particular type of emergency.   \n\nA Tier II Report is submitted each year to the State Emergency Response Commission, the Local Emergency Planning Committee and the Anne County Fire Station that would respond to an emergency at our facility.  The most recent report was submitted March 1, 1999.  Members of the Anne Arundel County Fire Department that would respond to an emergency were provided with a tour of our facility so that they could become familiar with our processes, chemical hazards, fire and explosion hazards, and the fire protection and warning systems that are in place.  Officers, firefighters, hazmat team members, and emergency medical personnel from each of their 3 shifts all participated in the tours.          \n\nIn the event of a chemical release that cannot be handled internally, a local Hazmat contractor has been identified and will be called upon to handle the release.  Released liquified petroleum gas would not form a pool of liquid and remain on the ground.  The liquified gas evaporates immediately at -24.9 degrees Fahrenheit, thus any product released would quickly evaporate to a gaseous form and present a fire and explosion hazard.  \n\nOur facility is fully protected by an automatic sprinkler system.  There is a fire pump on site to ensure adequate pressure in the event of a discharge from the sprinker system and the fire pump is inspected and tested on a weekly basis.  Fire detection systems within the facility include smoke detectors, heat detectors, and flow detectors in the sprinkler system.  Each type of detector will tr"
    }
  ]
}