{
  "FacilityID": 11414,
  "FacilityName": "Gaviota Oil and Gas Plant",
  "FacilityStr1": "17100 Calle Mariposa Reina",
  "FacilityStr2": null,
  "FacilityCity": "Goleta",
  "FacilityState": "CA",
  "FacilityZipCode": "93117",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.473972",
  "FacilityLongDecDegs": "-120.203056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 801164823,
  "ParentCompanyName": "Pt Arguello Companies",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Pt Arguello Companies",
  "OperatorStr1": "17100 Calle Mariposa Reina",
  "OperatorStr2": null,
  "OperatorCity": "Goleta",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93117",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": "2121159",
  "EPAFacilityID": "100000120763",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "PTO 5704",
  "SafetyInspectionDate": "1998-04-10 00:00:00",
  "SafetyInspectionBy": "County Energy Division",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-04-03 00:00:00",
  "DeRegistrationEffectiveDate": "2001-03-23 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.474546,
  "FRS_Long": -120.205802,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15325,
      "AltID": "Fuel Gas System",
      "FacilityID": 11414,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19129,
          "ProcessID": 15325,
          "ChemicalID": 93,
          "Quantity": 17810.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15704,
          "ProcessID": 15325,
          "NAICSCode": "21111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7865,
              "Process_NAICS_ID": 15704,
              "SafetyReviewDate": "1999-02-25 00:00:00",
              "PHA_Date": "1998-05-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-13 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Plant Reconfiguration 1",
              "OpProceduresReviewDate": "1998-10-15 00:00:00",
              "TrainingReviewDate": "1998-10-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-04-23 00:00:00",
              "EquipmentInspectionDate": "1999-05-20 00:00:00",
              "EquipmentTested": "Compressor PSVs (K3, K3A)",
              "ChangeMgmtDate": "1999-04-06 00:00:00",
              "ChangeMgmtReviewDate": "1996-01-19 00:00:00",
              "PreStartupReviewDate": "1999-04-29 00:00:00",
              "ComplianceAuditDate": "1998-05-12 00:00:00",
              "AuditCompletionDate": "1999-06-11 00:00:00",
              "IncidentInvestigationDate": "1999-02-21 00:00:00",
              "InvestigationChangeDate": "1999-04-13 00:00:00",
              "ParticipationPlansReviewDate": "1996-04-23 00:00:00",
              "HotWorkPermitReviewDate": "1996-04-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-19 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10863,
                  "PreventionProgram3ID": 7865,
                  "ProcessChemicalID": 19129
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11414,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-28 00:00:00",
    "ERTrainingDate": "1999-06-03 00:00:00",
    "CoordinatingAgencyName": "Office of Emergency Services",
    "CoordinatingAgencyPhone": "8056815532",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11414,
      "SummaryText": "The Gaviota Oil and Gas Plant is owned by the Point Arguello Companies and it is operated by Chevron. The purpose of the Gaviota facility is to heat crude oil received from offshore platforms to pipeline temperature specification. The heated crude is pumped to the Point Arguello Terminal Company, and from there to the All American Pipeline pump station. There are no gas processing facilities at the plant.\n\nChevron is committed to operating this plant safely. Significant resources have been invested in safety systems since the plant was constructed, and the facility continues to work with the County of Santa Barbara System Safety Reliability and Review Committee to maintain a safe facility. Process safety management has always been the highest priority at the plant.\n\nThe plant is covered by the Cal-ARP and RMP regulations because the maximum quantity of flammable gas (methane) in the process could exceed 10,000 pounds. The crude oil does contain low concentrations of hydrogen sulfide in the crude; however, the quantity of hydrogen sulfide at the plant does not exceed the RMP threshold quantity.\n\nThe plant has the capacity to handle 30,000 barrels per day (BPD) of stabilized, dry, sweet crude of about 20oAPI. The crude enters the plant at 59-70oF and is heated to 120-130oF. The plant does not need to treat the crude because it meets pipeline specifications for hydrogen sulfide, water, and vapor pressure as it leaves the platforms. \n\n The main process equipment at the plant includes vessels, pumps, heat exchangers, and other related equipment used for heating the oil. The main tanks are an oily water tank (T25), a skimmed oil tank (T8), and a standby tank (T2) for off spec oil and emergencies. A vapor blanket is maintained in the oil tanks using fuel gas make-up at atmospheric pressure. Displaced vapor from the tanks is routed to the vapor recovery system, which includes a knock out and a flare. Under normal operations, the liquid level in T2 is kept low, so there is a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11414,
      "SummaryText": "relatively large quantity of fuel gas in this tank.\n \n  \n \nIn developing the Offsite Consequence Analysis (OCA) for the fuel gas system, the approach taken was to follow the overall guidance provided by EPA in the RMP OCA Guidance (EPA Guidance) document (June 1996), and to use the EPA RMP*COMP model to evaluate the hazard distances for the worst-case and alternative release scenarios. For the worst-case scenario, the reject oil tank (T-2) was selected as the largest vessel and it was assumed that this tank was filled with blanket gas (methane) at atmospheric pressure. The tank volume is 240,000 standard cubic feet, and the maximum quantity of gas that could be in the tank was calculated to be 12,200 pounds. Using the EPA's RMP*Comp Vapor Cloud Explosion (VCE) method for a worst-case scenario, the distance to the overpressure endpoint was 0.2 miles (925 feet).\n\nIt is important to emphasize that the worst-case release scenario described above is extremely unlikely to occur, as it takes no account of the many safety features inherent in the design and operation of the process that prevent such a release from happening. For the worst-case release ever to occur, there would have to be a complete rupture of a tank allowing the gas to be released instantaneously, and the vapor cloud would have to ignite before it dispersed to a concentration less than the LFL. \n\nFor the alternative scenario, it was concluded from a review of the system and the possible initiating events, that no flammable release scenario would be likely to reach offsite. This assumed that the scenario would be a vapor cloud fire with an endpoint equal to the Lower Flammable Limit (LFL). The scenario selected was a release from the VAREC tank relief hatch, as there have been minor release from tank hatches in the past. Other scenarios to consider, listed in the RMP regulation (Part 68.28), were discounted, as they would be less likely to apply to the flammable gas process.  Previous modeling analyses of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11414,
      "SummaryText": "this release scenario were used to estimate the release rate (35 pounds per minute), duration (2.5 minutes) and quantity (90 pounds). Using RMP*COMP, the distance to the flammable endpoint was estimated to be 5 meters to LFL, and 55 meters to half LFL.\n\nDue to the remote location of the plant, there are very few people that live near the plant, and there are very few public receptors. Even for the worst-case scenario, the only public receptor within the distance to the endpoint is the Gaviota Marine Terminal control room which is located 825 feet to the south. The terminal usually has two or three operators by day, and one at night. Other utility stations near the Gaviota facility are normally unoccupied. \n \n Chevron USA has been implementing a process safety management program at the Gaviota facility since PSM came into effect in 1992. The PSM program ensures that drawings and other process safety information are always kept current, process hazard analyses are conducted whenever there is a process modification or after five years when they are revalidated. The management of change and pre-startup safety reviews ensure that changes are identified and managed to prevent accidents. There are written procedures for operations and maintenance, and employees are trained on the procedures relevant to their work assignments. The ongoing implementation of the PSM program is documented in the \"data elements\" summary included in the RMP.\n \n A review of incidents during the last five years indicated that there were no accidents involving the flammable gas that resulted in any offsite impacts, and there were no serious injuries or fatalities onsite. \n \n The Gaviota facility has a comprehensive Emergency Response Plan and a Notification Plan, both of which are coordinated with the local county emergency response agencies. Chevron also participates in a Mutual Aid Program for the Santa Barbara south coast oil and gas facilities. The emergency response plan is tested on a regular"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11414,
      "SummaryText": "basis, and the plant conducts emergency drills in partnership with the county response agencies and the mutual aid partners. Notifications to local agencies provide assurance that local response agencies are on hand quickly to coordinate the response to any offsite impacts that may occur.\n \nThe Gaviota facility has completed all action items which resulted from the Process Hazard Analysis conducted in May, 1998, so there are no outstanding items which are planned to improve safety. As indicated above, the plant has a Management of Change program that is used to identify safety concerns whenever there is a change at the facility. Recommendations developed in each MOC are included in the facility's action tracking system to ensure that they are always addressed in a timely manner. \n \nIn summary, the design of the Gaviota Oil and Gas Plant and the continuing implementation of Chevron's Process Safety Management program for the fuel gas process provide a high level of assurance that the associated risks are being managed in an appropriate manner. The program minimizes the likelihood of a release, and the emergency response program ensures that any incident that does occur is addressed promptly."
    }
  ]
}