{
  "FacilityID": 11428,
  "FacilityName": "Armour Swift-Eckrich",
  "FacilityStr1": "4551 Squires Road",
  "FacilityStr2": null,
  "FacilityCity": "Quincy",
  "FacilityState": "MI",
  "FacilityZipCode": "49082",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26059",
  "LEPC": "Hillsdale EPC",
  "FacilityLatDecDegs": "41.933333",
  "FacilityLongDecDegs": "-84.833333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1317304,
  "ParentCompanyName": "Con Agra Refrigerated Prepared Foods",
  "Company2Name": null,
  "CompanyDUNS": 7258909,
  "Company2DUNS": null,
  "OperatorName": "Armour Swift-Eckrich",
  "OperatorStr1": "4551 Squires Road",
  "OperatorStr2": null,
  "OperatorCity": "Quincy",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49082",
  "OperatorZipCodeExt": null,
  "FTE": 350,
  "OtherEPAFacilityID": "MI0003042",
  "EPAFacilityID": "100000121771",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AQ20#B5581",
  "SafetyInspectionDate": "1999-02-28 00:00:00",
  "SafetyInspectionBy": "Walker & Associates - Insurance Company",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Quincy, MI",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.967669,
  "FRS_Long": -84.825933,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15342,
      "AltID": null,
      "FacilityID": 11428,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19147,
          "ProcessID": 15342,
          "ChemicalID": 56,
          "Quantity": 18482.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15721,
          "ProcessID": 15342,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 7872,
              "Process_NAICS_ID": 15721,
              "SafetyReviewDate": "1999-01-13 00:00:00",
              "PHA_Date": "1999-01-13 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-13 00:00:00",
              "TrainingReviewDate": "1999-02-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-11 00:00:00",
              "EquipmentInspectionDate": "1999-06-20 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "1998-07-07 00:00:00",
              "ChangeMgmtReviewDate": "1998-07-07 00:00:00",
              "PreStartupReviewDate": "1999-03-08 00:00:00",
              "ComplianceAuditDate": "1995-05-12 00:00:00",
              "AuditCompletionDate": "1998-08-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-10-21 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-03 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10870,
                  "PreventionProgram3ID": 7872,
                  "ProcessChemicalID": 19147
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11428,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-03-19 00:00:00",
    "ERTrainingDate": "1999-01-14 00:00:00",
    "CoordinatingAgencyName": "Allen Fire Department (volunteer)",
    "CoordinatingAgencyPhone": "5173687012",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11428,
      "SummaryText": "1.0\tRELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Armour Swift-Eckrich facility in Quincy, Michigan has a good record in preventing releases of anhydrous* ammonia.  As part of their release prevention program, the plant has an excellent operator training program and detailed preventative maintenance program.  More information about these aspects of the prevention program is discussed in Section 4.0 of this Executive Summary.\n\nThe facility has implemented an Emergency Action Plan which is to ensure that the plant is properly prepared and equipped to respond to any emergency including an ammonia release.  This detailed emergency response program includes procedures for handling an emergency - the established action plan and appropriate personnel involved in containing an ammonia release - Emergency Command Team. The Emergency Action Plan is a thorough and comprehensive plan for release prevention and emergency response.  The emergency response policies at the Armour Swift-Eckrich facility ensure that there is emergency response coverage 24 hours - 7 days per week. \n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0\tPROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\nThe Armour Swift-Eckrich Quincy Plant produces processed meats like hot dogs and sausage. The NAICS code for the processes at this facility is 311612.   Many areas of the plant are refrigerated to preserve the meat products. Armour Swift-Eckrich has one regulated substance under 40 CFR 68: ammonia.  Ammonia is used as a refrigerant in the refrigeration of the products in the various areas of the plant.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds.  The total quantity of ammonia stored in the refrigeration process is documented as 18,482 pounds.  The process exceeds the threshold quantity of 10,000 pounds as set by 40 CFR 68 and thus is regulated by the Risk Management Program.\n\n 3.0\tWORST-CASE AND ALTERNATIVE RELEASE"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11428,
      "SummaryText": "SCENARIOS\n\nThe ammonia refrigeration system has associated hazards that can potentially affect on-site employees and the general public off-site if there is a release from the system.  Described below are the associated hazards and the worst-case and alternative release scenario for the regulated chemical.  Though there may be other scenarios possible, EPA only requires that one worst-case and one alternative scenario be reported for each regulated chemical. \n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia will burn at a very narrow and high range of concentrations accompanied with a high ignition temperature.  Although ammonia is not poisonous, it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\nThe risks to persons in an accidental release of ammonia include:\n\n1.\tCorrosive attack of skin and other tissue (including lung tissue)\n2.\tFreezing of skin and other body tissue when contacted by liquid ammonia\n3.\tEye contact\n\nBelow is a description of the release scenarios for ammonia and their off-site consequences:\n\n3.1\tWorst-Case Scenario Description\n\nOne worst-case scenario has been developed for the Quincy plant.  The largest potential release of ammonia would occur with a 1 3/8 inch diameter puncture in the liquid portion of the control pressure receiver.  Taking the specific definition of the worst-case from 40 CFR 68.25, the vessel that can store the largest quantity of ammonia is the high side accumulator.  However, the control pressure receiver would be used as the primary liquid storage vessel during pumpout conditions.  The remainder of the system charge would be transferred to trucks during"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11428,
      "SummaryText": "systemwide pumpout.  The total quantity of ammonia that can be stored in the control pressure receiver is 9,361 pounds.  Therefore, the worst-case release quantity will be 9,361 pounds.  It is assumed that the entire quantity is released inside the building in 10 minutes.  Administrative controls are not applicable to this scenario.  However, since the control pressure receiver is located inside the actual release rate from the building will be reduced to 265.9 lb/min.  For the worst-case release, regulations dictate that the release height is at ground level.  \n\nUnder Section 68.25(c)(1), a regulated toxic substance such as ammonia that is normally a gas at ambient temperature and handled as a liquid under pressure shall be considered to be released as a gas over a 10 minute period.  Thus, ammonia's physical state in the worst-case scenario is a gas.\n\nThe worst-case release scenario distance-to-endpoint will reach off-site receptors.\n\n3.2\tAlternative Release Scenario Description\n\t\t\nThe alternative release scenario is an ammonia release from a liquid ammonia line on the roof. The release scenario considers a forklift truck hitting an evaporator and dislodging it from its mounting.  The evaporator falls toward the floor pulling on a liquid ammonia pipe which splits above the roof. The opening in the damaged pipe is assumed be equivalent to a = inch diameter orifice, and is located 25 feet above ground level.  Administrative and passive controls are not applicable to this scenario.  Active mitigation of the release is human intervention.    \n\nThe alternative release scenario distance-to-endpoint will reach off-site receptors.\n\t\n4.0\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nArmour Swift-Eckrich has developed an OSHA (PSM) program for their ammonia refrigeration system. At Armour Swift-Eckrich, ammonia falls under the RMP Program 3 Prevention Program which is identical to the OSHA PSM program.  EPA has said that if the proces"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11428,
      "SummaryText": "s is in compliance with OSHA PSM, then it is compliance with RMP Program 3.  Thus, Armour Swift-Eckrich's ammonia PSM system has been reviewed and the PSM system elements are being implemented for the RMP. \n\nListed below are the key aspects of the ammonia prevention program:\n\n1.)  Refrigeration operators are trained under a four year apprenticeship program conducted in six month blocks of training.  The formal syllabus includes in-house training and OJT, as well as formal training at local community colleges.  Additionally the plant's refrigeration contractor conducts plant specific training.  Upon completion of the apprenticeship program, the trainee is just a few hours short of receiving an associate degree based on the community college courses alone.\n\n2.)  The Quincy plant uses a Computerized Maintenance Management System (CMMS) for control scheduling and accomplishment of preventative maintenance on components of the refrigeration system.  The scope of preventative maintenance (PM) and testing/inspection (T/I) for refrigeration components is based on individual vendor recommendations and generally accepted engineering practices with regard to types of preventative maintenance and inspections and their recommended frequencies.  Individual work tasks for each type of PM and T/I associated with the refrigeration system are being created.  These tasks are included on the individual work order generated by the CMMS.  This system ensures that each operator/mechanic is aware of the pertinent safety precautions required for a PM procedure as well as the step-by-step actions required to complete the procedure.  The operator/mechanic and their supervisor sign off the completed work order.  Specific results of each PM and T/I procedure are recorded on the work order.  In the event a PM or T/I procedure is not completed satisfactorily, the operator/mechanic notes it on the work order, and a follow-up work order is generated to address the specific deficiency.  Additionally"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11428,
      "SummaryText": ", operator training requirements are input to the CMMS for each operator.  \n\n\n\n5.0\tFIVE-YEAR ACCIDENT HISTORY\n\nThe review of Armour Swift-Eckrich's accident history includes the following range of dates: June 21, 1994 - June 21, 1999.  According to 40 CFR Part 68.42(a), there have been no accidental releases at this facility.\n\n6.0\tEMERGENCY RESPONSE PROGRAM\n\nAs mentioned previously, the Armour Swift-Eckrich facility has developed an Emergency Action Plan (EAP). The EAP is a detailed document which discusses the role of employees in an emergency situation. The plan outlines specific procedures for evacuations for plant personnel. All emergency response personnel (Emergency Command Team) undergo emergency response training. The Emergency Command Team is responsible for implementing the EAP and controlling all aspects of the plan and personnel.\n\nThis document contains information regarding:  1) emergency contacts; 2) coordination with local authorities; 3) emergency communication protocol; 4) emergency action team job descriptions; 5)  organizational charts; 6) emergency notification procedures; 7) emergency evacuation notification procedures; 8) personnel accounting procedures; 9) emergency action team procedures; 10) emergency evacuation/action procedures; 11) incident commander protocol; and 12) training.\n\n7.0\tPLANNED CHANGES TO IMPROVE SAFETY\n\nBased on the completed Process Hazard Analysis (PHA) for ammonia, a list of action items to improve safety was developed and their status monitored to ensure that implementation was accomplished.  An example of safety improvements made at the plant is discussed below:\n\nThe plant has made several modifications to improve the safety of their ammonia system.  These include an ammonia detection system, emergency shutdown system and upgraded ventilation.  The majority of in-plant evaporators have been replaced with penthouse units.  The use of penthouse units allows the removal of all ammonia equipment from the occupied spaces of"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11428,
      "SummaryText": "the building.  Air is circulated from the building through evaporators in the penthouses and back to the cooled space.  Ammonia detectors are installed in each penthouse to monitor for ammonia leaks.  The plant has also installed dead-man valves at all oil draining points.  Additionally, the plant has installed ammonia detectors in the combustion air intake for each of their boilers.  The boilers are located in the same machine room as the ammonia equipment.  The ammonia detector is programmed to shut down the boilers upon detection of ammonia at a preset threshold.  The ammonia detection system also includes a sensor in the pressure relief valve discharge header.  This detector combined with rupture disks and pressure gauges at each relief valve allow the operators to quickly determine which relief valve is discharging in the event of a relief valve release."
    }
  ]
}