{
  "FacilityID": 11461,
  "FacilityName": "Aqua Clear Pools, Inc.",
  "FacilityStr1": "9100 Independence Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chatsworth",
  "FacilityState": "CA",
  "FacilityZipCode": "91311",
  "Facility4DigitZipExt": "5902",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.2355",
  "FacilityLongDecDegs": "-118.589611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 52148392,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Doug Latta",
  "OperatorStr1": "9100 Independence Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Chatsworth",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91311",
  "OperatorZipCodeExt": "5902",
  "RMPContact": "Doug Latta",
  "RMPTitle": "President",
  "FTE": 4,
  "OtherEPAFacilityID": "CA0000646471",
  "EPAFacilityID": "100000121129",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-08 00:00:00",
  "SafetyInspectionBy": "Los Angeles City Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-08-12 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-08 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.2355,
  "FRS_Long": -118.58961,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "No longer covered by Risk Management Plan",
  "_processes": [
    {
      "ProcessID": 15382,
      "AltID": "Chlorine Transfer",
      "FacilityID": 11461,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15762,
          "ProcessID": 15382,
          "NAICSCode": "56179",
          "_desc": {
            "NAICS_CODE": "56179",
            "NAICS_DESCRIPTION": "Other Services to Buildings and Dwellings"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19188,
          "ProcessID": 15382,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519188,
          "ProcessID": 15382,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11461,
      "SummaryText": "\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAqua Clear Pool, Inc. has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.)  To save lives.\n2.)  To minimize and avoid injuries.\n3.)  To protect the environment.\n4.)  To minimize property damage.\n\nAqua Clear Pool, Inc. maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, and to ensure that the plan is kept current.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nAqua Clear Pool, Inc. facility, located in Chatsworth, California, is located approximately two miles south of Highway 118 and six miles west of Highway 405.  The area immediately surrounding the facility is industrial.  A residential population exists approximately one-half mile to the northeast of the facility.\n\nOne-ton chlorine containers are stored in an outdoor, shaded area at the north end of the offices and supplies building.  Crash posts are positioned around the chlorine area to protect the cylinders from vehicle impact.  A maximum of eleven cylinders are stored on site at any given time.  \n\nThe Aqua Clear Pool, Inc. facility repackages liquid chlorine to purify water at swimming pool locations throughout Los Angeles county.  There are two manifolds used in the transfer process of liquid chlorine from one-ton containers to 20-25 pound containers.  Any chlorine vapor that is displaced from the 20-25 pound container is vented to an eject"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11461,
      "SummaryText": "or system and scrubbed with water.  \n\nThe maximum quantity of chlorine on site is 22,000 pounds.\n\nThe facility noted four full time employees on-site in Item 1.11.  It should be noted that there are additional  employees who work off-site.  They visit the facility in the morning to pick up supplies and then spend the rest of the day working off-site.\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\nThe worst case release for this facility was that of the maximum quantity of chlorine that can be stored in the largest vessel in 10 minutes.  The largest vessel at this facility is a one ton chlorine container which holds a maximum of 2,000 pounds of chlorine.  This vessel is stored outside, therefore, no passive mitigation measures were used.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed and F stability.  The facility is located in an urban setting. The reference table, Exhibit 4-4, from EPA's RMP Guidance for Wastewater Treatment Plants was used to find the potential downwind distance to 3 ppm as a result of this worst case release scenario.  The release reaches off-site and may affect population receptors.  No environmental receptors were affected by this potential release scenario.\n\nAlternative Release Result Summary\nThe alternative release was that of a 5/16 inch diameter leak from a pipeline containing liquid chlorine.  Based on the pressure in the tank, the release rate was calculated to be 72 pounds/minute.  Since there is no accident history at this facility, this release scenario was based on the possibility of a leak in the pipeline or a flange seal leak.  The meteorological conditions used were 3 meters/second wind speed, and D stability.  The facility is located in an urban setting.  The reference table, Exhibit 4-12, from EPA's RMP Guidance for Wastewater Treatment Plants was used to find the potential downwind distance to 3 ppm for the alternative release scenario.  This release reaches off-site and ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11461,
      "SummaryText": "y affect other industrial facilities. No residental areas or environmental receptors were affected by this potential release scenario.\n\nNOTE:  The population was estimated using 1990 census tract data with the Landview. III Environmental Mapping Software.  When calculating population densities for large areas which encompass many tracts, the accuracy is rated as good; however, for small areas that encompass only two or three partial tracts, the population data may be skewed on the high side due to the unequal distribution within the tract.  A visual inspection of the area potentially affected by the alternative release scenario revealed no houses or apartment complexes.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures:\nAqua Clear Pool, Inc. has a Process Safety Management program in place to manage the handling of chlorine.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices outlined by the Chlorine Institute and the National Association of Gas Chlorinators.  \n\nTwo trained and experienced operators are present during the repackaging operation.  \n\nNo flammables are stored near the chlorine Fill Station.\n\nEngineering Measures:\nThe Aqua Clear facility is enclosed by a fence with access allowed only through two driveways.  During off hours, the main gate is locked to prevent access.  There is a security system for the buildings that will notify an alarm monitoring company (Westinghouse) in the event of an intrusion.  This system will also call the emergency response team in the event of a chlorine release (chlorine detector connected with main security/alarm system).\n\nThe one ton filling system is manned by two trained operators during the repackaging operation.  The hours of actual repackaging are limited to an annual average of 1-2 hours per day, five days per week.  Containers are closed and stored during non-r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11461,
      "SummaryText": "epackaging hours.\n\nThe one ton filling system can be isolated by closing the Jamesbury ball valves.  Both the transfer cylinder and the one ton container valves can be closed, and the vent valve will be opened to purge the line if necessary.  Finally, there are two scales in use to prevent overfilling due to a mis-calibrated scale.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no reported releases of chlorine at this facility over the last five years since June 1994. It should be noted that this operation has never had an uncontrolled release of chlorine since beginning operations in North Hollywood in 1988.\n\nEMERGENCY RESPONSE PROGRAM\n\nIn the event of an uncontrolled leak, plant personnel will assess the immediate situation.  If necessary, the Los Angeles City Fire Department (LACFD) will be contacted through the 911 exchange.  The LACFD will be advised of the occurrence and provide response personnel if required for the emergency.  CHLOREP can be contacted by calling (304)843-1300.  Plant personnel shall guide and render assistance to responding agencies and coordinate containment procedures, as required.\n\nThe Office of Emergency Services will be notified if any release is of a reportable quantity by calling (800)852-7550.\n\nThe Mission Hills Medical Center, 10306 Sepulveda Boulevard, will be used as the primary receiving medical center.  Physicians have been notified that chlorine inhalation treatment should be administered to any victims and routine examination for evidence of pulmonary edema (water in the lungs), initiated if any cases are severe enough to warrant such attention.  Both city emergency and private transportation will be used to convoy victims to the Hospital.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Hazard Analysis provided the mitigation measures outlined below to improve safety at Aqua Clear Pool, Inc.  The recommendations are scheduled to be implemented on or before June 1, 2000.\n\n\n1. Consider installing a solenoid actuated shut off valve at the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11461,
      "SummaryText": " one ton container that can be actuated at a remote location to isolate a release.\n\n2.  Consider installing an \"extention arm\" for the fill valve situated at the one ton container.  This would allow for easy shut down in the event of a release during the fill procedure."
    }
  ]
}