{
  "FacilityID": 11625,
  "FacilityName": "TOYO TANSO USA, INC.",
  "FacilityStr1": "2575 NW GRAHAM CIRCLE",
  "FacilityStr2": null,
  "FacilityCity": "TROUTDALE",
  "FacilityState": "OR",
  "FacilityZipCode": "97060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41051",
  "LEPC": "Oregon Statewide LEPC",
  "FacilityLatDecDegs": "45.552778",
  "FacilityLongDecDegs": "-122.410278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ttu.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 177746591,
  "ParentCompanyName": "TOYO TANSO CO. LTD.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NAO KONDO",
  "OperatorStr1": "PO BOX 280",
  "OperatorStr2": null,
  "OperatorCity": "TROUTDALE",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97060",
  "OperatorZipCodeExt": "0280",
  "FTE": 125,
  "OtherEPAFacilityID": "ORD987200474",
  "EPAFacilityID": "100000123001",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "GRAPHITE MANUFACTURER AND PROCESSOR",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "1999-11-22 00:00:00",
  "DeRegistrationEffectiveDate": "1999-10-30 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 45.55269,
  "FRS_Long": -122.40934,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15568,
      "AltID": "SiC Coating of Graphite",
      "FacilityID": 11625,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 19400,
          "ProcessID": 15568,
          "ChemicalID": 16,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 15950,
          "ProcessID": 15568,
          "NAICSCode": "335991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8007,
              "Process_NAICS_ID": 15950,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1998-04-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-04 00:00:00",
              "TrainingReviewDate": "1999-01-04 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-10 00:00:00",
              "EquipmentInspectionDate": "1999-05-18 00:00:00",
              "EquipmentTested": "Hydrogen Sensors",
              "ChangeMgmtDate": "1999-01-04 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-01 00:00:00",
              "PreStartupReviewDate": "1999-06-08 00:00:00",
              "ComplianceAuditDate": "1999-03-05 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-08 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-06 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-08 00:00:00",
              "ContractorSafetyEvalDate": "1998-08-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Toyo Tanso uses Methyltrichlorosilane in a coating process with hydgrogen as a pressure/capture gas.  This process coats graphite substrate in high temperature vacum furnaces.",
              "_chemicals": [
                {
                  "PrimaryKey": 11025,
                  "PreventionProgram3ID": 8007,
                  "ProcessChemicalID": 19400
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11625,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-10-22 00:00:00",
    "ERTrainingDate": "1999-06-07 00:00:00",
    "CoordinatingAgencyName": "Gresham Fire Department",
    "CoordinatingAgencyPhone": "5036182351",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11625,
      "SummaryText": "TOYO TANSO USA AND ITS COVERED PROCESS\nToyo Tanso USA is a manufacturer and seller of carbon, graphite, and composite materials.  These materials are used in electrical, mechanical, semiconductor and specialty applications.  Our products range from electric motor brushes to furnaces for high temperature applications.\n\nToyo Tanso falls under the Risk Management Plan (RMP) program due to its use of a liquid chemical called methyltrichlorosilane (MTS).  MTS is used to deposit silicon carbide (SiC) on graphite through a process called Chemical Vapor Deposition (CVD).  The CVD process involves drawing MTS as a vapor into a kiln, which deposits a coating of SiC on the graphite.  The process of coating lasts several hours until the desired thickness of SiC is obtained. \n\nMTS is a listed chemical because one of its byproducts is hydrogen chloride (HCL) vapor, which can be toxic.  Toyo Tanso removes HCL from the process by neutralizing it as it leaves the process container.  \n\nToyo Tanso owns eight one thousand pound cylinders of MTS liquid.  Each cylinder is approximately two feet in diameter by five feet in height.  Although five to six containers are normally on-site, our safety program and systems are in place to manage eight full cylinders safely.  Remaining cylinders are off-site where a professional chemical supply company fills them. \n\nGENERAL AND SPECIFIC ACCIDENTAL RELEASE PREVENTION\nToyo Tanso is committed to protecting people and the environment.  Designated on-site staffs manage safety and environmental services.  Independent evaluation and review are performed by designated on-site staff and outside consultants as appropriate.  \n\nWe began accidental release prevention long before the MTS process was installed by using applicable design codes and standards and OSHA's Process Safety Management (PSM) and Process Hazard Analysis (PHA) regulations.  PHA is a formalized system of identifying possible hazards and responding proactively to prevent accidents from occurr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11625,
      "SummaryText": "ing.  A part of this system is the development of written operations, maintenance, and emergency procedures.  These procedures are in place at Toyo Tanso and are under continual scrutiny.  Written programs are backed up with formal employee training and safety reviews.\n\nTrained employees, formal procedures, code compliance, and ongoing review are not the only systems in place to prevent accidents.  The MTS (and our other production systems as well) are protected through a number of active and passive release prevention, detection and mitigation systems.  Samples of active mitigation systems include automatic leak detection systems and self-closing valves that shut down if system problems occur, emergency foam fire and vapor suppression and a chemical scrubber system.  Examples of passive systems include diking and specially enclosed chemical storage and delivery areas.  \n \nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nToyo Tanso's management is committed to a policy of \"zero\" safety and environmental accidents.  To back this up, Toyo Tanso has developed written accidental release prevention and emergency response protocol, which include procedures specific to MTS.\n\nAccidental release prevention procedures are incorporated into operating procedures so that they are a part of our everyday operations and will not be missed.  One example of such a procedure is leak testing as part of our cylinder change procedure.  Our emergency response program is contained in its own separate, portable binder so that it will be available for emergencies.  \n\nEMERGENCY RESPONSE PROGRAM\nOur written emergency response program has been developed to meet the one-plan model, combining safety, environmental, and other regulations into a single, self-contained plan.  Gresham Fire and Emergency Services has reviewed this plan and we have made modifications to it based upon their recommendations.\n\nGresham Fire and Emergency Services has also visited our site for training purposes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11625,
      "SummaryText": " and they are well aware of MTS hazards and response techniques.  Public notification is managed through the fire department.  On-site notification takes place through visual and auditory alarm systems.  In-house drills are conducted semi-annually.\n\nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\nWe used the EPA's RMP Comp program to develop our worst-case and alternative release scenarios.  Though highly improbable, the worst case scenario that we could develop involves the rupture of all eight cylinders at one time.  This might occur if all our cylinders were on-site and fire, earthquake, or a vehicle (e.g., a crashed airplane) ruptured all eight cylinders.  The EPA's RMP Comp program conservative estimate suggests that the worst-case impact would be up to .6 miles from the facility with an air release of HCL.  There are a few residences in this area as well as a number of other small production facilities and a small municipal airport.  Though not identified as environmental receptors on USGS maps, Arata and Salmon creeks are also within this area.  These locations are identified in Toyo Tanso's most recent emergency response plan.  Gresham Fire and Emergency Services has this information and considers these areas in its response planning.\n\nA slightly more possible scenario that could have off-site consequences (our \"alternative scenario\") would involve an undetected leaking hose on the MTS delivery system.  Though we have controls in place to detect this type of leak (e.g., leak checks, electronic leak detectors, automatic and manual shut-off systems, diking, process enclosures, etc.) we have examined this possibility and are prepared for a leak event.  Under this scenario up to two thousand pounds of chemical could be released since cylinders in use are connected as pairs.  Under this scenario HCL vapor could be dispersed at concentrated levels up to .1 miles from the facility.  If a release occurred, employees would shut down the system, evacuate to predetermined"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11625,
      "SummaryText": " locations and call Gresham Fire and Emergency Services.  Gresham Fire and Emergency Services would coordinate evacuations or in-place-sheltering, as they deem appropriate.  Since the cylinders are stored indoors, in a specially designed and constructed room with leak detection measures in place, as well as diking and fire controls, the impact of the previously mentioned scenario would likely be significantly decreased.\n\nFIVE-YEAR ACCIDENT HISTORY\nToyo Tanso has had no RMP reportable injuries or releases since it began using this process.\n\nPLANNED SAFETY IMPROVEMENTS\nToyo Tanso USA is continually reviewing and improving its safety and quality.  Therefore, we are going to begin formally updating our process safety systems again in July 1999.  This process follows OSHA's Process Safety Regulation.  Updates will be made to Toyo Tanso's Environment, Health and Safety systems and to our RMP submission as needed."
    }
  ]
}