{
  "FacilityID": 11634,
  "FacilityName": "Northern California Product Supply Center",
  "FacilityStr1": "3771 Channel Drive",
  "FacilityStr2": null,
  "FacilityCity": "West Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95691",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06113",
  "LEPC": null,
  "FacilityLatDecDegs": "38.561333",
  "FacilityLongDecDegs": "-121.621333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6943773,
  "ParentCompanyName": "Fleming Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6943773,
  "Company2DUNS": 0,
  "OperatorName": "Fleming Foods, Inc.",
  "OperatorStr1": "3771 Channel Drive",
  "OperatorStr2": null,
  "OperatorCity": "West Sacramento",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95691",
  "OperatorZipCodeExt": null,
  "RMPContact": "Leighton Carlson",
  "RMPTitle": "Facility Manager",
  "FTE": 447,
  "OtherEPAFacilityID": "CAD981623549",
  "EPAFacilityID": "100000123573",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-13 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-04 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.56376,
  "FRS_Long": -121.5707,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "New Owner submitted RMP under new Facility ID, and RMP no longer valid",
  "_processes": [
    {
      "ProcessID": 15577,
      "AltID": "Refrigeration System",
      "FacilityID": 11634,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 15960,
          "ProcessID": 15577,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19409,
          "ProcessID": 15577,
          "ChemicalID": 56,
          "Quantity": 11300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519409,
          "ProcessID": 15577,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11634,
      "SummaryText": "The Fleming Foods Northern California Product Supply Center in West Sacramento, California utilizes approximately 11,300 pounds of anhydrous ammonia in to refrigerate warehoused food prior to distribution.  This exceeds U.S. EPA's Risk Management Program (RMP) threshold quantity (TQ) for preparing an RMP.  Because the facility's utilization of this quantity of ammonia also exceeds the TQ established by U.S. OSHA for preparing a Process Safety Management (PSM) Plan (completed for the facility in March 1996 and revised in June 1999), the facility is subject to Program 3 of the RMP regulations.\n\nIn 1994, the refrigeration facility was expanded by 87,900 square feet and the ammonia refrigeration system was upgraded to state-of-the-art technology.  Ammonia is used in a closed-loop refrigeration system to provide cooling and freezing of food products prior to distribution to various retail outlets.  This warehouse-like facility uses approximately 11,300 pounds (lbs) of ammonia in the system to keep food products at refrigeration and freezer temperatures.  This is the only covered process as determined by U.S. EPA and CalARP regulations.\n\nSeveral safety devices are installed on the ammonia refrigeration system.  A seismic detection system was installed that will automatically close all control valves and electrical outputs in the event of an earthquake.  A total of 16 ammonia detectors are located in refrigerated and mechanical rooms throughout the facility.  These detectors are connected to a control system that will either sound an alarm to facility maintenance personnel in the event of a low-level detection, between 100 and 400 parts-per-million (ppm), or will automatically shut down the system, notify the fire department, close motorized butterfly valves to isolate pressure vessels, and sound an alarm in the mechanical room and guard house in the event that greater than 400 ppm of ammonia is detected.  The refrigeration system is controlled by a computer monitoring sys"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11634,
      "SummaryText": "tem that will display any malfunctions to the plant operator and has the capability of shutting down any component or the entire system should any system temperature or pressure exceed the normal design range.  In the event of an emergency that may affect the refrigeration system, an ammonia dump system is installed which will safely reduce refrigeration system pressure by discharging ammonia from each pressure vessel in the system and routing it through a diffuser that dilutes the ammonia with water and discharges the mixture into a 25,000 gallon underground retention tank.\n\nThe principal element of the Program 3 RMP is the Offsite Consequence Analysis.  This involves developing and modeling one worst-case and one alternative theoretical release scenario to estimate the impact an accidental release may have on the public in the surrounding area.  The worst-case release assumes that the entire ammonia charge is released into the atmosphere during pessimistic meteorological conditions.  This scenario is intended as a basis of comparison with other facilities, but it is not realistic to expect such a scenario to actually occur.  The requirements for the alternative release include that it be more likely to occur than the worst case scenario and that it be substantial enough to reach offsite.  The alternative release scenario assumes average daily atmospheric conditions for the area, which were mandated by the local Administering Agency (AA).  \n\nAll release scenarios were modeled using the air dispersion model Areal Location of Hazardous Atmospheres (ALOHA) version 5.2.2.  Because ammonia can exist in both neutrally bouyant and heavy gas states under the conditions examined, both the Gaussian and heavy gas Algorithms were used.  The more conservative of the two toxic endpoint calculations were used for assessing each release scenario's impact.  The toxic endpoint is given as 0.14 milligrams-per-liter by the American Industrial Hygiene Association's Emergency Response P"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11634,
      "SummaryText": "lanning Guidelines for Level 2. \n\nThe worst-case release scenario incorporated passive mitigation provided by the enclosure of the refrigeration mechanical room, which would facilitate the impingement of released ammonia causing liquid rainout, and reducing the release rate of ammonia vapor.  Therefore, the total amount of ammonia released over 10 minutes would be 11,300 pounds, but the release rate to the atmosphere is 452 pounds/per minute over the 10 minutes  The worst-case release is predicted to reach the toxic endpoint at a distance of 0.8 miles from the facility.  Although the width of the area affected by ammonia concentrations of this magnitude, or footprint, is limited and will only be present downwind from the source, a circle with a 0.8 mile radius is drawn to examine offsite impacts.  Using interpolation of census block groups that fall within this circle it is estimated that 196 people live within this radius, however this number most likely represents a substantial over-count, as the  Fleming facility is surrounded by waterways and other industrial facilities.  There are no public schools, hospitals, or other institutions within this radius, and therefore the only public receptors are major commercial and industrial buildings. There are no environmental receptors within the worst-case radius as defined by the regulations, although there are several waterways.\n\nThe alternative release scenario chosen was identified in the Hazards and Operability study prepared for the PSM as posing the greatest risk (i.e. highest likelihood of occurrence and severest consequences) out of several release scenarios considered.  It consists of a slow leak from valve packing failure in the portion of the system designated as the High Pressure Liquid Node. A total of 985 pounds of ammonia is released over ten minutes, after which time it is reasonable to assume that the leak would have been isolated through the activation of the motor-operated isolation valves and ammonia w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11634,
      "SummaryText": "ould have been removed from the affected node via an emergency dump system.  This release's endpoint extends 0.24 miles from the facility.  Because the area immediately surrounding the facility is strictly industrial, there are no residents or environmental receptors within this radius, nor does it encompass any waterways.\n\nThe Fleming Foods facility has not had any accidental releases of ammonia that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage within the past five years.\n\nThe prevention program requirements for Program 3 RMPs are taken verbatim from applicable sections of the PSM regulations.  This is a result of U.S. EPA's recognition that measures taken to reduce and mitigate hazards to facility workers will also serve the same purpose for the surrounding community and environment.  Thus, in order to eliminate redundancy, the PSM is  referenced in the RMP.  The PSM consists of several elements that contain or describe procedures that must be implemented on an ongoing basis, including ammonia and process safety information,  process hazard analysis, operating procedures, employee training, contractor qualification, pre-startup safety reviews, mechanical integrity of equipment, management of change, incident investigation, and injury and illness prevention. \n\nThe intent of the Process Safety Information (PSI) section is to compile system information for use in conducting the Process Hazard Analysis and to help facility operators to identify and understand the hazards posed by those processes involving highly hazardous chemicals.   PSI must include information on the hazards of the highly hazardous chemicals used in the process, information on the technology of the process, and information on the equipment in the process.  This information must be kept up-to-date as process changes or upgrades are made.  It should also be made availa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11634,
      "SummaryText": "ble to all employees and be included, as necessary, in employee training programs.\n\nThe PSI for the facility includes physical chemical properties of ammonia, ammonia toxicity information, information regarding the refrigeration system design and operation, and equipment standards and chemical usage.  Fleming has also developed an ammonia information notebook that contains essential information about ammonia and the refrigeration system in an easy-to-understand format appropriate for facility visitors, contractors, and personnel not involved with operating the refrigeration system. \n\nThe purpose of the operating procedures portion of the PSM program is to develop, implement, and maintain clearly written, detailed procedures, guidelines, rules and practices for the safe operation of the refrigeration process during all operating phases.  A copy of the operating procedures must be readily accessible to all employees who work on or near the refrigeration system.  All employees involved in the daily operation and maintenance of the refrigeration process should have a full understanding of every operating phase.  This is to include an overview of the process, principles of using ammonia in refrigeration systmes, operating characteristics of the components of the system and the associated safety hazards, and the proper steps to be taken to execute all system-related tasks in a safe manner.  Standard Operating Procedures (SOPs) have been developed that include all pertinent procedures involved with the refrigeration system, including those mandated by the PSM regulation.  A certification form is also provided in the PSM for annual review of all SOPs.\n\nAll employees involved with the refrigeration system must understand the safety and health hazards associated with the use of ammonia in the process.  Therefore, Fleming has developed a written training program for all employees involved in the operation, maintenance, and supervision of the refrigeration system.  Each employe"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 11634,
      "SummaryText": "e involved with the refrigeration system operation will, at a minimum, receive training in understanding MSDS's, routine system operation, emergency system operation, normal and emergency ammonia safety and handling procedures, and the individual's role in emergency response.  This program includes the identity of employees to be trained, the training program technical content, competency requirements, documentation requirements for demonstration of competence, schedule for initial training and refresher training, and training for change.  In addition, contract and maintenance personnel also receive training as provided for in the Contractor Qualification Program.  The PSM includes a form for documenting all training provided to employees.\n\nThe purpose of the Contractor Qualification Program is to help ensure that contractors and their employees are fully aware of the potential dangers involved in the use of ammonia and the refrigeration system.  This awareness should lead to reduced risk of accidents, and thus improved safety for both contractor employees and the company's employees.  It applies to all contractors performing any type of work (e.g. maintenance, renovation) on or in the vicinity of the refrigeration system.  The Contractor Qualification Program consists of a five part procedure to be used during the procurement of a contractor in order to verify that their employees are adequately informed and trained, and includes several forms to facilitate and document the process.  \n\nThe purpose for the pre-startup safety review is to help ensure that certain important considerations have been addressed prior to startup of a new or modified process involving ammonia.  Pre-startup safety reviews are required for all new facilities and for all modifications that result in a change to the process safety information.  The PSM includes a procedure and documentation form for conducting the pre-startup safety review.  The review consists of verifying that all written pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 11634,
      "SummaryText": "ocess safety information is updated, that the requirements for Management of Change have been completed, that all safety, operating, maintenance and emergency procedures are updated, implemented, and adequate, that construction and new equipment is in accordance with the design specifications, and that training for each employee involved in operating or maintaining the new equipment in the process has been completed.\n\nIt is essential to maintain the mechanical integrity of critical process equipment to ensure it is designed and installed correctly, and operates properly.  The mechanical integrity program helps ensure that proper procedures are adequate and are being followed, such that all equipment used to process, store and handle ammonia is maintained properly.  The mechanical integrity program includes an inventory of all refrigeration system equipment, including the date on which it was installed and its life expectancy, a list of scheduled maintenance tasks and inspections and a description of the preventative maintenance program for process equipment. \n\nA PSM compliance audit must be completed at least every three years.  The principal objective of the audit is determine whether the procedures and practices that have been developed to comply with the PSM regulation are adequate and are being followed.  The audit is to include an evaluation of the design and effectiveness of the PSM program and a field inspection of the safety and health conditions and practices to verify that the PSM elements are effectively implemented. \nThe facility manager selects a trained team of people to audit the PSM program.  The audit includes a review of the relevant documentation and process safety information, an inspection of the facility, and interviews with all levels of facility personnel.  The PSM includes forms to facilitate and document the compliance audit.  A PSM compliance audit was just completed in June of 1999.\n\nAny facility or process is continually undergoing chang"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 11634,
      "SummaryText": "e in order to improve the efficiency, operability, or safety of the operation, or to replace mechanical equipment.  In order to facilitate necessary changes, while ensuring that unrecognized and/or unacceptable hazards are not introduced, the management of change (MOC) procedure has been developed.  The objective of the MOC procedure is to help ensure that all changes are properly reviewed, and that any hazards introduced by the implementation of the change are identified and controlled, prior to placing the change in operation.  The MOC procedure is intended to apply to all equipment and procedures involving the refrigeration system, and to any change in procedures regardless of whether the change is considered major or minor, or is of a temporary or permanent nature.  As part of the PSM, definitions, procedures, and documentation forms were developed to accomplish the MOC.\n\nA procedure has been developed to investigate serious incidents or near-misses in order to understand what happened (or could have happened) and to prevent any recurrence of similar incidents, thereby improving the safety of the process.  Formal incident investigations will be performed any time there is an incident which resulted in, or which could reasonably have resulted in (near-miss), a catastrophic release of ammonia.  The procedure includes initial incident response, establishing an investigation team, determining the facts and cause of the incident, recommending corrective and preventive actions, communicating the results, and follow-up.\n\nCalifornia mandates that the facility develop an Injury and Illness Prevention Program (IIPP), which is designed to identify hazardous workplace conditions, and to develop controls, procedures, and work practices to insure these hazards have been identified and corrected.  Portions of IIPP that cover the use of hazardous materials have been integrated into the PSM in order to ensure consistency and eliminate redundancy and overlap between the documents"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 11634,
      "SummaryText": ".\n\nAn Emergency Response Program (ERP) for the Fleming Foods facility was completed in 1996 as part of the OSHA PSM.  The ERP includes an Emergency Response Plan and procedures for training, testing, and using emergency response equipment.  The ERP was prepared in cooperation with City of West Sacramento Fire Department, Sacramento Fire Department, and Yolo County Office of Emergency Services.  Fleming Foods has assembled a fully certified, HAZWOPER trained emergency response team made up of Fleming personnel, as well as the necessary emergency response equipment, such that Fleming personnel will respond to accidental release emergencies\n\nThe same management system developed for the PSM Plan will be used to implement the provisions of the RMP. \n\nBased on the results of the process hazard analysis and the facility's up-to-date compliance with all applicable design codes, industry standards, and regulations, including California's former Risk Management Prevention Program and the OSHA PSM Program, no improvements to insure the public's safety are recommended at this time."
    }
  ]
}