{
  "FacilityID": 11700,
  "FacilityName": "Bil Mar Foods - Storm Lake, Iowa",
  "FacilityStr1": "315 Vilas Road",
  "FacilityStr2": null,
  "FacilityCity": "Storm Lake",
  "FacilityState": "IA",
  "FacilityZipCode": "50588",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19021",
  "LEPC": "Buena Vista County LEPC",
  "FacilityLatDecDegs": "42.639389",
  "FacilityLongDecDegs": "-95.186361",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 612579540,
  "ParentCompanyName": "Sara Lee Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": null,
  "OperatorName": "Bil Mar Foods",
  "OperatorStr1": "315 Vilas Road",
  "OperatorStr2": null,
  "OperatorCity": "Storm Lake",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50588",
  "OperatorZipCodeExt": null,
  "FTE": 500,
  "OtherEPAFacilityID": "IAD984570911",
  "EPAFacilityID": "100000123555",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1993-01-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-08-06 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-11 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.63945,
  "FRS_Long": -95.18431,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility under construction. Removed Ammonia offsite until back for production.",
  "_processes": [
    {
      "ProcessID": 15650,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 11700,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19506,
          "ProcessID": 15650,
          "ChemicalID": 56,
          "Quantity": 19800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16036,
          "ProcessID": 15650,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8048,
              "Process_NAICS_ID": 16036,
              "SafetyReviewDate": "1999-04-14 00:00:00",
              "PHA_Date": "1999-04-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-05-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "location of ammonia piping to safe, accessible locations",
              "OpProceduresReviewDate": "1999-04-14 00:00:00",
              "TrainingReviewDate": "1999-04-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Hands-On Training",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-14 00:00:00",
              "EquipmentInspectionDate": "1999-04-14 00:00:00",
              "EquipmentTested": "System piping",
              "ChangeMgmtDate": "1999-04-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-14 00:00:00",
              "PreStartupReviewDate": "1999-04-01 00:00:00",
              "ComplianceAuditDate": "1999-04-14 00:00:00",
              "AuditCompletionDate": "2000-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11081,
                  "PreventionProgram3ID": 8048,
                  "ProcessChemicalID": 19506
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11700,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-14 00:00:00",
    "ERTrainingDate": "1999-03-01 00:00:00",
    "CoordinatingAgencyName": "Storm Lake Fire Department",
    "CoordinatingAgencyPhone": "7127328024",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11700,
      "SummaryText": "RISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\nBil Mar Foods\nStorm Lake, Iowa\n\nBackground Data\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Bil Mar Foods (Bil Mar) submits this Risk Management Plan (RMP) for operations at their Storm Lake, Iowa facility. Bil Mar operations include slaughtering, de-boning, and some processing.  Bil Mar has been in operation at this facility for over 41 years providing quality meat products and over 500 jobs to the local community.\n\nAccidental Release Prevention and Emergency Response Policy\n\nBil Mar Foods is committed to protecting the health of its employees, the surrounding community, and the environment. It is Bil Mar's policy to maintain a safe and healthy workplace, protect the environment, and comply with all applicable regulations, including 40 CFR 68 and, as applicable, Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA's Hazardous Operations and Emergency Response regulations (29 CFR 1910.120).\n\nStationary Sources and Regulated Substances\n\nBil Mar Foods is required to maintain low temperatures in the food processing areas of the plant that are within standards required by the United States Department of Agriculture (USDA) to ensure quality in the final products. Bil Mar Foods also operates freezers and coolers for product storage. Bil Mar uses anhydrous ammonia (the 112(r) regulated substance) as a refrigerant to maintain the 113,640 ft2 facility within the required range of operating temperatures and to operate the freezers and coolers. Anhydrous ammonia is an industry-standard refrigerant for meat processing plants. Bil Mar's refrigeration system consists of receivers, compressors, evaporators, condensers, and piping.  \n\nWorst Case Release Scenario\n\nAs required by 40 CFR 68 Sub"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11700,
      "SummaryText": "part B, Bil Mar has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  The worst-case release scenario is defined as the release of the entire contents of the largest single vessel over a 10-minute period.  Based on Bil Mar's refrigeration system, the worst-case release scenario is the rupture of the high pressure receiver (2,468 gallon vessel) when filled to 80% capacity.  Using EPA's RMP*Comp 1.06 version, it was determined that the ammonia release would reach offsite endpoints and nearby public / environmental receptors. \n\nThe worst-case release scenario was developed following EPA regulations and is not considered by Bil Mar to be a likely release scenario for the facility. During normal operations, Bil Mar maintains the receiver at no more than 50% capacity. Only during pump-down operations does the receiver have the potential to be filled to 80% of capacity. The receiver is operated in pump-down mode less than 1% of the time during the year.\n\nAlternative Release Scenario\n\nA more realistic release scenario (alternative release) was developed by Bil Mar Foods taking into consideration the 5-year history of operation's experience and the hazards identified in the process hazard analyses conducted to ensure that Bil Mar's hazards are identified and minimized. These analyses were conducted in accordance to Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119). In accordance with 40 CFR 68.28, alternative release scenarios were considered, that would be more likely to occur than the worst-case release scenarios.  \n\nAfter reviewing the process hazard analysis performed on the system, the most likely anhydrous ammonia release could occur from a damaged ammonia pipe. Using EPA's RMP*Comp 1.06 version, it was determined that the ammonia release would reach offsite endpoints"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11700,
      "SummaryText": "and nearby public / environmental receptors. \n\nAccidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, Bil Mar has implemented certain precautionary measures, including process / equipment controls, procedures, preventative maintenance programs, employee training and auditing.  In addition, Bil Mar's ammonia refrigeration system is designed and constructed in accordance with accepted industry standards and good engineering practices. \n\nBil Mar has also developed and implemented a PSM program pursuant to OSHA regulations and as such, has evaluated the system for the potential of anhydrous ammonia releases.   Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and manual shutoffs) and automated controls (automatic level controls and electric distribution system grounding).  In addition, Bil Mar has trained approximately 40 personnel to respond to potential ammonia releases (HazMat team).\n\nBil Mar has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system that incorporate safety measures into the procedures.  These safety procedures were developed by refrigeration system operators and are reviewed on an annual basis. Bil Mar encourages employee participation in development of the control measures used at the plant by means of company newsletters and training sessions.  Pursuant to written management of change procedures established by Bil Mar, any changes to the operating procedures are to be communicated to affected employees.\n\nBil Mar understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore Bil Mar has implemented a preventative maintenance program.  The preventative maintenance program is scheduled, documented and managed using a computer maintenance management software system to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11700,
      "SummaryText": "ensure that regular maintenance occurs on the system.  Also, to ensure the mechanical integrity of critical refrigeration system components.\n\nTo ensure that Bil Mar's control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n7 In accordance with the PSM program, Bil Mar conducts detailed PSM compliance audits at least every three years that incorporate review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n \n7 Bil Mar's insurance carrier also conducts independent audits on an annual basis.\n \n Five-Year Accident History\n \n Over the last five years, Bil Mar has not experienced an accidental off-site release of anhydrous ammonia from the ammonia refrigeration system.\n \n Emergency Response Program\n \n Bil Mar has documented emergency response procedures in a document entitled BIL MAR FOODS EMERGENCY RESPONSE PLAN in order to facilitate response efforts in the event of an off-site anhydrous ammonia release.  Included in the plan are measures to be taken internally by Bil Mar as well as measures to be taken by off-site response agencies.\n \n Bil Mar has trained approximately 40 on-site personnel to respond to accidental ammonia releases.  These personnel are trained in accordance with 29 CFR 1910.120, OSHA's Hazardous Operations and Emergency Response regulations according to their duties and function.  These personnel receive initial training and annual update training thereafter.  As an additional training exercise, a simulation of an emergency release with off-site effects is conducted on an annual basis, with the entire emergency response system.  The civil defense (emergency managemen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11700,
      "SummaryText": "t) coordinator, local fire and police departments, as well as the emergency medical staff from the local hospital participate as observers and critique the training exercise. \n \n To assure that the local governmental response agencies are familiar with Bil Mar's emergency response procedures, Bil Mar has submitted copies of the plan for review and approval by the local agencies.  The following local agencies have reviewed and approved Bil Mar's SOP:\n \n7 Civil Defense (Emergency Management) Coordinator\n \n7 Police Department\n \n7 Fire Department\n \n7 Local Hospital Emergency Medical Staff\n \n To plan for an ammonia release with off-site effects, Bil Mar's plan includes procedures/equipment to mitigate the release, procedures to inform local response agencies, transportation maps for response agencies, evacuation route maps, and procedures for public communication.\n \n In the event of an anhydrous ammonia release with off-site effects, the general public will be warned using the following methods:\n \n7 Sirens\n \n7 Broadcast message via the local cable television system\n \n7 Police and fire vehicles equipped with public address systems, and\n \n7 Door-to-door notification of residents (if deemed necessary).\n\nAs backup measures, Bil Mar has arranged emergency response assistance with a local clean-up contractor and the Fire Department has arranged for back-up assistance from another local environmental clean-up contractor.\n\nContinuing Efforts to Improve Safety\n\nAs part of Bil Mar Foods' continuous efforts to improve the safety of the system, changes are planned at the facility to improve safety and prevent anhydrous ammonia releases.  These changes include improvements to operating procedures, relocation of ammonia equipment to safer locations, increased protection of ammonia equipment (e.g., guarding), and increased ammonia safety training."
    }
  ]
}