{
  "FacilityID": 11713,
  "FacilityName": "Vicksburg Chemical Company",
  "FacilityStr1": "4280 Rifle Range Road",
  "FacilityStr2": null,
  "FacilityCity": "Vicksburg",
  "FacilityState": "MS",
  "FacilityZipCode": "39182",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28149",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "32.295",
  "FacilityLongDecDegs": "-90.903944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 148253156,
  "ParentCompanyName": "Trans-Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 178212874,
  "Company2DUNS": 0,
  "OperatorName": "Vicksburg Chemical Company",
  "OperatorStr1": "4280 Rifle Range Road",
  "OperatorStr2": null,
  "OperatorCity": "Vicksburg",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39182",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Boswell",
  "RMPTitle": "Director of Environmental Affairs",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124689",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2780-00041",
  "SafetyInspectionDate": "1999-05-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "2002-03-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.29542,
  "FRS_Long": -90.90611,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 15667,
      "AltID": "Chlorine Storage and Use",
      "FacilityID": 11713,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16054,
          "ProcessID": 15667,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19523,
          "ProcessID": 15667,
          "ChemicalID": 62,
          "Quantity": 382000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519523,
          "ProcessID": 15667,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 15668,
      "AltID": "Nitric Acid Use",
      "FacilityID": 11713,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16055,
          "ProcessID": 15668,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 16056,
          "ProcessID": 15668,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 16057,
          "ProcessID": 15668,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19524,
          "ProcessID": 15668,
          "ChemicalID": 58,
          "Quantity": 210000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 58,
            "ChemicalName": "Nitric acid (conc 80% or greater)",
            "CASNumber": "7697-37-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519524,
          "ProcessID": 15668,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 15669,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 11713,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16058,
          "ProcessID": 15669,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 16059,
          "ProcessID": 15669,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 16060,
          "ProcessID": 15669,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19525,
          "ProcessID": 15669,
          "ChemicalID": 56,
          "Quantity": 1800000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519525,
          "ProcessID": 15669,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11713,
      "SummaryText": "General Executive Summary for Vicksburg Chemical Company\n\nAccidental Release Prevention and Emergency Response Policies\nWe at Vicksburg Chemical Company are strongly committed to employee, public, and environmental safety and health.  This commitment is inherent to a comprehensive accidental release prevention program that includes procedures for the operation, maintenance, emergency response, and employee training associated with the regulated process at this facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances and adhere to all applicable Federal and state rules and regulations.\n\nThe Stationary Source and the Regulated Substances Handled\nThe regulated substances present at Vicksburg Chemical Company are anhydrous ammonia (900 tons), chlorine (150 tons), and 81% nitric acid (105 tons).  \n\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s)\nTo evaluate the worst case release scenario, EPAs RMP*Comp program was utilized.  The alternative release scenarios were modeled using ALOHA.  The following paragraphs provide details of the chosen scenarios as required by 40 CFR Part 68.1 - 68.33.\n\nThe worst case release scenario submitted for Program 3 toxic substances involves a release from the main chlorine product storage vessel at the facility.  The scenario involves the release of 300,000 lbs. of liquefied chlorine instantaneously. Under worst case weather conditions, the distance to the endpoint of 3 ppm is 20 miles from the chlorine tank.  The estimated population within this area is approximately 68,800 people. Public receptors potentially affected by this type of scenario include residences, a school, hospitals, commercial areas, municipal centers, and recreational areas.\n\nAlternative release scenarios were evaluated for chlorine, anhydrous ammonia, and nitric acid.  The alternative release for chlorine involves a crack in process piping during a tornadic storm, which would result in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11713,
      "SummaryText": " the release of 7,000 pounds of chlorine.  The distance to endpoint for this type of release is 1.7 miles and could potentially affect 2,350 people.  Public receptors potentially affected by this type of scenario include residences, a school, hospitals, commercial areas, and recreational areas.\n\nThe alternative release scenario for anhydrous ammonia entails the loss of the contents of an in-process vessel containing 28,890 pounds of material.  This type of scenario would also most likely be the result of a tornadic storm.  The distance to the endpoint of 200 ppm is approximately 1.5 miles.  The estimated population affected by this type of release is 1,620 people. Public receptors potentially affected in this scenario include residences, commercial centers, and recreational areas.\nThe alternative release for nitric acid involves the loss of the contents of an in-process vessel during a tornadic storm, resulting in the release of 23,950 pounds of nitric acid.  The distance to endpoint for this type of release is 0.41 miles and could potentially affect 60 people.  The only public receptors potentially affected by this type of scenario are residences.\n\nThe General Accidental Release Prevention\nThe Vicksburg Chemical Company facility is in compliance with EPAs Accident Release Prevention Rule set out under 40 CFR Part 68 and all applicable state codes and regulations.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nSafety Information\nVicksburg Chemical Company maintains the applicable Material Safety Data Sheets related to this process.   The facility also maintains detailed records of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with this process.  \n\n\n\nHazard Review\nVicksburg Chemical Company conducts comprehensive reviews to ensure that the hazards associated with the process are identified and controlled efficiently.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11713,
      "SummaryText": "The studies are undertaken by qualified personnel who are experienced in engineering and process operations.  The reviews are revalidated every year.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nIn order to ensure safe operation of the covered process, Vicksburg Chemical Company maintains written standard operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround.  The information is regularly reviewed and readily accessible to operators involved in the processes.\n\nTraining\nVicksburg Chemical Company ensures that employees who are operating this process are competent in the operating procedures associated with this process.  Refresher training is provided at least every three years and more frequently as needed.\n\nMaintenance\nVicksburg Chemical Company carries out maintenance checks to maintain the mechanical integrity of the process equipment.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Qualified personnel carry out maintenance operations.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits\nVicksburg Chemical Company will conducts audits on a regular basis to determine whether the provisions set out under 40 CFR Part 68 are being implemented and reviewed.  These audits are performed by qualified personnel and are carried out at least every 3 years.  Any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  The most recent two audits are kept on-site.\n\nIncident Investigation\nVicksburg Chemical Company promptly investigates any incident that has resulted in, or could reasonably resu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11713,
      "SummaryText": "lt in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Any investigation findings are resolved promptly and the corresponding resolutions or corrective measures are documented.  All reports are retained for a minimum of 5 years.\n\nFive-year Accident History\nVicksburg Chemical Company has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental releases resulting in significant onsite or off-site impacts have occurred.\n\nEmergency Response Plan\nVicksburg Chemical Company maintains an emergency response plan which details the proper procedures for handling accidental releases of the regulated substances utilized on-site.  Personnel who respond to such emergencies are properly trained."
    }
  ]
}