{
  "FacilityID": 11724,
  "FacilityName": "CRYOVAC RIGID PACKAGING DIVISION",
  "FacilityStr1": "Tuckerton Road",
  "FacilityStr2": "Reading Crest Avenue",
  "FacilityCity": "Reading",
  "FacilityState": "PA",
  "FacilityZipCode": "19605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42011",
  "LEPC": "Berks County LEPC",
  "FacilityLatDecDegs": "40.404083",
  "FacilityLongDecDegs": "-75.9455",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "LF",
  "FacilityURL": "www.sealedair.com",
  "FacilityEmailAddress": "larry.waldbiesser@sealedair.com",
  "FacilityDUNS": 3341609,
  "ParentCompanyName": "CRYOVAC, INCORPORATED",
  "Company2Name": "SEALED AIR CORPORATION",
  "CompanyDUNS": 3341609,
  "Company2DUNS": 2457638,
  "OperatorName": "CRYOVAC RIGID PACKAGING DIVISION",
  "OperatorStr1": "P. O. BOX 295",
  "OperatorStr2": "N/A",
  "OperatorCity": "READING",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19603",
  "OperatorZipCodeExt": "0295",
  "FTE": 340,
  "OtherEPAFacilityID": "PAD000647677",
  "EPAFacilityID": "100000124634",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "06-05036",
  "SafetyInspectionDate": "1999-02-03 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.404121,
  "FRS_Long": -75.945134,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15684,
      "AltID": "Pentane storage",
      "FacilityID": 11724,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19543,
          "ProcessID": 15684,
          "ChemicalID": 125,
          "Quantity": 157500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16075,
          "ProcessID": 15684,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8075,
              "Process_NAICS_ID": 16075,
              "SafetyReviewDate": "1999-03-19 00:00:00",
              "PHA_Date": "1998-08-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-15 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Firefighting foam",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Coffers",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Heat detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-15 00:00:00",
              "TrainingReviewDate": "1999-02-25 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-10-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-27 00:00:00",
              "EquipmentTested": "Automatic shutoff valve and unloading valve",
              "ChangeMgmtDate": "1999-02-25 00:00:00",
              "ChangeMgmtReviewDate": "1999-02-25 00:00:00",
              "PreStartupReviewDate": "1999-02-25 00:00:00",
              "ComplianceAuditDate": "1999-02-25 00:00:00",
              "AuditCompletionDate": "1999-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11111,
                  "PreventionProgram3ID": 8075,
                  "ProcessChemicalID": 19543
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11724,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-04-23 00:00:00",
    "CoordinatingAgencyName": "Berks County LEPC",
    "CoordinatingAgencyPhone": "6103744800",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11724,
      "SummaryText": "CRYOVAC Rigid Packaging Division\nCRYOVAC, Incorporated\nP.O.Box 295\nReading, Pa. 19603-0295\n\n\nCRYOVAC Rigid Packaging Division,  CRYOVAC, Inc.\nJune 21, 1999\nRMP REPORTING CENTER\nP.O.Box 3346\nMerrifield, Va. 22116-3346\n EXECUTIVE SUMMARY\n\nIt is CRYOVAC\u0012s policy and procedure to operate its facilities in a safe and environmentally responsible way.  It is each facility and/or Division Manager\u0012s responsibility to ensure that all Corporate, Division, and regulatory laws, rules, policies, and/or procedures are followed.  It is the responsibility of each employee to adhere to these laws, etc. and to conduct themsleves in a safe manner when performing their tasks.\n\nThe Corporation has embraced and is committed to the \u0013World Class Manufacturing\u0014 program; a portion of this program strives for safety and environmental excellence.  Audits are performed on each facility to ensure that the program is being adhered to and Division General Managers are responsible to correct any recommended deficiencies of an audit.\nThe facility has a safety operations program that supports worker and public health, safety, fire security and environmental issues.  The facility and Division Engineering group have written and published an \u0013Emergency Operations Manual (EOM)\u0014 to provide guidance and procedures to follow in an emergency situation for in-house emergency commanders, management staff, and workers.  The manual\u0012s format is a \u0013what if\u0014 type book that covers all the emergencies that are perceived to be able to happen to the facility from security emergencies to chemical spills or leaks.  The facility has also organized, trained, and equipped an approximately 60 person in-house fire brigade covering all shifts equally and trained/equipped to OSHA 1910.156 regulations for an interior/exterior fire brigade.\nPreplans are a part of the EOM and the brigade trains on the plans routinely.  The plans are reviewed annually and the brigade trains quarterly for fire suppression/prevention, annually for Con"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11724,
      "SummaryText": "fined Space Rescue, annually for Hazardous Materials Technician Review (OSHA 1910.120), annually (each shift) for total plant evacuation, and annually for first aid to the ERT American Red Cross level.  \nn-Pentane delivery storage and use has a preplan in the EOM and is a part of the \u0013Chemical Spill and Leak\u0014 plan, the sanitary sewer \u0013Slug Loading Prevention Plan\u0014 as required by the City of Reading, PA, Bureau of Water and Sewer and lastly, is covered and required under Process Safety Management (PSM).\n PROCESS OVERVIEW:\n\nCRYOVAC Rigid Packaging Division is a converter of hard polystyrene resin pellets into soft foam sheet and then into tray type containers for the food industry.  The containers are primarily as meat packaging trays, poultry trays, and market ready type containers.  During the initial process, known as extrusion, the pellets are heated under pressure along with colorants and blowing agents in an extruder machine and then discharged as foam around a die and over a mandrel that cools and slices the foam into sheets.  The sheet is rolled on a winder and set to age.  After aging is complete, the roll of sheet is thermoformed by heating the sheet and molding the parts, which then are cut out of the sheet and packed for customers.  The residual waste is ground up and repelletized and reused \nin-house or sold on the recycling market.\n\nOVERVIEW OF BLOWING AGENT:\n\nOne of the blowing agents in foam manufacturing is n-Pentane, which is injected into the extruder barrel at high pressure and at low volume to assist in creating \u0013cells\u0014 in the liquefied plastic to manufacture foam.  The n-Pentane is pumped through a continuous loop and returned to its underground storage tank.  Each extruder machine uses n-Pentane as required on demand.  In addition to the pumping storage tank, there is an additional underground storage tank that is a static (no pumps) tank and is interconnected (piping) to each other.  The n-Pentane is transferred from the static tank to the pump"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11724,
      "SummaryText": "ing tank via a siphon pipeline.  Each tank holds 19,800 gallons and can only be filled to 90% due to safety interlocks installed in the filling system.  The receiving area, filling system, and tank storage are in an enclosed area by a 10 foot high chain link fence which is inside the facilities 10 foot high and one foot of barbed wire perimeter fence that is looked over by a contracted security force.\n\nn-Pentane is delivered to the facility primarily by railroad tanker cars that hold up to 30,000 gallons or 157,500 lbs. and is unloaded, by gravity, through a tank filling system that is state of the art flammable liquid unloading including a diked capture system that is equal to the capacity of the\nrail tanker plus one third the car volume.  A static grounding system is interlocked with the unloading \nair valve that stops the unloading action if the ground connection is interrupted.  The capture vault, tanker car  unloading station, and the tanker car are protected by an AFFF firefighting foam fixed system that can discharge 1,700 gallons of foam per minute.\n\nOn occasion, pentane is received by highway tanker truck of 9,000 gallons or 47, 250 lbs. capacity.  The unloading method is the same as for rail tankers, however, the trucks are not protected by the fixed foam system.  Handheld, portable foam suppressing appliances and foam concentrates are available for truck unloading.\n\nWORST CASE SCENARIO:\n\nA flammable worst case scenario assumes a hydrocarbon vapor cloud explosion from a boiling liquid expanding vapor explosion (BLEVE) of a 30,000 gallon or 157,500 lb. railroad tanker car.  Per \u0013RMP*Comp\u0019 calculations for this volume of pentane, the distance to a one (1) pound per square inch over pressure is 0.40 miles.  The estimated residential population within the overpressure distance is 150 people.  In addition to the residential population, there is an industrial/commercial population within the overpressure distance of approximately 300 persons.\n\nThe likelihood of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11724,
      "SummaryText": "an actual BLEVE of the tanker is unlikely due to the multilayered safety devises that have been installed at the unloading rack.  In addition to passive safety devises, there are safe unloading procedures and training programs that must be followed for Process Safety Management (PSM).\n ALTERNATE WORST CASE SCENARIO:\n\nThe more likely incident is a ruptured \u00133 inch\u0014 unloading hose from a highway tanker truck.  As an alternate scenario, the ruptured hose from a \u0013pull away\u0014 accident or a horizontal split of the hose casing (due to age) would cause a pool, which could ignite creating a pool fire.  The amount discharged before the source could be shut off would be about 2,050 lbs. a minute for about \n5 minutes.  Using the EPA\u0012s RMP*Comp\u0019 to calculate the endpoint of 5 KW/M2 for 40 seconds exposure, the exposure distance is 0.09 miles (475 feet) the consequence of which would most likely not reach the property boundaries.  \n\nThe procedures in place, such as the unloading mechanic may not leave the vessel unless relieved by an equally trained mechanic, makes the likelihood of a major spill/leak very remote.\n\nPentane is only unloaded during daylight hours during the routine business week.  During this time period, the facility Emergency Response Team is fully peopled and equipped to respond to an emergency involving pentane.  Flammable liquid firefighting and Hazardous Materials Incident Management and Mitigation is part of the ongoing training of this team.\n\nFIVE YEAR HISTORY:\n\nThis facility has not had a pentane accident in the past five years.\n\nEMERGENCY RESPONSE PROGRAM:\n\nAlthough the CRYOVAC Reading facility believes in the prevention of a spill release and has installed a state of the art unloading facility to assist in accomplishing this goal along with a selected group of \u0013A\u0014 level mechanics who are specially trained per the PSM plan to offload these tankers, it does however believe that the unexpected can happen and therefore has taken several positive steps to supp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 11724,
      "SummaryText": "ress/mitigate a fire and/or spill should it occur, regardless of the remoteness of the probability.  To insure the immediate suppression of a fire that could impact the tanker vessel, an A.F.F.F. \nfirefighting foam system is installed over, under, and around the tanker car and is heat activated.  The facility has a well-trained and motivated in-house response team of 60 employees and members of the team occupy the facility on a continuous basis, 7 days a week, 52 weeks per year.  The team annually practices on flammable liquid firefighting and flammable gas firefighting on large demonstration fires at the Berks County Fire Training Site, Reading, PA.\n\nThe team has several documents that guide its actions during the emergencies that would involve pentane.  The material and the process fall under the PSM regulations, the stormwater regulations, RCRA PPC plans (preplans) and under the Clean Water Act with emphasis on \u0013slug unloading prevention of sanitary sewers\u0014.  All preplans have been sent to the local fire department who also visit or respond to the facility.  The particulars of the character of the pentane have been sent to the County Emergency Management Agency and the Berks County L.E.P.C.  The local firefighting resources are three volunteer fire companies that provide protection to the Township on a mutual aid basis.\n\n\n\n\n\t\t\t           \n\n\t\t\t           Larry B. Waldbiesser\nDivision Environmental, Health, and\n\t\t\t           Safety Technologist"
    }
  ]
}