{
  "FacilityID": 11794,
  "FacilityName": "Meadow Gold Dairies-Honolulu",
  "FacilityStr1": "1418 Young Street",
  "FacilityStr2": null,
  "FacilityCity": "Honolulu",
  "FacilityState": "HI",
  "FacilityZipCode": "96814",
  "Facility4DigitZipExt": "1816",
  "FacilityCountyFIPS": "15003",
  "LEPC": "Honolulu LEPC",
  "FacilityLatDecDegs": "21.299222",
  "FacilityLongDecDegs": "-157.839194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 87192134,
  "ParentCompanyName": "Southern Foods Group, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 174127555,
  "Company2DUNS": null,
  "OperatorName": "Meadow Gold Dairies",
  "OperatorStr1": "1418 Young Street",
  "OperatorStr2": null,
  "OperatorCity": "Honolulu",
  "OperatorStateFIPS": "HI",
  "OperatorZipCode": "96814",
  "OperatorZipCodeExt": "1816",
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124108",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Ammonia Refrigeration System",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-10-14 00:00:00",
  "DeRegistrationEffectiveDate": "2003-07-16 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 21.2992,
  "FRS_Long": -157.83958,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15777,
      "AltID": "Ammonia Refrigeration Sy.",
      "FacilityID": 11794,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 19645,
          "ProcessID": 15777,
          "ChemicalID": 56,
          "Quantity": 9943.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16171,
          "ProcessID": 15777,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8157,
              "Process_NAICS_ID": 16171,
              "SafetyReviewDate": "1999-03-25 00:00:00",
              "PHA_Date": "1999-03-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Corrosion of liquid ammonia line to King coil.",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Replace of some liquid and hot gas ammonia lines.",
              "OpProceduresReviewDate": "1999-03-25 00:00:00",
              "TrainingReviewDate": "1999-03-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-25 00:00:00",
              "EquipmentInspectionDate": "1999-03-26 00:00:00",
              "EquipmentTested": "Ammonia lines, Ice Builder, Glycol Chiller, Amerio & Receiculating Vessel, Phillips Transfer Unit, Compressors & Safety Relief Valves",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-10-05 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-10-05 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-05 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11208,
                  "PreventionProgram3ID": 8157,
                  "ProcessChemicalID": 19645
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 11794,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Honolulu Fire Department",
    "CoordinatingAgencyPhone": "8088317771",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 11794,
      "SummaryText": "e conducted every three years to ascertain whether or not the program is in place and working properly.\n\nE.  Five-Year Accident History\n\nBoth ammonia condensers were recently replaced as a result of an inspection which revealed pitting of the coils.  During the replacement of one of the condensers, the contractor purged a small amount of ammonia into a 55 gallon drum which overflowed into the sewer.  An odor was detected and the fire department investigated the source.  The quantity released was less than the 100 pound reportable quantity.\n\nThere were no other ammonia-related incidents at the facility in the previous five years which resulted in significant on-site or off-site consequences.\n\nF.  Description of the Emergency Action Plan\n\nAn emergency action plan has been implemented at the facility.  This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures.  The program has been coordinated with the Honolulu Fire Department.\n\nThe emergency action program consists of the following elements:\n\na.  Organization Plan and Responsibilities\nb.  Communication Procedures\nc.  Detailed Action Plans\nd.  First Aid Procedures\ne.  Emergency Medical Treatment Procedures\nf.  Evacuation Plans\ng.  Description of Outside Assistance Available\nh.  Site Re-Entry Procedures\ni.  Training Programs and Drills\n\nG.  Planned Changes to Improve Safety\n\nSome additional ammonia piping outside on the roof will be replaced during the latter part of 1999 and during 2000."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 11794,
      "SummaryText": "A.  Describe accidental release prevention and emergency response policies.\n\nMeadow Gold Dairies recognizes management's responsibility in protecting its employees, equipment, property, and the environment.  The safety and health of all personnel and the protection of the environment are very important.  The control of accidents has been and will continue to be a basic responsibility of all personnel in the facility.\n\nThe Company has a Plant Safety Program.  The primary objective of the Plant Safety Program is to achieve maximum efficiency and saftey performance.\n\nTo accomplish the Company's goal in preventing the accidental releases of ammonia and minimizing the impact of any release, the facility has developed and implemented a Process Safety Management and Risk Management program to comply with OSHAs Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119) and EPAs Risk Management Program (RMP) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).  Emergency Response programs have been reviewed as well.  The objectives of the PSM/RMP programs are to prevent accidental releases through use of good operating procedures and mechanical intregrity of the ammonia refrigeration system.  The Plant Manager is responsible for the management of the accidental release prevention and emergency response programs.\n\nB.  Stationary Source and Regulated Substances Handled\n\nMeadow Gold Dairies operates a production facility where ice cream products are processed, packaged, sold and distributed from this facility.  An important part of the processing and handling involves an ammonia refrigeration system to provide cooling and freezing during processing and storage at the facility.  The maximum intended inventory of anhydrous ammonia (CAS # 7662-41-7) contained in the system is 9,943 pounds.\n\nThe ammonia refrigeration system is a closed loop system whereby liquid ammonia from the hi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11794,
      "SummaryText": "gh pressure receiver located outside the building is piped in special piping to refrigeration equipment used for cooling and freezing.  During cooling and freezing, the pressure of the ammonia is reduced so that the ammonia can take away heat from the milk being cooled and the cold storage rooms being cooled as well as ice cream being frozen and stored in freezer rooms.  The ammonia returns in vapor form at a low pressure to the ammonia compressors where the vapors are compressed and piped to the condensers located outside.  Forced air and recirculated water cool and condense the vapors in the lines.  From the condensers, the ammonia flows by gravity back to the high pressure receiver, thus completing the loop.  Ammonia is a non-corrosive chemical; therefore, does not deteriorate the inside of vessels, lines or valves.  It also carries a small amount of oil from the compresssors.  All vessels containing ammonia are ASME pressure rated above the maximum operating pressure.\n\nC.  Summary of Worst-Case and Alternative Release Scenarios\n\nThe Worst-case release scenario at the facility involves the release of 2,693 pounds of ammonia over a 10 minute period which would result due to a failure of the high pressure receiver.  This quantity includes all the ammonia in the high pressure receiver V-1 coupled with the quantity in both ammonia condensers EC-1 & EC-2, the SOV vessel V-3, and the lines returning liquid ammonia to the high pressure receiver.  Under worst-case weather conditions, ammonia could travel 0.6 mile before dispersing enough to no longer pose a hazard to the public.\n\nThe worst-case release scenario is highly unlikely for the following reasons:\n\na.  The worst-case weather conditions which were used for this scenario are uncommon;\nb.  Industry and ASME standards were followed for the manufacture and quality control of the  high pressure ammonia receiver.  U-1A manufacturer's data reports were reviewed and are on file at our facility;\nc.  The high pressure ammo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11794,
      "SummaryText": "nia receiver is located outside and is protected with bollards and pipe railing to prevent potential impact by vehicles or forklifts.  It is kept painted and routinely inspected to prevent external corrosion;\nd.  Ammonia is not corrosive in this service and our high pressure ammonia receiver is maintained in good condition;\ne.  Dual safety relief valves limit operating pressure in the high pressure ammonia receiver;\nf.  The facility has a training program designed to ensure that the system is operated by experienced and qualified personnel.\n\nThe alternative (more likely) release scenario at the facility involves the release of 360 pounds of ammonia over a 60 minute period due to a leak of a 1/4 inch hole in a liquid ammonia hose on the Amerio ice cream hardening system at a pressure of approximately 7 psig.  Under alternative release weather conditions, the ammonia would be dispersed enough in less than 0.1 mile to no longer pose a hazard to the public.\n\nThe likelihood of an alternative release scenario is minimized for the following reasons:\n\na.  Positive effects of the PSM/RMP programs on the overall condition of the refrigeration equipment and operating procedures.\nb.  The equipment, lines and hoses are maintained in good condition.\nc.  The ammonia being pumped to the amerio is -40 deg. F. which would delay the release to the environment and the impact zone.\n\nD.  Description of the Accidental Release Prevention Program\n\nThe program consists of the following elements:\n\na.  Employee Participation:  All maintenance employees participated in developing the Process Hazard Analysis (PHAs), Standard Operating Procedures (SOPs), and other elememts of the program.\nb.  Process Safety Information:  Piping and Instrumentation diagrams (P&IDs) have been developed where all ammonia vessels, lines and valves are numbered on the drawings.  All ammonia valves (except small guage valves) are numbered using a tag with the valve number on the tag.  Information has been collected whi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11794,
      "SummaryText": "ch enables the employees to identify and understand the potential hazards in the system.  The written information includes the ammonia MSDS.\nc:  Process Hazard Analysis:  Formal studies with maintenance personnel participating were conducted using the What-if/Check list Technique to look at the system and indentify potential hazards.  The PHAs are maintained on a Dyadem's computer program for easy and accurate management.\nd.  Operating Procedures:  Written procedures have been developed which describe the steps which should be followed to safely operate the ammonia refrigeration system.\ne.  Training:  A training program has been developed which ensures that employees are trained on all aspects of the system and the duties which they should perform to ensure the safe operation of the ammonia refrigeration system.\nf.  Contractors:  Contractors are screened and evaluated before they perform work on or near the ammonia refrigeration system.\ng.  Pre-Startup Safety Review:  Pre-startup safety reviews are completed for all new ammonia projects involving a change to the system to verify that all safety programs are in place, training has been performed, operating procedures developed, P&IDs developed, PHA completed, and construction has been completed according to the design specifications.\nh.  Mechanical Integrity:  Annual inspections of the ammonia refrigeration system including lines and valves by a team of management and hourly personnel.  Any recommendation are resolved promptly.\ni.  Hot Work Permits:  Procedures to be followed to ensure that a signed permit is obtained prior to any cutting, welding, or burning in any area other than one designated as hot work.\nj.  Management of Change:  The procedures are designed to ensure that all changes made to the ammonia refrigeration system are properly reviewed.\nk.  Incident Investigation:  All incidents or near misses are investigated, reviewed, and documented using an investigation team.\nl.  Compliance Audits:  Audits will b"
    }
  ]
}