{
  "FacilityID": 11970,
  "FacilityName": "Del Monte Foods, Plant 33",
  "FacilityStr1": "2716 E.Miner ave.",
  "FacilityStr2": null,
  "FacilityCity": "Stockton",
  "FacilityState": "CA",
  "FacilityZipCode": "95213",
  "Facility4DigitZipExt": "0190",
  "FacilityCountyFIPS": "06077",
  "LEPC": null,
  "FacilityLatDecDegs": "37.962889",
  "FacilityLongDecDegs": "-121.253972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9138132,
  "ParentCompanyName": "Del Monte Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 609305040,
  "Company2DUNS": 0,
  "OperatorName": "John Furr",
  "OperatorStr1": "P.O. Box 30190",
  "OperatorStr2": null,
  "OperatorCity": "Stockton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95213",
  "OperatorZipCodeExt": "0190",
  "RMPContact": "David Squaglia",
  "RMPTitle": "Manager, Environmental Compliance",
  "FTE": 484,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126151",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-05-01 00:00:00",
  "DeRegistrationEffectiveDate": "2001-02-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.96316,
  "FRS_Long": -121.25309,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15975,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 11970,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16374,
          "ProcessID": 15975,
          "NAICSCode": "311421",
          "_desc": {
            "NAICS_CODE": "311421",
            "NAICS_DESCRIPTION": "Fruit and Vegetable Canning"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19880,
          "ProcessID": 15975,
          "ChemicalID": 49,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519880,
          "ProcessID": 15975,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11970,
      "SummaryText": "Del Monte Foods, Plant #33 currently is in compliance with the California Risk Management Prevention Plan (RMPP) requirements of sulfur dioxide gas, used in the facilities Cherry Plant as an ingredient in the cherry brine solution. The Process formula for the brine solution includes : Lime (calcium hydroxide) : 100 lbs; Caustic soda : 10 gals ; Calcium chloride : 13 inches ;sulfur dioxide : 220 lbs ; Water : 2730 lbs. The maxium  inventory is 6 full 2000lb cylinders. We have minimized the potential for accidental releases by using 1 ton cylinders, due to the fact it minimizes the requirement to handle the cylinders, reducing the potential of human error.\n\nSO2 cylinder installation and removal :\nThe filled cylinder is forklifted onto a platform scale equipped with four cylinder wheels. The wheels are used to rotate the cylinder until the valves are in an upright position. The cylinder is stored on its side and strapped to the scale at both ends. The top cylinder valve releases sulfur dioxide gas and the bottom valve releases liquid sulfur dioxide. Only the bottom valve is used at our facility. A braided stainless steel flexline is connected to the tank . The sulfur dioxide cylinder valve is then opened. The system is tested for leaks and the cylinder is empty and removed  then the cylinder is marked empty. The cylinder is forklifted by a trained forklift operator and placed on the sulfur dioxide empty holding rack. All operations are performed by a Del Monte trained brine maker and a Del Monte trained forklift operater, who is in a backup position for emergency response.\n  \nControls and Maintenance :\nPrior to the arrival of the one ton sulfur dioxide cylinders each season, all equipment is inspected and replaced if necessary. A preseason equipment inspection checklist is completed by trained, experienced mechanic and any repairs, replacements or maintenance activities are documented. The completed preseason checklist is reviewed and signed by the Cherry Supervisor an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11970,
      "SummaryText": "d is kept in a permenent file located in the Cherry shift supervisor's office.\n\nSafety : \nOnly trained personnel are responsible for daily inspections, repair and maintenance of the sulfur\ndioxide equipment. Employees work in pairs for all hookups, disconnects and transporting of cylinders. Annual training is provided which includes safety instructions, handling and storage procedures, changing cylinders, use of test kits and gas masks, use concentration and emergency response. There are two ways to shut off the sulfur dioxide supply : at the cylinder valve and at the safety on/off switch. \n\nSulfur Dioxide Gas Hazard Analsis ( HAZOP) :\nA Hazard and Operability study was conducted by Plant 33, as part of the RMPP to identify  the potenial risk with using sulfur dioxide gas. The HazOp for SO2 gas was completed in three steps. 1. Brainstorm credible scenarios. 2. Perform the risk analysis matrix. 3. Select the most likely and worst credible scenarios. The Worst Case scenario was determined to be a fire caused by near by wood structures or a vehicle fire.  Also, a near  by business, across our SO2 system is garbage recyle center that may be a threat of a fire. The alternative release scenario due to rupture in a vessel, resulting in a vessel leak, if the cylinder moved while connected. The dispersion models were developed after we determined the most likely and worst scenarios for sulfur dioxide for the development of the RMPP.  The RMP OCA guidance was also used to calculate the worst- case scenario release. The distance to endpoint is 1.30 miles before dispersing enough to no longer pose a hazard.\n \nDel Monte Foods,Plant 33 currently, in compliance with the RMPP, OSHA PSM and California  business plan requirements. \n\nOur adminstration controls and mitigation measures includes, training, regular Inspections, physical barriers, strapping down cylinders, proper record keeping, preventive and routine maintenance have reduced the the risks of leaks at Plant #33.  \n\nDuring "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11970,
      "SummaryText": "the last five years, there have been no accidental release to the public. In fact, there has never been a recordable SO2 release from this facility.\n\n\nEmergency Procedures/Response Plan are in compliance with California RMPP and annual plan requirements. The following actions are taken.\n1. Call 9 - 1- 1, if necessary.  Any supervisor on shift;  2. Immediate notification to OES, State Warning Center and/or required agencies.  John Furr or David Squaglia ; 3. Idenitify and evaluate a hazardous materials incident. John Furr or David Squaglia ; 4. Familiar with operations and facility. John Furr or David Squaglia ; 5. Meet emergency responders upon arrival. John Furr, David Squaglia or Pinkerton Security ;\n6. Access to facility (24-hours). John Furr, David Squaglia or Pinkerton Security ; 7. Expend company funds for equipment and clean-up. John Furr or David Squaglia. Annual evacuation procedures were reviewed with all employees.  \nThis year one plan change to improve safety for this is to coordinate a meeting with the local Fire Department/Haz Mat team on site, to review our emergency response  and handling procedures for sulfur dioxide."
    }
  ]
}