{
  "FacilityID": 11971,
  "FacilityName": "LIBERTY DAIRY COMPANY",
  "FacilityStr1": "530 NORTH RIVER ROAD",
  "FacilityStr2": null,
  "FacilityCity": "EVART",
  "FacilityState": "MI",
  "FacilityZipCode": "49631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26133",
  "LEPC": "Osceola County LEPC",
  "FacilityLatDecDegs": "43.906083",
  "FacilityLongDecDegs": "-85.258083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6547319,
  "ParentCompanyName": "DEAN FOODS",
  "Company2Name": null,
  "CompanyDUNS": 5104815,
  "Company2DUNS": 0,
  "OperatorName": "LIBERTY DAIRY",
  "OperatorStr1": "530 NORTH RIVER ROAD",
  "OperatorStr2": null,
  "OperatorCity": "EVART",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49631",
  "OperatorZipCodeExt": null,
  "RMPContact": "GORDON WILLIS",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 250,
  "OtherEPAFacilityID": "MID006547319",
  "EPAFacilityID": "100000134339",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-09-23 00:00:00",
  "DeRegistrationEffectiveDate": "2013-08-19 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.90608,
  "FRS_Long": -85.25808,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15976,
      "AltID": "REFRIGERATION",
      "FacilityID": 11971,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16375,
          "ProcessID": 15976,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19881,
          "ProcessID": 15976,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519881,
          "ProcessID": 15976,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11971,
      "SummaryText": "June 21, 1999\nRMP Reporting Center C/o Computer Based Systems, Inc. Suite 300 4600 North Fairfax Drive Arlington, VA 22203\nTo Whom It May Concern:\nRE:    U.S. EPA's \"Risk Management Program\" Rule\n    Liberty Dairy\n    Anhydrous Ammonia-Refrigeration Process\n    Certification Letter\nEnclosed is a copy of the Risk Management Plan prepared electronically on disk. This has been prepared using EPA's RMP*SUBMIT.\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\nSignature\nTitle\nPrinted Name\nDate\nIf you have any questions, please call at your convenience.\nSincerely,\n\nGordon Willis\nPlant Manager\nLiberty Dairy\n\n\n\n\n\nEnclosure\nCertification Letter\n\n \nEXECUTIVE SUMMARY\nDescription of Facility and Regulated Substance Handled:\nLiberty Dairy processes fluid milk The facility utilizes anhydrous ammonia as a refrigerant to maintain the proper temperature of fluid milk within the facility. Anhydrous ammonia is an effective refrigerant that has been used for many years by most food processing facilities. Ammonia is normally a gas at ambient temperatures but is handled as a gas liquefied under pressure. The refrigeration system consists of a high-pressure receiver, evaporators, compressors, piping, and valves. \nAccidental Release Prevention and Emergency Response Policies: Liberty Dairy is committed to promoting safety for the plant, its employees and the surrounding area. The facility is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68. The purpose of these programs is to ensure that the refrigeration system is operated safely in order to prevent releases of ammonia from the system. In addition, these programs serve to develop procedures to minimize releases in the event that they do occur and to outline appropriate emergency response steps to take i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11971,
      "SummaryText": "n the event of a release.\nWorst Case Release Scenario: EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" (November 1998) and the International Institute of Ammonia Refrigeration's (IIAR) Risk Management Guidelines (1998) were the primary documents used to develop the worst case release scenario. The worst case release is one that is unlikely to occur. The purpose of the worst case release analysis is to support a dialogue with the community on release prevention. It is a conservative analysis and is not to serve as a rational basis for actual emergency response planning.\nThe worst case release scenario (as defined by EPA) is the release of the largest quantity of ammonia from a vessel or process line failure that results in the greatest distance to a toxic endpoint. The worst case release scenario for the refrigeration process is assumed to be a case where the total quantity of ammonia in the high- pressure receiver is released. The release scenario was performed assuming that the receiver was filled to 100% CAPACITY (the greatest amount that would ever be placed in the receiver). The receiver, however, is normally filled to  40%CAPACITY. There WERE NO passive mitigation systems (dikes, berms, drains, sumps or enclosures) considered in the analysis since the receiver is located OUTDOORS\n\nI\n\n In addition, Dean Foods has installed a sophisticated system of ammonia sensors that can remotely close certain isolation valves in the event of a small release and thereby limit an accidental release of ammonia. These sensors are capable of detecting releases of ammonia at low levels, and are connected to a computer that will shut certain valves to the system if ammonia is detected. In this way, potential releases of ammonia are minimized.\nAlternative Case Release Scenario: \nThe alternative release scenario must meet two criteria:\n1)     Must be more likely to occur than the worst case scenario, and\n\nThe toxic endpoint used for this scenario must be where the ambi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 11971,
      "SummaryText": "ent concentration of ammonia is 0.14 mg/L or less. This endpoint is a concentration below which nearly all individuals could be exposed to for one hour without serious health effects. Based on Exhibit 4-4 in EPA's guidance, a release from the receiver would result in a situation where public receptors would be within the distance to the toxic endpoint.\n\n2\n2)     Must reach an endpoint off site, unless no such criteria exist.\n\n\nThe toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. Based on EPA's guidance, the alternative release scenario would result in a situation where public receptors would be within the distance to the toxic endpoint.\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps: As a part of its PSM Program, Liberty Dairy has established numerous programs that serve to prevent accidental releases of ammonia. These programs include:\n\n\n7 \n\nA possible release scenario is one in which a > inch liquid line in the cooler is severed by a lift truck. The only passive mitigation that is in place is the cooler enclosure and floor drains. Active mitigation measures include our sprinkler system and an emergency shutdown system. We have ammonia detectors located in each cooler that are attached to an alarm system.\n\n\n\n\n7 Process safety information\n7 Operating procedures\n7 Training\n7 Mechanical integrity\n7 Management of change\n7 Pre-startup review\n7 Compliance audits\n7 Incident Investigations\n7 Employee Participation\n7 Hot Work Permits \n\nEmergency Response Information: As a part of the PSM Program, the facility maintains an Emergency Response Plan that was prepared in order to improve responsiveness to an emergency incident, and to increase the reliability of actions taken during an incident. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations,notification of local emergency response agencies as well as the public.\n7 Contract"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 11971,
      "SummaryText": "or Safety\n\nIn the event of an emergency involving the ammonia system, it is the policy of the facility to request assistance as necessary by calling 911 which will notify the Osceola County LEPC, POLICE OR SHERIFF DEPARTMENT. In addition, the Osceola County LEPC has included Liberty Dairy in its local emergency response planning.\n\n\n                                                                                                                   \nFive-Year Accident History: Liberty Dairy has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there has been no accidental release during this period.\nSteps to Improve Safety: Several developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. The most important  of these  will be increased training of our employees and the possible formation of a local HAZMAT team.\n\nIn addition, the facility will continue to operate and maintain the system in accordance with IIAR Guidance and will continue to implement its OSHA PSM Program in conjunction with the Risk Management Program.\nDEANS EXECUTIVE SUMMARY\n\n \n"
    }
  ]
}