{
  "FacilityID": 11985,
  "FacilityName": "Northland Cranberries,Inc. Mountain Home Plant",
  "FacilityStr1": "125 Industrial Park Road",
  "FacilityStr2": null,
  "FacilityCity": "Mountain Home",
  "FacilityState": "NC",
  "FacilityZipCode": "28758",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37089",
  "LEPC": "Henderson County LEPC",
  "FacilityLatDecDegs": "35.372944",
  "FacilityLongDecDegs": "-82.489944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Northland Cranberries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 177555356,
  "Company2DUNS": 0,
  "OperatorName": "Northland Cranberries, Inc.",
  "OperatorStr1": "800 First Avenue South",
  "OperatorStr2": null,
  "OperatorCity": "Wisconsin Rapids",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54495",
  "OperatorZipCodeExt": "8020",
  "RMPContact": "Michael A. Koral, P.E.",
  "RMPTitle": "RMP Coordinator",
  "FTE": 144,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126954",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-05 00:00:00",
  "SafetyInspectionBy": "NC Department of Labor",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.375,
  "FRS_Long": -82.48361,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 15990,
      "AltID": null,
      "FacilityID": 11985,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16389,
          "ProcessID": 15990,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 19896,
          "ProcessID": 15990,
          "ChemicalID": 56,
          "Quantity": 15910.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 519896,
          "ProcessID": 15990,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 11985,
      "SummaryText": "Northland Cranberries Mountain Home Plant is a major producer of fruit juice and juice concentrates, primarily under the Northland Cranberries, TreeSweet and Seneca Foods brand names.  Products are derived from either bulk juice concentrate or fresh fruit.  Anhydrous ammonia is used in the plant refrigeration system and, since inventory exceeds 15,000 pounds, PSM Regulations are applicable to this facility.\nThe operations present a risk to both onsite (employees) and offsite receptors (the public).  It is the Company's policy to minimize negative impact upon both groups by maintaining a constant vigil on its operations, with planning and prevention being essential components of its effort.\nThe employee's appreciation of the dangers associated with anhydrous ammonia begins during New Employee Orientation and continues throughout the term of employment.  Employees are major stakeholders in safe operations and are actively involved in developing and implementing the PSM Program.  Periodic, timely training emphasizing concepts needed to ensure personal safety and proper reaction to emergency situations further demonstrates the Company's commitment to safe operations.  In-plant monitoring of key areas provides a safe work environment along with adequate warning of any threat to employees' health and well-being.  Operating procedures stress safety; changes in operation require evaluation of relevant safety issues.\nThe public is well served through the Company's close involvement with local emergency respose organizations.  Plant management works with incident responders to minimize the impact of inadvertant releases.  Select staff provide on-site technical support to emergency response personnel as needed.  Effective public notification procedures have been developed.\n\n                                                                * * * *\n\nRMP Guidelines note that two scenarios - one worst-case release and one alternative release - must be discussed.  Loss of ammonia fro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 11985,
      "SummaryText": "m the plant's largest vessel functionning in a storage mode and failure of a transfer hose during ammonia delivery, respectively, were the incidents chosen to provide realism to this exercise.  No mitigation measures were considered.  Analyses of impact on the community were performed using applicable EPA guidance documents - this effort produced extremely conservative results in terms of area of expected impact. \nEmployee awareness might be the single most important factor in minimizing accidental releases to the atmosphere, and the Company strives to keep awareness levels at the highest by mandating periodic employee training.  Staff are actively involved with programs designed to protect the work environment - the PSM Program, for example, provides a framework for working with hazardous materials.  The Safety Committee has a long history of active involvement on behalf of the employee and the employer.  Equipment designs employ \"Best Engineering Practices\" and conservative safety factors.  Safe work practices are formalized and change is evaluated for its impact on safety.\nThe Company is a willing partner with local emergency response agencies and other government offices, providing the system to protect public health in the event of a release.\nHas the effort been a success?  There has not been a notable accidental release of ammonia during the past five years.  Still, plans to constantly revise and improve performance are in place.  A cursory audit of the PSM Program has recently been completed and suggestions for its improvement made.  Standard Operating Procedures are reviewed annually and Management of Change analyses precede installation of any new equipment.  Opportunities for enhancing staff training will continue to be made available.\n\n                                                                * * * *\n\nNorthland Cranberries Mountain Home Plant is committed to maintaining its status as a welcomed member of this community."
    }
  ]
}