{
  "FacilityID": 12047,
  "FacilityName": "McCain Foods USA, Inc., Grand Island",
  "FacilityStr1": "204 East Roberts Street",
  "FacilityStr2": null,
  "FacilityCity": "Grand Island",
  "FacilityState": "NE",
  "FacilityZipCode": "68803",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31079",
  "LEPC": "Hall County LEPC",
  "FacilityLatDecDegs": "40.950111",
  "FacilityLongDecDegs": "-98.356472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1104736,
  "ParentCompanyName": "McCain Foods Limited",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jerry Bothum",
  "OperatorStr1": "204 East Roberts Street",
  "OperatorStr2": null,
  "OperatorCity": "Grand Island",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68803",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Chaney",
  "RMPTitle": "Loss Prevention Officer",
  "FTE": 425,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127418",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-07-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.94944,
  "FRS_Long": -98.35429,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16091,
      "AltID": null,
      "FacilityID": 12047,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16493,
          "ProcessID": 16091,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20101,
          "ProcessID": 16091,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520101,
          "ProcessID": 16091,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12047,
      "SummaryText": "\n                          McCAIN FOODS USA, INC.\n\n                          RISK MANAGEMENT PROGRAM\n\n                             EXECUTIVE SUMMARY\n\n\n\n\n\n1.  General accidental release and prevention policy of McCain Foods USA, Inc.\n\n\n\nIn this food product manufacturing facility we handle anhydrous ammonia in a liquid and vapor\n\nstate which is considered hazardous by the EPA.  The same properties that make ammonia a\n\nvaluable refrigerant also makes it necessary to observe certain safety precautions during it's use to\n\nprevent human exposure, reduce the threat to our workers personal health, the surrounding\n\ncommunity and the environment.  It is our policy to adhere to all applicable federal and state\n\nregulations.  Safety depends directly on our proper handling of ammonia combined with the safety\n\ndevices that are incorporated in our facility and the safe handling procedures that our personnel\n\nare trained in.\n\n\n\n2.  Stationary source and regulated substance handled.\n\n\n\nMcCain Foods USA, 204 East Roberts Street, Grand Island, Nebraska is responsible for the\n\nmanufacturing of frozen appetizers.  There are approximately 450 employees at this facility which\n\nincludes hourly and salary personnel.  The plant manufactures product around the clock, (7) seven\n\ndays a week.  McCain Foods is located in an industrial park on the north side of Grand Islands,\n\nNebraska.  In addition to our manufacturing facility the industrial park also houses other\n\nmanufacturing or business facilities.  \n\n\n\nThe potentially hazardous chemical used at the McCain Foods facility is ANHYDROUS\n\nAMMONIA. The dominant characteristic of ammonia vapor is it's pungent, distinct odor. \n\nPersons exposed to ammonia will not voluntarily stay in areas of even small concentrations,\n\nalthough these levels would not result in any health risks. \n\nRisks from accidental exposure to ammonia in a vapor state are irritations to the eyes, nose and\n\nthroat. The extent of irritation depends on the exposure amount and len"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12047,
      "SummaryText": "gth of exposure.   \n\nAmmonia is classified non-flammable by the Department of Transportation.  It will burn, but only\n\nin a very narrow, high concentration level with a constant ignition source.\n\n\n\nThe normal operating level of ammonia that is used/stored at the McCain Foods facility is 24,000\n\npounds. The anhydrous ammonia is used as the refrigerant chemical in the manufacturing/storage \n\nprocess. The possible hazards that could lead to an accidental release include, but are not limited\n\nto, equipment failure, damage to piping, damage to equipment, human error, etc. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3. Worst case release scenario and alternate release scenarios including administrative and\n\nengineering controls to limit/prevent the release.\n\n\n\n   Worst case release scenario criteria for McCain Foods USA facility:\n\n\n\nWorst case scenario depicts continuous source leak from the High Pressure Receiver (HPR)\n\nlocated inside the McCain Foods machine room.  This vessels normal operating level is 5,482\n\npounds of liquid ammonia,  approximately 50% of it's total capacity. Although it's maximum\n\ncapacity is 10,964 pounds, this exceeds company policy of only allowing an 80% level at any\n\ntime.  \n\n\n\n     Ammonia Quantity:                  5,480 pounds\n\n     Rate of Release:                   548 lbs / min. (10 min. release)\n\n     LOC (Level of Concern):            200 ppm  (EPA ERPG-2)  \n\n     Physical State:                    Gas and/or Liquid\n\n           Type of Area:                     Urban\n\n     Wind Speed:                        1.5 m/sec\n\n     Distance to Endpoint                    2.5 miles\n\n\n\nAlternate case release scenario criteria for McCain Foods USA facility:\n\n\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief\n\nvalve (SRV) due to an over pressurization condition on a vertical vessel located within the\n\nMcCain Foods facility machine room.  SRV would be performing exactly as it is designed to do.\n\n. \n\n     Ammonia Quantity:        "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12047,
      "SummaryText": "          325 pounds\n\n     Rate of Release:                   36 pounds/min. (17 min. release)\n\n     Distance to Endpoint:                   264 yards \n\n     \n\n     \n\n     The following administrative and engineering controls are in place at the McCain\n\n     Foods facility to limit the distance for the reported scenarios.\n\n     \n\n     *  Electronic ammonia detection in machine room sounds a local alarm and activates an\n\noutside flashing light to alert maintenance personnel of a potential hazard. Detection system also\n\nengages machine room ventilation and shuts off gas heaters.\n\n     *  Safety Relief valves are installed on pressure vessels, condensers and compressor oil\n\nseparators to eliminate over-pressure conditions in those associated pieces of equipment.\n\n     *  High liquid level alarms are configured to all pressure vessels, except the high pressure\n\nreceiver, to indicate high levels and prevent overfilling of vessels.\n\n     *  Periodic Maintenance Program is in place within the maintenance department to ensure\n\nall refrigeration components are kept in optimum operational and mechanical condition.\n\n\n\n\n\n\n\n4.  Five-year accident history.\n\n\n\nMcCain Foods USA has had zero reportable accidental releases in the last five years.\n\n\n\n5.   Emergency Response Program\n\n\n\nThe purpose of the McCain Foods Emergency Response Program is to:\n\n\n\n     1.   Minimize exposure to our employees and the surrounding community in the event of a\n\n     hazardous material release or spill.\n\n\n\n     2.  Assure the safe emergency evacuation of the plant in the instance that it is required.\n\n\n\n     3.  Provide for prompt medical attention to any employees who become seriously injured\n\n     or ill at work.\n\n\n\n     4.  Manage an emergency response system and coordinate response of the internal and\n\n     external resources required to provide efficient and effective response to any type of\n\n     emergency that may occur at McCain Foods.\n\n\n\nMcCain Foods has utilized inputs from the International "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12047,
      "SummaryText": "Institute of Ammonia Refrigeration in\n\ncompiling the Emergency Response Program.  This ERP currently meets requirements as set forth\n\nin OSHA 29 CFR 1910.120 (HAZWOPER) Emergency Response Regulations. Additionally,\n\nMcCain Foods has received inputs from and coordinated with the Hall County Fire Department\n\nand state organizations to ensure compliance in the emergency response areas."
    }
  ]
}