{
  "FacilityID": 12100,
  "FacilityName": "U. S. Naval Station Roosevelt Roads",
  "FacilityStr1": "Commanding Officer, Naval Station",
  "FacilityStr2": "Roosevelt Rds, Box 3021 FPO AA",
  "FacilityCity": "Ceiba",
  "FacilityState": "PR",
  "FacilityZipCode": "00735",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72037",
  "LEPC": "Civil Defense Zone 11, Fajardo",
  "FacilityLatDecDegs": "18.224889",
  "FacilityLongDecDegs": "65.650194",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "S1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": "riveram@mercury.navstarr.navy.mil",
  "FacilityDUNS": null,
  "ParentCompanyName": "U. S. Naval Station Roosevelt Roads",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "U.S. Naval Station Roosevelt Roads",
  "OperatorStr1": "Commanding Officer, Naval Station",
  "OperatorStr2": "PSC 1008, Box 3021 FPO AA",
  "OperatorCity": "Roosevelt Roads",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "34051",
  "OperatorZipCodeExt": "3021",
  "FTE": 5000,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127463",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "19-0397-0012",
  "SafetyInspectionDate": "1988-09-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2012-01-25 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 18.242103,
  "FRS_Long": -65.639031,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Transferred ownership & operation to the local redevelopment authority",
  "_processes": [
    {
      "ProcessID": 16152,
      "AltID": "Potable Water Treatment",
      "FacilityID": 12100,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20167,
          "ProcessID": 16152,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16558,
          "ProcessID": 16152,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8390,
              "Process_NAICS_ID": 16558,
              "SafetyReviewDate": "1998-03-01 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fusible Plugs",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-03-01 00:00:00",
              "TrainingReviewDate": "1997-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1993-10-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-31 00:00:00",
              "EquipmentTested": "Process (Daily); Chlorine container (when moved)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-04-21 00:00:00",
              "AuditCompletionDate": "1999-07-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11550,
                  "PreventionProgram3ID": 8390,
                  "ProcessChemicalID": 20167
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12100,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-01 00:00:00",
    "ERTrainingDate": "1998-03-01 00:00:00",
    "CoordinatingAgencyName": "NAVSTARR Fire Department",
    "CoordinatingAgencyPhone": "7878654333",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12100,
      "SummaryText": "Facility Overview\n\nNAVSTA RR is located on the eastern shore of the island of Puerto Rico near Ceiba, Puerto Rico approximately 50 miles from San Juan.  NAVSTA RR is the major Caribbean fuel supply depot for the United States Navy and its allies.  Naval ships, submarines, and aircraft are regularly fueled at NAVSTA RR either directly at the base or from barges at sea.  In addition, NAVSTA RR is an Atlantic Fleet Weapons Training Facility (AFWTF).  Other activities/commands at NAVSTA RR include the Public Works Department (PWD), a  naval construction battalion (CBs), Army Reserve and Army National Guard units, a hospital, the United States Coast Guard, a naval communications station, a potable water treatment plant, and three wastewater treatment plants.  In addition to the mission-related activities, support activities at NAVSTA RR include elementary and high schools, day care facilities, restaurants, grocery and supply stores, convenience stores, recreational facilities, and housing. \n\nRMProgram Applicability\n\nAn evaluation of facility chemical use and inventory indicated that RMProgram applies to chlorine (toxic substance) use at the base. Chlorine is predominately used as a water treatment disinfectant for the base water supply.  NAVSTA RR operates a Potable Water Treatment Plant (Building 88) located along Langley Road near the water storage reservoir in the geographic center of NAVSTA RR.  The Potable Water Treatment Plant receives raw water from Rio Blanco River in Naguabo via a 27-inch pipe.  The Potable Water Treatment Plant treats the raw water for use at NAVSTA RR in accordance with current drinking water standards.  Evaluation of the Potable Water Treatment Plant and chlorine use indicated that the Potable Water Treatment Plant maintains a chlorine inventory in excess of the threshold quantity for chlorine (2,500 lb) and, thus, is subject to the RMProgram regulations.  At other base locations where chlorine is used, chlorine is typically stored in 150 pou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12100,
      "SummaryText": "nd chlorine gas cylinders.  Chlorine inventories at these locations are significantly below the threshold limit and are not subject to the RMProgram.\n\nHazard Assessment\n\nAs part of the RMProgram, a Hazard Assessment of potential accidental release scenarios for the Potable Water Treatment Plant was conducted.  The goal of the Hazard Assessment is to complete an OCA which includes assessment of theWorst Case Scenario (WCS) as defined by the established parameters in the RMProgram regulation followed by the consideration of a more likely alternative release scenario (ARS).  The Hazard Assessment requires that the WCS and ARS consider the effects of a release down to a toxic endpoint.  Toxic endpoints have been established in the RMProgram regulation for each listed substance. The toxic endpoint for chlorine is 0.0087 milligrams per liter (mg/l). In modeling the WCS, several models were evaluated but the distance to the endpoint was comparable to the distance estimated by the RMP*CompTM developed by EPA.  Therefore, the RMP*CompTM tables were used for the WCS. NAVSTA RR utilized the PHAST Professional program developed by DNV Technica to model the off-site impact for the alternative release scenario.  The PHAST Professional program was chosen because it can simulate a dense gas, can simulate two-phase flow, and can simulate several release scenarios.\n\nWorst Case Scenario (WCS)\n\nBased on the RMProgram regulation, the WCS is the release of the entire contents from the ton (2,000 lb) chlorine container in 10 minutes.  Because chlorine is a vapor at ambient temperature and is stored as a liquid under pressure, the worst-case release amount (2,000 lb) is completely released over a period of 10 minutes, thus, the release rate is 200 pounds per minute (lb/min). The meteorological conditions for the WCS are a wind speed of 3.4 miles per hour (mph) and F stability class.\n\nFor this extremely conservative (and highly unlikely) WCS, the distance to the endpoint is 3.0 miles with"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12100,
      "SummaryText": "an affected area of 28 square miles.  It is estimated that a population of 11,196 is located within the affected area. Public receptors within the impact area include schools, residential areas, a hospital, public recreation areas, a prison, and commercial/industrial areas, while environmental receptors include mangroves, shorelines, and sea grass beds.  Several of these public receptors are actually located on the base.  The WCS does not impact the Caribbean National Forest to the west.\n\nAlternate Release Scenario (ARS)\n\nBased on the process hazard analysis (PHA) conducted under the Accident Prevention Program, an ARS with an offsite impact is the failure of a 3/4 inch fusible plug.  The leak was assumed to be on the liquid side of the chlorine ton container  rather than the vapor side because this scenario resulted in the greatest off-site impact.  The chlorine ton container is stored under a structure which has two enclosed sides and a roof.  However, with the sudden loss of the contents from the chlorine ton container, this building configuration would not offer any passive mitigation.  Therefore, passive mitigation was not considered. The release rate is 1,022 lb/min, with a release duration of two (2) minutes. The ARS meteorological conditions used in the dispersion modeling are wind speed of 11.4 mph and D stability class.  In order to determine the typical wind speed and temperature for the ARS, meteorological data specifically for NAVSTA RR for 1995 through 1997 was obtained from the Fleet Numerical Meteorological and Oceanography Detachment in Asheville, North Carolina. The modal or most prevalent temperature (81 degrees Fahrenheit (oF)) and wind speed (11.4 mph) were used as the typical weather conditions for the ARS.\n\nFor this more realistic ARS, the distance to the endpoint is 1.56 miles with an affected area of 7.7 square miles.  A population of 4,169 would be affected by the release.  Public receptors within the impact area include schools, resid"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12100,
      "SummaryText": "ential areas, public recreation areas, and industrial areas, while environmental receptors include mangroves, shorelines, and sea grass beds.  The Caribbean National Forest to the West is not affected by the ARS.\n\nAccidental Release History\n\nA thorough review of Potable Water Treatment Plant facility records in conjunction with discussions with Potable Water Treatment Plant facility and NAVSTA RR environmental personnel revealed that there have been no known chlorine releases in the past five years from the Potable Water Treatment Plant. \n\nAccident Prevention Program \n\nThe Potable Water Treatment Plant has compiled and maintains safety-related information for the chlorination process, has completed a PHA for the chlorination process, has developed operating procedures, provides employee training on the operating procedures, has developed maintenance procedures for the process equipment, has established routine compliance audits for the facility, and has incorporated an incident investigation protocol.  All information required by the Accident Prevention Program is maintained continuously and is immediately updated if a major change occurs.\n\nSafety Information\n\nThe required safety information for the Potable Water Treatment Plant has been compiled including a material safety data sheet (MSDS) for chlorine and a summary table which documents the maximum inventory of chlorine storage at the Potable Water Treatment Plant, safe temperatures and pressures for chlorine use and storage, process equipment specifications, and process design codes. \n\nProcess Hazard Analysis\n\nThe PHA for the chlorination system was completed to determine possible hazard or upset conditions which could result in a chlorine release.  The PHA identified hazards associated with the process, possible equipment malfunctions, human errors, and safeguards/monitoring. Equipment information (specifications, manuals, etc.), operating procedures, and service information were thoroughly evaluated during the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12100,
      "SummaryText": "hazard analysis. \n\nThe system was thoroughly evaluated from the chlorine ton container through the ejector in a step-by-step process utilizing a What-If analysis. Potential hazard scenarios were considered for each piece of process equipment. A likelihood and severity rating was assigned for each hazard scenario. The hazards identified for the Potable Water Treatment Plant chlorine system ranged from fusible plug failure to tubing failure.  Most of the hazards identified were associated with the ton chlorine containers.  The chlorination system following chlorine supply from the ton container did not lend itself to many hazards due to the current safeguards in the system.   The results of the PHA were used to define the ARS for the Hazard Assessment.\n\nSeveral system safeguards have been implemented with the design of the chlorination system which would prevent a release of chlorine.  If vacuum is lost in the system, gas flow is shut-off.  A mesh filter prevents foreign particles from entering the gas regulator and causing it to stick open.  Alarms have been installed to warn if inadequate or excessive vacuum condition in the regulator. Also, there are two chlorine gas detection and alarm systems.  One monitors the chlorine feed room, and the other monitors the area surrounding the ton container weighing and storage area.  \n\nAccident Prevention Program\n\nThe Potable Water Treatment Plant has developed and implemented accident prevention procedures including operating and maintenance, training, compliance audits, and incident investigation.  Operating and maintenance procedures for the Potable Water Treatment Plant were integrated into a standard operating procedure for handling, monitoring, and controlling the chlorination system by the operating contractor for the Potable Water Treatment Plant.  \n\nEmergency Response \n\nNAVSTA RR currently has an Emergency Response Action Plan; Facility Response Plan dated October 1996, that addresses the area contained within t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12100,
      "SummaryText": "he property limits of the government-owned and leased lands (including the Potable Treatment Water Plant) within its boundaries and any waters flowing through, past, or from those lands.  The Emergency Response Action Plan includes the procedures for informing the public and emergency response agencies about accidental releases, documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposure, and procedures and measures for emergency response for both oil spills and hazardous substance releases."
    }
  ]
}