{
  "FacilityID": 12101,
  "FacilityName": "Hilmar Cheese Company",
  "FacilityStr1": "9001 North Lander Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Hilmar",
  "FacilityState": "CA",
  "FacilityZipCode": "95324",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06047",
  "LEPC": null,
  "FacilityLatDecDegs": "37.419",
  "FacilityLongDecDegs": "-120.851",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 131602112,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hilmar Cheese Company",
  "OperatorStr1": "9001 North Lander Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Hilmar",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95324",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerel Steckling",
  "RMPTitle": "Safety Manager",
  "FTE": 300,
  "OtherEPAFacilityID": "CAD983592619",
  "EPAFacilityID": "100000127515",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-02 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.41879,
  "FRS_Long": -120.84991,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16153,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 12101,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16559,
          "ProcessID": 16153,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20168,
          "ProcessID": 16153,
          "ChemicalID": 56,
          "Quantity": 12700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520168,
          "ProcessID": 16153,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12101,
      "SummaryText": "HILMAR CHEESE COMPANY\nRISK MANAGEMENT PROGRAM (CalARP)\n\nAnhydrous Ammonia Refrigeration System\n\nJune 1999\n\n\nEXECUTIVE SUMMARY\n\n\n\nHilmar Cheese Company Plant (Hilmar Cheese) prepared a chemical risk management program (RMP) in general accordance with California Code of Regulations, Title 19, Section 2735.1, et. Seq.  The regulations are also referred to as the California Accidental Release Prevention (CalARP) program.  The Federal Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The federal regulations are codified in Title 40 of the Code of Federal Regulations (CFR), part 68.  \n\nHilmar Cheese prepared an RMP to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Hilmar Cheese incorporated many state-of-the-art safety features into the ammonia refrigeration system at the facility as part of the original system construction and system modifications.  Hilmar Cheese will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP.  In the unlikely event that a chemical release does occur at the facility, Hilmar Cheese personnel are trained in the appropriate response measures, relying on support services provided by the local fire department and hazardous materials response team.\n\nHilmar Cheese is located at 9001 North Lander Avenue in Hilmar, California.  The surrounding area consists of commercial and rural agriculture land. The site is bordered by Lander Avenue to the east, a Merced County Sheriff's sub-station to the north, August Street to the south and Columbus Avenue to the west.  Hilmar Cheese is approximately four miles south of Highway 99 and 1.2 miles north of the town of Hilmar.\n\nThe facility was originally constructed in 1985.  The ammonia refrigeration system was installed new in 1994. Operations at the facility consist of the processing, s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12101,
      "SummaryText": "torage and packaging of cheese and dairy products.  The majority of the facility is surrounded by chain-link fencing and is staffed by security personnel 24 hours per day, 365 days per year.\n\nAnhydrous ammonia is used in a refrigeration system at the facility.  The ammonia refrigeration system, which is a closed system, contains approximately 12,700 pounds of anhydrous ammonia. The system provides cooling for production areas, product, and water chilling.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, transfer pumps, and compressor controls.  \n\nThe RMP regulations require a review of the five-year accident history at the regulated facility.  The Hilmar Cheese facility reported no accidental releases of ammonia during the past five years. \n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP.  Program 3 requirements of the RMP apply to the Hilmar Cheese facility due to the quantity of ammonia used.  Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as \"the greatest amount held in a single vesselreleased as a gas over 10 minutes.\"  An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\nThe largest ammonia vessel at Hilmar Cheese, the high pressure receiver, has a capacity of 27,888 pounds of ammonia at 80 percent liquid level, the safe fill level for the vessel.  The capacity of the high pressure receiver exceeds the quantity of ammonia in the system.  Therefore, the worst-case release scenario for the facility is a release of the entire contents of the system (12,700 pounds of ammonia) in 10 minutes.  Catastrophic failure of the high-pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12101,
      "SummaryText": "essure receiver would be required for this scenario to occur.  As required by the RMP regulations, pessimistic atmospheric conditions, very conservative chemical dispersion characteristics, and a toxic endpoint of 200 parts per million (ppm) ammonia vapor were assumed.  The predicted distance to the toxic endpoint for the worst case release scenario is 1.13 miles, or approximately 5,969 feet.  The SLAB Model was used for modeling the worst case release scenario.  SLAB was first developed by Lawrence Livermore National Laboratory under contract with the U.S. Department of Energy.  SLAB has been revised and updated by the USAF Engineering and Services Center and the American Petroleum Institute.  SLAB is commonly used to simulate the atmospheric dispersion of denser-than-air releases.\n\nHilmar Cheese used the alternative release scenario described in the Environmental Protection Agency's (EPA) Model Risk Management Program and Plan for Ammonia Refrigeration, November 1998.  The release scenario is described as a <-inch effective diameter orifice leaking liquid ammonia and resulting in an airborne release, representative of a pipe connection leak or a gasket rupture.  The evaluation used a release rate of 88.9 pounds/minute and average weather conditions.  The predicted distance to the toxic endpoint for the alternative release scenario is 0.10 miles, or 539 feet.  The SLAB Model was used also for modeling the alternative release scenario.\n\nThe RMP regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Hilmar Cheese has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The Hilmar Cheese ammonia system is continuously monitored b"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12101,
      "SummaryText": "y automated control systems that shut down components if deviations from normal operating conditions occur.  The major pressure vessels in the system are connected to a diffusion panel.  Ammonia from the vessels can be mixed with water (neutralized) and discharged to Hilmar Cheese Company's storm water pond to prevent over-pressurization of the vessels.  Further, all pressure vessels in the system are equipped with pressure relief valves.\n\nOther safety features at the facility include: \n7 Emergency shutdown systems\n7 Component specific safety shutdowns\n7 Safeties are tested annually\n7 Pressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\n7 All major vessels are connected to a fire diffusion panel\n7 Engine room is equipped with ammonia detection system\n7 Engine room is equipped with emergency shut down switches at two locations\n7 Engine room is equipped with a ventilation system\n7 Many of the ammonia pipes, valves and components are labeled\n7 Pressure relief valves are replaced at least every five years\n7 Spring return valves are used for all oil draining\n7 A fire sprinkler system is installed in the plant\n7 Operators receive ongoing training in operations, maintenance and emergency response\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Hilmar Cheese has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to: formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lock-out/tag-out program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP auditing and inspection program.  Written standard operating procedures (SOPs) are being prepared for the ammonia system at the facility.  The SOPs provide "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12101,
      "SummaryText": "a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nHilmar Cheese is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A preventive maintenance system is utilized to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility includes daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment.  The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nChanges to improve safety at the facility are ongoing.  Many of the mitigation measures suggested by the process hazard analysis team have already been implemented.  Others will be implemented during the next several months.  The status of significant mitigation measures is as follows:\n7 Preventive maintenance program is being reviewed to verify that all ammonia system components are included and maintenance frequencies are appropriate\n7 Management is evaluating engine room exhaust requirements\n7 Ammonia awareness will be added to forklift training program\n7 Management is evaluating safe work practices and emergency response plan\n\nHilmar Cheese will respond to all suggested mitigation measures promptly.  Hilmar Cheese is establishing schedules of proposed actions.  Management responses and support will be consistent with Hilmar Cheese' commitment to safe and environmentally responsible operations."
    }
  ]
}