{
  "FacilityID": 12105,
  "FacilityName": "East Penn Manufacturing Company, Incorporated",
  "FacilityStr1": "Deka Road",
  "FacilityStr2": null,
  "FacilityCity": "Lyon Station",
  "FacilityState": "PA",
  "FacilityZipCode": "19536",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42011",
  "LEPC": "Berks County LEPC",
  "FacilityLatDecDegs": "40.470556",
  "FacilityLongDecDegs": "-75.766667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2330165,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Delight Breidegam",
  "OperatorStr1": "Deka Road",
  "OperatorStr2": null,
  "OperatorCity": "Lyon Station",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19536",
  "OperatorZipCodeExt": null,
  "RMPContact": "Troy Greiss",
  "RMPTitle": "Director - Env., Health & Safety",
  "FTE": 3000,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127258",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.4705,
  "FRS_Long": -75.7666,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16157,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 12105,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16563,
          "ProcessID": 16157,
          "NAICSCode": "331492",
          "_desc": {
            "NAICS_CODE": "331492",
            "NAICS_DESCRIPTION": "Secondary Smelting, Refining, and Alloying of Nonferrous Metal (except Copper and Aluminum)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20172,
          "ProcessID": 16157,
          "ChemicalID": 56,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520172,
          "ProcessID": 16157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12105,
      "SummaryText": "\nEast Penn Manufacturing Company, Inc. is the nations 5th largest producer of lead storage batteries with all storage battery manufacturing facilities located at Lyon Station, Pennsylvania.  East Penn provides jobs for over 3000 employees and is one of the regions largest employers.  In conjunction with lead storage battery manufacture at the Lyon Station, PA site, East Penn owns and operates a secondary lead smelter for the purpose of reclaiming lead and other materials from spent batteries.  East Penn recycles 100% of materials from used, spent lead-acid batteries.  The smelter utilizes an ammonia scrubber to remove Sulfur Dioxide from the process gas streams of both the reverbatory and blast furnaces and maintains onsite a 30,000 gallon anhydrous ammonia storage tank and piped delivery system to the scrubber headers.   The ammonia scrubber and ammonia tank and piping was designed and built according to generally accepted good engineering practices in accordance with the requirements of the ASME code for pressure vessels and 29 CFR 1910.111 - Storage and Handling of Anhydrous Ammonia.\n\nAs stated in our written EHS policy, East Penn is committed to complying with all applicable government regulations and producing batteries in a way that does not jeopardize the health and safety of employees, community and the environment.  This includes taking reasonable precautions and establishing systems to ensure that a release of anhydrous ammonia at hazardous concentrations does not occur.  East Penn is also committed to the maintenance of an onsite,  trained and capable emergency response team and hazardous materials team to minimize the severity and duration of a release, should one occur and to work closely with the Local Emergency Planning Committee and Berks County Response Team to minimize offsite impacts.   \n\nWORST CASE RELEASE SCENARIO\nPer the general requirements of 40 CFR 68.25, East Penn's worst case scenario would be the catastrophic rupture of the 30,000 gallon "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12105,
      "SummaryText": "anhydrous ammonia bulk storage tank.  At maximum capacity (administratively limited to 25,500 gallons) this would result in a release to the environment of 13,000 pounds per minute for 10 minutes - a total of 130,000 pounds.  The maximum distance to an endpoint has been determined to be 6.9 miles.\n\nALTERNATIVE RELEASE SCENARIO\nPer the requirements of 40 CFR 68.28, East Penn's alternative release scenario involves the rupture of part of the piping system that delivers ammonia to the scrubber.  This release would be at a rate that would not activate the built in excess flow devices (225 gallons per minute) and would result in a release of about 1134 pounds per minute for 20 minutes for a total release of 22,680 pounds.  Maximum distance to an endpoint would be 0.6 miles.\n\nPREVENTION PROGRAM\nThe Anhydrous Ammonia Release Prevention Program has been established and implemented according to the provisions of 29 CFR 1910.119 and consisits of the following elements:  1.  Daily visual and monthly documented visual inspection of tank, valves, gauges and piping by Smelter management.  2.  Annual visual inspection of tank and components by anhydrous ammonia supplier.  3.  Triannual compliance audit of process safety management plan and update of process hazard analysis - the most recent of which was conducted on and around 10/15/1998.  4.  Initial training and annual refresher training for all maintenance and plant personnel who operate or perform maintenance on the ammonia scrubber system.  Ammonia awareness training is also conducted for all employees who work in the building and immediate vicinity of the ammonia scrubber and components.  5.  All incidents that resulted in or could have resulted in a release to the environment are reported to the Environmental, Safety& Health Department for investigation.  The investigation team consists of the EHS Department, Smelter Management, and affected employees.  6.  Rules for contractors, maintenance activities and hot work permits."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12105,
      "SummaryText": "\n\n5 YEAR ACCIDENT HISTORY\nThere have been no releases meeting the criteria outlined in 40 CFR 68.42.\n\nEMERGENCY RESPONSE PROGRAM\nEast Penn's Hazardous Materials Team is trained to mitigate the majority of release scenarios of anhydrous ammonia.  Arrangements have also been made with the local (Berks County) Hazardous Materials Response Team to respond to leaks if conditions dictate or the release has the potential to have offsite consequences.  Members of East Penn's Hazardous Materials Team have received training in accordance with 29 CFR 1910.120.  The next anhydrous ammonia release drill is scheduled for 6/26/99.  Representatives from the Berks County LEPC, Berks County Emergency Management Agency, 4 local fire departments and ambulance company have been invited.\n\nPLANNED SAFETY CHANGES\nAll changes determined to be necessary from the last compliance audit will be completed by 7/31/1999) have been completed.  Future changes include erecting barriers in front of the storage tank to eliminate the risk of collision from plant vehicle and forklift traffic."
    }
  ]
}