{
  "FacilityID": 12141,
  "FacilityName": "Dye Specialties, Inc.",
  "FacilityStr1": "407 Ege Ave",
  "FacilityStr2": null,
  "FacilityCity": "Jersey City",
  "FacilityState": "NJ",
  "FacilityZipCode": "07304",
  "Facility4DigitZipExt": "1014",
  "FacilityCountyFIPS": "34017",
  "LEPC": "Jersey City OEM",
  "FacilityLatDecDegs": "40.719444",
  "FacilityLongDecDegs": "-74.0925",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": "dyespec@ix.netcom.com",
  "FacilityDUNS": 1488709,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dye Specialties, Inc.",
  "OperatorStr1": "PO BOX 4130",
  "OperatorStr2": null,
  "OperatorCity": "Jersey City",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07304",
  "OperatorZipCodeExt": "0130",
  "FTE": 34,
  "OtherEPAFacilityID": "07304DYSPC37BEN",
  "EPAFacilityID": "100000129327",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "USEPS RMP ver 1, Dye Specialties 6/2/1999",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2003-02-11 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.719479,
  "FRS_Long": -74.092123,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16214,
      "AltID": "Phosgene process",
      "FacilityID": 12141,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20239,
          "ProcessID": 16214,
          "ChemicalID": 10,
          "Quantity": 120.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16622,
          "ProcessID": 16214,
          "NAICSCode": "325132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8434,
              "Process_NAICS_ID": 16622,
              "SafetyReviewDate": "1999-05-03 00:00:00",
              "PHA_Date": "1998-03-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-01-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "System is under vacuum. if a leak occurs, it leaks in not out.",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Portable monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Updated diagrams/ drawings to reflect field verifications.",
              "OpProceduresReviewDate": "1999-05-03 00:00:00",
              "TrainingReviewDate": "1999-05-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Train the trainer workshop.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-03 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Evacuation Alarm",
              "ChangeMgmtDate": "1999-05-11 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-03 00:00:00",
              "PreStartupReviewDate": "1994-03-01 00:00:00",
              "ComplianceAuditDate": "1999-05-03 00:00:00",
              "AuditCompletionDate": "1999-08-02 00:00:00",
              "IncidentInvestigationDate": "1999-06-04 00:00:00",
              "InvestigationChangeDate": "1999-06-11 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-03 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-03 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-08 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11602,
                  "PreventionProgram3ID": 8434,
                  "ProcessChemicalID": 20239
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 16215,
      "AltID": "Prosgene storage",
      "FacilityID": 12141,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20240,
          "ProcessID": 16215,
          "ChemicalID": 10,
          "Quantity": 9900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16623,
          "ProcessID": 16215,
          "NAICSCode": "325132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 16216,
      "AltID": "Oxy storage",
      "FacilityID": 12141,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20241,
          "ProcessID": 16216,
          "ChemicalID": 70,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16624,
          "ProcessID": 16216,
          "NAICSCode": "325132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12141,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-03 00:00:00",
    "ERTrainingDate": "1999-03-11 00:00:00",
    "CoordinatingAgencyName": "Jersey City Fire Dept/ OEM Manager",
    "CoordinatingAgencyPhone": "2015474887",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NJ DEP-TCPA N.J.A.C. 7:31 Consolidated Rule"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 12141,
      "SummaryText": "ce Supervisor, has four major components designed to improve employee and process efficiency and safety, thereby reducing the risk of a release.  These components include good housekeeping, periodic maintenance and record keeping, standard operating procedures and operator training.  \n\nThe Standard Operating procedures describe the proper methods for handling, use, storage, and other operations involving process throughout the facility.  The document includes a process description, procedures during normal operation, abnormal operation and emergency conditions.  It also describes safety procedures such as lockout/ tagout, confined space entry and hot work.  The Production Supervisor and the Maintenance Supervisor are responsible for this implementation. \n\nA Hazard Analysis and Risk Assessment are preformed every five (5) years by a joint effort of Dye Specialties employees and a third-party environmental engineering firm.  The results are tracked and implemented by the Regulatory Affairs Manager.\n\nA NJ DEP approved written Pre-Startup Review program is in place. The President of Dye Specialties quality assures this program and the Regulatory Affairs Manager documents the progress. \n\nThe worst-case release of phosgene is calculated at 3.8 miles by RMP*Comp.\n\nThe alternative case release of phosgene is calculated at 0.3 miles by RMP*Comp.\n\nThe worst-case release of phosphorus oxychloride is calculated at 1.9 miles by RMP*Comp.\n\nThe alternative case release of phosphorus oxychloride is calculated at 0.1 miles by RMP*Comp.\n\nPhosgene and phosphorus oxychloride release prevention devices used are relief valves, scrubbers, manual shutoff, alarms and procedures, emergency power and grounding equipment.  Mitigation systems include caustic pre-scrubber, ammonia deluge system, water curtains, firewalls, steal doors, tertiary storage containment and sprinkler systems.  The process area is monitored by a stationary leak detection system and operators wear portable leak detection"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 12141,
      "SummaryText": "Dye Specialties, Inc. is a privately owned manufacturer of dyes for use in the printed ink industry.  Manufacturing and office activities are conducted at our sole location in Jersey City, NJ. We consist of eight (8) buildings located at the crosses of Bennett St, Clarke Ave, Ege Ave and Rt. 440 North.\n\nOur manufacturing process requires the inventory of phosgene and phosphorus oxychloride as raw materials in the production of printing dyes. Both of these chemicals are classified as extraordinarily hazardous substances (EHS) under the Toxic Catastrophe Prevention Act (TCPA) of the NJ DEP. They are also considered highly hazardous chemicals per the Process Safety Management (PSM) sections of the Occupational Safety and Health Act (OSHA) and section 112(r) of the U.S. Environmental Protection Agency's (EPA) Clear Air Act. Our facility has implemented a process safety plan as part of our accidental release prevention program. This plan was designed and updated in accordance to NJ DEP, EPA and OSHA.\n\nThis prevention program, more commonly called a Risk Management Plan, was designed in a joint effort with Dye Specialties employees and a third-party environmental engineering firm.  This firm was picked from a list approved by the New Jersey Department of Environmental Protection (NJ DEP).  \n\nThe purpose of this program is to ensure the safety and well being of Dye Specialties' employees and neighbors in the event of a plant emergency.  By means of this plan, Dye Specialties establishes procedures and assigns responsibilities to various plant personnel to enable quick and effective response to any emergency, thereby minimizing both on-site and off-site impacts. This risk management program is reflected in several documentation plans.\n\nThe purpose of the Accident Investigation procedures is to ensure the safety and well being of Dye Specialties employees and neighbors. The plan delineates procedures to determine how accidents can be prevented in the future and to minimize a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12141,
      "SummaryText": "ccidents and losses.  The Regulatory Affairs manager is responsible for implementing this element of the RMP. \n\nAnnual Audit procedures are in-place to ensure that all elements of the risk management program are being planned, scheduled, updated and executed in compliance with the regulations mentioned earlier.  This procedure assigns employee participation and responsibility to review the risk management program and ensure that all elements of the written program are consistent with actual operations. The Regulatory Affairs manager is responsible for implementing this element of the RMP.\n\nIn recognition of the dangers that could result from tasks preformed by uninformed, untrained contractors and contractor employees, a Contractor Safety program is in place.  These procedures apply to any contractor employee that performs maintenance, repair, or renovation work at our facility.  All contractors are evaluated by a pre-qualification process, which includes reviewing written records of training, health and safety logs.\n\nThe purpose of the Management of Change procedures is to reduce the risk of a release due to changes made in equipment, processes, or risk management program administration personnel. The program applies to any change in existing equipment and procedures.  The Maintenance Supervisor is responsible for implementation of this plan with overall control directly from the President of Dye Specialties.\n\nThe Operator Training programs outlines job descriptions of employees, training requirements and contractor requirements to ensure that each employee and contractor is properly trained to perform his/her duties in a safe, responsible manner. The Regulatory Affairs manager and the Maintenance Supervisor are responsible for implementing this element of the RMP.\n\nThe purpose of Preventive Maintenance procedures is to reduce the risk of an EHS release as a result of equipment failure and/ or poor equipment maintenance.  This program, administered by the Maintenan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12141,
      "SummaryText": "monitors and wireless portable radios. Leak detection monitoring is conducted remotely in the boil-room area, far from the process area.  The boiler operator has access to the leak detection monitor display, a company phone with dial-out privileges, a stand-alone telephone (in case of power-failure on the company phone system), a wireless radio to communicate with the process area and key employees, access to evacuation alarm panic button, and access to a panic switch for the scrubber system.  All stationary monitoring equipment including the phone system are connected to a battery back-up system.  The scrubber system and the emergency lighting are connected to a 50 kV back-up generator with automatic crossover circuit.   A meteorological weather station is in service and windsocks are displayed at two points on the property. This system is a valuable tool to emergency response personnel.\n\nOur Emergency Response program was designed and updated in accordance to EPA, DEP and OSHA guidelines. The plan defines the scope of the incident, responding agencies, equipment needed and notification procedures. The Incident Command System, a facet of the program coordinates our emergency response team with the Jersey City Office of Emergency Management and its supporting agencies. This team effort has provided training, equipment, procedures and drills. \n\nDye Specialties has had no accidental releases of phosgene or phosphorus oxychloride to date.\n\nDye Specialties plans no safety improvements at this time because all current state of the art practices for design and operation is implemented."
    }
  ]
}