{
  "FacilityID": 12169,
  "FacilityName": "Audubon Metals, LLC",
  "FacilityStr1": "3055 Ohio Drive",
  "FacilityStr2": null,
  "FacilityCity": "Henderson",
  "FacilityState": "KY",
  "FacilityZipCode": "42420",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21101",
  "LEPC": "Henderson County LEPC",
  "FacilityLatDecDegs": "37.809722",
  "FacilityLongDecDegs": "-87.634722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 956665970,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Audubon Metals, LLC",
  "OperatorStr1": "3055 Ohio Drive",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42420",
  "OperatorZipCodeExt": null,
  "FTE": 105,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128569",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.808762,
  "FRS_Long": -87.632861,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16250,
      "AltID": "Demag Process",
      "FacilityID": 12169,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20280,
          "ProcessID": 16250,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16660,
          "ProcessID": 16250,
          "NAICSCode": "331314",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8463,
              "Process_NAICS_ID": 16660,
              "SafetyReviewDate": "1999-06-17 00:00:00",
              "PHA_Date": "2000-06-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "cylinder handling",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-17 00:00:00",
              "TrainingReviewDate": "1998-10-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-16 00:00:00",
              "EquipmentInspectionDate": "1999-06-17 00:00:00",
              "EquipmentTested": "Chlorine room and process piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-16 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-17 00:00:00",
              "AuditCompletionDate": "2000-06-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-16 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11636,
                  "PreventionProgram3ID": 8463,
                  "ProcessChemicalID": 20280
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12169,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-16 00:00:00",
    "ERTrainingDate": "1998-10-17 00:00:00",
    "CoordinatingAgencyName": "Henderson Fire Department",
    "CoordinatingAgencyPhone": "2708311277",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act Federally Enforceable Conditional Major Source, KY Operating Permit F-94-016"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12169,
      "SummaryText": "The Audubon Metals, LLC (Audubon) facility is located at 3055 Ohio Drive in the South Side Industrial Park in Henderson, Kentucky.  The recently built facility is designed to recycle aluminum from shredded non-ferrous scrap metal using a wet heavy media separation process.  This is followed by secondary smelting of the reclaimed aluminum to produce approximately 48,000 tons per year of aluminum metal.\n\nThe Environmental, Safety, and Health Policy of Audubon is to purchase, manufacture, process, sell and dispose of all materials in such a manner as to protect the health and safety of its employees, customers, the public and the environment.  Audubon will implement active programs for prevention of accidents and improvements in health and the environment.  In furtherance of this policy, Audubon will assure that: products and facilities are in compliance with applicable federal, state and local laws and regulations; adopt safety and environmental standards where necessary to minimize employee, customer and community exposure to risk where prevailing laws and regulations may be inadequate; provide employees, customers and neighbors information concerning raw materials and products through use of Material Safety Data Sheets and similar documentation; support community awareness programs designed to answer legitimate community concerns about potential hazards that may be present; and produce the best value, best quality products and service, but never at the expense of the safety and health of its employees, neighbors or the environment. \n\nThe Audubon recycling facility receives shredded non-ferrous scrap metal by rail and truck.  After quality control checks, the shipments are unloaded in a roofed shed with concrete floor and prepared for separation of aluminum metal.  The received aluminum scrap contains other metallic scrap such as zinc, copper, stainless steel and magnesium alloys as well as traces of glass, plastic, rubber and dirt from shredding of automobiles and o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12169,
      "SummaryText": "ther scrap by offsite metal recycling facilities.  The aluminum is separated from the non-ferrous mix by use of a wet heavy media floatation process located within the plant building.  The aluminum is segregated from the other materials in stages, utilizing inherent specific gravity differences in a wet media environment.  The separated aluminum scrap is washed and dried in preparation for smelting while the other residual  metals are sold to other offsite metal recyclers.  Wastes consisting of glass, plastic, dirt and rubber are accumulated in rolloff boxes and shipped for disposal in a permitted solid waste landfill.\n\nThe aluminum scrap is smelted in two 120,000 pound natural gas-fired reverbatory hearth furnaces which combine the melting with converting, using a new proprietary refining process for removal of traces of magnesium and other impurities in the melt.  A modern metallurgy laboratory, utilizing a  X-ray diffraction spectrometer, analyzes the in-process materials and guides the refining process to meet customer specifications.   Various alloying materials such as ferrosilicon, copper, etc. are added and chlorine gas injected into the molten metal through a proprietary German technology using a submerged graphite recirculation pump that not only recirculates the molten metal within the multichambered furnace for heat transfer purposes but also causes intimate mixing of the gas with the metal without bubbling (as in conventional technology).  As a result of this intimate mixing, nearly stoichiometric utilization of chlorine occurs, with virtually no residual chlorine emissions. The impurities float to the molten metal surface as dross consisting of metallic chloride salts.  The dross is periodically removed by skimming the surface.  After cooling, it is shipped for offsite processing and disposal.  The molten, refined aluminum metal is cast into ingots or placed in ladles for direct shipment to an adjacent aluminum die casting customer. \n\nThe modern design"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12169,
      "SummaryText": "of the new facility results in excellent control of air and water pollution.  There is no discharge of waste water from the facility except for sanitary sewage wastewater from employee comfort facilities.  An innovative, high efficiency air pollution control system is also provided. The wet processing of scrap inherently eliminates dust emission potential from raw material handling and processing.  Further, all furnace gases are ducted to a dry scrubber system using slaked lime (calcium hydroxide)  injection for efficiently removing chlorine and other gaseous pollutants.  This is followed by a high effieciency fabric filter baghouse for collecting remaining particulate dust.  The aluminum dryer unit may utilize the waste heat from the smelting furnace offgases and therefore, it is equipped with an afterburner for control of smoke followed by a second dry scrubber/baghouse pollution contro system for cleaning the exhaust gases.\n\nThe chlorine used for the refining (demag) process is stored in one ton cylinders in a dedicated Chlorine Room at the northwest side of the plant building.  The liquid is vaporized and piped overhead  to the demag well of each furnace, with various monitoring and safety devices incorporated  to ensure automatic and manual shutoff of gas as well as appropriate alarms in the control room.  The control room is manned by the Furnace Production Supervisor and trained operators.  Approximately twelve cylinders, containing 2,000 pounds of chlorine each, may be stored in the Chlorine Room at any time, with two cylinders attached to the pig tail piping manifold provided.  One cylinder is open online and the second closed for switching to when the first is empty.  Empty cylinders are also stored in the Chlorine Room as is a cylinder repair kit.  Respirators and emergency supplies are maintained just outside the tight fitting door for use by trained personnel. A purge system, using inert nitrogen gas from a bulk liquid nitrogen storage tank located imm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12169,
      "SummaryText": "ediately outside the Chlorine Room, is provided for purging the chlorine lines prior to switching cylinders and for emptying all chlorine gas from lines so as to allow safe maintenance or system shutdown.\n\nBased on the quantity of chlorine in storage, Audubon is required to comply with the Clean Air Act's Section 112(r) chemical accident prevention and response requirements.  The applicable regulations are  promulgated in Title 40 Code of Federal Regulations (CFR) 68 requiring  preparation and implementation of a  Risk Management Plan (RMP).  The regulations have also been adopted by the Commonwealth of Kentucky by reference under Title 401 Chapter 68 of the Kentucky Administrative Regulations (KAR).  \n\nUnder the RMP requirements, Audubon has conducted a hazard assessment for a worst case release scenario and an alternate release scenario.  As required by the regulations, the worst case scenario is the release of the entire 1 ton contents of a chlorine cylinder within 10 minutes into the enclosed chlorine room.  Based on ambient air quality dispersion modeling analysis, using worst case meteorological conditions and the United States Environmental Protection Agency's (U.S. EPA's) SLAB dispersion model approved for heavier than air gases, a toxic endpoint distance of 2.1 miles was calculated.  The toxic endpoint is defined as the concentration below which no irreversible injury or worse consequence may be expected upon exposure of the general population in case of an uncontrolled release.  An alternate and more likely scenario was also analyzed.  This was the leakage of upto 50 pounds of chlorine from a partilally empty cylinder due to valve damage in handling.  A pool of liquid would result in the Chlorine Room and rapidly evaporate.  The gas would be sensed by the continuous chlorine detector within the room and alarm raised, leading to a response by trained facility personnel.  The full amount spilled would evaporate at a rate estimated by use of the U.S. EPA's Au"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12169,
      "SummaryText": "tomated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model and be dispersed by the fan provided in the chlorine room ground level vent.  An endpoint distance of 0.13 miles was estimated for this scenario  to the toxic endpoint using the SLAB air dispersion model under worst case meteorological conditions.  Under more frequent and more common everyday meteorological conditions, both the worst case and alternate scenario release endpoint distances would be expected to be smaller than the above worst case predictions.\n\nThe entire predicted impact area of 0.13 miles radius of the release under the alternate release scenario lies within the facility boundary that encompasses approximately 48 acres.  Based on meteorological observations by the National Weather Service at the Evansville-Dress Regional Airport, the predominant prevailing wind direction for the area is south to southwest.  The land beyond the plant boundary from the northwest to the downwind north and northeast direction is rural farmland in agriculture along either bank of the Ohio River. A number of special facilities, such as industrial plants and associated commercial facilities, lie within the worst case 2.1 mile radius to the east, south and west.  Included are the Henderson Correctional Facility to the northeast and the South Side and Henderson Riverport Industrial Park to the west.  Beyond lies the Henderson Community College 1.5 miles southwest. The nearest residences are present approximately 0.25 miles to the south of U.S. Highway 60, upwind of the predominant prevailing wind direction from the facility.  Other subdivisions with residences are located approximately a mile or more away to the east, southeast and southwest.\n\nAs part of the prevention program necessitated by the storage of chlorine and the above hazard assessment results, Audubon has undertaken steps to minimize the potential for a release.  The chlorine piping in the facility is color coded yellow and labelled.  Only qu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12169,
      "SummaryText": "alified contractors are allowed to make changes to the system if and when required, after review with the design engineers of the material specifications, needed precautions, leak checks and system integrity inspection procedures prior to startup.  Hot work on the chlorine system is prohibited and only trained Maintenance personnel allowed to change cylinders and  inspect and maintain the system according to procedures taught by the training program put on by PB&S Chemicals, the gas supplier.  The training includes video, classroom instruction, demonstrations and on the job training, including a site visit to the supplier's facility to teach proper maintenance and cylinder care procedures.  A nitrogen purge system is provided for safely clearing the lines with the inert gas.  A continuous chlorine detector with alarm and installation of all system components in accordance with Chlorine Institute guidelines and material specifications ensures that all steps are being taken to maintain the mechanical integrity of the system and minimize the potential for an accidental release.\n\nThe chlorine cylinder supplier is PB&S Chemicals, Inc., located less than one mile to the west in the adjacent Henderson County Riverport Industrial Park.  PB&S Chemicals not only provides delivery and empty cylinder pickup utilizing their specially equipped truck but also offers a 24-hour chlorine release response team. This trained emergency response team can be at the Audubon facility in minutes in case of an accidental release due to close proximity to the PB&S Chemicals facility.  The Audubon facility has made arrangements with PB&S Chemicals for emergency assistance by the trained response team in case of need.  In addition, Audubon has prepared and implemented a plant emergency plan to ensure suitable reponse to a chlorine release emergency and will be coordinating response plans with local emergency responders in accordance with Kentucky Emergency Planning Commission and Local Emergency"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12169,
      "SummaryText": "Planning Committee requirements.\n\nThe facility has never experienced a reportable release of chlorine during its history and has had no need to use the emergency procedures or the response team.  Actions taken under the RMP prevention program are likely to further minimize the potential for a contingency requiring a response."
    }
  ]
}