{
  "FacilityID": 12177,
  "FacilityName": "Tin Products, Inc.",
  "FacilityStr1": "1000 Bonhomme Richard Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lexington",
  "FacilityState": "SC",
  "FacilityZipCode": "29072",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45063",
  "LEPC": "Lexington County LEPC",
  "FacilityLatDecDegs": "33.95",
  "FacilityLongDecDegs": "-81.277778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 869071209,
  "ParentCompanyName": "N/A",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "James H. Goldman, Jr.",
  "OperatorStr1": "PO BOX 1435",
  "OperatorStr2": null,
  "OperatorCity": "Lexington",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29071",
  "OperatorZipCodeExt": null,
  "RMPContact": "Melanie T. Purvis",
  "RMPTitle": "Plant Engineer",
  "FTE": 16,
  "OtherEPAFacilityID": "29072TNPRD1000B",
  "EPAFacilityID": "100000128916",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-06-06 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-05 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.94444,
  "FRS_Long": -81.27861,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 16260,
      "AltID": "STANNIC CHLORIDE PROCESS",
      "FacilityID": 12177,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16670,
          "ProcessID": 16260,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20291,
          "ProcessID": 16260,
          "ChemicalID": 62,
          "Quantity": 4200000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520291,
          "ProcessID": 16260,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12177,
      "SummaryText": "The Accidental release Prevention and Emergency Response Policies\n\nAt Tin Products, we continually strive to improve our performance in the areas of health, safety, and the environment.  This means providing our employees with intensive safety and emergency response training, and working closely with local emergency responders such as police and firefighters to plan and prepare for possible accidents.  It also means constantly testing, refining and updating our safety systems, equipment and procedures.\n\nSome of the major components of Tin Products' Risk Management Plan for Chlorine are:\n     Minimize chlorine inventories on site whenever possible.\n     Conduct complete operating hazard reviews every three years on all systems handling chlorine.\n     Provide extensive training to certified operators who run the chlorine unloading operation.\n     Maintain computer operating systems and remote-controlled cameras to help plant employees monitor     chlorine unloading at all times.\n     Maintain automatic shut-off valves that can shut down the entire chlorine unloading system immediely from several locations.\n     Periodically test the 9 highly sensitive chlorine and 4 hydrochloric acid monitors positioned throughout the plant to provide advance warning of even extremely low levels of chlorine.\n     Use only chlorine rail cars that are equipped with excess flow valves that automatically shut down the flow of chlorine in the event of a major release.\n     Install and maintain relief valves that protect all areas of the chlorine system from overpressurization by venting chlorine gas to a scrubber.\n     Conduct regular training and drills for both in-plant emergency response crews and local emergency responders so they can quickly and effectively respond to accidents.\n     Isolate chlorine unloading station from other operations, thereby reducing exposure to fire or accidents.\n\n\nFacility and the Regulated Substances Handled\n\nTin Products, Inc., is a chemical manufacturer fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12177,
      "SummaryText": "unded in 1994.  The plant began manufacturing Tin Tetrachloride in April 1995 and was in full operation using chlorine rail cars in June 1995.  Since then, Tin Products has expanded its operations to include a distillation process, and a new Tetrabutyltin Plant.  We are currently under construction of a Tetraoctyltin Plant. \n\nEach of these plants utilize state of the art controls having multiple levels of safety interlocks to detect and control potential leaks or releases, in addition to maintaining proper process conditions, such as pressure and temperature.\n\nTin Tetrachloride is a liquid salt.  It is almost 2 1/2 times the weight of water and is a clear anhydrous liquid.  Anhydrous means that there is no water present.  Tin Tetrachloride is made with two raw materials, chlorine and tin metal.  Tin Tetrachloride is used as a hot end coating in the glass coatings industry and is the starting raw material for several organotin products.\n\nTetrabutyltin is an industrial chemical useful in the production of a variety of products including light and heat stabilizers for plastics, coating for glass containers, coating for \"low emissivity\" architectural glass, cracking catalysts for oil refineries, and curing agents and catalysts for silicone polymers and adhesives (caulk).\n\nTetraoctyltin is an industrial chemical similar to Tetrabutyltin in its structure except that its primary end-use is as a precursor for FDA Food grade heat and light stabilizers for plastics.  Both Tetrabutyltin and Tetraoctyltin use Tin Tetrachloride as a raw material.\n\n\nWorst Case and Alternate Case Scenario\n\nTin Products used the EPA OCA Guidance Reference Tables and Equations to model what the impact would be should the contents of a full rail car be lost within 10 minutes.  Even though this is highly unprobable due to the fact that rail cars are built to with stand derailment and collisions, this is the worst possible scenario.  A full rail car contains 180,000 pounds of chlorine and under the Atm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12177,
      "SummaryText": "ospheric Stability Class \"F\" and wind speed of 1.5 meters/second, the area of impact would be 4.25 radial miles to reach 20 ppm and 9.3 radial miles to reach 5 ppm.  The 20 ppm concentration is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing life-threatening health effects.  The 5 ppm concentration is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nUsing the EPA OCA Guidance Reference Tables and Equations, Tin Products also modeled a more probable release scenario.  In this scenario, the transfer hose and the line feeding the reactors would rupture and release the chlorine it contained (198 pounds).  Under the same conditions as listed above the area of impact would be 0.12 radial miles to reach 20 ppm and 0.87 radial miles to reach 5 ppm.  Even though this is a more likely scenario, Tin Products does every thing from replacing the transfer hose every 6 months to a complete line replacement after 3 years of service to insure that this scenario does not occur.\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\nTin Products, Inc., uses a variety of safety equipment and procedures to prevent accidental releases.  The following are some of the typical safety equipment and systems used at our facility:\n     The Chlorine Institute produces standards for safety regarding the production and handling of chlorine.  Tin Products follows these standards.\n     OSHA PSM is followed\n     Automatic shut-off devices and relief valve handle unexpected rises in temperature and /or pressure.\n     Safety controls, including warning alarms, interlocks and leak detectors, provide multiple lines of defens"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12177,
      "SummaryText": "e.\n     Continuous monitoring of pressure in vessels and piping prevents problems.\n     Regular equipment inspections ensure proper operation.\n     Staff and contractors receive extensive health and safety training, following OSHA guidelines.\n     Staff are trained in start-up, operation and maintenance of all equipment.\n     Full investigations of any incident - even small drips or leaks - prevents them from occuring again.\n     Appropriate permits have been obtained and are maintained.\n     Audits (inspections) are performed to ensure correct procedures are followed.\n\n\n\nFive-Year Accident History:\n\nSince Tin Products started production in April of 1995, there have been no accidental releases of chlorine.\n\n\nEmergency Response Program:\n\nTo be prepared for potential chemical incidents, Tin Products, Inc. communicates regularly and works closely with the Local Emergency Planning Committee (LEPC) and other community responders.  Detailed emergency response plans are in place at Tin Product, Inc., and the LEPC, local police, fire departments, and other emergency responders know their role in these plans.\n\nTin Products sponsers annual hands on training for the chlorine c-kit with the local fire departments and county hazmat teams.  This helps to ensure everyone is ready in case of an emergency.\n\n\nPlanned Changes to Improve Safety:\n\nDuring each safety meeting Tin Products conducts a review of Process Safety Management.  Any issues or corrections that need to be made are discussed and scheduled as needed.  At this time there are no outstanding issues or concerns."
    }
  ]
}