{
  "FacilityID": 12201,
  "FacilityName": "City of Fulton Water Pollution Control Plant",
  "FacilityStr1": "1690 State Route 48",
  "FacilityStr2": null,
  "FacilityCity": "Fulton",
  "FacilityState": "NY",
  "FacilityZipCode": "13609",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36075",
  "LEPC": "Oswego County LEPC",
  "FacilityLatDecDegs": "43.335278",
  "FacilityLongDecDegs": "-76.422222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 107398604,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Don Patrick,  Chief Operator",
  "OperatorStr1": "1690 State Route 48",
  "OperatorStr2": null,
  "OperatorCity": "Fulton",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13609",
  "OperatorZipCodeExt": null,
  "RMPContact": "Don Patrick",
  "RMPTitle": "Chief Operator",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129951",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-08 00:00:00",
  "SafetyInspectionBy": "NYS Dept. of Labor PESH",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": "1999-07-14 00:00:00",
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.33528,
  "FRS_Long": -76.42222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16304,
      "AltID": "Chlorination Process",
      "FacilityID": 12201,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16715,
          "ProcessID": 16304,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20340,
          "ProcessID": 16304,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520340,
          "ProcessID": 16304,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12201,
      "SummaryText": "3.0 Executive Summary\n\n\n3.1 General\n\nIn accordance with 40 CFR Part 68.155, this executive summary includes a brief description of the following program elements:\n\n   The accidental release prevention and emergency response policies at the WPCP facility;\n\n   The WPCP facility and regulated substances handled;\n\n   The worst-case release scenario(s) and the alternative release scenario(s);\n\n   The general accidental release prevention program and chemical specific steps;\n\n   The five year accident history;\n\n   The emergency response program; and\n\n   Planned changes to improve safety.\n\n3.2 Accidental Release Prevention & Emergency Response\n\nThe WPCP facility maintains this RMP in accordance with Section 112(r) of the CAA.  Further details regarding the WPCP accidental release prevention and emergency response policies are included in Section 7 and Appendices A and B of this RMP.\n\n3.3 WPCP and Regulated Substance\n\nAs discussed in Section 1 of this RMP, the WPCP facility stores up to 4,000 pounds of gaseous chlorine in one ton cylinders within the chlorine building.  This storage quantity exceeds the threshold quantity for chlorine of 2,500 pounds as specified in the 112(r) rule.  The chlorine gas is used at the facility in the secondary treatment of the wastewater prior to the discharge of the effluent to the Oswego River.   Figure 1 shows the location of the chlorine building.\n\n3.4 Worst Case Release Scenario\n\nIn accordance with United States Environmental Protection Agency (USEPA)'s Offsite Consequence Analysis Guidance, the worst case scenario consists of the instantaneous release of a chlorine cylinder's maximum contents (up to 2,000 pounds).  In determining this worst case scenario, the rate of the release was not considered.  Per USEPA's guidance, the release of gaseous chlorine is a passive mitigated release.  The distance to the toxic endpoint was determined to be 3.5 miles in accordance with guidelines established in USEPA's Offsite Consequence Analysis guidanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12201,
      "SummaryText": "e document, using the release of gas in an enclosed space method.  The source location results in a radius of influence corresponding to the toxic endpoint of 0.0087 mg/l that extends beyond the property boundaries of the facility in all directions.  Using LandView. III, the residential population within the radius of influence is 19,100 persons with approximately 7,300 households.  The public receptors identified within the radius of influence were determined to be schools, residences, hospitals, public recreational areas and major commercial, office, or industrial areas.  \n\nThe alternate release scenario was performed assuming that the quantity of chlorine gas released was 1,000 pounds over a ten (10) minute period with a stability class of D.  The distance to the toxic endpoint was determined to be 0.81 miles.  The source location resulted in a radius of influence corresponding to the toxic endpoint of 0.0087 mg/l that extends the beyond the property boundaries of the facility in all directions.  The residential population within the radius of influence was determined, using LandView. III, to be 2,500 persons with approximately 940 households.  The public receptors identified within the radius of influence were determined to be schools, residences, religious institutions, and major commercial, office, or industrial areas.  There were no identified environmental receptors within the radius of influence. \n\n3.5 General Accidental Release Prevention Program\n\nDue to the Program 3 status of the WPCP facility, the facility is required under Section 112(r) of the CAA to develop a Prevention Program.\n\n3.6 Five-Year Accident History\n\nThe WPCP facility has not experienced any accidental releases of chlorine in the past five years (May 1994-May 1999).\n\n3.7 Emergency Response Program\n\nThe current WPCP facility emergency response program requires coordination with local emergency response agencies, and includes provisions for public notification in the event of a release.  Fur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12201,
      "SummaryText": "ther details regarding the WPCP emergency response program are included in Section 8 and Appendix B.\n\n3.8 Planned Changes to Improve Safety\n\nThe City of Fulton, being aware of the effects of an accidental release of chlorine gas at the WPCP, is working to upgrade its Prevention and Emergency Response Programs to fulfill RMP Program 3  level requirements.  The City will continue to regularly review and revise its existing operating procedures related to gaseous chlorine to ensure that the safety of WPCP employees, the general public, and the environment is protected to the fullest extent possible."
    }
  ]
}