{
  "FacilityID": 12228,
  "FacilityName": "Hilight Gas Plant/Reno Jct. Isomerization Plant",
  "FacilityStr1": "1464 Hilight Road",
  "FacilityStr2": null,
  "FacilityCity": "Gillette",
  "FacilityState": "WY",
  "FacilityZipCode": "82718",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56005",
  "LEPC": "Campbell County LEPC",
  "FacilityLatDecDegs": "43.842222",
  "FacilityLongDecDegs": "-105.363333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.westerngas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106580319,
  "ParentCompanyName": "Western Gas Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 606413052,
  "Company2DUNS": 0,
  "OperatorName": "Western Gas Resources, Inc.",
  "OperatorStr1": "12200 North Pecos Street",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80234",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "WYD 988-869-418",
  "EPAFacilityID": "100000130039",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "30-030-1",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.83973,
  "FRS_Long": -105.36539,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16342,
      "AltID": "Liquids Plant",
      "FacilityID": 12228,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 20385,
          "ProcessID": 16342,
          "ChemicalID": 155,
          "Quantity": 9700000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 12486,
              "ProcessChemicalID": 20385,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 12487,
              "ProcessChemicalID": 20385,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 12488,
              "ProcessChemicalID": 20385,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 12489,
              "ProcessChemicalID": 20385,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 12490,
              "ProcessChemicalID": 20385,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16753,
          "ProcessID": 16342,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8523,
              "Process_NAICS_ID": 16753,
              "SafetyReviewDate": "1998-06-10 00:00:00",
              "PHA_Date": "1998-06-22 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "modified what if checklist",
              "PHACompletionDate": "1998-03-05 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "hydrocarbon, hydrogen, and flame detection equipment",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-11-19 00:00:00",
              "TrainingReviewDate": "1998-11-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-21 00:00:00",
              "EquipmentInspectionDate": "1999-04-21 00:00:00",
              "EquipmentTested": "Generator, Unit #27",
              "ChangeMgmtDate": "1998-03-05 00:00:00",
              "ChangeMgmtReviewDate": "1998-03-05 00:00:00",
              "PreStartupReviewDate": "1998-12-01 00:00:00",
              "ComplianceAuditDate": "1999-04-07 00:00:00",
              "AuditCompletionDate": "1999-04-23 00:00:00",
              "IncidentInvestigationDate": "1999-02-04 00:00:00",
              "InvestigationChangeDate": "1999-02-04 00:00:00",
              "ParticipationPlansReviewDate": "1999-03-14 00:00:00",
              "HotWorkPermitReviewDate": "1994-11-14 00:00:00",
              "ContractorSafetyReviewDate": "1998-11-14 00:00:00",
              "ContractorSafetyEvalDate": "1998-01-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "This is fully manned facility with trained operators on duty 24hr/day.  All processes are protected with overpressure protection that is subjected to regular inspections and testing.  There are both automated and manual alarms and shutdowns at this facility.  There are hydrocarbon detectors and fire eyes in the compressor building which is ventilated to prevent the accumulation of flammable vapors.  The plant generates it's own electricity so it is not subjected to local power outages.  The liquid storage areas are not diked as they all contain pressurized liquids that will flash and not form liquid pools.  All relief devices vent to asafe area or to a continuously burning flare.  All operators are extensively trained in standard operating procedures including emergency response.  This training goes on continously during the year.  The entire plant has been analyzed using a modified \"what if/checklist\" type PHA.  All items identified during this study have been addressed.  All materials used during construction and maintenance are proper for the process.",
              "_chemicals": [
                {
                  "PrimaryKey": 11702,
                  "PreventionProgram3ID": 8523,
                  "ProcessChemicalID": 20385
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12228,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-01-13 00:00:00",
    "ERTrainingDate": "1999-02-17 00:00:00",
    "CoordinatingAgencyName": "Campbell County Fire Department",
    "CoordinatingAgencyPhone": "3076827271",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12228,
      "SummaryText": "\nRisk Management Plan\nExecutive Summary for the\nHilight /Reno Junction Gas Processing Facility\n\nAccidental Release Prevention and Response Policies\nThe Hilight/Reno Junction Gas Plant has a longstanding commitment to worker and public safety.  This commitment is supported by the resources invested in accident prevention, personnel training and the consideration of safety issues in the design, construction, operation and maintenance of our facilities.  Our policy is to implement reasonable controls to provide a safe operation and prevent foreseeable releases of regulated substances.  However, if a release does occur, trained gas plant personnel will respond to control and contain the release.\n\nDescription of the Stationary Source and Regulated Substances\nThe Hilight/Reno Junction gas plant is located about 20 miles south of Gillette, Wyoming.  The facility includes compression, dehydration, electrical power generation, natural gas liquid recovery and fractionation.  The plant produces a lean, dry residue gas stream, liquid propane, liquid butane and a mixed natural gas liquid stream (NGL).  The liquid products contain ethane, propane, butanes, pentanes and heavier components.  The plant handles regulated flammables such as ethane, propane, mixed butanes and mixed pentanes.  The plant does not handle threshold quantities of any materials classified as toxic.\n\nOffsite Consequence Analysis Results\nThere are no toxic release scenarios to consider at the Hilight gas plant.\n\nThe worst-case scenario (WCS) at the Hilight/Reno Junction facility is the release of flammable substances from a mixed butane liquids storage bullet which form an unconfined vapor cloud explosion.   This scenario pertains to a vapor cloud explosion (VCE) involving the full inventory of the largest storage tank containing mixed butanes liquids.  The content of this tank amounts to about 157,800 pounds of material.  This amount of material is presumed to release, vaporize and ignite resulting in the VCE"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12228,
      "SummaryText": ".  Using the RMP Comp software, the maximum distance to the 1.0 pound per square inch endpoint for this WCS was calcuated to be 0.4 miles.  This distance does include one residence and therefore has caused the Hilight/Reno Junction plant to be a program level 3 facility.   Although we have numerous controls to prevent such a release and to manage their consequences, no credit for passive mitigation measures was taken here.  It should be noted that this tank rarely operates full, though this is volume is used in the WCS calculations.\n\nThe alternative release scenario (ARS) of flammable substances at the plant, is a VCE resulting from the release of  propane from a ruptured truck loading hose.  This release is assumed to last for 10 minutes and result in the release of 28,300 pounds of material.  Using the RMP Comp Software, the maximum distance to the 1.0 pound per square inch endpoint for this ARS was calculated to be 0.2 miles.  This event was selected as being a possible scenario for use in emergency planning and response.  It is worth noting that there are no residences within the ARS 1.0 psi pressure radius. \n\nGeneral Accidental Release Prevention Program \n The following is a summary of the accident prevention program in place at the plant.   The processes at the plant are regulated by the Environmental Protection Agency=s (EPA=s) Risk Management Program (RMP) and the Occupational Safety and Health Administration=s (OSHA=s) process safety management (PSM) standard.  The following summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation\nThe Hilight/Reno Junction gas plant requires employees to participate in all facets of process management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees h"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12228,
      "SummaryText": "ave access to all information created as part of the gas plant accident prevention program.  Specific ways that employees are involved in the accident prevention program are documented in an employee participation plan that is maintained at the gas plant and addresses each accident prevention program element. In addition the gas plant has a number of initiatives under way that address process and employee safety issues.  These include development of standardized operating procedures, incident investigation, management of change, safe work practices and participation in flowsheet reviews. \n\nProcess Safety Information\nThe Hilight/Reno Junction gas plant keeps a variety of technical documents that are used to help maintain safe operation of the process.  These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information.  The Operations group has been assigned responsibility for maintaining up-to-date process safety information.  The location of these documents is readily available to help employees locate any necessary process safety information.\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment consideration, is provided in material safety data sheets (MSDSs).  This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.   For specific process areas, the gas plant has documented safety related limits for specific process parameters in operating manuals.  The gas plant ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel and protective instrument systems (e.g., automated shutdown systems).\n\nThe Hilight/Reno Junction gas plant maintains numerous technical documents that provide information about the design and construction of process equipmen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12228,
      "SummaryText": "t.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis\n The Hilight/Reno Junction gas plant has a comprehensive program to ensure that hazards associated with the various processes are identified and controlled.  Within this program each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Hilight/Reno Junction gas plant uses the process hazards analysis technique to perform these evaluations.  These reviews are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures.  The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nIf necessary the PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12228,
      "SummaryText": "re documented and retained.  \n\nOperating Procedures\nThe Hilight/Reno Junction gas plant maintains written procedures that address various modes of process operations, such as unit startup, normal operations, emergency shutdown and normal shutdown.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed to ensure they are current and accurate.  The procedures are also kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\n\nTraining\nTo complement the written process operating procedures, the Hilight/Reno Junction gas plant has a comprehensive training program for all employees involved in operating a process.  New employees receive basic training in gas plant operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate the knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  All training is documented for each operator, including the means used to verify the operators understanding of the training.\n\nContractors\n The Hilight/Reno Junction gas plant uses contractors to supplement its work force during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors 1) perform their work in a safe manner, 2) have the appropriate knowledge and skills, 3) are aware of the hazards in their workplace, 4) understand what"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12228,
      "SummaryText": " they should do in the event of an emergency, 5) understand and follow site safety rules, and 6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with 1) process overview, 2) information about safety and health hazards, 3) emergency response plan requirements, 4) safe work practices prior to their beginning work, 5) safe and hot work permits as required.  In addition the Hilight/Reno Junction gas plant evaluates contractor safety programs and performance during the selection of a contractor.\n\nPre-startup Safety Reviews (PSSRs)\nThe Hilight/Reno Junction gas plant conducts a PSSR for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves as a quality assurance mechanism by requiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity\nThe Hilight/Reno Junction gas plant has well established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps, heat exchangers, compressors and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: 1) conducting training, 2) developing written procedures, 3) performing inspections and tests, 4) correcting identified deficiencies, and 5) applying quality assurance measures.  In combination these activities form a system that maintains the mechanical integrity of the process.\n\nMaint"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12228,
      "SummaryText": "enance personnel receive training on 1) an overview of the process, 2) safety and health hazards, 3) applicable maintenance procedures, 4) emergency response plans, and 5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provides a basis for training.  Inspections and tests are performed to verify that equipment parameters are within acceptable limits.  For a vessel, the parameter being monitored would typically be wall thickness. If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible) or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.  \n\n\nSafe Work Practices\n The Hilight/Reno Junction gas plant has long standing safe work practices in place to help ensure worker and process safety.  Examples of these include 1) control of the entry/presence/exit of support personnel, 2) a lockout/tagged procedure to ensure isolation of energy sources for equipment undergoing maintenance, 3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, 4) a permit and procedure to control spark producing activities (i.e. hot work), and 5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures along with training of affected personnel form a system to help ensure that operations and maintenance activities are performed safely.\n\nManagement of Change\nThe Hilight/Reno Junction gas plant has a comprehensive system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology, procedures and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to 1) ens"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12228,
      "SummaryText": "ure that adequate controls are in place to manage any new hazards, 2) verify that existing controls have not been compromised by the change, and 3) ensure that changes do not introduce an unknown hazard to the process.  Affected chemical hazard information, process operating limits and equipment information, as well as procedures is updated to incorporate these changes.  In addition, operating and maintenance personnel are provided necessary training on the change.\n\nIncident Investigation\nThe Hilight/Reno Junction gas plant promptly investigates all incidents that resulted in, or reasonably could have resulted in a fire/explosion, major property damage, environmental loss or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents it findings, develops recommendations to prevent a recurrence and forwards these results to gas plant management for resolution.  The final resolution of each finding or recommendation is documented and the investigation results reviewed with all employees who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs.\n\nCompliance Audits \nTo guarantee that the accident prevention program is functioning properly, the Hilight/Reno Junction gas plant audits to determine that the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to gas plant management for resolution.\n\nChemical -Specific Prevention Steps\nThe processes at the Hilight/Reno Junction gas plant have hazards that must be manage to ensure continued safe operation.  The following is a description of existing safety features applic"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12228,
      "SummaryText": "able to prevention of accidental releases of regulates substances in the facility.\n\nUniversal Prevention Activities  \nThe accident prevention program summarized previously is applied to all RMP covered processes at the Hilight/Reno Junction gas plant.  Collectively these prevention program activities help prevent potential accident scenarios that could be caused by equipment failure and human errors.\n\nSpecialized Safety Features\n The Hilight/Reno Junction gas plant has safety features on many units to help 1) contain/control a release, 2) quickly detect a release, and 3) reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\nRelease Detection- Hydrocarbon detectors with alarms\nRelease Containment/Control- Process relief valves that discharge to a flare which will capture    and incinerate episodic releases\n                - Valves to permit isolation of portions or the entire process\n- Automated shutdown systems for specific process parameters\n- Curbing or diking to contain liquid releases\n- Redundant equipment and instrumentation (e.g. UPS system)\n- Atmospheric relief devices\n- Overall Plant and local area ESDs\n- Computer controlled and interlocked processes\nRelease Mitigation- Manually operated fire extinguishing systems\n- Trained emergency response personnel\n- Personnel protective equipment (e.g. self contained breathing equipment)\n\nFive Year Accident History\nIn the last five years there have not been any hydrocarbon releases whose quantities approached those described in the RMP release events.\n\nEmergency Response Program Information\nThe Hilight/Reno Junction gas plant maintains a written emergency response program, which is in place to protect worker and public safety and the environment.  The program consists of procedure for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidently released.  The procedures address all aspects"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 12228,
      "SummaryText": " of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup.  In addition the plant has procedures that address maintenance, inspection and testing of emergency equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to the plant.  The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program of the Hilight/Reno Junction gas plant is coordinate with the Wright Fire Department and Campbell County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meeting of the committee, which includes local emergency response officials, local government officials and industry representatives.  The Hilight/Reno Junction gas plant has around the clock communications capability with appropriate LEPC officials and emergency response organizations.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to emergency situations.  The Hilight/Reno Junction gas plant conducts periodic emergency drills that involve the local emergency response organizations and the gas plant provides annual refresher training to local emergency responder regarding the hazards of regulated substances in the gas plant.   \n\n Planned Changes to Improve Safety-\nAdditional drill are planned.  A company wide year 2000 compliance program helps assure safety issues."
    }
  ]
}