{
  "FacilityID": 12270,
  "FacilityName": "Bellingham CO2 Facility",
  "FacilityStr1": "92 Depot Street",
  "FacilityStr2": null,
  "FacilityCity": "Bellingham",
  "FacilityState": "MA",
  "FacilityZipCode": "02019",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25021",
  "LEPC": "Bellingham LEPC",
  "FacilityLatDecDegs": "42.092222",
  "FacilityLongDecDegs": "-71.479167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 782676381,
  "ParentCompanyName": "Northeast Energy Associates LP",
  "Company2Name": null,
  "CompanyDUNS": 1343953,
  "Company2DUNS": 0,
  "OperatorName": "FPL Energy CO2 Operations Inc.",
  "OperatorStr1": "PO Box 1213",
  "OperatorStr2": null,
  "OperatorCity": "Bellingham",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02019",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132368",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-04-08 00:00:00",
  "DeRegistrationEffectiveDate": "2005-03-31 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.09335,
  "FRS_Long": -71.4804,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16413,
      "AltID": "CO2 Refrigeration",
      "FacilityID": 12270,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 20473,
          "ProcessID": 16413,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16824,
          "ProcessID": 16413,
          "NAICSCode": "311999",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8575,
              "Process_NAICS_ID": 16824,
              "SafetyReviewDate": "1998-03-23 00:00:00",
              "PHA_Date": "1998-03-23 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-07-08 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-05-01 00:00:00",
              "TrainingReviewDate": "1998-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "drills with Bellingham Fire Dept",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-05-01 00:00:00",
              "EquipmentInspectionDate": "1998-03-23 00:00:00",
              "EquipmentTested": "fire extinguishers",
              "ChangeMgmtDate": "1998-05-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-05-01 00:00:00",
              "PreStartupReviewDate": "1998-05-01 00:00:00",
              "ComplianceAuditDate": "1998-05-01 00:00:00",
              "AuditCompletionDate": "1998-07-08 00:00:00",
              "IncidentInvestigationDate": "1996-06-21 00:00:00",
              "InvestigationChangeDate": "1996-06-23 00:00:00",
              "ParticipationPlansReviewDate": "1998-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-05-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-05-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "CO2 Production Process that includes Ammonia refrigeration",
              "_chemicals": [
                {
                  "PrimaryKey": 11771,
                  "PreventionProgram3ID": 8575,
                  "ProcessChemicalID": 20473
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12270,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-05-01 00:00:00",
    "ERTrainingDate": "1998-05-01 00:00:00",
    "CoordinatingAgencyName": "Bellingham Fire Dept",
    "CoordinatingAgencyPhone": "5089661112",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "OSHA Regulations at 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12270,
      "SummaryText": "This document is a brief summary of the risk management plan that has been established by the Bellingham CO2 Facility (CO2 Facility) located on Depot Street in Bellingham, MA.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe CO2 Facility management team believes strongly in maintaining the highest degree of plant safety.  Employee involvement and participation by all employees is an important part of the CO2 Facility's process safety program.  Employee involvement will ensure that all perspectives are considered and the best ideas are implemented.  All employees have the right to participate in the development and the conduct of process safety management (PSM) as stated in OSHA's final PSM rules.  \n\nCO2 Facility personnel are trained annually in safety procedures, HAZCOM (Hazard Communication), and OSHA requirements.  The CO2 Facility operates 24 hours a day.  The operation staff includes four technicians during the day shift (6AM-6PM) and two technicians during the night shift (6PM-6AM).  Personnel from the adjacent Bellingham Cogeneration facility are cross-trained to assist in emergencies at the CO2 Facility.  \n\nFacility Description and Regulated Substances Handled\n\nThe CO2 Facility is designed to produce 350 tons of food grade carbon dioxide per day.  The source of carbon dioxide is a slipstream of flue gas leaving combustion turbines that burn natural gas for production of electricity at the adjacent cogeneration plant.  The CO2 gas is extracted from the flue gas and is compressed to approximately 300 psig prior to liquefaction using a two-stage ammonia refrigeration system.  Ammonia is the only regulated substance handled at the CO2 facility.  \n\nWorst-Case Release Scenario \n\nAs prescribed by the Offsite Consequence Analysis (OCA) Guidance, the worst-case scenario describes the catastrophic release of all of a chemical in a process.  Guidance allows for the release to take place over a 10-minute period.  A catastrophic release from the ammoni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12270,
      "SummaryText": "a system would involve the rupture of the main ammonia receiver and the release of the maximum amount of ammonia that could be present in the entire two-stage refrigeration system.  \n\nIt was estimated that 25,520 pounds (5,000 gallons) of ammonia could be released in an instantaneous release.  The worst-case release scenario uses administrative controls to limit the amount of ammonia stored on site.  These controls include written operating procedures and level controls that prevent the system from being filled to its 7,000-gallon maximum capacity.  \n\nThe worst-case release scenario has a minimal chance of occurring.  The tank is constructed of one-inch thick welded steel that meets all of the American Society of Mechanical Engineers (ASME) Boiler and Pressure Vessel Code so a rupture is highly unlikely.  During normal operations, the majority of the ammonia is not stored in the main receiver, but rather is located in the two-stage ammonia refrigeration system.  Under normal operations, the total volume of ammonia could not be released within 10 minutes.  There are very limited times during the year when the majority of the ammonia is stored in the main receiver.  \n\nAlternate Release Scenarios\n\nFor the alternate-case scenarios, more realistic accident scenarios are examined.  Using the guidelines in the OCA guidance, alternate release scenarios were selected that simulated small leaks in the piping at various locations of the refrigeration system.  The pressure in the line at the point of the rupture was estimated along with other parameters based on normal operating conditions.  It is conservatively assumed that it will take one hour to stop the release.  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe CO2 Facility complies with the OSHA PSM rule including the following release prevention steps:\n( Conducting process hazard analyses.\n( Implementing standard operating procedures and practices.  \n( Conducting employee traini"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12270,
      "SummaryText": "ng that includes an overview of the process technology, ammonia hazards and use of personal protection equipment, normal facility operation, emergency operations and procedures, emergency shutdown, and safe work practices. \n( Conducting a detailed mechanical integrity program including: following written procedures, training for maintenance activities, corrective and preventative maintenance activities, identifying equipment deficiencies and quality assurance.\n( Implementing non-routine work authorizations for lockout and tag out of equipment, contractor safety, hot work (welding) and confined space entry.  \n( Implementing emergency response plans that include first aid, ammonia leaks, safety equipment, and fire exposure.\n( Conducting compliance audits once every three years.\n\nFive-year Accident History\n\nThe CO2 Facility has not had any accident within the last five years or within the life of the plant.  \n\nThe Emergency Response Program\n\nThe CO2 Facility and Fire Department representatives agreed upon the following general concept of operations for the Emergency Response Program.  \n\nEmergency Awareness - The CO2 Plant maintains ammonia detectors and inspection programs.  Should a release occur, an alarm sounds and the Plant Control Room is notified by internal communications systems.\n\nEmergency Notification - The Plant Control Room Operator, serving as Response Team Leader, notifies the Plant Emergency Coordinator using the established call out list and briefs the Emergency Coordinator on the event.  The Emergency Coordinator notifies the Bellingham Fire Department using 911.  The Emergency Coordinator provides information to the Fire Department including type of release, estimated quantity, time of release, estimated duration, cause, outlook for continued release, the CO2 Plant responses taken, wind speed and wind direction.\n\nIncident Command - Initial response will be the responsibility of the Plant Incident Commander.  He will direct the CO2 Plant emergency resp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12270,
      "SummaryText": "onse actions until the Fire Department arrives.  The Fire Department will establish an incident command post and assume control of the incident from the Plant Incident Commander, once that command post is established.\n\nMedical Support - The Bellingham Fire Department has the responsibility for responding to medical emergencies, transporting the injured, and notifying the hospital.  \n\nOngoing Support - The Plant Emergency Response team will be available to provide technical support to the Fire Department through communications between the Plant Incident Commander and the Fire Department Incident Commander.\n\nPublic Notification - The Bellingham Fire Department has the responsibility for determining the need for protective actions and notifying the public.  The Fire Department will make protective action determinations based upon its judgment given the extent of the release, wind speed and wind direction.  Possible protective actions include sheltering in place with ventilation control and evacuation.  The Bellingham Fire Department will coordinate with the Police Department and the local cable station to notify the public by traversing the potentially affected areas with a portable public address system, combined with cable station announcements.\n\nPost Emergency Support - The Bellingham Fire Department and CO2 Facility representatives have agreed to coordinate any post-emergency clean-up activities that may be required.  Offsite activities will be coordinated by the Fire Department with support and appropriate resources from the CO2 Facility.  Onsite activities will be the responsibility of the CO2 Facility, with Fire Department oversight.\n\nPlanning Requirements - The Bellingham Fire Department and CO2 Facility representatives have committed to an ongoing planning process to include providing additional information to the Fire Department and the Bellingham LEPC as the planning process continues, evaluation of Fire Department resource needs and plans for joint training"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12270,
      "SummaryText": ", drills and exercises.\n\nPlanned Changes to Improve Safety\n\nThe Bellingham Fire Department and CO2 Facility representatives have committed to an ongoing planning process to include providing additional information to the Fire Department and the Bellingham LEPC as the planning process continues, evaluation of Fire Department resource needs and plans for joint training, drills and exercises.\n"
    }
  ]
}