{
  "FacilityID": 12310,
  "FacilityName": "Miami Water Treatment Plant",
  "FacilityStr1": "3210 Chuck Wagner Lane",
  "FacilityStr2": "Building B",
  "FacilityCity": "Dayton",
  "FacilityState": "OH",
  "FacilityZipCode": "45414",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39113",
  "LEPC": "Montgomery/Greene County LEPC",
  "FacilityLatDecDegs": "39.806556",
  "FacilityLongDecDegs": "-84.170167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G7",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "wstmgr@dayton.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Dayton Department of Water",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Dayton Water Department",
  "OperatorStr1": "3210 Chuck Wagner Lane",
  "OperatorStr2": null,
  "OperatorCity": "Dayton",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45414",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131859",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-09-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.80782,
  "FRS_Long": -84.17063,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16460,
      "AltID": "Water Treatment",
      "FacilityID": 12310,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20523,
          "ProcessID": 16460,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16872,
          "ProcessID": 16460,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8597,
              "Process_NAICS_ID": 16872,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "PHA_Date": "1999-06-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1998-12-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "Chlorine cylinder hoists",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-08-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1998-07-06 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-08-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-27 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11795,
                  "PreventionProgram3ID": 8597,
                  "ProcessChemicalID": 20523
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12310,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Montgomery/Greene County LEPC",
    "CoordinatingAgencyPhone": "9372254357",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 12310,
      "SummaryText": "used chlorine gas for drinking water disinfection for over 70 years.  In over 70 years of use the city has experienced only minor incidents with no reportable quantities released and no off-site consequences.   \n\n Health Information\n\n     Chlorine gas is approximately 2.5 times heavier than air.  It has a greenish-yellow color and a very sharp odor.  It can be detected at 0.3 parts per million (ppm) by the human nose.  Exposure to chlorine gas can cause health effects that range from irritation to death.  Chlorine gas can burn eyes and cause skin irritation.  Inhalation of chlorine gas can cause severe irritation of nose, throat and respiratory system.  Chlorine can combine with moisture to form hydrochloric acid, which can cause painful lung congestion and possible death from suffocation.  The NIOSH Immediately Dangerous to Life and Health Concentration of chlorine gas in air is 10 ppm.  The Occupational Safety Health Administration has set a ceiling (limit) of 1 ppm for worker exposure.\n\n\n\nDescription of Chlorination Systems\n\n     The Division of  Water Supply and Treatment has two facilities that store chlorine in quantities exceeding the RMP regulation threshold amount of 2500 pounds.  These facilities are the Miami Water Treatment Plant and the Ottawa Water Treatment Plant.\n\nThe Miami Water Treatment Plant is located at 3210 Chuck Wagner Lane, near the Kittyhawk Golf Facility in north Dayton.  The chlorine facility is located at the southeast side of the water plant.       Latitude:  39.0  48' 23.6        Longitude:  -084 10' 12.6 \n\n \n\n\nChlorine Storage and Feed System \n     \n     Chlorine is shipped in one-ton cylinders as a liquefied, compressed gas.   The chlorine facility has between 8 and 16 full one-ton cylinders.  At the Miami Water Plant, two sets of three cylinders are connected to common manifolds.  When the manifold in service becomes empty, there is an automatic switchover to the manifold on standby.\n\n     Chlorine gas under pressure flows from th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12310,
      "SummaryText": "e in-service manifold to the vacuum regulator in the storage room.  Chlorine gas under vacuum pressure flows from the vacuum regulator to the chlorine feeders in the chlorine feed room.  The flow rate of chlorine gas is adjusted at the chlorine feeders.  Chlorine gas under vacuum pressure flows from the feeders to the filter influents.\n\n Hazard Assessment\n\n     For the last five-year accident history, there have been three minor incidents with no injuries and no off-site consequences. \n\n     For Off-Site Consequence Analysis, the worst-case release scenario resulted in an end point distance of 0.9 miles for the Miami Water Treatment Plant's chlorine facility. An estimated residential population of 1,200 is within the end point distance.  Potential off-site receptors include residences, a golf course and industrial/commercial areas.  Mitigation Measures used for model: Release in enclosed space, in direct contact with outside air.  \n\n     An alternate-case release scenario resulted in an end point distance of 0.1 miles.  There are no public or environmental receptors within this end point distance.\nMitigation Measures used for model: Release in enclosed space, in direct contact with outside air.  \n\nThe EPA's RMP*Comp software was used for worst-case and alternate-case modeling.       \n\n\n\nPrevention Program\n\n     Chlorine cylinder scales are tested and inspected annually.  Chlorine container hoists are inspected and tested annually.  Chlorine gas alarms are tested and calibrated quarterly by WS&T Division electricians.  Portable gas monitors (with alarms) and ammonium hydroxide solutions are also used to check for leaks in the chlorine rooms.   The chlorine systems are monitored 24 hours per day, 7 days per week.  Hazard assessments and safety audits are conducted annually and semi-annually (respectively) at both chlorine facilities. \nAll chlorine incidents are investigated as promptly as possible, but not later than 48 hours after an incident.\n\n     A chlorine gas"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 12310,
      "SummaryText": "U.S. EPA Risk Management Program (RMP) regulations were issued on June 20, 1996.  These regulations require facilities, which have a regulated substance above threshold levels, to develop a Risk Management Program.  In Ohio, water utilities must register and submit a Risk Management Plan for each regulated facility to the U.S. EPA and the Ohio EPA.   This regulation was designed to prevent or minimize potentially catastrophic releases of toxic, reactive, flammable or explosive chemicals.  The RMP regulation requires that employers address the following areas; Hazard Assessment, Prevention Program and Emergency Response Program.  Regulated facilities must submit RMP registration and program summary.     \n\n     Chlorine is the only chemical used by the City of Dayton's Division of Water Supply and Treatment that is regulated by the Risk Management Program regulations.  Chlorine is added to drinking water for disinfection.   This plan was developed to ensure compliance with RMP regulations for the Miami Water Treatment Plant.\n\n     The Division of Water Supply and Treatment's chlorine facilities fall under Program 3 RMP provisions.  Program 3 applies when worst-case release modeling reveals that a facility could have off-site impacts and the facility has processes regulated by federal or state OSHA Process Safety Management Plans.  The Division of Water Supply and  Treatment has a Process Safety Management program for its chlorine facilities.\n\n     The primary mission of the Division of Water Supply and Treatment is to maintain public health and safety by providing an abundant supply of safe drinking water at an adequate pressure.   Chlorine is used to help ensure the safety of drinking water and to comply with Environmental Protection Agency water regulations.  At the same time, the Division of Water Supply and Treatment works to ensure that employees and the public will not be threatened by an uncontrolled release of chlorine gas.\n\n     The City of Dayton has"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12310,
      "SummaryText": "scrubber system will be installed in 1999 at the chlorine storage building of the Miami Water Treatment Plant.   These scrubbers will be able to neutralize the entire contents of a one-ton chlorine cylinder. In 1999 the existing vacuum piping system will be extended to the chlorine tanks as another safety upgrade.  A break in the vacuum piping system shuts off the flow of chlorine gas.\n     \n     Employees at the Miami Treatment Plant receive annual chlorine safety training.  Employees are re-trained when there are changes to procedures, equipment or facilities.  Standard operating procedures are used when employees change chlorine cylinders.  All chlorine incidents are investigated thoroughly.\n\n\n\n Emergency Response\n\n     The Dayton Fire Department and the local Hazardous Materials Response Team are notified when there is a potential for a chlorine gas release.  Pre-emergency planning is conducted with the Dayton Fire Department.\n\n     Wind direction socks are located near the chlorine storage building to help employees determine the best escape route in the event of a chlorine leak.  Emergency exhaust fans prevent the accumulation of chlorine gas in the chlorine storage room. \t\n\n     A chlorine gas scrubber system will be installed in 1999 at the chlorine storage building of both water treatment plants.   These scrubbers will be able to neutralize the entire contents of a one-ton chlorine cylinder."
    }
  ]
}