{
  "FacilityID": 12333,
  "FacilityName": "Valley Sweet, LLC",
  "FacilityStr1": "13129 Ave 248",
  "FacilityStr2": null,
  "FacilityCity": "Tulare",
  "FacilityState": "CA",
  "FacilityZipCode": "93274",
  "Facility4DigitZipExt": "9333",
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.210806",
  "FacilityLongDecDegs": "-119.2805",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "vlysweet@valleysweet.com",
  "FacilityDUNS": 293716469,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Steve \"Doc\" Blizzard",
  "OperatorStr1": "13129 Ave 248",
  "OperatorStr2": null,
  "OperatorCity": "Tulare",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93274",
  "OperatorZipCodeExt": "9333",
  "RMPContact": "Tim H. Isaak",
  "RMPTitle": "Safety Manager",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129461",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-07-13 00:00:00",
  "DeRegistrationEffectiveDate": "2005-06-16 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.24016,
  "FRS_Long": -119.2734,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16503,
      "AltID": null,
      "FacilityID": 12333,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16915,
          "ProcessID": 16503,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20578,
          "ProcessID": 16503,
          "ChemicalID": 56,
          "Quantity": 25150.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520578,
          "ProcessID": 16503,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12333,
      "SummaryText": "\n\n\n\n\n\nVALLEY SWEET\n\nTULARE, CALIFORNIA\n\n                                                \n\n\nRISK MANAGEMENT PLAN\n\n\n\nR . M . P .\n\n\n\n(HAZARDOUS MATERIAL\nMANAGEMENT PLAN)\n\n\n\n\nValley Sweet\nHazardous Materials Management Plan            Date of Preparation: 6/99\n    \n\nTABLE OF CONTENTS \n\n    SECTION    SUBJECT                            PAGE\n\n         1        INTRODUCTION                            1\n         2        GENERAL BUSINESS INFORMATION                2\n         3        HAZARDOUS MATERIAL MANAGEMENT            3\n         4        EMERGENCY PLAN                        3\n         4A         Evacuation Procedures                        4\n         4B         Fires or Explosions                        5\n         4C         Earthquake or other Natural Disasters                5\n         4D         Locations of Utility Shut-offs & Emergency Shower        6\n         4E         Chemical Release Response Procedures                7\n         4F         Emergency Medical Plan                        12\n         5        EMPLOYEE TRAINING PLAN                    14\n         6        EH&S INSPECTION PROCEDURE                    15\n         7        HAZARDOUS WASTE                        16\n\n    FIGURES    CONTENT\n\n1 GENERAL VICINITY MAP\n2 DETAILED SITE PLAN / FIRE PROTECTION\n3 EVACUATION ROUTES\n\nATTACHMENTS\n\n1 HAZARDOUS MATERIAL INVENTORY STATEMENT\n2 BASIC ROOM PLAN\n3 HAZARDOUS MATERIAL CONTAINMENT PLAN\n4 CHEMICAL RELEASE REPORT\n5 CHEMICAL RELEASE RESPONSE CONTRACTORS\n6 AGENCY NOTIFICATION LIST\n7 MEDICAL & EMERGENCY RESPONSE SUPPLIES\n8 EH&S TRAINING AND COMPLIANCE CALENDAR\n9 EMPLOYEE TRAINING SIGN IN SHEET\n10 HOUSEKEEPING AND SAFETY INSPECTION CHECKLIST\n11 HAZARDOUS MATERIAL STORAGE INSPECTION CHECKLIST\n\n\n\nValley Sweet                                             Page 1\nHazardous Materials Management Plan            Date of Preparation:  6/99\n\n\nSection 1:    INTRODUCTION\n\n\nThis Hazardous Materials Management Plan (HMMP) has been developed to safeguard human health, safety and the environment from fires, hazardous material incidents and other safety and health hazards that may arise at Valley Sweet located at 13129 Ave. 248 Tulare, California 93274.\n\nThis HMMP has been provided to the Tulare County Fire Department and the information contained in this plan is subject to the Trade Secret provisions of the California Health & Safety Code, Section 25511.  Inform"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12333,
      "SummaryText": "ation contained herein may be released to the public on court order or with the approval of Valley Sweet management.\n\nThis HMMP will be updated whenever there is a 100 % or more increase in the quantity of a previously disclosed hazardous material, handling of a previously undisclosed hazardous material subject to inventory requirements, or if there is a change of facility address, business name or business ownership.\n\n\nVALLEY SWEET\n13125 ROAD 248\nTULARE, CA  93274\n\n\nHAZARDOUS COMMUNICATION PROGRAM\n\n1. The person responsible for the hazard communication program at Valley Sweet is Tim H. Isaak, Safety Director.\n\n2. An inventory of hazardous materials used at Valley Sweet is located in the permanent filed in the main office.  A duplicate set is also located in the CA office.\n\n3. The material safety data sheets (MSDS) for all hazardous materials used at Valley Sweet are kept with the inventory.\n\n4. Employees who wish to review the MSDS's may do so by submitting a request to their supervisor.  Employees may also request a photocopy of the MSDS's.\n\n5. Any MSDS not on hand requested by an employee will be requested from suppliers by written letter within seven days.\n\n6. The MSDS file will be updated at least annually or as new hazardous materials are identified by the safety director.\n\n7. Containers of hazardous materials entering the plant will be checked by the receiving office and the safety director to be assured that they are properly labeled with the chemical name of the contents, the appropriate hazard warning, and the name and address of the supplier or manufacture.\n\n8. In-plant containers of hazardous materials will be stored in their original containers labeled with the chemical name and hazard warning.  Exceptions must be approved by the safety director.\n\n9. The following exceptions have been approved:    NONE\n\n10. Employee training is provided initially to all employees and for all new employees.  This training covers the following areas:\n\na. Their basic requirem"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12333,
      "SummaryText": "ents of the Hazard Communication Standard and their right to information on chemical hazards.\n\nb. The procedures to see Valley Sweet's program for compliance, MSDS files, and the standard.\n\nc. How to read and understand the labels on containers of hazardous materials.\n\nd. The potential physical hazards and health effects of the hazardous substances and how to use the MSDS's for more information.\n\ne. How to properly use hazardous materials and the proper protective measures to insure safe use.\n\nf. What to do in the case of an emergency, release or over exposure to the chemicals.\n\ng. How the presence of hazardous materials can be detected in the work place.\n\n11. A Record of Training Received will be placed in the employee's file to document this training.  These files are maintained in the main office.\n\n12. Training concerning new hazards (new chemicals or updated MSDS's) will be provided to the employees within 30 days and documented. \n\n13. Annual refresher training will be provided each spring before plant start-up and documented by information placed in the employee's file.\n\n14. Outside visitor, contractors, etc. will be advised of hazardous substances, by sign posting.\n\n15. In addition, contractors will be required to advise Valley Sweet of any hazardous materials used in their work as a condition of their contract.\n\n\nValley Sweet relies on the information contained in the MSDS's as permitted by the OSHA Hazard Communication Standard and does not perform independent hazard determinations.\n\n\n    Reviewed and approved:\n\n\n\n    Plant Manager                             Date             \n\nValley Sweet                                         Page 2\nHazardous Materials Management Plan            Date of Preparation: 6/99\n                        \nSection 2:    General Business Information\n\n    1.    Business Name:    Valley Sweet\n        Address:        13129 Ave 248\n                    Tulare, CA  93274\n        Telephone:        (559) 686-3381\n\n    2.    Plant Manager:    Steve (Doc) Blizzard\n        Office Telephone:    (559) 686-3381 Ext. 13\n\n    3.    Safety Manager:    Tim Isaak\n        Office Telephone:    (559) 686-3381 Ext. 30\n\n    4.    HMMP "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12333,
      "SummaryText": "Prepared by:    Tim Isaak\n        Office Telephone:    (559) 686-3381 Ext. 30\n\n5. Emergency Coordinators (Listed in order of contact preference)\nA.    Name:        Steve (Doc) Blizzard\n    Office Tel:    (559) 686-3381 Ext. 13\n    Home Tel:    (559) 636-9131\n\nB.    Name:        Jim Ervin\n    Office Tel:    (559) 686-3381 Ext. 20\n    Home Tel:    (559) 897-2531\n\n        C.    Name:        Tim Isaak\n            Office Tel:    (559) 686-3381 Ext. 30\n            Home:        (559) 591-7218\n    \n        D.    Name:        Steve Franklin\n            Office Tel:    (559) 686-3381 Ext. 22\n            Home:        (559) 732-1803 / 625-6062\n    \n        E.    Name:        Richard Tamouzian\n            Office Tel:    (559) 686-7243 Ext. 26\n            Home:        (559) 627-8642\n\n\n\n\n\n\n\nValley Sweet                                         Page 3\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\nSection 3:    HAZARDOUS MATERIAL MANAGEMENT\n\nValley Sweets Hazardous Material Inventory Statement is provided in Attachment 1.  Proper storage and handling methods for inventoried hazardous materials is provided in Valley Sweet's Basic Room Plan in Attachment 2.  Hazardous materials are stored with adequate secondary containment to prevent an offsite release.  Valley Sweet's Containment Plan is provided in Attachment 3.\n\nSection 4:    EMERGENCY PLAN\n\n1. Introduction:\n\nThis Section describes the steps to be followed in the event of major hazardous material incidents or other environmental emergencies arising at Valley Sweet.  A major hazardous material incident or environmental emergency refers to chemical spills, a fire, explosions, earthquakes, or other natural disasters.  It is important to note that the procedures described in this section serve only as general guidelines.  Common sense and good judgement based on solid training should be exercised when responding to any emergency situation.\n\n2. Chain-of-Command:\n\nIn an emergency situation at Valley Sweet where 911 has been dialed to obtain assistance, the Tulare County Fire Department would be the primary responder and the ranking fire officer responding to the incident would act as Incident Commander.\n\nAs Incident Commander, the Tu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12333,
      "SummaryText": "lare County Fire Department would have the primary authority to coordinate all emergency and medical response activities at Valley Sweet.\n\nThe following list represents the chain-of-command for incident command authority in the event that the Tulare County Fire Department has not arrived on the scene.\n\n1.    The Tulare County Department, also a 911 responder, would serve as Incident Commander if the fire department has not yet arrived.\n    \n2.    The Valley Sweet Emergency Coordinator would act as Incident Commander until the arrival of the Tulare County Fire Department or the Sheriff's Department.\n\nValley Sweet                                          Page 4\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\n3.    The Shift Supervisor would act as Incident Commander until the arrival of the Valley Sweet Emergency Coordinator, the Tulare County Fire Department, or the Sheriff's Department.\n    \n    4.    Life Star Ambulance would be called if a medical emergency exists.\n\n3. Emergency Response Numbers:\n\n1.    Fire Department        911 or (non-emergency: (559) 734-7477)\n2.    T.C.S.     Department        911 or (non-emergency: (559) 733-6211)\n3.    Life Star Ambulance        911 or (non-emergency: (559) 686-1561)\n\nSection 4A:    Emergency Evacuation Procedures\n\nIn the event of an emergency requiring evacuation of the work area and/or facility, the Emergency Coordinator and/or manager of the manufacturing unit has the authority to implement procedures for evacuation of the work area or facility.  The Tulare County Fire Department (as Incident Commander) may assist in the decision to evacuate.  All Valley Sweet personnel must be trained in proper evacuation procedures, and be aware of proper evacuation routes.\n\nWork Area or Facility Evacuation:\n\nWhen the signal for evacuation is given by the public address system, or verbally, persons in the work are a must:\n\n1. Shut down machinery and equipment, if easy and safe to do so.\n\n2. Escort and/or assist handicapped or injured personnel to the nearest exit identified on the posted Evacuatio"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12333,
      "SummaryText": "n Route Map (refer to Figure 3).\n\n3. Walk to the designated assembly point, at Northeast asphalt area north of shipping / truck staging area, and wait for instructions from the Emergency Coordinator.\n\n4. Supervisors must account for all people in their departments and must report unaccounted persons to the Emergency Coordinator.\n\n5. The Emergency Coordinator and/or Incident Commander will determine when reentry is safe and give the all clear signal for reentry into the building.\n\nValley Sweet                                          Page 5\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nVicinity Evacuation:\n\n1. Follow steps 1 through 5 above for Work Area or Facility Evacuation.\n\n2. The Sheriff's Department in coordination with the Incident Commander will direct vicinity evacuation, if necessary.\n\nSection 4B:    Emergency Response Procedures for Fires or Explosions:\n\nIndividual who discovers fire or explosion:\n\n1. SOUND FIRE ALARM (the fire alarm will signal the Tulare County Fire Department).\n\n2. CALL Valley Sweet RECEPTIONIST.  The Receptionist will contact the Valley Sweet Emergency Coordinator and any other internal or external emergency response personnel designated by the Emergency Coordinator.\n\n3. Take care of any injured ONLY IF IT CAN BE DONE SAFELY.\n\n4. If the fire is a minor one (can be extinguished with a fire extinguisher), if there is no potential for explosion, and if a trained, qualified person (e.g., and Emergency Coordinator) is available on-site to evaluate the hazards, then on-site personnel may attempt to put out the fire.  Personnel putting out the fire must don proper protective equipment, and use the appropriate fire extinguisher.  DO NOT ENTER AREA OF FIRE IF POTENTIAL FOR EXPLOSION EXISTS.\n\n5. Fire extinguishers are located throughout the main building and Cold Room (see Figure 2-Fire Protection).\n\nSection 4C:    Emergency Response Procedures for Earthquakes or other Natural Disasters\n\n1. During and immediately following an earthquake, take cover under a d"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12333,
      "SummaryText": "esk, table, workbench, doorway or other sturdy structure that can protect you from falling or flying debris.  Stay clear of windows, suspended objects, glass doors, tall filing cabinets or other objects that could fall or shatter.\n\n2. Remain at your station until the earthquake subsides.  Do not rush to an exit; you only increase your risk of injury.\n\n\nValley Sweet                                          Page 6\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\n3. If you are outdoors, stay in the open.  Keep away from overhead power lines or other objects that might shake loose and fall.\n\n4. If you are in a moving vehicle, stop and remain inside until the shaking is over.\n\n5. Do not use candles, matches, cigarette lighters, or other open flames.\n\n6. Check yourself and the people around you for injuries.  Provide first aid if necessary.\n\n7. Report injuries, broken utility lines, fires, and other incidents by calling the Receptionist.  Otherwise, do not tie up telephone lines with personal calls.  Leave the lines open for emergency communication.\n\n8. When it is safe to do so, and if necessary, shut off nearby machinery and exit the building using the safest and most direct route.  Go to your preassigned emergency assembly area, which is on the North asphalt area and report to the Emergency Coordinator.\n\n9. Do no return to any building until you have been directed to do so by the Emergency Coordinator or Incident Coordinator.\n\nSection 4D:    Location of Utility Shut-offs and Emergency Shower\n\n1. The gas shutoff is located next to the compressor at the receiving canopy.\n\n2. The electrical shutoff is located at south edge of receiving canopy across from the refrigeration room by the transformer.\n\n3. The water shutoff valve is located at the well / 10,000 gallon Storage at the northwest corner of the yard next to the orchard.\n\n4.    Emergency eyewash located at:    \n-East side of fumigation room, at receiving canopy.\n-Top of fumigation room (up the stairs) at receiving canopy.\n-East of batte"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12333,
      "SummaryText": "ry charging area under receiving canopy.\n-East of main plant at drenching area.\n\nEmergency shower / eyewash located at:\n-East of entrance door to refrigeration room inside the plant.\n\nValley Sweet                                          Page 7\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nSection 4E:    Emergency Response Procedure for Chemical Releases\n\nValley Sweet handles and stores chemicals in a manner designed to prevent chemical releases.  However, if a release occurs, this Section outlines Valley Sweet's chemical release response procedures designed to ensure a safe and effective response.\n\nDefinitions:\n\n1. Chemical Release Contact - employees who are trained to determine if a chemical release is minor or major and who initiate Valley Sweet's emergency response to a chemical release by notifying the Emergency Coordinator and who do not perform any additional chemical release response activities.  Valley Sweet's Chemical Release Contacts are considered by OSHA to be First Responder - Operations Level employees.\n\n2. Chemical Release Responder - employees who are trained to respond to a major chemical release in a defensive fashion only, without actually trying to stop the release.  Valley Sweet's chemical release responders are considered by OSHA to be First Responder - Operations Level employees.\n\n3. Minor Chemical Release - any unauthorized incidental release of a hazardous substance where the substance can be absorbed, neutralized, or otherwise be controlled at the time of the release by employees in the department where the release has occurred.\n\n4. Major Chemical Release - any unauthorized release of a hazardous substance that is not a minor chemical release.\n\nRequirements:\n\n1. Release Prevention Mechanisms\n\na. All hazardous materials must be stored in closed containers, cylinders, or tanks compatible with the material stored within.\n\nb. All hazardous material containers, cylinders and tanks must be labeled as to the identity of the material and the physical and/or"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12333,
      "SummaryText": " health hazards associated with the material or waste stored within. \n\n\nValley Sweet                                          Page 8\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nc. Liquid hazardous material containers when not in use, and all hazardous waste containers must be stored within secondary containment structures or equipment that is designed to hold at least 100% of the volume of the container(s) stored within.\n\nd. Hazardous material storage areas must be located away from or be otherwise protected from heat or ignition sources and forklift traffic.\n\ne. Outside hazardous material storage areas must be located at least 50 feet from a property line and be covered to prevent storm water runoff.\n\nf. All hazardous material storage areas must be signed with the proper National Fire Protection Agency Fire Diamond and any required OSHA/EPA signage.\n\ng. Each department shall only locate in the immediate work area the minimum volume of hazardous materials needed for a work shift.\n\n2. Initial Chemical Release Response Procedures:\n\na. The person who first becomes aware of a chemical release must ensure that the department's Chemical Release Responder is notified immediately.\n\nb. The Chemical Release Responder must determine if the release is a minor or a major chemical release and promptly notify the department supervisor and the Emergency Coordinator.\n\n3. Minor Chemical Release Procedures:\n\na. Employees who work in the affected area and normally work with the hazardous material released should respond in the following manner:\n\n1. Mechanical ventilation and fans serving the affected area should be shut off.\n\n2. Ignition sources within 50 feet of the release area should be shut off.\n\n\n\nValley Sweet                                          Page 9\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\n3.    The proper personal protection should be donned by employees trained and certified to wear such protection, and then:\n            \n3a.    absorbent material or \"release pillows\" should be placed on and a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 12333,
      "SummaryText": "round a liquid release to minimize lateral migration of the release and to prevent the release from entering a storm or sanitary sewer.\n\n3b.    the source of the release should be corrected (e.g., upright a container, shut off a valve, etc.) by a person who is trained and certified to wear the proper personal protection based upon the material released.\n    \n4. Solid released material or absorbent material used on a liquid release should be swept and/or shoveled (spark-proof shovel) into a compatible drum or container.  The container must then be closed, and labeled with an EPA Hazardous Waste Label.\n\n5. Release cleanup equipment should be decontaminated with water and the rinsate drummed and labeled for subsequent proper disposal.\n\n6. A \"Chemical Release Report\" must be completed by a Chemical Release Contact within 24 hours of the release incident and submitted to the Emergency Coordinator (refer to Attachment 4).\n\n7. The Emergency Coordinator will make all required verbal and/or written reports to appropriate regulatory agencies (see Agency Contacts above).\n\nIn general, only major chemical release releases (see definition above) will require agency notification.  Even in this case, if the release is 100% contained, the incident will not require agency notification.  If there is any doubt as to the need to notify, notification should be completed.  If any amount of a chemical enters the environmental media: air, sanitary sewer, storm sewer, or soil, the appropriate agency under the effected media should be verbally notified.  At that time, the agency contact should be asked if a follow-up written report will be necessary.  The Chemical Release Report should be used when notifying and of the agencies.\n\n\nValley Sweet                                        Page 10\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\n4.    Major Chemical Release Procedures:\n\na. All persons working within 50 feet of the release should be evacuated.\n\nb. A 2500 square foot \"caution\" area should be established "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 12333,
      "SummaryText": "around the release with yellow caution tape.\n\nc. Injured employees should be administered to outside of the caution area.  No employee should enter the caution area.  Only Chemical Release Responders may administer to unconscious person(s) inside the caution are, only if proper personal protective equipment is worn.\n\nd. Mechanical ventilation and fans serving the caution area should be shut off by a Chemical Release Responder.\n\ne. Ignition sources outside the caution area should be shut off.  Ignition sources inside the caution area may only be shut off by a Chemical Release Responder.\n\nf. Absorbent material or release pillows should be placed at a safe distance from a liquid release but strategically to minimize lateral migration of the release and to prevent the release from entering a storm or sanitary sewer.\n\ng. A Chemical Release Response Contractor must be called to respond, control, and clean up the release.\n\nh. After the Contractor is finished, move any of the drums or containers of release cleanup materials left by the Contractor to the Storage area.\n\ni. A Valley Sweet Chemical Release Report must be completed by a Chemical Release Responder and must be submitted to the Emergency Coordinator within 24 hours of the release incident.\n\nj. The Emergency Coordinator will make all required verbal and/or written reports to appropriate regulatory agencies.\nValley Sweet                                        Page 11\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nResponsibilities:\n\n1. Chemical Release Contacts (First Responder: Awareness Level)\n\na. Respond to a chemical release that occurs in their department and determine if the chemical release is minor or major.\n\nb. Notify the Emergency Coordinator immediately of the chemical release.\n\nc. Complete a Valley Sweet Release Report and submit to the Emergency Coordinator within 24 hours of the incident.\n\nd. Receive training adequate in length and quality to ensure correct response in the event of a chemical release.\n\n2. Supervi"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 12333,
      "SummaryText": "sors\n\na. Ensure all Valley Sweet release prevention mechanisms are adhered to by department employees.\n\nb. Oversee the proper response to a minor chemical release.\n\n3. Emergency Coordinator and Chemical Release Responders\n\na. Audit department chemical release prevention mechanisms.\n\nb. Receive at least eight hours of initial and annual training to demonstrate competency in the following areas:\n---    Knowledge of basic hazard and risk assessment techniques.\n---    Know how to select and use proper personal equipment required.\n---    An understanding of basic hazardous materials terms.\n---    Know how to perform basic control, containment, and/or confinement operations and rescue injured or contaminated persons within the capabilities of the resources and PPE available.\n---    Know how to implement basic equipment, victim, and rescue personnel decontamination procedures.\n---    An understanding of the relevant standard operating procedures and termination procedures.\n---    Respond in a defensive fashion to major chemical releases.\n---    Complete a Release Report within 24 hours of an incident.\nValley Sweet                                        Page 12\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nc. Notify regulatory agencies regarding a chemical release at Valley Sweet when appropriate (see Attachment 6 for a list of agencies that should be notified).\n\nd. Assist in identifying and monitoring appropriate chemical release prevention mechanisms.\n\ne. Provide specific chemical release prevention and response training to Chemical Release Contacts and general chemical release prevention and response training to all other employees in conjunction with Valley Sweet hazard communication training.\n\nf. Coordinate offsite training for Chemical Release Contacts.\n\n4. Employees\n\na. Follow Valley Sweet's chemical release prevention procedures.\n\nb. Notify the Emergency Coordinator immediately of any chemical release.\n\nc. Do not conduct any additional chemical release response activities.\n\nSection3F:    Emergency Me"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 12333,
      "SummaryText": "dical Plan\n\nIn any emergency situation, remain calm and try to reassure others.  Inform the Receptionist and Emergency Coordinator about the nature and severity of injuries in your area.\n\nIf you are uninjured:\n\n1. Offer immediate aid to the injured.\n\n2. Assist the injured that can be moved to the treatment area identified in the evacuation plan.\n\n3. If you are trained in CPR and/or first aid, report immediately to the treatment area.\n\nIf you are injured but mobile:\n\n1. Report to a first aid station away from emergency area.\n\n\nValley Sweet                                        Page 13\nHazardous Materials Management Plan            Date of Preparation: 6/99\n  \n    If you are immobile:\n\n1. Remain calm.\n\n2. Conserve your strength.\n\n3. Call for help until it arrives.  Remember that help is on the way.\n\nThe location of a first aid kit, emergency shower / eyewash and other emergency equipment/supplies is depicted in Figure 2.\n\nA list of medical and other emergency response supplies is provided in Attachment 7.\n\nBelow lists the medical emergency treatment method for hazardous chemicals used at Valley Sweet:\n\nChemical name            Medical treatment method\n\n1.    Anhydrous Ammonia            Remove victim from contaminated \narea.  Rescuers should be properly protected.  Keep injured warm and quiet, lying flat.  If breathing has stopped, give artificial respiration.  Administer oxygen, if available.  Keep breathing passages open.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nValley Sweet                                       Page 14\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nSection 5:    TRAINING PLAN\n\nGeneral:\n\nValley Sweet maintains an annual EH&S Training and Compliance Calendar (Refer to Attachment 8).  Training is conducted by Valley Sweet personnel and/or qualified consultants.  Employee training is documented with Valley Sweet's Employee Training Sign-in sheet (Attachment 9).  Valley Sweet employees receive the following training associated with hazardous materials.\n\n1. Employees receive initial and annual Hazard Communication training in the chemical propert"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 12333,
      "SummaryText": "ies, hazards and health effects of hazardous materials used in their job or encountered on the site, including:\n\na. Notification and Evacuation procedures\nb. Safe handling and storage of hazardous materials\nc. Proper use and care of personal protective equipment\nd. Release Response procedures\ne. Locations and use of emergency equipment and supplies\nf. First aid procedures\ng. Shutdown of operations\nh. Fire and Earthquake safety\ni. Hazardous Waste Management\nj. Lockout/Tagout\nk. Audiometry & Hearing Conservation\nl. Operation Shutdown\nm. Forklift training\nn. Supervisor Safety\n\n2. Proper evacuation procedures for individuals to take during fire, earthquake, and other emergency situations are provided by the area supervisor at the time of hire.\n\n3. Employees who respond to chemical releases as Chemical Release Contacts receive at least two hours of training on an initial and annual basis.\n\n4. Employees who respond to chemical releases as Chemical Release Responders receive at least 8 hours of training on an initial and annual basis.\n\n5. Facility emergency response and evacuation drills are conducted annually.\n\n\n\n\nValley Sweet                                        Page 15\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nDocumentation:\n\nAt Valley Sweet, EH&S training records are maintained in Personnel files at the front office.  Records are available for review by employees by appointment during normal business hours.  Information maintained includes a description of the type and amount of training received, names of attending employees, and signed and dated verifications of training.  Training records are retained for no less than three years.\n\nSection 6:    EH&S INSPECTION PROCEDURE\n\nIn order to identify and correct unsafe work conditions and work practices, daily, weekly, and periodic workplace environmental, health & safety inspections and assessments are conducted by Valley Sweet OSHA and EPA regulations, Valley Sweet standards, general industry standards, workplace experience an"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 12333,
      "SummaryText": "d other relevant sources of information provide guidance to assist with inspections and assessments.  The types and frequency of workplace inspections are outlined below.\n\nPREVENTIVE MAINTENANCE PROGRAM\n\nDAILY MAINTENANCE\n1. Check temperatures\n2. Check suction and discharge pressure\n3. Defrost rooms and check ammonia valves and guages\n4. Check chemical for condensers\n5. Check oil on compressors\n6. Check for overall general housekeeping\nWEEKLY MAINTENANCE\n1. Grease condenser bearings and motor bearings\n2. Check valves and pipes on roof\n3. Check condenser filter screens\nMONTHLY MAINTENANCE\n1. Inspect the self contained breathing apparatus as per inspection sheet.\nQUARTERLY\n1. Sprinkler system tested and serviced\nYEARLY MAINTENANCE\n1. Drain oil from accumulators (all rooms).\n2. Clean condensers and check sprinklers.\n3. Check defrost lines and sprinklers.  Clean and replace sprinklers as needed\n4. Inspect and repair walls and door inside storage where needed.\n5. Grease all fans, doors, and motors.\n6. Clean floors and paint lines.\n7. Paint pipes, label as needed.\n8. Have fire extinguishers serviced.\nValley Sweet                                        Page 16\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nMiscellaneous\n\nInspections are conducted by the Safety Manager whenever new processes, substances, procedures or equipment are introduced into the workplace, whenever new health and safety information is received, or if previously unrecognized hazard(s) are introduced / identified at the facility.\n\nDocumentation\n\nValley Sweet maintains records of environmental health & safety inspections, regulatory agency inspections, and physical and any chemical employee exposure monitoring for a minimum of three years.  Records are maintained in Supervisor and Personnel files.\n\nSection 7:    HAZARDOUS WASTE\n\nValley Sweet does not currently generate hazardous wastes and therefore a hazardous waste management plan is not required.\n\n\nFIGURE 1\nGENERAL VICINITY MAP\n\n                \n\n\n\n\n\nValley Sweet                                       "
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 12333,
      "SummaryText": " Page 17\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\nFIGURE 2\nDETAILED SITE PLAN - A\nFIRE PROTECTION - B\n\n\n\n\n\n\n\n\n\n\n\nValley Sweet                                        Page 18\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nFIGURE 3\n\nEVACUATION ROUTES\n\n\nValley Sweet                                        Page 19\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\n\nATTACHMENT 1\nHAZARDOUS MATERIAL INVENTORY STATEMENT\n\n\n\n\nChemical or Trade Name*    --    Anhydrous Ammonia\n\nManufacturer            --    LA Rouche Ind.\n\nHazardous Component(s)**    --    Anhydrous Ammonia\n\nPhysical State            --    Gas\n\nStorage Location    --    Above ground tank in compressor \n        room.\n\nQuantity Range            --    24,500 to 25,150 lbs.\n\nMaximum Quantity Stored    --    25,150 lbs.\n\nMSDS Attached            --    Yes    (X(        No     (  (\n\n\n\n\n*    Refer to attached Material Safety Data Sheet (MSDS) for further information.\n\n**    Only major hazardous components listed.\n\n\n\n\n\n\n\n\n\n\nValley Sweet                                        Page 20\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 2\nBASIC ROOM PLAN\n\nBelow are procedures to be followed by all Valley Sweet employees to ensure safe handling of all chemicals stored and used at Valley Sweet facility.\n\nProduct Name\n\n1) Anhydrous Ammonia\n\nAmount of storage:\n\n    25,150 lbs.\n\nProper storage method\n\n    Secure above ground tank\n\nProper handling method\n\n    Ammonia system only charged by supplier.\n    Never handled by any employee.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nValley Sweet                                        Page 21\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 3\nHAZARDOUS MATERIAL CONTAINMENT PLAN\n\nThe information outlined below specifies Valley Sweet methods and procedures for proper containment of hazardous materials stored at Valley Sweet's facility.\n\nChemical *\n1) Anhydrous Ammonia (G)\n\nHow Contained\nAbove ground tank\n\nPredicted direction of release **\nAtmosphere in southeast direction\n\nNeutralization Method\nStop discharge; carbon dioxide, dry chemical or water spray extinguishers\n\nContainment Points\nSource (at tank)\n\nMethod of "
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 12333,
      "SummaryText": "Checking Hazard Potential\nDraeger Tubes\n\nClean up Procedure\nNA\n\nColor code and/or Labeling\nNFPA\n\nEmergency Standby Equipment\nTank valve shutoff equipment\n\n\n* Gas = G        Liquid = L        Solid = S\n  \n** (i.e. storm drain, sewer, atmosphere)\n\nNA - not applicable\n\n\n\n\nValley Sweet                                        Page 22\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 4\nCHEMICAL RELEASE REPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVALLEY SWEET CHEMICAL SPILL REPORT\n\n\nDate of Incident:                 Department:                     \n\nHazardous Substance Spilled:                                 \n\nVolume or weight spilled:                         gallons        pounds\n\nDid the spill enter any of the following (circle):\n\nSanitary sewer              Storm sewer          Soil          Other:                 \n\nWas 100% of the spill or spill recovered?    Yes    No\n\nIf no, how much of the chemical was lost?               Gallons     or    Pounds\n\nDescribe when, how and where the spill or spill incident occurred and the response steps taken by Valley Sweet and/or a contractor:                                                                                                                                                                                                                                                                             \n\nDescribe how this type of incident may be prevented in the future:                                                                                                                                                                 \n\n\n\n                                                \nPerson Completing Report                            Date\n\nEMERGENCY COORDINATOR USE ONLY\nAgency Contacts\n\nAgency                         Contact Name                     \nPhone                     Date                 Time             \n\nWritten Report                                         \n\n\nValley Sweet                                        Page 24\nHazardous Materials Management Plan            Date of Preparation: 6/99\nATTACHMENT 6\nAGENCY NOTIFICATION LIST\nREGULATORY AGENCY CONTACTS\n\nIn general, only major chemical spills (see definition) will require agency notification.  Even in this case, if the spill is 100% contained at Valley Sweet, the incident will not require agency notification.  If there is any doubt as to the need to notify, notification should be completed.  If any amount of a chemical enters the environmental media listed in the table below, the agency listed under the effected media should be verbally notified.  At the time, the agency contact shou"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 12333,
      "SummaryText": "ld be asked if a follow-up written report will be necessary.  The Valley Sweet Chemical Spill Report should be used when notifying any of the agencies.\n\n    AGENCY        PHONE    AIR    WATER    STORM    SOIL\n                      NUMBER          WELL      POND\n\n  San Joaquin Valley          (805) 861-3682       X\n  Air Pollution Control\n  District\n  \n  Tulare County         (559) 733-6441       X           X             X           X\n  Environmental Health\n  Services\n  \n  Tulare County               911  or           X                              X\n  Fire Department         (559) 734-7477\n  \n  Tulare County         (559) 685-2530       X\n  Office of \n  Emergency Service\n  \n  Tulare County        911 or           X\n  Sheriff's Department          (559) 733-6211\n  \n  Department of Toxic          (800) 698-6942       X                 X           X\n  Substances Control\n  \n  Regional Water           (559) 445-5116               X             X\n  Quality Control Board\n  \n  California Office of          (800) 852-7550       X                 X           X\n  Emergency Services\n  \n  National Response          (800) 424-8802       X                 X           X\n  Center\n  \n  California                  911 or\n  Highway Patrol          (559) 734-6767\nValley Sweet                                        Page 25\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 7\nMEDICAL & EMERGENCY RESPONSE SUPPLIES\n\n1. First Aid:\n\na. First aid kits\nb. Cold packs\n\n2. Equipment:\n\na. Flashlight & batteries\nb. Radio & extra batteries\nc. Self contained breathing apparatus\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nValley Sweet                                        Page 26\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 8\nEMPLOYEE HEATLH & SAFETY TRAINING & COMPLIANCE CALENDAR\n\nDATE:        FOOTNOTES:\n\nMay 1999    1.  Annual hazard communication training provided to all employees.  This training includes instructions on the proper use, and handling and storage of hazardous materials.  Also, training is provided on the proper use of personal protective equipment.\n\nJune 1999    2.  Annual drill to test emergency preparedness procedures.\n\nApril 1999    3.  Provided to employees assigned as emergency personnel.\n\nApril 1999    4."
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 12333,
      "SummaryText": "  Annual employee training in first aid and CPR procedures.\n\nApril 1999    5.  OSHA mandated annual training form all employees who wear respirators at Valley Sweet.\n\nMay 1999    6.  Annual training of employees in proper procedures to follow in the event of a fire and on how to use a fire extinguisher.\n\nMay 1999    7.  Annual employee training in earthquake preparedness.\n\nJune 1999    8.  Mandatory training for forklift operators, provided to each forklift operator every two years.\n\nMay 1999    9.  Supervisor training in such subjects as job hazard analysis, machine guarding, accident investigation and prevention.\n\nJune 1999    10.  Annual training for locking out equipment prior to maintenance or equipment changes.\n\nApril 1999    11.  Annual employee training in location and use of emergency equipment and supplies.\n\n\n\n\n\n\n\n\nValley Sweet                                        Page 27\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 9\nEMPLOYEE TRAINING SIGN-IN SHEET\n\n\n\nValley Sweet                                        Page 28\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 10\nHOUSEKEEPING & SAFETY INSPECTION CHECKLIST\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVALLEY SWEET HOUSEKEEPING & SAFETY CHECKLIST #10\n\nDATE:        DEPARTMENT:            SUPERVISOR:    \n\nPlease complete \"Findings\" column based upon your observations during the inspection.  Recommend corrective action(s) in the second column and fill in the date the corrective action(s) were implemented in the last column.\n\nHOUSEKEEPING\n\n  ITEM                    FINDINGS       CORRECTIVE        DATE\n                            ACTION(S)       COMPLETED\n\n1. Main aisles and\nexits unobstructed.\nExisting lights lit.\n\n2. Unused materials\nand equipment stored\nin assigned, safe\nlocation.\n\n3. Reasonable effort to\nkeep area clear of trash,\ndirt, water, oil, etc.  Floors\ncleaned at end of shift.\n\n4. Dumpsters, trash barrels\nand waste baskets not\noverflowing.\n\n5. Offices organized and\nclean.\n\n6. All equipment in good\ncondition, clean and not in\nneed of painting.\n\n7. Facility in good cond"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 12333,
      "SummaryText": "ition,\nclean and not in need of\npainting.\n\n\n\n                            Inspected by:                \n\n\n\n\nValley Sweet                                        Page 29\nHazardous Materials Management Plan            Date of Preparation: 6/99\n\nATTACHMENT 11\nHAZARDOUS MATERIAL STORAGE INSPECTION CHECKLIST\n\n\n\n\n\n\n\n\n\n\n\n\n\nVALLEY SWEET\n\nSCBA INSPECTION / MAINTENANCE LOG\nMONTHLY INSPECTION\n\n\nEQUIPMENT ID NO:                 \n\n\n   AREA    DATE            INSPECTOR            COMMENTS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMONTHLY INSPECTION CHECKLIST\n\n\n0. \n1. FACE PIECE\n\n2. EXHALATION VALVE\n\n3. HEAD HARNESS\n\n4. FACE-PIECE HOSE\n\n5. BODY HARNESS\n\n6. REGUALTOR\n\n7. HIGH PRESSURE HOSE\n\n8. ALARM\n\n9. CYLINDER PRESSURE\n\n10. CLEANING\n\n11.                  \n\n12.                  \n\nHAZARDOUS MATERIALS STORAGE WEEKLY INSPECTION CHECKLIST #11\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nX =   In Compliance                    - =    Requires Attention     Inspect weekly,   noting deficiencies and corrective action(s)\nAmmonia tank secure\nAmmonia tank signed with NFPA sign\nAmmonia tank shutoff valve operational\nEmergency phone # and phone loc. Posted:  phone tested & works\nFire extinguisher avail. & charged\nFirst aid supplies avail. & stocked\nCorrection Actions\n(what & when)\n\n\n\n\n\n\n\n\nInspection Date\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInspected by:\n\n\n\n        JUNE, 1999\n\n"
    }
  ]
}