{
  "FacilityID": 12387,
  "FacilityName": "Longview Regional Water Treatment Plant",
  "FacilityStr1": "101 Fishers Lane",
  "FacilityStr2": null,
  "FacilityCity": "Longview",
  "FacilityState": "WA",
  "FacilityZipCode": "98632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53015",
  "LEPC": "Cowlitz County LEPC",
  "FacilityLatDecDegs": "46.175",
  "FacilityLongDecDegs": "-122.916667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "NW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Longview Water Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Longview",
  "OperatorStr1": "101 Fishers Lane",
  "OperatorStr2": null,
  "OperatorCity": "Longview",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98632",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136426",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-01-05 00:00:00",
  "DeRegistrationEffectiveDate": "2013-04-08 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 46.1625,
  "FRS_Long": -122.9867,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16582,
      "AltID": "chlorine",
      "FacilityID": 12387,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 20671,
          "ProcessID": 16582,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 16995,
          "ProcessID": 16582,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8674,
              "Process_NAICS_ID": 16995,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "chlorine cylinders, heaters, control valves",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-21 00:00:00",
              "PreStartupReviewDate": "1999-06-21 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Chlorine",
              "_chemicals": [
                {
                  "PrimaryKey": 11889,
                  "PreventionProgram3ID": 8674,
                  "ProcessChemicalID": 20671
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12387,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "LEPC",
    "CoordinatingAgencyPhone": "3605773315",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "WAC -296-67-009"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12387,
      "SummaryText": "RISK MANAGEMENT PLAN\n\n\n\n\n\n\n\n\n\n\nDear Employees:\n\nWe take our safety and yours seriously.  We try to provide the best service to our customers in the safest and most reliable manner.\n\nNow we are taking safety one step further by developing a comprehensive Risk Management Plan for our facility.  We will share the plan with local officials and the public.\n\nThe purpose of our Risk Management Plan, as required by the EPA, is to identify, report and communicate potential accidental releases of chlorine  stored and utilized at our site.  Since we store more than 2500 pounds of chlorine at this facility, we must submit a Risk Management Plan to the EPA by June 21, 1999.\n\nOur hazard assessment, accident prevention and emergency response are important to you and our community.  We know you will want to be a part of developing our plan and communicating it.  Your interest and involvement will be much welcomed.\n\nThroughout our communication process you will be included in all communications.  For questions, suggestions, or to become involved, please contact:\n\n\n\n\n\nLARRY D. MESNEAK                    VIC RICHARDS\nSuperintendent, RWTP                    Safety Coordinator, RWTP\n577-3360                            577-3360 \n\n \nRISK MANAGEMENT PLAN\n\n\n\nCHLORINE BACKGROUND\n\n\n\nFor nearly a hundred years, chlorine and chlorinated compounds have been used safely, effectively and economically to ensure a clean and safe water supply.  Today, nearly every product we depend on to make our lives healthier, safer and more enjoyable benefits in some way from chlorine.  Aside from its use in 98 percent of U.S. water supplies that are disinfected, chlorine is involved in the production of:\n\n*  85 percent of all pharmaceuticals\n\n*  95 percent of all crop protection chemicals\n\n*  25 percent of medical devices in hospitals, from blood bags to X-ray film\n\nUSE PERCENTAGES\n\nOf the 14 million tons of chlorine produced in North America every year:\n\n*  35 percent is used in the production of other important chemicals, everything from pharmaceuticals to dis"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12387,
      "SummaryText": "infectants.\n\n*  40 percent is used to produce vinyl (polyvinyl chloride or PVC) and other plastic materials such as polyurethanes and polycarbonates.\n\n*  7 percent is used to produce solvents for metal working, dry cleaning, and electronics.\n\n*  7 percent of chlorine is used for pulp and paper bleaching to dissolve impurities, and remove unpleasant odors, and produce stronger paper products more efficiently.\n\n*  5 percent is used in water and waste water purification.\n\n*  6 percent is used in miscellaneous processes.\n\n\n\n\n\nWATER DISINFECTION\n\n*  In 1908, Jersey City, N.J. began to use chlorine on a large scale to treat its water.  Soon after, other major cities around the country began to purify water with chlorine.\n\n*  After chlorine's introduction into public water supplies, deaths from typhoid in the United States dropped dramatically from 25,000 in 1900 to less than 20 in 1960.\n\n*  Today, chlorine is used in 98% of all water systems that disinfect, and incidences of diseases such as cholera, typhoid and dysentery are practically non-existent.\n\n*  The only water disinfection method that cleans and protects all the way to the tap, chlorination is credited with increasing American's life expectancy by more than 50 percent.\n\n\n\nCHLORINE IS VITAL TO OUR HEALTH IN OTHER WAYS, TOO.\n\nRecreation:\nChlorine compounds provide disinfection for swimming pools and Jacuzzis, keeping our recreational waters free of, and safe from, infectious microorganisms.\n\nMedications:\nChlorine is  integral to the manufacture of 85 percent of all pharmaceuticals, including drugs that treat heart disease, hypertension, ulcers, leukemia, arthritis, pneumonia, allergies and symptoms of the common cold.  In fact, \"40 percent of infections, including malaria, respond only to Vancomycin, an antibiotic that requires chlorine for its production.\" (Fortune Magazine, September 5, 1995)\n\nFoods:\n95 percent of all crop production relies on chlorine-based agricultural chemicals, which ensure a wide selection "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12387,
      "SummaryText": "of low-cost, healthful grains and produce, as well as greater yield per acre.  The disinfection of produce and meats through every stage of processing also requires chlorine.  And, chlorine is also essential for the manufacture of the polyvinyl chloride we need for the safe packaging and storage of meat and perishable food products.\n\nCleaning:\nChlorine is used to make a wide variety of surface disinfectants and cleaning products for household and hospital use as well as for restaurant sanitation, food processing and many other industrial applications.\n\n \nHAZARD ASSESSMENT\n\n\nA hazard assessment is primarily an evaluation of the off-site consequences of potential release scenarios -- this is something that has not been done before.  \n\nKeep in mind that the hazard assessments are tools for the community to use for emergency planning purposes.  In that context, they will provide helpful information for fire and police agencies to better understand and plan for potential emergencies.\n\nThe assessments that are undertaken use computer models, recommended by EPA, to determine the impact of potential releases of hazardous chemicals.  Again, these are hypothetical situations to be used for planning purposes.  \n\nThe first element of the hazard assessment is what is called a worst case scenario.\n\nThis worst case scenarios is an estimate of the impact of a major catastrophic release on the surrounding community.  They are based on computer models or information provided in EPA tables.  \n\nTo help emergency planners have a full picture of the risks from chemical releases, the rule requires you to assume that there are absolutely no safeguards in place to respond to or prevent the release.  It also requires you to assume very stable weather conditions.  \n\nAgain, the purpose here is to paint a picture of what might happen for planning purposes.  It in no way is meant to predict what would actually happen.  It simply gives an indication of what may happen so that emergency planners c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12387,
      "SummaryText": "an understand the outer boundaries for planning purposes.  \n\n\n Vicinity Map\n **  Worst Case Scenario\n\nFor Longview our most toxic chemical on site is chlorine and the largest quantity is three one-ton cylinders.\n\nNo safeguards are in place.\n\nFire erupts in chlorine containment area.\n\nLead plugs melt in a one-ton cylinder\n\nChlorine gas is released.\n\nThe distance to the end-point of  3 parts per million (considered a safe level)  is 1.3 miles shown on following model.\n\nThe health effects are inhalation or breathing.\n\nIt is important to understand how unlikely it is that a chlorine lead plug will melt when in a containment vessel.  First, there must be a fire.  Second, the fire must get hot enough to breach the containment vessel.  Once the containment vessel is breached, the fire must then get the lead plug hot enough for it to melt.  \n\n \n\n\n\n\n **  Alternative Release Scenario\n\nTo add even more information for emergency planning purposes, the rule requires the development of more realistic scenarios.  \n\nThese assessments allow you to make assumptions that make the scenario more likely to reflect an actual situation.  For example, in the computer model, you can factor in emergency response safeguards, as well as reflect more realistic weather patterns for the area.  \n\nUsing this information, emergency planners are able to understand more clearly what could happen if an accidental chemical release occurred.  \n\nA chlorine feed line is ruptured.\n\nChlorine gas is released for a period of ten minutes.\n\nThe distance to the end-point of 3 parts per million ( considered a safe level)  is .3 miles shown on following model.\n\nAgain, inhalation or breathing may become difficult before the fumes reach 3 parts per million.\n\n \n\n\n \nACCIDENT PREVENTION\n\n\nThe Longview Regional Water Treatment Plant is in the process of converting from our present chlorine storage system to two (2) total containment vessels in operation with nitrogen pressure to seal in chlorine in the event of a leak.  T"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12387,
      "SummaryText": "his improvement vastly improves the odds that a chlorine release will NOT occur.  A release with the new system would require the simultaneous failure of two independent systems:  the primary chlorine storage vessel and the nitrogen pressure system.  \n\nThe following accident prevention steps are performed on a regular basis:\n \n^ Inspections of vessels are visually done on a regular basis by operators during rounds.\n \n^ Close inspection of vessels, including gaskets, o-rings, guages and lines are done each time a vessel is opened.\n \n^ The entire chlorine system goes through a yearly inspection by a certified technician.\n \n^ Leak tests are done each time a new one-ton cylinder is placed into vessel.\n\nAdditional prevention measures:\n\nA chlorine leak detection alarm is installed on the system.\n\nSpare parts, such as o-rings, gaskets, piping and valves are kept readily at hand.\n\nProtective clothing, self-contained breathing apparatus and leak repair kits are kept a safe distance away from any possible leaks for easy access.\n  Current Chlorine Process Schematic Pictured here \n\n         ANALYSIS WORKSHEET        \n                \n                \nPROBLEM    CAUSES    CONSEQUENCES    SAFEGUARDS    ACTION\nNO CHLORINE FLOW    NOT TURNED ON AT START    NO CHLORINE REACTION    AWARENESS AND ALARMS    TURN ON\nNO CHLORINE FLOW    POWER FAILURE    NO CHLORINE REACTION    INOPERTIVE    RESTORE POWER\nNO CHLORINE FLOW    VALVE STUCK AT STARTUP    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    TROUBLESHOOT\nNO CHLORINE FLOW    PLUGGED LINE    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    CLEAN OR REPLACE\nNO CHLORINE FLOW    BROKEN LINE    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    REPAIR OR REPLACE\nNO CHLORINE FLOW    ROTOMETER STUCK    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    CLEAN ROTOMETER\nNO CHLORINE FLOW    BROKEN WATER LINE    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    FIX OR REPLACE\nNO CHLORINE FLOW    STUCK OR BROKEN VALVE    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    FIX OR REPLACE\nNO CHLORINE FLOW    EMPTY TANK    NO CHLORINE REACTION    MAINTENANCE AND ALARMS    CHANGE CHLORINE TANKS\nTOO HIGH"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12387,
      "SummaryText": " CHLORINE    STUCK ROTOMETER    TOO HIGH CHLORINE    MAINTENANCE AND ALARMS    CLEAN ROTOMETER\nTOO HIGH CHLORINE    OPERATOR ERROR    TOO HIGH CHLORINE    AWARENESS AND ALARMS    REDUCE SETTINGS\nCHLORINE LEAK    BROKEN LINE    NO CHLORINE TO SYSTEM    PREVETIVE MAINTENANCE    FIX OR REPLACE\n                \n                \n                \n                \n New Process Chlorine Schematic Pictured Here\n \nFIVE YEAR ACCIDENT HISTORY\n\nThere is a third aspect of the hazard assessment information included in the RMP rule -- reviewing a five-year history of certain accidental releases of the listed chemicals.\n\nThis is another planning tool for local emergency responders in that it helps to put in better context the likelihood of an accidental release.\n\n\nWe take pride in the fact that the Longview Water Treatment Facility has had no chlorine accidents in the last twenty years.\n\n EMERGENCY RESPONSE\nTRAINING\n\n\nAll the employees at the Longview Regional Water Treatment Plant have had chlorine classes in the use and handling of chlorine, including the effects of and how to administer first aid.  Each employee has had at least six years experience \nin the handling of chlorine, with an average of eighteen years experience.\n\nIn past years we have had  on-site training with the fire department and Hazmat teams.\n\nLet's assume that in spite of the six layers of protection, previously described to prevent accidents, an accidental release of a chemical occurs.  \n\nWhat actions will be taken to reduce the likelihood of someone in the community being at risk?  \n\nThe first line of defense -- in the event of an accidental releases -- is the facility.  \n\nAt the same time that the facility activates its emergency response system, it notifies local authorizes through the 911 communications system.  Local law enforcement, fire fighters and the Department of Emergency Management are alerted to handle any off-site work.  \n\nAn Incident Commander then assumes the responsibility of handling and coordination the overall response to the emergency.  The incident commander is the Wash"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12387,
      "SummaryText": "ington State Patrol.  \n\nThe first action of the Incident Commander will be assess, with the facility, the extent of the release.  Based on the seriousness of the incident, there are a number of actions that might be taken.  \n\nFor example, the Incident Commander may initiate traffic control measures to limit access to the danger area.  This could include blocking of roads or highways.  \n\nThe Incident Commander will also make sure that all agencies, including the Washington State Department of Ecology, the Cowlitz County Department of Emergency Management, fire fighters and police, are kept in the communications loop.  \n\nThere are other actions the Incident Commander might take.  In an extreme emergency, it may be necessary to evacuate a certain area that is in the path of a release, assuming there is adequate time available to complete the evacuation.  Also, shelter in place may be ordered if there is no time for evacuation.  \n\n EMERGENCY RESPONSE\n\nWHAT TO DO\nSHELTER-IN-PLACE\n\n\nShelter in place covers one action an individual or family may need to take in the event of a chemical emergency.\n\nIn general, barring different instructions, the best thing for an individual or family to do is to shelter in place.  The key elements of this strategy are:  \n\n7 Going indoors\n7 Closing windows and doors\n7 Turning off outside air sources, such as air conditioners and furnaces\n7 Turning on the radio or television for information, and\n7 Avoiding the use of the phone.  \n\n\nSince chlorine is heavier than air, in the event of a chlorine release, go to the higher floors of your home.  \n\n \nCOMMUNITY EMERGENCY RESPONSE\n\n\nIn terms of understanding community emergency preparedness, the Local Emergency Planning Committee or LEPC is an important player.  This local group was established by federal law to develop and implement local emergency response plans for chemical emergencies.  \n\n*  It is a county-wide organization made up of:\n\n    Agencies charged with responding to emergencies, \n    Industrie"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12387,
      "SummaryText": "s handling hazardous chemicals,\n    Other groups which may be impacted by a release of a hazardous chemical\n    (like hospitals and schools) and \n    The General Public.\n\n*  In Cowlitz County, the Department of Emergency Management (DEM) has the legal responsibility to ensure the LEPC is functioning and that emergency response plans are in place.  The county is working toward a four-level system:\n\n    Emergency alert system (radio and television),\n    Reactivation of the Trojan sirens,\n    Tone-alert radios for key receptors and \n    Door-to-door notification.\n\n \nMANAGEMENT SYSTEM\n\n7 The City of Longview has assigned Larry D. Mesneak as the City's responsible person in charge of this Risk Management Plan.  Mr. Mesneak, as superintendent, is a certified operator with training in chlorine safety and handling.\n \n7 Under Mr. Mesneak's guidance, Victor L. Richards, Operator and Safety Coordinator for the RWTP, with training in chlorine safety and handling, in collaboration with Marsha Holborn, City of Longview Safety Coordinator, has put together this Risk Management Plan.  \n \n\n\n"
    }
  ]
}