{
  "FacilityID": 12389,
  "FacilityName": "Edwin Keith White Water Treatment Plant",
  "FacilityStr1": "200 Coffee Tree Road",
  "FacilityStr2": null,
  "FacilityCity": "Frankfort",
  "FacilityState": "KY",
  "FacilityZipCode": "40602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21073",
  "LEPC": "Franklin LEPC",
  "FacilityLatDecDegs": "38.170889",
  "FacilityLongDecDegs": "84.862167",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "AO",
  "LatLongDescription": "IP",
  "FacilityURL": "fewpb.com",
  "FacilityEmailAddress": "fewpb.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Frankfort Electric & Water Plant Board",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Chris Riddle",
  "OperatorStr1": "P.O. Box 308",
  "OperatorStr2": null,
  "OperatorCity": "Frankfort",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Riddle",
  "RMPTitle": "WTP Superintendent",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136499",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": "Kentucky",
  "ForeignZipCode": "40602",
  "ForeignCountry": "US",
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-02-17 00:00:00",
  "DeRegistrationEffectiveDate": "2010-08-01 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.2008,
  "FRS_Long": -84.8721,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16584,
      "AltID": "Potable Water Production",
      "FacilityID": 12389,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 16997,
          "ProcessID": 16584,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20673,
          "ProcessID": 16584,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 20674,
          "ProcessID": 16584,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520673,
          "ProcessID": 16584,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520674,
          "ProcessID": 16584,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12389,
      "SummaryText": "Executive Summary\n\nApplicable Policies\n\nU.S. Environmental Protection Agency (EPA) Risk Management regulations (FR 61 [120], p 31668 issued June 20, 1996, requires facilities that have regulated substances above the listed threshold quantities to develop a formal Risk Management Program and to register and submit a Risk Management Plan. The regulation also apply to an estimated 7,200 public and private water and wastewater treatment facilities that use significant quantities of chlorine or ammonia.\n\nThe rule was intended to lessen the number and severity of serious chemical accidents, such as the types that occurred in Bhopal, India (1984, 2,500 fatalities), and Pasadena, Texas (1989, 23 fatalities).  The EPA regulation applies to facilities that manufacture; process, use, or otherwise handle regulated extremely hazardous substances in quantities that exceed specified thresholds (40 CFR Part 68 Subpart C).\n\nPurpose\n\n As a goal, the Frankfort Electric & Water Plant Board is dedicated to minimize or prevent damages to human health and the environment in the event of an unplanned sudden or non-sudden release of hazardous material within the perimeter of the Edwin Keith White Water Treatment Plant. \n\nFacility Description\n\nThe Water Treatment Plant produces all the potable water for the City of Frankfort in Franklin County, and portions of Shelby, Scott, Anderson, and Woodford Counties. The plant is located on a 65 acre secured facility on Coffee Tree Road approximately 2 miles from downtown Frankfort. The major chemicals used in this process are chlorine, ammonia, 50% sodium hydroxide, hydrofluoslicic acid, ferric sulfate, cationic polymer, powered activated carbon, zinc orthophosphate and potassium permanganate.\n \nWorst Case Release Scenario(s) Chlorine & Ammonia\n\nThe following information provides worst-case distances to end points for the most common situations involved with chlorine and ammonia. All worst-case scenario results presented with this data assume Stabili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12389,
      "SummaryText": "ty Class F, wind speed of 1.5 meter per second, a temperature of 77: F, and are applicable for any relative humidity.\n\nChlorine\n\n\nWorse Case Chlorine: 1-Ton Container, catastrophic failure due to corrosion, impact, or construction defects.\n\nAmount Released and Duration of Release: 2,000-lb total release, 200 lb/min, and 10-minute duration.\n\nDistance to EndPoint: >6.2 miles\n\nModeling used: Cameo/Marplot/Aloha\n\n    Anhydrous Ammonia\n\nWorse Case Anhydrous Ammonia: Entire Contents of Bulk Storage Tank, catastrophic failure due to corrosion, impact, or construction defects.\n\nAmount Released and Duration of Release: 14,000-lb total release, 1400 lb/min, 10-minute duration.\n\nDistance to Endpoint: >1.1 miles\n\nModeling used: Cameo/Marplot/Aloha\n \nAlternative Case Release Scenario(s) Chlorine & Ammonia\n\nChlorine\n\nSeveral alternative release scenarios were modeled. However, the selected scenario involves a situation more appropriate to the process based on container, tubing, and pipe size. The most common incident involves connecting and disconnecting flexible tubing from the chlorine source.\n\nWorse Case Chlorine: 4-Ton Containers, catastrophic failure where as tubing ruptures, emptying 2-ton containers. System design would enable automatic switch over system to operate and release second bank of 2-ton containers\n\nAmount Released and Duration of Release: 8,000-lb total release, 1336 lb/min, 10-minute duration.\n\nDistance to EndPoint: >6.2 miles\n\nModeling used: Cameo/Marplot/Aloha\n\nAnhydrous Ammonia\n\nThe scenario chosen in this process was as follows. While attempting to refill bulk storage tank with 1 inch ID hose, hose ruptures and driver is unable to close valve on bulk storage tank. Valve on supply tank has not yet been opened.\n\nAlternate Release Anhydrous Ammonia: Entire Contents of Bulk Storage Tank, 1 inch ID hose ruptures during fill, releasing entire contents of bulk storage tank.\n\nAmount Released and Duration of Release: 14,000-lb total release, 560 lb/min, 25-minute dura"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12389,
      "SummaryText": "tion.\n\nDistance to EndPoint: >.65 mile\n\nModeling used: Cameo/Marplot/Aloha\n\n\n\n\n\n\n\n\n\n\n\nAccidental Release Prevention\n\nThe related Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) rules (29 CFR 1910.119), in effect since 1992, requires comprehensive management systems for the handling of highly hazardous chemicals.\n\nTo manage these risks, one must understand that risk is a combination of the expected likelihood and consequences of incidents that could result from a particular activity. Risk Management is the systematic identification, evaluation, and control of potential losses that may arise in an operation from future events such as toxic chemical releases.\n\nThe Risk Management Program should minimize the accidental releases of hazardous substances. Potential causes identified through the plan are as follows:\n\n7 Adequate operating or emergency procedures for plant personnel.\n7 Adequate training of operational and maintenance personnel.\n7 Identification of premature equipment failure due to inadequate maintenance, inspection.\n7 Equipment failure resulting from substandard materials.\n7 Process or equipment changes that could prove to be unsafe because of effects on safety systems.\n\nAccident History\n\nThis facility has not had a reportable release of a regulated substance.\n\nEmergency Response\n\nThe Treatment Plant has personnel on-site 16.5 hours/day, (0600 - 2330), 7 days/week the entire year. The Operator in responsible charge will be aware of the primary and alternate emergency coordinators in the emergency plan, as well as, all emergency procedures. The primary and alternate emergency coordinators are thoroughly familiar with all aspects of the facility emergency plan, all operations and activities at the facility, the location and characteristics of hazardous material, the location of all records within the facility and the facility layout.\n\n The Risk Management Manager ( or Alternate) is responsible for overseeing the response to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12389,
      "SummaryText": " help eliminate any potential threat to human safety or the environmental. The Risk Manager will assess the hazards of the emergency and contact state or local authorities when necessary. If response actions are needed, the Risk Manager will coordinate the emergency response team members. The Risk Manager is also responsible for documenting what actions were taken.\nThe Risk Management Manager will provide the effected LEPC's with a copy of the EAP and every update. The Risk Management Manager will arrange drills, or exercises from time to time with the LEPC to promote preparedness for effective response in the event of an accident.\n\nEmployees at the WTP are trained in the hazards of the chemicals. Employees have also been briefed on the physical characteristics (odor, color, etc) of the chemicals to aid in their recognition skills. If an employee discovers a leak or release of any size, they are instructed to notify a facility supervisor. If a supervisor is unavailable, the employee will contact the Risk Manager, or their alternate.\n\nPlanned Improvements\n\nThe Frankfort Electric & Water Plant Board continuously strives to reduce risk by review of available literature involving process control. As technology improves new mitigation or control equipment will be added to minimize risk factors. \n\n\n\n\n\n\n"
    }
  ]
}