{
  "FacilityID": 12399,
  "FacilityName": "East Side Wastewater Treatment Plant",
  "FacilityStr1": "71 Mercer Street",
  "FacilityStr2": null,
  "FacilityCity": "Oswego",
  "FacilityState": "NY",
  "FacilityZipCode": "13126",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36075",
  "LEPC": "Oswego County LEPC",
  "FacilityLatDecDegs": "43.469111",
  "FacilityLongDecDegs": "-76.498556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Oswego",
  "Company2Name": null,
  "CompanyDUNS": 77308765,
  "Company2DUNS": null,
  "OperatorName": "Gary Hallinan",
  "OperatorStr1": "71 Mercer Street",
  "OperatorStr2": null,
  "OperatorCity": "Oswego",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13126",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136621",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-05-12 00:00:00",
  "DeRegistrationEffectiveDate": "2013-04-03 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.469444,
  "FRS_Long": -76.498056,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16594,
      "AltID": "Chlorine Injection System",
      "FacilityID": 12399,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20684,
          "ProcessID": 16594,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17007,
          "ProcessID": 16594,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8685,
              "Process_NAICS_ID": 17007,
              "SafetyReviewDate": "1999-04-27 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-27 00:00:00",
              "TrainingReviewDate": "1999-04-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Mock-up",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-27 00:00:00",
              "EquipmentInspectionDate": "1999-05-18 00:00:00",
              "EquipmentTested": "Alarm System",
              "ChangeMgmtDate": "1999-06-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": "1999-06-01 00:00:00",
              "ComplianceAuditDate": "1999-04-27 00:00:00",
              "AuditCompletionDate": "1999-06-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-27 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-27 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-27 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11901,
                  "PreventionProgram3ID": 8685,
                  "ProcessChemicalID": 20684
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12399,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-27 00:00:00",
    "ERTrainingDate": "1999-04-27 00:00:00",
    "CoordinatingAgencyName": "Oswego Fire Department",
    "CoordinatingAgencyPhone": "3153432855",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12399,
      "SummaryText": "Executive Summary\n\n     Watts Engineers was subcontracted by Pratt and Huth Associates, LLP to provide the\nCity of Oswego a Level 3 Risk Management Program (RMP) and a Process Safety Management\n(PSM) Program in  accordance with 40 CFR 68 Risk Management Programs for Chemical\nAccidental Release Prevention and 29 CFR 1910.119 Process Safety Management for it's East\nSide Wastewater Treatment Plant (WWTP) located at 71 Mercer Street in the City of Oswego,\nNew York.  This evaluation was performed to assure that the facilities chlorine injection system\ncomplies with applicable regulations.  Key elements of the Risk Management Plan provided by\nWatts Engineers included:  a review of the accidental release prevention and emergency response\npolicies; a review of the regulated substance handled; a worst-case and an alternative release\nscenario; a review of the general accidental release prevention program and chemical-specific\nprevention steps; a review of the five-year accident history; a review the emergency response\nprogram; and participation in meetings and planning changes to improve the Process Safety\nProgram.   Watts Engineers will electronically submit this Risk Management Plan to the\nEnvironmental Protection Agency (EPA) by June 21, 1999.  \n\n     The Oswego East Side WWTP is located on the East Side of the City of Oswego between\nFort Ontario to the West and The Hammermill Paper Company to the East .  It employs fourteen\n(14) full-time employees.  Activities at the facility include the treatment of Wastewater, removal\nof solid waste, and the treatment of the water portion with the addition of chlorine gas before\nreturning the water to Lake Ontario.  \n\n     Chlorine is considered a regulated substance under the Risk Management and Process\nSafety Programs.  Characteristics of this gas or liquid include a pungent suffocating odor.  It is\nirritating to the mucous membranes.  When chlorine reacts with water, it forms hydrochloric\nacid.  Hydrochloric a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12399,
      "SummaryText": "cid gas is a toxic and corrosive fume.  The odor threshold for chlorine is\nabout 0.5 ppm.  Long term exposures to small concentrations or short term exposures to high\nconcentrations may result in adverse health effects.  Since chlorine gas is heavier then air,  It can\nsettle in low spots along the ground, therefore, care should be exercised while working in\nconfined spaces or low lying areas.  \n\n      The City of Oswego and senior management at the East Side Wastewater Treatment\nPlant have a strong commitment to the overall safety of it's employees, the public, and\nthe environment.  It is the policy of the East Side WWTP to train each employee and contractor\nabout safety considerations and emergency procedures in the unlikely event of a discharge.  A\nmaximum of fourteen thousand (14,000) pounds of chlorine gas in seven (7) tanks gas are either\nused or stored at one time at the facility.  Each tank contains two thousand (2,000) pounds of\nchlorine gas. The chlorine is composed of 99.5 percent chlorine and 0.5 percent inert ingredients. \nThe tanks are located on a storage pad behind the facility.  The storage pad is covered by a\ncanopy constructed of sheets of corrugated steel used for a roof.  The storage area is otherwise\nopen to air.  Chlorine is being delivered by truck and unloaded using a two ton crane onto a set of\nsteel rails where the gas tank is stored until it is ready for use. Each end of the rails are chocked\nto prevent the gas tanks from rolling.  Each gas tank has it's own valve guard to prevent objects\nfrom coming in contact with the valves.  \n\n     When a chlorine tank is needed, a two ton crane lifts the cylinder and is moved along a\ncrane rail through a set of double steel doors and into the tank scale room.  The tank scale room \nis fully enclosed.  The room is labeled chlorine hazard and emergency instructions are posted\nat the door.  Material Safety Data Sheets (MSDS) are located in a common hallway by the\noperators station.  \n\n      Within the t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12399,
      "SummaryText": "uperintendent will then be called and informed of the situation.  The Oswego Fire Department\nwill be in charge of the scene until they depart.  The approximate response time is less than five\nminutes. \n\n     Each member of the fire department is trained to at least HazMat Level I.  Two\nmembers are trained to the Technician Level, and eleven members are trained to the Specialist\nLevel.  The fire department has toured the plant to become familiar with what is on site, and\ndevelop different leak scenarios and practice emergency response measures.  In June of 1996, a\nHazMat drill with the Fulton Fire Department Haz-Mat Team was conducted.  The Haz-Mat\nTeam was activated.  The scenario staged was that a tank while being changed, started leaking. \nA full decon was set up.  The entry personnel used the chlorine kit to stop the tank from leaking. \nA full critique was conducted, and everyone at the scene reviewed the site.  On March  18, 1997,\nseven members of the Haz-Mat Team conducted a drill at the treatment plant.  This scenario was\na leak in the feed line.  The crew followed SOPs to fix the problem.  In August and September\n1997, all four fire department shifts conducted a mock drill of a worker overcome by chlorine\nwhile in a confined space.  Monitoring equipment,  rigging, and harnesses were used in the entry. \nThe fire department also has a chlorine tank simulator that they practice using an  A and a B\nchlorine tank repair kit on.\n\n     In the attached Risk Management Plan, toxic worst case and toxic alternative release\nscenarios were examined.  The scenarios were developed based on a two-thousand pound tank\nfilled with 99.5 percent chlorine.  The quantity released was the full two thousand pounds at a\nrelease rate of two hundred pounds per minute for ten minutes.  The meteorological factors were\nan atmospheric stability class of F and a wind speed of 1.5 meters per second.  The topography\nis urban.  The release is assumed to be at ground level.  The toxic endp"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12399,
      "SummaryText": "oint is 0.0087mg/L\n(3ppm).  These airborne concentrations are the maximum airborne concentrations that most\npeople can be exposed to for up to one hour without experiencing serious or irreversible effects\nor symptoms.  The calculated distance to endpoint is 1.3 miles.\n\n       The alternate release scenario for the chlorine injection system is one that is more likely\nto occur than the worst case scenario that reaches an end point off-site.  A chlorine leak caused\nby piping or valve failure is used in the alternative scenario.  A hole diameter of 1/4 inch on the\npiping or valve could theoretically occur.  The release rate for this scenario is 9 pounds per\nminute for 222.2 minutes.  The meteorological conditions were atmospheric stability class of D\nand a wind speed of 3.0 meters per second.  The topography is urban.  Again the toxic endpoint\nis 0.0087 mg/L (3 ppm).  The calculated distance to endpoint for the alternative scenario is 0.10\nmiles.  Methodology for determining distance to endpoints was done by referencing Risk\nManagement Program Guidance for Wastewater Treatment Plants (40 CFR Part 68). \n\n     The chemical of concern at the East Side Wastewater Treatment Plant is chlorine. \nChlorine can be toxic if not handled properly, however, the City of Oswego has a reasonable\nprogram in place to minimize the potential risks to a chlorine gas release.  A training program\ncombined with required recordkeeping, administrative controls, an effective emergency\nmanagement program, a local HazMat team, and an alarm system all address and meet the needs\nof the applicable regulations as defined under 40 CFR 68 and 29 CFR 1910.119.  The East Side\nWastewater Treatment Plant is currently evaluating improvements to their safety program.  They\nare investigating expanding the area that the chlorine sensors monitor along with visual, as well\nas audio alarms.  They are also taking this opportunity to improve and expand their training\nprograms, to make their employees further aware o"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12399,
      "SummaryText": "f the continued necessity for the safe use of\nchlorine."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12399,
      "SummaryText": "DEC Wastewater Operator Renewal Training\n     Hazard Communication Training\n     Confined Space Training\n     Respiratory Protection Program Training\n     Lock-out/Tag-out\n     Chlorine Tank Handling and Connections\n     Hearing Protection Program\n     Personal Protective Equipment Program\n    \nA record is kept of the training and placed in the training files.  The record contains the\nemployee or contractor name, title of course, date the course was held, name of the trainer,\nand results of any written, oral, or hands-on exam.   \n          \n     Accidents are also prevented by good administrative controls.  Standard Operating\nProcedures (SOPs) are kept on hand and are easily accessible to the workers.  Each operator is\ntrained in the applicable aspects of their job functions.  Those operators whose work is involved\nwith any aspect of the chlorine injection system are thoroughly trained in those specific SOPs. \nWorkers who need to be inside the chlorine tank scale  room or the chlorine injection room are \nprovided chlorine specific training.    \n\n     The City of Oswego East Side Wastewater Treatment Plant maintains an Emergency\nManagement Program.  In the event of a chlorine leak,  the operator will first notify the other\nemployees by sounding a general alarm and then determine the location and magnitude of the\nleak.  The magnitude is broken down to minor leaks; no yellowish gas is visibly present, and\nmajor leak; yellowish gas is visibly present.  For a minor leak, two trained operators will don\nSCBAs and protective gear and using the ammonia and water vapor bottle, find where the leak is\nand rectify the situation.  In the event of a major leak, the operator will call the Oswego Fire\ndepartment immediately and then notify the other workers in the plant of the major chlorine leak. \nThe operator will designate one location that is upwind from the chlorine leak for all personnel to\nassemble and remain until the fire department informs the operator otherwise.  The\ns"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12399,
      "SummaryText": "ank scale room is the chlorine injection room.  PVC tubing leads\nfrom the tanks into the chlorine injection system.  Here, the chlorine is injected into the\nwastewater through a series of valves and PVC tubes.\n\n       The chlorine tanks are stored on to a calibrated scale, designed to hold the four, two\nthousand pound tanks on roller trunnions. The chlorine containers have two valves in each head,\nWith the tank in a horizontal position and the valves in a vertical line, they deliver gas from the\nupper valve and liquid from the lower valve.  Five hundred (500) psig copper tubing fitted with a\nspecial adapter is used to connect the tank to the tubing system.  To connect the line to the\ncontainer, a valve protection hood and the valve outlet cap are removed.  A wrench is used to\nconnect the valving to the yoke.  A new gasket, which is supplied with the container is used each\ntime a connection is made.  As part of the Process Safety Management Program leaks are then\nchecked using ammonia vapor.  The appearance of white vapor indicates a chlorine leak.  A\nprotective suit, gloves, and a self-contained breathing apparatus (SCBA) are worn by the operator\nand a chlorine tank repair kit are kept on hand in the unlikely event of a chlorine leak while\nchanging tanks.  In the past five years, this facility has had no accidental releases of chlorine.\n\n     The City of Oswego East Side Wastewater Treatment plant maintains a general accidental\nrelease prevention program and chemical specific prevention steps.  As a part of this program, a\nchlorine alarm system is in place at the facility.  The chlorine detector and alarm are located on\nthe wall outside of the chlorine injection room.  The chlorine sensors are located in the injection-\ntank scale room.  In the event of a chlorine leak, a audio and visual alarm will sound in the\noperator's control room which is staffed twenty four (24) hours a day, seven days a week.  The\nmonitor is maintained and calibrated by an outside contractor."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12399,
      "SummaryText": "The calibration frequency is yearly\nas recommended by the manufacturer.  Literature and information on the alarm system is kept on\nfile by the superintendent of the facility.  All employees are trained yearly on the chlorine alarm\nsystem.  An operator receiving an alarm is to follow the emergency response plan.\n\n     The chlorine injection system itself operates under a vacuum produced by the injector\nmechanism.  Gas leaves the tank through a vacuum regulating valve.  A diaphragm senses\nvacuum on one side and atmospheric pressure on the other.  A spring loaded stem off the seat is\ndisplaced by force on the diaphragm.  Gas moves toward the flow control components and proper\nvacuum is maintained.  While under vacuum, gas enters the rotameter where it's flow is\nmeasured.  Gas flow rate is controlled by a v-notch orifice and either manual or automatic\npositioning of the v-grooved plug in it's ring.  A differential regulating valve is located after the\norifice which maintains the proper vacuum across the v-notch.  A pressure-relief valve vents to\nthe atmosphere if a malfunction occurs and pressure builds.  Gas is then dissolved in the water\nstream at the injector.  Check valves are in place and designed to close on injector shutdown. \nThere are no lines carrying gas under pressure in this system.  Loss of vacuum for any reason\ncauses the vacuum regulating valve to shut off the gas supply.  \n\n     The facility also complies with the Occupational Safety and Health Process Safety\nManagement rule.  Management believes that the training of it's employees and it's contractors is\ncrucial to maintaining a safe environment and continuing it's accident-free record for the chlorine\nsystem.  Training of all employees consists of a general orientation of the chlorine system first. \nThey are then instructed on the hazards and proper and safe handling of the chlorine system.  The\nfollowing courses are administered to all employees and refreshed yearly:\n\n     General Safety Training"
    }
  ]
}