{
  "FacilityID": 12417,
  "FacilityName": "Long Beach Groundwater Treatment Plant",
  "FacilityStr1": "2950 Redondo Ave",
  "FacilityStr2": null,
  "FacilityCity": "Long Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90806",
  "Facility4DigitZipExt": "2416",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.810556",
  "FacilityLongDecDegs": "-118.151389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ci.long-beach.ca.us/water/new.htm",
  "FacilityEmailAddress": "lbwd02@loop.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Long Beach Water Department",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Long Beach Water Dept",
  "OperatorStr1": "1800 East Wardlow Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Long Beach",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90807",
  "OperatorZipCodeExt": "4931",
  "FTE": 34,
  "OtherEPAFacilityID": "CAL000097946",
  "EPAFacilityID": "100000132901",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.80909,
  "FRS_Long": -118.15134,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16612,
      "AltID": "Chlorine Process",
      "FacilityID": 12417,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20703,
          "ProcessID": 16612,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17025,
          "ProcessID": 16612,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8695,
              "Process_NAICS_ID": 17025,
              "SafetyReviewDate": "1999-06-14 00:00:00",
              "PHA_Date": "1997-02-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-04-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-14 00:00:00",
              "TrainingReviewDate": "1999-06-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-14 00:00:00",
              "EquipmentInspectionDate": "1999-04-30 00:00:00",
              "EquipmentTested": "Chlorine Piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-14 00:00:00",
              "PreStartupReviewDate": "1999-06-14 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-30 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11911,
                  "PreventionProgram3ID": 8695,
                  "ProcessChemicalID": 20703
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12417,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Long Beach Fire Department",
    "CoordinatingAgencyPhone": "5625702500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 12417,
      "SummaryText": "control room.\n\nThe chlorine storage and chlorination rooms are also equipped with an emergency scrubber system that is automatically activated by chlorine sensors, set at 3 ppm.  The scrubber can neutralize up to six one-ton containers of chlorine to below 15-ppm concentration of chlorine.  \n\nIf a chlorine leak is detected: \n7 All normal exhaust fans shutdown.\n7 The motor operated louvers in the ventilation system are spring loaded to close automatically. \n7 The motor operated roll-up door to the chlorine storage room will close automatically\nThe scrubber re-circulating pump and the scrubber exhaust fans will activate.  Should one scrubber pump fail, the second stand by pump will be activated. Should both scrubber pumps fail, the scrubber fan will shut down so unscrubbed air will not be exhausted from the building. (Interlock added by contractor per recommendation from PHA).\n\nChlorine evaporators convert liquid chlorine flows under pressure from the one-ton containers to chlorine gas under vacuum.  A total of four liquid chlorine evaporators are present, each with a capacity of 10,000 pounds per day (ppd) with two of them held in stand-by mode.  Each evaporator is equipped with local temperature and pressure alarm indicators and a water level glass. \n\nTen vacuum-operated gas feed chlorinators are provided with remote ejectors.  The chlorinators measure out the required amount of chlorine for each application. The chlorine system is equipped with an automatic switchover system.  This system is provided for both the liquid and gas chlorine systems.  When the manifold pressure drops below a setpoint, a pressure switch will activate the circuitry that automatically switches from the \"near-empty\" bank of containers on one manifold to the other manifold with full one-ton containers.  The system is fully automatic with no manual resetting required.  The switchover valves are also connected to the emergency scrubber system, which, upon a chlorine leak, will close down. \n\nO"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 12417,
      "SummaryText": "Introduction\n\nChemicals are widely used in industry, in the home, in the environment.  They are transported on roads, water, and railways.  We at the Long Beach Groundwater Treatment Plant (Long Beach GWTP) use chemicals, too.  For example, we use chlorine to disinfect our water to provide drinking water.  Storing large qualities of chlorine can be a hazard.  We take our safety obligations in storing and using chlorine as seriously as we do take providing water.  The following document describes what could happen if there were to be an accident, the steps we take every day to ensure a safely operating plant, and what to do in event of an emergency.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Long Beach Water Department (LBWD) and Long Beach Groundwater Treatment Plant accidental release prevention policy involves a unified approach that integrates proven technology, trains staff on operation and maintenance practices, and uses tested management system practices.  All applicable procedures of the State of California and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\nThis document complies with the U.S. Environmental Protection Agency's (EPA's) Risk Management Program (RMP), under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68 and the California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCF) Title 19, Division 2, Chapter 4.5.   The Long Beach GWTP has a chlorination system that uses chlorine gas fed from liquid chlorine containers.  This document summarizes our existing health and safety programs, our internal management response team, policies, procedures, and on-going actions that are designed to prevent or minimize impacts of accidental releases of chlorine to the environment. The Long Beach GWTP has prepared an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12417,
      "SummaryText": "emergency action plan to handle any potential accidental releases.  To date, we have had an excellent record in preventing accidents from occurring.  \nGeneral Facility and Regulated Substances Information\n\nThe Long Beach Groundwater Treatment Plant (GWTP) provides water for the City of Long Beach.  A groundwater treatment facility has occupied the site for almost fifty years.  New treatment facilities were constructed in the same general location as the original treatment facilities in early 1997.  The Long Beach GWTP is located at 2950 Redondo Avenue, near the intersection of Redondo Avenue and Spring Street, in the City of Long Beach.  The facility occupies 17 acres and is bounded by Spring Street on the north, Kilroy Airport Way on the south, the Don Temple R.V. Storage Yard on the east and Redondo Avenue on the west.  The chlorine storage areas of the facility are located approximately 200 meters to the north of the Interstate 405 Freeway, and about 300 meters south of the Long Beach Airport runways.   \n\nThe new and expanded Long Beach GWTP has a design capacity of 62.5 million gallons per day.  The plant is designed to treat colored groundwater extracted from 25 production wells of the City of Long Beach.  Water treatment includes filtration, disinfection, and pH adjustment. \n\nThe facility currently stores chlorine, which is a regulated toxic substance under RMP and CalARP.  The chlorination system converts liquid chlorine to chlorine gas and injects the gas into a solution that is used in a variety of plant processes, primarily for final effluent disinfection. The chlorine storage building is configured to contain 54 one-ton cylinders.  Twelve cylinders located on two sets of scales, twelve spaces for empty cylinders and thirty tons in reserve, for a total of 42 full cylinders and twelve empty containers.  In current operation configuration for 36 one-ton cylinders is utilized. Twelve on the scales, twelve spaces for empty cylinders and twelve in reserve, for"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12417,
      "SummaryText": "a total of 24 full cylinders and twelve empty containers.  This change has reduced inventory of full containers from 42 tons to 24 tons, a 43% reduction.  The containers lie at floor level parallel to each other in a horizontal position and are blocked and chained to prevent rolling. Twelve full containers are kept in reserve as replacements while six containers are stored on one bank of scales on line with the remaining six containers on the second scale in standby mode with valves closed.  The storage room was also designed to store eight 150 lbs chlorine cylinders for use at a remote site.  This inventory has been reduced to zero as an alternate disinfectant has been utilized.  Currently, one cylinder of nitrogen and one cylinder of liquid carbon dioxide that are used for maintenance and training operations are stored in the room. These cylinders are chained to the wall.  This chlorine storage exceeds the threshold quantities of the RMP and CalARP Rules.\n\nOverall the facility uses approximately 300 tons of chlorine per year.  During the summer months of May through September, one shipment per week of 12 tons is required.  During the winter months of October through April, one shipment of 12 ton is required approximately every seven weeks.  Liquid chlorine tanks are brought to the plant and either liquid or gaseous chlorine can be withdrawn from the tanks.  The preferred operation is to use chlorine gas to reduce the number of one ton containers on line.  There are two gas and two liquid manifolds connected to two sets of six chlorine scales.  During normal operations six one-ton containers are connected to each of the manifolds by chromium plated copper tubing pigtails.  One manifold with six containers is in operation and the other is held in reserve.  During the winter months the demand for chlorine is such that only two of the one-ton containers on the manifold are required to supply the chlorination needs of the facility. During the summer liquid chlorine is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12417,
      "SummaryText": "passed through an evaporator to vaporize the liquid to a gas for use in the process.  Summer demand requires all six of the one-ton containers on the manifold to supply the needs of the facility.\n\nMany safety systems are in place at the Long Beach GWTP chlorination facility, including leak detectors, alarm systems, a chlorine scrubber and pressure relief devices.  Some of these safety systems are discussed below along with a brief description of the chlorination equipment. \n\nChlorine is delivered to the Long Beach GWTP by truck, and cannot proceed without at least two personnel present.  The chlorine delivery trucks pull through a motorized roll-up door to enter into an enclosed unloading area in the chlorine storage building.  The motor operated roll-up door is normally controlled by a manual switch.  Two chlorine leak detectors are located in the unloading area.  These send alarms to the Distributed Control System (DCS) if a leak is detected.  The alarms will trigger activation of the scrubber and cause the automatic roll up door to close, if it is open. \n\nThe chlorine system consists of four main components: evaporators, vacuum regulators, chlorinators, and ejectors. The purpose of the system is to provide chlorine solution to several application points around the plant site. Evaporators convert liquid chlorine (under pressure in one-ton chlorine containers) to chlorine gas, by increasing its temperature.\n\nVacuum regulators convert the chlorine gas from a pressure state to a vacuum state and supply chlorine to the chlorinators.  The chlorinators regulate the resulting chlorine gas under vacuum to ensure that the ejectors add the proper amount of chlorine to the groundwater for adequate disinfection.  \nChlorine leak detectors monitor continuously for leaks in the chlorine storage and chlorinator rooms.  The leak detectors are set to alarm at 1 ppm.  The alarms are audible (four horns) and also activate four warning beacons.  The alarms are also annunciated in the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12417,
      "SummaryText": "ther safety systems include:\n7 Chlorine pressure lines and pressure relief valves are equipped with high pressure detectors, which will send an alarm to the DCS if the pressure becomes too high.\n7 Each chlorinator and vacuum regulator is equipped with a vacuum gauge and an alarm, which can generate a signal to a remote annunciator for high or low vacuum conditions.\n7 Rupture disks and expansion chambers are installed on liquid lines to prevent over-pressurization of liquid lines.\n7 The chlorine facility is of concrete construction with steel doors and steel platforms.  Virtually no flammable material is present in the building design. \n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis includes consideration of two chlorine release scenarios, identified as \"worst case\" and \"alternative\" release scenarios.  The worst-case scenario requires that a release of the entire contents of the single largest vessel or pipe be evaluated for off-site impacts. \nOnly passive or administrative controls are allowed in analyzing off-site impacts for the worst case release scenario.  The worst case release scenario used for Long Beach GWTP is the rupture of a one-ton chlorine containers, resulting in a release of a maximum of 2,000 pounds of chlorine over a 10-minute duration, assuming the scrubber system fails.  In practice this type of total release of a one-ton container, with scrubber failure, would be unlikely and never occur during the lifetime of the plant.  The chlorine one-ton containers are in an enclosed building, which results in a passive mitigation of any chlorine release.  The release rate reduction from the enclosed building is approximately 55 percent of the release rate from the bulk tank, per guidance from EPA regarding control efficiencies levels for buildings storing chlorine.  The release rate will, accordingly, be 200 pounds per minute (lbs/min) x 0.55 = 110 lbs/min. \n\nThe released liquid is assumed to quickly volatilize and to disperse as a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 12417,
      "SummaryText": "vapor cloud.  The distance to the toxic endpoint was estimated using the EPA model RMP*Comp version 1.06.  The toxic endpoint was conservatively set by EPA to ensure public notification and that local emergency respond planning takes into account the greatest possible impacted area surrounding the release point.  The toxic endpoint selected by EPA and CalARP was 3 ppm.  In addition all required EPA-model input parameters where included in completing this activity, including conservative meteorological conditions - Stability F class, wind speed of 1.5 meters per second, average temperature of 250 C, and average humidity (50%).  The results of the dispersion modeling analysis for this worst case release scenario indicate that this scenario has an offsite impact.\n\nThe alternative release scenario is more likely to occur, compared to the worst-case release scenario. Unlike the worst case release scenario, active controls can be applied to minimize the leak or impacts.  Active controls consist of mechanical, electrical, or human input.  The alternative release scenario used for chlorine was a leak (equivalent to a 1/10\" diameter hole) in one of the pipes leading from the switchover valves to the evaporators.  The release rate inside the building from the leak is calculated to be 26 lb/min.    The one-ton containers, evaporators, and associated piping are all in a building; and the building mitigation was considered.  Under this scenario, it was assumed that the chlorine scrubber would not fail.  The maximum exit concentration at the scrubber stack, therefore, was 15 ppm of chlorine.  The release rate from the scrubber effluent was calculated to be 0.0081 lb/min.  A value of 0.1 lb/min was reported in RMP*Submit because a software error will not allow a value less than 0.1 lb/min.  The amount released was 0.5 lbs.  For this scenario EPA's air dispersion modeling SCREEN 3, a steady state screening model, was used to determine the potential offsite impact of the chlorine m"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 12417,
      "SummaryText": "inor release. \n\nThe maximum 1 hour ground concentration obtained from the dispersion modeling conducted with SCREEN 3 for the alternative release scenario was 1.6 ppm at 6 meters around the chlorine scrubber stack.  The maximum chlorine ground concentration obtained with SCREEN 3 was below the USEPA and CalARP chlorine toxic endpoint of 3 ppm, therefore, it was concluded that the alternative release scenario studied showed no offsite impact.  The distance to the toxic endpoint was reported as 0.01 mile in RMP*Submit because a software error will not allow a valve less than 0.01 mile.  \n\nFinally, no chlorine releases that could have cause safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) has occurred at Long Beach GWTP during the last five years.  Some minor, incidental releases may have occurred over this period, but they were quickly handled by staff, were neutralized, or posed no safety or health hazards.\n\nSummary of the Accidental Release Prevention Program and Chemical-specific Prevention Steps \n\nLong Beach GWTP is in compliance with Federal and State Process Safety Management (PSM) requirements.  Chemical-specific prevention steps include availability of self-contained breathing apparatus, worn by the operators during connection and disconnection of the chlorine supplies, awareness of the hazardous and toxic properties of chlorine, and the presence of chlorine detectors and alarms.\n\nLong Beach GWTP accidental release prevention program is based on the following key elements:\n7 Detailed management system and clear levels of responsibilities and team member roles\n7 Comprehensive safety process information that is readily available to staff, emergency responders,  and contractors\n7 Comprehensive preventive maintenance program\n7 Completed a process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n7 Use of state-of-the-art process and safety e"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 12417,
      "SummaryText": "quipment\n7 Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n7 High level of training of operators and maintenance staff\n7 Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information was compiled from numerous sources and is intended to be a one-stop source for the reader seeking data about this substance.  This information includes chlorine background information, MSDS sheet, and chlorine reaction chemistry.\n\nEquipment safety information was meticulously compiled on the chlorine process.  Specifications are collected in one place for easy reference.  Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes are on file at the facility.\n\nProcedures are in place to trigger updates of the safety information if there is a major change that makes existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn 1996, a detailed process hazard analysis  (PHA) was conducted with plant staff, engineering, and administrative staff for the regulated process.  The team consisted of process operating and maintenance experts and process design engineers.  The PHA technique used was the \"Hazard and Operability (HAZOP)\" study, per acceptable approach guidance from EPA. The PHA was lead by knowledgeable person on the type of process being reviewed.  This review was updated in February 1997 and will be updated again within a five-year period or whenever there is a major change in the process.  A list of actions to resolve any significant hazard review findings was prepared and staff has completed th"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 12417,
      "SummaryText": "is action item list.  Staff has documented completion of each action item.\n\nA seismic walkthrough was recently completed based on the 1997 UBC, and recommendations were provided to Long Beach GWTP for their evaluations and implementation. \n\nOperating Procedures\n\nLong Beach GWTP maintains up-to-date, accurate, written operating procedures that give clear instructions for the chlorine process.  Long Beach GWTP ensures effective operating practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine system.  Procedures include startup, shutdown, and normal, alternate, and emergency operation.  Also included is maintenance and troubleshooting procedures, including consequences of deviation and the steps to avoid correct deviations.  Long Beach GWTP will update procedures whenever a change occurs that alters the steps needed to operate safely.  Operating procedures will be developed and in place prior to any new process equipment coming on line or a changed process starting back up.\n\nOperations and Maintenance Training Program\n\nEach Long Beach GWTP employee presently involved in operating or maintaining the chlorine process are trained in an overview of the process and detailed, applicable operating and maintenance procedures.  Training helps employees understand the nature and cause of problems arising from operations involving chlorine on site, and increases their employee awareness of potential hazards. Long Beach GWTP's training program includes both initial and refresher training that covers 1) a general overview of the process, 2) the properties and hazards of the substance in the process, and 3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and written self-evaluations are used to verify that an employee understands the training material before"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 12417,
      "SummaryText": "the process work can be resumed. \n\nTraining documentation includes: date of most recent review or revision to the training program, type of training required and the type of competency testing used to ensure staff understands the training.  \n\nContractors\n\nLong Beach GWTP has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the chlorine process, and that the contractors are properly informed of the hazards, access limitations to the process areas, and emergency response procedures, and prepared to safely complete the work.  Long Beach GWTP sets minimum contractor safety performance requirements to do work at the Long Beach GWTP, holds contractor safety briefings before allowing them near or in the process areas; controls access to the process areas, and evaluate the contractor's performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nLong Beach GWTP ensures that a pre-startup safety review is completed for any new covered-by-the-rules process at the plant, or for significant modifications to an existing covered process that requires a change in the process safety information.   Long Beach GWTP maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  Long Beach GWTP believes that this program is the primary line of defense against a release and addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. \n\nLong Beach GWTP's mechanical integrity program includes the following:\n7 Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\n7 Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals\n7 Training of maintenance personne"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 12417,
      "SummaryText": "l in procedures for safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions\n7 Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant developed maintenance procedures for process areas.\n\nHot Work Permits and Management of Change \n\nLong Beach GWTP requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered processes. Long Beach GWTP uses a comprehensive permitting and training program to ensure hot work is conducted safely.  \nLong Beach GWTP provides a system and approach to maintain and implement any management of changes or modifications to equipment, procedures, chemicals, and processing conditions.  This system allows Long Beach GWTP employees to identify and review safety hazards or provide addition safety, process, or chemical information to existing data before the proposed change would either comprise system safety or need training to be completed.\n\nInternal Compliance Audits\n\nInternal compliance audits are conducted every 3 years to verify compliance with the programs and procedures contained in the RMP. Long Beach GWTP assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\nIncident Investigation\n\nLong Beach GWTP investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. Long Beach GWTP trains employees to identify and report any incident th"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 12417,
      "SummaryText": "at requires investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff, added or used to revise operating and maintenance procedures, and passed onto the training unit for their inclusion in existing training programs, if warranted to prevent a future event.\n\nFive-Year Accident History Summary\n\nNo chlorine releases that could have cause safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) have occurred at Long Beach GWTP during the last 5 years.  \nEmergency Response Program Summary\nLong Beach GWTP has established a written emergency action plan that is followed by the employees to help safely respond to accidental releases of hazardous substances.  This program has been coordinated (reviewed) by the City of Long Beach Fire Department, which is a member of the Local Emergency Response Planning Committee (LEPC).  This plan includes the mean of reporting emergencies, evacuation procedures, and procedures to account for employees after evacuation.  Emergency response actions at the Long Beach GWTP will be coordinated by the City of Long Beach Fire Department or the Los Angeles HazMat Team.  Long Beach GWTP has hired an emergency response contractor to assist in the event of an emergency.  \n\nPlanned Changes to Improve Safety\n\nNumerous changes to improve safety (recommended actions) were previously identified for the covered processes in 1996 under the State of California Risk Management and Prevention Program (RMPP).  These recommended actions have been evaluated and implemented as required.  In addition, the 1996 process hazard analyses (PHAs) for the chlorine-covered process was reviewed and revalidated in 1997.  Based on the review of the PHA"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 12417,
      "SummaryText": ", the seismic analysis and the off-site consequence analysis, a total of ten recommended actions were identified to improve the safety of the chlorination system.  The recommended actions have been evaluated and implemented as shown below.  The implementation of these recommendations will further improve the safety of the covered process. \n\nRecommended Actions from PHA 11/96 Rev. 11/97     \n\nBridge Crane SOP   Completed:   01/97     Revised:  01/99\nContainer Change-out SOP     Completed:   01/97         Revised:  01/99\nManifold Protection SOP (Inc in Container Change-out)  Completed:  01/97      Revised:   01/99\nScrubber Interlock to Prevent Exhaust Fan From Operating if Both Pumps Fail   Completed:  02/97\nTest & Verification of Scrubber Start-up SOP   Completed:   03/97    Revised:  01/99\nTest Scrubber Caustic Level & Concentration SOP    Completed:  03/97    Revised:  01/99\nEmergency Response Plan Update  Completed:  03/97\nInstall Wind Socks   Completed:  04/07\nVent System Shutdown Verification SOP   Completed:  04/97   Revised:  01/99\nPosted Speed Limits  Completed:  04/97\n\nIn June of 1998 the Long Beach Water Department filmed a safety video at the Long Beach GWTP identifying the hazardous chemicals on site, fire and chemical leak alarms, and evacuation routes from the building and site.  All groups utilizing the facility are required to watch this video."
    }
  ]
}