{
  "FacilityID": 12551,
  "FacilityName": "Perdue Farms Inc. Rockingham, NC Roaster Plant",
  "FacilityStr1": "416 South Long Drive",
  "FacilityStr2": null,
  "FacilityCity": "Rockingham",
  "FacilityState": "NC",
  "FacilityZipCode": "28379",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37153",
  "LEPC": "Richmond County LEPC",
  "FacilityLatDecDegs": "34.934167",
  "FacilityLongDecDegs": "-79.7525",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "www.perdue.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 179803374,
  "ParentCompanyName": "Perdue Farms Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 22666820,
  "Company2DUNS": 0,
  "OperatorName": "Perdue Farms Incorporated",
  "OperatorStr1": "416 South Long Drive",
  "OperatorStr2": null,
  "OperatorCity": "Rockingham",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28379",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jimmy Davis",
  "RMPTitle": "Environmental Manager",
  "FTE": 750,
  "OtherEPAFacilityID": "NCD179803374",
  "EPAFacilityID": "100000130271",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.93774,
  "FRS_Long": -79.75322,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16778,
      "AltID": "Ammonia",
      "FacilityID": 12551,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17196,
          "ProcessID": 16778,
          "NAICSCode": "11232",
          "_desc": {
            "NAICS_CODE": "11232",
            "NAICS_DESCRIPTION": "Broilers and Other Meat Type Chicken Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 20907,
          "ProcessID": 16778,
          "ChemicalID": 56,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 520907,
          "ProcessID": 16778,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12551,
      "SummaryText": "Description of the facility and the regulated substance:\n\nPerdue Farms Incorporated founded in 1920 is the largest poultry producer in the Northeast and the third largest in the United States.  Headquartered in Salisbury, Maryland, the family owned, privately held company has operations in 14 states.  Twenty processing facilities produce about 50 million pounds of poultry products each week.  Perdue Farms also has grain storage and merchandising operations and is ranked among the top 20 largest U.S. grain companies.  Perdue also manufactures edible oils, specialty feeds, livestock feed ingredients and premium pet food ingredients.\n\nThe Perdue Farms, Rockingham Roaster facility is a poultry processing plant located approximately 1,500 feet west of Long Drive in Rockingham, North Carolina.  This facility began operation in the late 1950s and was acquired by Perdue Farms in 1985.  The facility has a wooded area to the southeast and residences to the southwest and to the north.\n\nThe regulated substance used at the Rockingham facility, covered by 40 CFR Part 68, is anhydrous ammonia (R-717).  The facility utilizes anhydrous ammonia as a refrigerant in its cooling system.  The total quantity of anhydrous ammonia used in this process is approximately 43,790 pounds, distributed throughout various refrigeration components (compressor, pressure vessels, condensers, etc.).  The majority of the refrigeration components are located on the roof, though piping is located throughout the facility\n\nAccidental release prevention and emergency response policies:\n\nAs a concerned member of the community, the company takes its role as a responsible corporate citizen very seriously.  All Pedue facilities are operated to protect employees, contractors, and the public from injury and illness, and to minimize environmental impact.  A company-wide safety and wellness program stresses safe working conditions and safe practices.  Perdue's policy is to inspect, maintain and operate equipment and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12551,
      "SummaryText": "facilities to prevent accidents, including the release of hazardous materials; and to train employees in prevention, as well as to prepare them to respond rapidly and effectively should an accident occur.\n\nPerdue Farms has developed and implemented Spill Prevention Control and Countermeasures (SPCC) plan and Process Safety Management (PSM) plan as part of an overall chemical management program.  The program involves local managers and a wide range of senior management personnel, including the Director of Environmental Services and the Director of Safety and Security.  Additionally, Perdue conducts regular safety meetings and provides a wide variety of environmental, health, and safety training to its staff.\n\nGeneral accidental release prevention program:\n\nThe Perdue Farms Rockingham facility maintains a PSM plan of Highly Hazardous Chemicals prepared in accordance with the Occupational Health and Safety Administration (OSHA) regulation 29 CFR 1910.119.  The facility also utilizes a preventative maintenance program for its system components.  As part of the program, trained refrigeration personnel inspect the refrigeration system operating parameters and conduct routine maintenance, as needed.\n\nWorst-case release scenario:\n\nThe predicted worst-case scenario for the refrigeration system is the catastrophic failure of the System #1 High Pressure Receiver (HPR), which has a maximum storage capacity of 31,595 pounds of anhydrous ammonia.  Using the RMP Comp (Ver 1.06) modeling software, the calculated distance to the toxic endpoint is 2.0 miles, affecting schools, residences, hospitals, recreation areas, major commercial areas, and churches.  The estimated population within the 2-mile radius is 12,787, based on U.S. Census Bureau information contained in LandView III mapping software.\n\nAlternative release scenario:\n\nThe predicted alternative release scenario for the refrigeration system is the release of anhydrous ammonia from the System #1 HPR resulting from a breakage "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12551,
      "SummaryText": "of the sight glass.  It is estimated that this type of scenario would result in an anhydrous ammonia release of 9,544.36 pounds.  This type of release would occur within 1.63 minutes.  Using the DEGADIS dispersion model, the calculated distance to the toxic endpoint is 1.38 miles, affecting schools, residences, hospitals, recreation areas, major commercial areas, and churches.  The estimated population within the 1.38 mile-radius is 6,122, based on U.S. Census Bureau information contained in LandView III mapping software.\n\nFive-year accident history:\n\nThere have been no accidents involving anhydrous ammonia that have resulted in death, injuries, property damage, evacuations, environmental damage or sheltering in place.\n\nEmergency response program:\n\nThe Perdue Farms Rockingham facility has implemented a comprehensive Emergency Response Plan in accordance with the OSHA PSM regulations.  The facility has a trained emergency response team that will respond in the event of a hazardous material release, fire or other emergency situation.  The written Emergency Response Plan contains specific information regarding Emergency Response organization and procedures, as well as incident notification, mitigation, and incident preparedness.  In addition, the facility's training program includes annual refreshers.\n\nAs part of its Risk Management Program, Perdue Farms has developed a RMP Communications Plan.  The goals of this plan are (1) to educate the public on the potential risk of regulated substances used by Perdue; (2) to respond to any concerns that RMP disclosures may cause with honest, fact-based communications; and (3) to be fully prepared to effectively respond to any accidental chemical release scenario.  Proactive materials about the disclosure information, how the company is prepared to deal with an accident, how the community should respond to an accident, and a process for announcing that an accident has occurred (to be used as needed) are being prepared.  In additi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12551,
      "SummaryText": "on, training and information materials for the Perdue managers and employees, community officials, civic groups, the media, environmental groups, emergency response personnel and the public in general will be available.\n\nPlanned changes to improve safety:\n\nAs part of Perdue's continual improvement philosophy, all Perdue facilities continue to identify and update system components and techniques to ensure safety."
    }
  ]
}