{
  "FacilityID": 12566,
  "FacilityName": "Baseline Water Treatment Plant",
  "FacilityStr1": "3566 Baseline Road",
  "FacilityStr2": null,
  "FacilityCity": "Lafayette",
  "FacilityState": "CO",
  "FacilityZipCode": "80026",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08013",
  "LEPC": "Boulder County LEPC",
  "FacilityLatDecDegs": "39.999861",
  "FacilityLongDecDegs": "-105.151889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.cityoflafayette.com",
  "FacilityEmailAddress": "douglass@cityoflafayette.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Lafayette",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Lafayette",
  "OperatorStr1": "1290 South Publlic Road",
  "OperatorStr2": null,
  "OperatorCity": "Lafayette",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80026",
  "OperatorZipCodeExt": "2778",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131902",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-23 00:00:00",
  "SafetyInspectionBy": "CIRSA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-01-28 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-21 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.00013,
  "FRS_Long": -105.1522,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16793,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 12566,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20940,
          "ProcessID": 16793,
          "ChemicalID": 62,
          "Quantity": 2500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17211,
          "ProcessID": 16793,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7030,
              "Process_NAICS_ID": 17211,
              "SafetyReviewDate": "1998-10-23 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "CIRSA",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-10 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-01 00:00:00",
              "TrainingReviewDate": "1999-06-16 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-01-10 00:00:00",
              "EquipmentInspectionDate": "1998-05-06 00:00:00",
              "EquipmentTested": "Regulators and valves, Cl2 leak alarm, Self conatained breathing apparatus",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 7334,
                  "PreventionProgram2ID": 7030,
                  "ProcessChemicalID": 20940
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12566,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-01 00:00:00",
    "ERTrainingDate": "1999-06-17 00:00:00",
    "CoordinatingAgencyName": "City of Lafayette Fire Department",
    "CoordinatingAgencyPhone": "3036659661",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12566,
      "SummaryText": "Baseline Water Treatment Plant is a water treatment facility, which serves the Lafayette, Colorado community.  This conventional treatment plant uses coagulation, flocculation and filtration prior to chlorination to provide a clean and safe drinking water.   We draw water from any of three sources: Baseline Reservoir, Goosehaven Reservoir, or Waneka Reservoir depending on the time of year and the needs of the community.  The plant produces potable water 24 hours a day, 7 days a week.  The only chemical regulated by the Clean Air Act, used at this facility is chlorine gas in 1-ton cylinders.  We currently store up to 2500 pounds of chlorine at any given time.\n\nThe overall approach to chlorine safety used at this facility is hands on or on the job training.  This will be supplemented in the future by the use of training videotapes from either the Chlorine Institute, and/or the American Water Works Association.  All employees are verbally shown how to safely connect, disconnect, and move ton chlorine cylinders. Arrangements are being made with the local fire department to train employees in the use of self contained breathing apparatus and ton cylinder repair kits.\n\nManagement has enforced and implemented strong safety measures both for the employees and for the general safety of the public.  We are committed to ongoing training and education of our employees.  It is our belief that through training and education we can operate in a conscientious and safe manner.  We are planning several open houses to inform the public of our safety policies and to allow them to become familiar with the operation of the plant. The following policies have been implemented at the Baseline Water Treatment Plant to ensure compliance with safety regulations in referance to chlorine.\n\n1. There must always be two operators familiar with operational and safety procedures present to move, connect, or disconnect any tanks.  Both operators should also be familiar with the use of the self contain"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12566,
      "SummaryText": "ed breathing apparatus as well as knowing the Chlorine Emergency Response Procedure.\n2. The blower must be on and there must be two open exits before starting any work.\n3. When opening a chlorine tank valve or connection, \"NEVER\" have your face in front of the valve.  Stand up to open the valve.\n4. Do not use tools to open a valve.  Use only your hands, or hands with thick gloves to open the valve.\n5. Clean and examine the flex tubing, replace if needed and replace the lead washer for the new cylinder.  Examine the ton cylinder for damage.\n6. One person should stand back to provide emergency support, while one person finishes the connection.\n\nThe worst-case release scenario for the Baseline Water Treatment Plant was created using RMP*COMP. For worst-case scenario release analysis of a regulated toxic substance, we have used 25 degrees Celsius and 50 percent humidity as values for these variables.  The worst case release of a regulated toxic substance was analyzed assuming a ground level (0 feet) release.  Although the topography surrounding the Baseline Water Treatment Plant is predominantly rural, there are several buildings, trees, and other obstacles in the area.  Therefore, we will consider the area urban according to the definition provided in Part 68.  The density of chlorine is 2.5, while the density of air is 1.  Therefore, upon release, the chlorine should remain at ground level.  All models used to calculate the worst case chemical release scenario appropriately account for the gas density.  For worst case scenario, liquid chlorine is considered to be released at the highest daily maximum temperature of 25 degrees Celsius.    \n\nAs a Program 2 Process, Baseline Water Treatment Plant has developed a worst-case accidental release scenario of a regulated toxic substance.  The RMP*COMP computer program estimates the greatest distance in any direction to an endpoint of a chlorine release would be 3.50 miles. This substance is released as a gas over a 10-minute p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12566,
      "SummaryText": "eriod.  The release rate of Chlorine gas is 2000 pounds divided by 10 minutes which equals a rate of 200 pounds per minute.  Methodology provided in the RMP Offsite Consequence Analysis Guidance has been used to model air dispersion.\n\nThe worst-case scenario is only likely if a cylinder is dropped. Our policy limits the distance from the ground to the cylinder to less than a foot when being moved, except when going over an in place cylinder.  We only move over an in place cylinder a maximum of four times a year.  We believe that this makes the worst case scenario highly unlikely as there is little to cause a tank rupture.\n\nOne alternative release scenario has been identified for chlorine gas releases per section 68.28.  The alternative scenario considers a chlorine gas release that is more likely to occur than the worst-case release scenario. The alternate release situation occurs due to a small puncture hole .5 square inches or a break in the connecting tubing.  The duration of the leak is 25 minutes.  92.3 pounds of chlorine per minute would escape the ton cylinder, and the toxic endpoint would be 1.2 miles.  Our normal maintenance routine of tubing replacement is intended to limit the possibility of a tubing break.  It is very unlikely that the tank would be punctured or the tubing break unless we had a major earthquake and that is not likely in this area.\n\nThe population that may be affected by a chlorine release surrounding the Baseline Water Treatment Plant has been figured using census data from the City of Lafayette Planning Department.  There were 22,531 individuals living in the area as of April 1998.  By dividing 22,531 by 3.5 miles, we have a potential to affect a population of 6,437 people.  As there are no national or state parks, forests, monuments, no officially designated wildlife sanctuaries, preserves, or refuges and no federal wilderness areas, we do not have any environmental receptors within the distance to the endpoint of a chlorine release fr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12566,
      "SummaryText": "om Baseline Water Treatment Plant.\n\nThe general accidental release prevention program and chemical specific prevention steps have been given above.  Maintenance is performed as needed with monthly and yearly inspections and maintenance of equipment.  Fully trained contract maintenance personnel are used for any changes in the chlorination system.  In addition to hands on training of Baseline Water Treatment Plant personnel, sessions will be made available for all personnel to be trained in the use of appropriate safety gear and chlorine patch kits.\n\nWe have had no accidental releases of chlorine either in gaseous or in liquid form from the Baseline Water Treatment Plant in the last five years.  There have been no offsite injuries and no plant personnel have had to seek medical treatment due to chlorine gas.  No nearby residents have been evacuated.\n\nThe emergency response program followed at Baseline Water Treatment Plant is:\nA. If there is no detectable chlorine leak, but there is a plant emergency, simply enter the chlorine tank room and close the valve on the chlorine cylinder.  (There should be a wrench positioned so that all that is needed to turn off the chlorine feed is to push down on it in a clockwise direction.)\n\nB. General Response Procedures for a Chlorine Emergency\n1. When handling chlorine cylinders, two people must be present in full SCBA's in the chlorine room with another person standing by outside in full SCBA in full visual view of both operators inside the room.\n2. The Fire Department should handle any chlorine leak deemed an emergency by the operators.  (This is a judgment call that will vary depending on the individual's expertise and the availability of on-site personnel in a given situation.) The primary concern is to protect human health and safety.\n3. Operator's responsibility in such a situation would be:\n1. Contact 911  (Fire, Police, Boulder Hazmat)\n2. Evacuate affected area\n3. Notify supervisor (Mike Bacon)\n4. Notify Dixie Petro Chemica"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12566,
      "SummaryText": "l (our chlorine supplier)\n5. Any person affected by a chlorine leak will be removed from the scene and the unaffected operator will have emergency medical services respond to the scene.  Anytime a person has been affected by the chlorine, the Fire Department will be notified.\n6. Operators are encouraged to assist the Fire Department during a chlorine emergency if they feel competent.\n7. If the leak is going to require the use of a repair kit, or if one cannot enter the room without wearing an air pack, the Fire Department will be notified before the operators make any attempts to stop or reduce the leak.  \n8. Essentially, operators will deal with any leaks that occur when connecting cylinders. The most common type of leak is loose packing and can be solved by tightening connections.  Anything else will be within the Fire Department and/or Boulder Hazmat's jurisdiction.\n8. All chlorine cylinders will be changed Monday through Friday during the day when adequate staff is available.  They will only be changed on the weekend when necessary with at least two (2) operators available.\n9. The following is a list that operators will use to coordinate with local emergency crews:\n\nEmergency Phone Numbers\nFire and Police Department and Boulder Hazmat\u0005\u0005\u0005..911\nChemtrec\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005\u0005..1-800-424-9300\nDixie Petro Chemical........................................303-289-3142\nMike Bacon......................................................303-666-0578\nDoug Short......................................................303-666-1206\nBill Fulbright.....................................................970-484-8204\n\n\nEmergency Information (to be given to 911 operator)\n1. Location of facility and phone number \n          Baseline Water Treatment Plant\n          3566 Baseline Road\n          Lafayette, CO\n          (303) 494-9503 (or cell phone number)\n2. Rescue unit required\n          Yes or no, do we need the Hazmat Team?\n          Is this a major or a minor leak?\n          Is anyone injured? \n3."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 12566,
      "SummaryText": "Size of container leaking \n          Ton, or 150#?\n4. Evacuation required \n          Highway, people at pool, residential areas\n5. Repair kit location \n          South side power panel hallway\n6. Wind direction concerns\n           Wind direction is an extremely important factor during a chlorine leak.  The wind direction should be noted and the Fire Department informed so that an orderly and safe evacuation can be accomplished.  The windsock is located on top of the West End of the North Filter Building.\n7. Give the phone number where operator can be reached.\n\nChanges planned by the Baseline Water Treatment Plant personnel to improve safety are the purchasing of cellular telephones to ensure operators can reach and be reached by emergency response personnel.  Training with SCBA's and chlorine leak repair kits will be held at a date to be determined in the near future so that our employees can help to mitigate any sized chlorine leak with the help of the Lafayette Fire Department.  In addition, drills will be held annually with Boulder County Hazmat and the Lafayette Fire Department where all attendees will be suited up and leak mitigation and evacuation procedures can be practiced or developed."
    }
  ]
}