{
  "FacilityID": 12586,
  "FacilityName": "Allegheny Ludlum Corporation West Leechburg",
  "FacilityStr1": "565 Kiski Avenue",
  "FacilityStr2": null,
  "FacilityCity": "West Leechburg",
  "FacilityState": "PA",
  "FacilityZipCode": "15656",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42129",
  "LEPC": "Westmoreland County LEPC",
  "FacilityLatDecDegs": "40.640833",
  "FacilityLongDecDegs": "-79.6125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Allegheny Teledyne Incorporated",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Allegheny Ludlum Corporation",
  "OperatorStr1": "565 Kiski Avenue",
  "OperatorStr2": null,
  "OperatorCity": "West Leechburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15656",
  "OperatorZipCodeExt": null,
  "FTE": 607,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133811",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-65-00183",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-05-12 00:00:00",
  "DeRegistrationEffectiveDate": "2006-04-21 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.64008,
  "FRS_Long": -79.61118,
  "FRS_Description": null,
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 16826,
      "AltID": "Process acid bath",
      "FacilityID": 12586,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20983,
          "ProcessID": 16826,
          "ChemicalID": 55,
          "Quantity": 73850.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17249,
          "ProcessID": 16826,
          "NAICSCode": "331111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7041,
              "Process_NAICS_ID": 17249,
              "SafetyReviewDate": "1998-12-31 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1998-12-31 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "visual observations",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-31 00:00:00",
              "TrainingReviewDate": "1998-12-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-31 00:00:00",
              "EquipmentInspectionDate": "1998-12-31 00:00:00",
              "EquipmentTested": "A visual inspection was performed on the tank, isolation valves, and piping.",
              "ComplianceAuditDate": "1998-12-31 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 7345,
                  "PreventionProgram2ID": 7041,
                  "ProcessChemicalID": 20983
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 16827,
      "AltID": "Process acid bath",
      "FacilityID": 12586,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 20984,
          "ProcessID": 16827,
          "ChemicalID": 55,
          "Quantity": 103300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17250,
          "ProcessID": 16827,
          "NAICSCode": "331111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12586,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-31 00:00:00",
    "ERTrainingDate": "1998-12-31 00:00:00",
    "CoordinatingAgencyName": "Westmoreland County Emergency Mgmt",
    "CoordinatingAgencyPhone": "7248347007",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 12586,
      "SummaryText": "ribed in this RMP.  \n\nWorst-Case Scenario and Alternative Release Scenario\nThe worst-case scenario for Process No. 1 is a failure of the 70 percent HF storage tank and piping system when filled to capacity.  An administrative control (i.e., visual inspection to maintain less than or equal to 90 percent fill volume in the tank) is in place at the facility.  A release from this process would be controlled by an acid resistant material diked area that provides secondary containment to accommodate 110 percent of the maximum tank capacity.  RMP Comp was used to determine the distance to the toxic end point associated with a worst-case scenario release.  According to the modeling results, the distance to the specified end point for a worst-case accidental release scenario associated with this process is 0.8 mile, which is greater than the distance to the nearest public receptor.\n\nThe most likely alternative release scenario for Process No. 1 is a leak from the piping connected to the HF storage tank.  Due to a series of shut-off valves, including one near the storage tank, any leak from the piping would not likely exceed the amount contained in approximately 1,500 linear feet of 2-inch-diameter piping which is approximately 245 gallons or 2,430 pounds.  RMP Comp was used to determine the distance to the toxic end point associated with this alternative release scenario.  According to the modeling results, the distance to the specified end point for the alternative release scenario associated with this process is 0.3 mile, which is greater than the distance to the nearest public receptor.\n\nThe worst-case scenario for Process No. 2 is a failure of the 70 percent HF storage tank and piping system when filled to capacity.  An administrative control (i.e., visual inspection to maintain less than or equal to 90 percent fill volume in the tank) is in place at the facility.  A release from this process would be controlled by an acid resistant diked area that provides secondary con"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12586,
      "SummaryText": "tainment to accommodate 110 percent of the maximum tank capacity.  RMP Comp was used to determine the distance to the toxic end point associated with a worst-case scenario release.  According to the modeling results, the distance to the specified end point for a worst-case accidental release scenario associated with this process is 1.0 mile, which is greater than the distance to the nearest public receptor.\n\nThe most likely alternative release scenario for Process No. 2 is a leak from the piping connected to the HF storage tank.  Due to a series of shut-off valves, including one near the storage tank, any leak from the piping would not likely exceed the amount contained in approximately 400 linear feet of 2-inch-diameter piping which is approximately 65 gallons or 648 pounds.  RMP Comp was used to determine the distance to the toxic end point associated with this alternative release scenario.  According to the modeling results, the distance to the specified end point for the alternative release scenario associated with this process is 0.2 mile, which is greater than the distance to the nearest public receptor.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe West Leechburg facility has safe job procedures (SJP) in place:\n\n7 to evaluate the HF tank capacity and volume already in place before unloading begins;\n7 to describe the use of HF in the facility's manufacturing operations; and\n7 for the inspection of process equipment including the HF tanks, piping, and isolation valves.\n\nIn addition, the West Leechburg facility trains employees regarding safe job procedures, safe work practices, emergency evacuation and response, and routine and nonroutine work authorization.  Finally, the facility maintains the ongoing mechanical integrity of the process equipment.\n\nFive-Year Accident History\nThere have been no accidental releases associated with these processes in the last 5 years that have resulted in deaths, injuries, or significan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12586,
      "SummaryText": "t property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  \n\nEmergency Response Program\nThe West Leechburg facility maintains a PPC Plan/Spill Prevention Response/(SPR) Plan.  The  West Leechburg facility has trained employees for an initial response team.  This team will don personal protective equipment (PPE) and be dispatched to control or stop a minor emergency or an accidental release or help move any employee(s) that has been affected by a 70 percent HF release.  If necessary, employees will be evacuated to a safe zone.\n\nIn the event of an emergency where off-site response is appropriate, it will be the policy of the West Leechburg Facility to notify the Westmoreland County 911 Center and/or the Local Emergency Planning Committee (LEPC) and request that they respond to the emergency.  A fire, explosion, or other occurrence with the potential to create a release of the regulated substance (HF) from the process may pose a danger to public emergency responders.   Public emergency responders will not be permitted to enter this area except as previously arranged with the Primary Emergency Coordinator (PEC) or other designated personnel, as identified within this RMP.\n\nFinally, the  West Leechburg Facility has an equipped emergency control center.  The emergency control center is sited in a safe zone and serves as the major communication link between the PEC and plant or corporate management as well as with local community officials.\n\nPlanned Changes to Improve Safety\nNo additional measures to prevent off-site impacts from accidental releases have been identified or are required at this time.  If reasonable measures are subsequently identified that would lower the risk of an off-site release, such measures will be implemented.\n\nResponsible Person\nI, Deborah L. Calderazzo, Manager of Environmental Affairs, have been assigned as the qualified person with the overall responsibility for the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12586,
      "SummaryText": "development, implementation, and integration of the RMP and subsequent program elements for the West Leechburg facility of Allegheny Ludlum Corporation.\n\nCurrently, I have the responsibility for implementing the individual requirements of this RMP.  Should this responsibility be assigned to another person (or persons) other than myself, the names and positions of these people will be documented and the lines of authority will be defined through an organization chart or similar document."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 12586,
      "SummaryText": "This Risk Management Plan (RMP) has been developed by Earth Sciences Consultants, Inc. (Earth Sciences) for Allegheny Ludlum Corporation's West Leechburg facility located at Mill Bridge Road, Leechburg, Pennsylvania, and is pursuant to the requirements of 40 Code of Federal Regulations (CFR) Part 68.\n\nProcess Description and Regulated Substances\nThe West Leechburg facility has designed and operates two processes for the storage and transfer of 70 percent hydrofluoric acid (HF) into process tubs.  The first process (Process No. 1) includes an 8,000-gallon storage tank located in a designated acid storage area and piping used to supply 70 percent HF to the process tubs.  The second process (Process No. 2) includes an 11,500-gallon storage tank located in a designated acid storage area and piping used to supply 70 percent HF to the process tubs. These processes are located in parts of the plant that are designed for the storage, handling, and use of 70 percent HF.  The storage, handling, and use of 70 percent HF at the plant is hereafter referred to as Process No. 1 or Process No. 2 in the remainder of this document.  The North American Industrial Classification System code for the facility is 331111.  The West Leechburg facility processes are classified as Tier II programs since the facility is not subject to Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) requirements under 29 CFR 1910.119.  \n\nAccident Release Prevention and Emergency Response Policies\nThe West Leechburg facility has an excellent record in preventing and minimizing releases of hydrofluoric acid.  The West Leechburg facility remains committed to the prevention of releases of hydrofluoric acid.  In the event of a release, the West Leechburg facility is committed to a timely response in accordance with their Preparedness, Prevention, and Contingency (PPC) Plan and the applicable components of this RMP.  Accident prevention and emergency response programs are desc"
    }
  ]
}