{
  "FacilityID": 1267,
  "FacilityName": "City of Mt. Airy Wastewater Treatment Plant",
  "FacilityStr1": "Hwy. 52 South",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Airy",
  "FacilityState": "NC",
  "FacilityZipCode": "27030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37171",
  "LEPC": "Surry County LEPC",
  "FacilityLatDecDegs": "36.476667",
  "FacilityLongDecDegs": "-80.601944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Mt. Airy",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Mt. Airy",
  "OperatorStr1": "P.O. Box 70",
  "OperatorStr2": null,
  "OperatorCity": "Mt. Airy",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27030",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Boyles",
  "RMPTitle": "Engineering and Utilities Director",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014548",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-09-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-12-07 00:00:00",
  "DeRegistrationEffectiveDate": "2006-11-01 00:00:00",
  "AnniversaryDate": "2004-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 36.47806,
  "FRS_Long": -80.60278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1372,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1267,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1394,
          "ProcessID": 1372,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1464,
          "ProcessID": 1372,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501464,
          "ProcessID": 1372,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1267,
      "SummaryText": "City of Mount Airy\n\nRMP Executive Summary\n\n\nThe City has implemented a comprehensive program to safely manage chlorine at its water and wastewater treatment plants located in or adjacent to the City. There have been no chlorine incidents in the most recent five-year history period.\n\nIn 1994 and 1995, a Process Safety Management (PSM) program was initiated at the Plants using internal resources. A PSM Implementation Manual was developed to be site specific for each plant. Key items included in the manual were:\n\n- Written site specific procedures for Employee Involvement, Management of Change, Incident Investigation, Pre-Startup Reviews and Self Audits.\n\n- Chlorine safety information as required by the regulations\n\nNext, these additional steps were implemented to complete the PSM program.\n\n- Training on PSM and its key components including Management of Change, Mechanical Integrity  and Incident Investigation.\n\n-Conducting  Process Hazards Analyses for the three chlorine processes\n\n-Developing Standard Operating Procedures for Chlorine Management\n\n-Developing an initial Emergency Response Plan\n\n -Training in support of the certification of operators\n         \nThe supervisor, chief operator and several plant operators are meeting once per year to review and update procedures and to maintain compliance with all aspects of the PSM regulation.\n\nIn addition to PSM compliance, the plants have implemented a number of programs to improve the safe handling of chlorine and other chemicals\n\n- The chlorine delivery systems at the plants have been upgraded to vacuum processes over the past 10 years. This process has proven to greatly reduce leaks by reducing the amount of equipment that is exposed to pressurized chlorine.\n\n -  Chlorine has been replaced by calcium hypochlorite at the S L Spencer plant, the city's other water plant. This facility is located in town near facilities that would be impacted  by a release.\n\nThe site's Emergency Response Plans (ERP) have been significant"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1267,
      "SummaryText": "ly upgraded. In 1997, the ERP was revised to include offsite response and communication. The County LEPC and other local response organizations have been incorporated into the ERP. Where necessary, communication plans have been developed to notify businesses or residences that may be impacted by a release. Chlorine Response Drills have been routinely conducted since 1997. The last drill was conducted on August 1, 1998.\n\nTo further understand chlorine risks, a consulting firm was contracted to conduct \"Offsite Consequence\" Modeling Analysis, as required by EPA's Risk Management Program. Both a \"Worst Case\" and an \"Alternative Case\" chlorine release scenarios were studied for each site.\n\nThe \"Worst Case\" modeling showed the potential impact of a full, 2000 pound cylinder of chlorine released in 10 minutes. This resulting chlorine plume extended  0.9. miles for both plants. For the \"Alternative Case\", a more typical possible release of 180 pounds, 3 pounds/minute for 60 minutes, was modeled. The modeling indicated that a plume extending 0.1 miles would result.\n\nThe results showed that the risk of chlorine exposure is low due to the favorable location of the plants.\n\n- The  Wastewater Treatment Plant is located south of the town. All chlorine is stored inside a building. This location will assist in any emergency by initially containing a chlorine leak. Also, due to the topography and location of the plant, the most likely scenario would be for the chlorine (a heavier-than-air gas) to fall to the adjacent creek and follow the creek until the chlorine cloud disperses. Thus, the impact of a chlorine release should result in no to minimum public exposure.\n\n-The Mount Airy Doggett Water Plant is located west of the town. All chlorine is stored inside a building. This location will assist in any emergency by initially containing a chlorine leak. The local typography at the site favors the containment of any leak. Any release would be directed to Stewarts Creek and be contain"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1267,
      "SummaryText": "ed until dispersed. Also, the site  has a large green belt that will contain most small to medium ( up to 100 pounds) leaks on site. Thus, the impact of a chlorine release from this facility would be small to insignificant to the public.\n\n-In addition to Process Safety Management, the organization has an active safety program. The City has an active Safety Committee. The committee meets monthly and its duties include reviewing new safety procedures, accident investigations, safety surveys and safety communications. The Human Resource Manager for the City also takes an active role in supporting the Utilities Safety Program. \n\nWithin the Utilities department, there are monthly safety meetings to review an OSHA subject or discuss a safety issue. Routine training is conducted for topics such as:\n\n- Hazard Communications\n\n- Personal Protective Equipment\n\n- Lockout/Tagout\n\n- Confined Space\n\nAs a result of our programs, the plants have had an excellent safety record with no recordable injuries over the past three years. As mentioned earlier, there have no reportable chlorine releases from the plants in the last five years.  The city has worked extensively to upgrade its safety program.                                                                                                                                                                                                                                                                                                                                 Finally, in 1997 the City of Mount Airy was awarded STAR status by the North Carolina Department of Labor, the first municipality to achieve this status. We plan to continue our emphasis on safety to maintain and improve our safety performance.\n\nReport by:                                                               \n\nJeff Boyles\nEngineering and Utilities Director"
    }
  ]
}