{
  "FacilityID": 1269,
  "FacilityName": "Hillsboro Farmers Co-op Fertilizer Plant",
  "FacilityStr1": "Air-Rail Road",
  "FacilityStr2": null,
  "FacilityCity": "Hillsboro",
  "FacilityState": "WI",
  "FacilityZipCode": "54634",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55123",
  "LEPC": "Vernon County LEPC",
  "FacilityLatDecDegs": "43.655194",
  "FacilityLongDecDegs": "-90.328694",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "hfcw@mwt.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "Hillsboro Farmers Cooperative Warehouse",
  "Company2Name": null,
  "CompanyDUNS": 23264492,
  "Company2DUNS": null,
  "OperatorName": "Philip Lambert",
  "OperatorStr1": "Air-Rail Road",
  "OperatorStr2": null,
  "OperatorCity": "Hillsboro",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54634",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014593",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-05-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-12-30 00:00:00",
  "DeRegistrationEffectiveDate": "2013-12-20 00:00:00",
  "AnniversaryDate": "2004-05-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.4",
  "FRS_Lat": 43.654351,
  "FRS_Long": -90.330877,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1374,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1269,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1467,
          "ProcessID": 1374,
          "ChemicalID": 56,
          "Quantity": 92820.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1396,
          "ProcessID": 1374,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 282,
              "Process_NAICS_ID": 1396,
              "SafetyReviewDate": "1999-05-18 00:00:00",
              "PHA_Date": "1999-03-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-07 00:00:00",
              "TrainingReviewDate": "1999-05-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-30 00:00:00",
              "EquipmentInspectionDate": "1999-03-30 00:00:00",
              "EquipmentTested": "Vessel, piping, hoses, guages",
              "ChangeMgmtDate": "1999-05-18 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-18 00:00:00",
              "PreStartupReviewDate": "1999-04-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-07 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-18 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 328,
                  "PreventionProgram3ID": 282,
                  "ProcessChemicalID": 1467
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1269,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-07 00:00:00",
    "ERTrainingDate": "1999-04-01 00:00:00",
    "CoordinatingAgencyName": "Vernon County Sheriff Department",
    "CoordinatingAgencyPhone": "8006372123",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1269,
      "SummaryText": "Executive Summary for Anhydrous Ammonia Storage, Retail and Distribution Facilities\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nThe primary function of Hillsboro Farmers Co-op Fertilizer Plant is to act as a fertilizer distribution facility.  By virtue of the toxic effects associated with ammonia, it is necessary to observe certain safety precautions in handling ammonia to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as the health of our co-workers, and to reduce the threat to nearby members of the community.  We are strongly committed to employee, public and environmental safety.  Safety at our facility depends upon the manner in which we handle ammonia as well as on the various safety devices incorporated into the design of our equipment.  Furthermore, comprehensive training received by our employees adds to the inherent safety of our distribution facility.\n\nOur emergency response program is based upon the LEPC, State of Wisconsin and emergency response guide and Chapter 40 CFR Part 68.  In additionto the presence of appropriate controls to prevent possible releases of ammonia, if a release does occur, we are completely coordinated with the Vernon County Sheriff Department, Which provides highly trained emergency response personnel to control and mitigate the effects of a release.\n\n\n2.  The Stationary Source and the Regulated Substances Handled:\nThe primary purpose of this facility is to repackage and distribute anhydrous ammonia to both retail and wholesale customers for use as a fertilizer.  Anhydrous ammonia arrives at our facility via truck and is stored in one storage tank.  This facility has equipment for unloading transports, and equipment to load transports and containers.  Access to this site is restricted to authorized facility employees, authorized management personnel and authorized contractors.\n\nThe regulated substance handled at this facility is ammonia.  The"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1269,
      "SummaryText": "maximum amount of ammonia that can be stored at this plant is 92800.00 lb.\n\n\n3.  The Worst Case Scenario and the Alternate Release Scenario, Including Administrative Controls and      \n     Mitigation Measures to Limit the Distance for each Reported Scenario\nWe have calculated worst case release and alternate release scenarios based on the EPA's RMP*Comp.   \nThe following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for anhydrous ammonia involves a catastrophic release from the anhydrous ammonia tank.  The scenario involves the release of 92800.00 lb of anhydrous ammonia.  The release quantity has been limited by 15 percent resulting from written procedural mechanisms.  It is assumed that the entire quantity is released as a gas, and forms a vapor cloud.  Under worst case weather, the maximum distance of 5.4 miles was obtained corrseponding to an endpoint of 0.14 mg/L.\n\nThe alternative release scenario involves a release of anhydrous ammonia resulting from a failed transfer hose.  In this scenario 42 lb. of ammonia is released in 1 minute.  Under neutral weather conditions the maximum distance of 0.40 miles was obtained corresponding to an endpoint of 0.14 mg/L.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with the State of Wisconsin and the Department of Agriculture.\n\nThe following section briefly describe the release prevention program that is in place at our stationary source.\n\nSAFETY INFORMATION:\nHillsboro Farmers Co-op Fertilizer Plant maintains a detailed record of written safety information, which describes the chemical hazards, operating perameters and equipment designs associated with all aspects of our distribution facility.\n\nHAZARD REVIEW:\nA checklis"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1269,
      "SummaryText": "t methodology is used to carry out hazard reviews at our facility.  The reviews focus on operating procedures, equipment functions and handling practices to identify possible hazards.  The studies are undertaken by a team of qualified personnel with extensive knowledge of facility operations and are revalidated annually.  Any findings related to the hazard reveiws are addressed in a safe and timely manner.\n\nOPERATING PROCEDURES:\nFor the purposes of safely conducting activities within our covered process, Hillsboro Farmers Co-op Fertilizer Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reveiwed and is readily accessible to operators involved with the process.\n\nTRAINING:\nHillsboro Farmers Co-op Fertilizer Plant has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every two years and more frequently as needed.\n\nMAINTENANCE:\nHillsboro Farmers Co-op Fertilizer Plant carries out highly documented maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with previous training in these practices.  Furthermore, personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCOMPLIANCE AUDITS:\nHillsboro Farmers Co-op Fertilizer Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1269,
      "SummaryText": "These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nINCIDENT INVESTIGATION:\nHillsboro Farmers Co-op Fertilizer Plant promptly investigates any incident that has resulted in, or could result in, a catastrophic release of ammonia.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\n\n5.  Five Year Accident History:\nHillsboro Farmers Co-op Fertilizer Plant has had an excellent record of preventing accidental releases over the last five years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n6.  Emergency Response Plan:\nHillboro Farmers Co-op Fertilizer Plant carries a written emergency response plan to deal with accidental releases of ammonia.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nOur facility's emergency response plan is based upon the Local Emergency Government Coordinator's guidelines, who is in contact with the Vernon County Sheriff Department, who is responsible for dispatching and coordinating all emergency personnel.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nVernon County Emergency Government is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n7.  Planned Changes to Improve Safety:\nSeveral developments and findings have resulted from the implementation o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1269,
      "SummaryText": "f the various elements of our accidental release prevention program.  The facility plans to limit access to the storage area to trained and authorized personnel.  A training program will be initiated addressing the hazards, risks, and how to safely handle anhydrous ammonia are some of the major steps we want to take to improve safety at our facility.  These changes shall be implemented by        JUNE 15, 1999.\n\n\n8. Certification Statement:\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\n\nNAME:   Robert Stekel\nSIGNATURE:\nTITLE:    Safety Coordinator\nDATE SIGNED:05/20/99"
    }
  ]
}