{
  "FacilityID": 12714,
  "FacilityName": "Perdue Farms Inc., Salisbury Processing Plant",
  "FacilityStr1": "521 Willow Street",
  "FacilityStr2": null,
  "FacilityCity": "Salisbury",
  "FacilityState": "MD",
  "FacilityZipCode": "21802",
  "Facility4DigitZipExt": "1537",
  "FacilityCountyFIPS": "24045",
  "LEPC": "Wicomico County LEPC",
  "FacilityLatDecDegs": "38.366667",
  "FacilityLongDecDegs": "-75.608333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PF",
  "FacilityURL": "www.perdue.com",
  "FacilityEmailAddress": "tita.cherrier@perdue.com",
  "FacilityDUNS": 49928286,
  "ParentCompanyName": "Perdue Farms Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 22666820,
  "Company2DUNS": null,
  "OperatorName": "Perdue Farms Incorporated",
  "OperatorStr1": "521 Willow Street",
  "OperatorStr2": null,
  "OperatorCity": "Salisbury",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21802",
  "OperatorZipCodeExt": "1537",
  "FTE": 550,
  "OtherEPAFacilityID": "21801PRDNCROUTE",
  "EPAFacilityID": "100000133982",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.365876,
  "FRS_Long": -75.605213,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17029,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 12714,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 21267,
          "ProcessID": 17029,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17454,
          "ProcessID": 17029,
          "NAICSCode": "11232",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 8962,
              "Process_NAICS_ID": 17454,
              "SafetyReviewDate": "1999-05-11 00:00:00",
              "PHA_Date": "1999-09-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1994-10-04 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human Error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Preventive Maintenance Program",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-11 00:00:00",
              "TrainingReviewDate": "1999-05-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Outsourced technical training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-11 00:00:00",
              "EquipmentInspectionDate": "1999-05-11 00:00:00",
              "EquipmentTested": "Entire system",
              "ChangeMgmtDate": "1999-04-13 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-11 00:00:00",
              "PreStartupReviewDate": "1999-05-02 00:00:00",
              "ComplianceAuditDate": "1999-05-11 00:00:00",
              "AuditCompletionDate": "2000-01-01 00:00:00",
              "IncidentInvestigationDate": "1999-05-11 00:00:00",
              "InvestigationChangeDate": "1999-09-01 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-11 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-11 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-29 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12307,
                  "PreventionProgram3ID": 8962,
                  "ProcessChemicalID": 21267
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12714,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-11 00:00:00",
    "ERTrainingDate": "1999-05-04 00:00:00",
    "CoordinatingAgencyName": "LEPC",
    "CoordinatingAgencyPhone": "4105430994",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12714,
      "SummaryText": "Perdue Farms Incorporated, founded in 1920, is the largest poultry producer in the Northeast and the third largest in the United States.  Headquartered in Salisbury, Maryland, the family-owned, privately held company has operations in 14 states.  Twenty processing plants produce about 50 million pounds of poultry products each week.  Perdue also has grain storage and mechandising operations and is ranked among the top 20 largest U.S. grain companies.  Perdue also manufactures edible oils, specialty feeds, livestock ingredients, and premium pet food.\n\nChemical Management Program\n\nAs a concerned member of the communities in which Perdue facilities are located, the company takes its role as a responsible corporate citizen very seriously.  All Perdue facilities are operated so as to protect employees, contractors, and the public from injury and illness, and to minimize environmental impact.  A company-wide safety and wellness program stresses safe working conditions and safe practices.  Perdue's policy is to inspect, maintain, and operate equipment and facilities in a manner that will prevent accidents, including the release of hazardous materials, and,  to train employees in accident prevention while also preparing them to respond rapidly and effectively should an accident occur.\n\nPerdue Farms has developed and implemented Spill Prevention, Control, and Countermeasures (SPCC) and Process Safety Management (PSM) plans at each operations facility as part of an overall chemical management program.  The program involves a wide range of senior management personnel, including the Director of Environmental Services and the Director of Safety and Security.  Additionally, Perdue conducts regular safety meetings and provides training to its staff in the areas of health, safety, and environmental protection.\n\nDescription of Facility and the Regulated Substances\n\nThe Perdue Farms Salisbury Processing Plant Facility is located approximately one mile west of the intersection of U.S."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12714,
      "SummaryText": "Rt. 13 and U.S. Rt. 50 in Salisbury, Maryland.  The facility occupies approximately 10 acres, and is bordered by U.S. Rt. 50 on the north, Lake Street on the east, and West Main Street on the south and west.  Perdue Farms has operated the poultry processing facility at this location since 1968.\n\nThe regulated substance used at the Salisbury Plant is anhydrous ammonia (R-717), which is covered by 40 CFR Part 68.  Anhydrous ammonia is utilized as a refrigerant medium in the facility's mechanical refrigeration system.  The total system capacity for anhydrous ammonia is 40,000 pounds, although the normal operating inventory maintained is approximately 22,000 pounds.  The majority of the significant mechanical components in the system are located outside of the processing plant proper, in either one of the two engine rooms or on the roof of the plant.  Refrigerant piping is located throughout the processing plant.\n\nWorst Casse Release Scenario\n\nThe theoretical absolute worst case release scenario in terms of an uncontrolled release of anhydrous ammonia from the refrigeration facilities would occur in an event involving the total catastrophic structural failure of the high pressure ammonia receiver #2 (HPR #2) resulting in the subsequent release of 100 % of its contents to the atmosphere within a time period of 10 minutes or less.  The liklihood of an event such as this occuring is extremely remote, however, as required by the RMP regulation, the following worst case release scenario has been hypothesized based upon the presumption that the catastrophic failure of HPR #2 could theoretically occur.   HPR #2 has a maximum storage capacity of 12,103 pounds of anhydrous ammonia.  According to the EPA's RMP OCA Guidance Document look-up table,  the distance to the toxic endpoint of 200 parts per million (ppm) airborne anhydrous ammonia,  in the event that a total catastrophic failure of HPR #2 occurred,  would  be  2.5 miles from the point of release.  The critical receptor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12714,
      "SummaryText": "s located within the 2.5 mile radius of the Salisbury Plant include residences, schools, churches, businesses, restaurants, hospitals, elderly care facilities, correctional facilities, and recreational areas.  The estimated maximum population located within the 2.5 mile radius, based upon U.S. Census Bureau information contained in Landview III mapping software, is 33,854.\n\nAlternative Release Scenario\n\nAn unlikely but potential alternative release scenario for the refrigeration facilities is the release of anhydrous ammonia through a broken valve on a liquid ammonia feed line located on the roof of the processing plant.  This type of release could result in up to 6,807 pounds of liquid anhydrous ammonia escaping from the broken line in a time period of approximately 7 minutes. The released liquid ammonia would tend to initially pool on the roof, and then subsequently become airborne as a mixture of ammonia vapor and very fine liquid droplets, which would then ultimately disperse as a dense gaseous mixture.  In this instance, a dense gas atmospheric dispersion computer model (DEGADIS) was used to calculate the distance to the 200 ppm toxic endpoint.  The DEGADIS model predicted that the toxic endpoint would occur at a distance of 0.8 miles from the point of release after an elapsed time of approximately 6 minutes from the release event, and,  that the duration of the 200 ppm level of airborne ammonia concentration would be present at that location for a time period of 5 minutes or less.  Located within the 0.8 mile radius are residences, churches, schools, businesses, restaurants, a hospital, elderly care facilities, a correctional facility, and recreational areas.  The estimated maximum population within the 0.8 mile radius, based upon U.S. Census Bureau information contained in Landview III mapping software, is 2,613.  Further interpretative analysis, performed through the combined use of DEGADIS dispersion modeling and Landview III mapping software, indicates tha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12714,
      "SummaryText": "t the maximum population that could be expected to occur within the predicted plume of dipsersion that anhydous ammonia would follow in the event this release did occur is 146.\n\nGeneral Accident Release Prevention Program\n\nThe Perdue Farms Salisbury Processing Plant maintains a Process Safety (PSM) plan in accordance with the Occupational Safety and Health Administration (OSHA) regulation 29 CFR 1910.119.  The facility also utilizes a preventive maintenance program for the upkeep of its anhydrous ammonia refrigeration system.  As part of this program, trained maintenance personnel frequently monitor and record the system's operational control parameters.  In addition to operating parameters, the condition of the physical components of the system are monitored and recorded on a regular basis.  Preventive maintenance is performed upon the system at regular intervals and as the need is indicated through the ongoing monitoring performed by the maintenance personnel.\n\nFive Year Accident History\n\nThere have been no accidents involving anhydrous ammonia during the past five years that have resulted in death, injuries, property damage, off-site evacuations, environmental damage, or sheltering in place.\n\nEmergency Response Program\n\nThe Perdue Farms Salisbury Processing Plant has implemented a comprehensive Emergency Response Plan in accordance with the OSHA PSM regulations.  The facility has a trained emergency response team that will respond in the event of a hazardous material release, fire, or other emergency situation.  The written Emergency Response Plan contains specific information regarding Emergency Response organization and procedure, as well as incident notification, mitigation, and incident preparedness.  In addition, the facility training program includes annual refreshers for Emergency Response team personnel.\n\nPlanned Changes to Improve Safety\n\nAs part of Perdue's continuous improvement philosophy, all Perdue facilities continue to identify and implement impro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12714,
      "SummaryText": "vements which will help to ensure safety in operations."
    }
  ]
}