{
  "FacilityID": 12836,
  "FacilityName": "Lower Poplar Street WPCF",
  "FacilityStr1": "1101 Lower Poplar Street",
  "FacilityStr2": null,
  "FacilityCity": "Macon",
  "FacilityState": "GA",
  "FacilityZipCode": "31201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13021",
  "LEPC": "Macon Emergency Mgmt. Agency",
  "FacilityLatDecDegs": "32.808333",
  "FacilityLongDecDegs": "-83.609444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.maconwater.org",
  "FacilityEmailAddress": "MWA@maconwater.org",
  "FacilityDUNS": 27456656,
  "ParentCompanyName": "Macon Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 27456656,
  "Company2DUNS": 0,
  "OperatorName": "Macon Water Authority",
  "OperatorStr1": "790 Second Street",
  "OperatorStr2": "P.O. Box 108",
  "OperatorCity": "Macon",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31298",
  "OperatorZipCodeExt": null,
  "RMPContact": "Terry Forrest",
  "RMPTitle": "Plant Manager",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136827",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-03 00:00:00",
  "SafetyInspectionBy": "Jordan, Jones, & Goulding",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Program Level 2",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.81131,
  "FRS_Long": -83.6025,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17242,
      "AltID": null,
      "FacilityID": 12836,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17668,
          "ProcessID": 17242,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21581,
          "ProcessID": 17242,
          "ChemicalID": 62,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521581,
          "ProcessID": 17242,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12836,
      "SummaryText": "                       EXECUTIVE SUMMARY\n\n\nMacon Water Authority maintains a Risk Management Plan for safe chlorine and\nanhydrous ammonia handling that involves an approach that integrates technologies,\nprocedures and management practices to monitor potential hazards and minimize the risk\nof accidental release.  All applicable procedures of 40 CFR 68.170 are addressed in the\nplan, which seeks to provide for employee safety, public health and response agency\ninteraction.\n\nMacon Water Authority utilizes chlorine to disinfect raw water pulled from the Ocmulgee\nRiver at the Riverside Water Treatment Plant and operations will begin at the Town Creek Water\nTreatment Plant sometime in the Fall of 1999.  Once operations at Town Creek are at the\nneeded capacity the Riverside Water Treatment  Plant will be closed.  Chlorine is also used at the\nLower Poplar and Rocky Creek Wastewater Treatment Plants to treat wastewater before it\nis returned to the Ocmulgee River.  In addition, the Rocky Creek Plant also uses\nAnhydrous Ammonia to assist in treating wastewater.  Chlorination processes include\n(liquid) chlorination cylinders, chlorination equipment, and instrument room, electrical\nequipment, and process specific safety equipment.  Ammonia processes include (liquid)\nAnhydrous Ammonia above ground tanks, an instrument room, electrical equipment, and\nprocess specific safety equipment.\n\nFor each chlorination process accidental release modeling was performed for the respective\narea to determine potential consequences associated with operating failures resulting in\naccidental chlorine release.  The first \"worst case\" scenario, defined by EPA, states that\n\"the owner or operator shall assume that the. . . maximum quantity in the largest vessel...is\nreleased as a gas over 10 minutes.\"  The \"alternative scenario\" is \"more likely to occur than\nthe worst-case release scenario.\"  Macon Water Authority has no incident history.\n\nIn each case, atmospheric dispersion modeling was performed to de"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12836,
      "SummaryText": "termine the distance\ntraveled by the chlorine released before its concentration decrease to a theoretical \"toxic\nendpoint.\"  This is defined by the American Industrial Hygiene Association as \"the\nmaximum airborne concentration below which it is believed that nearly all individuals\ncould be exposed for up to one hour without experiencing or developing life-threatening\nhealth effects.\"  The residential population within a perimeter corresponding to the toxic\nendpoint distance was defined to estimate the population potentially affected.\n\nThe worst case release scenario for the Macon Water Authority Plants involves a failure of\na one-ton cylinder yielding a cumulative release of 2,000 lbs of chlorine.  When atmospheric\ndispersion modeling for this unlikely scenario was performed using the RMP* Comp ver.\n1.06 a distance to toxic .9 miles urban and 2.2 miles rural was obtained.  The new Town\nCreek Plant presently under construction is the only plant located in a rural area.\n\nThe alternative release (more likely) scenario for all chlorination processes involves tubing\nfailure, bad connection, or valve failure resulting in the release of 317 lbs of chlorine. \nWhen atmospheric dispersion modeling for this scenario was performed using the RMP*\ncomp Ver. 1.06 a distance to toxic endpoint of .1 miles urban or .1 miles rural was obtained.\n\nThe worst case release scenario for anhydrous ammonia involves a failure of a 10,000\npound tank yielding a cumulative release of 10,000 pounds of ammonia, when atmospheric\ndispersion modeling for this unlikely scenario was performed using the RMP* comp ver.\n1.06 a distance to toxic endpoint of .9 miles urban was obtained.\n\nThe alternative release (more likely) scenario was performed resulting in a release of 10\npounds/minute to a toxic endpoint of .1 miles.\n\nMacon Water Authority Risk Management Program includes the following key elements to\nmitigate the effects of potential chlorine release hazards:\n          \n            Operator Training\n  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12836,
      "SummaryText": "          Preventive Maintenance Program\n            Process specific safety equipment\n            Safe and effective standard operating procedures, written with operator                   \n            participation\n            Hazard review of equipment and procedures and\n            Auditing and inspection programs\n            Comprehensive Management Program\n\nMacon Water Authority has an active environmental, health and safety program with the\nfollowing elements specifically supporting the safe handling of chlorine and the anhydrous\nammonia processes.  \n\n            Respirator protection (SCBA) program\n            Chlorine detectors, ammonia shut off valves\n            Chemical right to know program and\n            Personal protective equipment program\n\nMacon Water Authority plants have an emergency response plan, which has been\ncoordinated with the City of Macon and Bibb County Fire Department which is a member\nof the Local Emergency Planning Committee (LEPC).  Emergency response drills, drill\nevaluations, and facility tours will be conducted annually, at which time emergency\noperation and response procedures are also reviewed.\n\nMacon water Authority takes a pro-active approach to risk management and emergency\nresponse through continuous joint training sessions between MWA employees and local\nresponse agencies.  These preventive measures will provide for the continuous improvement\nof communications and will maintain effective procedures for the safe handling of and\ntimely emergency response to potential chlorine or anhydrous ammonia incidents."
    }
  ]
}