{
  "FacilityID": 1294,
  "FacilityName": "Distribution Development LLC",
  "FacilityStr1": "802 E. Rice Street",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Falls",
  "FacilityState": "SD",
  "FacilityZipCode": "57103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46099",
  "LEPC": "Minnehaha County LEPC",
  "FacilityLatDecDegs": "43.563889",
  "FacilityLongDecDegs": "-96.715",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7909161,
  "ParentCompanyName": "Americold Logistics",
  "Company2Name": "John Morrell & Company",
  "CompanyDUNS": 5213772,
  "Company2DUNS": 43205053,
  "OperatorName": "Americold Logistics",
  "OperatorStr1": "802 E. Rice Street",
  "OperatorStr2": null,
  "OperatorCity": "Sioux Falls",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57103",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Robertson",
  "RMPTitle": "Plant Manager",
  "FTE": 115,
  "OtherEPAFacilityID": "57117JHNMR1400",
  "EPAFacilityID": "100000015208",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-04-23 00:00:00",
  "DeRegistrationEffectiveDate": "2009-06-17 00:00:00",
  "AnniversaryDate": "2004-05-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 43.56197,
  "FRS_Long": -96.71612,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "New owner & operator Ammericold no longer controls or operates the source",
  "_processes": [
    {
      "ProcessID": 1401,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1294,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1423,
          "ProcessID": 1401,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1494,
          "ProcessID": 1401,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501494,
          "ProcessID": 1401,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1294,
      "SummaryText": "This submittal informs all interested parties that Americold Logistics, Inc. is participating in the OSHA Process Safety Management (PSM) program defined in 29 CFR 1910.119, and the EPA Risk Management Program (RMP) defined in 40 CFR Part 68.  These programs provide for the implementation of detailed prevention and response procedures when storing and handling hazardous chemicals.  The program objectives are to ensure worker and public safety and provide environmental protection.\n\nOur Accidental Release Prevention and Emergency Response Policies\n\nIt is the policy of Americold Logistics to conduct all of its operations in a manner, which is consistent with protecting human health and the environment.  It is our policy to comply with all laws and regulations applicable to our operations, including, but not limited to all permitting, recordekeeping, and reporting requirements.  It is our policy that employees and contractors are properly trained and that they have access to information.  It is our policy to audit compliance with applicable laws and regulations and to promptly remedy any noncompliance.\n\nBecause there is absolutely no envisioned gain worth injury or loss of life, Americold Logistics is committed to safety.  This commitment is demonstrated through our monthly safety training sessions for  employees.  In addition, employees working directly with applicable hazardous chemicals receive annual 8-hour hazardous materials refresher training.\n\nEach year, the written release prevention and emergency response plan is reviewed and/or updated for the facility.  Each year, the company reports the location and quantity of hazardous chemicals stored at their facility to the local fire department, the local emergency planning committee and the state emergency planning committee.  Each year, the company reports the amount of hazardous chemicals used and/or released to the environment to state and/or federal regulatory agencies.\n\nOur Facility and Regulated Substances Hand"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1294,
      "SummaryText": "led\n\nAmericold Logistics owns and operates a refrigerated warehouse in association with the John Morrell & Company meat packing plant located in Sioux Falls, South Dakota.  The warehouse is located adjacent to the meat packing plant and is used for storing and shipping finished meat products. \n\nThe warehouse has its own ammonia refrigeration system. The ammonia is altered between a liquid and a gas state in a series of compressors, condensors and evaporators to maintain desired storage temperatures. The anhydrous ammonia used in this system is the only chemical at the warehouse that is regulated under the PSM and RMP program.\n\nOur Worst-Case and Alternate Release Scenarios\n\nThe distance to the toxic endpoint (0.14 mg/L) of the worst-case release of ammonia extends 1.2 miles offsite.  This scenario assumes that the largest vessel of 10,000 pounds of liquid ammonia is released over 10 minutes with a wind speed of 1.5 m/s and an atmospheric stability class of F.  The EPA Model RMP for Ammonia Refrigeration Guidance, 6/98 was followed and no administrative or passive mitigation factors were assumed.\n\nThe distance to the toxic endpoint (0.14 mg/L) of the alternate-case release of ammonia extends 0.25 miles offsite.  This scenario also assumes 10,000 pounds of liquid ammonia is released over 10 minutes, however, the wind speed is assumed to be 3 m/s and the atmospheric stability class is D.\n\nOur General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe following lists rules, regulations and standards that the company believes are important to their prevention program:\n\n   OSHA Process Safety Management Program 29 CFR 1910.119\n   EPA Risk Management Program 40 CFR 68\n   OSHA Emergency Action Plan Program 29 CFR 1910.38\n   ANSI/IIAR2 standards for equipment design, installation and operation\n\nThe company also implements a maintenance management system that tracks and schedules work orders for preventive, predictive and corrective maintenance "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1294,
      "SummaryText": "as well as tracks parts inventory.  This system helps provide quality control in making sure the right parts and materials are ordered and that the equipment is serviced in a timely manner.\n\nOur Five Year Accident History\n\nThe facility has had no accidental releases or near misses of a catastrophic nature that involved injury to their employees or surrounding residents.  There have been no accidental releases involving off-site evacuation, significant property damage or environmental impairment.\n\nOur Emergency Response Program\n\nThe facility implements an integrated contingency plan to address all emergency response scenarios.  These scenarios include response procedures for various types of chemical releases, fires, floods and other system failures and natural disasters.  This plan is reviewed annually and made available to the local fire department and the local emergency planning committee.\n\nOur Planned Changes to Improve Safety\n\nNo substantial projects are currently planned.  Our procedures are established to promote continuous improvement in our operations through inspection, training and auditiing."
    }
  ]
}