{
  "FacilityID": 12979,
  "FacilityName": "McWhorter Technologies, Inc. - Portland, Oregon",
  "FacilityStr1": "4155 NW Yeon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41051",
  "LEPC": "Portland Fire Department/ECHO",
  "FacilityLatDecDegs": "45.551583",
  "FacilityLongDecDegs": "-122.725889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 34693291,
  "ParentCompanyName": "McWhorter Technologies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 34693291,
  "Company2DUNS": 0,
  "OperatorName": "McWhorter Technologies, Inc.",
  "OperatorStr1": "4155 Northwest Yeon Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97210",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": "97210THMCC4155N",
  "EPAFacilityID": "100000055628",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-04-05 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-01 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 45.55282,
  "FRS_Long": -122.72871,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17439,
      "AltID": "Vinyl Acetate Monomer",
      "FacilityID": 12979,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 21816,
          "ProcessID": 17439,
          "ChemicalID": 29,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17870,
          "ProcessID": 17439,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9191,
              "Process_NAICS_ID": 17870,
              "SafetyReviewDate": "1998-02-13 00:00:00",
              "PHA_Date": "1996-10-15 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-10-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Staff Observation",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-02-13 00:00:00",
              "TrainingReviewDate": "1998-02-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-02-13 00:00:00",
              "EquipmentInspectionDate": "1998-12-30 00:00:00",
              "EquipmentTested": "Mono blend tank",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-06-19 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1996-10-23 00:00:00",
              "AuditCompletionDate": "1999-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-02-13 00:00:00",
              "HotWorkPermitReviewDate": "1998-04-09 00:00:00",
              "ContractorSafetyReviewDate": "1998-06-03 00:00:00",
              "ContractorSafetyEvalDate": "1998-02-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "McWhorter Process Safety Management Manual",
              "_chemicals": [
                {
                  "PrimaryKey": 12645,
                  "PreventionProgram3ID": 9191,
                  "ProcessChemicalID": 21816
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 12979,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-01-29 00:00:00",
    "ERTrainingDate": "1998-04-18 00:00:00",
    "CoordinatingAgencyName": "City of Portland Fire Department",
    "CoordinatingAgencyPhone": "5032302121",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12979,
      "SummaryText": "Risk Management Program Executive Summary\nMcWhorter Technologies, Inc. Portland Oregon Facility\n\n1. Accidental Release Prevention and Emergency Response Policies\nMcWhorter Technologies, Inc. (MWT) makes latex paint feed stock material using vinyl acetate monomer.  This is the only RMP regulated process conducted at the Portland Facility.  By virtue of the toxic and flammable effects associated with vinyl acetate monomer, it is necessary to observe certain safety precautions in handling the material to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as the health of our co-workers, and to reduce the threat to nearby members of the community.  MWT is strongly committed to employee, public and environmental safety.  Safety at our facility depends upon the manner in which we handle raw materials as well as on the various safety devices incorporated into the design of our equipment.  Furthermore, comprehensive training received by our employees adds to the inherent safety of our distribution facility.\n\n\n2. Regulated Substances Handled\nThe primary purpose of this facility is to formulate paint stock for use by paint manufacturers.  Vinyl acetate monomer arrives at our facility via tanker truck and is stored in below-ground tanks.  This facility has equipment for safe unloading of tanker trucks.  Access to the facility site is restricted to authorized facility employees, authorized management personnel and authorized contractors. \n\nThe regulated substance handled at this facility is vinyl acetate monomer.  The maximum amount of vinyl acetate monomer that can be stored at this plant is 13,000 gallons.  However, the vinyl acetate monomer is stored in underground storage tanks which passively mitigates any potential release.  Thus, the worst case release would be from an enclosed 2,000 gallon blending vessel.  This vessel is managed to contain a maximum volume of 1,500 gallons of vinyl acetate monomer.\n\n\n3. The Worst Case Release Sc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12979,
      "SummaryText": "enario and the Alternative Release Scenario, Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario:\nWe have calculated worst case release scenarios using the EPA's RMP*Comp dispersion model.  For alternative release scenario analyses, we have employed the equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for vinyl acetate monomer involves a catastrophic release of 1,500 gallons of vinyl acetate monomer from a 2,000-gallon mixing vessel inside the process building (a release from the underground storage tank would be passively mitigated).  The scenario involves the release of the entire charge of 1,500 gallons from the tank in one minute.  The building that houses the tank has passive mitigation devices including a perimeter berm and sumps. The release rate to the atmosphere is limited by these mechanisms.  The toxic end-point for vinyl acetate monomer is 0.25 mg/l. Under worst case weather, the maximum distance a release from the worst-case release is 0.10 mile.  Such a release could impact offsite industrial areas, and based on 1990 census data, up to 10 persons in residences in the area. \n\nThe alternative release scenario involves a piping release at the rate of 90 gallons per minute for a five minute duration.  In this scenario 450 gallons of vinyl acetate monomer is released in 5 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint is 0.2 miles.  Such a release could impact offsite industrial areas and a residential population of up to 12 persons.\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nMWT has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12979,
      "SummaryText": " with uniform building codes, City and State Fire Codes, and internal corporate safety standards.\n\nThe following sections briefly describe the release prevention program that is in place at our stationary source.\n\nSafety Information\nMWT maintains a detailed record of written safety information, which describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.  \n\nHazard Review\nA checklist is used to carry out hazard reviews at our facility. The reviews focus on operating procedures, equipment functions and handling practices to identify possible hazards.  The studies are undertaken by a team of qualified personnel with extensive knowledge of facility operations and are revalidated at a regular interval each year.  Any findings related to the hazard reviews are addressed in a safe and timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes MWT maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nMWT has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every year and more frequently as needed.  \n\nMaintenance\nMWT carries out highly documented maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with previous training in these practices. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12979,
      "SummaryText": " Furthermore, personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits\nMWT conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  \n\nIncident Investigation\nMWT promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of vinyl acetate monomer. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\n\n5. Five-year Accident History\nMWT has an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.  \n\n\n6. Emergency Response Plan\nMWT has a written emergency response plan to deal with accidental releases of vinyl acetate monomer.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.         \n\n\n7. Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Improvements to impoundment dikes around the facility have been made to improve safety at "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12979,
      "SummaryText": "our facility.  \n\n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nSignature:\nTitle:\nDate signed:"
    }
  ]
}