{
  "FacilityID": 12974,
  "FacilityName": "Anheuser-Busch, Inc.",
  "FacilityStr1": "3101 Busch Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fairfield",
  "FacilityState": "CA",
  "FacilityZipCode": "94533",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06095",
  "LEPC": null,
  "FacilityLatDecDegs": "38.25",
  "FacilityLongDecDegs": "122.05",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.anheuser-busch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6288799,
  "ParentCompanyName": "Anheuser Busch Companies",
  "Company2Name": null,
  "CompanyDUNS": 98630254,
  "Company2DUNS": 0,
  "OperatorName": "Anheuser-Busch, Inc",
  "OperatorStr1": "3101 Busch Drive",
  "OperatorStr2": null,
  "OperatorCity": "Fairfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94533",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robart Wachter",
  "RMPTitle": "Resident EHS Manager",
  "FTE": 492,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052426",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Under review",
  "SafetyInspectionDate": "1999-06-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.23864,
  "FRS_Long": -122.08446,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17434,
      "AltID": "Chlorine Disinfect. Syst.",
      "FacilityID": 12974,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 17865,
          "ProcessID": 17434,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 21811,
          "ProcessID": 17434,
          "ChemicalID": 62,
          "Quantity": 150.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 521811,
          "ProcessID": 17434,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 12974,
      "SummaryText": "Risk Reduction Policies\n \nThe management of the Anheuser-Busch brewery in Fairfield, CA, recognizes and shares the communitys interest in safe operation of our facility.  We have completed this report under the U.S. Environmental Protection Agencys (EPA) risk management program (RMP) to communicate our efforts to achieve a safe workplace.  \n\nThe chlorine addition systems at the Fairfield Brewery are designed to control microbial growth.  Properly chlorinated water is essential in the production process.  Employee and public safety can be affected when the chlorine systems are improperly operated.  Chlorine is one of the materials covered under the U.S. Environmental Protection Agencys Risk Management Program regulations.  The brewery follows these regulations, as well as others, to ensure that it safely handles, uses, and stores chlorine and other potentially hazardous chemicals safely.  The brewery has had no releases of chlorine that resulted in injuries to people, harm to property, or damage to the environment since it opened in 1976.\n\nOur corporate environmental, health, and safety (EHS) policy and requirements promote the overall safety of this brewery, employees, and the public.  This policy includes risk reduction programs that provide assurance for the safe management of process risks to prevent environmental, health and safety incidents and to protect the workplace, the community and the environment. These programs enable the brewery to prevent the occurrence, or minimize the consequences of, significant releases of chlorine.  \n \nIt is Anheuser-Busch's policy to conduct our business in accordance with all applicable laws, regulations, and permits and to promote a safe workplace and a quality environment.  Each employee is trained and required to comply strictly with this policy.  We do not allow production goals or financial objectives to over-ride safety and environmental concerns.  \n \nAlso, it is Anheuser-Busch's policy to lead by example so that other"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 12974,
      "SummaryText": " companies, including vendors and suppliers, are similarly interested in protecting the health and safety of employees and safeguarding the environment.  We are committed to the spirit as well as the letter of our EHS policy and promote, throughout the organization, responsibility and accountability for strict compliance with that policy.  Anheuser-Busch employees whose actions in the performance of their duties may affect the environment and/or public health are trained sufficiently to permit them to comply strictly with our EHS policy. \n\nIn conducting our businesses, we continue to seek and implement cost effective methods to reduce the EHS impact of our operations.  We integrate EHS considerations into our business planning and decision-making processes, including product research and development, packaging, and new manufacturing methods.  Our continuous EHS improvement goals include pollution prevention and resource conservation.  We ask our contractors to adopt EHS standards, ethics, and policies similar to our own and we will give preference to suppliers that do so.\n \nWe encourage our employees, customers, and the public to share with us their EHS concerns.  We continually talk with local authorities in communities in which we operate to share ideas about preventing incidents with materials we use or store.\n \nChlorine Disinfection System\n \nThe chlorine disinfection system at the Fairfield Brewery is designed to control microbial growth.  Properly chlorinated water is essential in the production process.  Employee and public safety can be affected when the chlorine systems are improperly operated.  Because of the characteristics of chlorine, our employees observe certain safety precautions to prevent unnecessary human and environmental exposure, both within the brewery and in the surrounding community.\n \nWorst-Case Release Scenario\n \nAs required by the EPA's Risk Management regulation, we have identified an extremely unlikely \"worst-case\" scenario in which a ve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 12974,
      "SummaryText": "ssel (cylinder) ruptures releasing 150 pounds of chlorine. Under worst-case weather conditions and with no mitigating actions, chlorine could travel 0.8 miles before dispersing enough to no longer pose a threat to the public.\n \nThis scenario is unlikely to occur at the Fairfield brewery for a number of reasons: \n\nWe meet or exceed industry standards for the manufacture and quality control of pipes and vessels that contain chlorine used at our facility;\nManual safety valves allow the immediate shut-off of the chlorine system (described below);\nEquipment is inspected and kept in proper working order and replaced when necessary; \nWorst-case weather conditions as assumed in by the definition of \"worst case\" are uncommon in the Fairfield area; \nThe brewery has an emergency response plan and equipment in place (see description below).\n \nAlternative Release Scenario\n \nAn alternative release scenario would be due to diaphram, valve, or gasket leak from chlorine cylinder ( 1/16 inch diameter hole).  This leak would cause 96 pounds to be released in over ten minutes.  Under common weather conditions, this amount of chlorine could travel 0.15 miles (240 yards) before dispersing enough to no longer pose a threat to the public.\n \nThis scenario is unlikely for the same reasons presented in the discussion above regarding the worst-case release.\n \nAccidental Release Prevention Program\n \nAnheuser-Busch has years of experience operating chlorine-based refrigeration systems at its breweries.  This experience has helped bring about designs and operating plans that produce a safe system.  No chlorine releases from any of the companys breweries have ever resulted in consequences off brewery property.  The following elements have produced this safe operating record:\n\nProcess hazard review, including corrective action follow-up requirements;\nStandard operating procedures that all operators of the chlorine system must follow;\nFormal operator training ;\nPreventative maintenance to ensure th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 12974,
      "SummaryText": "at the entire chlorine system is mechanically sound;\nProcedures to ensure that changes to the chlorine system are managed so chlorine flow remains safe;\nSafety review prior to the startup of new or modified equipment;\nAudits of the RMP program;\nIncident investigations to ensure that lessons are learned to prevent future incidents;\nEmployee involvement in risk reduction programs;\nContractor safety procedures are reviewed to ensure outside workers exercise the same safety consciousness as brewery employees;\nA work permit system that ensures all welding work is conducted safely.\nProcess safety information; and \nEmergency planning and response.\n \nFive-Year Accident History\n  \nThe brewery has had no chlorine releases that have caused onsite or offsite injuries, or damage to property or the environment.  In fact, the brewery has never had releases with these impacts since it began operation in 1976.\n \nEmergency Response Program\n \nThe Fairfield brewery has in place a variety of emergency response procedures in the event of an incident involving chlorine.  The emergency response program is based on OSHA's requirements for emergency action plans (29 CFR 1910.38) and HAZWOPER (29 CFR 1910.120).  We have trained employees for emergency response and maintain a \"Contingency and Emergency Response Plan\" (CERP) which has been supplied to, and discussed with, the Solano County Dep. of Environ. Mgt..  We conduct annual drills with local agencies to help us remain prepared to implement the CERP at the brewery. \n \nBrewery personnel notify local agencies when emergency response is needed.  Local agencies determine if the public needs to be notified.  If it is determined that the public needs to be notified, the local agencies perform the notification task.\n \nPlanned Changes to Improve Safety\n \nAnheuser-Buschs Fairfield brewery chlorine system is periodically modified to improve safety.  In fact, the Fairfield Brewery plans to replace the chlorine gas system with a safer sodium hypochl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 12974,
      "SummaryText": "orite system by January 1, 2000.  \n\nConclusion\n\nAnheuser-Busch is pleased to share its record of safe operations with the citizens of Fairfield.  We believe the Risk Management Plan under which we are providing this information is an important tool for encouraging communications with our neighbors.  Although we are confident the \"worst case\" and \"alternative\" scenarios presented in this report are highly unlikely, we want you, our neighbors, to know we are prepared to respond quickly and effectively should one ever occur.  Anheuser-Busch has worked hard over the years to ensure the highest standard of safety.  Our goal is to continue the excellent and safe track record."
    }
  ]
}