{
  "FacilityID": 13059,
  "FacilityName": "El Paso Tembec Cryogenic Plant",
  "FacilityStr1": "796 Township Road",
  "FacilityStr2": null,
  "FacilityCity": "Waynesbury",
  "FacilityState": "PA",
  "FacilityZipCode": "14370",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42059",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "39.900833",
  "FacilityLongDecDegs": "-80.182222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8007703,
  "ParentCompanyName": "El Paso Energy",
  "Company2Name": null,
  "CompanyDUNS": 837495894,
  "Company2DUNS": null,
  "OperatorName": "El Paso Field Services",
  "OperatorStr1": "400 Travis Street",
  "OperatorStr2": "Suite 1140",
  "OperatorCity": "Shreveport",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71101",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000137666",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "30-312-002",
  "SafetyInspectionDate": "1998-10-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-06-12 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.90054,
  "FRS_Long": -80.15279,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17573,
      "AltID": null,
      "FacilityID": 13059,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22062,
          "ProcessID": 17573,
          "ChemicalID": 155,
          "Quantity": 119682.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 13841,
              "ProcessChemicalID": 22062,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 13842,
              "ProcessChemicalID": 22062,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 13843,
              "ProcessChemicalID": 22062,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 13844,
              "ProcessChemicalID": 22062,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 13845,
              "ProcessChemicalID": 22062,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 13846,
              "ProcessChemicalID": 22062,
              "ChemicalID": 94
            }
          ]
        },
        {
          "ProcessChemicalID": 22063,
          "ProcessID": 17573,
          "ChemicalID": 98,
          "Quantity": 110800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 22064,
          "ProcessID": 17573,
          "ChemicalID": 118,
          "Quantity": 120000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18008,
          "ProcessID": 17573,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9284,
              "Process_NAICS_ID": 18008,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "PHA_Date": "1997-03-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-03-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Shutdown System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-04-10 00:00:00",
              "TrainingReviewDate": "1997-05-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-02-26 00:00:00",
              "EquipmentInspectionDate": "1999-06-02 00:00:00",
              "EquipmentTested": "Relief valves",
              "ChangeMgmtDate": "1997-08-15 00:00:00",
              "ChangeMgmtReviewDate": "1998-05-22 00:00:00",
              "PreStartupReviewDate": "1998-05-22 00:00:00",
              "ComplianceAuditDate": "1997-01-15 00:00:00",
              "AuditCompletionDate": "1997-01-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-02-26 00:00:00",
              "HotWorkPermitReviewDate": "1997-08-15 00:00:00",
              "ContractorSafetyReviewDate": "1998-10-26 00:00:00",
              "ContractorSafetyEvalDate": "1997-08-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12846,
                  "PreventionProgram3ID": 9284,
                  "ProcessChemicalID": 22062
                },
                {
                  "PrimaryKey": 12847,
                  "PreventionProgram3ID": 9284,
                  "ProcessChemicalID": 22063
                },
                {
                  "PrimaryKey": 12848,
                  "PreventionProgram3ID": 9284,
                  "ProcessChemicalID": 22064
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13059,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Waynesburg Volunteer Fire Dept.",
    "CoordinatingAgencyPhone": "7246275246",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 13059,
      "SummaryText": "xture represents the facility's WCS for flammables.\n\nBecause methane was identified as having the highest heat of combustion (50,029 Kjoule/Kg) while acting only as a minor component, it was determined that the direct calculation method, using methane's heat of combustion, would provide a more conservative consequence distance.  The calculation resulted in a distance to endpoint radius of 0.53 miles.  The distance to endpoint exceeds the distance to an identified public receptor.  Therefore, the Tembec Cryogenic Plant is classified as a Program 3 process.\n \nToxic Liquids and Gases\n \nToxic gases include all regulated toxic substances that are gases at ambient temperature (temperature 25: C, 770F), even if they are stored as liquids under pressure or refrigeration.  For the consequence analysis, a gaseous release of the total quantity is assumed to occur in 10 minutes, regardless of storage conditions.   For toxic liquids, the total quantity in a vessel is assumed to be spilled onto a flat, non-absorbing surface.  For toxic liquids carried in pipelines, the quantity that might be released for the pipeline is assumed to form a pool.  Passive mitigation systems may be taken into account in consequence analysis for both toxic gases and liquids. The endpoint for air dispersion modeling to estimate the consequence distance for a release of a toxic gas and liquid is presented for each regulated toxic gas and liquid in Appendix B of the OCAGD in Exhibits B-1 and B-2, respectively.\n\nThe Tembec Cryogenic Plant does not have any toxic substances held above the threshold quantity.  Analysis of one worst-case release scenario for all regulated toxic substances is, therefore, not required.\n\nAlternative Release Scenarios (ARS)\n\nAn ARS describes an incident that is more likely to occur than those cited for a WCS.  One ARS analysis is required for each listed toxic substance in a covered process that exceeds threshold quantity while only one ARS analysis is required for all flammable"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 13059,
      "SummaryText": "TEMBEC CRYOGENIC PLANT RISK MANAGEMENT PLAN:  EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Tembec Cryogenic Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes.  The El Paso Field Services (EPFS) policy is to implement reasonable controls to prevent foreseeable releases of substances. \n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nEPFS operates the Tembec Cryogenic Plant located in Greene County, Pennsylvania.  The Tembec Cryogenic Plant is a liquid extraction plant capable of recovering ethane in addition to propane, butanes, and gasoline from the inlet gas.  Mixed liquids product is shipped out via tanker truck.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention Program (ARP), the Tembec Cryogenic Plant is a Program 3 process.\n\nThe Tembec Cryogenic Plant was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity.  Based on process knowledge, EPFS identified the regulated substances and quantities kept on site.\n\nEPFS identified four regulated flammable substances/mixtures and zero regulated toxic substances along with the total quantity stored.  Listed flammable substances which are stored above threshold quantities at Tembec Cryogenic Plant include L.P.G. Raw Mix, Butane, Propane, and Natural Gasoline.  EPFS has determined, however, that natural gasoline is exempt from threshold determination according to 40CFR 68.115(b)(2)(iii).  The identification of the presence of L.P.G. Raw Mix, Propane, and Butane in amounts exceeding the threshold amount for a flammable substance makes these regulated substances subject to threshold determination for offsite consequence analysis.\n\nOFF-SITE CONSEQUENCE A"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13059,
      "SummaryText": "NALYSIS RESULTS\n\nWorst-Case Scenarios (WCS)\n\nThe Environmental Protection Agency (EPA) has defined a worst-case release as the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  A WCS analysis is required for each toxic substance in a covered process while only one WCS analysis is required for regulated flammable substances as a class.  WCSs are assumed to occur at ground level with meteorological conditions defined as atmospheric stability class F (stable atmosphere), wind speed of 1.0 meters per second (2.2 miles per hour), and an ambient air temperature of 25:C (770F).  Topography for WCSs are distinguished between rural and urban.\n \nFlammable Substances\n \nRegulated flammable substances or mixtures containing flammable substances include both gases and volatile liquids.  The WCS assumes that the total quantity of a vapor cloud is released and detonates.  The endpoint for a WCS involving a regulated flammable substance or mixture is an over pressure of 1 pound per square inch (psi).  For a regulated flammable substance, consequence distance determination is based on its heat of combustion.  For regulated flammable mixtures, the component with the highest heat of combustion can be used for consequence distance determination or, if preferred, directly calculated using equation C-1 of the Offsite Consequence Analysis Guidance Document (OCAGD).  The quantity of a regulated substance/mixture used to determine distance to endpoint is the largest quantity of a regulated substance/mixture in a single vessel.\n \nThe L.P.G. Raw Mixture, containing pentane, propane, butane, methane, and ethane, is in either liquid or gas form and sent via pipeline for fractionation.  The largest quantity is stored in liquid form and contained in any one of two storage vessels each having a capacity of 30,000 gallong (119,682 lbs.).  Using the criteria outlined in the ARP rule, this mi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13059,
      "SummaryText": "substances as a class.  For ARSs, both active and passive mitigation systems can be considered.\n \nAlternative release scenarios for flammable substances should have the potential to cause substantial damage, including on-site damage.  Alternative release scenarios for toxic substances should be those that lead to concentrations above the toxic endpoint beyond the process fenceline.  Those releases that have the potential to reach the public are of the greatest concern.\n\nFlammable Substances\n\nA single ARS is required for flammable substances/mixtures under the ARP Program.  A hopothetical, but likely to occur, release scenario has been identified as follows: Seal failure on the pump causes a release from a one-inch opening at 850 psig and 2500F the release is assumed to continue for ten minutes.  The flammable substance will vaporize and may ignite a vapor cloud explosion with an endpoint of 1 psi over pressure.\n\nOf the three flammable liquids (L.P.G. Raw Mix, Butane, Propane) stored at the site in quantities above the threshold amount, a release of butane gives the most conservative alternative release scenario.  It was determined that a 10-minute release would involve 7341 pounds of butane.  Using the TNT equivolency formula from the OCAGD, the distance to endpoint for butane was determined to 0.16 miles.\n\nToxic Substances\n\nThe Tembec Cryogenic Plant does not have any toxic substances held above the threshold quantity.  Analysis of each regulated toxic substance is, therefore, not required.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no offsite releases or on-site incidents that required to be reported under the ARP at the Tembec Cryogenic Plant within the past five years.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the plant. Because processes at the gas plant regulated by the EPA's risk management program (RMP) regulations are also subject to the OSHA's PSM standard, this summary addr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13059,
      "SummaryText": "esses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation\n\nEPFS and the Tembec Cryogenic Plant actively encourages all levels of employees and contract employees to participate in creating a safe work environment.   This participation begins with well established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining PSM rule compliance based on their knowledge, skill, job responsibilities, and experience.  Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the plant and addresses each accident prevention program element. \n\nProcess Safety Information \n\nThe Tembec Cryogenic Plant maintains written information intended to provide a foundation for identifying and understanding the hazards involved in the process.  This information addresses chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  Specific departments within the gas plant are assigned responsibility for maintaining up-to-date process safety information.  \n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by documents that specifically address known corrosion concerns and any known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  For specific process areas, the gas plant has documented safety-related limits for specific process parameters (e.g., temperature level, composition).  The plant ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13059,
      "SummaryText": "ument systems (e.g., automated shutdown systems).\n\nThe plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  In combination with written procedures and trained personnel, this information provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised. \n\nProcess Hazard Analysis (PHA)\n\nThe Tembec Cryogenic Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Tembec Cryogenic Plant uses the hazard and operability (HAZOP) study to perform these evaluations.  A HAZOP study uses a highly structured approach where process parameters such as flow and temperature are examined for deviations from their assigned intent.  The effects of these deviations are considered to determine if potential hazards will result and preliminary recommendations for possible improvements may be proposed.  What if analysis may also be used.  This process utilizes questions that postulate mistakes in operations or failure of equipment.  Based on the answers to the questions, consequences and preliminary recommendations can be determined.\n\nThe PHA team findings are promptly and systematically addressed.  The Tembec Plant assures that the recommendations are resolved in a timely manner and that the resolution is documented.  This documentation includes the actions to be taken, a written schedule of  completion dates, and proof of communication with operating, maintenance, and other employees whose work assignments are in the"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 13059,
      "SummaryText": "process and who may be affected by the recommendations or actions.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years by the PHA team.  \n\nOperating Procedures\n\nThe Tembec Cryogenic Plant maintains written procedures that address various modes of process operations, such as (1)  initial startup, (2)  normal operations, (3) temporary operations, (4)  emergency shutdown, (5)  emergency operations, (6)  normal shutdown, and (7) startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and certified as current and accurate when a process change occurs.  The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\n\nTraining\n\nTo complement the written procedures for process operations, the Tembec Cryogenic Plant has implemented a comprehensive training program for all employees involved in operating a process.  New employees receive job specific basic training in gas plant operations if the are not already familiar with such operations. This includes both classroom and on the job training followed by demonstrations, observations, and written tests.  After operators demonstrate having adequate knowledge to perform the duties and tasks in a safe manner, they can work independently. \n\nContractors\n\nThe Tembec Cryogenic Plant periodically uses contractors to perform maintenance or repair, turnaround, major renovations, or specialty work on  or adjacent to a covered process.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) are t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 13059,
      "SummaryText": "rained in the work practices necessary to safely perform his/her job, (2) have received and understood the training required and carries a training document card while on location, (3) follows the safety rules of the location including the safe work practices, (4) advises the plant of any unique hazards presented by the contractor, and (5) notifies the facility of all illnesses and injuries that occur in the process areas.  This information is in addition to maintaining their own OSHA 200 log.\n\nHot Work Permit\n\nThe Tembec Cryogenic Plant issues a Hot Work Permit for all hot work operations conducted on or near a covered process.  Procedures for issuing a Hot Work Permit are clearly outlined in the plant's Safety and Health Handbook for Hot Work Permits.  The Tembec Cryogenic Plant provides Hot Work Permit training to all plant employees while shadowing is the method by which Hot Work Permit procedures are demonstrated.  Copies of issued work permits are maintained for a period of 30 days in the PSM Hot Work Permit file.\n\nPre-Startup Safety Reviews (PSSRs)\n\nThe Tembec Cryogenic Plant conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an additional check to make sure that construction and equipment are in accordance with design specification, adequate safety, operating, maintenance, and emergency procedures are in place, training of each employee involved in operating the process or equipment has been completed, and  when significant modifications are made to a plant.  The PSSR review team uses a standard checklist to document compliance.\n\n\nMechanical Integrity\n\nThe Tembec Cryogenic Plant has well-established programs, procedures and practices that are required to ensure that equipment used to process, store, or ha"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 13059,
      "SummaryText": "ndle lightly hazardous chemicals and/or flammable gas or liquid is designed, constructed, installed, and maintained to minimize the risk of a release. Examples of the equipment include vessels, storage tanks, piping systems (including piping components such as valves), relief and vent systems including associated devices, pumps, emergency shutdown systems and controls (including monitoring devices and sensors, alarms, and interlocks). \n\nMaintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employee's job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to ensure safe operation.\n\nManagement of Change \n\nThe Tembec Cryogenic Plant has a comprehensive system to manage and document changes to all covered processes.  Their systematic approach is followed to control and manage changes to process facilities in order to minimize the probability that such changes will have an adverse impact on the safety of personnel, equipment, or the environment. Employees involved in operating a process and maintenance and contract employees whose job tasks are might be affected by a change in the process are informed of, and trained in, the change prior to start-up of the process or affected part of the process.\n\nIncident Investigation\n\nThe Tembec Cryogenic Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigati"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 13059,
      "SummaryText": "on is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. \n\nEmergency Planning and Response\n\nThe Tembec Cryogenic Plant retains a written site specific formal emergency response plan  which includes the designated actions the company and all personnel will take to ensure personal safety from  fire and other emergencies.  The plan outlines actions that company technicians and contract employees are to take when there is an unwanted release of highly hazardous chemicals.  The intent of these requirements is to facilitate the prompt evacuation of employees when necessary and to account for all personnel.  The emergency plan also includes procedures for handling small releases.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Tembec Cryogenic Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  The audit team  includes those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained."
    }
  ]
}