{
  "FacilityID": 13052,
  "FacilityName": "Taft Plant",
  "FacilityStr1": "17245 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Hahnville",
  "FacilityState": "LA",
  "FacilityZipCode": "70057",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22089",
  "LEPC": "St. Charles Parish LEPC",
  "FacilityLatDecDegs": "29.992778",
  "FacilityLongDecDegs": "-90.459806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 807195722,
  "ParentCompanyName": "IMC-Agrico",
  "Company2Name": "IMC Global",
  "CompanyDUNS": 807195722,
  "Company2DUNS": 0,
  "OperatorName": "IMC-Agrico",
  "OperatorStr1": "17245 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Hahnville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70057",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "LAD06545187",
  "EPAFacilityID": "100000137513",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "La. DEQ # 2720",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "1999-10-28 00:00:00",
  "DeRegistrationEffectiveDate": "1999-10-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.99027,
  "FRS_Long": -90.43351,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17563,
      "AltID": "Granulation & NH3 Storage",
      "FacilityID": 13052,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 22049,
          "ProcessID": 17563,
          "ChemicalID": 56,
          "Quantity": 456000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 17998,
          "ProcessID": 17563,
          "NAICSCode": "325312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9276,
              "Process_NAICS_ID": 17998,
              "SafetyReviewDate": "1999-04-13 00:00:00",
              "PHA_Date": "1998-01-28 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Operator Error",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Operator Monitoring",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Operator Monitoring",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1998-09-01 00:00:00",
              "EquipmentTested": "Plant shutdown -- most equipment",
              "ChangeMgmtDate": "1999-06-21 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-29 00:00:00",
              "PreStartupReviewDate": "1999-06-21 00:00:00",
              "ComplianceAuditDate": "1998-05-01 00:00:00",
              "AuditCompletionDate": "1998-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyEvalDate": "1998-12-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia storage and granulation process up to and including scrubbers and the granulator are covered by the PSM Program.",
              "_chemicals": [
                {
                  "PrimaryKey": 12835,
                  "PreventionProgram3ID": 9276,
                  "ProcessChemicalID": 22049
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13052,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-22 00:00:00",
    "ERTrainingDate": "1998-08-25 00:00:00",
    "CoordinatingAgencyName": "St. Charles Parish DEP",
    "CoordinatingAgencyPhone": "5047835050",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13052,
      "SummaryText": "\nEXECUTIVE SUMMARY - IMC-Agrico, Taft Plant\n\n2720  LDEQ Facility ID Number\n\n1.    Accident Release Prevention and Emergency Response Policies\n\nIMC-Agrico, Taft plant has a long standing commitment to worker and public safety.  This commitment is demonstrated by resources invested in accident prevention, such as personnel training, emergency equipment, participation in emergency drills, and meetings with local emergency response organizations. \n\nThis commitment is also consistent with the corporation's environmental, health and safety policy which provides that:\n\n1)  All facilities will be designed, operated, and managed to protect the health and safety of the employees and the public; \n2)  All employees will be educated on the applicable environmental, health and safety standards, and procedures; \n3)  Sufficient human and financial resources will be allocated to sustain these goals; \n4)  Audits will be conducted regularly to verify compliance with this policy.\n \nThese corporate policies also emphasize the importance of complying with OSHA's Process Safety Management standard, so that all employees and the surrounding community will be adequately protected from potential fire, explosion and / or toxic release hazards associated with catastrophic releases.\n\nIt is IMC-Agrico's policy to implement reasonable controls to prevent foreseeable releases of regulated and hazardous substances.   If an accidental release does occur, IMC-Agrico trained personnel will respond to control and contain the release.   IMC-Agrico has a comprehensive program for complying with safety and environmental regulations for all regulated and other hazardous substances handled.\n\n\n2.    Stationary Source(s) and Regulated Substance(s) Handled\n\nThe Taft plant produces a granulated monoammonium phosphate (GMAP) and diammonium phosphate (DAP) crop nutrient.  The raw materials used in this process include phosphoric acid and anhydrous ammonia.  Phosphoric acid is reacted with anhydrous ammonia to produce t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13052,
      "SummaryText": "he crop nutrients.\n\nThe single regulated toxic substances involved in this process is anhydrous ammonia which exceeds the threshold planning quantity (i.e., 10,000 pounds) in the process. \n\nAnhydrous ammonia is stored in a single aboveground horizontal cylindrical pressurized storage vessel at the Taft plant.   Anhydrous ammonia is received at the Taft plant via a pipeline.  Anhydrous ammonia is also occasionally received by tank truck.   Phosphoric acid is received by barge.\n\n\n3.    Worst-Case Release Scenario(s) and Alternative Release Scenario(s)\n\nThe worst case release scenario at the Taft plant is the loss of the entire contents as a gas of the anhydrous ammonia storage vessel over a period of ten minutes.  No liquid pooling was considered to occur during the release of the anhydrous ammonia which is liquefied in the storage vessel by pressure.  Administrative controls limit the storage of anhydrous ammonia in the vessel to 85% of the vessel's capacity.  Information in EPA's Offsite Consequence Analysis guidance document was used to predict the distance to the toxic endpoint of 0.14 mg/L.  Based on this guidance, the distance to the toxic endpoint would have offsite impacts.  However, this worst case release scenario is unlikely to occur based on the material properties of the liquefied anhydrous ammonia and the design of the pressurized storage vessel.\n\nA number of alternative release scenarios were evaluated at the Taft plant.  Most of these scenarios did not result in offsite impacts.  The alternative release scenario resulting in the farthest distance to the toxic endpoint involved a leak in the pressurized ammonia pipeline. Again, EPA's Offsite Consequence Analysis guidance document was used to predict the distance to the toxic endpoint using the standard alternative scenario parameters in the RMP rule.  The calculated distance to the 0.14 mg/L toxic endpoint would have offsite impacts.  As no credit was taken for active mitigation measures, local weather con"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13052,
      "SummaryText": "ditions, and a rural topography was assumed, this alternative case scenario is very conservative.\n\n\n4.  General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAnhydrous ammonia is regulated as a highly hazardous chemical under OSHA's Process Safety Management (PSM) standard.  Based on the quantity of anhydrous ammonia present at the Taft plant, the Taft plant is subject to OSHA's PSM requirements, and therefore, the Taft plant satisfies the eligibility requirements for a Program 3 Prevention Program under EPA's RMP.  The Taft plant has fully implemented OSHA's PSM standard requirements and is using this program as its RMP Prevention Program.  A brief summary of the facility's PSM program is as follows:\n\nThe Taft plant encourages all employees to participate in all facets of process safety and accident prevention and has an employee participation plan that documents the many ways employees are involved in these processes.\n\nThe Taft plant also has a comprehensive program to help ensure that hazards associated with various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards through the use of process hazard analysis techniques.\n\nThe Taft plant periodically revalidates its process hazard analyses to incorporate regulatory changes, new developments (such as lower toxicity standards and technology improvements), and offsite consequences.  These revalidations occur every five years and the findings along with their resolutions are kept for the life of the process.  The revalidation process was recently completed.\n\nThe Taft plant has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.   The basic aspects of this program include: (1) Conducting trainin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13052,
      "SummaryText": "g; (2) Developing written procedures; (3) Performing inspections and tests in accordance with recognized standards; and (4) Correcting identified deficiencies and applying quality assurance measures.\n\nThe Taft plant also has procedures in place to ensure continuation of the entire PSM program, including: writing and periodically updating operating procedures; training operators and maintenance personnel; management of change programs; contractor safety programs; plus developing an audit schedule that meets OSHA PSM requirements.\n\nThe Taft plant also incorporates a number of  safety measures to prevent or minimize accidental releases of regulated chemicals.  The Taft plant constantly monitors for anhydrous ammonia leaks. Typically the storage vessel operates significantly below its maximum capacity.  There are relief valves on the storage vessel to prevent overpressurization.   The capacity of the storage vessel relative to the plant consumption is such that the anhydrous ammonia inventory would be consumed shortly.  There are also automated shutdown systems for the anhydrous ammonia supply line to the plant.\n\n\n5.    Five -Year Accident History\n\nThe five-year accident history includes a review of all accidental releases of regulated substances held above threshold quantities in covered processes that resulted in on-site deaths, injuries, or significant property damage, or known off-site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage.  Since June 21, 1994, the Taft plant has had no accidental releases which meet the above criteria.\n\n\n6.    Emergency Response Program\n\nThe Taft  plant maintains a written emergency response program that is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to releases of regulated and other hazardous substances, including the possibility of ammonia releases, fire or explosion.  The program addresses all aspects of emergency re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13052,
      "SummaryText": "sponse including: \n\n(1)  notification and coordination with local emergency response agencies and the public if a release occurs, \n(2)  using trained personnel with equipment to respond to the incident, \n(3)  mutual aid agreements with other industrial facilities in St. Charles Parish, \n(4)  testing  and maintenance of emergency response equipment, and\n(5)  evacuation and shelter in place plans. \n\nThe Taft plant works closely with local officials to properly plan for emergencies.  The Taft plant is located in St. Charles Parish Louisiana.  When an emergency situation arises requiring outside assistance, Taft's overall emergency response program is coordinated with the St. Charles Parish Emergency Operations.   Via this organization, Taft works closely with other emergency response organizations including the sheriff,  St. Charles Parish emergency response personnel, Louisiana State Police and local hospitals.  Taft has 24 hour capability to communicate with these organizations.  Taft uses an Incident Command System for emergency response.  The Taft plant as a matter of policy contacts appropriate organizations when releases occur. \n\nThe St. Charles Parish EOC has a copy of  Taft's emergency response plan.  St. Charles Parish industries, including Taft, have a mutual aid agreement and is an active participant in the mutual aid group. \n\nThe Taft plant has an emergency equipment  maintenance, inspection, and testing program.  The Taft plant maintains a portable water spray monitor to handle potential ammonia releases, and fire fighting equipment for fires.  In addition, Taft employees receive training for the use of emergency response equipment.  Appropriate employees receive training for emergency response, medical assistance,  and the Incident Command System.  There is a significant number of appropriately trained personnel on each shift, and all employees receive a periodic training update.  The emergency response program is periodically audited.  Appropriate change"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13052,
      "SummaryText": "s are made in response to audit recommendations and operating experience.  \n\nThe Taft plant periodically tests its emergency response program.  The testing consists of onsite testing of emergency response equipment, in plant drills, and periodic mock emergency response scenarios coordinated by the St. Charles EOC.   The Taft plant also includes TV and radio station telephone numbers in its emergency response plan.\n\n\n7.    Planned Changes to Improve Safety\n\nThe Taft plant is working to timely resolve all action items generated as a result of internal audits and process hazard analysis. \n\n"
    }
  ]
}