{
  "FacilityID": 13282,
  "FacilityName": "City of Hutchinson Chlorine Storage Facility",
  "FacilityStr1": "501 West Avenue F",
  "FacilityStr2": null,
  "FacilityCity": "Hutchinson",
  "FacilityState": "KS",
  "FacilityZipCode": "67501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20155",
  "LEPC": "Reno County LEPC",
  "FacilityLatDecDegs": "38.044333",
  "FacilityLongDecDegs": "-97.941778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Hutchinson",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Hutchinson",
  "OperatorStr1": "P. O. Box 1567",
  "OperatorStr2": null,
  "OperatorCity": "Hutchinson",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67504",
  "OperatorZipCodeExt": "1567",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000139726",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Chlorine Storage Building located at \"F\" & Monroe",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-04 00:00:00",
  "DeRegistrationEffectiveDate": "2009-05-26 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.044333,
  "FRS_Long": -97.941778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17926,
      "AltID": "150# Chlorine Cylinders",
      "FacilityID": 13282,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 22516,
          "ProcessID": 17926,
          "ChemicalID": 62,
          "Quantity": 7500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18379,
          "ProcessID": 17926,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7379,
              "Process_NAICS_ID": 18379,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": "Safety equipment such as breathing apparatus equipment must meet the above standards",
              "HazardReviewDate": "1999-06-01 00:00:00",
              "ChangeCompletionDate": "2000-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-05 00:00:00",
              "TrainingReviewDate": "1999-02-05 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "AWWA workshops on regular basis",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Trained personnel trains new employees",
              "MaintenanceReviewDate": "1999-02-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Exhaust fan, chlorine cylinders inspected by vendor at unknown times before delivery to our site",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 7701,
                  "PreventionProgram2ID": 7379,
                  "ProcessChemicalID": 22516
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13282,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hutchinson Fire Department",
    "CoordinatingAgencyPhone": "3166942871",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13282,
      "SummaryText": "This Risk Management Plan is for a chlorine storage facility, located at Avenue \"F\" and Monroe Street located on the southwest part of Hutchinson, Kansas. This facility is a 24' x 24' wood-frame building with a concrete floor. The facility is used primarily to house from 0 - 50  150# chlorine bottles. The chlorine bottles are used to chlorinate the City of Hutchinson's public water supply. The chlorine is delivered to this site by suppliers and stored there until they are used at one of the 20 water well sites. Included in this amount is a minimal amount of 150# chlorine bottles used at the two municipal swimming pools.\n\n      This building sets inside a fenced in area measuring 150' x 200'. The fencing material is chain-link type and it is 6' high. The fenced in area is used to store water materials such as pipe, fittings, valves and fire hydrants. Both the building and fence are locked at all times. There are no employees occupying this building unless they are there to transport chlorine bottles to the wells from this facility or when a new supply of chlorine is delivered.\n\n   This chlorine storage facility is located in an area where the nearest  house  is 673' from the facility. The facility is bordered on the west and south by an open area that the city uses for stock piling sand, dirt, gravel, asphalt, etc. Beyond the stock piles (on the south & west side)  is a flood control dike and the Arkansas River. There is a hike/bike trail between the dike and the river. This trail is 350' south of the chlorine storage facility. This trail sets inside the Worst Case plume area of .1 mile for chlorine release. This trail is the reason we are using the Program 2 criteria.  The trail isn't heavily used but it is my understanding it still qualifies for a recreational area. On the east side of the building is a public street and some private residences (note the nearest house is 673' east of the facility).\n\n     The City of Hutchinson staff and management are very conc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13282,
      "SummaryText": "erned about chlorine safety. This building is secured by the fence and locked building door. There is a chlorine warning sign on the building & the chlorine bottles are carefully handled when loading and unloading. The bottles are anchored in an upright position during storage. There is an exhaust fan that is activated with a switch next to the entrance door. Our maintenance staff carries a breathing apparatus in their vehicle for emergency use. There are two employees who routinely handle the chlorine. They both have been with the city for many years and have attended numerous chlorine safety courses. Management keeps them apprised of any new information concerning chlorine safety.\n     \n     In our worst-case scenario, we  figured a total of 50 150# cylinders would burst at one time releasing 7,500 lbs. of gas chlorine. The release time is 10 minutes. We calculated the gas plume would effect a distance of .1 mile. The nearest residence is outside that area (673') but the hike/bike trail is within that distance. The Hutchinson Fire Department would respond to the release and follow their standard operation procedures. This worse case scenario is very unlikely due to the cylinders all being secured in an upright position and the vessels are kept in good condition by vendors. The likelihood of all them bursting at once is very minimal.  \n\n\n\n    The following is a segment of the Fire Departments emergency preparedness plan that would apply in this case.\n\n1. PREPAREDNESS  A. The City is prepared to cope with a hazardous material incident to the degree that fire, police, emergency medical services, and public works units are in place, trained, experienced, equipped and on duty 24 hours per day. Heavy equipment would take a longer response time, depending upon circumstances.  B. City public safety units have standard operating procedures for dealing with a major hazardous materials incidents.\n\n2. RESPONSE. The response to any emergency situation is immediate and effectiv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13282,
      "SummaryText": "e. A major hazardous materials incident would indeed be handled with the same sense of urgency.\n\n3. RECOVERY. After an incident has been brought under control, city departments and outside organizations involved give priority to recovery operations. Such operations involve assessment of damage, restoration of essential facilties an utilties, provision for public and individual welfare, and return to normal community activities. Recovery operations will  be coordinated and in accordance with established priorities  - safety of life first; business and property next. \n\nOPERATIONAL CONCEPTS  \n1. Initial notification of a hazardous materials incident/accident within the City may come from any source. It would cause immediate and spontaneous response by emergency services. 2. Combating hazardous materials requires a coordinated effort by the Fire, Police, Public Works, and Health Department, with other departments in support. \n\n3. In all probability Fire and Police units woud be the first to arrive on the scene. Their initial actions are to meet the immediate needs of the situation - fire suppression, identification of hazardous materials, exposure protection, extrication of the injured if possible, cordon off the area and traffic and crowd control.  \n\n4. The ranking fire officer on the scene would assume command as the incident commander. He would assess the situation. He would then call for additional equipment and assistance as necessary. He would proceed with fire suppression, containment and rescue operations within his immediate capability. He would request the Hazardous Materials Unit to respond if Dispatched had not already alerted them.  \n\n5. He will establish the on-scene command post upwind of the hazard site, and he will designate a staging area for additional equipment if needed and appoint sector commanders as needed, under the fire incident command system.  \n\n6. Emergency Communications Center and the Police Department will make immediate notifications acc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13282,
      "SummaryText": "ording to pre-arranged plans. \n\n7. If the hazardous materials involved endangers the population, the fire department will designate evacuation boundaries based on pre-planned information. Police will evacuate the area, fire fighters may be able to assist in the immediate incident area evacuation process. The peace time evacuation plan should be used. \n\n8. Evacuation shelters will be opened if necessary. American Red Cross and the Salvation Army will staff and coordinate the shelter centers, USD 308 school district personnel will assist as called for.  \n\n9. The initial response of emergency personnel and equipment provided suppression, containment, and rescue operations, constitute the first phase of the operation.  \n\n10. The second phase of operation will begin upon arrival of the Hazardous Materials team. Operations will be conducted according to the Hazardous Materials Team standard operating procedures.  \n\n11. After the on-scene command post becomes operational, the original incident commander may be relieved by a higher ranking officer.  \n\n12.  The ranking police officer would call for assistance required and establish a perimeter around the site. Entrance to the scene would be limited to emergency operations.  \n\n13. The emergency Medical System, Public Works, Health Department, and community services agencies will be activated. Each agency shall follow its standard operating procedures for a hazardous materials incident.  \n\n14. The second phase of operations will require resources beyond those normally available. The Emergency Operations Center shall be activated to provide command and support functions.  \n\n15. The EOC staff shall be notified by Emergency Communications center and the Police Department they shall report to their pre-arranged post for assignments according to standard operating procedures.  \n\n16.  Containment/recovery operations would continue as long as necessary. Assistance will be called for as needed from county, state, and federal agencies."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13282,
      "SummaryText": "17. The on-scene operation would wind down in stages as accomplished. Recovery would be long term. \n\n\n\nDIRECTION AND CONTROL. \n a.  The City Manager or authorizd designee, exercises overall direction and control of operations and resources in event of a hazardous materials incident through the Fire Chief, and such other staff members and outside agencies as required. \n\n b. The Fire Chief exercises primary operational control through the incident commander in accordance with the departments internal directions and procedures.  \n\n c. Succession of direction and control will flow by name in accordance with City resolution No. 2467 adopted in Jan. 1988, or such other appropriate resolutions as may be in effect at the time of a hazardous materials incident.\n   \n\n\n    The Alternative Release Scenario is based on one 150 # cylinder bursting and releasing 150 lbs of chlorine in 10 minutes. The building itself would act as a containment area and would limit effected areas. The area effected would be very small and wouldn't effect any public areas. The effects wouldn't go beyond  the secured fenced in area. If our staff were the first to notice the problem, the fire dept. would be called and they would handle the situation according to their standard operating procedures.\n\n\n\n\nThe following are brief explanations from data entered in the previous sections:\n\nSection 2. Toxics: Worst Case  -  2.13 e.  Recreation area is the hike/bike trail located 350' south of the chlorine facility. There is a flood control dike between the trail and the facility.    \n\n2.15 b. The enclosure is the building itself. \nSection 8. Prevention Program 2  8.3 a. Date indicated completion date of this plan.   \n\n8.4 a.  Fire Department reviews during their inspections.  \n\n8.4 b. Anticipate installing a alarm system to alert of chlorine release. Will also change location of exhaust fan switch from inside walk-in door to exterior of building.  \n\n8.4 f Future plans include installing monitoring/detectio"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13282,
      "SummaryText": "n/alarm system for chlorine leaks.  \n\n8.5 Date indicates when the new MSDS sheet were received and reviewed for chlorine  storage. \n\n8.6 a. Date of new MSDS sheets were reviewed. Complete product information was received. \n\n8.6  b. The two employees in charge of safety procedures at this facility are tested through demonstrations of safety equipment and observation of work habits. Other training consist of numerous workshops on chlorine safety.  \n\n8.7 a. Fire dept. checks yearly, maintenance staff checks equipment regularly for safe operation. Equipment includes exhaust fan, securing devices,  breathing equipment, etc.  \n\n 8.7 b. Fire Department checks equipment such as chlorine vessel securing devices and exhaust fan on their yearly inspections. Water staff also checks this equipment each time they use them (usually on a weekly basis).\n\nSection 9. Emergency Response  \n9.1 a. The local fire dept. hasn't included this faciltiy in their ER plan due to the risk being so small. \n\n9.1 b. Facility employees are trained in procedures in case of leakage. Since Fire department handles emergencies at this facility, they handle emergency response under their operating procedures.   \n\n9.2 - 9.4 - A specific ER plan hasn't been developed due to the low level of risk at this facility. However, the fire department's preparedness plan covers these items."
    }
  ]
}