{
  "FacilityID": 13304,
  "FacilityName": "City of Mitchell Water Treatment Facility",
  "FacilityStr1": "2800 North Main",
  "FacilityStr2": null,
  "FacilityCity": "Mitchell",
  "FacilityState": "SD",
  "FacilityZipCode": "57301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46035",
  "LEPC": null,
  "FacilityLatDecDegs": "43.736944",
  "FacilityLongDecDegs": "-98.024167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Mitchell, South Dakota",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Mitchell",
  "OperatorStr1": "612 North Main",
  "OperatorStr2": "PO Box 278",
  "OperatorCity": "Mitchell",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57301",
  "OperatorZipCodeExt": null,
  "RMPContact": "Alan Sherman",
  "RMPTitle": "Water Superintendent",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141651",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.74609,
  "FRS_Long": -98.02608,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17950,
      "AltID": "Drinking Wtr Disinfection",
      "FacilityID": 13304,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18403,
          "ProcessID": 17950,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22544,
          "ProcessID": 17950,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522544,
          "ProcessID": 17950,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13304,
      "SummaryText": "Executive Summary\n\n\n\nAccidental Release and Emergency Response Policies\n\nThe City of Mitchell Water Treatment Facility (WTF) has operated their disinfection process without incident within the last five years.  This successful operating record is due to the City's commitment to ongoing training programs, operating procedures, and maintenance activities.\n\nStationary Source and the Substance Handled\n\nThe City of Mitchell operates a water treatment facility in Mitchell, South Dakota.  The facility uses chlorine to reduce the pathogenic (disease causing) bacteria and viruses in potable water below the maximum contaminant levels set forth in the Safe Drinking Water Act.\n\nChlorine utilized in the disinfection process arrives at the facility in one ton containers that are stored inside a ventilated building equipped with a leak detection device.  The maximum quantity of chlorine stored at the facility is 12,000 pounds.  \n\nOff-Site Consequence Analysis\n\nOne worst-case release scenario and one alternative release scenario was assessed for the chlorine process.  To ensure a common basis for comparisons, EPA defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line that results in the greatest distance to an endpoint.  The worst-case scenario allows consideration of passive mitigation measures.  The worst-case release scenario for the chlorine process was determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c).\n\nThe alternative release rate is a release that is considered more reasonable or \"more likely.\"  The alternative release scenario for the chlorine process was determined in accordance with the guidelines in 40 CFR 68.22 and 68.28.  Active mitigation measures, as well as passive mitigation measures, can be used in determining the alternative release scenario.\n\nAccording to EPA, the toxic endpoint for chlorine has been defined to be 0.0087 mg/L (3 ppm).  An air"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13304,
      "SummaryText": "borne concentration that is used as the toxic endpoints is the maximum airborne concentrations below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects.\n\nThe distance to the toxic endpoint becomes a radius for a circle around the covered process.  Residential population within the circle is required to be determined based on available census information.  The population number is reported as part of the EPA submittal.  This method greatly overestimates the population potentially exposed to a chlorine release because the chlorine plume would seek lowest elevations in the direction of the prominent winds.  Since wind direction cannot be anticipated for an accidental release, EPA mandated the circle estimation method.\n\nRelease scenarios and distances to toxic endpoints are discussed in more detail in the subsequent paragraphs.\n\nChlorine\n\nWorst-Case Release Scenario\n\nFor the chlorine process at the Mitchell WTF, the worst-case release results from a one-ton chlorine cylinder (maximum amount held in a single vessel) rupturing when unloaded from the delivery truck and its contents escaping to the atmosphere in 10 minutes.  In the event the cylinder would release its entire contents to the atmosphere in 10 minutes, the release rate would be 200 pounds per minute.  The distance to the toxic endpoint worst-case release distance, 1.3 miles, was taken from Exhibit 4-3 of the EPA's Risk Management Program Guidance for Wastewater Treatment Plants, for an urban setting.\n\nThe residential population within the 1.3-mile radius of influence was determined to be approximately 1700 people.  The population was calculated by utilizing the U.S. Department of Commerce software package LandViewTM III, which sums 1990 population information from the Census Bureau for areas within the 1.3-mile radius impact zone. \n\nAlternative Release Scenario\n\nThe alternative release scenario, or s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13304,
      "SummaryText": "cenario more likely to result in a release, involves a failure of the lead gasket used for sealing the valve connection.  This scenario results in a release of 6 pounds of chlorine gas for 10 minutes.  The audio alarm is activated at 3 ppm chlorine, at which time SCBA are donned by the operators and the chlorine supply is manually shut off.  It is assumed that the chlorine gas will escape through a 1/16-inch opening and the total release time is 10 minutes.  This results in a release rate of less than 0.6 pounds per minute (Exhibit 4-15 of the EPA's Risk Management Program Guidance for Wastewater Treatment Plants).  The distance to the toxic endpoint alternative release distance, less than 0.10 miles, was taken from Exhibit 4-15 of the EPA's Risk Management Program Guidance for Wastewater Treatment Plants, for an urban setting.\n\nThe residential population within the 0.10-mile radius of influence was determined to be 0 people.  The population was calculated by utilizing the U.S. Department of Commerce software package LandViewTM III, which sums 1990 population information from the Census Bureau for areas within the 0.10-mile radius impact zone. \n\nAccidental Release Prevention Program\n\nThe City of Mitchell has developed a Prevention Program in accordance with the requirements of 40 CFR 68 for Program Level 2.  The City will continuously evaluate and update their safety and prevention procedures as needed.\n\nFive-Year Accident History\n\nNo accidents, as described under 40 CFR 68.42(a), have occurred at the Mitchell WTF in the previous five years.  \n\nEmergency Response Program\n\nThe emergency response program established by the City of Mitchell for their WTF does not require personnel to respond to accidental releases of regulated substances.  The local emergency response agencies will be relied upon for coordinating all response actions resulting from the release and for informing the public about the release.  \n\nSafety Improvements\n\nThe facility regularly conducts proces"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13304,
      "SummaryText": "s hazard reviews.  Any improvements made in response to the recommendations resulting from these reviews are documented."
    }
  ]
}