{
  "FacilityID": 13312,
  "FacilityName": "Long Beach Water Reclamation Plant",
  "FacilityStr1": "7400 E. Willow Street",
  "FacilityStr2": null,
  "FacilityCity": "Long Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90815",
  "Facility4DigitZipExt": "1635",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.803861",
  "FacilityLongDecDegs": "-118.089222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "NW",
  "FacilityURL": "www.lacsd.org",
  "FacilityEmailAddress": "davila@lacsd.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "County Sanitation Districts of Los Angeles County",
  "Company2Name": null,
  "CompanyDUNS": 67761700,
  "Company2DUNS": 0,
  "OperatorName": "County Sanitation Dist of LA County",
  "OperatorStr1": "1965 Workman Mill Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Whittier",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90601",
  "OperatorZipCodeExt": null,
  "RMPContact": "R. Steven Easley",
  "RMPTitle": "Supervising Operations Engineer",
  "FTE": 8,
  "OtherEPAFacilityID": "CAL 0000 965 66",
  "EPAFacilityID": "100000143043",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-26 00:00:00",
  "SafetyInspectionBy": "Long Beach Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "SCAP - LA County",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-01-18 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-10 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.80401,
  "FRS_Long": -118.09017,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17959,
      "AltID": "Chlorination",
      "FacilityID": 13312,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18412,
          "ProcessID": 17959,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22554,
          "ProcessID": 17959,
          "ChemicalID": 62,
          "Quantity": 72000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522554,
          "ProcessID": 17959,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 17960,
      "AltID": "Dechlorination",
      "FacilityID": 13312,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18413,
          "ProcessID": 17960,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22555,
          "ProcessID": 17960,
          "ChemicalID": 49,
          "Quantity": 62000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522555,
          "ProcessID": 17960,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13312,
      "SummaryText": "Chlorine and sulfur dioxide are the two most commonly used substances for treating wastewater.  The County Sanitation Districts of Los Angeles County (CSDLAC) Long Beach Water Reclamation Plant (LBWRP) uses chlorine (for chlorination) and sulfur dioxide (for dechlorination) for treating wastewater to provide safe water discharges to the environment.  Storing and handling large quantities of chlorine and sulfur dioxide can create hazardous situations.  For this reason, LBWRP follows all industry recommended practices for safely storing and handling these chemicals.  LBWRP's chlorine and sulfur dioxide handling processes are subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program.  These Programs require a summary in the Risk Management Plan (RMP) of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions which will be taken by the facility in an event of an emergency.  The following information is specifically required in the RMP Executive Summary: \n\n* Accidental release prevention and emergency response policies.\n\n* General facility and regulated substances information.\n\n* Offsite consequence analysis results.\n\n* Summary of the accidental release prevention program and chemical-specific prevention steps.\n\n* Five-year accident history summary.\n\n* Emergency response program summary.\n\n* Planned changes to improve safety.\n\nThe above information for the LBWRP chlorination and dechlorination systems is provided below.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe County Sanitation Districts of Los Angeles County LBWRP accidental release prevention policy involves a unified approach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable proce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13312,
      "SummaryText": "dures of the State of California and EPA's Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\nThe CSDLAC emergency response policy involves the preparation of Hazardous Materials and Hazardous Waste Consolidated Contingency Plans (HMHWCCP) for handling hazardous materials which are specific for each facility and to the emergency response services available in the community, and is in compliance with the EPA and CalARP Program Emergency Response Program Requirements.  The CSDLAC has prepared a HMHWCCP for the LBWRP for storing and handling hazardous materials, including chlorine and sulfur dioxide to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The HMHWCCP has been coordinated with the local response agency (County of Los Angeles Fire Department).  The LBWRP has an excellent record in preventing accidents from occurring.\n\nGeneral Facility and Regulated Substance Information\n\nThe Long Beach Water Reclamation Plant is located at 7400 E. Willow Street, in Long Beach, California.  The treatment facility is located on a land area of approximately 17 acres, bounded on the west side by the San Gabriel River, on the southeast side by Coyote Creek, and on the north side by Willow Street. The County Sanitation Districts of Los Angeles County has operated LBWRP facility since 1973.  The design treatment capacity of the plant has increased in stages, from the original 13 million gal of wastewater per day (mgd) to current capacity of 25 mgd.  The wastewater treated at LBWRP originates mainly from approximately 250,000 domestic users in the Long Beach region; a small fraction is of industrial origin.  Wastewater treatment utilizes the activated sludge process with chlorination and dechlorination to yield a tertiary effluent for purposes of re-use and/or discharge.\n\nAnhydrous chlorine used for chlorination at LBWRP is rec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13312,
      "SummaryText": "eived in chlorine trailers and transferred to two bulk storage tanks.  Anhydrous sulfur dioxide used for dechlorination is also received at the plant in sulfur dioxide trailers and transferred to a bulk storage tank.  Sulfur dioxide is also received in one-ton containers and used as a back-up system to the bulk sulfur dioxide storage tank system. The chlorination system consists of two chlorine bulk storage tanks, evaporators, chlorinators, residual analyzers, diffusers, chlorine contact tanks, piping and other equipment.  The capacity of each chlorine bulk storage tank is 25 tons; however, the maximum quantity of chlorine present in a tank at any given time is only 18 tons.\n\nThere are three chlorine gas detectors, each with one probe.  The gas detectors are located on the north inside wall of the chlorine bulk storage room.  Two of the probes are located on the north and south walls of the chlorine bulk storage room.  The remaining probe is located on the west wall of the chlorine evaporator room.  These detectors continuously analyze samples of air taken from these areas.  When chlorine gas is detected in any of the above mentioned areas, the gas detector sends a signal to the Main Control Panel.\n\nThe sulfur dioxide system consists of one sulfur dioxide bulk storage tank, four ton containers, evaporators sulfonators, ejectors, diffusers, and other piping and equipment, most of which is located in the Sulfur Dioxide Bulk Storage Building and the ton Container Room. In addition to the main dechlorination system, there is a separate system with sulfonators for dechlorinating the waste filter backwash water. The capacity of the sulfur dioxide bulk storage tank is 30 tons; however, the maximum quantity of sulfur dioxide present in a tank at any given time is only 27 tons.\n\nThere is a sulfur dioxide leak control panel located on the east outside wall of the sulfur dioxide bulk storage building.  This panel indicates the status of two sulfur dioxide gas detectors.  Sulfu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13312,
      "SummaryText": "r dioxide gas detectors are located on the north wall of the sulfur dioxide bulk storage room and east inside wall of the ton container room.  There are also dedicated chlorine and sulfur dioxide gas detectors for the chlorinator/sulfonator room.\n\nThese detectors continuously analyze samples of air taken from these areas.  The Main Control Panel alarm sets off an audio alarm at 1 ppmv chlorine level or 5 ppmv sulfur dioxide level, and also a flashing warning light.  After normal working hours, the alarms are annunciated at Los Coyotes WRP which is manned 24 hours per day.\n\nAccess to LBWRP is through gates, which are closed and locked after regular hours.  The buildings housing the chlorination and dechlorination facilities are locked except when operation and maintenance personnel are working inside the buildings.\n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis includes consideration of two release scenarios, identified as \"worst-case release scenario\" and \"alternative release scenario\". The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the ... maximum quantity in the largest vessel ... is released as a gas over 10-minutes,\" due to an unspecified failure. The alternative scenario is defined as \"more likely to occur than the worst-case release scenario\".\n\nRMP and CalARP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario that is estimated to create the greatest distance in any direction to a toxic endpoint resulting from an accidental release of regulated toxic substances from covered processes.  For the worst-case release scenario analysis for the LBWRP, two scenarios were considered: (1) rupture of one chlorine tank with a maximum capacity of 18-tons, resulting in a release of 36,000 pounds of chlorine over a 10-minute duration, (2) rupture of one sulfur dioxide tank with a maximum capacity of 27-tons, resulting in a release o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13312,
      "SummaryText": "f 54,000 pounds of sulfur dioxide chlorine over a 10-minute duration.  Administrative controls are used to limit the filling of the chlorine bulk tank to only 18 tons and the sulfur dioxide tank to 27 tons.  The sulfur dioxide bulk storage tank is in an enclosed building, which results in a passive mitigation of any chlorine release. The release rate reduction from the enclosed sulfur dioxide storage building is estimated to be approximately 66%, per guidance from EPA regarding control efficiency levels from buildings storing sulfur dioxide.  The release rates for chlorine and sulfur dioxide were thus estimated to be 3,600 pounds per minute and 1,857 pounds per minute (lbs/min), respectively.\n\nThe released liquid chlorine is assumed to form a denser-than-air cloud consisting of chlorine vapor and liquid droplets (aerosols) and then disperse in the atmosphere.  The sulfur dioxide vapor release from the building is a dense gas.  The distance to the toxic endpoint for both chlorine and sulfur dioxide was estimated using the EPA's Dense Gas Air Dispersion (DEGADIS 2.1) Model.  The toxic endpoint selected by EPA and CalARP rules for both chlorine and sulfur dioxide is 3 ppm, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  The toxic endpoint was conservatively set by EPA to ensure public notification and that local emergency response planning takes into account the greatest possible impacted area surrounding the release point.  In practice, this type of a total failure of bulk storage tanks would be unlikely.  EPA-mandated meteorological conditions, namely atmospheric Stability Class F, wind speed of 1.5 meter per second, highest daily maximum temperature (111 deg F), and average relative humidity (66%) were used for the worst-case release scenario analysis.  The results of the air dispersion analysis indicated that the toxic endpoint distance would be longer for the release of sulfur dioxide in comparison to chlorine release.  However, the worst-cas"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13312,
      "SummaryText": "e release scenarios for both chemicals have offsite impacts.\n\nRMP and CalARP rules require that a scenario which results in offsite toxic endpoint distance and is more likely to occur than the worst-case scenario should be selected as the alternative release scenario, unless no such scenario exists.  Unlike the worst-case scenario, the alternative release scenario may consider \"active\" mitigation such as automatic shutoff valves, excess flow valves, and containment with scrubbers.  Active mitigation is defined as requiring mechanical, electrical, or human input.\n\nBased on the process hazard analysis performed for both the chlorine and sulfur dioxide systems, two alternative scenarios were selected for the offsite consequence analysis.  \n\nThe scenarios selected for the LBWRP chlorination and dechlorination systems involve the release of chlorine/sulfur dioxide gas from the monel flexible hoses connecting the storage tanks to chlorination and dechlorination processes.  These scenarios can occur if the operator uses a flex hose, which is worn or has a defect, which results in a crack in the flex hose during the withdrawal of chlorine/sulfur dioxide gas from the storage tanks.  It is assumed that the crack developed in the flex hose (diameter 1-inch) corresponds to a hole of 0.1875-inch (3/16 inch) diameter.  The control room would have been warned of the chlorine/sulfur dioxide leak by the chlorine/sulfur dioxide detectors installed at the chlorination/dechlorination facility.  It is assumed that a maximum of sixty minutes would be required for operators or an emergency response team to respond.\n\nThe chlorine release rate was estimated at 4.3 lb/min and the sulfur dioxide release rate inside the building was estimated at 1.9 lb/min. The release reduction rate of the sulfur dioxide building was assumed as 45% as per EPA guidance; the release rate to the atmosphere was estimated at 1.0 lb/min.  Since the chlorine and sulfur dioxide gases are dense gases, EPA's DEGADIS 2."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 13312,
      "SummaryText": "1  model was used for the air dispersion analysis.  The meteorological conditions used for the alternative release scenario analysis were Stability D, wind speed of 3.0 meters per second, average air temperature of 63 deg F, and average humidity of 66%.  The results of the dispersion modeling analysis indicated that the distance to the toxic endpoint would extend offsite but would not reach the nearest residence or any other public receptors. \n\nIt may be noted that the occurrence of these scenarios are highly unlikely because the flex hoses are carefully inspected and pressure tested every two years.\n\nFinally, no chlorine or sulfur dioxide releases that could have caused safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the LBWRP during the last five years.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nLBWRP is in compliance with Federal and State Process Safety Management requirements. LBWRP accidental release prevention program is based on the following key elements:\n\n* Detailed management system and clear levels of responsibilities and team member roles.\n\n* Comprehensive process safety information that is readily available to staff, emergency responders, and contractors.\n\n* Comprehensive preventive maintenance program.\n\n* Performance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n\n* Use of state-of-the-art process and safety equipment.\n\n* Use of accurate and effective operating procedures, written with the participation of the operators.\n\n* High level of training of the operators and maintenance staff.\n\n* Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nChemical-specific prevention steps include the use of supplied air respirators (SAR) and self-contained breathing apparatus (SCBA), worn by the operators during conne"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 13312,
      "SummaryText": "LAC WRP section maintains up-to-date, accurate, written operating procedures for the LBWRP that provide clear instructions for chlorine and sulfur dioxide processes.  CSDLAC ensures effective operating practices by combining them with operating and maintenance training programs. Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine and sulfur dioxide systems.  The operating procedures include start-up, normal operation, shutdown, and non-standard operating procedures.  Also included are the maintenance and troubleshooting procedures.  CSDLAC updates procedures whenever a change occurs that alters the steps needed to operate safely.  Operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine or sulfur dioxide equipment, and reconfiguration of the facilities.\n\nTraining \n\nLBWRP employees presently involved in operating or maintaining the chlorine and sulfur dioxide processes are trained in an overview of the process and detailed applicable operating and maintenance procedures. CSDLAC ensures that each LBWRP employee newly assigned to the process, is trained and tested to be competent in the operating procedures listed pertaining to their duties. LBWRP training program includes four elements: (1) initial training, (2) refresher training, (3) documentation, and (4) and testing.  Each employee (presently involved in operating the chlorine and sulfur dioxide processes) has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including chlorine and sulfur dioxide emergency response, as provided in the HMHWCCP.\n\nRefresher training is provided annually to each employee operating the covered process to ensure that the employee understands and adheres to the current operating procedures.  Operators at LBWRP are also "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 13312,
      "SummaryText": "ction/disconnection of chlorine/sulfur dioxide supply, the use of air purifying respirators (APR) worn by the drivers during connection/disconnection of chlorine/sulfur dioxide supply and availability of SCBA to the drivers, awareness of the hazardous and toxic properties of chlorine/sulfur dioxide, and presence of chlorine/sulfur dioxide detectors and alarms.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine and sulfur dioxide.  This information includes chlorine and sulfur dioxide background information and MSDS sheets.\n\nEquipment safety information was compiled on the chlorine and sulfur dioxide processes and is provided in one place for easy reference. Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes are on file at the facility.  CSDLAC also has procedures in place that are triggered to update process safety information for LBWRP if there is a change that makes existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn 1998, detailed process hazard analyses (PHAs) were conducted for chlorination/dechlorination system equipment and procedures.  The PHAs were further reviewed in February 1999 and will be updated again within a five-year period or whenever there is major change in the process.  A list of recommended actions was developed in February 1999 to further improve the chlorine and sulfur dioxide safety, and staff is currently evaluating these recommendations.  Staff will document the completion of recommended actions.\n\nA seismic walkthrough was recently completed based on the 1997 UBC and LEPC 1 guidance document.  Recommendations were provided to LBWRP staff for their evaluation and implementation. \n\nOperating Procedures\n\nCSD"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 13312,
      "SummaryText": "provided quarterly refresher training on current safety procedures.  In addition, the CSDLAC ensures that operators and maintenance personnel at LBWRP are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\n\nCSDLAC prepares and retains records of initial and refresher training, provides certification of the records, which includes the identity of the employee, the date of training, and the signature of the person (s) administering the training.\n\nContractors\n\nContractors are properly informed of the hazards, access limitations to these process areas, and emergency response procedures.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the emergency response plan.  CSDLAC Field Engineering and Environmental Health & Safety Section holds contractor safety briefings before allowing them near or in the process areas; controls access to the process areas, and evaluate the contractor's performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nCSDLAC WRP Section ensures that a pre-startup safety review is completed for any new covered-by-the-rules process, or for significant modifications to an existing covered process at LBWRP that requires a change in the process safety information. CSDLAC maintains the mechanical integrity of process equipment at LBWRP to help prevent equipment failures that could endanger workers, the public, or the environment.  CSDLAC mechanical integrity program for LBWRP includes the following:\n\n* Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience.\n\n* Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\n\n* Training of maintenance personnel in preventive maintenance p"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 13312,
      "SummaryText": "rogram procedures; safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\n\nHot Work Permits and Management of Change \n\nCSDLAC requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered process at LBWRP.  LBWRP uses a permitting program to ensure hot work is conducted safely on or near a process involving chlorine and sulfur dioxide.\n\nCSDLAC provides a system and approach to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions at LBWRP. This system allows CSDLAC staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise safety or need training to be completed.\n\nInternal Compliance Audits\n\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  CSDLAC will assemble an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\n\nCSDLAC investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, r"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 13312,
      "SummaryText": "ecommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\n\nFive-year Accident History Summary\n\nNo chlorine or sulfur dioxide releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the LBWRP during the last five years.\n\nEmergency Response Program Summary\n\nLBWRP trained operators are first responders to chlorine and sulfur dioxide leak alarms and accidental releases.  Operators from LCWRP respond to accidental releases when the LBWRP operators are not at the plant.  Depending on the severity of the accidental release, external resources such as the Los Angeles County Fire Department will be called to aid in handling a chlorine or sulfur dioxide release.  As part of the emergency response program, the CSDLAC has developed and implemented Hazardous Materials and Hazardous Waste Consolidated Contingency Plan for the purpose of protecting public health and the environment.\n\nHMHWCCP has been coordinated with the local response agency (Los Angeles County Fire Department).  The main elements of the emergency response plan are: (1) initial discovery equipment and procedure, (2) response to an emergency, including procedures for immediate action and internal notifications, (3) procedures for external notifications, including coordination with Local Governments, Incident Commanders, (4) incident action plan, including mitigation actions, response resources, (5) implementation of tactical plan, and (6) termination and follow-up actions.\n\nPlanned Changes to Improve Safety\n\nNumerous changes to improve safety (recommended actions) were previously identified for the two covered processes in 1998 as part of the PHAs conducted for the Process Safety Management (PSM) Program.  These recommended actions have been evaluated "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 13312,
      "SummaryText": "and implemented as required.  In addition, the process hazard analyses for the two covered processes were reviewed in 1999 under the RMP and CalARP requirements.  Based on this review, five (5) additional changes were identified to further improve the safety of chlorine and sulfur dioxide systems. It is expected that these recommended actions will be evaluated and implemented by December 1999.  The implementation of these recommendations will further improve the safety of the chlorination and dechlorination systems.\n\nThe County Sanitation Districts of Los Angeles County have also decided to discontinue using chlorine and sulfur dioxide at the Long Beach facility. Sodium hypochlorite will be used in place of chlorine and sodium bisulfite in place of sulfur dioxide.  It is expected that this change will occur in about six months."
    }
  ]
}