{
  "FacilityID": 13338,
  "FacilityName": "DAP Inc.",
  "FacilityStr1": "875 North Third Street",
  "FacilityStr2": null,
  "FacilityCity": "Tipp City",
  "FacilityState": "OH",
  "FacilityZipCode": "45371",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39109",
  "LEPC": "Miami County LEPC",
  "FacilityLatDecDegs": "39.978417",
  "FacilityLongDecDegs": "-84.177083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7022486,
  "ParentCompanyName": "WASSALL USA, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DAP Inc.",
  "OperatorStr1": "875 North Third Street",
  "OperatorStr2": null,
  "OperatorCity": "Tipp City",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45371",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rey Cadenas",
  "RMPTitle": "Corporate Sr. Project Engineer",
  "FTE": 110,
  "OtherEPAFacilityID": "45371DPNC875NO",
  "EPAFacilityID": "100000141642",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.97037,
  "FRS_Long": -84.17183,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 17987,
      "AltID": "Propane Storage",
      "FacilityID": 13338,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18440,
          "ProcessID": 17987,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22583,
          "ProcessID": 17987,
          "ChemicalID": 98,
          "Quantity": 152640.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522583,
          "ProcessID": 17987,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 17988,
      "AltID": "Propane / Dymel Blend Tk",
      "FacilityID": 13338,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18441,
          "ProcessID": 17988,
          "NAICSCode": "32552",
          "_desc": {
            "NAICS_CODE": "32552",
            "NAICS_DESCRIPTION": "Adhesive Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22584,
          "ProcessID": 17988,
          "ChemicalID": 98,
          "Quantity": 21030.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 22585,
          "ProcessID": 17988,
          "ChemicalID": 130,
          "Quantity": 15960.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 130,
            "ChemicalName": "Methyl ether  [Methane, oxybis-]",
            "CASNumber": "115-10-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522584,
          "ProcessID": 17988,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522585,
          "ProcessID": 17988,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13338,
      "SummaryText": "PROPANE & PROPANE / DIMETHYL ETHER BLEND STORAGE SYSTEMS\nDAP Inc.\nTIPP CITY, OHIO\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nWe at DAP Inc. are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive Accidental Release Prevention Program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the Propane, Propane / Dimethyl Ether Blend Mixture Storage and Can Filling processes at our facility.\n\nIt is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are coordinated with the Tipp City Fire Department and EMS Units which provides trained emergency response personnel to control and mitigate the effects of the Propane or Propane / Dimethyl Ether Blend Mixture release.\n\n\nOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nTwo of the products DAP Inc. manufactures at the Tipp City facility are aerosol paints and insulating foam for household use.  Our Can Filling operation inserts small quantities of Propane or the Propane / Dimethyl Ether Blend mixture into the cans (depends on the product being manufactured) for use as the propellant when the paint or foam products are used by the consumer.\n\nFor the RMP regulation, our facility's primary activities covered under the RMP regulation encompass the Propane and Propane / Dimethyl Ether Blend Storage Systems due to the volumes stored on-site.  We only have these two regulated substances present at our facility.  The maximum inventory of Propane at our facility is 152,640 lbs. stored in two 18,000 gallon tanks.  Another 8000 gallon tank stores the Propane / Dimethyl Ether mixture.  A fourth 4000 gallon tank stores pure Dimethyl Ether.  Administrative controls manages this tank inventory to keep under 10,000 pounds of Dimethyl Ether at any one time in the storage tank.\n\n\nGENERAL ACC"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13338,
      "SummaryText": "IDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\n\nOur facility has taken all the necessary steps to comply with the Accidental Release Prevention requirements set out under 40 CFR Part 68 of the EPA regulations.  This facility was designed and constructed in accordance with NFPA-58 LP Gas Code.\n\nThe following sections briefly describe the elements of our Release Prevention Program that are in place at our stationary sources.\n\nProcess Safety Information:\n\nDAP Inc. maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with the storage and can filling processes.\n\nProcess Hazard Reviews:\n\nOur facility conducts studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these reviews is called the Checklist/What-If Methodology.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are re-validated at regular intervals of every five years.  Any findings related to the hazard reviews are addressed in a timely manner.\n\nOperating Procedures:\n\nFor the purposes of safely conducting activities within our facility, DAP Inc. has always had written operating procedures.  These procedures address various modes of operation such as startup, normal operations, emergency shutdown, normal shutdown and startup after a maintenance activity.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining:\n\nDAP Inc. has a training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least eve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13338,
      "SummaryText": "ry three years and more frequently as needed.\n\nMechanical Integrity:\n\nDAP Inc. carries out documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; pressure vessels, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\n\nWritten procedures are in place at DAP Inc. to manage changes in process  technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are made aware of and offered training to deal with the modification.\n\nPre-Startup Safety Reviews:\n\nPre-Startup Safety Reviews related to new processes and to modifications in established processes are conducted as needed at DAP Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits:\n\nDAP Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\n\nDAP Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from re-occurring.  All reports are retained for a min"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13338,
      "SummaryText": "imum of 8 years.\n\nEmployee Participation:\n\nDAP Inc. truly believes that Process Safety Management and Accident Prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule.\n\nContractors:\n\nDAP Inc. hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  DAP Inc. has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the process.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n \n\nFIVE-YEAR ACCIDENT HISTORY\n\nDAP Inc. has had an excellent record of preventing accidental releases over the last 25 years.  Due to our  prevention policies, the number of accidental releases has been reduced to a minimum.\n\nThere have been no accidental releases of regulated substances from our facility within the last 5 years.    \n\n\nEMERGENCY RESPONSE PLAN\n\nDAP Inc. has a written emergency response plan to deal with accidental releases of its chemicals stored on-site.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. \n\nMiami County LEPC is the Local Emergency Planning Committee (LEPC) which has jurisdiction over our facility.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nSeveral developments and findings have resulted from the implementation of the various elements of our Accidental Release Prevention Program.  Below are some of the major steps we want to take to improve safe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13338,
      "SummaryText": "ty at our facility.  These changes are expected to be implemented by September 30, 1999.\n\nA.  Remove the equipment \"Not In Service\" at the Unloading Area.\nB.  Replace ALL hydrostatic relief valves."
    }
  ]
}