{
  "FacilityID": 13561,
  "FacilityName": "Robert L. Sutton WRF",
  "FacilityStr1": "3175 South Atlanta Road",
  "FacilityStr2": null,
  "FacilityCity": "Smyrna",
  "FacilityState": "GA",
  "FacilityZipCode": "30080",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13067",
  "LEPC": null,
  "FacilityLatDecDegs": "33.830556",
  "FacilityLongDecDegs": "-84.458333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Cobb County Water System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cobb County Water System",
  "OperatorStr1": "680 South Cobb Drive",
  "OperatorStr2": null,
  "OperatorCity": "Marietta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30060",
  "OperatorZipCodeExt": "3113",
  "RMPContact": "Eddie Chastain",
  "RMPTitle": "Water Protection Division Manager",
  "FTE": 35,
  "OtherEPAFacilityID": "GA0026140",
  "EPAFacilityID": "100000142099",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": "1999-07-19 00:00:00",
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2005-01-31 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-25 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.82653,
  "FRS_Long": -84.45647,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18315,
      "AltID": "chlorine",
      "FacilityID": 13561,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 18786,
          "ProcessID": 18315,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 22994,
          "ProcessID": 18315,
          "ChemicalID": 62,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 522994,
          "ProcessID": 18315,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13561,
      "SummaryText": "The Cobb County Water system strives to make their operations safe, not only for it's employee's, but for it's neigbors and customers as well. In compliance with the RMP rule Cobb County has evaluated and set in place emergency management procedures for the use of Chlorine at the Robert L. Sutton Water Reclamation Facility (WRF). The Robert L. Sutton WRF is located in Cobb County, Georgia in the City of Smyrna. The tertiary, forty million gallon per day wastewater facility is part of the Cobb County Water System and administered by the Water Protection Division. Large quantities of chlorine are used by the Noonday facility for treatment and disinfection of wastewater.  In January of 1999, Metcalf and Eddy, Inc. performed a Chlorine Hazard Assessment for the Cobb County Water System to review planning and safety procedures and determine toxic end points for worse-case and alternative scenarios.\n\nThe Robert L. Siutton WRF uses chlorine solution to disinfect wastewater effluent before surface discharge to Robert L. Sutton. The chlorination facility at this plant uses ton containers to provide chlorine gas for the disinfection process. \n\nThe worse-case release scenario for the plant involves the failure of a one-ton container, releasing the full contents in ten minutes. Atmospheric dispersion modeling using the risk management Program Guidance for Wastewater Treatment Plants (40CFR Part 68) prepared by the US Environmental Protection Agency, October 27 1998, was used to determine the toxic endpoint of the release. The radius corresponding to the toxic endpoint for the water reclamation facility is determined to be three (3) miles. The population potentially affected within the perimeter at the Robert L. Sutton WRF by the worst case scenario is 43,000.\n\nThe alternative release scenario for the plant involves failure of the pigtail tubing connecting a ton container to the chlorination system. This failure is assumed to occur by an accident during loading or unloading cont"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13561,
      "SummaryText": "ainers, which causes the tubing to shear, releasing chlorine gas. The rate of release for the alternative scenario is determined to be less than the worse-case scenario, resulting in a toxic endpoint perimeter of 0.85 miles because the chlorine containers are enclosed inside a building, which reduces the gas release rate to the atmosphere. The population potentially affected within the perimeter at the Robert L. Sutton WRF by the alternative scenario is 4,600.\n\nThe Cobb County WRF's follow safe handling procedures for chlorine as defined in 29 CFR 1910.111.  Air sampling detectors are located at all the chlorine handling locations and will alarm if atmospheric chlorine concentrations exceed 3 ppm. Training in handling safe procedures is performed once a year by the chemical supplier and occurs once a year.  SCBA training occurs once a year and is conducted by the Water Protection Safety Coordinator. Ton container repair kits are located at all the Cobb County WRFs.\n\nNo accidental chlorine releases have occurred at this facility in the past five years. \n\nThe Cobb County Water System's policy for dealing with chlorine releases is to handle small releases in house, and to evacuate and call in fire and hazardous materials personnel for major releases. Written procedures are posted in the case of an emergency. Evacuation of surrounding residents and businesses during a large release is delegated to public safety personnel."
    }
  ]
}