{
  "FacilityID": 13623,
  "FacilityName": "Sanitary District of Decatur",
  "FacilityStr1": "501 Dipper Lane",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "IL",
  "FacilityZipCode": "62522",
  "Facility4DigitZipExt": "1899",
  "FacilityCountyFIPS": "17115",
  "LEPC": "Macon County LEPC",
  "FacilityLatDecDegs": "39.83225",
  "FacilityLongDecDegs": "-89.001917",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "LW",
  "FacilityURL": null,
  "FacilityEmailAddress": "joeb@sdd.dst.il.us",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Monte Cherry; Executive Director",
  "OperatorStr1": "501 Dipper Lane",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62522",
  "OperatorZipCodeExt": "1899",
  "FTE": 62,
  "OtherEPAFacilityID": "ILD980617823",
  "EPAFacilityID": "100000141731",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1987-04-28 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-11-06 00:00:00",
  "DeRegistrationEffectiveDate": "2002-05-05 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.84004,
  "FRS_Long": -89.00085,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18395,
      "AltID": "Chlorine; disinfection",
      "FacilityID": 13623,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 23079,
          "ProcessID": 18395,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 18875,
          "ProcessID": 18395,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 9784,
              "Process_NAICS_ID": 18875,
              "SafetyReviewDate": "1998-07-14 00:00:00",
              "PHA_Date": "1998-07-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Tank/cylinder repair kits (2) stored near cylinders and vacuum delivery system",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "The District will eliminate chlorine and go to ultraviolet disinfection by November, 1999.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "The District will eliminate chlorine and go to ultraviolet disinfection; to be completed by October/November, 1999.",
              "OpProceduresReviewDate": "1999-06-14 00:00:00",
              "TrainingReviewDate": "1998-07-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "HAZMAT training through the Fire Service Institute; University of Illinois, in accordance with CFR 29 1910.120, and NFPA 472, and EPA Standard Operating Guideline (1992).",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-07-14 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "Chlorine contact tanks, chlorination system; 4-26-99",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-14 00:00:00",
              "PreStartupReviewDate": "1999-04-26 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-14 00:00:00",
              "HotWorkPermitReviewDate": "1998-07-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 13689,
                  "PreventionProgram3ID": 9784,
                  "ProcessChemicalID": 23079
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13623,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-07-14 00:00:00",
    "ERTrainingDate": "1999-05-24 00:00:00",
    "CoordinatingAgencyName": "Decatur Fire Department",
    "CoordinatingAgencyPhone": "2174242811",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "IL/USEPA, Illinois Department of Labor"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 13623,
      "SummaryText": "with our process.\n\nPROCESS HAZARD ANALYSIS;\nThe Sanitary District conducts comprehensive safety audits in an effort to identify recognized hazards associated with our process and the rest of our facility in general.  The audits of our Safety Committee (comprised of management, staff, and hourly employees with various and qualified backgrounds in operations, maintenance, chemistry, and industrial safety) are used to identify hazards and eliminate or reduce the risks associated with those hazards.  The Safety Committee will conduct a PHA review for chlorine in the next several weeks.  Operators check the process function regularly (quarterly) on a three-shift basis and report abnormal conditions to their supervisor.  Process checks are recorded in log books at the process site.\n\nOPERATING PROCEDURES;\nWritten operating procedures are maintained at the Sanitary District for the purpose of safely conducting daily activities involving our chlorine process.  The operating procedures cover various operating conditions and considerations such as pre-start equipment cleaning and preventative maintenance, startup, normal three-shift operation, spot-operation (non-seasonal), shutdown, emergency shutdown, cylinder change-out, repair of cracked or leaking cylinders and valves, securing cylinders to the manifold system, use of on-site SCBAs for cylinder change-out, and PPE.   Operation of the chlorine process is limited to personnel in the Operations department.  Information is reviewed regularly and is readily accessible to Operations and Maintenance personnel.  Current procedural documents are under review.\n\nTRAINING;\nThe Sanitary District conducts comprehensive training in the covered process to ensure competency in all operating procedures associated with that process.  Refresher training is provided as needed or when requested.\n\nMECHANICAL INTEGRITY;\nThe Sanitary District conducts hourly checks (documented) twenty-four hours a day, seven days a week, on all phases of the pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13623,
      "SummaryText": "cess and on all attendant process equipment.  Items checked include alarms, monitors, evaporators, process piping, manifold system, pumps, emergency equipment, and building conditions.  Maintenance is performed by skilled personnel holding Master Mechanic certification.  Operations consists of licensed wastewater treatment employees holding licensing credentials with the State of Illinois for Classes I, II, III, and IV.  The combined years of experience and knowledge possessed by these two employee groups ensures that immediate countermeasures are applied to any discrepant items and that these countermeasures are performed in a safe and timely manner.\n\nMANAGEMENT OF CHANGE;\nChanges in processes, chemicals, equipment, technology, and procedures requires that employees be made aware of these changes through instruction, training, and competency testing.  Many of the standards that regulate work conditions are constantly under change.  It is the District's policy to keep all employees apprised of any changes that may effect them and the daily operation of the facility itself.\n\nPRE START-UP REVIEW;\nChlorine is used to disinfect our effluent stream from May 1st  through October 31st each year (seasonal) as required by IEPA permanent regulation.  Visual inspections, equipment cleaning and other general preparation steps are taken beginning with the last week in April each season.  These pre start-up activities are performed by Operations, Maintenance, and Staff personnel to ensure the structural integrity and operability of all alarm, pumping, piping, delivery, manifold, and handling systems associated with the process.  Wearable parts are inspected and relaced as necessary.  This activity is also used to determine whether regular start-up activities will be allowed at the end of this week-long period.\n\nCOMPLIANCE  AUDITS;\nThe District performs compliance audits periodically to ensure that all facets of the Risk Management Program are working and being adhered to.  Correc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13623,
      "SummaryText": "tive actions are taken immediately if any process or training discrepancies are noted.\n\nINCIDENT INVESTIGATION;\nThe District immediately investigates any incident or condition which could lead to an accidental chemical release.  These investigations will seek out the root cause of any process deviation, climactic influence, or unanticipated event which could lead to a minor or catastrophic release.  Information gathered will be shared with all employees in an effort to heighten their awareness and to prevent the reoccurence of a similar condition or situation.  Incident records are filed for five years.\n\nEMPLOYEE PARTICIPATION;\nThe District possesses a mindset that places safety as the number one priority in conducting day-to-day job assignments.  The District employees know that they have a conduit for any safety concerns and are encouraged, in fact, to cease in any work activity that they may deem unsafe (included in the bargaining agreement).  District employees have access to all safety-related documentation regarding equipment, processes, chemicals, and the Risk Management Program.  Employees are part of the Job Hazard Analysis process.\n\nCONTRACTORS;\nThe District periodically employs contractors to perform routine maintenance/construction and/or other specialized work.  Contractors are required to comply with District policies as well as other applicable city, state, and federal standards and regulations.  The contractor's safety representative meets with the District's safety and health coordinator prior to the job to ensure that site-specific training (regarding the covered process) is conducted.  The District safety and health coordinator is apprised by the contractor of any incident, accident, or near-miss which may have been incurred by the contractor's employee(s).  Contractor-District meeting notes are maintained along with the aforementioned incident, accident, near-miss reports in and effort to determine the effectiveness of past and proposed joint saf"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13623,
      "SummaryText": "ety programs.  Contractors are informed of the hazards and emergency response plans for the covered process.\n\nFIVE-YEAR ACCIDENT HISTORY;\nThe District has an excellent five-year accident history; no accidental releases of any magnitude for chlorine!  This is due largely in part to constant diligence in monitoring the process and by good safety and work practices already well-established and adhered to.\n\nEMERGENCY RESPONSE PLAN;\nThe District is listed with the Local Emergency Planning Committee of Macon County (217-424-1327) and with the Decatur Fire Department regarding chlorine.  The Fire Department has agreed to initially back-up the District's HAZMAT team in responding to any accidental chemical releases.  The Fire Department has asked us to contact them through 911.  The Fire Department's Telecommunications Specialist will then notify other emergency response agencies after receiving information about our accidental release, who we are, our location, and injury reports.  The Fire and Police departments will be dispatched to our location simultaneously.  The Police will be responsible for traffic control, establishing a safety perimeter, and assistance with evacuation.  The Fire Department will assess our handling of the situation and would set up a command center.  Ambulances would be dispatched to treat and transport any victims affected by the accidental release.  The Emergency Services Disaster Agency (ESDA) would be notified by the Fire Department.  ESDA's primary function would be to serve as liaison between the municipality (the District) and the state government.  ESDA coordinates activities with additional agencies which would require notification in the event of an accidental release."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 13623,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE PROCEDURES/POLICIES;\nThe Sanitary District of Decatur is strongly committed to the safety of our employees, the public, and the environment in which we live and work.  This commitment is demonstrated through a comprehensive accidental Chemical Release Prevention Program which considers the design, installation, operating procedures, maintenance, and employee training associated with our covered process.  We have implemented the highest levels of control to prevent the accidental release of a regulated substance (chlorine).\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED; \n We are a 41.5 mgd wastewater treatment facility.  We have one regulated substance present and that is chlorine.  Chlorine solution is injected into our effluent stream to disinfect the effluent prior to discharge into the Sangamon River.  We receive our chlorine in one-ton cylinders.   Delivery to the final effluent stream is accomplished through a dual manifold system comprised of process piping and three one-ton cylinders on each manifold.  The liquid chlorine is evaporated into a gas and is infused into the water supply through ejectors to form liquid a liquid chlorine solution.  The chlorination system works on a vacuum principle to prevent the loss of chlorine gas in the event of a failure in the gas piping system.  There are up to nine full cylinders stored near the manifold area for change-out.  Change-out is usually done whenever three cylinders have been exhausted.  A maximum inventory of chlorine stored/used on-site would be fifteen one-ton cylinders (six online and nine standby).\n\nWORST CASE AND ALTERNATE RELEASE SCENARIOS;\nIn an effort to evaluate the worst case scenario and the alternate release scenario,  EPA's RMP Guidance for Wastewater Treatment Plants (40 CFR Part 68) lookup tables and EPA's RMP*COMP software were used.  The more conservative estimates of both programs were sought in compiling the data.  Details are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13623,
      "SummaryText": "in the following paragraphs.\n\nThe WORST CASE SCENARIO involves a catastrophic release of the entire fifteen tons of chlorine over a ten minute period.  The toxic liquid is assumed to form a large pool of one centimeter in depth from which evaporation would take place.  The earthen dikes around the chlorine building are a passive mitigation measure and were considered in this scenario.  Assuming a release rate of 1650 pounds per minute, class F atmospheric stability, a wind speed of 1.5 meters per second, and an urban topography, a distance of 3.8 miles is reached before obtaining a toxic endpoint of .0087 mg/L (3ppm).  \n\nThe chlorine ALTERNATE RELEASE SCENARIO involves the rupture of a single cylinder valve on a one ton cylinder stored near the dual manifold system.  The valve was damaged in transit and was finally broken while being unloaded from the vendor's truck.  The chlorine release cannot be mitigated as nearby employees have had to vacate the immediate area.  The entire contents of the one-ton cylinder is released over a ten-minute period.  Assuming a release rate of 220 pounds per minute, class D atmospheric stability, a wind speed of 3 meters per second, and an urban topography, a distance of .2 miles is reached before obtaining a toxic endpoint of .0087 mg/L (3ppm).\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS;\nThe District has taken steps necessary to maintain compliance with the accidental release prevention requirements required by 40 CFR Part 68 (Environment).  The currently facility was designed and constructed in accordance with all applicable local, state, and federal codes in existance at that time.  The following is a brief description of the elements of the release prevention program in place.\n\nPROCESS SAFETY INFORMATION;\nThe Sanitary District maintains records of safety-related information (currently under review) describing chemical hazards, operating parameters, and equipment design associated"
    }
  ]
}