{
  "FacilityID": 13739,
  "FacilityName": "City of Brownwood Wastewater Treatment Plant",
  "FacilityStr1": "3400 Hoover Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Brownwood",
  "FacilityState": "TX",
  "FacilityZipCode": "76801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48049",
  "LEPC": "Brown County LEPC",
  "FacilityLatDecDegs": "31.694722",
  "FacilityLongDecDegs": "-98.949",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Brownwood",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Brownwood",
  "OperatorStr1": "P.O. Box 1389",
  "OperatorStr2": null,
  "OperatorCity": "Brownwood",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76804",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Jimmie Johnson",
  "RMPTitle": "Director of Utilities",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144248",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.69806,
  "FRS_Long": -98.93917,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18613,
      "AltID": "Chlorination System",
      "FacilityID": 13739,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19102,
          "ProcessID": 18613,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23439,
          "ProcessID": 18613,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523439,
          "ProcessID": 18613,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 18614,
      "AltID": "Sulfur dioxide system",
      "FacilityID": 13739,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19103,
          "ProcessID": 18614,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23440,
          "ProcessID": 18614,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523440,
          "ProcessID": 18614,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13739,
      "SummaryText": "Facility Description\n\nThe City of Brownwood Wastewater Treatment Plant treats wastewater from the City and surrounding areas.  In the wastewater treatment process, chlorine is added as a disinfectant followed by the addition of sulfur dioxide to remove unreacted chlorine before the effluent is discharged.  The Plant maintains a maximum inventory of 18,000 pounds of chlorine and a maximum inventory of 10,000 pounds of sulfur dioxide.  Each chemical is stored in quantities above their respective threshold level, and the Plant is therefore subject to the requirements of the Risk Management Program.\n\nThe City of Brownwood Wastewater Treatment Plant has been in service since the 1930's.  Chlorine has been in use at the Plant since operation began, and sulfur dioxide was added to the disinfection process system in the 1980's.  No accidental releases of chlorine or sulfur dioxide meeting the requirements of the five-year accident history, as defined in the Risk Management program regulations, have occurred at the facility.\n\n\nOffsite Consequence Analysis\n\nThe off-site consequences of potential accidental releases of chlorine and sulfur dioxide at the Plant were assessed in accordance with requirements established in 40 Code of Federal Regulations, Part 68.  The Environmental Protection Agency's Risk Management Program Guidance for Wastewater Treatment Plants, which provides guidance for chlorine and sulfur dioxide systems such as those at the Brownwood Plant, was used to model a worst case release scenario and alternative release scenarios for each chemical.  \n\nThe worst case scenario is a model of a release under specific conditions established by EPA, including release volume, duration, and weather conditions. Active safety systems in place at the Plant that are designed to minimize the effects of a chlorine release cannot be considered in the worst case scenario.  \n\nThe worst case release scenario is required to assume the release in a ten minute period of the entire con"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13739,
      "SummaryText": "tents of the largest vessel of the regulated chemical onsite, which for the Plant is a one-ton sulfur dioxide container.  Meteorological conditions required by EPA rules are assumed for the release.  The toxic endpoint for the worst case release scenario is estimated to reach a point offsite of the facility. Since this facility is located in a populated area, the sulfur dioxide vapor would reach offsite endpoints and nearby public receptors. No sensitive environmental receptors designated by EPA are located within the release area.\n\nThe alternative release scenarios represent the results more likely to occur in the event of a chlorine or sulfur dioxide release at the Plant.  Active safety systems at the Plant are considered for each alternative release scenario. Average weather conditions at the facility are used for this release scenario, as recommended by EPA regulations.\n\nFor the sulfur dioxide alternative release scenario, failure of a valve in the sulfur dioxide feed system is assumed. While the toxic endpoint for the sulfur dioxide alternative release scenario is estimated to reach a point beyond the facility boundary, no residences, public receptors or environmental receptors designated by EPA are located within the release area.\n\nFor the chlorine alternative release scenario, failure of a pipe in the chlorine feed system is assumed.  While the toxic endpoint for the chlorine alternative release scenario is estimated to reach a point offsite of the facility, residences, public receptors and environmental receptors designated by EPA are not located within the release area.\n\n\nPrevention Program\n\nThe Wastewater Treatment Plant is subject to Prevention Program 2 of the Risk Management Program.  In accordance with the requirements of Program 2, the Plant maintains specifications for the equipment associated with the chlorine and sulfur dioxide feed systems and has documented the codes and standards adhered to in designing, constructing, and operating each system. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13739,
      "SummaryText": " The safe operating ranges for each system are documented, and each system is operated within these safe ranges.\n\nA hazard review has been conducted for each feed system and identified action items are expected to be completed by December 31, 1999.  When a major process change is made to either system, there are procedures in place to conduct a hazard review.  Otherwise, a hazard review is conducted every five years.\n\nWritten procedures for the operation and maintenance of both the chlorine and sulfur dioxide systems are also in place at the Plant.  Procedures are reviewed and updated annually by facility personnel and whenever a major process change occurs.\n\nPlant operators receive training in the operation of each chemical system through classes and on-the-job instruction.  Competency is determined through supervisor observation, operator demonstration of activities, written exams, and oral tests.  Operators receive refresher training at least every three years, or more often as necessary.  Only qualified operators operate the chlorine and sulfur dioxide systems.\n\nA team of facility personnel conducts a compliance audit of the facility operations and procedures once every three years and whenever a major process modification is made.  A compliance audit checklist has been developed based on American Water Works Association recommendations.  A system to correct any deficiency discovered during the compliance audit is in place.\n\nIn the event of an accidental release, or a situation that could lead to an accidental release, the Plant has procedures to investigate such incidents, develop findings and recommendations for corrective action, and implement the recommendations.\n\nFacility personnel are trained to notify emergency personnel in the event of a significant chlorine or sulfur dioxide leak.  In the unlikely event a sulfur dioxide or chlorine release requiring the assistance of offsite emergency response personnel occurs, the City of Brownwood Fire Department is r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13739,
      "SummaryText": "esponsible for responding to the accident, coordinating the emergency response effort, and notifying potentially affected areas in the surrounding community."
    }
  ]
}