{
  "FacilityID": 13753,
  "FacilityName": "Superior Dairy Inc.",
  "FacilityStr1": "4719 Navarre Rd SW",
  "FacilityStr2": null,
  "FacilityCity": "Canton",
  "FacilityState": "OH",
  "FacilityZipCode": "44706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39151",
  "LEPC": "Stark County LEPC",
  "FacilityLatDecDegs": "40.770861",
  "FacilityLongDecDegs": "-81.437",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "generalsdi@aol.com",
  "FacilityDUNS": 4526638,
  "ParentCompanyName": "LEL Operating Co.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Daniel P. Soehnlen",
  "OperatorStr1": "4719 Navarre Rd SW",
  "OperatorStr2": null,
  "OperatorCity": "Canton",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44706",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Ehret",
  "RMPTitle": "Manager, Environmental Compliance",
  "FTE": 190,
  "OtherEPAFacilityID": "sprrdn",
  "EPAFacilityID": "100000145274",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.77007,
  "FRS_Long": -81.43778,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18650,
      "AltID": null,
      "FacilityID": 13753,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19139,
          "ProcessID": 18650,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 23479,
          "ProcessID": 18650,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 523479,
          "ProcessID": 18650,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13753,
      "SummaryText": "Superior Dairy Inc. is a family owned processor and distributor of dairy products. Our plant is located in a rural/industrial setting with several small housing developments in close proximity. The plant has been located at this site for approximately 77 years and has grown from a small residential-type structure to its' present size.\nSuperior Dairy receives its' raw milk supply from a variety of small, independent farms in the surrounding communities. This milk is processed and packaged into various products which are sold to a number of different outlets. Our product line includes items such as milk, cottage cheese, sour cream, dip, fruit juices and drinks as well as a variety of frozen dessert items like ice cream and stick novelties. These products are briefly held in storage at our facility before being shipped to warehouses, hospitals, grocery stores and other retail outlets.\nThese processing and storage functions require the use of some working fluid to be used as a refrigerant in our vapor compression refrigeration system. The primary refrigerant used at Superior Dairy is anhydrous ammonia. This refrigerant is used mainly because of its' efficient cooling capabilities. Ammonia also has several other key advantages over other refrigerants such as CFC's, HCFC's and HFC's:\n    1.Ammonia is lighter than air and will thus dissipate more quickly than other refrigerants in the event of a release.\n    2.Ammonia has an extremely pungent odor which gives it an excellent alarming quality.\n    3.From a volumetric standpoint, much less ammonia is required to achieve the same cooling results as other available mediums.\n    4.Harmful health effects of exposure to ammonia are significantly less than other refrigerants.\n    5.Ammonia released to the atomosphere has no negative effect on the ozone level in contrast to CFC's.\nThe above listed advantages make ammonia the clear choice for both health and environmental considerations.\nIn the daily operations at Superior, a wide v"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13753,
      "SummaryText": "ariety of chemicals are used to clean and sanitize processing and packaging equipment. This chemical use is necessary to ensure that our products are of the highest quality. Because of the chemical usage in our plant, Superior places a very high priority on safe chemical handling practices. Employees are regularly trained by both our own people as well as a variety of individuals from outside sources. Regular audits and inspections are conducted by our supervisors in conjunction with our chemical suppliers to uncover any any deficiencies in our chemical handling procedures.\nIn accordance with 40 CFR part 68, EPA's Risk Management Program, Superior Dairy has conducted an offsite consequence analysis to determine the impact of an ammonia release to the surrounding area. Our analysis was condusted by Dr. Arnel Potter, Phd chemistry. Dr. Potter used information supplied by us to determine the toxic endpoints with the aid of EPA's RMP Comp ver. 1.06.\nWorst-Case Scenario\nOur worst case scenario assumes a catastrophic failure to an ammonia tank which would result in a release of approximately 227 pounds per minute over a ten minute period. This release would occur in an enclosed space with direct cotact to outside air. A release of this magnitude would reach its' toxic endpoint at .9 (9/10) of a mile from our facility. This type release would require the evacuation of homes within this area and would additionally impact several industrial facilities in the immediate area.\nIt is important to note that while this impact is quite significant, the actual risk of this type accident is minimal. Superior has an exemplary safety record and an extensive knowledge of ammonia refrigeration systems. Our maintenance and engineering departments work closely to design and operate extremely safe systems. The location of this and any similar vessels are such that access is very limited. Level controls and pressure relief devices further ensure the safety of these tanks.\nAlternate-Case Scen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13753,
      "SummaryText": "ario\nThe alternate case scenario for our process was devised using the same computer model as above. This scenario has a release reaching a toxic endpoint at .4 (4/10) of a mile from our facility. Once again homes in close proximity to the plant would need to be evacuated as a precaution. This scenario however would not impact any of the industrial facilities in the area. The probability of a release of this nature is more likely, but the probability of any release based on past experience remains small.\nThe scenario outlined in the alternate case was chosen because it involves a release occurring during a transfer of ammonia from a delivery vehicle to a holding tank. It is reasonable to assume that if a release were to occur, this would be the most likely time for it to happen. Because of this increased liklihood of an accident, Superior and its' ammonia supplier adhere to very strict safety precautions during this critical process.\nSuperior Dairy is currently required to comply with OSHA's Process Safety Management Program. This program is very similar to the Risk Management Program initiated by EPA. In complying with these programs, Superior has made a concerted effort to continuously improve the ammonia refrigeration system in use at our plant.Through the implementation of programs like Process Hazard Analysis, written operating procedures, hot work permitting, employee participation and management of change procedures, we are constantly striving to reduce or eliminate any risk associated with the use of ammonia. The additional process of compiling  safety information and using this information to train our employees has increased the knowledge and general safety awareness of our employees. This same safety information is used to train contract employees about the hazards associated with an ammonia release. By training our contractors and reviewing their safety programs before they begin any work in our plant, we hope to reduce the possibility of an accident inv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13753,
      "SummaryText": "olving an outside employee.\nOur five year accident history is truly remarkable. Superior Dairy has never in its' history experienced a reportable release. Also no employee or contractor has ever suffered a serious injury associated with an ammonia release. This outstanding record is a testament to the seriousness with which we at Superior treat our ammonia system and its' safe operation.\nOur emergency response system is coordinated with the Stark County LEPC. In the unlikely event of a reportable release, the Perry Twp. Fire Department as the initial point of contact would make the determination as to when the hazmat team should be called into action. The LEPC in coordination with Perry Twp would then determine what, if any, evacuation should follow. Superior Dairy has taken the additional precaution of contracting with Sunohio to handle any clean up required by a release. Sunohio is  also trained to respond should something prevent the hazmat team from responding to an emergency. This additional precaution has been taken as insurance against any personal or environmental injury.\nSafety is a primary concern of everyone at Superior Dairy. Management is actively involved in the safety programs at Superior and the goal is to constantly look for opportunities to improve our programs. Superior management has been and will continue to be a strong advocate for providing a safe work environment for our employees. We are also committed to remaining a responsible corporate citizen and a good neighbor to the community."
    }
  ]
}