{
  "FacilityID": 13876,
  "FacilityName": "Coeur d'Alene Advanced Wastewater Treatment Plant",
  "FacilityStr1": "915 W. Hubbard Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Coeur d'Alene",
  "FacilityState": "ID",
  "FacilityZipCode": "83814",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16055",
  "LEPC": "Kootenai County LEPC",
  "FacilityLatDecDegs": "47.681722",
  "FacilityLongDecDegs": "-116.796056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "LW",
  "FacilityURL": null,
  "FacilityEmailAddress": "cdawwtp@micron.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Coeur d'Alene, Idaho",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Coeur d'Alene, Idaho",
  "OperatorStr1": "710 E. Mullan Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Coeur d'Alene",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83814",
  "OperatorZipCodeExt": "3964",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145513",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 47.6829,
  "FRS_Long": -116.79476,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18922,
      "AltID": "Chlor-dechlor",
      "FacilityID": 13876,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 23808,
          "ProcessID": 18922,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 23809,
          "ProcessID": 18922,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19411,
          "ProcessID": 18922,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 7669,
              "Process_NAICS_ID": 19411,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NFPA-820",
              "FR_Comments": "NFPA requires scrubber units. Plant built in compliance with all national and state codes.",
              "HazardReviewDate": "1998-08-13 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Berms",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1995-12-19 00:00:00",
              "TrainingReviewDate": "1998-02-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Chlorine/Sulfur Dioxide Scrubber - Powell Fabrication & Manufacturing",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Wastewater Treatment Plant -- Chlorination of treated effluent and de-chlorination of same utilizing sulfur dioxide. Both chemicals' storage areas connected to scrubber that features redundancy, automatic leak detectors and emergency stand-by power.",
              "_chemicals": [
                {
                  "PrimaryKey": 8003,
                  "PreventionProgram2ID": 7669,
                  "ProcessChemicalID": 23808
                },
                {
                  "PrimaryKey": 8004,
                  "PreventionProgram2ID": 7669,
                  "ProcessChemicalID": 23809
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13876,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-02-28 00:00:00",
    "ERTrainingDate": "1998-02-28 00:00:00",
    "CoordinatingAgencyName": "Coeur d'Alene Fire Department",
    "CoordinatingAgencyPhone": "2087692340",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13876,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY.\n\nAll of the city's Advanced Wastewater Treatment Plant's (AWTP) 12 certified wastewater operators are trained in:\n\n    Chemical transportation and storage.\n    Emergency cylinder leak containment and repair.\n    Use of Self-contained breathing apparatus.\n    Leak detection alarm calibration.\n    Emergency chemical scrubber operation and maintenance.\n    Emergency standby generator operation and maintenance.\n\nTrained operators include the wastewater superintendent and assistant superintendent.\n\nThe city and its wastewater utility are committed to safety in all aspects, but especially to the safe storage and use of all the chemicals at the AWTP. All operators are mandated to complete chlorine and sulfur dioxide emergency response training within the first year on the job. Refresher courses are offered both locally and through the local member association of the Water Environment Federation as well as state training offices in both Idaho and Washington. Safety reviews are conducted locally several times per year. Emergency equipment is well maintained and regularly exercised.\n\nTHE FACILITY AND THE REGULATED SUBSTANCES HANDLED.\n\nThe city's AWTP is located on the Spokane River about 0.5 miles downstream of the outlet of Coeur d'Alene Lake. It is located adjacent to a stud sawmill and to the city-owned Harbor Center office building.\n\nThe AWTP currently treats a summer peak wastewater flow of 3.2 million gallons per day (mgd) and is designed for 6.0 mgd. It currently serves a municipal population of approximately 31,000. It utilizes the following liquid stream processes:\n\n    Screening, pre-aeration and grit removal.\n    Primary clarification.\n    Plastic media trickling filters for secondary treatment in conjunction with solids     re-aeration and solids contact for secondary treatment.\n    Secondary clarification.\n    Chlorine solution disinfection followed by sulfur dioxide solution neutralization     of the excess chlorine.\n    Liquid alum addition i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13876,
      "SummaryText": "n the growing season for phosphorus removal.\n    Discharge via diffusers to the Spokane River.\n                \nThe solids stream consists of:\n\n    Primary and secondary sludge thickening.\n    Anaerobic digestion.\n    Belt filter press de-watering.\n    Sludge cake transport off-site to a separate biosolids composting facility.\n    Digester utilization by boilers or waste gas burning.\n\nRegulated substances include both chlorine and sulfur dioxide in one-ton cylinders of liquid under pressure. Up to 8,000 pounds of chlorine and 6,000 pounds of sulfur dioxide can be on-site in storage at any one time. The City of Coeur d'Alene's Advanced Wastewater Treatment Plant (AWTP) is staffed 8 hours per day and 7 days per week. One-ton cylinders of liquid chlorine (under pressure) furnish the necessary gas for mixing with water as a disinfectant to the AWTP's effluent. Just prior to the effluent's discharge to the Spokane River, a solution of water and sulfur dioxide is added to neutralize the excess chlorine. Sulfur dioxide is stored likewise in one-ton cylinders for dispensing.\n\nTwo operators are always present during the transfer of cylinders to and from storage.\n\nThe storage and dispensing areas are in a sealed building of masonry construction. The storage areas are treated as confined space entry areas. Advance entry permits are required before entry.\n\nTHE WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO.\n\nWorst-Case:\n\nEither a one-ton cylinder of chlorine or sulfur dioxide is ruptured while being moved into the storage building effecting a release. For chlorine it is assumed that the release rate is 200 pounds per minute for a duration of 10 minutes. For sulfur dioxide it is assumed that the release rate is 200 pounds per minute for a duration of 10 minutes. As this is an urban area, the end-point concentration of 3 parts per million (ppm) extends for a radius of 1.3 miles and has the potential of affecting 11,100 residents. This was arrived at by the use of EPA's RMP*Comp.\n\nAlternative"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13876,
      "SummaryText": " Scenario:\n\nThe storage facility for both chemicals is enclosed and surrounded by berms. An emergency scrubber is connected to the storage facilities. It has the capacity to neutralize 2350 pounds of either chemical. Upon alarm activation (At 5 ppm), the unit automatically starts. It places the storage facility under negative pressure and passes the vapors into the scrubber system. Liquid fractions are collected in a trench and are vacuumed into the liquid eductor of the scrubber. Neutralized gases are vented to the atmosphere.\n\nThe scrubber has 2 feed pumps that draw the vacuum. One is needed; the other is redundant back-up. The unit is connected to the plant's standby generator so that it is fully functional in the event of a power outage.\n\nThe maximum chlorine discharge limit is 15 ppm; or 50% of the IDHL. At 500 cfm this computes to a release rate of 0.613 GRAMS per minute. It takes 25.5 minutes to neutralize the entire contents from a one-ton cylinder.\n\nThe maximum sulfur dioxide discharge limit is 50 ppm; or 50% of the IDHL. At 500 cfm this computes to a release rate of 1.84 GRAMS per minute. It takes 25.5 minutes to neutralize the entire contents from a one-ton cylinder.\n\nThe default end-point distance is 0.1 miles. No residential population is potentially affected by such a release.\n\nChlorine and sulfur dioxide leak detectors are present in each storage area. They are actuated at 5 ppm concentrations. Audio and visual alarms are activated throughout the plant and at the city's fire department. Fire department response time is less than 5 minutes. Both the plant and collection system on-call operators are automatically called and paged.\n\nSCBA equipment is located on-site. Five units are located around the plant site. Leak repair kits are stored near the front of the plant; well away from the storage area and up wind of the prevailing wind.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS.\n\nThe city's AWTP operates under se"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13876,
      "SummaryText": "veral sets of regulations. The following govern to plant:\n\n    State of Idaho - Industrial Commission\n    EPA - Clean Water Act\n    State of Idaho - Division of Environmental Quality\n    State of Idaho - SERC\n\nThe worst-case release scenario is based on a release outside of the storage facility. The city assigns 2 operators whenever moving chemical cylinders into storage. Electric hoists with fail safe devices are used to lift the cylinders. No manual labor is required. The hoists are inspected and certified annually.\n\nThe chemical feed equipment including the cylinders are inspected daily. Chemical use is documented daily.\n\nLeak detectors are re-calibrated annually. Alarms and the emergency scrubber are exercised monthly. SCBAs are rotated through the fire department annually.\n\nAll operators receive annual training in chlorine and sulfur dioxide safety including transport, use, leak detection and emergency leak response including leak repair. Management annually reviews the chemical supplier's cylinders for inspection and certification.\n\nFIVE-YEAR ACCIDENT HISTORY.\n\nThere have been no accidental releases of either chlorine or sulfur dioxide in at least the past 8 years.\n\nEMERGENCY RESPONSE PROGRAM.\n\nThe city's fire department is the designated first responder for any accidental chemical releases. The AWTP's operators will also respond, but as secondary responders. The fire department will act as the incident commander. Law enforcement can be deployed as needed. HAZMAT teams are available locally in the city through Kootenai County Fire District # 1. Other HAZMAT teams are available in Spokane, WA - 33 miles away.\n\nThe city is a member of, and participates in, Kootenai County's Emergency Operations Plan administered through its Disaster Services Bureau. Drills are conducted jointly with the county and other agencies. The current wastewater superintendent has received training in HAZMAT response and exercise design through the State of Idaho and FEMA.\n\nThe plant has an emergency"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13876,
      "SummaryText": " response plan for chemical emergencies adopted in February 1998. It is a part of the plant's O & M manual and is readily available.\n\nPLANNED CHANGES TO IMPROVE SAFETY.\n\nNo structural changes are planned. However, the AWTP is undergoing a major facility plan by our consulting engineers. The chlorination/dechlorination processes will be reviewed and made a part of this 20-year facility plan.\n\nIt is management's intention to improve safety training of the operators and to increase the documentation of that training."
    }
  ]
}