{
  "FacilityID": 13890,
  "FacilityName": "Eastside Water Treatment Plant",
  "FacilityStr1": "35261 116th Street East",
  "FacilityStr2": null,
  "FacilityCity": "Pearblossom",
  "FacilityState": "CA",
  "FacilityZipCode": "93553",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "34.521389",
  "FacilityLongDecDegs": "-117.923056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "avekwa@aol.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Antelope Valley - East Kern Water Agency",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "AVEK",
  "OperatorStr1": "6500 West Ave. N",
  "OperatorStr2": null,
  "OperatorCity": "Palmdale",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93551",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145826",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-05-02 00:00:00",
  "DeRegistrationEffectiveDate": "2003-02-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.521389,
  "FRS_Long": -117.923056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 18962,
      "AltID": "Chlorination",
      "FacilityID": 13890,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 23851,
          "ProcessID": 18962,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19451,
          "ProcessID": 18962,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10102,
              "Process_NAICS_ID": 19451,
              "SafetyReviewDate": "1995-01-27 00:00:00",
              "PHA_Date": "1999-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-10 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-10 00:00:00",
              "EquipmentInspectionDate": "1998-12-01 00:00:00",
              "EquipmentTested": "Chlorination",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14180,
                  "PreventionProgram3ID": 10102,
                  "ProcessChemicalID": 23851
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 13890,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-06-01 00:00:00",
    "ERTrainingDate": "1998-02-10 00:00:00",
    "CoordinatingAgencyName": "LA County Fire Department",
    "CoordinatingAgencyPhone": "6619472111",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13890,
      "SummaryText": "EXECUTIVE SUMMARY\n\nEPA RMP Compliance\nThis RMProgram has been developed for the Antelope Valley - East Kern Water Agency's (AVEK) Eastside Water Treatment Plant in response to the EPA Risk Management Program and OSHA Process Safety Management guidelines.  The RMProgram includes modifications to the existing program that AVEK has in place for handling regulated chemicals at the Eastside Water Treatment Plant.\n\nFacility Background\nThe Eastside Water Treatment Plant is a unit of the AVEK water treatment and transmission system.  As part of the Agency's facilities, it performs the function of treating water supplied from the California Aqueduct.  The Eastside Water Treatment Plant is located on 116th Street East to the north of Pearblossom Highway and between the communities of Pearblossom and Littlerock.  \nThe Eastside Water Treatment Plant was commissioned in 1980.  It is designed to treat 10 million gallons of water per day.  The Eastside Water Treatment Plant monitors raw water quality and provides treatment so that the treated water delivered to consumers meets or exceeds state water quality standards.\n\nChlorination and Storage\nChlorine is one of the regulated chemicals subject to the EPA's new Risk Management Program.  It is both stored and used at the Eastside Water Treatment Plant site.  The chlorine is vital in the treatment of raw water, playing a number of different roles in water treatment processes, such as taste and odor control, color removal, and as an aid to filtration.  Its primary role is as a disinfectant, removing harmful bacteria and viruses from the water supply.\nChlorine in the form of liquid/gas is stored in 1-ton pressurized containers.  There is only one location on the plant site where chlorine is stored, the chlorine storage room.  The chlorine gas is transferred from the storage containers through 1-inch piping to a point where it is dissolved and diluted into a water stream in the chlorine feeder room.  This is accomplished with vacuum ope"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13890,
      "SummaryText": "rated regulators that keep the chlorine gas under vacuum until it is drawn into water to form chlorine solution.  From this point the chlorine solution leaves the chemical feed area and travels on to various injection points.\nThe chlorination system is installed within two separate rooms:  the chlorine storage room and the chlorination equipment room.  Up to three 1-ton containers can be stored within the chlorine storage room.  The chlorination equipment room contains the chlorine metering equipment.  The chlorine containers supply chlorine gas through a vacuum regulator valve located on the tank, a chlorinator (device for supplying a measured amount of chlorine), and injectors.  Typically, two or three chlorinators are connected in parallel upstream of the injectors.  The injectors are the primary functional components of the chlorination system.  As water flows through the injectors, it creates a vacuum that enables the chlorinators to meter chlorine gas through the system.  At each injector, the chlorine mixes and dissolves into the water to form a diluted chlorine solution.  These facilities are equipped with automatic switch over so that when a chlorine tank is emptied the standby tank vacuum valve will respond and continue chlorine feed to the system.  In this diluted state, the chlorine is no longer considered acutely hazardous.  The chlorine solution is piped out of the chlorine equipment room into the plant where it is used in the treatment process to provide a residual chlorine concentration in the treated water flow stream. \n\nOff-Site Consequence Analysis\nIn order to determine the safety issues surrounding the use of chlorine at the Eastside Water Treatment Plant an off-site consequence analysis (OCA) was performed for the facility.  The purpose of the OCA is to model both a worst-case and alternative release scenario that could occur at the facility and then determine the effects that these releases would have on the surrounding population and environme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13890,
      "SummaryText": "nt.\nThe release scenarios for the Eastside Water Treatment Plant were based on the OCA models provided in the AWWA Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  The covered chlorination process at the Eastside Water Treatment Plant was analyzed for chemical inventory and facility layout in order to determine which Guidance model would best represent the potential release scenarios at the facility.  In order to be conservative, no active or passive mitigation measures were considered in the analysis of the release scenarios.  The distances to toxic endpoint provided in the Guidance are based on the ALOHA Modeling System.  According to the EPA Federal Register 40CFR, the toxic endpoint for chlorine is considered to be 0.0087 mg/L.\n7 Worst-Case Release Scenario:  For the Eastside Water Treatment Plant, the worst-case scenario was considered to be the catastrophic failure of one 1-ton chlorine container as a result of faulty construction, impact, or corrosion.  The result of the failure is that the entire content of the container, 2000 pounds of chlorine, are emptied into the atmosphere over a period of ten minutes.  Due to the location of the facility in a populated area, the released chlorine gas would reach nearby off-site public receptors.\n7 Alternative Release Scenario:  For the Eastside Water Treatment Plant, the alternative release scenario, which is considered to be more likely to occur than the worst-case scenario, was considered to be the failure of a 1-inch schedule 80 pipe that connects two 1-ton chlorine containers.  The result of the failure is that a portion of the gas content in each container empties through the 1-inch pipe.  Therefore, 634 pounds of chlorine are emptied into the atmosphere over a period of 27.1 minutes.  Due to the location of the facility in a populated area, the released chlorine gas would reach nearby off-site public receptors.\n\nPrevention Program\nIn order to reduce the risks associated with the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 13890,
      "SummaryText": "use of regulated chemicals, such as chlorine, at the Eastside Water Treatment Plant; AVEK has implemented a comprehensive prevention program for the facility.  The goal of AVEK's prevention program is to reduce the risk of accidental chemical releases that could have detrimental effects on the public and the environment.  AVEK is committed to implementing a prevention program that emphasizes both managerial and technical steps to reduce the risk of a chemical release.  The prevention program revolves around the following areas of prevention:\n7 Process Safety Information:  AVEK facilities maintain on-site and readily available up-to-date process safety information for all covered processes.\n7 Process Hazard Analysis:  AVEK conducts routine PHAs to identify, evaluate, and control the risks associated with all processes or chemicals that are subject to OSHA PSM and or EPA RMP regulations.\n7 Operating Procedures:  Written up-to-date operating procedures are maintained on-site for all covered processes.\n7 Training:  AVEK facilities routinely train all personnel working on OSHA PSM and or EPA RMP regulated processes with regard to the inherent dangers associated with regulated chemicals, i.e., chlorine, and how to safely respond in the case of an accident.\n7 Contractor Safety:  AVEK will only employ contractors with exemplary health and safety programs to work on covered processes.\n7 Prestartup Safety Review:  Prestartup safety reviews are to be performed for all new or modified processes at all AVEK facilities.\n7 Mechanical Integrity:  All AVEK facilities perform mechanical integrity reviews in order to reduce the risk of a release due to equipment failure.\n7 Hot Work Permit:  All hot work (work that provides a source of ignition, e.g., welding or torch cutting) is subject to the obtainment of a hot work permit if the work is to be performed on or near a covered process.\n7 Management of Change:  All changes to covered processes at AVEK facilities must first be reviewed a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 13890,
      "SummaryText": "gainst the original specifications to ensure that the required changes will not affect the process function.\n7 Incident Investigation:  Any releases of regulated chemicals at AVEK facilities are subject to immediate investigation in order to determine the cause of the accident and to implement corrective measures to prevent future incidences.\nThe purpose of implementing the above prevention measures is to greatly reduce the chance that an accidental release of a chlorine will occur at any AVEK facility.  Furthermore, it is likely that if such a release were to occur at the Eastside Water Treatment Plant, the above measures would significantly reduce the off-site impacts to both the public and the environment.\n\nFive-Year Accident History\nThe Eastside Water Treatment Plant has not had an accidental release of chlorine within the past five years.  \n\nEmergency Response Program\nAVEK facilities rely upon written Emergency Action Plans (EAPs) in order to respond in the case of an accidental release of an OSHA PSM and or EPA RMP regulated chemical.  The combination of thorough written response guides, training, and drills, greatly reduce the possible impacts of an accidental release.  The emergency planning and response plan for the Eastside Water Treatment Plant revolves around the following tasks:\n7 Updating EAPs:  EAPs are annually reviewed to provide up-to-date information that is facility specific and complies with the EPA RMP and OSHA PSM regulations.\n7 Emergency Response Training:  All on-site personnel will receive awareness-level training regarding the covered processes in use at the Eastside Water Treatment Plant.  Those personnel that are part of the emergency response team will receive task specific responder-level training pertaining to their assigned duties during an emergency.\n7 Coordination with Local Responders:  The Operations Manager will coordinate the distribution of the EAPs to local responder organizations.  Furthermore, the Operations Manager will co"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 13890,
      "SummaryText": "ordinate annual meetings or drills with the local organizations in order to promote prepared responses in the event of an incident.\n7 Maintaining EAPs:  The Eastside Water Treatment Plant EAPs will be subject to updates in the event of any changes to the following:  facility processes, response procedures, emergency PPE and equipment, training topics, changes in facility layout or personnel, or whenever otherwise required. \n7 Recordkeeping:  All facility personnel shall have routine access to EAPs that will be maintained in the control room at the Eastside Water Treatment Plant.   Furthermore, the Operations Manager shall maintain training completion and proficiency records for all facility personnel.\n\nPlanned Safety Improvements\nThe training program for employees working on covered processes at the Eastside Water Treatment Plant will continue to develop and incorporate improvements from the RMProgram."
    }
  ]
}