{
  "FacilityID": 13943,
  "FacilityName": "Wenatchee Regional Water Supply System",
  "FacilityStr1": "5100 Sunset Highway",
  "FacilityStr2": null,
  "FacilityCity": "East Wenatchee",
  "FacilityState": "WA",
  "FacilityZipCode": "98802",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53017",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "47.532528",
  "FacilityLongDecDegs": "-120.288778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Wenatchee",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Wenatchee",
  "OperatorStr1": "PO Box 519",
  "OperatorStr2": null,
  "OperatorCity": "Wenatchee",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98807",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dan Curry",
  "RMPTitle": "Water Resource Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147316",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-08 00:00:00",
  "DeRegistrationEffectiveDate": "2005-05-04 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 47.53253,
  "FRS_Long": -120.28878,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19055,
      "AltID": null,
      "FacilityID": 13943,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19544,
          "ProcessID": 19055,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24015,
          "ProcessID": 19055,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524015,
          "ProcessID": 19055,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 13943,
      "SummaryText": "A. Accidental Release Prevention and Emergency Response Policies\n\nWenatchee regional water supply system facility's (herein after referred to as Regional Water) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  It is the policy of the City of Wenatchee to adhere to all applicable federal and state safety and environmental regulations.\n\nAt Regional Water chlorine is used on-site. Chlorine is considered hazardous by EPA and is listed on the Extremely Hazardous Substance (EHS) list.  Chemical properties of chlorine make it necessary to observe certain safety precautions in handling Chlorine in order to:\n7 Prevent unnecessary human exposure\n7 Reduce the threat to our personnel\n7 Reduce the threat to the community\n\nRegional Water's emergency response policy involves the preparation of response plans and training of employees. Regional Water has trained its personnel in the safe handling of chlorine.  Employees have been trained in the use of personal protective equipment and chlorine \"patch\" kits.\n\nB. Facility and Regulated Substance Handled\n\nRegional Water is a water pumping plant, located north of the city of East Wenatchee, county of Douglas, state of Washington.  Regional Water is located next to the Columbia River.  The area around the plant is open with overnight camping to the north of the facility.\n\nThe regulated substance used at Regional Water is chlorine (CAS# 7782-50-5). The chlorine is used for the sanitizing of drinking water for the city of Wenatchee and surrounding area.\n\nFour thousand pounds (two 1-ton cylinders) of chlorine is the maximum used in the process.\n\nRegional Water uses other hazardous substances on-site, however they are not listed in 40 CFR 68.130.  However, the city of Wenatchee believes in the concept set forth in the \"General Duty Clause\" of the Clean Air Act.  To this effect, Regional Water has established policies, procedures and training to reduce the r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 13943,
      "SummaryText": "isk of an accidental hazardous substance release for the safety of its employees and surrounding areas.\n\n C. Worst-Case and Alternative Scenarios\n\nThe off-site consequence analysis considers two chlorine release scenarios identified as \"worst case\" and \"alternative\" scenarios.  The worst case scenario is defined by the Environmental Protection Agency (EPA), which states that \"the owner or operator shall assume that the maximum quantity in the largest vessel is released \".  The alternative scenario is defined as \"more likely to occur than the worst case scenario\".\n\nWorst-Case Scenario - Failure of the largest vessel would release 2,000 pounds of chlorine.  The release would occur inside the chlorine room; its walls are in direct contact with the outside. \n\nThe distance to the toxic end-point of 0.0087 (3 ppm) mg/L is 3 miles.  The \"risk radius\" extends past the boundaries of the plant, into public and environmental receptors. Distance was determined by use of RMP-COMP.  Although the container is inside a building, enclosure mitigation was not used.\n\nAlternative Release Scenario - The alternative scenario chosen was that of a release of a full container from a break in the 0.5\" in diameter \"vacuum regulator\".  The distance to the toxic end-point of 0.0087 mg/L is 1200 yards.  This release was based on the chlorine container being full at the time of release and was modeled by use of ALHOA  version 5.2.1, using the heavy tank model.  Although the container is inside a building, no mitigation was used.\n\nD. General Accidental Release Prevention Program\n\nRegional Water's accidental release prevention program is based on the following key elements:\n7 Training of personnel\n7 Preventative maintenance program\n7 Use of safety equipment\n7 Use of accurate and effective written operating procedures\n\nRegional Water complies with:\n7 OSHA's and Washington State's process safety management\n7 Applicable Washington State's safety and environmental regulations\n7 The Chlorine Institute"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 13943,
      "SummaryText": " Manual for safe handling of chlorine\n7 The Uniform Fire Code.\n\n The chlorinating system was installed to standards and local codes at the time of installation.  Other safety systems Regional Water utilizes include:\n7 Chlorine detection alarm that triggers an alarm and light indicator on the control panel in the control room.  After hours this alarm triggers an auto-dialer which contacts the on-call operator.\n7 Appropriate overhead crane for handling the ton containers.\n7 Emergency exhaust fan and recirculating fan.\n7 Proper fitting and closing doors.\n\nOperating Procedures and checklists have been prepared by Regional Water to be used by employees performing operational functions. Procedures are kept in the control room.  These procedures include: \n7 Pre-start up procedures\n7 Routine operations\n7 Maintenance\n7 Response to major and minor releases\n7 Emergency action plan\n\nE. Five-Year Accident History\n\nRegional Water has not had any accidents involving chlorine in the last five years.\n\nF. Emergency Response Program\n\nIn addition to the operating procedures, Regional Water has established Emergency Response Guidelines for releases involving chlorine.  These procedures are part of the ongoing training of personnel and include:\n7 Response to a chlorine release\n7 Warning and notification to public safety and the public.\n\nG. Planned Changes to Improve Safety\n\nThere are currently no planned changes.\n\nRegional Water will continue to ensure ongoing training of personnel."
    }
  ]
}