{
  "FacilityID": 14012,
  "FacilityName": "Morton International  -  West Alexandria Facility",
  "FacilityStr1": "10 South Electric Street",
  "FacilityStr2": null,
  "FacilityCity": "West Alexandria",
  "FacilityState": "OH",
  "FacilityZipCode": "45381",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39135",
  "LEPC": "Preble County LEPC",
  "FacilityLatDecDegs": "39.745556",
  "FacilityLongDecDegs": "-84.525278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45566098,
  "ParentCompanyName": "Morton International Inc.",
  "Company2Name": null,
  "CompanyDUNS": 36461556,
  "Company2DUNS": 0,
  "OperatorName": "John Bielas",
  "OperatorStr1": "10 South Electric Street",
  "OperatorStr2": null,
  "OperatorCity": "West Alexandria",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45381",
  "OperatorZipCodeExt": null,
  "FTE": 82,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147664",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0868090072 T006",
  "SafetyInspectionDate": "1998-02-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-01 00:00:00",
  "DeRegistrationEffectiveDate": "2004-04-01 00:00:00",
  "AnniversaryDate": "2004-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.74316,
  "FRS_Long": -84.5261,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19137,
      "AltID": "Bromination",
      "FacilityID": 14012,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 24120,
          "ProcessID": 19137,
          "ChemicalID": 60,
          "Quantity": 21100.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19626,
          "ProcessID": 19137,
          "NAICSCode": "32552",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10198,
              "Process_NAICS_ID": 19626,
              "SafetyReviewDate": "1999-05-20 00:00:00",
              "PHA_Date": "1999-05-20 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-11-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Equipment Upgrade",
              "OpProceduresReviewDate": "1999-05-29 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-06-01 00:00:00",
              "EquipmentInspectionDate": "1998-04-14 00:00:00",
              "EquipmentTested": "R-142 system",
              "ChangeMgmtDate": "1999-04-05 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-01 00:00:00",
              "PreStartupReviewDate": "1999-04-26 00:00:00",
              "ComplianceAuditDate": "1998-06-20 00:00:00",
              "AuditCompletionDate": "2000-06-01 00:00:00",
              "IncidentInvestigationDate": "1999-05-26 00:00:00",
              "InvestigationChangeDate": "1999-05-26 00:00:00",
              "ParticipationPlansReviewDate": "1998-06-20 00:00:00",
              "HotWorkPermitReviewDate": "1997-05-15 00:00:00",
              "ContractorSafetyReviewDate": "1995-04-06 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The process involoving Bromine is covered by one PHA.",
              "_chemicals": [
                {
                  "PrimaryKey": 14356,
                  "PreventionProgram3ID": 10198,
                  "ProcessChemicalID": 24120
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14012,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-10-31 00:00:00",
    "ERTrainingDate": "1998-10-31 00:00:00",
    "CoordinatingAgencyName": "West Alexabdria Fire Department",
    "CoordinatingAgencyPhone": "9378394668",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14012,
      "SummaryText": "Accidental Release Prevention Program and Emergency Response Policy\n\nIt is the Policy of the Morton International, Inc. (Morton) West Alexandria, Ohio facility managment to implement the requiremnts of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Managment  (PSM) program.  The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to Morton employees, the public and the environment.  This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.  Morton's management is committed to providing the resourses necessary to implement this policy.\n\n                    \nFacility Description\n\nMorton International, Inc. is located in West Alexandria, Ohio and operates primarily as a manufacturer of adhesives and specialty polymers.  One chemical, Bromine is utilized at the facility in sufficient quantites to be subject to the requirements of 40 CFR Part 68, RMP.\n\n\nConsequence Analysis\n\nThe Accidental Release Prevention Program requires facilities to evaluate the impact of a release of the regulated chemicals under well-defined conditions.  Two types of releases must be considered; first, a \"worst case\" must be examined and secondly, a release that is more likely to occur.  These incidents are known as the worst case and alternative release scenarios.\n\nThe regulations require that the worst case condider the effects of the rupture of a vessel (or pipe) that contains the maximum amount of the chemical that is being examined. The chemical is then presumed to evaporate (if released as a liquid) and dissipate as it moves away from the release site. The regulation defines the conditions under which the evaporated material dissip"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14012,
      "SummaryText": "ates.  Conservative assumptions are made regarding the temperature, wind speed and the tendency for \"mixing\" to occur in the atmosphere.  The assumptions used are such that the predicted concentration of the chemical probably represents an over-estimate of what would actually occur.\n\nThe worst case consequence analysis that was preformed for a bromine release indicated that there is a potential for concentrations to exceed the endpoints defined by the regulations in the event of an incident.\n\nThe alternative release scenario is one that is considered to be more likely to occur.  The alternative release scenarios provided within this RMP have been developed from a \"what if\" anaylsis conducted as part of the HAZOP process.  The qualitative scale of the risk associated with the event happening is based on matrix of likelihood and severity.  Also weighed into the consideration of an event in this alternative case analysis (in addition to the risk rating) was the estimated amount of bromine potentially released or the rate of release and duration.  The RMP regulations provide for the use of assumptions influencing dispersion that are more likely to occur during an alternative release scenario.\n\nThe alternative release scenarios that were developed for bromine indicated that the Impact zone would be significantly reduced by comparison to that predicted for the worst case release scenario.  Given that the alternative release scenarios represent events more likely to occur, the reduced ipact area is one measure of the effectiveness of Morton's prevention program and mechanisms used to mitigate the results of an incident.  Further, it should be noted that the likelihood of any of these scenarios occurring is very small - again demonstrating the ability of Morton to handle chemicals in a safe manner.\n\n\nFive Year Accident History\n\nMorton has not had any release of bromine from the West Alexandria, Ohio facility that has affected the public or the environment.\n\n\nEmergency Respo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14012,
      "SummaryText": "nse Program\n\nMorton has personnel trained in emergency response while the facility is in operation and on-call at other times.  These personnel receive annual training on emergency procedures and response techniques. The facility also maintains a comprehensive emergency response plan which is reviewed, maintained and updated on a routine basis.\n\nIn conjunction with the Local Emergency Response agencies the facility participated in a TableTop Exercise which considered a simulated release of bromine from the Morton facility as the basis for the exercise.\n\n\nPlanned Changes to Improve Safety\n\nMorton completes a thorough review of the potential impact of all chemicals that are considered for use at the facility.  This includes compounds that are not specifically addressed under the RMP regulation.  Further Morton conducts reviews on a routine basis to ensure that each process that empolys hazardous chemicals is thoroughly examined.\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe West Alexandria facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\n\n                              40 CFR Part 68, Accidental Release Prevention\n\n                              40 CFR Part 112, Spill Prevention, Control and Countermeasure\n\n                              40 CFR Part 264, Hazardous Waste Contingency Plan\n\n                              29 CFR Part 119, Process Safety Management\n\nThe key concepts in Morton's release prevention program are employee participation, appropriate design and maintenance of equipment, appropriate training of all emloyees, and ongoing communication and training with local responder.\n\nEmployee participation in the release prevention program"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14012,
      "SummaryText": " is encouraged and supported by Morton management.  Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the processes associated with bromine.  Morton employees are also members of the facility emergency response team.\n\nMorton follows current building and safety codes to construct all new equipment, systems, and facilities.  This ensures the appropriate safety and release prevention systems areincluded from the beginning of each project.  Morton maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.\n\nMorton is committed to providing appropriate training to all employees regarding asfety procedures.  Each new employee is provided comprehensive safety training during his or her initial orientation for the facility.  In addition, Morton conducts regularly scheduled safety training for all employees each year.  Additional training is provided to maintenance personnel for the systems they are responsile for.  Member of Morton's emergency response team receive quarterly training to ensure that response actions are promptly and safely completed.  Annual training with local responders is a part of this program."
    }
  ]
}