{
  "FacilityID": 14023,
  "FacilityName": "Gerber's Poultry, Inc.",
  "FacilityStr1": "5889 Kidron Road",
  "FacilityStr2": "P.O. Box 206",
  "FacilityCity": "Kidron",
  "FacilityState": "OH",
  "FacilityZipCode": "44636",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39169",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "40.728056",
  "FacilityLongDecDegs": "-81.746083",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4211041,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Michael Gerber",
  "OperatorStr1": "P.O. Box 206",
  "OperatorStr2": null,
  "OperatorCity": "Kidron",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44636",
  "OperatorZipCodeExt": null,
  "FTE": 215,
  "OtherEPAFacilityID": "000002099900",
  "EPAFacilityID": "100000147959",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.72749,
  "FRS_Long": -81.74497,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19174,
      "AltID": "Refrigeration System",
      "FacilityID": 14023,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24164,
          "ProcessID": 19174,
          "ChemicalID": 56,
          "Quantity": 14100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 19663,
          "ProcessID": 19174,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10232,
              "Process_NAICS_ID": 19663,
              "SafetyReviewDate": "1997-05-01 00:00:00",
              "PHA_Date": "2001-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Shutdown System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-09-01 00:00:00",
              "TrainingReviewDate": "1999-03-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-09-01 00:00:00",
              "EquipmentInspectionDate": "1999-02-17 00:00:00",
              "EquipmentTested": "HSC-2 Compressor and Swing Compressor",
              "ChangeMgmtDate": "1998-01-29 00:00:00",
              "ChangeMgmtReviewDate": "1997-09-01 00:00:00",
              "PreStartupReviewDate": "1997-05-01 00:00:00",
              "ComplianceAuditDate": "1997-05-01 00:00:00",
              "AuditCompletionDate": "2001-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-08 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": "1997-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1997-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14396,
                  "PreventionProgram3ID": 10232,
                  "ProcessChemicalID": 24164
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14023,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1999-05-04 00:00:00",
    "CoordinatingAgencyName": "Wayne County LEPC",
    "CoordinatingAgencyPhone": "3302629817",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14023,
      "SummaryText": "Risk Management Plan\nGerber's Poultry, Inc.\n5889 Kidron Road\nKidron, Ohio 44636\n\nHistory\n\nGerber's Poultry, Inc. (Gerber's), Kidron, Ohio is located in the heart of the largest Amish Community in the world, and has been a family-owned business since it was founded in 1952, by Dwight and Melva Gerber.  In the early years, Dwight and Melva Gerber raised and processed seventy-five chickens a week in the basement of their home and sold the dressed broilers with eggs and vegetables on a home delivery route in the Akron, Ohio area.  Demand for the product increased and eventually Dwight had to buy live poultry from other sources.  He subsequently processed these live birds and sold them to his growing customer base, which included local grocery stores and restaurants.  Gerber's became an incorporated entity in 1972 as it was on its way to becoming a fully integrated broiler producer.\n\nBaby chicks are acquired from the Orrville Chick Hatchery (OCH), an affiliated company of Gerber's since December of 1991.  An excellent management program at OCH has produced a healthier, stronger chick, which grows faster and larger, resulting in a high quality chicken for Gerber's.\n\nDuring early 1979, Gerber's made a decision to develop its own Grow-Out division, the Hingle Company (Hingle).  The Hingle division began contracting farmers, the majority of whom are of the Amish faith, to grow chickens for the Company.  The farmers would supply the buildings, equipment and utilities while Hingle supplied the chicks and feed.  This program has worked with great success.  Gerber's operation boasts that it has the BEST GROUP OF GROWERS IN THE INDUSTRY TODAY.\n\nGerber's has its own delivery fleet, which allows Gerber's to respond to customer needs and deliver fresh poultry daily.\n\nThrough vertical integration, Gerber's maintains tight control over the quality of its' product.  That control included hatching chicks, growing, processing and delivering ready-to-cook chicken to customers.  Curren"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14023,
      "SummaryText": "tly, Gerber's processes approximately 160,000 chickens per week.\n\nIntroduction\n\nIn 1994, as a result of company growth, Gerber's increased their refrigeration capabilities.  Due to regulations on the use of Freon for refrigeration purposes, a new state of the art two-stage ammonia refrigeration system was installed for all freezing, ice making and cooling applications.\n\nAmmonia has many qualities that make it an excellent refrigerant.  Ammonia is self-alarming (distinct odor), very energy efficient, biodegradable and low in cost.  Compared to ammonia, halocarbon (chloroflourocarbons or CFCs) refrigerants are essentially odorless (not self-alarming), harmful to the environment and responsible for many injuries involving refrigerants.\n\nAmmonia, like many other substances, can displace oxygen if released in sufficient quantities into a poorly ventilated area.  Ammonia itself is not a cumulative poison.  It is difficult to ignite and has a limited explosive potential.  It is also non-polluting when released to the atmosphere because it consists of natural elements and therefore completely biodegrades.\n\nThe long and successful use of ammonia in industrial closed circuit cold systems proves its hazards are not abnormal.  The codes governing refrigerating plant installations, modern methods of testing and development by reputable manufactures of ammonia equipment have made anhydrous ammonia as dependable and safe to use as steam or electricity.\n\nPurpose\n\nThe intent of section 112(r) is to prevent accidental releases to the air and mitigate the consequences of such releases by focusing prevention measures on chemicals that pose the greatest risk to the public and the environment.  Under these requirements, industry has an obligation to prevent accidents and operate safely.\n\nTo meet the requirements of section 112(r), facilities must summarize required information within a document called a Risk Management Plan (RMP).  Facilities must submit RMPs to the EPA by June 21, 1999."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14023,
      "SummaryText": "Gerber's is subject to section 112(r) as a result of the anhydrous ammonia refrigeration system and the quantity of anhydrous ammonia on hand.  Anhydrous ammonia is considered by the EPA to be a regulated substance that poses a risk to the public and the environment. \n\nDetermination\n\nA facility with more than the threshold quantity of any listed regulated substance must complete an RMP.  On January 31, 1994, the U.S. EPA promulgated the final list rule, which established quantity thresholds for 77 acutely toxic substances and 63 flammable gases and volatile liquids.\n\nThe quantity threshold for anhydrous ammonia is 10,000 pounds.  Gerber's refrigeration system contains 14,091 lbs of anhydrous ammonia.  The refrigeration system exceeds the quantity threshold for anhydrous ammonia, therefore Gerber's must submit an RMP.\n\nRMP Requirements \n\nIf a facility exceeds the threshold quantity of any listed regulated substance the following RMP requirements must be met.\n\n7 An offsite consequence analysis that evaluates potential release scenarios \n7 A five-year history of accidental releases of regulated substances \n7 A prevention program to manage risk \n7 An emergency response program \n7 An overall management system to supervise the implementation \n7 A RMP that summaries these activities \n\nProgram Criteria\n\nProcesses subject to the 112(r) requirements are further divided into three tiers, labeled Programs 1, 2, and 3.  Eligibility for any given Program is based on process criteria so that classification of one process in a Program does not influence the classification of other processes at the facility.  Steps necessary to comply with the rule will vary from program to program.\n\nProgram Eligibility Criteria\n\nProgram 1 is available to any process that has not had an accidental release with offsite consequences in the five years prior to the submission date of the RMP and has no public receptors within the distance to a specified toxic or flammable endpoint associated with a wo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14023,
      "SummaryText": "rst case release scenario.  Program 3 applies to processes in Standard Industrial Classification (SIC) codes 2611 (pulp mills), 2812 (chlor-alkali), 2819 (industrial inorganics), 2821 (plastics and resins), 2865 (cyclic crudes), 2869 (industrial organics), 2873 (nitrogen fertilizers), 2879 (agricultural chemicals), and 2911 (petroleum refineries).  Program 3 also applies to all processes subject to the OSHA Process Safety Management (PSM) standard (29 CFR 1910,119), unless the process is eligible for Program 1.  Owners or operators will need to determine whether Program 3 applies.  All other covered processes must satisfy Program 2 requirements. \n\nHazard Assessment\n\nFor all substances, the worst case release scenario will be defined as the release of the largest quantity of a regulated substances from a vessel or process line failure, considering administrative controls and passive mitigation that limit the total quantity involved or the release rate.  One worst case release scenario will be defined to represent all toxics, and one worst case release scenario will be defined to represent all flammables held above the threshold at the source.  Additional worst case scenario(s) must be analyzed and reported if such a release from another covered process at the source potentially affects public receptors that would not be potentially affected by the first scenario.\n\nFor alternative scenarios, sources may consider the effects of both passive and active mitigation systems.  One scenario is required for each toxic substance and one to represent all flammable substances held in covered processes at the source.  The five-year accident history will cover all accidents involving regulated substances, but only from covered processes at the source that resulted in serious on site or certain known offsite impacts in the five years prior to the submission of each RMP.\n\nBoth a worst case scenario and an alternative scenario for anhydrous ammonia were completed to give Gerber's an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14023,
      "SummaryText": "understanding of what possible offsite consequences and risks exist to the surrounding public and environment.  Once the modeling was completed for these two scenarios, Gerber's determined whether or not current passive and active mitigation would be sufficient.  Gerber's then explored other means of passive and active mitigation and decided if other or additional steps were feasible, necessary, and/or productive. \n\nManagement Program\n\nThe management system is to oversee implementation of risk management program elements.  This means designating a qualified person or position with the overall responsibility for the development, implementation and integration of the risk management program elements.  There should be documentation of names of people or positions along with defined lines of authority through an organizational chart or other similar document.  \n \nPrevention Programs\n\nThe United States Environmental Protection Agency (U.S. EPA) has developed seven specific elements for the Program 2 prevention program: safety information, hazard review, operating procedures, training, maintenance, compliance audits, and incident investigation.  It is expected that many Program 2 processes will already be compliant with most of the requirements as a result of other Federal regulations, state laws, industry standards and codes, and good engineering practices.\n\nThe Program 3 prevention program includes the requirements of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard, 29 CFR 1920.119(c) through (m) and (0), with minor wording changes to address statutory differences.  This makes it clear that one accident prevention program to protect workers, the general public, and the environment will satisfy both OSHA and U.S. EPA.  It is anticipated that sources whose processes are already in compliance with OSHA PSM will not need to take any additional steps or create any new documentation to comply with the Program 3 prevention prog"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14023,
      "SummaryText": "ram requirements.\n\nEmergency Response\n\nThe U.S. EPA has adopted the emergency response requirements found in the statute, with additional specific planning requirements beyond those necessary to implement the statute.  The final rule also provides relief for sources that are too small to respond to releases with their own employees; these sources will not be required to develop emergency response plans provided that procedures for notifying non-employee emergency responders have been adopted and that appropriate responses to their hazards have been addressed in the community emergency response plan developed under EPCRA for toxics or coordinated with the local fire department for flammables.\n\nRisk Management Plan\n\nOwners/operators must submit their first RMP by June 21, 1999.  After submittal, changes at the facility may require updates to the RMP other than the standard update of every five years.  It is intended that the RMP will be submitted electronically.  In this way, states, local entities and the public will be able to access RMPs electronically.  The RMP will consist of the source's registration; an executive summary that will provide a brief description of the sources activities as they relate to covered processes and program elements; and data elements that address compliance with each of the rule elements.\n\nWorst Case Scenario\n\nThe worst case scenario was modeled to determine what is most likely to happen in the event of a release.  This type of release is not likely to happen, but the results of such a worst case scenario inform Gerber's of the worst possible consequences.  The worst case scenario is defined as a 10-minute release of the largest quantity (lbs) of anhydrous ammonia, liquefied under pressure, from a vessel or pipeline, considering administrative controls and passive mitigation that will limit the total quantity and/or the release rate.  The modeling uses a windspeed of 1.5 meters per second and an F stability class, which are both constan"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14023,
      "SummaryText": "ts for the worst case scenario.\n\nGerber's, with the help of Sutton & Associates, Inc. (Refrigeration Engineer), determined the vessel or pipeline that would contain the largest amount of anhydrous ammonia, considering administrative and engineering controls is the Vilter High Stage Recirculator (HSR).  Gerber's HSR measures 11 feet in length and 5 feet in diameter.  Administrative and engineering controls and limitations restrict the normal operating range of the HSR to between 20% and 25% of the total tank volume.  Therefore, the maximum capacity of the HSR, with a normal operating volume of 25%, is 53.995 cubic feet.  The HSR has an average operating pressure of 25 psi and an average operating temperature of 12: F.  At that pressure and temperature, anhydrous ammonia weighs 41.43 lbs/cubic foot.  Using this information, it was determined the maximum amount of anhydrous ammonia present in the HSR, under normal operating conditions, is 2,237.01 lbs.\n\nThe HSR normally operates at 12:  F = 41.43 lbs/ft3 of anhydrous ammonia (NH3)\n\nVolume = 3.14(r)2 x length\n\nVolume = 3.14(2.5 ft)2 x 11 ft             = 215.98 ft3\n                                                                                                                                                                     25% of 215.98 ft3                          = 53.995 ft3\n\n100% Capacity\n215.98 ft3 x 41.43 lbs of NH3/ft3   = 8,948.05 lbs of NH3 \n\n25% Capacity\n53.995 ft3 x 41.43 lbs of NH3/ft3   = 2,237.01 lbs of NH3 \n\nThe HSR is an enclosure referred to by Gerber's as the engine room.  An enclosure is a form of passive mitigation.  Passive mitigation means equipment, devices, or technologies that function without human, mechanical, or other energy input to minimize exposure of the public or the environment.\n\nAll tank specifications, pressures, temperatures and weights utilized in the calculations were obtained from Sutton & Associates, Inc.\n\nRMP*Comp is an air dispersion modeling program, provided by the EPA, t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 14023,
      "SummaryText": "o determine the distance to the toxic endpoint.  RMP*Comp calculates the distance to the toxic endpoint for the worst case scenario utilizing the preceding information.  RMP*Comp considers passive mitigation when determining the toxic endpoint of the worst case scenario.  RMP*Comp software uses 200 ppm or 0.14 mg/l as the toxic endpoint for anhydrous ammonia.  RMP*Comp calculated the toxic endpoint to be 0.6 miles downwind of the facility for the worst case scenario.\n\nTo determine possible public and environmental receptors for the worst case scenario; Gerber's used Marplot and Landview III.  Marplot is a software program that allows users to search and display roadways, street addresses, waterways, railroads, census blocks, other political boundaries, facilities, chemical information, evacuation zones, special populations, and hazards analysis vulnerability zones.   Landview III is a software program that displays EPA-regulated sites and demographic and economic data from the 1990 Census.  Marplot allowed Gerber's to pinpoint their facility, using latitude and longitude, and create a circle with a 0.6-mile radius around the facility.  Landview III uses predetermined demographic data to determine what and how many public and environmental receptors lie within the toxic endpoint.  The demographic data calculated that the worst case scenario would affect 151 persons (public receptors) and no environmental receptors.  An U.S. Geological Survey map of Kidron, Ohio also confirmed that there were no environmental receptors within the toxic endpoint of the worst case scenario.  The following school and companies fall within the toxic endpoint:\n\nSchools:      Oak Grove Elementary School\nCompanies: K. E. Building               Kidron Electric\n                   Miller Homes                Kidron Floor and Paint\n                   Gerber's Wood            Ohio Mennonite Federal Credit Union\n                   Joyce's Hair Design     MMA Eastern Ohio Office\n\nNote:  Methodology"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 14023,
      "SummaryText": "utilized to obtain the worst case scenario was referenced from the Model Risk Management Program and Plan for Ammonia Refrigeration issued by the EPA.\n\nAlternative Scenario\n\nThe alternative scenario was completed to determine what is more likely to occur in the event of a release.  The alternative scenario represents 1,000 lbs of anhydrous ammonia released, at a rate of 100 lbs/minute for 10 minutes, from a one-quarter inch orifice.  A one-quarter inch orifice is utilized because it represents a number of different types of incipient leaks; e.g. leaky or failing valve (any type), seal, flange, joint, weld, or a ruptured disk.\n\nCalculations:\n\n< inch orifice leads to 1,000 lbs of anhydrous ammonia release over 10 minutes\n\n1,000 lbs of NH3 / 10 minutes = 100 lbs of NH3/minute\n\nThe alternative scenario represents a release occurring within some part of the facility, e.g. enclosure.  An enclosure is a form of passive mitigation.  Passive mitigation means equipment, devices, or technologies that function without human, mechanical, or other energy input to minimize exposure of the public or the environment.\n\nRMP*Comp is an air dispersion modeling program, provided by the EPA, to determine the distance to the toxic endpoint.  RMP*Comp calculates the distance to the toxic endpoint for the alternative scenario utilizing the preceding information.  RMP*Comp considers passive mitigation when determining the toxic endpoint of the alternative scenario.  RMP*Comp software uses 200 ppm or 0.14 mg/l as the toxic endpoint for anhydrous ammonia.  RMP*Comp calculated the toxic endpoint to be 0.2 miles downwind of the facility for the alternative scenario.\n\nTo determine possible public and environmental receptors for the alternative scenario, Gerber's used Marplot and Landview III.  Marplot allowed Gerber's to pinpoint their facility, using latitude and longitude, and create a circle with a 0.2-mile radius around the facility.  Landview III uses predetermined demographic data to determ"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 14023,
      "SummaryText": "ine what and how many public and environmental receptors lie within the toxic endpoint.  The demographic data calculated that the alternative scenario would affect 17 persons (public receptors) and no environmental receptors.  An U.S. Geological Survey map of Kidron, Ohio also confirmed that there were no environmental receptors within the toxic endpoint of the worst case scenario.  The following companies fall within the toxic endpoint:\n\nCompanies:  Gerber's Wood     Joyce's Hair Design\n\nGerber's maintains the distance to the toxic endpoint for the alternative scenario would be reduced, based on the fact that no active mitigation took place in the scenario.  Active mitigation is defined as equipment, devices, or technologies that need human, mechanical, or other energy input to minimize exposure of the public or the environment.\n\nNote:  Methodology utilized to obtain the alternative scenario was referenced from the Model Risk Management Program and Plan for Ammonia Refrigeration issued by the EPA.\n    \nGeneral Accidental Release Prevention\n\nGerber's is committed to providing a safe workplace for its' employees.  Gerber's is also dedicated to contributing to a safe community and environment.  This commitment is shown through their prevention programs and specifically the Risk Management Plan (RMP).  The goal of this RMP is to prevent any incidents that may result in injury to people, damage to the environment, damage to the product, damage to the refrigeration system, and/or loss of production time.\n\nGerber's believes the ammonia refrigeration system is a safe operation as long as the proper precautions are taken.  To ensure these precautions are taken, Gerber's requires operators have a thorough understanding of how the ammonia refrigeration system works in order to operate it safely.  Operators are required to know the function and relationship each component has within the ammonia refrigeration system.\n\nGerber's has constructed a thorough training program that te"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 14023,
      "SummaryText": "aches each operator the precautions, hazards, and standard operating procedures associated with the anhydrous ammonia system.  This training program consists of on the job training, as well an Ammonia Refrigeration Training and Troubleshooting Workshop.  Gerber's Process Safety Management document details how often training will be conducted.\n\nGerber's has completed a Process Hazard Analysis on the ammonia refrigeration system to determine risks associated with the system.  In addition, specific remedies have been identified should accidents occur. \n  \nFive-Year Accident History\n\nGerber's has not had a reportable accident within the past five years.  A reportable accident is defined as an accidental release of ammonia that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nOn November 12, 1997, fire broke out in the poultry processing area.  However, there was never a threat of an anhydrous ammonia release because the refrigeration system and the fire were separated by a firewall.\n\nIn the unlikely event that this should occur, Gerber's would take all appropriate steps necessary to notify the proper authorities and document the accident. \n \nThe Emergency Response Program\n\nGerber's realizes no system is fail-proof and from time-to-time, despite the most comprehensive Process Safety Management plan and RMP, unwanted or unplanned releases may occur.  Piping may develop leaks, relief valves may fail, electrical failures may generate upset conditions, instrumentation may fail, etc.  Scenarios such as a destructive facility fire involving all or parts of the system or acts of nature such as tornadoes, hurricanes or earthquakes, while remote possibilities, could possibly create a partial or total release of anhydrous ammonia from the refrigeration system.  Gerber's recognizes the importance of accidental release prevention and emergency response"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 14023,
      "SummaryText": "policies.  Gerber's has developed an Emergency Action/Emergency Response Plan to assist in mitigation.\n\nThe Emergency Planning and Response Plan details how Gerber's will deal with such a situation if one should occur.  Routine drills and practices have been and will be conducted to prepare and evaluate response, organization, and effectiveness.\n\nPersonnel involved with the Emergency Action Plan and Emergency Response Plan are continually trained in accordance with all local, state, and Federal regulations.  Written documentation of all training for each employee will be kept on file.  Refresher training for each employee will be as stated in Gerber's Process Safety Management document, and shall focus on improving the skills of emergency response/action.\n  \nPlanned Changes to Improve Safety\n\nGerber's will continually strive to improve safety by utilizing new technology and providing innovative ways to train.  Gerber's plans on installing more ammonia detection systems in strategic areas of the facility to reduce the risk of anhydrous ammonia leaks traveling offsite.\n\n\nManagement System\n\nGerber's has created a Process Safety Management (PSM) committee to oversee the implementation of all PSM and RMP elements.  The PSM committee meets regularly to implement, improve and/or complete the necessary PSM and RMP requirements.\n\nThe PSM committee is responsible for:\n7 Facilitating Employee Participation\n7 Documentation\n7 Employee Inquiries\n7 Audit Compliance\n7 Annual Audit\n7 Incident Investigation\n7 Process Hazard Analysis"
    }
  ]
}