{
  "FacilityID": 14071,
  "FacilityName": "Bar-S Foods - Clinton, OK Facility",
  "FacilityStr1": "208 Court Street",
  "FacilityStr2": null,
  "FacilityCity": "Clinton",
  "FacilityState": "OK",
  "FacilityZipCode": "73601",
  "Facility4DigitZipExt": "0339",
  "FacilityCountyFIPS": "40039",
  "LEPC": null,
  "FacilityLatDecDegs": "35.511111",
  "FacilityLongDecDegs": "-98.9625",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bar-s.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Bar-S Foods Co.",
  "Company2Name": null,
  "CompanyDUNS": 48804504,
  "Company2DUNS": 0,
  "OperatorName": "Bar-S Foods Co.",
  "OperatorStr1": "208 Court Street",
  "OperatorStr2": null,
  "OperatorCity": "Clinton",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73601",
  "OperatorZipCodeExt": "0339",
  "RMPContact": "Danny Dupree",
  "RMPTitle": "Division Vice President",
  "FTE": 480,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000149092",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-18 00:00:00",
  "SafetyInspectionBy": "PIHS, Inc",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.51142,
  "FRS_Long": -98.96303,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19271,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 14071,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19763,
          "ProcessID": 19271,
          "NAICSCode": "311613",
          "_desc": {
            "NAICS_CODE": "311613",
            "NAICS_DESCRIPTION": "Rendering and Meat Byproduct Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24351,
          "ProcessID": 19271,
          "ChemicalID": 56,
          "Quantity": 34000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524351,
          "ProcessID": 19271,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14071,
      "SummaryText": "RMP Executive Summary\n\n1.0  Accidental release prevention and emergency response policies at Bar-S Foods Co. - Clinton, OK ('68.155(a) ).\n\nBar-S Foods Co.  prevents accidental releases through training of refrigeration / maintenance personnel, ongoing inspection and maintenance of the refrigeration system, and following an established PSM program.  Refrigeration system components are located in areas that are not as likely to become damaged (i.e., tanks and pipe runs are placed away and protected from forklift and truck traffic).\n\n2.0  Source and regulated substances handled ('68.155(b)).\n\nApproximately 34,000 lbs. of anhydrous ammonia is contained within the refrigeration system on site at Bar-S Foods Clinton, OK.  The EPA requires a Risk Management Plan be developed and maintained when the total amount of anhydrous ammonia exceeds the threshold quantity of 10,000 lbs.  No other substances, in quantities subject to EPA RMP certification requirements, are located at the Bar-S Foods Clinton, OK facility.\n\n3.0  Worst Case and Alternate Case Release Scenarios ('68.155(c)).\n\n3.1  Worst Case Scenario (WCS)\n\nThe two (2) high pressure receivers, located outside the Engine Room, contain the largest quantity of anhydrous ammonia, on site, on a predictable worst case basis.  These vessels are cross-connected and typically maintained at less than 40% full.  However, during some shutdown operations, these vessels are used for pumping down the system.  During these operations, these tanks could be filled to approximately 88% capacity or 23,000 lbs. of anhydrous ammonia, under an internal pressure and temperature of approximately 114 psig and 70 0F.  The Worst Case Scenario as required by EPA, assumes that the tank's contents are fully released as a gas/vapor over a 10-minute period.\n\nThe EPA Ammonia Offsite Consequence Analysis (OCA) Endpoint Tables predicted, with a wind speed of 1.5 m/s and atmospheric stability class F, the anhydrous ammonia release may travel 1.9 miles from "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14071,
      "SummaryText": "the point of release (Urban Topography).  Approximately 1600 people, as determined by Landview Census data, in the surrounding community, reside within the radius to the toxic endpoint (level of concern = 200 ppm, anhydrous ammonia).  A number of schools, recreation areas, and a hospital fall within the radius to the toxic endpoint. There are no environmental receptors, as reportable by EPA RMP criteria, within the radius to the toxic endpoint. \n\n3.2  Alternate Case Scenario (ACS)\n\nThe Alternate Case, more likely, Release Scenario for Bar-S Foods Altus, OK facility was selected to involve a relief valve release on a condenser.  The relief valve discharges on top of the Engine Room roof.  Anhydrous ammonia (at approximately 250 psi and 113 0F) was estimated to have a flow rate from the relief valve (inner orifice diameter: 0.75 inches) of approximately 92 lbs./min., determined from an ammonia gas release table.  It is estimated that the relief valve could be isolated, or the overpressure condition corrected, in approximately 10 minutes by trained operators onsite, with a corresponding anhydrous ammonia quantity released of approximately 920 lbs.\n\nThe EPA OCA Endpoint Tables predicted, with a wind speed of 3 m/s and atmospheric stability class D, that the anhydrous ammonia release may travel approximately 0.1 miles. Approximately 98 people, as determined by Landview Census data, in the surrounding community, reside within the radius to the toxic endpoint.  There are no other public or environmental receptors within the radius to the toxic endpoint.\n\n4.0  Accidental release prevention program ('68.155(d)).\n\nBar-S Foods Clinton, OK facility standard policy requires daily monitoring and inspection of the anhydrous ammonia refrigeration system by trained employees, or contracted services personnel.  The facility has implemented an OSHA PSM program which is equivalent to the EPA RMP Program 3 Prevention Program.  Other accidental release prevention practices at Bar-S Foods"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14071,
      "SummaryText": " include:\n\n7 Annual operator refresher training.\n7 Routine preventative maintenance and inspections.\n7 Refrigeration system repairs made in a prompt, safe manner.\n7 Labeling of ammonia system pipes and components.\n7 Safe work practices followed.\n\n5.0  5 year accidental history ('68.155(e)).\n\nNo releases or accidents, involving anhydrous ammonia, that are reportable in accordance with 40 CFR Part 68 (RMP Rule), have occurred at this facility.\n\n6.0  Emergency response program ('68.155(f)).\n\nDuring normal workday operation, the facility emergency response plan consists of employee notification (alarm system) and evacuation, followed by notification of the Clinton Fire Department  by dialing \"9-1-1\".  A facility emergency response plan and evacuation plan has been prepared and disseminated to facility personnel.  Selected personnel receive annual HAZWOPER training.\n\n7.0  Planned changes to improve safety ('68.155(g)).\n\nFuture plans to improve anhydrous ammonia refrigeration system safety consist of continuing annual operator and HAZWOPER training, addressing the PSM audit and Emergency Response Plan audit findings, and fully implementing all PSM Program elements."
    }
  ]
}