{
  "FacilityID": 14098,
  "FacilityName": "D.C. Tillman Water Reclamation Plant",
  "FacilityStr1": "6100 Woodley Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Van Nuys",
  "FacilityState": "CA",
  "FacilityZipCode": "91406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.185",
  "FacilityLongDecDegs": "-118.477222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.cityofla.org/SAN",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 69928349,
  "ParentCompanyName": "City of Los Angeles",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Los Angeles",
  "OperatorStr1": "6100 Woodley Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Van Nuys",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91406",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Birk",
  "RMPTitle": "Plant Manager",
  "FTE": 80,
  "OtherEPAFacilityID": "CAD981421878",
  "EPAFacilityID": "100000148538",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-03-21 00:00:00",
  "SafetyInspectionBy": "City of L.A. Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-02-16 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-25 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.18037,
  "FRS_Long": -118.48159,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19310,
      "AltID": "Chlorination",
      "FacilityID": 14098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19802,
          "ProcessID": 19310,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24397,
          "ProcessID": 19310,
          "ChemicalID": 62,
          "Quantity": 68000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524397,
          "ProcessID": 19310,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 19311,
      "AltID": "Dechlorination",
      "FacilityID": 14098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19803,
          "ProcessID": 19311,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24398,
          "ProcessID": 19311,
          "ChemicalID": 49,
          "Quantity": 84000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524398,
          "ProcessID": 19311,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14098,
      "SummaryText": "Introduction\n\nChemicals are widely used in industry, in the home, and in the environment.  They are transported on roads, water, and railways.  The Donald C. Tillman Water Reclamation Plant (DCT WRP) also uses chemicals as a necessary part of treating wastewater and producing recycled water.  For example, chlorine is used to disinfect our water and provide safe water discharges to the environment or for landscaping or irrigation uses.  Sulfur dioxide is used to remove excess chlorine to preserve aquatic life in the Los Angeles River.  Storing large qualities of chlorine and sulfur dioxide can be a hazard.  As the agency responsible for operating DCT WRP, we take our safety obligations in storing and using these chemicals as seriously as we take providing the environment with safe disinfected water.  The following document describes what could happen if there were to be an accident, the steps we take every day to ensure a safely operating plant, and what to do in the event of an emergency.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe City of Los Angeles Bureau of Sanitation and DCT WRP accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices.  All applicable procedures of the State of California and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\nThis document complies with the EPA Risk Management Program under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.  DCT WRP has a chlorination system that uses chlorine gas fed from liquid chlorine containers and a dechlorination system that"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14098,
      "SummaryText": " uses sulfur dioxide gas fed from liquid sulfur dioxide containers.  This document summarizes our existing health and safety programs, our internal management response procedures, and ongoing actions that are designed to prevent or minimize impacts of accidental releases of chlorine or sulfur dioxide to the environment.  DCT WRP has prepared an emergency action plan to handle any potential accidental releases.  To date, we have an excellent record in preventing accidents from occurring.\n\nIn 1991, DCT WRP prepared a Risk Management Prevention Plan document for the chlorine and sulfur dioxide process under the predecessor program to the RMP.  Several changes were made at that time to make the processes safer.\n\nTo further reduce the risk of accidental releases, DCT WRP is planning to replace chlorine and sulfur dioxide with safer chemicals.  The conversion is currently under way and is expected to be complete as early as July 1999.\n\nGeneral Facility and Regulated Substances Information\n\nDCT WRP, operating since 1985, is located at 6100 Woodley Avenue in the City of Van Nuys, Los Angeles County, California.  The plant, located on a 90-acre property, is about 1.7 miles northwest of the junction of the 101 Ventura Freeway and the 405 San Diego Freeway in the Sepulveda Dam Recreation Area.  Wastewater from the service area is treated at DCT WRP and final clean and disinfected water is either discharged into the Los Angeles River or pumped to customers as reclaimed water for landscaping and irrigation uses.  The wastewater treatment at DCT WRP includes preliminary treatment, primary and secondary treatment, coagulation/filtration, and chlorination and dechlorination before final discharge or reclamation use.  DCT WRP has an average design capacity of 80 million gallons per day (mgd), with an average flow of 68 mgd.\n\nThe facility currently stores chlorine and sulfur dioxide; both regulated toxic substances under RMP and CalARP regulations.  Chlorine is stored in two 17-ton s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14098,
      "SummaryText": "teel bulk storage tanks.  Sulfur dioxide is stored in two 25-ton steel bulk storage tanks each containing a maximum of 21 tons. Pressurized liquid chlorine is expanded to its gaseous state and is used for disinfection of treated effluents.  Sulfur dioxide is used for removing excess chlorine after chlorine disinfection to meet discharge requirements.  The maximum quantity of chlorine and sulfur dioxide stored at DCT WRP exceeds the federal RMP and CalARP specified threshold quantities of 2,500 pounds and 5,000 pounds, respectively; thus, the facility is subject to federal RMP and CalARP regulations.\n\nExpansion chambers, rupture discs, and pressure relief valves are located throughout the process system to protect against excess pressure.  All process related factory-set pressure relief valves are set to protect the safety of workers and the integrity of the equipment.  Automatic shutoff valves are provided on both the chlorine and sulfur dioxide process to stop the flow from the bulk tanks in event of emergency.  These valves can be operated remotely from the control room or manually from a switch located adjacent to the chlorination and dechlorination buildings.\n\nThe chlorine process is checked twice during every 8-hour shift as part of the normal rounds at DCT WRP.  There are three chlorine leak detectors that monitor continuously for chlorine leaks, one in the chlorine equipment room and two in the chlorine tank room.  The leak detectors are set to alarm at a chlorine concentration of 0.5 parts per million (ppm) and 20 ppm.  At 0.5 ppm, an alarm is activated in the control room, and an alarm and flashing lights are activated inside and outside the chlorination building.  In addition, if chlorine is detected at a concentration of 20 ppm or higher in the atmosphere, tanker valves will be automatically shut down.\n\nThe sulfur dioxide process is also checked twice during every 8-hour shift as part of the normal rounds at this facility.  There are four sulfur dioxide d"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14098,
      "SummaryText": "etectors that monitor continuously for sulfur dioxide leaks, one in the equipment room and three in the tanker room.  The detectors are set at 5 ppm and 20 ppm.  If sulfur dioxide gas is detected at a concentration of 5 ppm, a local audible alarm will sound inside the sulfur dioxide building.  If sulfur dioxide gas is detected at a concentration of 20 ppm or above in the atmosphere, an audible alarm will sound at the control room, inside, and outside the building, and flashing lights will be \nactivated inside and outside the building.  \n\nFor both the chlorine and the sulfur dioxide systems, an audible alarm will sound both locally and in the control room, and an alarm light will show at the annunciator panel.  The audible alarm is acknowledged by pressing the \"acknowledge\" button on the annunciator panel.  The alarm light stays on until the condition returns to normal.  The alarm is also transmitted from the annunciator panel to the control room.\nThe sulfur dioxide process rooms are enclosed in a building equipped with an automatically operated ventilation system that is triggered by the sulfur dioxide leak detector.  In addition, the sulfur dioxide process is equipped with an emergency sulfur dioxide liquid drain system, which consists of sulfur dioxide liquid sumps in the sulfur dioxide storage room and equipment room and an emergency plant effluent diversion line.\n\nEmergency showers and eye wash stations are provided at each building.  The main control building has a 5-minute emergency air pack available, and the sulfur dioxide room is also equipped with emergency air packs.  Fire extinguishers are available at both the chlorine and sulfur dioxide rooms. \nAccess to DCT WRP is controlled at Woodley Avenue by a gate and security guard.  Visitors and contractors must be approved by DCT WRP staff prior to entry into the facility.  The chemical buildings remain locked and only a limited number of DCT WRP staff have keys.\n\nOffsite Consequence Analysis Results\n\nThe offs"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14098,
      "SummaryText": "ite consequence analysis includes consideration of two release scenarios, identified as \"worst case\" and \"alternative\" release scenarios.  The worst-case release scenario requires that a release of the entire contents of the single largest vessel or pipe be evaluated for offsite impacts.  When two or more regulated substances are present, the worst-case release scenario must be reported for the chemical that has the largest offsite impacts.  Only passive or administrative controls are allowed under the worst-case release scenario to reduce offsite impacts.  The worst-case release scenario for DCT WRP is the rupture of a chlorine bulk storage tank, resulting in a release of 34,000 pounds of chlorine over a 10-minute duration.  In practice, this type of total release of a bulk tank would be unlikely to occur during the lifetime of the plant.  The rupture of both a chlorine tank and a sulfur dioxide tank were modeled, but the resulting affected area was greater under the chlorine release scenario. \n\nThe released liquid is assumed to quickly volatilize and disperse as a vapor cloud.  The distance to the toxic endpoint was estimated using the Dense Gas Air Dispersion (DEGADIS 3.0.3) model.  The toxic endpoint was conservatively set by EPA to ensure that local emergency response planning takes into account the greatest possible impacted area surrounding the release point.  The toxic endpoint selected by EPA and CalARP was 3 ppm. All required EPA-model input parameters were included in completing this activity, including conservative meteorological conditions - Stability F class, wind speed of 1.5 meters per second, highest daily maximum temperature (110 degrees F), and average humidity (64 percent).  The results of the dispersion modeling analysis for this worst-case release scenario indicate that this scenario has an impact to receptors offsite.\n\nAn alternative release scenario for each regulated substance is also required.  The alternative release scenario is a release "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14098,
      "SummaryText": "scenario more likely to occur than the worst-case release scenario.  Unlike the worst-case release scenario, active controls can be considered in analyzing the impacts of an alternative release scenario.  Active controls consist of mechanical, electrical, or human input.  The alternative release scenarios used for both chlorine and sulfur dioxide was a small leak in the liquid process piping, valves, or joints inside the evaporator room.  For both chlorine and sulfur dioxide, the active mitigation provided by leak detectors was considered.  For the chlorine alternative release scenario, a release rate of 5.56 lbs/min was assumed and building mitigation was considered in the analysis.  The same modeling approach used was similar to the worst-case release scenario, except meteorological conditions were adjusted to more common conditions of Stability D Class, wind speed of 3.0 meters per second, average air temperature of 63 degrees F, and average humidity of 64 percent.  For the sulfur dioxide alternative release scenario, a release rate inside the building was calculated to be 7.6 lbs/min.  However, considering the sulfur dioxide is contained in the building and neutralized in the scrubber, much less sulfur dioxide is actually discharged to the atmosphere.  Based on the scrubber efficiency, the release rate to the atmosphere is 0.018 lb/min.  (A value of 0.1 lb/min. is reported in RMP*Submit because an error in software does not allow it to accept any lower value.)\n\nThe results of the dispersion modeling analysis for the chlorine alternative release scenario indicate that this scenario has a much smaller offsite impact.  Because of the active controls applied to the sulfur dioxide system (namely the scrubber), no offsite impacts were identified from an alternative release scenario for sulfur dioxide.  (A value of 0.01 mile was entered in RMP*Submit because an error in the software would not allow it to accept zero.)\n\nSummary of the Accidental Release Prevention Progr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14098,
      "SummaryText": "am and Chemical-Specific Prevention Steps \n\nDCT WRP is in compliance with Federal and State of California Process Safety Management (PSM) requirements.  Chemical-specific prevention steps include availability of self-contained escape breathing apparatus, worn by the operators during connection and disconnection of the chlorine and sulfur dioxide supplies; awareness of the hazardous and toxic properties of chlorine and sulfur dioxide; and the presence of chlorine and sulfur dioxide detectors and alarms.\n\nThe DCT WRP accidental release prevention program is based on the following key elements:\n7 Detailed management system and clear levels of responsibilities and team member roles\n7 Comprehensive safety process information that is readily available to staff, emergency responders, and contractors\n7 Comprehensive preventive maintenance program\n7 A process hazard analysis of equipment and procedures with operation and maintenance staff participation and review\n7 Use of state-of-the-art process and safety equipment\n7 Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n7 High level of training of operators and maintenance staff\n7 Implementation of an incident investigation, inspection, and auditing program using qualified staff\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazards, and chemical exposure limitations, as well as detailed physical properties of each regulated substance.  This information was compiled from numerous sources and is intended to be a one-stop source for the reader seeking data about these substances.  This information includes chlorine and sulfur dioxide background information, material safety data sheets (MSDS), and chlorine and sulfur dioxide reaction chemistry.\n\nEquipment safety information has been compiled on the chlorine and sulfur dioxide processes, and specifications for each p"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 14098,
      "SummaryText": "ce and troubleshooting procedures, including consequences of deviation and steps to avoid or correct deviations.  DCT WRP will update procedures whenever a change occurs that alters the steps needed to operate safely.  Operating procedures will be developed and implemented prior to any new process equipment coming on line or a changed process starting up.\n\nOperations and Maintenance Training Program\n\nEach DCT WRP employee presently involved in operating or maintaining the chlorine and sulfur dioxide processes is trained in an overview of the process and applicable operating and maintenance procedures.  Training helps employees understand the nature and cause of problems arising from operations involving chlorine and sulfur dioxide, and increases employee awareness of hazards.  DCT WRP's training program includes both initial and refresher training that covers:  (1) a general overview of the processes, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and written self-evaluations are used to verify that an employee understands the training material before the process work can be resumed. \nTraining documentation includes:  date of most recent review or revision to the training program, type of training required and the type of competency testing used to ensure staff understands the training.  Ongoing employee training records are maintained.  \n\nContractors\n\nThe City of Los Angeles' Contract Administration department has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the chlorine and sulfur dioxide processes.  Contractors are properly informed of the hazards, access limitations to these process areas, and emergency response procedures, and are prepared to safely complete the work.  The City of Los Angeles and DCT WRP sets minimum contractor safety performance requirem"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 14098,
      "SummaryText": "rocess are collected in one place for easy reference.  Details such as maximum intended inventory, safe upper and lower operating temperatures and pressures, and codes and standards used to design, build, and operate the processes are on file at the facility.\n\nWe also have scheduled reviews of our risk management program and process safety management plan to update safety information if there is a major change that would make existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn 1991, a detailed process hazard analysis (PHA) was conducted with plant staff, engineering, and administrative staff for the regulated process.  The team consisted of process operating and maintenance experts and process design engineers.  The PHA technique used was the \"Hazard and Operability (HAZOP)\" study, per acceptable approach guidance from EPA.  The PHA was led by a knowledgeable person on the type of process being reviewed.  This review was updated in January 1999 and will be updated again within a 5-year period or whenever there is major change in the process.  A list of actions to resolve any significant findings from the January 1999 analysis was prepared, and staff is currently working to resolve this action item list.  Staff will document completion of any action item.\n\nA seismic walkthrough was recently completed, and recommendations were provided to DCT WRP for evaluation and implementation. \n\nOperating Procedures\n\nDCT WRP maintains up-to-date, accurate, written operating procedures that give clear instructions for the chlorine and sulfur dioxide processes.  DCT WRP ensures effective operating practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine and sulfur dioxide systems.  Procedures include startup, shutdown, and normal, alternate, and emergency operation.  Also included are maintenan"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 14098,
      "SummaryText": "ents for work in process areas, holds contractor safety briefings before allowing them near or in the process area, controls access to the process areas, and evaluates the contractor's performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nDCT WRP ensures that a pre-startup safety review is completed for any new regulated process at the plant, or for significant modifications to an existing covered process that requires a change in the process safety information.  DCT WRP maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  We believe that this program is the primary line of defense against a release.  Maintenance staff address equipment testing and inspection, preventative maintenance schedules, and personnel training of these procedures.  \n\nOur mechanical integrity program includes the following:\n7 Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\n7 Implementation of written procedures by performing inspections and tests on process equipment at specified intervals\n7 Training of maintenance personnel in safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions\n7 Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant-developed maintenance procedures for process areas\n\nHot Work Permits and Management of Change \n\nDCT WRP requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the regulated processes.  DCT WRP uses a comprehensive permitting and training program to ensure hot work is conducted safely.  \n\nDCT WRP provides a system and approach to maintain and implement management of changes or modifications to equipment, "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 14098,
      "SummaryText": "procedures, chemicals, and processing conditions.  This system allows our employees to identify and review safety hazards or provide additional safety, process, or chemical information before the proposed change is implemented.\n\nInternal Compliance Audits\n\nInternal compliance audits are conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  DCT WRP assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the regulatory process.  This team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\nIncident Investigation\n\nDCT WRP investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment, so that similar accidents can be prevented.  DCT WRP trains employees to identify and report any incident that requires investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of any incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by appropriate staff and is added to, or used to revise operating and maintenance procedures.  Information from audits and any resulting changes in operating procedures are passed onto the training unit for their inclusion in existing training programs, if warranted, to prevent a future event.\n\nFive-Year Accident History Summary\n\nEPA and CalARP RMP regulations require reporting the 5-year accident history of the covered processes.  The details of accidental releases are required for accidents that have caused at least one of the following:\n7 Onsite deaths, i"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 14098,
      "SummaryText": "njuries, or significant property damage\n7 Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place\nDCT WRP experienced no accidental releases involving chlorine or sulfur dioxide in the two categories listed above during this reporting period.\n\nEmergency Response Program Summary\n\nDCT WRP has established a written emergency action program that is followed by the employees to help safely control accidental releases of hazardous substances.  This program has been coordinated (reviewed) by the City of Los Angeles Fire Department, which is a member of the Local Emergency Response Planning Committee (LEPC).  This program includes an emergency action and notification plan.  Emergency operation and action procedures are also reviewed once per year. \n\nPlanned Changes to Improve Safety\n\nChanges to improve safety (recommended actions) were previously identified for the two covered processes in 1991 under the State of California Risk Management and Prevention Program.  These recommended actions have been evaluated and implemented as required.  In addition, the 1991 PHAs for the two covered processes were reviewed and revalidated in January 1999 under the RMP and CalARP program requirements.  Based on these reviews, additional changes were identified to improve the safety of the chlorination and dechlorination systems.  It is expected that the recommended actions be evaluated and implemented by December 1999.  The implementation of these recommendations will further improve the safety of the covered processes.\n\nMost importantly, DCT WRP is planning to replace chlorine and sulfur dioxide with much safer chemicals.  As early as July 1999, the gaseous chlorine system will be replaced with a liquid sodium hypochlorite disinfection process.  Similarly, the sulfur dioxide will be replaced with sodium bisulfite."
    }
  ]
}