{
  "FacilityID": 14146,
  "FacilityName": "Kugler Propane Plant-Bayard",
  "FacilityStr1": "North Highway 26",
  "FacilityStr2": null,
  "FacilityCity": "Bayard",
  "FacilityState": "NE",
  "FacilityZipCode": "69334",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31123",
  "LEPC": "Morrill County LEPC",
  "FacilityLatDecDegs": "41.815278",
  "FacilityLongDecDegs": "-103.322222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "http://12.60.200.34/",
  "FacilityEmailAddress": "webmaster@kuglercompany.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kugler Oil Company",
  "Company2Name": null,
  "CompanyDUNS": 35509810,
  "Company2DUNS": 0,
  "OperatorName": "Kugler Oil Company",
  "OperatorStr1": "P O Box 1748",
  "OperatorStr2": null,
  "OperatorCity": "McCook",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69001",
  "OperatorZipCodeExt": "1748",
  "RMPContact": "Dick Trail",
  "RMPTitle": "Director of Safety",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000149582",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-05-18 00:00:00",
  "DeRegistrationEffectiveDate": "2004-07-20 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.81528,
  "FRS_Long": -103.32222,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19379,
      "AltID": "Bulk Storage for Retail",
      "FacilityID": 14146,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 19875,
          "ProcessID": 19379,
          "NAICSCode": "454312",
          "_desc": {
            "NAICS_CODE": "454312",
            "NAICS_DESCRIPTION": "Liquefied Petroleum Gas (Bottled Gas) Dealers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24514,
          "ProcessID": 19379,
          "ChemicalID": 98,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524514,
          "ProcessID": 19379,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14146,
      "SummaryText": "\nThe Bayard Propane Bulk Plant is located along Highway 26 east of Bayard, Nebraska.  The facility unloads from semi-truck tankers, stores and eventually delivers propane to retail customer storage tanks in surrounding areas.  Kugler Oil Company, the parent of the Bayard Plant is a family owned corporation located in McCook, Nebraska.  The owners live in McCook, surrounded by friends and neighbors who are also their customers.  The principal officers of the parent company as well the employees who service the propane division are all very active in the affairs of their local communities and are as interested in the health and welfare of their neighbors as they are of their own families.\n\nThe facility has one 30,000 gallon (maximum capacity) and one 18,000 gallon pressure vessels for the storage of liquified propane. There are no other chemicals used or stored at this facility that would be considered hazardous within the purview of PSM 68.\n\nThe worst-case release scenario of this facilitys risk management plan is based on the hypothetical rupture of the large bulk tank whereby all the stored product could be released within ten minute period of time.  The maximum amount of propane released would be 110,000 pounds producing a rate of 11,000 pounds of liquid per minute.  Liquid propane in any conceivable atmospheric condition existing at this site would immediately turn to vapor.  The model chosen to determine how far the propane vapor cloud would travel  before diluting to less than 1 psi overpressure in the atmosphere was EPAs OCA Guidance Program which predicted a distance of 0.4 miles from the point of release. \n\nIn constructing this plan, many alternative scenarios were envisioned which  could involve the accidental release of propane fuel. The most probable of these unlikely scenarios might be the release of excess pressure due to natural solar heating of an overfilled storage tank. With the release of 100 pounds of liquid material over a ten minute period, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14146,
      "SummaryText": "the maximum predicted travel of the resulting vapor cloud would only involve one personal residence within the predicted 0.1 mile radius. \n\nThe Kugler Oil Company has always been very pro-active in meeting accepted industry standards for storage and handling of the various chemicals with which they deal.  Safety is of paramount concern and to that end they hire an internal Safety Director,  provide for a Safety Committee that meets regularly and in addition contract with an outside firm for safety overview and guidance.   Part of the Management Directive for the Company safety program states that It is the intent of management that full implementation of the safety program will benefit this facility, and as such it is a high priority of the facility.  The benefits will include preventing accidents, reducing overall operating costs by reducing down time, repair costs, time and costs spent in training new employees, reducing workers compensation claims costs, and increasing productivity through a better trained and motivated workforce.  To this end, it is the responsibility of management to provide a workplace free of  hazards....  By extension the safety of the community  surrounding our facilities is of as much concern as for our employees as ourselves.\n\nIn the unlikely scenario where an propane vapor cloud would leave the premises of the Bayard Plant, our employees are trained to inform the local population. Coordination has been effected with the Morrill County Local Emergency Planning Committee (LEPC) whose agencies can provide for notification of those residents likely to be affected so that they may in turn evacuate the area. The Bayard Volunteer Fire Department personnel are invited to make regular visits to the facility to become familiar with the premises and equipment. \n\nThe Kugler Company at this and all similar locations requires that all materials and procedures meet the State of Nebraska and Industry Standards, NFPA 58, for construction of Propane "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14146,
      "SummaryText": "handling facilities.  Kugler propane division personnel are regularly trained on the maintenance and operation of all facility equipment.  A systematic program of preventative maintenance  is in effect. Our goal is to be a good neighbor and maintain an operation in consonance with the natural environment and the surrounding residents.\n\nKugler Oil Company since the acqusition of this plant has provided fuel to retail customers in this immediate area and there have been no reportable releases (greater than 100 pounds) from this facility, in fact no accidental releases on site of any amount of have occurred.  It is to be noted that in the history of the Kugler Company ownership of this and similar facilities there has been no reportable release of hazardous materials of any kind.   The Company attributes their training program of employees and supervisors to be key to this flawless track record.  \n\nThis storage tank is visually monitored to prevent any unauthorized access to the equipment.  In addition the valves and associated piping of this tank are enclosed by a chain link fence which is pad-locked when unattended.  Kugler Oil company has met all SARA Title III and Tier Two and EPRCA 312 reporting requirements."
    }
  ]
}