{
  "FacilityID": 14320,
  "FacilityName": "Destin Water Users, Inc. Reclamation Facility",
  "FacilityStr1": "14 Industrial Park Lane",
  "FacilityStr2": null,
  "FacilityCity": "Destin",
  "FacilityState": "FL",
  "FacilityZipCode": "32541",
  "Facility4DigitZipExt": "0308",
  "FacilityCountyFIPS": "12091",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.393056",
  "FacilityLongDecDegs": "-86.478333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.destinwaterusers.com",
  "FacilityEmailAddress": "destinwaterusers@gnt.net",
  "FacilityDUNS": 71946867,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Destin Water Users, Inc.",
  "OperatorStr1": "135 Benning Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Destin",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32541",
  "OperatorZipCodeExt": "0308",
  "FTE": 58,
  "OtherEPAFacilityID": "1000-0001-6378",
  "EPAFacilityID": "100000016378",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-12-28 00:00:00",
  "DeRegistrationEffectiveDate": "2022-10-20 00:00:00",
  "AnniversaryDate": "2004-05-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.393056,
  "FRS_Long": -86.445,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19607,
      "AltID": "Chlorine Gas",
      "FacilityID": 14320,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 24801,
          "ProcessID": 19607,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20111,
          "ProcessID": 19607,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 10495,
              "Process_NAICS_ID": 20111,
              "SafetyReviewDate": "1999-01-06 00:00:00",
              "PHA_Date": "1999-01-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "color coded chlorine piping",
              "OpProceduresReviewDate": "1999-01-08 00:00:00",
              "TrainingReviewDate": "1998-01-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Treeo Center",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-04 00:00:00",
              "EquipmentInspectionDate": "1999-01-04 00:00:00",
              "EquipmentTested": "ALL",
              "ChangeMgmtDate": "1999-01-04 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-04 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-31 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14808,
                  "PreventionProgram3ID": 10495,
                  "ProcessChemicalID": 24801
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14320,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-01 00:00:00",
    "ERTrainingDate": "1998-12-01 00:00:00",
    "CoordinatingAgencyName": "Destin Fire Control District",
    "CoordinatingAgencyPhone": "8518378413",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14320,
      "SummaryText": "EXECUTIVE SUMMARY\n\nCAA SECTION 112(r) RISK MANAGEMENT PLAN\nDESTIN WATER USERS, INC.\nWASTEWATER RECLAMATION FACILITY\nDESTIN FL. 32541\n\n\n1.0 EXECUTIVE SUMMARY\n\n\n1.1 ACCIDENTAL RELEASE PREVENTION EMERGENCY RESPONCE POLICY SUMMARY\n\nThe Destin Water Users Reclamation Plant (DWU) is located at 14 Industrial Park Lane, Destin FL. 32541. The Facility is a crutial part of the city of Destins Water and Waste Water system. DWU is committed to operating this facility in a manner that is protective of the health and safety of the city and Contractor employees, the public, and the environment. In addition, DWU is committed to operating this facility in full compliance with all applicable Occupational Safety and Health Administration (OSHA) and Environmental Protection Agency (EPA) regulation requirements.\n\nTo ensure that the Facility is operated in a safe manner and in compliance with applicable OSHA and EPA regulations relevant to accidental release prevention, DWU has developed this integrated Process Safety Management/Risk Management Plan (the Plan). Among the important components of this Plan are the company's system of policies and procedures for operation and maintenance of the Facility. The company has designated the facilities Plant Manager and Maintenance Manager as the individuals with primary responsibility and accountability for seeing that this Plan and its associated components accurately reflect Facility conditions and that it is fully implemented. \n\n\n1.2 STATIONARY SOURCE DESCRIPTION\n\nThe Facility is designed for the treatment of wastewater from Destin's sanitary sewer system. The Facility uses chlorine for wastewater disenfection. (The chlorine system). Chlorine is delivered to the Facility via truck and stored in silver one-ton (2,000 pounds) containers, which are used onsite as storage vessels. These containers are stored and used in the chlorination building near the center of the facility property. The chlorination building is also used for storage of 150 pou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14320,
      "SummaryText": "nd containers, which are used by the water treatment department for disenfection of potable water. The maximum intended inventory of chlorine at this location, incuding all one-ton and 150 pound containers is 16,000 pounds in one-ton and 150 pound containers.\n\nTo facilitate the process, up to four (4) one-ton containers (8,000 pounds) are simultaneously connected to two split manifold configurations which has two banks of two containers. Only one bank is active at any one given time with only one container on line and one container in standby via automatic switchover regulators.\n\n\n1.3 WORST CASE AND ALTERNATIVE CASE RELEASE SCENARIOS\n\nThe worst case scenario is a sudden release of the contents of one full one-ton container of chlorine, or 2,000 pounds, over a period of ten minutes, as required by the applicable Process Safety Management/Risk Management Plan (PSM/RPM) regulations.\n\nIn addition to assuming a release of a full container of chlorine, the worst case scenario included other worst case assumptions, such as low wind speed (1.5 meters per second (m.s)), a highly stable Class F atmosphere. and the maximum ambient temperature over a three year period (100 F). These worst case assumptions contributed to a highly conservative, large distance to the toxic endpoint of .0087 milligrams per liter (mg/l), or 3 parts per million (ppm) chlorine, as defined by the regulations. Under these worst case conditions, the toxic endpoint for chlorine was determined using EPA's RPM Guidance of Wastewater Reference Table of Equations to be 1.3 miles from the point of release.\n\nUsing the methodology prescribed in the regulations, results in potential impacts to the public receptors, including a potentially impacted residential population is 5,100. There were no environmental receptors, such as wildlife refuges, within this area. It is important to recognize, however, that the regulations require the identification of the potentially impacted population using a circle with a radius"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14320,
      "SummaryText": "that is the maximum distance to the toxic endpoint. in actuality, the released gas would most likely take the form of an elongated plume, impacting the population within only a portion of the circle located in the downwind direction of the source.\n\nThe size of actual impacted population would therefore be only a fraction (on the order of 20%) of the potentially impacted population identified in the worst case release scenario analysis. Thus, a more reasonable estimate of the potentially impacted population, assuming the worst case scenario, would more likely be on the prder of 1,020. It is also important to note that the toxic endpoint of 3 ppm used to determine the maximum distance from the source for estimating the potential impacts is at the low end of the 3 ppm to 5 ppm range. This is likely to cause mild health effects comprising a slight irritation of the nose and upper repiratory tract, and not more serious health consequences or death.\n\nA more realistic alternative release scenario was also examined. For this scenario, it was assumed that from a ton container, a pipe leak resulting in the release of 1,000 pounds of chlorine. In addition, a more realistic release period of 30 minutes was used for the alternative case scenario. Realistic ambient conditions comprising 3.0 m/s wind speed, Class D atmospheric stability, and 68 F temperature were used. The distance to the toxic endpoint for chlorine was determined using EPA's RMP Guidance of Wastewater Reference Table of Equations to be 0.7 miles from the point of release. The potentially impacted population was determined to be 4,000, whereas the more likely actual impacted population would be on the order of 800. Potential public receptors were located within the endpoint radius, but there were no identified environmental receptors.\n\n\n1.4 ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Facility has an aggresive accidental release prevention program that is based upon a foundation of employee awareness and proactive"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14320,
      "SummaryText": "system maintenance. This program is documented in this integrated Plan. The effectiveness of this program, which meets or exceeds all requirements of applicable PSM/RMP regulations, is evident by the fact that the Facility has had no significant releases of chlorine in the five years prior to the date of this Plan.\n\n\n1.5 FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases at the Facility in the past five years prior to the date of this Plan that resulted in the injuries or death to facility or contract employees onsite or the offsite public, or damage to potential environmental receptors.\n\n\n1.6 EMERGENCY RESPONSE PROGRAM\n\nThe Facility has an emergency response plan (ERP) that defines the actions to be taken by Facility employees in the event of an accidental release of hazardous materials. This ERP has been communicated to the Destin City Fire Department (DCFD) and the Local Emergency Planning Committee (LEPC). It is DWU's policy with the regard to emergency response, that its personnel at the Wastewater Reclamation Facility be trained to the First Responder Awareness Level. These are individuals who are likely to witness or discover a hazardous substance release and who have been trained to initiate an emergency response sequence by notifying the proper authorities of the release. Thus, it is DWU's policy for the Facilty employees to call 911 in the event of a release emergency and allow the local Hazardous Material Response Team (HAZMAT) to mitigate the release conditions. The DCFD is presently responsible for determining when evacuation of offsite areas is necessary, and for public notification."
    }
  ]
}