{
  "FacilityID": 14391,
  "FacilityName": "Performance Food Group, CDC, Gainesville",
  "FacilityStr1": "4041 N.E. 54th Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Gainesville",
  "FacilityState": "FL",
  "FacilityZipCode": "32609",
  "Facility4DigitZipExt": "1662",
  "FacilityCountyFIPS": "12001",
  "LEPC": null,
  "FacilityLatDecDegs": "29.702667",
  "FacilityLongDecDegs": "-82.276361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154483457,
  "ParentCompanyName": "Performance Food Group",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Performance Food Group",
  "OperatorStr1": "6800 Paragon Place, Suite 500",
  "OperatorStr2": null,
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23230",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Wilson",
  "RMPTitle": "General Manager",
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151186",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-24 00:00:00",
  "SafetyInspectionBy": "Florida Dept. of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": "1999-07-26 00:00:00",
  "ReceiptDate": "1999-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-25 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.70267,
  "FRS_Long": -82.27636,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19696,
      "AltID": null,
      "FacilityID": 14391,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20202,
          "ProcessID": 19696,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 24907,
          "ProcessID": 19696,
          "ChemicalID": 56,
          "Quantity": 11820.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 524907,
          "ProcessID": 19696,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14391,
      "SummaryText": "\n                          PERFORMANCE FOOD GROUP\n\n                          RISK MANAGEMENT PROGRAM\n\n                                                     EXECUTIVE SUMMARY\n\n\n\n\n\n1.  General accidental release and prevention policy of Performance Food Group.\n\n\n\nIn this frozen food distribution center we utilize anhydrous ammonia as a refrigerant.  Anhydrous\n\nammonia is considered hazardous by the Environmental Protection Agency. The same properties\n\nthat make ammonia a valuable refrigerant also makes it necessary to observe certain safety\n\nprecautions during it's use to prevent human exposure, reduce the threat to our workers personal\n\nhealth, the surrounding community and the environment.  It is our policy to adhere to all\n\napplicable federal and state regulations.  Safety depends directly on our proper handling of\n\nammonia combined with the safety devices that are incorporated in our facility and the safe\n\nhandling procedures that our personnel are trained in.\n\n\n\n2.  Stationary source and regulated substance handled.\n\n\n\nPerformance Food Group, 4041 N.E. 54th Avenue, Gainesville, Florida is responsible for the\n\nstorage and distribution of various frozen food products.  There are approximately 75 employees\n\nat this facility which includes hourly and salary personnel.  This distribution facility receives and\n\nprepares shipment of frozen food via tractor trailers approximately 20 hours a day, seven days a\n\nweek.  \n\n\n\nPerformance Food Group is located in an industrial park approximately 3 miles north east of the\n\ncity of Gainesville, Florida.  In addition to our distribution facility the industrial park also houses\n\nother manufacturing or business facilities.  \n\n\n\nThe potentially hazardous chemical used at the Performance Food Group facility is\n\nANHYDROUS AMMONIA.  The dominant characteristic of ammonia vapor is it's pungent,\n\ndistinct odor.  Persons exposed to ammonia will not voluntarily stay in areas of even small\n\nconcentrations, although these levels would not resu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14391,
      "SummaryText": "lt in any health risks. \n\nRisks from accidental exposure to ammonia in a vapor state are irritations to the eyes, nose and\n\nthroat. The extent of irritation depends on the exposure amount and length of time exposed.   \n\nAmmonia is classified non-flammable by the Department of Transportation.  Ammonia will burn,\n\nbut only in a very narrow, high concentration level when accompanied with a constant ignition\n\nsource.\n\n\n\nThe normal operating level of ammonia that is used/stored at the Performance Food Group facility\n\nis 12,000  pounds. Anhydrous ammonia is used as the chemical in the refrigeration process. The\n\npossible hazards that could lead to an accidental release include, but are not limited to, equipment\n\nfailure, damage to piping, damage to equipment, human error, etc. \n\n\n\n\n\n\n\n\n\n\n\n\n\n3. Worst case release scenario and alternate release scenarios including administrative and\n\nengineering controls to limit/ prevent the release.\n\n\n\n\n\nWorst case scenario depicts continuous source leak from the High Pressure Receiver (HPR)\n\nlocated inside the machine room.  This vessels normal operating level is 4,145 pounds of liquid\n\nammonia,  approximately 50% of it's total capacity. Although it's maximum capacity is 8,290\n\npounds, this exceeds company policy  and engineering controls of only allowing an 80% level in\n\nthe vessel at any time. \n\n     \n\n\n\n     Worst case release scenario criteria for Performance Food Group facility:\n\n\n\n     Ammonia Quantity:                  4,145 pounds\n\n     Rate of Release:                   415 lbs / min. (10 min. release)\n\n     LOC (Level of Concern):            200 ppm  (EPA ERPG-2)  \n\n     Physical State:                    Gas and/or Liquid\n\n           Type of Area:                     Urban\n\n     Wind Speed:                        1.5 m/sec\n\n     Distance to Endpoint                    2.2 miles\n\n\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief\n\nvalve (SRV) due to an over-pressurization condition "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14391,
      "SummaryText": "on a vertical vessel located within the facility\n\nmachine room.  SRV would be performing exactly as it is designed to do during an over-\n\npressurization condition.\n\n\n\n     Alternate case release scenario criteria for Performance Food Group facility:\n\n\n\n     Ammonia Quantity:                  103 pounds\n\n     Rate of Release:                         23 pounds/min. (6 min. release)\n\n     Wind Speed:                        3.0 m/sec.\n\n     Distance to Endpoint:                   211 yards\n\n     \n\n     \n\n     The following administrative and engineering controls are in place at the\n\nPerformance Food Group to limit the release possibilities, or distance of release for the\n\nreported scenarios.\n\n     \n\n\n\n     *  Electronic ammonia detection in machine room and distribution areas.  Alarms tie in to\n\nthe maintenance system control computer.  Computer system activates a local audible alarm\n\nindicating an abnormal operating status.  (Future upgrade will incorporate computer equipment\n\nalarms into a commercially operated alarm company.)\n\n     \n\n     *  Periodic Maintenance Program is established within the maintenance department to\n\nensure the refrigeration system and it's components are kept in optimum operating status.\n\n\n\n     *  Emergency shut down procedures are in place and periodic training is held to activate\n\nthe shut down system during an actual emergency.\n\n\n\n     *  High and low level switches are configured to all pressure vessels which shut down\n\ncompressor operation during an abnormal level condition.\n\n\n\n     *  Safety Relief Valves are configured to all pressure vessels, condensers and compressor\n\noil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n\n\n\n\n\n4.  Five-year accident history.\n\n\n\nThe Performance Food Group distribution facility has zero accidental releases to report. The\n\nammonia refrigeration system was installed during the first half of 1998.\n\n\n\n\n\n5.   Emergency Response Program\n\n\n\nThe purpose of the Perfor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14391,
      "SummaryText": "mance Food Group Emergency Action Plan is to:\n\n\n\n     1.   Minimize exposure to our employees and the surrounding community in the event of a\n\n     hazardous material release or spill.\n\n\n\n     2.  Assure the safe emergency evacuation of the plant in the instance that it is required.\n\n\n\n     3.  Provide for prompt medical attention to any employees who become seriously injured\n\n     or ill at work.\n\n\n\n     4.  Manage an emergency response system and coordinate response of the internal and\n\n     external resources required to provide efficient and effective response to any type of\n\n     emergency that may occur at our facility.\n\n\n\nThis EAP currently meets requirements as set forth in OSHA 29 CFR 1910.38, Employee\n\nEmergency Plans and Fire Prevention Plans.  We coordinated this plan with a Gainesville Fire\n\nDepartment representative during their visit to the plant\n\n\n\n "
    }
  ]
}