{
  "FacilityID": 14460,
  "FacilityName": "Block 31 Gasoline and Pressure Maintenance Plant",
  "FacilityStr1": "HWY 1601, 4 miles North of HWY 329",
  "FacilityStr2": null,
  "FacilityCity": "Crane",
  "FacilityState": "TX",
  "FacilityZipCode": "79731",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48103",
  "LEPC": "Crane County LEPC",
  "FacilityLatDecDegs": "31.443333",
  "FacilityLongDecDegs": "-102.462222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 41621590,
  "ParentCompanyName": "ARCO Permian, a Unit of Atlantic Richfield Company",
  "Company2Name": null,
  "CompanyDUNS": 8019010,
  "Company2DUNS": null,
  "OperatorName": "ARCO Permian",
  "OperatorStr1": "600 N. Marienfeld",
  "OperatorStr2": "PO Box 1610",
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79702",
  "OperatorZipCodeExt": "1610",
  "FTE": 77,
  "OtherEPAFacilityID": "TXD000802918",
  "EPAFacilityID": "100000152247",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0-00545/0-00547",
  "SafetyInspectionDate": "1993-09-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.4417,
  "FRS_Long": -102.462,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19795,
      "AltID": "Natural Gas Processing",
      "FacilityID": 14460,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 25042,
          "ProcessID": 19795,
          "ChemicalID": 155,
          "Quantity": 610000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 17328,
              "ProcessChemicalID": 25042,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 17329,
              "ProcessChemicalID": 25042,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 17330,
              "ProcessChemicalID": 25042,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 17331,
              "ProcessChemicalID": 25042,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 17332,
              "ProcessChemicalID": 25042,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 17333,
              "ProcessChemicalID": 25042,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 17334,
              "ProcessChemicalID": 25042,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20305,
          "ProcessID": 19795,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14460,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-30 00:00:00",
    "ERTrainingDate": "1999-04-30 00:00:00",
    "CoordinatingAgencyName": "Crane County Sheriff and Fire Dept",
    "CoordinatingAgencyPhone": "9155583571",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Texas RRC Rule 36",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14460,
      "SummaryText": "Block 31 Gas Plant Risk Management Plan:\r\n                      Executive Summary\r\n\r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nThe  Block  31 gas plant is committed to worker  and  public\r\nsafety.  This  commitment is demonstrated by  the  resources\r\ninvested  in accident prevention, such as training personnel\r\nand   considering   safety  in  the  design,   installation,\r\noperation,  and maintenance of our processes. This  facility\r\nwas  designed  and constructed utilizing generally  accepted\r\nindustry codes and recommended practices such as ANSI,  ASME\r\nand  API.   It  is  our policy to adhere to  all  applicable\r\nfederal,  state, and local laws. Our policy is to  implement\r\nreasonable  controls  to  prevent  foreseeable  releases  of\r\nregulated  substances.  However, if a  release  does  occur,\r\nplans  have  been  developed  to  control  and  contain  the\r\nrelease.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED\r\nSUBSTANCES\r\n\r\nThe  Block 31 gas plant is located west of Crane, Texas. The\r\nplant  has  several regulated flammables, such  as  methane,\r\nethane, propane, butanes and pentanes.\r\n\r\nThe  Block 31 plant handles gas produced from the  Block  31\r\nfield.   Produced  gas is processed to  remove  natural  gas\r\nliquids  (NGLs),  then  reinjected into  the  reservoir  for\r\npressure maintenance, used for fuel, or sold.\r\n\r\nGas  comes into the plant at pressures ranging from 10  psig\r\nto  1200  psig.   Gas must be at 1200 psig  for  processing;\r\ntherefore,  compression is required for streams coming  into\r\nthe  plant  at lower pressures.  Any liquid that  drops  out\r\nfrom the gas during compression is returned to the field and\r\ncombined with the oil production.\r\n\r\nAfter  inlet compression, the gas is split into two streams.\r\nPart  of the gas flows straight to injection, and part flows\r\nto the Nitrogen Rejection Facility (NRF) for processing.\r\n\r\nInjection Gas\r\n  Triethylene glycol is injected into this stream to prevent\r\nhydrate  formation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14460,
      "SummaryText": "then    is compressed and  injected  into\r\nthe reservoir.\r\n\r\nThe  glycol/water  mixture is separated in the  glycol/water\r\ncoalescer separator.  The rich glycol is regenerated to lean\r\nglycol  in  the glycol reboiler, which is heated  by  steam.\r\nLean glycol flows to the surge tank and is injected into the\r\nfeed gas again.  The water vapor and a small amount of light\r\nhydrocarbon driven off in the reboiler.\r\n\r\n\r\nNitrogen Rejection Facility (NRF)\r\nDiglycolamine  (DGA) is used to sweeten, or remove  CO2  and\r\nH2S  from, the gas stream that flows through the  NRF.   The\r\nrich  DGA  is regenerated by reducing the pressure and  then\r\nheating the amine to remove any light hydrocarbons, CO2, and\r\nH2S.   Steam provides the heat needed for this regeneration.\r\nThe  hydrocarbon gases driven off are returned to the  plant\r\ninlet gas system.  The acid gases CO2 and H2S are compressed\r\nand  injected.  The lean DGA returns to the amine  contactor\r\nto sweeten more gas.\r\n\r\nNRF   feed   gas   is   dehydrated  after  the   sweetening.\r\nTriethylene glycol absorbs water and a small amount of light\r\nhydrocarbon  from the gas.  After contacting  the  gas,  the\r\nrich  glycol  is  heated and flows into a flash  tank  where\r\nlight  hydrocarbons vaporize.  These light hydrocarbons  are\r\nreturned  to  the plant inlet system.  Water  and  remaining\r\nhydrocarbon gases are removed from the glycol in the  glycol\r\nreboiler,   which  is  heated  by  steam.   The  water   and\r\nhydrocarbon  vent  gases  are released  to  the  atmosphere.\r\nPlans  are  underway  to  condense these  gases  to  recover\r\nliquids  and  return the remaining vapor back to  our  inlet\r\nsystem.  The lean glycol returns to the glycol contactors to\r\ncontinue the process.\r\n\r\nThe  gas  must  be free of all water, CO2,  and  H2S  before\r\nentering the cryogenic process.  Mol sieve beds are used  to\r\nremove  any remaining water, CO2, and H2S.  Two beds are  in\r\nservice  while  two  beds are being  regenerated.  Beds  are\r\nregenerated"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14460,
      "SummaryText": "using heated nitrogen that flows countercurrent\r\nto  the  process  flow. Regeneration gas is cooled  and  re-\r\ninjected into the reservoir.  Regeneration gas heaters  burn\r\nsweet residue gas.\r\n\r\nThe  sweetened, dehydrated gas flows through  the  cryogenic\r\nprocess for removal of ethane and heavier hydrocarbons.  The\r\ngas is chilled to very low temperatures using a single stage\r\nturbo expansion process.  The liquids removed are stored  in\r\npressurized tanks and pumped into pipelines for sales.\r\n\r\nThe  remaining  gas  is a mixture of methane  and  nitrogen.\r\nThese  are  separated  in  the  nitrogen  rejection  unit(s)\r\n(NRU's).  The NRU's chill the gas to condense  methane  from\r\nnitrogen.   The  nitrogen is vented  or  injected,  and  the\r\nmethane is vaporized and used for plant fuel or sold.\r\n\r\nAuxiliary Systems\r\nSteam is the heat source for many units at Block 31.   Steam\r\nis  produced  in  two  boilers.  Each boiler  by  itself  is\r\ncapable    of    producing   the   entire   plant's    steam\r\nrequirements.Both are operated in the event an upset  occurs\r\nwith  one,  there is no downtime in getting steam  from  the\r\nother unit.  The boilers burn sweet residue gas.\r\n\r\nThe  flare  at  Block 31 is used for upsets and  maintenance\r\nevents.   Other than a pilot stream, no gas is flared  under\r\nnormal operations.  The pilot stream is sweet residue gas.\r\n\r\nAn  open  drain system in the plant carries fluids to  sumps\r\nscattered throughout the plant.  From the sumps, the  fluids\r\nare  pumped into five pits.  Oil collected in these pits  is\r\nrouted to the slop oil pit, then to the slop oil tank,  then\r\npumped to the oil production facility.  Water ends up in the\r\nlargest pit before injection into a disposal well.\r\n\r\n\r\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\r\n\r\nThe worst case scenarios (WCS) associated with a release  of\r\nflammable  substances  at the gas plant  is  a  vapor  cloud\r\nexplosion (VCE) involving the full inventory of the  largest\r\npressure  vessel containing a fla"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14460,
      "SummaryText": "mmable mixture  of  natural\r\ngas  liquids.  The maximum expected liquid  inventory  of  a\r\n34,000  gallon pressure vessel, was assumed to  release  and\r\nignite,  resulting  in  a VCE. According  to  EPA's  look-up\r\ntables  the maximum distance to the 1-psi endpoint for  this\r\nWCS  is  0.39  mile. Since this facility  is  located  in  a\r\nrelatively remote, unoccupied area, the worst-case  scenario\r\nwould not reach a public receptor. Although we have numerous\r\ncontrols  to  prevent  such releases  and  to  manage  their\r\nconsequences, no credit for passive mitigation measures  was\r\ntaken into account in evaluating this WCS.\r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\r\nThis  facility complies with EPA's accident prevention  rule\r\nand  all  applicable  Federal, state  and  local  codes  and\r\nregulations.  This facility has training programs  in  place\r\nfor its personnel and a comprehensive maintenance program to\r\nensure  that the equipment is maintained properly to  reduce\r\nthe  possibility of a release of flammable liquids or gases.\r\nA  management of change policy is established that  requires\r\nall  facility  modifications to be reviewed by  engineering,\r\noperations and safety departments to promote the  safety  of\r\nthe employees and public.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\nThe  Block 31 gas plant has an excellent record of  accident\r\nprevention over the past 5 years. This facility has not  had\r\nan  accident  involving  release of  any  of  the  regulated\r\nflammables   that  caused  deaths,  injuries,  property   or\r\nenvironmental damage, evacuations, or shelterings  in  place\r\nduring the past 5 years.\r\n\r\nTHE EMERGENCY RESPONSE PLAN\r\nIn the event of an emergency involving our facility, it is\r\nour policy to notify the Crane County Sheriff and Fire\r\nDepartments and request that they respond to the emergency.\r\nWe have discussed this policy with these departments;\r\nmembers of these  departments have inspected our facility.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nNone."
    }
  ]
}