{
  "FacilityID": 14473,
  "FacilityName": "Lake of Egypt Water and Sewer District",
  "FacilityStr1": "11484 Lake of Egypt Road",
  "FacilityStr2": null,
  "FacilityCity": "Marion",
  "FacilityState": "IL",
  "FacilityZipCode": "62959",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17199",
  "LEPC": "Williamson County LEPC",
  "FacilityLatDecDegs": "37.631944",
  "FacilityLongDecDegs": "88.950556",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lake of Egypt Water and Sewer Dist.",
  "OperatorStr1": "11484 Lake of Egypt Road",
  "OperatorStr2": null,
  "OperatorCity": "Marion",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62959",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Rhodes",
  "RMPTitle": "General Manager",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000152577",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Chlorine Risk Management Plan",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2011-11-03 00:00:00",
  "AnniversaryDate": "2004-06-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.62412,
  "FRS_Long": -88.94489,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19808,
      "AltID": "public utility",
      "FacilityID": 14473,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20318,
          "ProcessID": 19808,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25055,
          "ProcessID": 19808,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525055,
          "ProcessID": 19808,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14473,
      "SummaryText": "Lake of Egypt\nWater Treatment Facility \n\nChlorine Risk Management Plan\n\n\nPolicy Statement and Application\n\n\nThe Occupation Safety and Health Administration standard ( 29CFR 1910 119-Process Safety) and Environmental Protection Agency (Clean Air Act 40 CFR Part 68 112(r)(7) Risk Management Rule has established standards pertaining to highly hazardous chemicals.  The purpose of these standards is to establish specific requirements for those companies which use, manufacture, or store highly hazardous chemicals in order to prevent or minimize the effects of catastrophic releases of toxic, reactive, flammable or explosive chemicals.\n\nIt is the intent of Lake Egypt Water District to protect it's employees as well as the community it serves from the dangers associated with these chemicals as well as comply with all applicable federal and state standards.  To achieve these goals, specific policies and procedures were established and compiled that pertain to all covered chemicals at or above specific threshold quantities listed in this section of the plan.  The chemical involved at the Lake Egypt Facility is Chlorine.  It is used for the purpose of disinfecting in production processes of potable water (drinking water). The following is to provide a summary and briefing of Lake Egypt Water District's Chlorine Risk Management Plan. \nThis facility is sited in a rural area on the north side of Lake Egypt approximately 10 miles south of Marion, Il.  \n\nDocument Management System\n\nLake Egypt Water District has implemented a management system to oversee the implementation of the Chlorine Risk Management Plan elements.\n\nA Management Documentation Chart was designed to show the following information: \n7 Positions and the primary responsibilities of each\n7 Positions and areas to monitor for process changes\n7 Position and responsibilities when process changes occur\n\nBy defining the lines of authority and roles and responsibilities of the management team, our facility can remain committe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14473,
      "SummaryText": "d to every element of the Chlorine Risk Management Program. This will ensure a safe chlorinating process for our facility.\n\n\n\nLake Egypt Water District\n\nSafety Assurance and Training:\n\n     At least once every three (3), Lake Egypt Water District shall conduct a compliance audit of the chlorinating process to evaluate compliance with the prevention program requirements. At least one person involved in the audit must be knowledgeable in the chlorinating process. The District will develop a report of the findings and document appropriate responses to each finding. All deficiencies shall be corrected. The District shall retain the two (2) most recent audit reports on-site. \nThe OHSA compliance guideline, CPL 2-2.34, is a good starting point for an audit of the prevention program for a water treatment plant. These audits are likely to describe flaws in the management of process safety that could lead to a release of chlorine.\nAll employees involved in the chlorine process are be trained in the proper operating procedures of the process and in the appropriate safety procedures outlined in the chlorine manuals.  Training emphasizes safety, health hazards, emergency operations, and safe work practices. Employees are provided refresher training on an annual basis. Additional training is available to accommodate employee needs as necessary.\nLake Egypt Water District shall determine that each operator has received and understood the training and maintain the appropriate records for employees with date of their training and the methods used to verify employee understands the training.\n\nFive Year Accident History\n\nThere has not been any accidental release of chlorine from a covered process in the five years prior to the submission of a Risk Management Plan at the Lake of Egypt Water Facility.\n\n\nChlorine Process Safety Systems and release prevention\n\nA chlorine detector is located in the chlorine room. It monitors the chlorine storage and feed areas. The chlorine alarm provides aud"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14473,
      "SummaryText": "ible and visual alarms that are set at 3 parts per million (ppm). The alarm shall be checked daily to ensure sure safe operations. If the alarm is activated, alarming will continue until plant personnel acknowledge the alarm.  At this time the Emergence Response Plan for chlorine leaks is as follows. Automatic shut-offs are installed that respond to process failures. The facility is totally enclosed and all building doors are locked to help prevent vandalism. All facility safety procedures (Confined Space Entry, Lockout-Tag-out, etc) are followed during the chlorinating process system. All operating personnel are trained in the response to process failures, leak detection and use of repair kits. Local fire and police and emergency management authorities are notified immediately to any emergency scenarios. These authorities are updated periodically to management changes, emergency planning and other training with the following information available at all times for\n\n\n \nOperating Limits and Safety & Health Conditions.\nThe Chlorine Database & Chlorine Response Information Data Sheets  provide the following information.\n7 Operating limits\n7 Chemical properties & hazards\n7 Precautions for preventing chemical exposure\n7 Control measures for exposure \n7 Special or unique hazards \n\n\nOffsite Consequence analysis\nFor Implementation of Process Safety Management Plan\n(In compliance with 29 CFR 1910.11(c)).\n\n\nLake of Egypt Water District has performed an offsite consequence analysis to provide information to the government and the public about the potential consequences of an accidental chemical release at this facility.  The offsite consequence analysis (OCA) consists of two elements:\n\n7 A worst-case release scenario \n7 Alternative release scenario.\n\nTo simplify the analysis and ensure a common basis for comparisons, EPA has defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line failure that results i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14473,
      "SummaryText": "n the greatest distance to an endpoint.  In broad terms, the distance to the endpoint is the distance a toxic vapor cloud, heat from a fire, or blast waves from an explosions will travel before dissipating to the point that serious injuries from short-term exposures will no longer occur.\n\nProcess Hazard Analysis Methodology\n\nUsing CAMEO and ALOHA, software developed and distributed by the US EPA and NOAA, analyses were performed for the maximum release of 245 pounds per minute of chlorine. Under these scenarios, a vulnerability zone of 1.1 miles in diameter was formed. No previous release at this facility ever occurred. Release detection equipment is located in the chlorine storage room. Detection equipment emits a visual and audible warning if gas is leaks out of the container. The vacuum and leak control devices will stop the flow if chlorine leaks are detected.\nConsequences of failure of engineering controls are leaks causing the need for employee evacuation and evacuation of near-by residents.\n\nLake Egypt Water Treatment Facility\nChlorine Risk Management Plan\n\nPROCESS HAZARD RESPONSE TO WORST CASE AND ALTERNATIVE SCENARIOS\nThe following briefly Descibes the\nPotential Hazard with Available Controls and\nResponse to Failure\n\nPotential Hazard\nCylinder leak\nWorst case scenario\n\nAvailable Controls \n1. Alarms/auto shut-offs\n2. Emergency repair kit\n\nResponse to Failure\n1. Call for response to all emergency management  personnel and authorities\n2. Respond using available controls\n\nPotential Hazard\nLeaking gas line\nAlternitive scenario\nAvailable Controls \n1. Alarm/auto shut-off\n2. Ventilation\n3. Regulator shuts down chlorine feed   \n4. Chlorine cylinder valve wrench to shut off feed manually\n5. Spare pipe & tubing keep on hand\n\nResponse to Failure\n1. Chlorine would shut off  automatically\n2. While Responding  with available controls"
    }
  ]
}