{
  "FacilityID": 14546,
  "FacilityName": "TRICO FARM SUPPLIES INC",
  "FacilityStr1": "19541 East 300 South",
  "FacilityStr2": null,
  "FacilityCity": "Elizabethtown",
  "FacilityState": "IN",
  "FacilityZipCode": "47232",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18005",
  "LEPC": "Bartholomew County LEPC",
  "FacilityLatDecDegs": "39.159889",
  "FacilityLongDecDegs": "-85.711139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "NOT APPLICABLE",
  "FacilityEmailAddress": "NOT APPLICABLE",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TRICO FARM SUPPLIES INC",
  "OperatorStr1": "19541 East 300 South",
  "OperatorStr2": null,
  "OperatorCity": "Elizabethtown",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47232",
  "OperatorZipCodeExt": null,
  "RMPContact": "DEANA BODE",
  "RMPTitle": "RMP COORDINATOR",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153086",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": "1999-07-27 00:00:00",
  "ReceiptDate": "1999-07-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-30 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.15867,
  "FRS_Long": -85.74376,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19889,
      "AltID": "AMMONIA STORAGE",
      "FacilityID": 14546,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20402,
          "ProcessID": 19889,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25146,
          "ProcessID": 19889,
          "ChemicalID": 56,
          "Quantity": 84000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525146,
          "ProcessID": 19889,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14546,
      "SummaryText": "Trico Farm Supplies, Inc. - Elizabethtown, Indiana\n\n\nEXECUTIVE SUMMERY- Ammonia\n\nThe Accidental release prevention and emergency response policies at our facility.\n\nThis facility complies with the 1989 ANSI K 61-1 \"Saftey Requirements for Storage and Handling of Anhydrous Ammonia\". In Addition, it is our policy to adhere to all applicable fereral, state and local laws.\n\nTrico's Corporate Mission states \"To Provide for the saftey of our employees, our customers, and general \npublic\". In order to fufill this mission, Terra provides EHS group to maintain and administer comprehensive saftey and enviromental programs and procedures. EHS field saftey services supervisors audit and monitor facility compliance with saftey standards of the company.\n\nThis Facility maintains approximatley 28  1,000-Gallon nurse tanks for customer delivery. Our combined storage capacity in nurse tanks is  130,760 Pounds.\n\nAnhydrous ammonia is stored in One 18,000 gallon storage tank on site. 84,100 Pounds of anhydrous ammonia is the maximum storage capacity of our stationary storage tank. Therefore, the total facility anhydrous ammonia storage capicty for our facility is 214,900 pounds. The largest single storage facility contains 84,100 pounds.\n\n\n\nTHE WORST CASE SCENARIO.\nOur worst case scenario is the loss of the total contents of the 18,000 gallon storage tank, when filled to the greatest amount allowed (85% of capacity), released as a gas over 10 minutes, resulting in total vaporization. The maximum quanity released would be 84,000 pounds. According to DEGIDUS modeling, this release (distance to point of dispersion to 200 PPM) would have off site impact. It Should be noted that The Ag Industry has never had a release of an entire stationary tank.\n\nALTERNATIVE RELEASE SCENARIO\nThe Most Common alternative release scenario From our facility would not reach an end-point off site. The Alternative release scenario modled for the purposes of this plan is a 2 minute release from a stationary storag"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14546,
      "SummaryText": "e tank representing a valve and hose failure requiring a manual shut down. The total amount of anhydrous ammonia released in this scenario would be 12, 000 Pounds. This release scenario (distance to point of depersion to 200 PPM) would have off site impact. It should be noted Trico Farm Supplies has not had a release of this type from any distribution facility.\n\nTHE GENERAL ACCIDENTIAL RELESE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS.\nThe ammonia system is designed, installed and is maintained in accordance with ASTM standards and the ASME codes. This Facility complies with the ANSI K 61.1 standards (1989), OSHA (29 CFR 1910.111), EPA's Accidential Prevention Rule  as well as all applicable federal, state and local codes and regulations.\n\nOur ammonia system is protected from major releases by intenal excess flow valves, check valves, relief valves, manual shut offs and emergency shutoff valves.The load-out risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediatly stop the flow of ammonia in a line or a hose fails. All of the main storage tank valves and the riser load valves are locked when not in use.\n\nOur ammonia system is inspected on a regular basis with maintenance and preventitive maintenance scheduled and documented. Liquid and vapor valves, hoses, excess flow valves, gauges, and relief valves are replaced when necessary and/or according to the guidelines in the ANSI standards\n\nOur location has a 'Site Saftey Coordinator' as an extention of the EHS group. These coordinators are givin training to monitor the day to day safe work activities, maintain the required regulatory recordkeeping, conduct reqular saftey meetings, conduct employee training and act as the location's contcat with the EHS group. The site saftey coordinators act as the location emergency contact.\n\n\nA DESCRIPTION OF OUR FACILITY AND THE REGULATED SUBSTANCES HANDLED.\nThis facility is a wholesale farm supply"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14546,
      "SummaryText": " distribution center as such we store and distribute a wide varity of pesticides and fertilizers including Anhydrous Ammonia. Anhydrous Ammonia is recived by truck, is handled and stored on-site and is a regulated substance by EPA requiring us to comlpy with the Risk Managment Program. We sell Anhydorus Ammonia to grower customers in 1,000 gallon nurse tanks. The customer applies the ammonia into the soil as a sorce of nitrogen fertilizer for growing agricultural crops\n.\nTraining is provided to all employees at least annualy, whenever there is a change in the process or whenever compentancy with the regulations is questioned. The training consists of classroom lecture, current videos, testing and certification and on the job training.\n\n\nFIVE-YEAR ACCIDENT HISTORY.\nThere has been no accidents involving anhydrous ammonia that caused deaths, injuries, property or enviromental damage including evacuations on or off-site\n\n\nTHE EMERGENCY RESPONSE PROGRAM\nIn the event of an emergency involving our ammonia system. It is our policy to notify the local community fire department and request that they respond to the emergency. In preperation for this, we have coordinated with all of the local response agencies by providing information to ensure that our community has a stratigy for the responding to and mitigating the threat posed by an ammonia release. This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPRCA and Coordinated with our LEPC.\n\nIn Addition Trico Farm Supplies has an emergency Response Contingency Plan for our facility that complies with the requirements of OHSA (29 CFR 1910.38 and 1910.1200) Comunity right to know. The plan includes public notification, Provisions for initial medical care, evacuations and LEPC coordination.\n\nPLANNED CHANGES TO IMPROVE SAFTEY.\nAs the state of Indiana makes changes and followes thru with the adoption of ANSI K 61.1 1989 edition standards.  We will continue to pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14546,
      "SummaryText": "vide our employees with ongoing annual training to ensure that they are current with all of the safe ammonia transfer and handling procedures, and provide regular inspection and maintenance on all of the ammonia equiptment."
    }
  ]
}