{
  "FacilityID": 14572,
  "FacilityName": "Lake Stevens Sewer District Treatment Plant",
  "FacilityStr1": "500 N. Sunnyside Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Everett",
  "FacilityState": "WA",
  "FacilityZipCode": "98205",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53061",
  "LEPC": "Snohomish County LEPC",
  "FacilityLatDecDegs": "48.001111",
  "FacilityLongDecDegs": "-122.136667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": "LSSD@GTE.Net",
  "FacilityDUNS": 52762820,
  "ParentCompanyName": "Lake Stevens Sewer District",
  "Company2Name": "Snohomish County, Washington",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lake Stevens Sewer District",
  "OperatorStr1": "9327 4th Street NE",
  "OperatorStr2": null,
  "OperatorCity": "Everett",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98205",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Lewellen",
  "RMPTitle": "Operations Director",
  "FTE": 3,
  "OtherEPAFacilityID": "WA 002089-3",
  "EPAFacilityID": "100000029738",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-07-26 00:00:00",
  "DeRegistrationEffectiveDate": "2002-04-01 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 47.98927,
  "FRS_Long": -122.13484,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 19917,
      "AltID": "Chlorine",
      "FacilityID": 14572,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20430,
          "ProcessID": 19917,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25179,
          "ProcessID": 19917,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525179,
          "ProcessID": 19917,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14572,
      "SummaryText": "The Lake Stevens Sewer District(LSSD) is committed to providing a safe enviornment for its employees, neighbors, customers and the surrounding community by  preventing and/or controlling the accidental rease of any hazardous chemicals.\n\n The LSSD  Wastewater Treatment Plant, located at 500 North Sunnyside Blvd. in rual Snohomish County, Washington, receives wastewater from the greater Lake Stevens drainage basin and processes and disinfects the wastewater before releasing it to Ebey Slough, part of the Snohomish River estuaty system. The wastewater is disinfected by introducing chlorine to the wastewater to kill harmful bacteria. Chlorine is the only toxic chemical regulated by the Risk Management Program that is present at the LSSD Wastewater Treatment Plant. The ammount of chlorine on site at any given time is 4000 to 5000 pounds, stored in 1-ton cylinders in an enclosed building. \n\nThe worst-case release scenario at the LSSD Wastewater Treatment Plant involves the catastrophic failure and release of the entire contents of a 1-ton liquid chlorine container. Using EPA's RMP Offsite Consequence Analysis Guidance table 14, the maximum distance downwind from the storage tank to a toxic endpoint concentration of .0087 mg/l is 2.15 miles.\n\nAn alternative release scenario was also developed based on a 1-ton chlorine cylinder being dropped while unloading, causing a 1/4 inch puncture through which all of the contents of the container are released over a 60 minute time period. Using EPA's RMP Offsite Consequence Analysis Guidance table 15, it is calculated that this release could result in a toxic endpoint of .0087mg/l  0.68 miles downwind.\n\nThe toxicity of chlorine at high concentrations make it necessary for the  LSSD  Wastewater Treatment Plant to observe certain safety precautions to prevent unnecessary human exposure, and to reduce the threat to the personal health of employees as well as nearby members of the community. It is our policy to adhere to all applicable fe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14572,
      "SummaryText": "deral and state rules and regulations. Safety depends upon the manner in which we handle toxic chemicals including equipment design, operator training and safe operating procedures. The chlorine storage and handling equipment meets or exceeds design codes and standards as well as incorporating good engineering practices recommended by industry groups, such as the Chlorine Institute. As a result, the equipment incorporates inherently safe designs. Written operating procedures are prepared and reviewed annually for accuracy and safety. Operation and maintenance personnel are thoroughly trained on proper procedures and safety hazards, and are provided with regular refresher training. Equipment and procedures are frequently evaluated and updated with the goal of continuous improvement in both operation and training.\n\nDuring the five year period between May 1994 and June 1999, the Lake Stevens Sewer Distric Wastewater Treatment Plant has not had a reportable release of chlorine.\n\nThe Lake Stevens Sewer District's Emergency Response Program integrates OSHA's and EPA's preparedness planning response and training requirements. In the event of an accidental release, the emergency response plan includes notifying 911 dispatch, who will notify local responders. Plant personnel receive classroom training on implementation of the response plan in addition to participating in training exercises.\n\nPlans to improve safety at the LSSD WWTP include the conversion to ultraviolet disinfection in the year 2001, thus eliminating the need to keep large quntities of chlorine on hand. Untill that time the process will be periodically evaluated to assure the safety of employees and neighbors."
    }
  ]
}