{
  "FacilityID": 14647,
  "FacilityName": "J. R. SIMPLOT COMPANY - Lathrop",
  "FacilityStr1": "16777 HOWLAND ROAD",
  "FacilityStr2": null,
  "FacilityCity": "LATHROP",
  "FacilityState": "CA",
  "FacilityZipCode": "95330",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "San Joaquin County OES",
  "FacilityLatDecDegs": "37.813333",
  "FacilityLongDecDegs": "-121.304444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.SIMPLOT.COM",
  "FacilityEmailAddress": "dmurphy@simplot.com",
  "FacilityDUNS": 9073503,
  "ParentCompanyName": "J.R. SIMPLOT COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 9073511,
  "Company2DUNS": 0,
  "OperatorName": "J.R. SIMPLOT COMPANY",
  "OperatorStr1": "P. O. BOX 198",
  "OperatorStr2": null,
  "OperatorCity": "LATHROP",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95330",
  "OperatorZipCodeExt": null,
  "RMPContact": "JAMES R. CARLSON",
  "RMPTitle": "CALIFORNIA MANUFACTURING MANAGER",
  "FTE": 175,
  "OtherEPAFacilityID": "95330FRSMP16777",
  "EPAFacilityID": "100000153932",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "N-767",
  "SafetyInspectionDate": "1999-05-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Lathrop Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.80652,
  "FRS_Long": -121.2779,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20024,
      "AltID": "FERTILIZER MANUFACTURING",
      "FacilityID": 14647,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 20540,
          "ProcessID": 20024,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 20541,
          "ProcessID": 20024,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25300,
          "ProcessID": 20024,
          "ChemicalID": 56,
          "Quantity": 255000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 25301,
          "ProcessID": 20024,
          "ChemicalID": 57,
          "Quantity": 30600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525300,
          "ProcessID": 20024,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525301,
          "ProcessID": 20024,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14647,
      "SummaryText": "40 CFR 68.155 states that the owner or operator of a regulated source shall provide in the RMP an executive summary that includes a brief description of the following elements:\n\na) Accidental release prevention and emergency response policies: \n\"It is the policy of the J. R. Simplot Company to manufacture, handle, transport, store and dispose of all substances safely and in compliance with the requirements of federal, state and local environmental laws while reducing the risks to human health, safety and the environment.\" \n\nThe J.R. Simplot Company, Lathrop, California facility is committed to being a responsible community partner.  Emergency response planning and training is current and ongoing.  Every effort is made to prevent accidental releases and, in the very unlikely event of a release, to be prepared to keep offsite consequences to a minimum.  The Manteca-Lathrop Fire Department and the County Office of Emergency Services are informed of all substances manufactured, stored, and handled at this facility, and we fully cooperate with all inspections and requests for information from the regulatory community. \n\nb) The stationary source and regulated substances handled:\nThe J. R. Simplot Company, Lathrop facility produces fertilizer, industrial chemicals, and feed supplements. Only two of the listed chemicals in 40 CFR 68.130, anhydrous ammonia and ammonium hydroxide, are processed, stored, and handled in quantities exceeding threshold limits for this report.\n\nc) The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario:\nThe dispersion models done for anhydrous ammonia, show the EPA-required scenario called the \"worst-case,\" and an alternate scenario that depicts a more credible possible incident.\n\nThe first model is based on a \"worst case\" 10-minute release from the largest vessel of anhydrous ammonia and allows for no active mitigation. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14647,
      "SummaryText": "This EPA-required scenario is comparable to an airplane falling out of the sky, landing directly on the ammonia bullet and releasing about 64 tons at once. Although statistically improbable, the dispersion model suggests offsite consequences for this scenario before dispersing to below 200 ppm.  Different windspeed, humidity, and temperature could shorten this distance considerably and mitigate the release.  \n\nA more credible scenario could occur if a hose ruptured or came uncoupled when unloading a truck of anhydrous ammonia. Design, operation, and maintenance controls are in place to prevent this occurrence.  If that were not the case, active mitigation measures consisting of water fogging systems, excess flow valves, and relief valves are in place to limit dispersion and mitigate consequences. Design shows that these mitigation measures would greatly limit a release. With the wind direction of west-north-west which is common for the area, the vapor would disperse over an empty field before reaching a populated area.  This scenario is shown in the second set of dispersion models and is used for the \"alternate scenario\" for anhydrous ammonia as required by section 112(r).  The model suggests a mitigated release with minimal offsite consequences. But with the water fogging system engaged, the distance would be limited considerably..\n\nOnly one scenario, the \"worst-case,\" was done for ammonium hydroxide:\nAmmonium hydroxide handled at the Lathrop plant is an ammonia-water solution (approximately 30% ammonia).  A spontaneous release of the largest tank at the Lathrop plant would result in a spill which would accumulate in the cement containment beneath it.  There would be no off-site consequences other than a possible odor in short proximity.\n\nd) The general accidental release prevention program and chemical-specific prevention steps:\nAll employees assigned to work in the areas where ammonia and ammonium hydroxide are handled are trained in the safe handling of these ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14647,
      "SummaryText": "terials. Employees receive initial training and an annual refresher appropriate to the job when hired or when re-assigned.  The training includes spill control strategies and other methods to avoid accidental releases of hazardous materials.  \n\nAnhydrous ammonia and ammonium hydroxide are used and stored in a small area of the plant and employees assigned to these areas are trained to understand the hazards involved and to handle them safely.  \n\nIn addition to training, the following precautions are taken in areas where ammonia is handled:\n7 Pipes carrying anhydrous ammonia are clearly labeled and have pressure relief valves.  \n7 Ammonia and ammonium hydroxide tanks are blocked to prevent vehicles from striking them.  Vehicle access permits required to enter any area handling hazardous materials.\n7 Material specifications policy is in place to prevent replacing parts with inadequate material.\n7 Scheduled work orders in the computerized maintenance management system (CMMS) serve as preventative maintenance tools to -ensure storage and conveyance integrity, including ammonia tank testing and regular inspections.\n7 Written design review procedures, used whenever changes are made to applicable equipment or piping, prevent failure due to improper engineering of modifications.\n7 Line-breaking and hot work permits are required before starting work.\n7 A hazard analysis is performed before operating any new process that handles ammonia products. Analysis covers all possible scenarios and potential emission points.\n\ne) The five-year accident history:\nIn the specified time period, the Lathrop plant has had no accidental releases of ammonia or ammonium hydroxide with offsite consequences as defined by CFR 68.42.\n\nf) The emergency response program:\nThe J. R. Simplot Company, Lathrop facility has an emergency response team consisting of 18 employees (9 hourly, 5 supervisory, 4 management).  Training is conducted at least once each calendar year and in accordance with CAL-OSHA reg"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14647,
      "SummaryText": "ulations.  The team uses the written Emergency Response Contingency Plan to plan for possible releases at the Lathrop site.  The plan contains instructions for responding to such an emergency including contacts with outside emergency response authorities, emergency response team and chain of command, procedures for evacuation, shut-down/startup, dealing with natural disasters and power losses, and first aid.\n\nAn evacuation plan is in place and evacuation drills are conducted at least once a year.  The release of any regulated substance in a reportable quantity would be reported as required by law and emergency response coordinated with local authorities to ensure the safety of the community.\n\ng) Planned changes to improve safety:\nSafety rules and training are updated on a regular basis to assure that they continue to meet new applicable regulations and that they ensure an adequate level of safety for employees and visitors or contractors on the site.  Safety training is mandatory for all employees and refresher courses on all key areas are planned for each quarter. We are working toward attaining OSHA STAR status. \n\nPlanned overall improvements include increased safety training at hourly and supervisory levels, and a review of the contractor safety program, with emphasis on ammonia handling and associated areas.  \n\nThe J. R. Simplot Company, Lathrop plant, will continue to be vigilant in environmental compliance and safety in all processes, plants, and equipment."
    }
  ]
}