{
  "FacilityID": 14792,
  "FacilityName": "ECONOMY MUD PRODUCTS CO.",
  "FacilityStr1": "435 EAST ANDERSON ROAD",
  "FacilityStr2": null,
  "FacilityCity": "HOUSTON",
  "FacilityState": "TX",
  "FacilityZipCode": "77047",
  "Facility4DigitZipExt": "5016",
  "FacilityCountyFIPS": "48201",
  "LEPC": null,
  "FacilityLatDecDegs": "29.606667",
  "FacilityLongDecDegs": "-95.415",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8087603,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ECONOMY MUD PRODUCTS CO.",
  "OperatorStr1": "P.O. BOX 450246",
  "OperatorStr2": null,
  "OperatorCity": "HOUSTON",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77245",
  "OperatorZipCodeExt": "0246",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153647",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": "1999-07-27 00:00:00",
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "Yes",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.607733,
  "FRS_Long": -95.416329,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20230,
      "AltID": null,
      "FacilityID": 14792,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 25592,
          "ProcessID": 20230,
          "ChemicalID": 12,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20748,
          "ProcessID": 20230,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14792,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": "1999-01-29 00:00:00",
    "ERTrainingDate": "1999-06-07 00:00:00",
    "CoordinatingAgencyName": "HOUSTON FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "7132475000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14792,
      "SummaryText": "EXECUTIVE SUMMARY - ECONOMY MUD PRODUCTS COMPANY\nEconomy Mud Products Company operates a Program 1 process utilizing 23,700 pounds of propylene oxide (75-56-9) in an entirely closed system.  The propylene oxide is stored in a pressure tank built to ASME code specifications.  The tank is filled periodically by tank truck delivery.  The delivery hose is equipped with zero emission coupling.  The tank is equipped with a pressure relief valve and enclosed in a concrete, roofed enclosure.  The roof reduces the likelihood of lightning strikes (metal roof and building structure) and solar radiation heating.  The propylene oxide is piped to a reaction chamber where guar gum and propylene oxide are reacted, totally eliminating all propylene oxide.\n\nRigid accidental release prevention is practiced by providing steel piping from the tank to the reactor.  The reactor controls do not permit releasing propylene oxide if the reaction chamber is open to the atmosphere.  All operating personnel are trained in the dangers of propylene oxide and measures to be taken in the event of a release.\n\nThe management of Economy Mud Products is committed to safety and environmentally aware operations of the plant.  See attached Environment and Safety Policy.  Even though the operation employs only 26 people including office staff, a safety representative is assigned to the plant.\n\nThe worst case scenario is based on releasing the entire contents of the tank, 23,700 pounds, into the building.  Written instructions limit the tank to 85% capacity.  Based on the Offsite Compliance Analysis Guidance Calculation Method, the endpoint radius is 0.06 mile.  Economy Mud Products Co. owns the land within the endpoint circle.  Based on direct field observations, no residences, businesses, churches, schools or parks are within the endpoint circle.  In addition to the Risk Management Plan, the plant operates under a Process Safety Program (OSHA).  No releases have occurred at the facility within the past 5 y"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14792,
      "SummaryText": "ears.\n\nA strong emergency response tie is established with the Houston Fire Department.  They are aware of the presence of Propylene Oxide, its location and our commitment to safe operation.  In the event of an emergency, our employees are instructed to call the Fire Department and not attempt response on there own.  Economy Mud Products Co.has an ongoing safety program.  All supervisors are trained in the operation, maintenance and safety of reaction chamber and raw products storage facilities.\n\n \nCOMMITMENT\n\nEconomy Mud Products Company is committed to protecting the environment in which we conduct our business and the health and safety of our employees and the communities in which we operate.  Each employee and contract employee has a responsibility to contribute to a safe and healthful workplace and to protect the environment,\n\nCOMPLIANCE\n\nEconomy Mud Products Company will conduct its operations in compliance with the spirit as well as the letter of all applicable laws, regulations and standards.  We will work constructively with governmental agencies, trade associations, environmental and safety groups and others to develop equitable laws, regulations and standards to protect the environment and employee health and safety.  Management will commit the funding, manpower and resources necessary to accomplish the objectives of this environmental, health and safety policy.  The failure of employees to comply with applicable laws and regulations may result in disciplinary action, including termination of employment.\n\nPERFORMANCE\n\nEconomy Mud Products Company believes that environmental, health and safety goals need not conflict with economic goals.  Environmental, health and safety goals will be used as one area of accountability in evaluating management as well as employee performance.\n\nPROGRAMS\n\nEconomy Mud Products Company will implement ongoing programs that will include the use of modern technology, periodic health, safety and environmental audits, waste and ris"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14792,
      "SummaryText": "k minimization and contingency planning to monitor and evaluate compliance efforts as well as reduce risks to employees and the environment.\n\nTRAINING\n\nAll employees are to be made aware of our commitment to this policy.  In order to assure compliance with all applicable environmental, health and safety laws and regulations, Economy Mud Products Company will provide appropriate training programs for employees.  Employees are encouraged to become involved in the solutions to any environmental, health and safety issue."
    }
  ]
}