{
  "FacilityID": 14805,
  "FacilityName": "Vitafoam Incorporated - Olympic Plant",
  "FacilityStr1": "4100 Pleasent Garden Road",
  "FacilityStr2": null,
  "FacilityCity": "Greensboro",
  "FacilityState": "NC",
  "FacilityZipCode": "27406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37081",
  "LEPC": "Guilford County LEPC",
  "FacilityLatDecDegs": "35.966667",
  "FacilityLongDecDegs": "-79.766667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AS",
  "FacilityURL": "www.vitausa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39123542,
  "ParentCompanyName": "British Vita PLC.",
  "Company2Name": null,
  "CompanyDUNS": 98770068,
  "Company2DUNS": 0,
  "OperatorName": "Vitafoam Incorporated",
  "OperatorStr1": "4100 Pleasent Garden road",
  "OperatorStr2": null,
  "OperatorCity": "Greensboro",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27406",
  "OperatorZipCodeExt": null,
  "FTE": 220,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000065216",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.00867,
  "FRS_Long": -79.77726,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20245,
      "AltID": "Foam Manufacturing",
      "FacilityID": 14805,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 25607,
          "ProcessID": 20245,
          "ChemicalID": 77,
          "Quantity": 2040000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 20763,
          "ProcessID": 20245,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 8148,
              "Process_NAICS_ID": 20763,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-12-15 00:00:00",
              "ChangeCompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1998-10-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-11 00:00:00",
              "EquipmentTested": "Daily inspection of TDI lines while unloading and prior to production to check for leaks",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8523,
                  "PreventionProgram2ID": 8148,
                  "ProcessChemicalID": 25607
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 14805,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1998-10-15 00:00:00",
    "CoordinatingAgencyName": "Pleasant Garden Fire Department",
    "CoordinatingAgencyPhone": "3366745619",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14805,
      "SummaryText": "A.  Description of Stationary Source and Regulated Substances Handled\n\nVitafoam Incorporated is a flexible polyurethane foam manufacturing facility located in Greensboro, North Carolina.  As a result of the manufacturing process, the following regulated chemicals are present at the facility in quantities that exceed the threshold quantities specified by EPA regulations: toluene diisocyanate (TDI) (10,000 pounds).  The facility has one covered process that requires the facility meet Program 2 requirements of the Risk Management Program (RMP) regulations.  \n\nTDI is delivered to the facility via railcars and offloaded into storage tanks.  In the process, TDI is used in the production of polyurethane foam. The facility manufactures polyurethane foam by the vigorous mechanical mixing of polyols with TDI along with water, catalyst and surfactants.  The resultant polymeric network is expanded with carbon dioxide which is formed in the reaction between the water and TDI.\n \nB. Accidental Release Prevention & Emergency Response Policies of Vitafoam\n\nVitafoam is committed to protecting facility personnel, the public and the environment from any workplace and accidental release hazards.  Appropriate responses to releases of TDI are documented in the Section 7 of the Risk Management Program document.  Safety, environmental protection and risk management programs are fully implemented and coordinated with community emergency responders for emergency planning and response efforts.\n\nC. Release Scenario Discussion\n\nIn accordance with the requirements of the RMP regulations each owner or operator of a stationary source is required to perform the following offsite consequence analyses.\n7 One worst-case release scenario to represent all regulated toxic substances held in excess of the threshold quantity.  A worst-case scenario was conducted TDI.\n7 One alternative release scenario for each regulated toxic substance held in excess of the threshold quantity.  An alternative scenario was c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14805,
      "SummaryText": "alculated for TDI.\nThe following are brief descriptions of the release scenarios that are being submitted by Vitafoam.   Vitafoam elected to use the ALOHA model to calculate estimated release rates and to determine the distances to the TDI endpoint.  Vitafoam evaluated a worst-case scenario and an alternative scenario for inclusion in the Risk Management Plan (RMPlan).  More detailed information is provided in Sections 2 and 3 of the RMPlan. \n\nToxic Chemicals\nWorst-Case Release Scenario\n\nThe worst-case toxic release scenario for Vitafoam was determined to be an instantaneous liquid spill and vaporization of TDI from a 20,000 gallon (204,000 lbs) railcar.  A major release of this magnitude is extremely unlikely due to the advances that have taken place in railcar design.  The ALOHA model was used to estimate the distance to the toxic endpoint.  The results are presented in section 2 of the RMPlan.\n\nIn addition to evaluating the release from an outdoor railcar, Vitafoam also evaluated the largest vessel (30,000 gallon storage tank).  The distance to the toxic endpoint for this scenario was less than the distance to the toxic endpoint for the railcar.\n\nAlternative Release Scenarios\nThe alternative release scenario for TDI was determined to be the shearing off of an unloading hose during unloading resulting in a small liquid spill.  The unloading process is always conducted under observation.  The results are presented in the section 3 of the RMPlan.  The amount released and the distance to the toxic endpoint for the alternative scenario were less than the minimum allowed for input by the RMPSubmit software.\n\nD. Five-year Accident History\n\nUnder the EPA RMP regulations, an accidental release is defined as a release of a regulated substance that \"resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\"  Within the past five years, Vitafoam has had "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14805,
      "SummaryText": "no accidents that meet these requirements.\n\nE.  Management System\n\nVitafoam has a management program in place that assigns overall responsibility for the development and implementation of the Risk Management Program (RMProgram) to a qualified individual or position of responsibility.  It clearly delineates accountability and responsibilities for any elements where responsibilities are delegated.\n\nF. Prevention Program Elements\n\nSafety Information - Up-to-date process safety information is maintained for use by employees operating the covered process in accordance with 40 CFR 68.48, including the following:\n7 The MSDS for TDI that contains toxicity information, permissible exposure limits, physical data, reactivity data, thermal and chemical stability data and synergistic effects from mixing process flows.\n7 Block flow diagrams for the covered process.\n7 Process chemistry and maximum intended inventory data for the covered process.\n7 Safe operating limits and evaluation of consequences of deviations from these limits for the covered process.\n7 Covered process equipment information consisting of materials of construction; piping and instrumentation diagrams (P&IDs); electrical classification; relief system design and design basis; ventilation system design; design codes and standards employed; and safety systems (interlocks, detection or suppression systems).\n\nHazard Review - A hazard review has been performed for the TDI covered process at Vitafoam in accordance with 40 CFR 68.50.  The hazard review was performed using What-If/ Checklists.  The hazard review identified the hazards associated with the regulated TDI process; causes of potential accidental release scenarios; safeguards used to prevent accidental releases; and methods used to detect, monitor or control accidental releases.  Any issues identified during the PHA were documented and will be resolved in a timely manner.  The hazard review will be revalidated and updated once every five years following comple"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14805,
      "SummaryText": "tion of the initial hazard review.\n\nOperating Procedures - Detailed and up-to-date process operating procedures have been developed and are maintained for each covered process in accordance with 40 CFR 68.52.  Operating procedures provide clear instructions for safely conducting activities involving a covered process in a manner consistent with process safety information and are readily accessible to employees involved in a covered process.  Operating procedures are reviewed annually to ensure that they remain current and accurate.\nOperating procedures cover each operating phase of the covered process including initial system startup, normal operation, temporary operations, emergency shutdown and conditions when required, emergency operations, normal shutdown and startup following a turnaround or emergency shutdown.  Operating procedures also incorporate or reference relevant process safety information including the following:\n7 Process Operating Limits (including consequences of deviations and steps to correct or avoid such deviations).\n7 Safety and health considerations (including properties and hazards of covered chemicals, precautions necessary to prevent exposure, control measures to be taken upon physical contact or airborne exposure, quality control for raw materials, and control of regulated substance inventories).\n7 Safety systems and their functions.\n\nTraining - New employees working with a covered process receive initial training in accordance with 40 CFR 68.54.  The training includes an overview of the process and emphasizes process operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown.  Those employees already involved in operating or maintaining a covered process prior to 21 June 1999 have been certified in writing as having \"the required knowledge, skills, and abilities to safely carry out the duties and responsibilities as specified in the operating procedures\".\nRefresher training is provide"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14805,
      "SummaryText": "d at a minimum of every three years to all employees involved in working with a covered process.  Documentation is maintained for each employee to ensure that he or she received and understood the required training.\n\nMaintenancey - A maintenace program has been developed in accordance with 40 CFR 68.56 for covered process equipment.  Employees involved in the maintenance of covered processes receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure that the employee can perform the job in a safe manner.\n\nWritten procedures have been developed to ensure that covered process equipment is properly maintained, tested, and inspected at regular, scheduled intervals and that such activities are thoroughly documented.  Maintenance, inspection and testing procedures and frequencies are consistent with applicable manufacturer's recommendations and follow accepted engineering practices.  Any equipment deficiencies identified during maintenance, inspection or testing are corrected in a safe and timely manner.  The mechanical integrity program also includes a quality assurance program\n\nCompliance Safety Audits - RMP compliance is confirmed through safety audits that are performed at least once every three years in accordance with 40 CFR 68.58.  The audits are completed by at least one person knowledgeable in the process.  A report of the findings is generated following the audit, and all deficiencies and/or recommendations are promptly addressed and the resolution is documented.  The two most recent safety audit reports are maintained at the facility.\n\nIncident Investigation - Specific incident investigation, reporting, and documentation procedures have been implemented and are followed in accordance with 40 CFR 68.60 in response to any incident involving a covered process that did or could have reasonably resulted in a catastrophic release of a regulated substance.  Under EPA RMP, a catastrophic release is defined a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 14805,
      "SummaryText": "s a major uncontrolled emission, fire, or explosion involving one or more regulated substances that presents imminent and substantial endangerment to public health and the environment.  \n\nThe incident investigation procedure is initiated as soon as possible and no later than 48 hours following any incident.  A team is established to perform the incident investigation and always includes at least one person knowledgeable in the process, a contract employee if the incident involves work by a contractor, and other persons with appropriate qualifications to investigate an accident.\nFollowing the investigation, a written report is prepared summarizing the following information at a minimum: date of the incident; date the investigation began; description of the incident and any contributing factors; and any recommendations resulting from the investigation.  When completed, all affected personnel including contract employees review the report.  Incident investigation reports are maintained at the facility for a minimum of five years.\n\n G. Emergency Response Program\n\nVitafoam has an emergency response program that includes an emergency response plan addressing all  RMP regulated substances present at the facility.  The emergency response plan includes:\n7 Procedures for informing the Guilford County LEPC and the community about any accidental releases;\n7 Documentation of first-aid and emergency medical treatment necessary to treat accidental exposures; and\n7 Procedures for emergency response after and accidental release of a regulated substance.\nThe emergency response plan is reviewed annually to reflect changes at the facility and ensure that employees are informed of the changes.  The emergency response program includes procedures for the use of on-site emergency response equipment and for its inspection, testing and maintenance.  Employees are trained periodically on emergency response procedures.  \n\nH. Planned Changes to Improve Safety\n\nIn an effort to improve safety and"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 14805,
      "SummaryText": " to reduce the risk of accidental releases, changes to the RMProgram and the facility have been implemented.  These improvements were identified either as risk reduction measures during the hazard review or as a result of an improved RMProgram and the dedication to an inherently safer process."
    }
  ]
}