{
  "FacilityID": 14925,
  "FacilityName": "Crider Poultry, Inc. - Stillmore, GA (Propane)",
  "FacilityStr1": "1 Plant Ave. & Hwy 57 S",
  "FacilityStr2": null,
  "FacilityCity": "Stillmore",
  "FacilityState": "GA",
  "FacilityZipCode": "30464",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13107",
  "LEPC": null,
  "FacilityLatDecDegs": "32.426944",
  "FacilityLongDecDegs": "-82.212222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "W A Crider",
  "OperatorStr1": "PO Box 25",
  "OperatorStr2": null,
  "OperatorCity": "Metter",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30439",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Twyford",
  "RMPTitle": "Facility Engineer",
  "FTE": 565,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153558",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "PIHS, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": "1999-07-27 00:00:00",
  "ReceiptDate": "1999-07-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-01 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.42694,
  "FRS_Long": -82.21222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20484,
      "AltID": "Propane",
      "FacilityID": 14925,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21016,
          "ProcessID": 20484,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25961,
          "ProcessID": 20484,
          "ChemicalID": 98,
          "Quantity": 111000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525961,
          "ProcessID": 20484,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 20485,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 14925,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21017,
          "ProcessID": 20485,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25962,
          "ProcessID": 20485,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525962,
          "ProcessID": 20485,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14925,
      "SummaryText": "                                                                 RMP Executive Summary\n\n1.0  Accidental release prevention and emergency response policies at Crider Poultry, Inc. - Stillmore ('68.155(a) ).\n\n1.1  Crider Poultry, Inc. - Stillmore prevents accidental releases of ammonia through on the job training of refrigeration personnel and ongoing inspection and maintenance of the refrigeration system.  Refrigeration system components are located in areas that are not as likely to become damaged (i.e., tanks placed away and protected from forklift and truck traffic).\n\n1.2  Crider Poultry, Inc. - Stillmore prevents accidental releases through on the job training of propane system maintenance personnel and annual inspection and maintenance of the propane system.  Propane system components are located in areas that are not as likely to become damaged (i.e., tanks and pipe runs are placed away and protected from truck traffic).\n\n2.0  Source and regulated substances handled ('68.155(b)).\n\nApproximately 16,500 lbs. of anhydrous ammonia is contained within the original refrigeration system and approximately 11,500 lbs. of anhydrous ammonia is contained in the new refrigeration system on site at Crider Poultry, Inc. - Stillmore.  Approximately 111,000 lbs. of propane is contained in the storage vessel on site.  The EPA requires a Risk Management Plan be developed and maintained when the total amount of anhydrous ammonia or propane exceeds the threshold quantity of 10,000 lbs.  No other substances, in quantities subject to EPA RMP certification requirements, are located at the Crider Poultry, Inc. - Stillmore facility.\n\n3.0  Ammonia Worst Case and Alternate Case Release Scenarios ('68.155(c)).\n\n3.1  Worst Case Scenario (WCS)\n\n3.1.1 The new high pressure receiver (installed in June 1999), located outside the new equipment room, contains the largest quantity of anhydrous ammonia, on site, on a predictable worst case basis.  This tank is typically 15 to 30% full during normal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14925,
      "SummaryText": " operations.  During plant shutdown or partial operations, this tank holds approximately 10,600 lbs. of anhydrous ammonia when 50% full, under an internal pressure and temperature of approximately 114 psig and 70 0F.  The Worst Case Scenario as required by EPA, assumes that the tank's contents are fully released as a gas/vapor over a 10-minute period.\n\n3.1.2  The dispersion model, Degadis, predicted, with a wind speed of 3 mph and atmospheric stability class F, the anhydrous ammonia release may travel 2.0 miles from the point of release (See: Appendix B).  Approximately 220 people, in the surrounding community, according to Landview Census data, reside within the radius to the toxic endpoint (level of concern = 200 ppm, anhydrous ammonia).  There are residences, one school, and one church within the radius to the toxic endpoint.  (See: Section 9.0)  There are no environmental receptors within the radius to the toxic endpoint. \n\n3.2  Alternate Case Scenario (ACS)\n\n3.2.1  The Alternate Case, more likely, Release Scenario for Crider Poultry, Inc. - Stillmore was selected to involve a relief valve release on a condenser located above the new equipment room.  Anhydrous ammonia (at approximately 150 psi and 77 0F) was estimated to have a flow rate from the relief valve (inner orifice diameter: 0.75 inches) of approximately 71 lbs./min., determined from an ammonia gas release table.  It is estimated that the relief valve could be isolated, or the overpressure condition corrected, in approximately 10 minutes by trained operators on site, with a corresponding anhydrous ammonia quantity released of approximately 710 lbs.\n\n3.2.2  The air dispersion model, Degadis, predicted, with a wind speed of 6 mph and atmospheric stability class D, that the anhydrous ammonia release may travel approximately 0.18 miles.  Approximately 5 people, in the surrounding community, according to Landview Census data, reside within the radius to the toxic endpoint (level of concern = 200 ppm, anhydro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14925,
      "SummaryText": "us ammonia).  There are no other public or environmental receptors within the radius to the toxic endpoint.\n\n4.0  Propane Worst Case and Alternate Case Release Scenarios ('68.155(c)).\n\n4.1  Worst Case Scenario (WCS)    \n\n4.1.1  The propane storage tank, located at the southwest corner of the property, contains the largest quantity of propane, on site, on a predictable worst case basis.  This tank holds approximately 111,000 lbs. of propane when 88% full.  The Worst Case Scenario as required by EPA, assumes that the tank's contents are fully released as a vapor cloud followed by ignition.\n\n4.1.2  The vapor cloud explosion model, Archie, predicted the propane vapor cloud explosion endpoint (1 psi overpressure) may extend to 0.38 miles from the point of release (See: Appendix B).  Approximately 10 people, in the surrounding community, according to Landview Census data, reside within the radius to the explosion endpoint of 1 psi-overpressure.  There are no other public or environmental receptors within the radius to the explosion endpoint.\n\n4.2  Alternate Case Scenario (ACS)\n\n4.2.1  The Alternate Case Release Scenario for Crider Poultry, Inc. - Stillmore was selected to involve three of the four relief valves lifting on the propane storage tank.  Propane was estimated to have a flow rate from the relief valves (each having an inner orifice diameter: 2.5 inches) of approximately 2,589 lbs./min., determined from an EPA propane relief valve discharge table.  The overpressure scenario condition was estimated to be relieved in approximately 5 minutes.  The resulting vapor cloud could contain approximately 12,945 lbs.\n\n4.2.2  The vapor cloud explosion model, RMPComp, predicted the propane vapor cloud explosion endpoint may extend to 0.12 miles from the point of release (See: Appendix B).  Approximately 5 people, in the surrounding community, according to Landview Census data, reside within the radius to the explosion endpoint of 1 psi overpressure.  There are no other public "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 14925,
      "SummaryText": "or environmental receptors within the radius to the explosion endpoint.\n\n5.0  Accidental release prevention program ('68.155(d)).\n\n5.1  Crider Poultry, Inc. - Stillmore performs daily monitoring and inspection of the anhydrous ammonia refrigeration system.  System modifications and repairs are made by qualified contracted service personnel, in accordance with OSHA and IIAR  guidelines.  Accidental release prevention practices at Crider Poultry, Inc. - Stillmore include:\n\n7 Development of a PSM Program.\n7 Refrigeration system repairs made in a prompt, safe manner.\n7 Upgrading ammonia system components.\n7 Installation of a centralized PC based control system.\n\n5.2  Crider Poultry, Inc. - Stillmore performs daily monitoring and of the propane system by employees. Annual inspections and maintenance are performed by qualified contracted service personnel, in accordance with OSHA and NFPA 58  guidelines.  Accidental release prevention practices at Crider Poultry, Inc. - Stillmore include:\n\n7 Annual preventative maintenance and inspections.\n7 Propane system repairs made in a prompt, safe manner.\n7 Labeling of propane system tanks and components.\n7 Safe work practices followed.\n\n6.0  5 year accidental history ('68.155(e)).\n\nNo releases or accidents, involving anhydrous ammonia or propane, that are reportable in accordance with 40 CFR Part 68 (RMP Rule), have occurred at this facility.\n\n7.0  Emergency response program ('68.155(f)).\n\n7.1  During normal workday operations, the facility emergency response plan consists of employee notification (continuous, high pitch alarm) and evacuation, followed by notification of Stillmore Volunteer Fire Department by dialing \"9-1-1\".  The Stillmore Fire Department can perform rescue and evacuations during a hazardous material spill or release, but do not have HAZMAT trained personnel.  In the event that HAZMAT response was required, a HAZMAT contractor would be called in.  \n\n7.2  Red Cross shelter resources in the Stillmore area consist of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 14925,
      "SummaryText": " pre-arranged service agreements with the local school board and some local churches.  Schools and churches that would serve as a Red Cross shelter would have food, cots, and first aid supplies on site and reserve supplies would be shipped in.  An authority official (HAZMAT Team, Fire Department, Police Department, etc.) would decide if sheltering in place or evacuation and sheltering is required in a given emergency.  They would then contact the Red Cross to activate the shelter(s) determined to be located at a safe distance from the hot area.  Those in need of medical attention would be taken to a nearby hospital.  Reference:  Red Cross Office of Emanuel County, Erin Healy, Emergency Services, (912) 651-5300.\n\n8.0  Planned changes to improve safety ('68.155(g)).\n\n8.1  Future plans to improve anhydrous ammonia refrigeration system safety at Crider Poultry, Inc. - Stillmore consist of:\n\n7 Completing the PSM program.\n7 Updating the Emergency Response Plan.\n7 Coordinating the emergency response plan with a contracted HAZMAT team and the Stillmore Volunteer Fire Department.\n7 Annual hazardous materials technician and incident commander training. \n\n8.2  Future plans to improve propane system safety at Crider Poultry, Inc. - Stillmore consist of:\n\n7 Completing EPA prevention program elements, and correcting the program system deficiencies identified by Combustion Services, Inc."
    }
  ]
}