{
  "FacilityID": 14920,
  "FacilityName": "Crider Poultry, Inc. - Licolnton",
  "FacilityStr1": "2660 Double Branches Road",
  "FacilityStr2": null,
  "FacilityCity": "Licolnton",
  "FacilityState": "GA",
  "FacilityZipCode": "30817",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13181",
  "LEPC": null,
  "FacilityLatDecDegs": "33.776111",
  "FacilityLongDecDegs": "-82.401111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "W A Crider",
  "OperatorStr1": "PO Box 25",
  "OperatorStr2": null,
  "OperatorCity": "Metter",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30439",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Twyford",
  "RMPTitle": "Director of Engineer",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153497",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-05 00:00:00",
  "SafetyInspectionBy": "PIHS, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-27 00:00:00",
  "ErrorReportDate": "1999-07-27 00:00:00",
  "ReceiptDate": "1999-07-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-01 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2001-05-24 00:00:00",
  "DeRegistrationEffectiveDate": "1999-08-18 00:00:00",
  "AnniversaryDate": "2004-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.77468,
  "FRS_Long": -82.39982,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20478,
      "AltID": "Propane",
      "FacilityID": 14920,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21010,
          "ProcessID": 20478,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 25955,
          "ProcessID": 20478,
          "ChemicalID": 98,
          "Quantity": 220000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 525955,
          "ProcessID": 20478,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 14920,
      "SummaryText": "                                                                   RMP Executive Summary\n\n1.0  Accidental release prevention and emergency response policies at Crider Poultry, Inc. ('68.155(a) ).\n\nCrider Poultry, Inc. prevents accidental releases through on the job training of propane system maintenance personnel and annual inspection and maintenance of the propane system.  Propane system components are located in areas that are not as likely to become damaged (i.e., tanks and pipe runs are placed away and protected from truck traffic).\n\n2.0  Source and regulated substances handled ('68.155(b)).\n\nApproximately 220,000 lbs. of propane is contained within the propane system on site at Crider Poultry, Inc.  The EPA requires a Risk Management Plan be developed and maintained when the total amount of propane exceeds the threshold quantity of 10,000 lbs.  No other substances, in quantities subject to EPA RMP certification requirements, are located at the Crider Poultry, Inc. facility.\n\n3.0  Worst Case and Alternate Case Release Scenarios ('68.155(c)).\n\n3.1  Worst Case Scenario (WCS)    \n\n3.1.1  The propane storage tanks, located at the southeast corner of the property, along Double Branches Road contains the largest quantity of propane on site, on a predictable worst case basis.  These tanks hold approximately 111,000 lbs. of propane each when 88% full.  The Worst Case Scenario as required by EPA, assumes that one tank's contents are fully released as a vapor cloud followed by ignition.\n\n3.1.2  The vapor cloud explosion model, Archie, predicted the propane vapor cloud explosion endpoint (1 psi overpressure) may extend to 0.38 miles from the point of release (See: Appendix B).  Approximately 20 people, in the surrounding community, reside within the radius to the explosion endpoint of 1 psi-overpressure.  Public receptors affected include only residences and no environmental receptors lie within the radius to the explosion endpoint.\n\n3.2  Alternate Case Scenario (ACS)\n\n3.2"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 14920,
      "SummaryText": ".1 The Alternate Case Release Scenario for Crider Poultry, Inc. was selected to involve one relief valve lifting on one of the propane storage tanks.  Propane (at approximately 250 psi) was estimated to have a flow rate from the relief valves (inner orifice diameter: 4.0 inches) of approximately 1,432 lbs./min., based on the design air flow rate through the valve.  The overpressure scenario condition was estimated to be relieved in approximately 5 minutes.  The resulting vapor cloud could contain approximately 7,160 lbs.\n\n3.2.2  The vapor cloud explosion model, RMPComp, predicted the propane vapor cloud explosion endpoint (1 psi overpressure) may extend to 0.1 miles from the point of release (See: Appendix B).  Approximately 5 people, in the surrounding community, reside within the radius to the explosion endpoint of 1 psi overpressure.  Public receptors affected include only residences and no environmental receptors lie within the radius to the explosion endpoint. \n\n4.0  Accidental release prevention program ('68.155(d)).\n\nCrider Poultry, Inc. standard policy requires daily monitoring and annual inspection of the propane system by trained employees, or contracted services personnel, in accordance with OSHA and NFPA 58  guidelines.  Accidental release prevention practices at Crider Poultry, Inc. include:\n\n7 Annual preventative maintenance and inspections.\n7 Propane system repairs made in a prompt, safe manner.\n7 Labeling of propane system tanks and components.\n7 Safe work practices followed.\n\n5.0  5 year accidental history ('68.155(e)).\n\nNo releases or accidents, involving propane, that are reportable in accordance with 40 CFR Part 68 (RMP Rule), have occurred at this facility.\n\n6.0  Emergency response program ('68.155(f)).\n\n6.1  During normal workday operation, the facility emergency response plan consists of employee notification (continuous, high pitched alarm), followed by notification of the Martin Cross Road Fire Department by dialing \"9-1-1\".   During off-hou"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 14920,
      "SummaryText": "rs, security guards will call the fire department if an emergency should arise.\n\n6.2  The Red Cross of Wilkes County is the closest chapter to Lincolnton, Georgia.  Local schools and some churches that would serve as a Red Cross shelter may have limited food and first aid supplies on site, but cots would need to be shipped in from either Wilkes County or Augusta, along with emergency service vehicles.  Both locations are approximately 30 miles away and may take two hours to respond to an emergency in Lincolnton.  The Fire or Police Chief would decide if sheltering in place or evacuation and sheltering is required in a given emergency.  If evacuation is needed, the Red Cross would then activate a shelter(s) determined to be located at a safe distance from the hot area.  Those in need of medical attention would be taken to a nearby hospital.  Reference:  Bob Simmons, Director, Red Cross Office of Wilkes County, Georgia, (706) 678-4650. \n\n7.0  Planned changes to improve safety ('68.155(g)).\n\nFuture plans to improve propane system safety at Crider Poultry, Inc. consist of:\n7 Operator training for the propane system. \n7 Completing EPA prevention program elements on an on going basis."
    }
  ]
}