{
  "FacilityID": 1499,
  "FacilityName": "City of Decatur Raw Water Pump Station",
  "FacilityStr1": "FM 1658 at Lake Bridgeport Dam",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeport",
  "FacilityState": "TX",
  "FacilityZipCode": "76426",
  "Facility4DigitZipExt": "6122",
  "FacilityCountyFIPS": "48497",
  "LEPC": "Wise County LEPC",
  "FacilityLatDecDegs": "33.223333",
  "FacilityLongDecDegs": "-97.829167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": "rwswtp@wf.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "The City of Decatur, Texas",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The City of Decatur, Texas",
  "OperatorStr1": "201 East Walnut Street",
  "OperatorStr2": "P.O. Box 478",
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76234",
  "OperatorZipCodeExt": "0478",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000017992",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-01 00:00:00",
  "AnniversaryDate": "2004-06-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.4",
  "FRS_Lat": 33.2235,
  "FRS_Long": -97.83,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1626,
      "AltID": "Treat raw lake water",
      "FacilityID": 1499,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1730,
          "ProcessID": 1626,
          "ChemicalID": 62,
          "Quantity": 2500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1649,
          "ProcessID": 1626,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1195,
              "Process_NAICS_ID": 1649,
              "SafetyReviewDate": "1999-05-05 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-05 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-05 00:00:00",
              "TrainingReviewDate": "1999-05-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-05 00:00:00",
              "EquipmentInspectionDate": "1999-05-05 00:00:00",
              "EquipmentTested": "Chlorine cylinders, valves, piping.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-05-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1211,
                  "PreventionProgram2ID": 1195,
                  "ProcessChemicalID": 1730
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1499,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-05 00:00:00",
    "ERTrainingDate": "1999-05-05 00:00:00",
    "CoordinatingAgencyName": "Lake Bridgeport Fire Department",
    "CoordinatingAgencyPhone": "9406832700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1499,
      "SummaryText": "Executive Summary - Lake Bridgeport Raw Water Pump Station\nOperated by the City of Decatur, Texas\n\n1. Accidental Release Prevention and Emergency Response Policies\nWe at City of Decatur (Lake Bridgeport) Raw Water Pump Station are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with Lake Bridgeport Fire Department that provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2. The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass pumping lake water to the City of Decatur Water Treatment Plant.  The only regulated substance present at our facility is chlorine.  Chlorine is used for primary treatment of the raw lake water prior to pumping to the treatment plant in Decatur.  The maximum inventory of Chlorine at our facility is approximately 2,500.00 pounds.\n \n3. The Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the \"RMP* Comp\" computer program, version 1.06.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release of chlorine from the storage cylinders at the facility.  The scenario involves the release of 2,500 pounds of chlorine in a gaseous"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1499,
      "SummaryText": "form over a 10-minute duration.  A natural passive mitigation control exists, as the facility is located at the base of the dam that provides a natural barrier for air dispersion of a toxic gas cloud.  This fact was taken into account to calculate the scenario.  At Class F atmospheric stability and 1.5 meters per second windspeed, the maximum distance of 1.5 miles is obtained corresponding to a toxic endpoint for chlorine of 0.0087 milligrams per liter (mg/L).\n\nOne alternative release scenario has been submitted for each toxic substance present in Program 2 and Program 3 processes cumulatively.  \n\nThe alternative release scenario for chlorine involves a release from the chlorine cylinder storage area at the facility.  The scenario involves the release of 250 pounds of chlorine in a gaseous form over a 10-minute duration.  Passive mitigation controls include the facility being located at the base of the dam are taken into account to calculate the scenario.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of chlorine is 0.1 miles.\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition along with meeting ASTM and ASME specifications and codes.  Our facility is also subject to EPCRA Section 302 notification requirements.    The following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\nProcess Safety Information\n\nThe City of Decatur Raw Water Pump Station maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to en"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1499,
      "SummaryText": "sure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is based on Chlorine Institute guidance documents and procedures.  The studies are undertaken by qualified personnel with expertise in engineering and process operations and are revalidated as part of our regular maintenance inspection program.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, the City of Decatur Raw Water Pump Station maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after maintenance.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\nThe City of Decatur Raw Water Pump Station has a comprehensive training program in place to ensure that employees who are operating facility equipment are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\n\nMechanical Integrity\n\nThe City of Decatur Raw Water Pump Station carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment inspected includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance inspections are corrected in a safe and timely manner.\n\nManagement of Change\n\nWritten procedures are in place a tthe City of Decatur Raw Water Pump Station to manag"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1499,
      "SummaryText": "e changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the City of Decatur Raw Water Pump Station.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n\nThe City of Decatur Raw Water Pump Station conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n\nThe City of Decatur Raw Water Pump Station promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\n\nThe City of Decatur Raw Water Pump Station truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\n\nOn occasion, we hire contractors to conduct specialized maintenance"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1499,
      "SummaryText": "and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The City of Decatur Raw Water Pump Station has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5. Five-year Accident History\nThe City of Decatur Raw Water Pump Station has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6. Emergency Response Plan\nThe City of Decatur Raw Water Pump Station carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Wise County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7. Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  More thorough and more frequent equipment inspection procedures are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemented by July 1999.\n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1499,
      "SummaryText": "formation, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName: Doyle Green\n\nSignature:\n\nTitle: Water & Wastewater Superintendent\n\nDate signed:"
    }
  ]
}