{
  "FacilityID": 15111,
  "FacilityName": "Big Island Water Works",
  "FacilityStr1": "2425 First Street",
  "FacilityStr2": null,
  "FacilityCity": "Sandusky",
  "FacilityState": "OH",
  "FacilityZipCode": "44870",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39043",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "41.450556",
  "FacilityLongDecDegs": "-82.668889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "sanduskywater@sanduskyohio.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Sandusky, Ohio",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Sandusky, Ohio",
  "OperatorStr1": "222 Meigs Street",
  "OperatorStr2": null,
  "OperatorCity": "Sandusky",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44870",
  "OperatorZipCodeExt": null,
  "RMPContact": "Earl Wilkinson, P.E.",
  "RMPTitle": "City Engineer",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089138",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-07-16 00:00:00",
  "DeRegistrationEffectiveDate": "2012-07-10 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.44997,
  "FRS_Long": -82.67119,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20790,
      "AltID": "Chlorine",
      "FacilityID": 15111,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21340,
          "ProcessID": 20790,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26420,
          "ProcessID": 20790,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526420,
          "ProcessID": 20790,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15111,
      "SummaryText": "                        EXECUTIVE SUMMARY FOR THE CITY OF\n                      SANDUSKY'S BIG ISLAND WATER WORKS\n                               RISK MANAGEMENT PLAN\n\n\nGENERAL\n\nThe  Sandusky  Big Island Water Works is a municipally-owned  and\noperated  water purification facility.  Chlorine is used  in  the\npotable  water treatment process for disinfection.  The  existing\nchlorination system utilizes gaseous chlorine and is comprised of\nequipment in the Chlorine Building.  The City routinely maintains\n8,000  to  16,000 pounds of chlorine on site and is  required  to\ncomply with RMP regulations.\n\nChlorine  is delivered to the Big Island Water Works in  one  ton\nsteel  containers or cylinders.  A loading area is provided  just\nnorth  of the Chlorine Building to unload full cylinders  from  a\ndelivery truck into storage.  Full cylinders are removed from the\ndelivery truck using a fork lift and are set below a monorail and\nhoist   for  transporting  into  the  Chlorine  Building.   Empty\ncylinders  are loaded onto the truck for return to  the  chlorine\nsupplier  in a similar manner.  Outdoor storage of full or  empty\nchlorine  containers  is  prohibited by current  plant  operating\npractices.\n\nChlorine  gas  is  supplied under pressure to both  a  dual  pre-\nchlorination unit and a dual post-chlorination unit and is  mixed\nwith water to produce a chlorine solution.  Chlorine solution  is\nsupplied  under pressure to the filter effluent piping and  to  a\nrapid  mix  chamber for disinfection purposes.  Typical  chlorine\nfeed  rates  are 150 lbs/day for pre-chlorination and 50  lbs/day\nfor post-chlorination.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe  Sandusky Big Island Water Work's approach to chemical safety\nfocuses  on  training and safety awareness.  Plant operators  are\nannually  trained on operational and safety practices  associated\nwith  chlorine and chlorine feed equipment.  The training program\ncurrently   utilizes  presentations  by  lo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15111,
      "SummaryText": "cal  chlorine   supply\nprofessionals  to routinely refresh operators' understanding  and\nknowledge  base  on  the  safe handling procedures  and  accident\nprevention procedures for chlorine.  The Sandusky Water Plant  is\na  secure  facility and only authorized plant personnel  maintain\nand handle the chlorine containers and feed equipment.\n\nBecause of the City's commitment to safety and implementation  of\nsafe  procedures  for  the  chlorine  facilities,  new  policies,\nprocedures  and  instructional programs have  been  developed  in\nconjunction with completion of this Risk Management Plan.  A new,\nupdated Emergency Response Plan has been prepared.  The City will\ncontinue  to coordinate with the City of Sandusky Fire Department\nin  this  regard  and  will  have better  defined  procedures  in\nconjunction  with  its participation.  A new management  program,\ntraining program and Operations and Maintenance Manual have  also\nbeen  developed and will be utilized by the Water Plant staff  to\nsafely  manage and operate the chlorine facilities  in  the  near\nfuture.\n\n\nWORST-CASE RELEASE SCENARIO\n\nThe worst case scenario assumes the complete release of a one ton\nchlorine  cylinder within the prescribed 10 minute  period.   The\nmodel  used for this scenario is USEPA's RMP Comp.  The  distance\nto the worst case scenario endpoint would be 1.65 miles.  Passive\nmitigation  factors  were  used in the  RMP  Comp  model  as  all\nchlorine is stored indoors.\n\nALTERNATIVE RELEASE SCENARIO\n\nThe alternative release scenario assumes a feed line leak from  a\none ton cylinder in service.  For this scenario, a total of 1,845\npounds  of  chlorine would be released over a 15  minute  period.\nThe distance to the endpoint would be 0.5 miles.\n\n\nACCIDENTAL  RELEASE  PREVENTION  PROGRAM  AND  CHEMICAL  SPECIFIC\nPREVENTION STEPS\n\nThe  Sandusky Big Island Water Works complies with the OSHA Rules\nand Regulations with respect to the Accidental Release Prevention\nProgram.   Chemical specific preventio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15111,
      "SummaryText": "n steps include  compliance\nwith  all Ohio EPA requirements , Recommended Standards for Water\nWorks,   1997  (Ten  State  Standards)  and  Chlorine   Institute\nStandards  and Regulations Concerning Chlorination Equipment  and\nFacilities for Public Water Supplies.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe  Sandusky  Big  Island  Water Works  has  had  no  accidental\nreleases of chlorine in the past five years.  There have been  no\naccidental  chlorine releases in the known history of  the  plant\nwhich resulted in injury to off-site personnel or evacuations.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe  key element of the Emergency Response Program is the written\nEmergency Response Plan on file at the Water Treatment Plant  and\nat  offices  of the City in downtown Sandusky.  The written  Plan\nincludes  a  Quick Reference Guide which allows  an  operator  to\nimmediately and positively act in case of an observed or detected\nchlorine   leak.   The  Erie  County  Local  Emergency   Planning\nCommittee  is  the  overall  coordinator  of  emergency  response\nservices.  The City will maintain its current approach  to  first\ncontact  the  City  of Sandusky Fire Department  in  case  of  an\nemergency  as  part of the County's current program.   Additional\nnotification procedures are also defined.\n\nThe  Emergency  Response  Plan  includes  first  aid  procedures,\nmedical  management  of chlorine exposure information,  emergency\nresponse  training and pre-emergency coordination guidelines.   A\nsummary  of emergency chlorine leak response procedures  is  also\nincluded.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe  City  of  Sandusky has committed to review  and  follow  the\nguidelines  presented  in the Emergency Response  Plan,  Training\nProgram and Management Program."
    }
  ]
}