{
  "FacilityID": 15145,
  "FacilityName": "Fall River Water Filtration Plant",
  "FacilityStr1": "1831  Bedford Street",
  "FacilityStr2": null,
  "FacilityCity": "Fall River",
  "FacilityState": "MA",
  "FacilityZipCode": "02723",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25005",
  "LEPC": "Fall River LEPC",
  "FacilityLatDecDegs": "41.699167",
  "FacilityLongDecDegs": "-71.120278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": "www.Fall-River.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Fall River",
  "Company2Name": "Fall River Water Department",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fall River",
  "OperatorStr1": "1831 Bedford Street",
  "OperatorStr2": null,
  "OperatorCity": "Fall River",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02723",
  "OperatorZipCodeExt": null,
  "RMPContact": "Linda Correia",
  "RMPTitle": "Director Treatment/Resources",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071183",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-17 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-02-08 00:00:00",
  "DeRegistrationEffectiveDate": "2016-07-25 00:00:00",
  "AnniversaryDate": "2004-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.6958,
  "FRS_Long": -71.12289,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20838,
      "AltID": "Water supply",
      "FacilityID": 15145,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21390,
          "ProcessID": 20838,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26486,
          "ProcessID": 20838,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526486,
          "ProcessID": 20838,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15145,
      "SummaryText": "\nExecutive Summary\n\nThe purpose of the Risk Management Plan is to provide the water department, City of Fall River  with a procedure to be followed for containment/control of massive discharge or reaction of Chlorine stock in the water treatment plant and its potentially toxic effect on employees and adjacent populations.  The plan has enhanced the water departments commitment for a comprehensive written emergency response plan and an employee safety training program to mitigate the consequences of an emergency.\n\nThe City of Fall River's water filtration plant produces an average of 15 million gallons per day (MGD) and provides safe drinking water to the residents of fall river and other adjacent communities.  The use of Chlorine in water treatment  is required to control the presence of bacteria and assist in the removal of certain dissolved chemicals from the surface water.  It's use is essential to protect the public health and assure water quality.  In normal use in drinking water operations Chlorine is a safely contained and expertly handled substance.\n\nChlorine is delivered in one tone cylinders and stored inside the Chlorine Storage Room.  The storage room has a maximum capacity of (7) one ton cylinders of liquefied gas. Two units are on line at any one time.  Empty tanks are labeled and stored.  To be used, the chlorine must be allowed to expand to a gaseous state and be fed into the treatment plant process in carefully measured amounts.  This is accomplished in a chlorinator.  Both the delivery system to and from the chlorinator is stressed under pressure.\n\nLeaks involving delivery systems to or from chlorinators or valves in the apparatus are not uncommon in water treatment plants.  Despite the apparently sturdy construction of both cylinders, piping systems and chlorinators, it must be remembered that all components are subject to trauma (vandalism or accident) and all metal parts are subject to fatigue by corrosion or continued pressure on weakened plugs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15145,
      "SummaryText": " or improperly prepared joints.  The major chlorine emergency considered is if a tank-in-operation severed a line or  ruptured a disk on the one ton container. The alternative release scenario is if a container fell off in transfer operations.\n\nIt is theoretically possible to produce a chlorine emergency by excessive chlorination of the water.  If demand exceeds the safe daily draw upon a tank (approximately 400 lb./24 hr.) a line freeze-up may occur.  Attempts to correct this situation may result in accidental release of chlorine.\n\nThe worst -case release scenario would have an off site impact to schools, hospitals, state forest, industrial park and in circumference of 5.0 miles, which would effect 283 thousand people.The alternative case would circumference an area of 3.4 miles effecting 95 thousand people.\n\n\nThe main Treatment Plant is equipped with an atmospheric chlorine detector.  This must be tested at least quarterly; the alarm will sound internally to the apparatus (located in front of the chlorinator room window) as well as on the air horn.  There is a trouble light (for chlorine gas in atmosphere) on the operating console display panel.\n\nIn the event of a presumed chlorine leak or chlorine alarm from the detector, the operator in charge and attendant shall investigate the leak; other personnel will go to the entrance and prepare to evacuate the building.\n\nThe EPA's RMP Comp. model and ALOHA was used to conduct the worst-case  and  alternative release scenarios.  The water department is evaluating the system to revalve the distribution system and install excess flow valves and a total vacuum gas chlorinator/dechlorinator system using multiple vacuum  regulators. There are vents near the floor in the chlorine storage room and chlorine sensors to abate the accidental releases of chlorine. The water department intents to install a sample access port in the wall of the room to take samples with a probe and meter.\n\nThe general accident release preventive progra"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15145,
      "SummaryText": "m and chemical specific preventive steps are as follows:\n\nStandard first aid treatment for chlorine exposure consists of the following:\n\n     a.  External - flushing with large amounts of water followed, if possible, by washing                     \n          with diluted mild or lime water.\n     b.  Eyes - flushing with cool water for at least one hour.\n          No other chemicals are to be used in the eye.\n     c.  Respiratory (inhalation) - administration of 100% oxygen by mask;\n          severe exposure may require artificial respiration\n     d. Internal - administration of milk or milk products may soothe mucous\n          membranes and reduce the chance for nausea and vomiting.\n\nAfter any chlorine exposure, employees are urged to shower and change clothes.  Chlorine exposure victims will receive examination or definitive care at a local hospital.  Many pre-existing heart and lung conditions may be aggravated by chlorine exposure.\n\nProtective equipment for chlorine emergencies is located in the main treatment plant at the following locations:\n\n   a.  at chemical treatment room - 2 MSA packs in carrying cases.\n\n   b.  in emergency locker, treatment room - disposable coveralls and goggles.\n\n   c.  outside of chlorinator room in chemical feed room on floor by  chlorinator\n        room window -- three canister type chlorine masks (refill canisters in \n        emergency locker).\n\n   d.  first aid equipment in treatment room, oxygen mask with 15 minute supply\n        and one refill (emergency locker), first aid kit (control room), airway for swelling\n        of windpipe (emergency locker).\n\n   e.  chlorine cylinder repair kit - on floor of chlorine room.\n\n\nThe Fall River Water Department follows the regulations of the Commonwealth of Massachusetts, Department of Labor and Workforce Development, Division of Occupational Safety, Occupational Hygiene Program.\n\nThe city also requires the liquid chlorine and containers shall conform to American Water Works specifications B"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15145,
      "SummaryText": "301-92, B-301-81, and to the applicable regulations of the Department of Transportation and loaded and shipped in strict accordance with the \nlatest edition of \"Container Procedure at Chlorine Package Plants\", as issued by the Chlorine Institute Inc.\n\nThe water department has updated the personal protective equipment  for personnel. Eight (SCBA) self contained breathing apparatus have been acquired and hydrostatically tested. The Fall River Fire Department has provided training for use ,proper procedure, cleaning and maintenance of the equipment. There is a written procedure for operators and attendants to follow when changing chlorine tanks and routine maintenance.\n    A dehumidifier in the chlorine storage room is checked daily. Routine maintenance consists of rebuilding chlorinators, changing O rings, diaphragms, lead washers, cleaning of valves and testing gauges. The back up system in the chlorine storage room is tested routinely.\n\n\n\nThe Fall River Water Department has not had an accidental release of chlorine within the last five years.\n\n\nEmergency Response Program\n(Declaration of Emergency)\n\nIt is the duty of all employees and administrators on the Treatment Plant site to immediately report and/or investigate signs of a potential chlorine emergency.  The Operator-in-Charge of a shift will normally investigate potential leaks.  When there are only two persons on a shift, the operator shall make the investigation keeping visual contact with the attendant on duty.  Appropriate safety equipment shall be worn.\n\nIf a chlorine leak is discovered its nature and rate shall be determined and attempts shall be made by the employees to control small leaks by such means as:\n   a.  adjustment of apparatus;\n   b.  system change-over to standby tank or complete shut-down;\n   c.  termination of entire chlorination process -- meaning plant shut-down.\n\nIn every case it shall be the O.I.C. who shall initially determine that a leak cannot be contained by appropriate small repairs.  "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15145,
      "SummaryText": "In such cases, he shall confer with the Water Treatment Plant Supervisor or Director of Water Treatment and Resources in their absence, the other Division Directors or Administrator. Fall River Fire Department shall also be called at this time. One of the members of the Administration shall inspect the site and will be responsible for notification of emergency services, the approved Chlorine Control Agency of record, and additional employees as required.  These actions constitute declaration of chlorine emergency.    \n\nThe Administration is charged with obtaining appropriate meteorological data from a certified source and, with the fire department staff, estimating direction and intensity of gas diffusion and travel from the accident site.  The authority to evacuate adjacent civilian populations clearly rests with emergency service.\n\nUntil a chlorine emergency is terminated by containment, a member of the Administration shall be present on scene or available for consultation.  Control of media and press releases concerning any chlorine emergency shall normally be the responsibility of the Superintendent or his designate.\n\nIf a facility must be evacuation.  When this is deemed unsafe or unwise, this shall be done on re-entry in protective gear and in the presence of one other person.\n\nDrills conducted for emergency response are planned with the Fall River Fire Department. The supplier of Chlorine is required by contract to provide annual safety training to water department personnel.  Written procedures have been developed which require plant operators and attendants to use the SCBA packs when changing chlorine tanks and performing maintenance.  This procedure will improve training and maintenance inspections of the equipment."
    }
  ]
}