{
  "FacilityID": 1514,
  "FacilityName": "Cargill AgHorizons - Stockham Plant",
  "FacilityStr1": "Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Stockham",
  "FacilityState": "NE",
  "FacilityZipCode": "68818",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31081",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "40.72",
  "FacilityLongDecDegs": "-97.941111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "LF",
  "FacilityURL": "www.cargill.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Cargill, Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 6249189,
  "Company2DUNS": 0,
  "OperatorName": "Cargill AgHorizons - Bradshaw",
  "OperatorStr1": "P.O. Box 38",
  "OperatorStr2": "340 E. Railway St.",
  "OperatorCity": "Bradshaw",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68319",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jay Olson",
  "RMPTitle": "Manager",
  "FTE": 14,
  "OtherEPAFacilityID": "001352-NE-010",
  "EPAFacilityID": "100000017929",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-03-01 00:00:00",
  "SafetyInspectionBy": "State Fire Marshal",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 40.8365,
  "FRS_Long": -98.0173,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1641,
      "AltID": null,
      "FacilityID": 1514,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1674,
          "ProcessID": 1641,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        },
        {
          "Process_NAICS_ID": 1675,
          "ProcessID": 1641,
          "NAICSCode": "45439",
          "_desc": {
            "NAICS_CODE": "45439",
            "NAICS_DESCRIPTION": "Other Direct Selling Establishments"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1745,
          "ProcessID": 1641,
          "ChemicalID": 56,
          "Quantity": 310000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501745,
          "ProcessID": 1641,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1514,
      "SummaryText": "This Risk Management Plan (RMP) was submitted by Cargill, Incorporated to address storage of anhydrous ammonia at our facility at Stockham, Nebraska.  This RMP was prepared following EPA's RMP SUBMIT User's Manual (EPA 550-B99-001), and this executive summary contains the elements required under Chapter 2 of the Manual.\n\nAccidental Release Prevention Program and Emergency Response Policy.  The Cargill, Incorporated release prevention program consists of process hazard analysis (PHA) for handling anhydrous ammonia, followed by critical task procedures training.  Response policy is to train personnel to follow the site-specific Emergency Action Plan, which incorporates the local fire department as the designated emergency response personnel.\n\nFacility Description and Regulated Substances Handled.  The anhydrous ammonia is stored in several nurse tanks and aboveground containers.  Total amount stored on site is approximately 310,000, with approximately 150,000 pounds stored in the largest container.\n\nWorst-Case Scenario.  The worst case toxic release scenario was evaluated using EPA's RMP COMP software (Ver. 1.06).  The scenario involves the release of 150,000 pounds of anhydrous ammonia, liquefied under pressure, which represents release of anhydrous ammonia in an amount equal to the maximum capacity of the largest container.  Default assumptions for the RMP COMP software were used: 77 degrees F, 3.4 MPH wind speed, and stability class D.  In addition, an urban setting was used (based on the presence of trees and buildings in the immediate area), and no mitigation measures were included.  The release duration was 10 minutes.  The toxic endpoint for this scenario is 4.4 miles (7.1 kilometers).  Approximately 750 people reside within this distance from the anhydrous ammonia container.\n\nAlternative Scenario.  The alternative toxic release scenario was also evaluated using EPA's RMP COMP software (Ver. 1.06).  The scenario involves the release of 600 pounds of anhydrous a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1514,
      "SummaryText": "mmonia, liquefied under pressure, resulting from a transfer hose failure.  The assumed release duration is 10 minutes.  Assumptions for this scenario are based on RMP COMP default assumptions and site-specific conditions and response times.  Default assumptions for the RMP COMP software were used: 77 degrees F, 3.4 MPH wind speed, and stability class D. In addition, an urban setting was used (based on the presence of trees and buildings in the immediate area), and no mitigation measures were included.  The toxic endpoint for this scenario is 0.1 mile (0.2 kilometers).  Approximately 50 people reside within this distance from the anhydrous ammonia container.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps.  Anhydrous ammonia storage vessels and the associated safety equipment undergo inspections and requalifications according to the schedules outlined in 29 CFR 1910.111 and the applicable ANSI standards.  All storage vessels are equipped with relief valves, check valves, and manual shutoff systems.\n\nFive Year Accident History.  No reportable releases of anhydrous ammonia have occurred at this facility within the last five years.\n\nThe Emergency Response Program.  This facility has an Emergency Response Plan specifically tailored to this site.  The local fire department is familiar with the facility and will respond in the event of an emergency.  Site personnel receive annual mandatory training that covers proper equipment operation and emergency response.\n\nPlanned Changes to Improve Safety.  No changes are planned at this time."
    }
  ]
}