{
  "FacilityID": 15209,
  "FacilityName": "Gonzales Surface Water Treatment Plant",
  "FacilityStr1": "111 St. Michael",
  "FacilityStr2": null,
  "FacilityCity": "Gonzales",
  "FacilityState": "TX",
  "FacilityZipCode": "78629",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48177",
  "LEPC": null,
  "FacilityLatDecDegs": "29.498333",
  "FacilityLongDecDegs": "97.454167",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "OT",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Gonzales, Texas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Gonzales",
  "OperatorStr1": "P.O. Drawer 547",
  "OperatorStr2": null,
  "OperatorCity": "Gonzales",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78629",
  "OperatorZipCodeExt": null,
  "RMPContact": "E.T. Gibson",
  "RMPTitle": "City Manager",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000042562",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-07-08 00:00:00",
  "SafetyInspectionBy": "Insurance Company, Texas Municipal League",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Alternative Case Scenario #1",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.49744,
  "FRS_Long": -97.45432,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20926,
      "AltID": "Chlorine",
      "FacilityID": 15209,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 21479,
          "ProcessID": 20926,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 26619,
          "ProcessID": 20926,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 526619,
          "ProcessID": 20926,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15209,
      "SummaryText": "Introduction\n\nThe Gonzales Surface Water Treatment Plant (GSWTP) produces approximately 1.75 million gallons of potable water each day for the City of Gonzales.  The plant uses approximately 90 pounds/day of chlorine gas to purify the water.  The Environmental Protection Agency (EPA) lists chlorine as a toxic substance that is potentially harmful to humans and the environment.  GSWTP stores 8000 pounds of chlorine, liquefied under pressure, in (4) 1-Ton Cylinders.  The EPA requires the plant to have a Risk Management Program (RMP) because there is more than 2500 pounds of chlorine in storage.  \n\nThe City of Gonzales, like the EPA, are committed to chemical safety and thus created a RMP.  This commitment starts with the City Manager and includes the Utilities Director and all of the Plant Operators.  The purpose of the RMP is to prevent any accidental releases of chlorine gas and to mitigate the severity of releases that do occur. The City Manager of Gonzales is responsible for the implementation and integration of the RMP.\n\nThe RMP consists of the following:\n7 A worst case scenario giving the radius and population around the plant that could be exposed to high concentrations of chlorine gas.   \n7 Two alternative case scenarios that are more realistic than the worst case scenario. \n7 Five-year accident history detailing GSWTP's accidental releases of chlorine gas in the past five years.  \n7 Management System for implementing and integrating the RMP.  \n7 Prevention Program detailing safety information, the hazard review process, operating procedures, training, equipment maintenance, compliance audits, and incident investigations.\n7 Emergency Response Program detailing emergency response procedures and accident investigation and reporting.\n7 Planned Actions to Improve Safety at GSWTP.        \n                                                                                                                                                                       Worst Case S"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15209,
      "SummaryText": "cenario\n\nThe largest quantity of chlorine released is assumed to be 2000 pounds (a 1-Ton chlorine cylinder) in 10 minutes.  The toxic zone around the plant is 1.3 miles with an estimated population of 6600 (the entire population of the City of Gonzales).  The toxic zone is the area around the plant with an airborne concentration of chlorine gas above 0.0087 mg/L (3 ppm), which is harmful to humans and environment. \n\nThe model used to generate the toxic zone is from EPA's regulations, 40 CFR (Code of Federal Regulations) 68.22, and program entitled \"RMP Comp\".  The model parameters, stated in 40 CFR 68.22, are reasonable and consistent with GSWTP.  The model assumes the atmosphere to be very stable causing a chlorine release to remain relatively stagnant in the air.  \n                                                                                                                                                                  Alternative Case Scenario #1\n\nThe alternative case scenario is more likely to happen than the worst case scenario.  This scenario assumes 2000 pounds of chlorine (a 1-Ton chlorine cylinder) are released in 10 minutes.  The toxic zone around the plant is 0.3 miles with an estimated population of 500 (greater than the U.S. Census Bureau estimate).  \n\nThe model used is the same as in the worst case scenario. The model is consistent with the parameters given in 40 CFR 68.22 and in EPA's \"Risk Management Program Guidance for Wastewater Treatment Plants 40 CFR Part 68\".  The toxic zone is considerably less than that in the worst case scenario because the program (RMP Comp) assumes the atmospheric conditions to be more turbulent in the alternative case.  \n                                                                                                                                                                  Alternative Case Scenario #2\n\nThis scenario assumes that one of the valves is broken off the chlorine cylinder resulting in a 1\" diameter h"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15209,
      "SummaryText": "ole.  This scenario assumes 2000 pounds of liquid chlorine (a 1-Ton chlorine cylinder) are released at a rate of 2500 pounds/min.  This rate is given in EPA's \"Risk Management Program Guidance for Wastewater Treatment Plants 40 CFR Part 68\" for a liquid chlorine release through a 1\" diameter hole.  The release occurs in less than a minute and results in a 0.7 mile toxic radius around the plant.  The toxic zone has an estimated population of 2100 (according to the U.S. Census Bureau).  \n\nThe model for this scenario is the same as in the worst case scenario.  This model is reasonable to assume because one of the valves can be broken off, which would result in a 1\" diameter hole in the cylinder.\n                                                                                                                                                                         Five-Year Accident History\n\nGSWTP has not had any \"reportable\" accidents in the past five years.  A \"reportable\" accident is one that causes a death, injury, property damage, environmental damage, evacuations, or sheltering in place. \n                                                                                                                                                                  Management System\n\nThe City of Gonzales already has a management system in place that ensures the implementation of this RMP.  GSWTP is a small facility and only one person, the City Manager, is responsible for the RMP.  The City Manager is responsible to implement and integrate the RMP and ensure that it is communicated to everyone involved with GSWTP operations. \n                                                                                                                                                                  Prevention Program\n\nThe GSWTP prevention program is aimed to prevent accidental chlorine releases that could harm employees, the public, and the environment.  This prevention program consists of the fol"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15209,
      "SummaryText": "lowing sections:\n\nSafety Information-includes documentation of MSDS sheets, equipment specifications, codes and standards used to build, design, and operate the facility, safe upper and lower parameters in the chlorination system (such as temperature and pressure), and maximum intended inventory of chlorine.  The safety information will be updated when there is a change in any of the above information. This information ensures that GSWTP knows the safety-related aspects of the chlorination process.\n\nHazard Review-includes a checklist and \"What-If\" questions. There are over 60 questions on the checklist and over 20 \"What-If\" questions.  The hazard review will be conducted once every five years or when there is a major change in the chlorination process. These questions and checklist help identify hazards and safety deficiencies at the plant.\n\nOperating Procedures-includes step-by-step instructions for unloading chlorine cylinders, moving cylinders, hooking up regulators, starting up the chlorinators, checks during normal operations, shutting down the chlorinators, and disconnecting the chlorine cylinders.  These procedures include performing equipment inspections, consequences for deviations from the procedures, and safety precautions.  The operating procedures will be updated when there is a change in any of the procedures. \n\nTraining-includes reviewing all the employees training records, determining who needs specific training, providing training for those without proper training,  and providing refresher training. Training will be provided on an on-going basis with refresher training on the RMP at least once every three years. \n\nMaintenance-includes reviewing the maintenance requirements for the equipment, ensuring that all of the preventative maintenance is performed, and ensuring that only qualified contractors maintain the equipment.  A qualified outside contractor will perform an annual inspection that includes testing of all the equipment in the chlorination "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15209,
      "SummaryText": "process. \n\nCompliance Audits-includes performing an audit to evaluate the effectiveness of the prevention program.  An audit of the prevention program will be performed at least once every three years.  \n\nIncident Investigations-includes performing investigations for all incidents that could have resulted in a catastrophic release of chlorine.  These incident investigations will determine the cause of the accident, the contributing factors, and ways to improve the safety of the operation.     \n\nRecommendations-includes those items that will improve the safety of the plant operations.  These recommendations will result from reviewing all aspects of the prevention program.  Corrective action will be recommended at any time a deficiency is noticed.   \n                                                                                                                                                                  Emergency Response Program\n\nGSWTP emergency response program (ERP) is aimed to ensure the safety of the employees, the public, and the environment.  The response program is written into the community emergency response plan for the City of Gonzales and includes immediately informing employees on site and the public off-site (in the surrounding areas) via an alarm, and by calling 911 and the emergency response coordinator for the City of Gonzales.  The last part of the ERP is the investigation of an accident.  The investigation will determine the primary and secondary causes and necessary actions to prevent other accidents.  The City Manager is responsible to ensure that the emergency response coordinator and all other parties can provide effective and adequate response to an emergency chlorine release at the plant.  \n                                                                                                                                                                  Planned Changes to Improve Safety at GSWTP\n\nGSWTP has developed a list of changes that n"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15209,
      "SummaryText": "eed to be made to further minimize the chances of an accidental chlorine release.  GSWTP is in the process of making the following changes: \n7 Purchasing a new crane for lifting the cylinders.\n7 Replacing the exhaust fan in the chlorinator room.\n7 Installing an alarm to alert those immediately around the plant. \n7 Purchasing a windsock so that the operators can tell 911 and the Emergency Response Coordinator the wind speed and direction.  \n7 Installing an auto dialer on the alarm to dial 911 in the event of a release when no one is at the site. \n7 Installing a bunker in front of the chlorine cylinders to prevent vehicle impact and to prevent someone from knocking off a valve or regulator. \nThe operators of GSWTP will continue to improve the Risk Management Program as well as all the safety-related aspects of the chlorination system at the plant."
    }
  ]
}