{
  "FacilityID": 15234,
  "FacilityName": "Bridgeport Energy LLC",
  "FacilityStr1": "10 Atlantic Street",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeport",
  "FacilityState": "CT",
  "FacilityZipCode": "06604",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Bridgeport LEPC",
  "FacilityLatDecDegs": "41.169167",
  "FacilityLongDecDegs": "73.184444",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "NE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Bridgeport Energy LLC",
  "OperatorStr1": "10 Atlantic Street",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06604",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000156252",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-29 00:00:00",
  "ErrorReportDate": "1999-07-29 00:00:00",
  "ReceiptDate": "1999-07-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-07-22 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.168333,
  "FRS_Long": -73.185,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 20985,
      "AltID": "Aqueous Ammonia",
      "FacilityID": 15234,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 26721,
          "ProcessID": 20985,
          "ChemicalID": 57,
          "Quantity": 94000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 21538,
          "ProcessID": 20985,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 8352,
              "Process_NAICS_ID": 21538,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-15 00:00:00",
              "ChangeCompletionDate": "1999-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-05-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-15 00:00:00",
              "EquipmentTested": "Storage tanks and associated supporting systems.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8736,
                  "PreventionProgram2ID": 8352,
                  "ProcessChemicalID": 26721
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15234,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Bridgeport LEPC",
    "CoordinatingAgencyPhone": "2035768376",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15234,
      "SummaryText": "Executive Summary\nBridgeport Energy LLC\nBridgeport CT\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nBridgeport Energy LLC (BE) is a natural gas fired electric generating facility.  Aqueous ammonia (AA) is used for NOx control.  By virtue of the toxic effects associated with AA, it is necessary to observe certain safety precautions in handling the chemical to prevent unnecessary human exposure, to reduce the threat to personnel of BE, and to reduce the threat to nearby community members.  BE is strongly committed to employee, public and environmental safety.  Safety at the facility depends, among other factors, upon the manner in which AA is stored and handled.  Comprehensive training received by plant operators adds to the inherent safety of AA storage and use at the facility.\n\n2. The Stationary Source and Regulated Substances Handled\n\nAA is the only chemical used or stored at the BE facility that is technically subject to the 40 CFR Part 68 Chemical Accident Prevention provisions because it is stored above the threshold amount and concentration (29% by weight).  As such, this Risk Management Plan (RMP) only addresses AA.  As part of this RMP, worst-case and alternative release scenarios have been evaluated and prevention program documentation is maintained on site.\n\nThe AA is delivered directly to the AA tanks on site.  Access to the BE facility and, therefore, to the AA tanks is restricted to authorized management and personnel and third-party contractors.\n\nThe maximum amount of AA that can be stored in the AA tanks is approximately 94,000 pounds based upon the capacity of the AA tanks.\n\n3. The Worst Case Release Scenario and Alternative Release Scenario\n\nThe worst case release scenario involves the contents of one of the ammonia tanks releasing under worst case meteorological conditions up to 20,000 gallons of aqueous ammonia.  The containment dikes around each of the tanks is large enough to hold the entire contents of the tank (19.16 x 47."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15234,
      "SummaryText": "89 x 3).  The containment dike and pit drain have been designed to ensure the capture and drainage of all of the solution within two (2) minutes of its release.  Although the worst case release of the aqueous ammonia is considered instantaneous, ammonia emissions from the containment area will be continuous as the ammonia evaporates from the solution.  \n\nTotal emissions from such an accidental release would include emissions from the containment area initially, and then emissions from the pit.  The estimated distance to the toxic endpoint, using the Risk Management Program Offsite Consequence Analysis (OCA) Guidance (EPA, 1996), is 0.04 miles.  There is no residential population within the distance to the endpoint.  The only public receptor identified within the distance to toxic endpoint is an electric generating facility, Wisvest (at the Bridgeport Harbor Station, Bridgeport, Connecticut, facility formerly owned by The United Illuminating Company).  There are no environmental receptors within the distance to endpoint.\n\nThe alternate release scenario involves the contents of one of the ammonia tanks releasing under average (not worst case) meteorological conditions.  Under this scenario, the distance to the toxic endpoint is reduced to 0.01 miles.  There is no residential population within the distance to endpoint, and there are no public or environmental receptors within the distance to endpoint. \n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nBE has taken all the necessary steps to comply with the accidental release prevention requirements set forth under 40 CFR Part 68.\n\nThe following sections briefly describe the release prevention program that is in place at BE.\n\nSafety\nBE has a detailed, written safety procedure, which describes the chemical hazards, operating procedures and equipment designs associated with all aspects of the AA storage.\n\nHazard Review\nA checklist methodology will be used to carry out hazard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15234,
      "SummaryText": "reviews at the facility.  The reviews will focus on operating procedures, equipment functions and handling practices to identify possible hazards.  The reviews will be undertaken by qualified personnel with extensive knowledge of facility operations and will be conducted periodically to ensure that all appropriate updates based upon changed operating conditions, if any, have been made and implemented.  Any findings relative to the hazard reviews will be addressed in a safe and timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities at the facility, including those relating to the storage and use of AA, BE maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operator involved with the processes.\n\nTraining\nBE has a comprehensive training program in place to ensure that all employees engaged in the operation of the plant are completely competent in all operating procedures.  New employees receive training and all employees receive refresher training at regular intervals.\n\nMaintenance\nBE carries out documented maintenance checks on all plant processes to ensure proper functioning.  Maintenance activities are carries out by qualified personnel with previous training in these practices.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits\nBE will conduct routine compliance audits of facility operations generally, and specifically to ensure that all processes associated with the storage and use of AA are being conducted in a manner to ensure the safety of the BE facility workers and all others who may come into contact with the facility.\n\nIncident Investigation\nThe BE facility has been under construction since"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15234,
      "SummaryText": "October 1997, and is commencing commercial operation in combined cycle mode in mid- to late-June 1999, when AA will start to be used to control NOx emissions pursuant to the terms of the Air Permits to Operate the plant.  As such, there are no historical incidents involving AA.  However, in the event of an incident involving AA, BE will immediately investigate the cause of the incident, and will take all required corrective actions to mitigate the effects of the incident and to prevent recurrence.  Any such incident reports shall be maintained at the facility for the required records retention period.\n\nFive-Year Accident History\nBecause the BE facility is a new facility, it has not run for five years, and, therefore, there is no five-year accident history.\n\nEmergency Response Plan\nIn the event of a release of AA, BE will immediately contact the Bridgeport Local Emergency Planning Committee (LEPC), and an outside emergency response contractor, who will manage all but minor leaks/releases, which will be addressed by on-site personnel.  Because BE will not be responding to accidental releases, a written emergency response plan for AA is not required under EPA's Accident Prevention Provisions.\n\nThe Bridgeport LEPC is located in the City of Bridgeport Office of Emergency Management, 30 Congress Street in Bridgeport, Connecticut.  The Chairman of the LEPC has reviewed BE's operating and emergency response procedures, and stated his intention to incorporate the BE facility into the area-wide emergency response plan.\n\nPlanned Changes to Improve Safety\nAny recommendations that may derive from the development of the RMP, the actual storage and use of AA on the BE facility, and findings from the facility compliance audits will be implemented, and all operating procedures, emergency response procedures and training will be updated to reflect same.              \n\nNOTE:  THE SIGNED CERTIFICATION IS BEING PROVIDED WITH THE DISK\n\n\nCertification Statement\nThe undersigned certified t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15234,
      "SummaryText": "hat to his best knowledge, information and belief, formed after reasonable inquiry, the information submitted herein is true, accurate and complete.\n\nName:\t\tDavid A. Gillespie\t\n\nSignature:\n\nTitle:\t\tGeneral Manager\n\nDate:\t\tJune      , 1999\n\n\n\n1"
    }
  ]
}