{
  "FacilityID": 15349,
  "FacilityName": "US FILTER RECOVERY SERVICES INC.",
  "FacilityStr1": "2430 ROSE PLACE",
  "FacilityStr2": null,
  "FacilityCity": "ROSEVILLE",
  "FacilityState": "MN",
  "FacilityZipCode": "55113",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27123",
  "LEPC": "NONE",
  "FacilityLatDecDegs": "45.124472",
  "FacilityLongDecDegs": "-92.983806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 188751705,
  "ParentCompanyName": "US FILTER CORPORATION",
  "Company2Name": null,
  "CompanyDUNS": 150795342,
  "Company2DUNS": null,
  "OperatorName": "MARTIN BERGSTEDT",
  "OperatorStr1": "2430 ROSE PLACE",
  "OperatorStr2": null,
  "OperatorCity": "ROSEVILLE",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55113",
  "OperatorZipCodeExt": null,
  "FTE": 74,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000096969",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-05-01 00:00:00",
  "DeRegistrationEffectiveDate": "2002-04-24 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 45.01805,
  "FRS_Long": -93.20266,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21117,
      "AltID": "AMMONIA (ANHYDROUS)",
      "FacilityID": 15349,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 26867,
          "ProcessID": 21117,
          "ChemicalID": 56,
          "Quantity": 65000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 26868,
          "ProcessID": 21117,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 26869,
          "ProcessID": 21117,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 21674,
          "ProcessID": 21117,
          "NAICSCode": "562211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 11441,
              "Process_NAICS_ID": 21674,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "CHLORINE METER",
              "ChangeMgmtDate": "1999-06-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": "1999-06-01 00:00:00",
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": "1999-05-26 00:00:00",
              "InvestigationChangeDate": "1999-06-04 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16195,
                  "PreventionProgram3ID": 11441,
                  "ProcessChemicalID": 26867
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15349,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-19 00:00:00",
    "ERTrainingDate": "1999-03-19 00:00:00",
    "CoordinatingAgencyName": "MPCA/ROSEVILLE FD/RAMSEY COUNTY",
    "CoordinatingAgencyPhone": "6516495451",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15349,
      "SummaryText": "USFRS ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES  The USFRS accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices to protect our employees and neighbors.  All applicable procedures of the US EPA Prevention Program are adhered to.  The USFRS emergency response policy involves the preparation of a response plan that is tailored to our facility and to the emergency response resources both we and the surrounding communities provide, and meets or exceeds all EPA Emergency Response Program requirements.  SITE DESCRIPTION  Primary Activity: USFRS is located in an industrial park at 2430 Rose Place in Roseville, MN.  It has safely operated at this site for over 11 years.  USFRS is a central treatment and recovery faciity.  The facility recieves and processes aqueous liquids, solids, and sludges that contain heavy metals, along with a small volume of cyanide.  USFRS also recycles water treatment ion exchange resins.  Regulated substances include:  Ammonia (anhydrous) at 65,000 pounds, chlorine at 12,000 pounds, and sulfur dioxide at 4,000 pounds.  WORST-CASE RELEASE SCENARIO  The worst-case scenario, which is not realistic, would involve the uncontrolled release of all the contents of our anhydrous ammonia tank.  The maximum inventory held in this tank is 65,000 pounds.  The most plausible scenario would involve a truck driving to the back of our property and crashing through the cyclone fence and crash barriers that protect this tank.  This, with enough force to puncture the heavy gauge (over 2/3 inch thick steel shell) tank in a manner that allowed all its contents to be lost within 10 minutes.  It would also have to be done so that the puncture could not be sealed by our emergency personnel.  It would also have to occur when the tank was at its maximum inventory, and during worst case weather conditions i.e. low winds (1.5 M/S).  According to the National Oceanic and Atmospher"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15349,
      "SummaryText": "ic Administration (NOAA) and US EPA's RMP*Comp Model, the maximum distance the plume would travel before dispersing, so that it no longer posed a hazard to the public, is 2.8 miles.  This would be a long narrow plume affecting only a fraction (about 5%) of the roughly 62,000 population that resides in the USFRS Anhydrous Ammonia Worse Case Impact Zone.  This zone includes thirty-three sensitive receptors.  This is made up of eighteen schools, two libraries, no hospitals, six parks, and seven shopping centers.  The impact zone intersects I-35W, HW 36, Hw 51, and HW 88.  There are also eight named lakes that fall within this range.  An Alternative Scenario for anhydrous ammonia, with a more realistic set of circumstances, would involve a loading accident where a hose or connection failed.  Average wind speed in Roseville is about 10 miles per hour.  Again, USFRS has emergency personnel and equipment available for immediate response and would be able to minimize the impact.  However, according to the NOAA and US EPA RMP*Comp Model, if all material in the tank was lost, during an average wind speed, the impact zone would only reach one half mile.  This is almost entirely within the industrial park that USFRS resides.   Within that zone, there are no schools, libraries, parks, shopping centers, prisons, or hospitals.  There are two residential homes within this area, and the outer southern edge of the impact zone crosses I-35W.  An Alternative Scenario for chlorine could include the failure of the distribution system.  This has up to three-one ton chlorine cylinders hooked up at one time.  Chlorine is stored indoors in a concrete block room with steel doors, separated from plant operations.  We have an on-site response capacity that allows us to immediately respond to emergencies.  This includes chlorine repair kits and other equipment that would allow USFRS to immediately stabilize the situation and minimize any incident.  It is very unlikely that a release would leave"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15349,
      "SummaryText": "this building and pose a threat to off-site receptors.  However, if one did occur, according to the NOAA and US EPA RMP*Comp Model, the impact zone would extend 0.3 miles.  This would fall entirely within the industrial park where USFRS resides.  There are no schools, libraries, parks, shopping centers, prisons, or hospitals within the area.  This zone does not include any residences and does not cross any major transportation routes.   An Alternative Scenario for sulfur dioxide could also include the failure of either a one ton cylinder or its distribution system.   Only one cylinder is connected at a time.  Sulfur dioxide is stored in the same room as the chlorine.  The same equipment used for addressing a chlorine leak can be used for a sulfur dioxide loss.  Because of this, it is very unlikely that a release would leave the building and pose a threat to off-site receptors.  However, if one did occur, according to the NOAA and US EPA RMP*Comp Model, the impact zone could reach 0.2 miles.  Again, this would fall completely within the industrial park which USFRS resides.  There are no schools, libraries, parks, prisions, shopping centers, or hospitals within the area.  This zone also does not include any residences or major transportation routes.  General Accidental Release Prevention Program and Chemical-specific Prevention Steps:  As a permitted RCRA hazardous waste facility, USFRS is among the most regulated operations in the United States.  As a condition of our RCRA Part B permit, extensive incident prevention measures are in place.  USFRS is inspected regularly by the MPCA, Ramsey County, and the Roseville fire Department to insure that this incident prevention program is followed.  Five-year Accident History:  USFRS did not have a reportable accident during the past 5 years.  Emergency Response Program: As part of our RCRA hazarodus wste permit, USFRS was required to develop an effective Contingency Plan to handle all potential incidents.  USFRS is inspected"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15349,
      "SummaryText": "regularly by the MPCA, Ramesy County, and the Roseville Fire Department to insure that this program is followed.  Along with the steps USFRS is reqired to implement, we also have an on-site response capacity to resond to the highest level of chemical emergency response, Level A.  Because we have a highly trained and equipped staff, USFRS is able to respond immediately to all on-site incidents.  USFRS does have an agreement with a professional emergency response contractor (Bay West) to provide backup support if an incident required additional resources.  The Roesville Fire Department is also part of a hazardous materials incident response team that could also be called upon for backup.  Planned Changes to Improve Safety:  *  USFRS is evaluating an outside anhydrous ammonia suppression system.  This would knock down ammonia vapors during a catastrophic loss and significantly reduce the impact zone.  *  Also under consideration, is placing the anhydrous ammonia tank within a building.  As well as providing further physical protection, it would further enable USFRS to control any loss from the tank.  *  USFRS is evaluating improved air/scrubber control for the chlorine/sulfur dioxide room.  This would further increase our control over chemical loss within that room, and reduce the potential of either chlorine or sulfur dioxide escaping the building.  It would also speed mitigation of any chlorine or sulfure dioxide loss."
    }
  ]
}