{
  "FacilityID": 15392,
  "FacilityName": "Weyerhaeuser Pulp, Paper and Packaging Facility",
  "FacilityStr1": "West Main Street Extension",
  "FacilityStr2": "P.O. Box 787",
  "FacilityCity": "Plymouth",
  "FacilityState": "NC",
  "FacilityZipCode": "27962",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37117",
  "LEPC": "Martin County LEPC",
  "FacilityLatDecDegs": "35.860028",
  "FacilityLongDecDegs": "-76.778806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.weyerhaeuser.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3199882,
  "ParentCompanyName": "Weyerhaeuser Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Weyerhaeuser Company",
  "OperatorStr1": "West Main Street Extension",
  "OperatorStr2": "P.O. Box 787",
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27962",
  "OperatorZipCodeExt": null,
  "FTE": 1400,
  "OtherEPAFacilityID": "27962WYRHSTROWB",
  "EPAFacilityID": "100000156984",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "590069A5.A",
  "SafetyInspectionDate": "1995-03-02 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "90 Ton Railcar of Chlorine Located at Filter Plant",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-30 00:00:00",
  "ErrorReportDate": "1999-07-30 00:00:00",
  "ReceiptDate": "1999-07-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-07-26 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2004-04-06 00:00:00",
  "DeRegistrationEffectiveDate": "2002-05-12 00:00:00",
  "AnniversaryDate": "2004-07-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.858814,
  "FRS_Long": -76.790571,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21163,
      "AltID": "Filter Plant",
      "FacilityID": 15392,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 26918,
          "ProcessID": 21163,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 21722,
          "ProcessID": 21163,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 11462,
              "Process_NAICS_ID": 21722,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "PHA_Date": "1999-05-26 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-10-15 00:00:00",
              "TrainingReviewDate": "1999-05-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-02 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Chlorine service automatic control valves and manual valves",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-10-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-03-08 00:00:00",
              "AuditCompletionDate": "1999-06-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-10-15 00:00:00",
              "HotWorkPermitReviewDate": "1997-12-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-02 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16216,
                  "PreventionProgram3ID": 11462,
                  "ProcessChemicalID": 26918
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15392,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-28 00:00:00",
    "ERTrainingDate": "1999-04-28 00:00:00",
    "CoordinatingAgencyName": "Martin County LEPC",
    "CoordinatingAgencyPhone": "2527928151",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15392,
      "SummaryText": "1.0  RMP - Executive Summary\n\nThe Weyerhaeuser Company is committed to operating in a manner that is safe for employees, the public and the environment.  As part of this commitment, Weyerhaeuser has established a system to help ensure safe operation of the process within the facility.  One component of the system is a Risk Management Plan (RMP) for the Filter Plant located within the facility.  (Chlorine is used at the Filter Plant for the treatment of river water used in the facility.)  The RMP complies with the requirements of the United States Environmental Protection Agency's (USEPA's) regulation, 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs.  One of the requirements of the regulation is that Weyerhaeuser must submit an RMP to the USEPA describing the risk management program at the facility.  This document is intended to provide the USEPA and the public with a description of the risk management program for the Filter Plant within the Weyerhaeuser Facility.\n\nWeyerhaeuser's risk management program consists of three elements:\n\n 1.  Hazard Assessment.  Identifies potential off-site consequences of hypothetical accidental releases and any accidents that have occurred in the last five years associated with the usage of chlorine at the Filter Plant.\n 2.  Prevention Program.  Maintains and safely operates the Filter Plant chlorination process.\n 3.  Emergency Response Program.  Responds to accidental releases of chlorine at the Filter Plant.\n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\nWeyerhaeuser is committed to the safety of workers and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Weyerhaeuser implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the Fil"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15392,
      "SummaryText": "ter Plant; and, programs to evaluate the hazards.\n\nIn the event of an accidental release, Weyerhaeuser controls and contains the release in a manner that will be safe for workers and will help prevent injury to the public or the environment.  Weyerhaeuser provides response training to responders, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with local hospitals, fire departments, law enforcement and hazardous materials responders.  Response activities have also been discussed with the LEPCs in Bertie, Martin and Washington counties.\n\n 1.2  Regulated Substances\n\nAs part of the pulp and paper manufacturing processes, Weyerhaeuser uses only one regulated substance in sufficient quantity to be covered by the RMP rule.  The one substance is chlorine used at the Mill's Filter Plant.  The chlorine is used to disinfect river water prior to its use throughout the Mill.  The RMP rule covers processes that have 10,000 pounds or greater of chlorine.  Currently, the Mill can have up to 180,000 pounds (or one 90 ton railcar) of chlorine onsite.  Since the Filter Plant process is already covered under OSHA's Processes Safety Management regulation, the process is a program level 3 as defined in the EPA rule.\n\n1.3  Offsite Consequence Analysis\n\nWeyerhaeuser performed an offsite consequence analysis to estimate the potential for an accidental release of a regulated substance to affect the public or the environment.  The offsite consequence analysis consists of evaluating both worst-case release and alternative release scenarios.  Weyerhaeuser does not expect a worst-case release scenario to ever occur.  The alternative release scenarios were selected to help the local emergency planning committee improve the community emergency response plan.  An alternative release scenario represents a release that (1) might occur at a facility like Weyerhaeuser Filter Plant and (2) would result in the greatest potential offsite conse"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15392,
      "SummaryText": "quences if the release occurred.\n\nThe main objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  When considering the release of a toxic substance, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the substance released could be incapacitated.  At distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint distance, the effects would be less.\n\nThe RMP rule requires Weyerhaeuser to report one worst-case scenario and at least one alternative release scenario.  The alternative release scenario is more likely to occur based upon accidents at other water treatment facilities.  The following information summarizes the offsite consequence analysis performed by Weyerhaeuser.\n\n1.3.1  Worst-case Release Scenario\n\nThe worst-case release scenario for the Filter Plant is the rupture of a 180,000 pound railcar (one 90 ton railcar) of liquid chlorine.  The entire contents of the railcar are released in 10 minutes.  The maximum distance to the toxic endpoint concentration is 18.5 miles.  The 1990 census indicates that 59,000 people in six counties live within this distance from the Filter Plant.  Public receptors within this distance include facilities such as: schools, residences, hospitals, boat landings, golf courses, churches, commercial & industrial areas, hotels/motels, etc.  Environmental receptors within this distance include facilities such as: State park, wildlife preserves, refuges and gamelands, etc.\n\n1.3.2  Alternative Release Scenario\n\nThe alternative release scenario is a rupture of the 1-inch railcar unloading line on top of the railcar.  The scenario assume"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15392,
      "SummaryText": "s that the car's excess flow valve sticks open for two minutes allowing 5,000 pounds of chlorine to be released.  The maximum distance to the toxic endpoint concentration is 1.1 miles.  The 1990 census indicates that 1,460 people in one county live within this distance from the Filter Plant.  Public receptors within this distance include facilities such as: residences, a boat landing, and golf course.  Environmental receptors within this distance include facilities such as: wildlife refuges and gamelands, etc.\n\n1.4  Accidental Release Prevention Program and Chemical-specific Prevention Steps\n\nWeyerhaeuser uses a prevention program to help prevent accidental releases of all hazardous chemicals onsite.  In 1992, the Filter Plant prevention was formalized to meet the requirements of OSHA's Process Safety Management (PSM) regulation.  The USEPA's RMP regulation requires the same basic prevention program except for the RMP program also focuses on protecting the public and the environment.  The following sections briefly describe Weyerhaeuser's prevention program at the Filter Plant to meet the RMP regulations.\n\n1.4.1  Employee Participation\n\nWeyerhaeuser fosters broad and active participation in the prevention program by involving hourly, salary and contract employees with the common purpose to make the workplace safer.  In the development and maintenance of the prevention program, Weyerhaeuser consults regularly with employees and their representatives.  Also, employees and their representatives have access to information developed for the prevention program.\n\n1.4.2  Process Safety Information\n\nWeyerhaeuser maintains many technical documents to ensure safe operation of the Filter Plant.  These documents contain information pertaining to: the hazards of the highly hazardous chemicals in the process, the technology of the process and the equipment in the process.\n\nThe Material Safety Data Sheet (MSDS) documents the following hazards of chlorine in the Filter Plant: toxici"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15392,
      "SummaryText": "ty information, permissible exposure limits, physical data, reactivity data, corrosivity data and thermal and chemical stability data.  Also, the Filter Plant Operating Manual contains information about the hazardous effects of inadvertent mixing of different materials.\n\nThe process technology of the Filter Plant is located in the Filter Plant Operating Manual.  Technology information in the manual includes: process flow diagram, process chemistry, maximum intended information, safe upper and lower limits for Filter Plant operating parameters and an evaluation of the consequences of deviations from the Filter Plants operating parameters.\n \nThe process equipment documentation includes information concerning the operating parameters, design basis and configuration of the equipment in the Filter Plant.  Specifically, Weyerhaeuser has the following equipment documentation: materials of construction, piping & instrumentation diagrams, electrical classification, relief system design and design basis, ventilation system design, design codes and standards used, safety systems, and verification that the process complies with recognized and generally accepted engineering practices.\n\n1.4.3  Process Hazard Analysis\n\nWeyerhaeuser performs and periodically updates process hazard analyses (PHAs) of the Filter Plant to help identify process hazards and to generate recommendations that might enhance the safety of the process.  A team composed of engineering, operations, maintenance, environmental, safety and process control performs the PHA.  Typically, Weyerhaeuser utilizes the Hazard and Operability (HAZOP) methodology or What-if methodology to perform the PHA.  After completion of the PHA, the PHA team prepares a report describing the results of the analysis and a list of recommendations.  Recommendations are distributed by responsible supervisor.  Supervisors then address each recommendation and document the resolution.\n\n1.4.4  Operating Procedures\n\nWeyerhaeuser has developed a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15392,
      "SummaryText": "Filter Plant Operating Manual that provides clear instructions for activities in the Filter Plant area.  The manual includes procedures for: initial start-up, normal operation, temporary operation, emergency shutdown, normal shutdown, start-up after a turnaround or emergency shutdown, operating limits including the consequences of process deviation and steps required to correct or avoid deviation, safety and health considerations, safety systems and their functions and safe work practices.  Weyerhaeuser annually reviews the operating manual to ensure that the procedures are up-to-date.\n\n1.4.5  Employee Training\n\nWeyerhaeuser is committed to ensure that employees and contractors understand the nature and causes of problems arising from the Filter Plant operations and aware of the hazards particular to the Filter Plant.  In the Filter Plant area, on-the-job training is used with operating procedures until an acceptable skill level has been reached.  Senior operators and supervisors use a formatted checklist to determine the trainee's skill level.  Refresher training is performed every three years to refresh operator's skills.\n\n1.4.6  Contractors\n\nWeyerhaeuser has established a program to help ensure that activities in the Mill are performed in a safe manner.  The program reviews the safety record of contractors so that contractors with proven safe work practices are allowed to work in the Mill.  Prior to the start of work, Weyerhaeuser explains to all contractor supervisors the hazards of the process on which they and their employees will work, Weyerhaeuser safe work practices and Weyerhaeuser emergency response procedures.  In addition, Weyerhaeuser requires that the contractor supervisor train each of their employees prior to the start of work at the Mill.  Weyerhaeuser periodically reviews the contractors' training documents and work performance to ensure that safe work practices are followed.\n\n1.4.7  Pre-start-up Safety Review\n\nSince the Filter Plant has been usin"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 15392,
      "SummaryText": "nse plan complies with other federal contingency plan regulations (e.g., the OSHA regulations 29 CFR 1910.38(a), 29 CFR 1910.120(a)) and has been communicated to local emergency response officials through the local fire department and the LEPC.\n\n1.7  Planned Changes to Improve Safety\n\nWeyerhaeuser constantly strives to improve the safety within the Mill through both the incident investigation program and a program soliciting safety suggestions from the workers.  Also, Weyerhaeuser maintains compliance with OSHA's Process Safety Management regulation to ensure continued improvement in the safety of the process.  Currently, Weyerhaeuser attempts to use only 55 ton railcars of chlorine.  However, conditions might require the use of a 90 ton chlorine railcar.  The use of 55 ton railcar reduces the worst-case scenario potential from 18.5 miles to 15.7 miles to the toxic endpoint.  The alternative release scenario would not change."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 15392,
      "SummaryText": "g chlorine for many years, Weyerhaeuser performs a safety review of the process if any significant modifications are made to the process.  The safety review helps ensure that the process has been prepared to operate safely.  The review confirms that: construction and equipment are in accordance with design specifications; adequate safety, operating, maintenance and emergency procedures are in place; employee training has been completed; and, that a process hazard analysis or management of change requirements have been met.  During the pre-start-up safety review, Weyerhaeuser uses a checklist to ensure that appropriate issues have been addressed and to document the review.\n\n1.4.8  Mechanical Integrity\n\nWeyerhaeuser maintains the mechanical integrity of the process to help prevent equipment failures that could endanger workers, the public or the environment.  The mechanical integrity program has two major aspects to it: a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in the Filter Plant; and, an inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\nThe quality assurance program includes: specifications for replacements parts and equipment; procedures for safe work practices such as lock/out tag out, hot work, confined space entry and line or equipment opening; training of maintenance personnel; and, documentation of maintenance activities.\n\nThe inspection and testing program includes: specifications for inspecting and testing process equipment; procedures for inspecting, testing and maintaining process equipment; training of maintenance personnel; and, documentation of maintenance activities.\n\n1.4.9  Hot Work Permit\n\nWeyerhaeuser has a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions within the mill.  Prior to performing hot work (such as welding, grinding, cutting), personnel"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 15392,
      "SummaryText": "are required to fill out the Hot Work Permit Form.  Training in the use of the Hot Work Permit Form is included in the Weyerhaeuser safe work practices orientation.\n\n1.4.10  Management of Change\n\nWeyerhaeuser's management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for the Filter Plant to help ensure that the change does not negatively affect safe operations.  Process changes determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change review.  All other changes are confirmed through the full management of change review to help ensure: inadvertent consequences of process changes are prevented; safety consequences of changes are addressed; affected process safety information and procedures are updated; and, affected employees are notified of the changes.\n\n1.4.11  Incident Investigation\n\nWeyerhaeuser investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  Weyerhaeuser trains employees to identify and report any incident or near-miss requiring investigation.  An investigation team is assembled, and the investigation is initiated within 24 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n1.4.12  Compliance Audits\n\nWeyerhaeuser audits the Filter Plant process to be certain that the prevention program is effectively addressing the safety issues of Filter Plant operations.  Weyerhaeuser assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are docume"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 15392,
      "SummaryText": "nted, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n1.4.13   Chemical-specific Prevention Steps\n\nWeyerhaeuser has implemented safety features specific to the chlorine used at Filter Plant.  Chlorine is supplied in DOT-approved 55 or 90 ton rail cars.  The length of piping containing chlorine is kept to a minimum to reduce the likelihood of a release.  If a release occurs at the rail car or inside the Filter Plant building, an automatic valve at the chlorine unloading station closes and only the quantity in the piping will be released.  Visual and audible chlorine alarms are provided in most areas containing chlorine.\n\n1.5  Five-year Accident History\n\nA thorough review of all environmental, safety and process information indicates that Weyerhaeuser has had no accidents involving chlorine at the Filter Plant that have resulted in any injuries or damages on or off-site.\n\n1.6  Emergency Response Program\n\nWeyerhaeuser has a written emergency response program to help safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n\n - Informing the local fire department and the public about accidental releases that could reasonably result in offsite consequences.\n\n - Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at Weyerhaeuser.\n\n - Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment.\n\n - Inspecting and maintaining emergency response equipment.\n\n - Reviewing and updating the emergency response plan.\n\nWeyerhaeuser maintains an emergency response team trained in these emergency response procedures.  All Weyerhaeuser personnel are trained in evacuation procedures.  Weyerhaeuser periodically conducts emergency response drills, including annual drills coordinated with local emergency response agencies.\n\nThe written emergency respo"
    }
  ]
}