{
  "FacilityID": 15629,
  "FacilityName": "Fort Payne Wastewater Treatment Plant",
  "FacilityStr1": "2200 Industrial Blvd. SW",
  "FacilityStr2": null,
  "FacilityCity": "Fort Payne",
  "FacilityState": "AL",
  "FacilityZipCode": "35968",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01049",
  "LEPC": "DeKalb County LEPC",
  "FacilityLatDecDegs": "34.431639",
  "FacilityLongDecDegs": "-85.767722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 980603401,
  "ParentCompanyName": "City of Fort Payne, Alabama",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Fort Payne, Alabama",
  "OperatorStr1": "200 Gault Ave. S",
  "OperatorStr2": null,
  "OperatorCity": "Fort Payne",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35967",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": "ALD980603401",
  "EPAFacilityID": "100000157572",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-07-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-04-17 00:00:00",
  "DeRegistrationEffectiveDate": "2002-04-04 00:00:00",
  "AnniversaryDate": "2004-07-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.431638,
  "FRS_Long": -85.767722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21596,
      "AltID": "Wastewater Treatment",
      "FacilityID": 15629,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 27475,
          "ProcessID": 21596,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22167,
          "ProcessID": 21596,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 8550,
              "Process_NAICS_ID": 22167,
              "SafetyReviewDate": "1999-05-15 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-15 00:00:00",
              "ChangeCompletionDate": "1999-07-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-15 00:00:00",
              "TrainingReviewDate": "1999-01-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "V-Notch Chlorinators and Regulator Valves on Ton Containers",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 8946,
                  "PreventionProgram2ID": 8550,
                  "ProcessChemicalID": 27475
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15629,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "LEPC DeKalb County",
    "CoordinatingAgencyPhone": "2568458569",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15629,
      "SummaryText": "Executive Summary - Fort Payne Wastewater Treatement Plant\n\nEPA ID: ALD980603401\n\nThe Fort Payne Wastewater Treatment facility (Fort Payne WWTP) treats on average 3.2 million gallons per day of sewage from the nearby community of Fort Payne, AL. The Fort Payne WWTP consists of several wastewater treatment processes, including Chlorination, High Rate Trickling Filtration, Sedimentation and Biological oxidation. Treated water and sludge, following disinfection with Chlorine, is then disposed of in accordance with State and Federal laws.\n\nChlorine gas has been in use for nearly a century as the choice disinfectant in the treatment of both sewage for discharge and surface and ground water for drinking.  Currently the Fort Payne WWTP maintains a maximum inventory of 4,000 pounds of Chlorine gas.  Under EPA's Risk Management Program, Clean Air Act 112(r), any industry utilizing Chlorine, a regulated gas, above the threshold level of 2,500 pounds, must develop a Risk Management Plan and implement a Risk Management Program.\n\nThe Fort Payne WWTP, in implementing their Risk Management Program (RMP), is currently undergoing changes in both process design and operations, as well as improving on their emergency response preparedness plans.  In addition, the Engineering firm of Ladd Environmental Consultants, Inc., located in Fort Payne, is involved in a major restructuring of the Fort Payne WWTP.  The Chlorination process, among many others, will be improved with better process design and equipment during the next 18 months.  Currently there are Contractors on site and the rebuilding of the Fort Payne WWTP is underway.\n\nIn the spirit and law of the RMP, the Fort Payne WWTP recognizes and is pursuing optimal public involvement in response to regulated substance emergencies.  The Fort Payne WWTP acknowledges that as a result of being in compliance with the RMP Rule, the safety of the surrounding community as well as that of on-site workers is significantly enhanced.  From improved"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15629,
      "SummaryText": "record-keeping, training and operating procedures to better engineering design, the Fort Payne WWTP is dedicated to minimizing the risk of using Chlorine gas while at the same time improving the quality of local services.\n\nChlorine gas is required at the Fort Payne WWTP for disinfecting sewage prior to further treatment and disposal.  The Fort Payne WWTP recognizes that Chlorine gas, if accidentally released into the environment, may cause severe injury and even death for a significant distance from the source.  The Fort Payne WWTP has recently adopted new policies under its RMP to prevent and prepare for the uncontrolled release of a regulated (toxic) gas from the Fort Payne WWTP.\n\nThe Fort Payne WWTP is currently owned and operated by the City of Fort Payne, AL. The Fort Payne Wastewater Treatment Plant is overseen by the Mayor of Fort Payne, Mr. Frank Parker.  Directly underneath Mr. Parker is the Plant's Chief Operator, Mr. Robin Campbell, the person who has the primary responsibility for the implementation of the RMP.  Mr. Campbell's responsibility under the RMP will include the training and execution of the facility's health, safety and environmental programs.  Additional individuals may be assigned responsibility for implementing individual requirements and will report to Mr. Campbell on delegated matters.  Responsible individuals will communicate information to other employees involved in operation and maintenance of the regulated process involving Chlorine gas, as required.  All responsible individuals so involved will be listed by name, title and duties, in the RMP located on site at this facility.\n\nAny material changes in the design or maintenance [except for replacements in kind] of the current regulated process will be introduced into the RMP by those delegated that authority under the guidelines of the RMP.  The public may contact the Fort Payne WWTP by calling (256) 845-4351 or the City of Fort Payne (256) 845-1524 for information regarding more de"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15629,
      "SummaryText": "s of a ton container of Chlorine gas occurs.  There are no mitigation features included in this Worst-Case analysis, such as enclosed buildings or other structures, for the uncontrolled release of the regulated substance. The endpoint radius for such a release, in which injury to those exposed is potentially possible, was calculated using parameters which are facility specific as well as criteria provided by EPA.  The endpoint radius was calculated to be 3.0 miles for the loss of a one ton containers of Chlorine gas.  Close to the source of such a release the potential for serious injury is high.\n\nThe safety mechanisms in place at the Fort Payne WWTP are designed to prevent the Worst-Case scenario from occurring.  One of the principal mechanical lines of defense are the vacuum regulator valves on the ton containers themselves. These valves release Chlorine gas only when a vacuum is applied, hence, if a line should break in the Chlorine process manifold , the regulator valves on the source will automatically shut off.\n\nAlthough the potential for an entire ton container of the gas to escape the Plant's boundaries is unlikely, it can happen.  The EPA requires all responders to such a release to coordinate with the local Emergency Management Agency, the Fire Department, HazMat specialists and other local authorities such as the Police Department and Sheriff's office, in order to effectuate the best plan for evacuation efforts, if needed, and other requirements to assure the greatest protection for those who may be exposed to the gas.  As described below, recommendations have been submitted regarding improved maintenance and safety, the introduction of a community siren system, as well as initial response activities developed through  coordinated efforts with the participating agencies and rescue organizations.  In the analysis of the Worst-Case scenario release the Fort Payne WWTP did not include mitigation features such as enclosed buildings or other physical devices w"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15629,
      "SummaryText": "hich might otherwise quench or disperse the released gas and reduce the endpoint radius calculated.\n\nAs part of the Worst-Case scenario Emergency Response Action the cooperating agencies considered, and is currently implementing, procedures for responding to sensitive receptors within the endpoint distance of the regulated gas.  For example, local Schools, Hospitals and other sensitive receptor sites are currently being integrated into the community's Emergency Response Plan through the efforts of the Fire Department, LEPC, Police Department and others.  Cooperative interaction between the various rescue organizations is enhanced under the RMP Program.  An evaluation of the potential impact of released gas on the surrounding environment is also included in the RMP. USGS maps showing the affected areas within the endpoint distance are filed within the facility's RMP.  The estimated population within the 3.0 mile endpoint radius is 4,600 persons.\n\nIn the Alternative Release Scenario the Ft. Payne WWTP adopted conditions of uncontrolled release in which the failure of a check valve results in the release of the regulated gas for a period of  approximately 60 minutes.  At this time the gas leak is arrested and brought under control by emergency response personnel.  The endpoint radius for Chlorine was calculated to be 1.2 miles (Ft. Payne WWTP choose a scenario provided by the AWWA's Compliance Guidance and Model Risk Management Program for Water Treatment Plants).  Mitigation features which impede the dispersal of the released gases, such as an enclosed building, were integrated into the Alternative Release Scenario calculations.  The population of Fort Payne affected within the 1.2 radius is estimated at 760 persons.\n\nCurrently the regulated gas is connected to the Chlorine process on a semi-open pad, with roof, located approximately 50 yards west of the Main office on site.  Current Phase 1 construction (underway) includes new chlorination equipment, regulators, valv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15629,
      "SummaryText": "tails about the Risk Management Plan.\n\nThe Fort Payne WWTP currently maintains up-to-date safety information related to the regulated substance, process, and equipment, including Material Safety Data Sheets for Chlorine, maximum intended inventories, and safe upper and lower temperatures, pressures and process flows for the regulated substance.  Equipment specifications and process design Codes and Standards are also maintained in the RMP document on site.\n\nIn the case of an uncontrolled release of Chlorine gas from the Fort Payne WWTP, an integrated Emergency Response Plan has been adopted involving the coordinated effort of several organizations, including the local Fire Department, Emergency Management Agency, local Police, Sheriff's office and local Medical Emergency services and Hospitals.  The Fort Payne WWTP is prepared to assess and repair incidental or controlled leaks of the regulated materials but is currently not authorized to respond to uncontrolled releases of Chlorine from their facility.  Instead, the Fort Payne WWTP has coordinated first response assistance from federally regulated Hazardous Materials (HazMat) specialists.  Currently the Fort Payne Fire Department, a trained Hazardous Waste Emergency Response Team, has coordinated with local Police, Hospitals, Ambulance services, and the Emergency Management Agency to initially respond to a Chlorine leak and take charge of Fort Payne WWTP's Emergency Action Plans.  A detailed description of these plans may be found in the RMP on site at the Fort Payne WWTP.\n\nEPA requires each regulated facility to analyze a Worst-Case Scenario release (the release of the entire contents of a regulated substance container) as well as an Alternative-Case Scenario in which the released regulated gas is brought under control at some point following uncontrolled release events.\n\nIn the Worst-Case Scenario, detailed within the facility's RMP, a scenario is considered in which the uncontrolled release of the entire content"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15629,
      "SummaryText": "es, piping, new chlorinators and new chlorovac units.  A building renovation is to be included in the second phase of construction which has not yet been designed.  Chlorine detectors are in place and set to activate an alarm system at 1 parts per million concentration.  This detector is tested everyday for responsiveness.  In the event of a partial release of Chlorine gas it is anticipated that the bulk of the gas will be contained within the immediate vicinity of the Chlorine area since there is a thick forested woodland down gradient from the Chlorine storage area.\n\nThere has been no accidental release of Chlorine gas beyond incidental events, such as minor leaks, in the last five years.\n\nDuring the development of the Fort Payne WWTP's RMP Program several recommendations were made which are currently being addressed.  Recommendations were introduced for windsocks, sirens, upgrading engineering process materials and instruments, and further upgrading the Fort Payne WWTP's standard operating procedures for all process activities which are material to the Chlorine process.  In addition, training will be improved upon and documented assuring that all Operators at the Fort Payne WWTP are competently trained in the design and everyday handling of Chlorine gas."
    }
  ]
}