{
  "FacilityID": 15709,
  "FacilityName": "Wabash Alloys, L.L.C",
  "FacilityStr1": "841 South 500 West",
  "FacilityStr2": null,
  "FacilityCity": "Tipton",
  "FacilityState": "IN",
  "FacilityZipCode": "46072",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18159",
  "LEPC": "Tipton County LEPC",
  "FacilityLatDecDegs": "40.722222",
  "FacilityLongDecDegs": "-86.113444",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2457617,
  "ParentCompanyName": "Connell, L.L.C",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Wabash Alloys, L.L.C",
  "OperatorStr1": "841 South 500 West",
  "OperatorStr2": null,
  "OperatorCity": "Tipton",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46072",
  "OperatorZipCodeExt": null,
  "FTE": 84,
  "OtherEPAFacilityID": "46072SRDCT100S5",
  "EPAFacilityID": "100000038853",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Wabash Alloys, Tipton, Indiana",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2008-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2008-12-01 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.291809,
  "FRS_Long": -86.116504,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21693,
      "AltID": "Aluminum Demagging",
      "FacilityID": 15709,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 27581,
          "ProcessID": 21693,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22264,
          "ProcessID": 21693,
          "NAICSCode": "331314",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 11805,
              "Process_NAICS_ID": 22264,
              "SafetyReviewDate": "1998-12-18 00:00:00",
              "PHA_Date": "1994-11-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": "Development of ERPs, Mechanical Integrity Program development, Automated Preventative Maint. Program, Risk Management Program development, HAZMAT team training, Emerg Response Equipment purchase",
              "OpProceduresReviewDate": "1998-12-18 00:00:00",
              "TrainingReviewDate": "1998-12-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-08 00:00:00",
              "EquipmentInspectionDate": "1999-04-08 00:00:00",
              "EquipmentTested": "Connections, Vaporizors, Regulators, Piping, Valves, Ejectors",
              "ChangeMgmtDate": "1998-04-08 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-08 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-12-18 00:00:00",
              "AuditCompletionDate": "1999-06-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-12-18 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-18 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-18 00:00:00",
              "ContractorSafetyEvalDate": "1998-12-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 16654,
                  "PreventionProgram3ID": 11805,
                  "ProcessChemicalID": 27581
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 15709,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-18 00:00:00",
    "ERTrainingDate": "1998-10-25 00:00:00",
    "CoordinatingAgencyName": "Tipton County Emergency Mgmt Ag",
    "CoordinatingAgencyPhone": "3176754165",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15709,
      "SummaryText": "Accidental release prevention and emergency response policies at Wabash\nThe policy of Wabash Alloys, is to develop those programs necessary to protect the health of its employees against on-the-job hazards which may cause sickness or injury now or in the future.  Also, as the operator of a facility at which substances may be used that in uncontrolled situations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention and compliance with legislative requirements.  The Risk Management Program (RMP) is one of these programs.\n     Each employee in areas where the RMP is applicable will be knowledgeable of the related policies and procedures and the supervisors or a designated person is required to insure that they understand them.  Employees and supervisors are required to comply with our policies and are subject to corrective action in those cases determined to indicate willful violation.\n\tA written plan of action regarding the implementation of employee participation in the program has been developed as a part of our Release Prevention Program as specified by 29 CFR 1910.119.  A compilation of safety information to enable Wabash Alloys and the employees involved in the chlorine operations to operate safety has been accumulated.  This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.  This plan of action includes information pertaining to the technology of the processes, and information pertaining to any equipment used in the processes.\nA complete hazard analysis and study of the chlorine systems' mechanical integrity has been completed on the chlorine receipt, storage, and utilization operations have been completed.  This analysis was completed by safety and health staff, engineering and maintenance personnel, and certain operational personnel.  This analyses involved a review of ea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15709,
      "SummaryText": "ch operation of the processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes.\nA system was developed and is maintained to promptly address the team's findings and recommendations.  The hazard analyses will be updated as needed and at least every five (5) years.\n\tWabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nJob Safety Analyses\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n\tEach employee involved in operations within the processes where the chlorine is received, processed, or used at the facility has been trained in an overview of the processes and in the operating procedures as outlined by OSHA regulations.  Refresher training is required every three years, and more often if necessary.  Training includes:\n\ta.  Emphasis on the specific safety and health hazards;\n\tb.  Emergency operations in the case of a release including shutdown; and\n\tc.  Safe work practices applicable to the employ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 15709,
      "SummaryText": "ee's job tasks.\n\tDesignated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \n\tContractors performing work on or adjacent to equipment or processes in which Chlorine is present must have clearance from the Maintenance Supervisor prior to beginning operations.  Each contractor will also complete the Wabash Alloys Divisional Visitor and Contractor Safety Rules form prior to entry into the facility.\n\tIn those cases where contractors will perform work directly to or on the process equipment in which the Chlorine is present, the Safety Coordinator and Maintenance Supervisor will provide an orientation section to them prior to beginning operations.  This orientation will include an introduction to the Wabash Alloys Process Safety Management Program, information concerning the toxicological and physical hazards of Chlorine, and the emergency response plan in the case of an incident involving a release.  Upon completion, the contractor will be issued a permit by the Maintenance Supervisor to begin work.\nThe Wabash facility and the Chlorine Process\n\tWabash Alloys provides employment for 84 workers in Tipton, Indiana.  This facil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 15709,
      "SummaryText": "ity is one of eight other Aluminum recycling plants in the United States owned by Connell Ltd.  As a manufacturer of aluminum ingots its products are sold globally under its corporate company, Connell, 1 International Place, Fort Hill Square, Boston Massachusetts.\nSite Description:\n\tThe facility  is located in Tipton, Indiana in the Tipton, Indiana Industrial Park at 841 South 550 West. \nGeography and Weather:\n\tThe city of Tipton is located in approximately 25 miles from Indianapolis.  The city is a part of Tipton County.\n\tTransportation in the county is via U.S. 31 and State Roads 28, 19 and 213.  Interstate 465 is within a 25-minute drive South on U.S. 31.  Interstates 65 and 69 are 30-minutes from Tipton County.  Railroads include service by Norfolk & Western Railway Co. and Norfolk & Western Railway are subsidiaries of Norfolk Southern Corp. which serves the Tipton area as well as 26 states and most major cities east of the Missisippi River.\n\tThe nearest airport is the Indianapolis International Airport is a 45-55 minute drive from Tipton, and is serviced by most of the major airlines in the U.S.\n\tThe annual average temperature in January is 29.90 and in July 75.70 .  The average annual preciptiation is 40.7\" with an average annual humidity of 73%.\n\tPopulation and Labor Force\n\tThe population in the city of Tipton in 1996 is 5,164.  The labor force is 8,840.\n\tGovernment and Law Enforcement\n\tThe government type is a Board of County Commissioners.  Also, there are seven County Council members.  Law Enforcement is by a police force of 9 full-time and four reserve police officers.  There is a 911 service available.\n\tFire Department\n\tThere are ten full-time and two part-time firefighters.\n\tSchools\n\tThe population is serviced by two elementary schools, one junior high and one high school.\n\tMedical Care\n\tThe town is supported by an acute care facility, Tipton County Memorial Hospital.\nOperation Description\n\tPreviously the site was owned and operated by U.S. Reduction Co"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 15709,
      "SummaryText": "mpany.  While owned by U.S. Reduction Company a secondary aluminum smelter operation was constructed and is presently in use by Wabash Alloys.  The site was purchased by Wabash Alloys in 1998.\n\tThe site process involves the sorting, grading, processing (removing organics via a rotary kiln), melting, and alloying of metals for sale.  As part of the sorting process, large aluminum scrap is shredded or crushed, and ferrous metals are removed using a maseparation process.  A dryer with a secondary combustion unit and baghouse is used to remove impurities from the aluminum scrap such as moisture, paints and resins.\n\tThe sorted aluminum is charged into one of three furnances where the metal is melted.  Once melted, various additives are used to modify the composition and hence the physical characteristics of the metal.  The metal is degassed by bubbling nitrogen through the molten metal.   Magnesium is removed by bubbling chlorine through the melt to form magnesium chloride.  Materials kept on-site for the process are aluminum, magnesium, zinc, copper, silicon, sodium, beryllium, and strontium.  All of these materials are in solid form and are stored inside the facility, except for the aluminum, which is kept outside.  Approximately 8,000,000 pounds of these materials are on-site at any given time.\n\tOnce the molten product is prepared, the melt is either poured and cooled as ingots or sows, or is transferred to heated crucibles for shipment as a molten material.  Particulate emissions from the crusher are controlled with a baghouse.  The emissions from the dryer are treated first using a secondary combustion unit, and then with a baghouse.  Emissions from melters, ingot and sow molding processes, and dross cooling operations are controlled using a baghouse.\n\tChlorine is received at the facility in one ton containers.  There are eleven containers as the main supply and four containers as a storage pad.  The containers are connected into piping through which chlorine as a l"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 15709,
      "SummaryText": "iquid flows to a vaporizer at a pressure of 150 psi. \n     The vaporizer heats the chlorine to the vapor state by a recirculated hot water electric heater which is thermostatically controlled.  Chlorine gas exits the vaporizer through a regulator and into a piping manifold.  Each furnace has its own chlorine supply pipe and flowmeter which regulates the pressure.\n     At each particular furnace the chlorine gas passes a shut off valve, then through another flowmeter, and then through a needle valve where its flow is regulated by the furnace operator to the molten metal pump.  Close to the needle valve is the tubing connection that connects to a carbon lance which feeds the gas to the pump housing.  Here the chlorine reacts with magnesium and aluminum to demag and clean the aluminum alloy.\n\tWorst-case release scenario and alternative release scenario\n\tAs a part of the Wabash Alloys proactive program concerning the hazards of chlorine to its' workers and the surrounding public, its staff has conducted a thorough hazard assessment.\n\tFor the hazard assessment and the RMP, populations potentially affected are defined as those within a circle that has as its center the point of release and its radius the distance to the toxic or flammable endpoint.  Owners or operators may use Census data to define this population.  The presence of schools, hospitals, other institutions, public arenas, recreational areas, and large commercial and industrial developments that can be identified on street maps within this circle must be noted.  The presence of environmental receptors within this circle must also be listed.  The EPA has defined environmental receptors as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas, that can be exposed to an accidental release.\n\tOne worst case scenario for chlorine was decided upon as the complete rapid loss of a 55 tons from the tan"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 15709,
      "SummaryText": "ker car during a one-minute time frame.  The only likely causes for such an incident is felt to be from a natural disaster or a derailment of the tanker car.\n\tThe worst case scenario for chlorine was decided as the complete rapid loss of one ton of chlorine during a one minute time frame. The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class D , 5.5 mph wind speed, and the level of 3ppm for chlorine.  This resulted in a release rate of 2,000 lbs/min, and an end point of 4.23 miles from the spill point during summer season at 90 degrees F and 4.04 miles from the spill point during winter season at 30 degrees F.  \n\tThe alternate case scenario for chlorine was decided as the loss of chlorine resulting from a release through a 1 inch line break. . The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class D , 5.5 wind speed, and the level of 10ppm for chlorine.  This resulted in a release rate of 2 lbs/min, for a duration of 15 minutes, and an end point of ..2 miles from the spill point.  \nGeneral accidental release prevention program and chemical-specific prevention steps\n\tPrevention of a release is a core component of the Wabash, LLC Risk Management Program.  This program is designed to insure proper work practices and an on-going mechanical integrity program.  This program also insures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part 68, Part 112, and Part 260.\n\tWabash Alloys has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documenta"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 15709,
      "SummaryText": "tion of standard operating procedures as a part of this program is included in the following documents:\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\nJob Safety Analysis\nTraining\nEach employee involved in operations within the process where Chlorine is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119.  Refresher training is provided no less than every three years and more often if necessary. \nMechanical Integrity\nAlso, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years.\nEmergency Response\nA team of individuals has been trained and is equipped as a HAZMAT team.  The team is equipped with Self-Contained Breathing Apparatuses, Level A suits and monitoring equipment to respond in an offensive manner.\n\tA record of the training, which contains the identity of the employee, the date of training, and the means, used to verify that the employee understood the training is completed and maintained.\n\tContractors.\n\tDesignated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Chlorine is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; m"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 15709,
      "SummaryText": "aintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \nFive-year accident history\nNo incidences of chlorine release have occurred at the facility that resulted in deaths or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nEmergency response program\n\t\tDue to the receipt, usage, and storage of Chlorine in large quantities, Wabash Alloys takes a proactive approach to the protection of its employees, the public, and the environment.  In consideration of the hazardous effects that Chlorine may have on human health and the environment the following outlines the facilities prevention and emergency response plans:\n\tWritten Emergency Response Plan\n\tOffensively Trained & Equipped Emergency Action Team in accordance with 29 CFR 1910.120\n\tDevelopment of a Written Implementation Plan of Action\n\tConduction of Hazard Analysis on routine and periodic basis\n\tDevelopment of and documentation of safe work practices\n\tInitial and periodic training of employees\n\tConduction of pre-startup safety reviews\n\tConduction of Compliance Audits\n\tConduction of incident investigations\n\tContractor Program Safety Program\n\tHot Work Permit Program\n\tProcess Safety Management & Chemical Accidental Release Prevention Committee\n\tMechanical Integrity & Preventive Maintenance Program\n\tDetermination and planning for Worst-Case and Alternative Case Release Scenarios\n\tContinual evaluation for methods to improve facility safety - Safety Committee\n\tMeetings with the Local Emergency Planning Committee and Fir Department\n\nPlanned changes to improve safety\n\tIn an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others is conducted for an average of 24 hours each year.  This tra"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 15709,
      "SummaryText": "ining requires the attendance by all personnel whose job may have any relationship to the chlorine operations."
    }
  ]
}