{
  "FacilityID": 15855,
  "FacilityName": "Dana Corp. Spicer Light Vehicle Axle Div.",
  "FacilityStr1": "2100 WEST STATE STREET",
  "FacilityStr2": "NA",
  "FacilityCity": "FORT WAYNE",
  "FacilityState": "IN",
  "FacilityZipCode": "46808",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18003",
  "LEPC": "Allen County LEPC 449-7513",
  "FacilityLatDecDegs": "41.101167",
  "FacilityLongDecDegs": "-85.170333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DANA CORPORATION",
  "Company2Name": "NA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DANA CORPORATION",
  "OperatorStr1": "P.O. BOX 750",
  "OperatorStr2": "NA",
  "OperatorCity": "FORT WAYNE",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46801",
  "OperatorZipCodeExt": null,
  "RMPContact": "WARREN COLE",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 2014,
  "OtherEPAFacilityID": "IND005470885",
  "EPAFacilityID": "100000157965",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T003-7741-00003",
  "SafetyInspectionDate": "1998-10-19 00:00:00",
  "SafetyInspectionBy": "INDEPENDENT CONTRACTOR",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-01 00:00:00",
  "AnniversaryDate": "2004-08-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.0965,
  "FRS_Long": -85.17186,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 21917,
      "AltID": "LPG Storage",
      "FacilityID": 15855,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 22494,
          "ProcessID": 21917,
          "NAICSCode": "33635",
          "_desc": {
            "NAICS_CODE": "33635",
            "NAICS_DESCRIPTION": "Motor Vehicle Transmission and Power Train Parts Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 27990,
          "ProcessID": 21917,
          "ChemicalID": 98,
          "Quantity": 535500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 527990,
          "ProcessID": 21917,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 15855,
      "SummaryText": "The accidental release prevention and emergency response policies at the facility:  The Dana Spicer Light Vehicle Axle Division (SLVAD) facility of Dana Corporation complies with NFPA-58 requirements for LP-Gas storage, and it is SLVAD policy to adhere to all applicable federal, state and local laws and regulations.\n\nA description of the facility and the regulated substances handled:  The SLVAD facility includes a maximum quantity of liquefied propane gas (LPG) approximating 535,500 pounds in five, 29,835 gallon pressurized containers. These LPG containers are maintained at a maximum of 85% capacity.  The LPG is utilized as a backup fuel for the facility and is the only substance handled at the facility that is currently regulated under the Clean Air Act Amendments of 1990 (CAAA), Section 112(r) Risk Management Planning requirements.  Propane (CAS No. 74986) is designated as a regulated flammable substance (gas) under the U.S.EPA Provisions for Chemical Accident Prevention (40 CFR  Part 68) with a proposed threshold quantity of 67,000 pounds.  Since the facility stores quantities of LPG in excess of this applicable threshold, SLVAD is required to prepare and submit a Risk Management Plan and comply with the requirements of 40 CFR 68 as authorized by the CAAA, Section 112(r).  The NAICS Industrial Code for the facility is 33635, and according to 29 CFR 1910.119(a)(1)(ii)(A), which states that hydrocarbon fuel used solely for workplace consumption as a fuel, if such fuel is not a part of a process containing another highly hazardous chemical covered by the OSHA standard, the facility is not subject to 29 CFR1910.119.  Consequently, the SLVAD RMP must meet 40 CFR 68 Program 2 RMP requirements, since the worst-case offsite consequence analysis, in terms of the distance to 1 psi over pressure in the event of maximum storage container evacuation, could potentially impact offsite populations and receptors.  \n\nThe worst-case release scenario:  The worst-case scenario proscr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 15855,
      "SummaryText": "ibed for the Dana facility is the failure of one of the 30,000-gallon storage tanks (per 40 CFR Part 68, Subsections 68.25) when filled to the greatest amount allowed (85% at 60 F), resulting in a vapor cloud explosion, due to the release of 107,100 pounds of propane.  Based on  EPA's RPMComp Model calculations, the distance to the 1 psi over pressure endpoint is 0.38 miles.   Within this area potential receptors include: approximately 1,926 homes; a population of approximately 4,334 people; one (1) school and one (1) shopping center. \n\nThe general accidental release prevention program and chemical-specific prevention steps:  This facility complies with EPA's accident prevention rule and all applicable codes and regulations. The propane system is designed, installed, and maintained in accordance with NFPA-58 and state law.\n\nFive-year accident history:  The SLVAD facility  has not had an accident involving propane that caused deaths, injuries, property or environmental damage, or evacuations, within the past five years.\n\nThe emergency response program:  The SLVAD facility complies with NFPA-58 requirements for LPG storage, and it is policy to adhere to all applicable federal, state, and local laws and regulations. If an emergency were to occur, it is SLVAD policy to notify the City of Fort Wayne Fire Department and request that they respond to the emergency.  Additionally, The Allen County Emergency Management Agency, and both Washington and Wayne Township officials will be notified.  The SLVAD facility property lies in both Washington and Wayne Townships.\n\nPlanned changes to improve safety:  None."
    }
  ]
}