{
  "FacilityID": 1594,
  "FacilityName": "SOUTHERN NEVADA WATER SYSTEM",
  "FacilityStr1": "243 LAKESHORE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "BOULDER CITY",
  "FacilityState": "NV",
  "FacilityZipCode": "89005",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "CLARK COUNTY L.E.P.C.",
  "FacilityLatDecDegs": "36.071111",
  "FacilityLongDecDegs": "-114.813111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AE",
  "FacilityURL": "www.SNWA.com",
  "FacilityEmailAddress": "PUBLIC INFORMATION DEPARTMENT",
  "FacilityDUNS": 0,
  "ParentCompanyName": "SOUTHERN NEVADA WATER AUTHORITY",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DONALD RAZY",
  "OperatorStr1": "243 LAKESHORE DRIVE",
  "OperatorStr2": null,
  "OperatorCity": "BOULDER CITY",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89005",
  "OperatorZipCodeExt": null,
  "RMPContact": "DONALD RAZY",
  "RMPTitle": "OPERATIONS MANAGER",
  "FTE": 100,
  "OtherEPAFacilityID": "221310",
  "EPAFacilityID": "100000018946",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Water Treatment Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 36.11295,
  "FRS_Long": -114.86441,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1723,
      "AltID": "Chlorination System",
      "FacilityID": 1594,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1760,
          "ProcessID": 1723,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1831,
          "ProcessID": 1723,
          "ChemicalID": 62,
          "Quantity": 204000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501831,
          "ProcessID": 1723,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1594,
      "SummaryText": "Chlorine is used to disinfect surface water for ultimate use as potable water. The same properties that makes chlorine valuable as a disinfection agent also makes it necessary to observe certain safety precautions in handling to prevent unnecessary human exposure,  reduce the threat to personal health, protect co-workers, and to reduce the threat to nearby members of the community. It is the Southern Nevada Water Authority's policy to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which chlorine is handled and how the safety devices inherent in the design of this facility are operated and maintained.  Successful Process Safety Management involves education on safe handling procedures and continuous training.\n\nOur emergency response program is based upon the Chlorine Institutes standards and procedures and the OSHA 1910.119 process safety management program which contains emergency response information, hazard analysis and operational and maintenance procedures for working with chlorine and chlorine handling equipment. The emergency response plan includes procedures for notification of the local fire authority and notification of any potentially affected neighbors.\n\nThe purpose of this SNWS facility is to disinfect surface water from Lake Mead which is the primary source of drinking water in Southern Nevada.  The regulated substance handled at this distribution facility is chlorine and the maximum amount that can be stored at this plant is 212,370 pounds.   Water is pumped through multi-media filtration, chlorinated and pumped from an elevation of 1280 feet at the treatment facility along the shore of Lake Mead over the River Mountains (max. Elevation 3400 feet) to Boulder City, Henderson, Las Vegas, North  Las Vegas and outlaying areas.   \n\nChlorine is received by truck (transports) and the transports are kept in an enclosed building.  This facility has equipment for unloading transports and equipment to evaporate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1594,
      "SummaryText": " or gasify liquid chlorine for use as disinfectant. Access to the building is restricted to authorized facility employees and authorized management personnel.  The treatment facility maintains an on-site ambient monitoring system and prevailing winds are to the north-north west out across the Saddle Island cove and Lake Mead.\n\nThe Worst-Case Release Scenario selected was failure of a transport during delivery.  A release of 35,395 pounds of chlorine following a rollover incident outside the containment building was modeled.  No engineering controls (automatic interconnect shut offs,  isolation valves, etc.) are present.  22,972 pounds are released as a liquid at a maximum averaged sustained release rate of 11,900 lbs./minute which rapidly converts to vapor.  It is important to note the model calculated a volume that would \"self-contain\" by freezing inside the transport and also accounted for changes in release rate over time.  Most of the chlorine is released during the first 4 minutes.  A total release time of 10 minutes was used for this calculation.  The distance to the endpoint (at 0.0087 mg/l) is 5.2 miles. \n\nModeling the worst-case release scenario was completed using two programs that performed a specific function to accurately depict the movement of chlorine gas following a release.  The primary database used was the Computer Aided Management of Emergency Operations.  \"CAMEO\" is a database of several hundred chemical substances with pertinent data on chlorine.  CAMEO provided modeling input of  necessary characteristics such as molecular weight and vapor pressure required by the second stage of the model.\n\nAmbient data is collected 24-hours per day, year round.  One and a half years of data was available and used during modeling. A 10-meter tower is located within 1000 feet of the chlorine storage facility with Weather Measurement Corporation instruments feeding ambient data to a computer in the Operations control room.  Wind Speed is recorded using an MD103"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1594,
      "SummaryText": "HF device with 0-50 M/S scaling.  Wind Direction is recorded using an MD104-540 device with 0-540 degree scaling and  temperature is recorded using an MD621-20 device with - 40 to +50 degree C scaling.  Data shows winds are typically out of the south-southwest at 5-7 miles per hour.  Wind direction can vary from 140 to 295 degrees with prevailing winds ranging between 200 and 260 degrees.  A value of 230 was used for the model.\n\nThe second program used in the modeling effort was Area Locations of Hazardous Atmospheres or \"ALOHA.\"  This program did the calculation of end points, using data from CAMEO, three (3) years of available ambient monitoring data and the following assumptions: Time of year used was Summer because chlorine use at this facility is highest between June and August.  Time of day for model was 10:00 a.m. PST.  This correlates with transport change-outs which are performed during the day shift.  The highest maximum daily temperature measured from 1997 to 1998 was 121.6 degrees F (49.7 degrees C).  With a wind speed of 6.3 mph (2.8 m/sec. measured average), air stability class B was used during modeling.\n\nResidential population density within the 5.2 mile circle of impact for the worst case scenario was estimated at 12,000. This includes facility employees and a small residential population located in a trailer park and a portion of Boulder City Nevada southeast of the process area.  Both areas are upwind and Boulder City is topographically higher, making impacts to these facilities unlikely.  Government census records were referenced to arrive at the estimated population. \n\nLook-up tables from the EPA's Off-Site Consequence Analysis guidance document were referenced for completing the Alternative Release Scenario as there were provisions for emissions scrubbing which were not available in the modeling program.  A line failure of a 10 foot length of 1 inch hose was used as the alternative release scenario. The excess flow valves malfunction and fails "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1594,
      "SummaryText": "to stop the flow. The contents of the transport is released inside the containment structure.  It should be noted that the contents of the transport are released in just over 34 minutes.  The toxic endpoint for the alternative scenario would occur inside the containment building.  The resulting chlorine vapor is scrubbed through a sodium hydroxide scrubber which demonstrates 99.989 percent removal efficiency, effectively protecting the environment and population.   \n\nOther sources of data used in preparation of the worst case release model and the alternative scenario for this submittal included, the Compliance Guidance and Model Risk Management Program for Water Treatment Plants, American Water Works Association, Research Foundation - 1998, and The Chlorine Manual, The Chlorine Institute - 1997.  Associated drawings, inspection records and procedure revision information were provided by Southern Nevada Water System facility management.  The United States Geologic Survey Boulder Beach Quadrangle, Nevada-Arizona, 7.5 minute series (topographic map), was also referenced.\n\nThis facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations. This facility was designed and constructed in accordance with NFPA-58.  Active mitigation factors in use at this facility include continuous monitoring of the chlorine unloading and evaporation process which both occur inside a closed structure.  A chemical (sodium hydroxide) scrubber has been installed to convert chlorine vapors from a release to oxygen and water before gas is vented to the atmosphere.  Personnel adhere to established SOP and MOC rules that protect against unauthorized access to, use of and maintenance on the chlorine equipment.  Scheduled preventative maintenance' is performed on all chlorine equipment and there is extensive and on-going training of operations personnel.  Management has a strong commitment to safety and environmental protection.  There have bee"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1594,
      "SummaryText": "n no accidental releases of chlorine in over five (5) years. \n\nThis facility's emergency response program is based upon the Chlorine Institutes, \"Chlorine Manual\" and SNWS standard operating procedures.  SNWS has discussed and reviewed this program with the Southern Nevada Local Emergency Planning Committee, the Clark County Fire Department and the National Park Service.  Agency coordination is part of the Process Safety Management program and involves drills, training and communication with key groups.  A large transient population of  Lake Mead National Recreation Area visitors was considered during OCA, and coordination of emergency activities with Park Service Rangers has been included in emergency response plans.\n \nConstruction of this facility was completed in February of 1997.  The structure is considered \"state-of-the-art\" and in compliance with all applicable local, State and Federal requirements.  Procedural review, training development and improvements are on-going at this facility.  All  equipment changes or upgrades have been completed with \"equipment in kind\" under the facilities MOC program."
    }
  ]
}