{
  "FacilityID": 16180,
  "FacilityName": "LAKEWOOD WATER TREATMENT PLANT",
  "FacilityStr1": "8130 Congdon Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Duluth",
  "FacilityState": "MN",
  "FacilityZipCode": "55804",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27137",
  "LEPC": "FEDERAL EMERGENCY MANAGEMENT A",
  "FacilityLatDecDegs": "46.862222",
  "FacilityLongDecDegs": "-91.96",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77627883,
  "ParentCompanyName": "CITY OF DULUTH  PUBLIC WORKS AND UTILITIES",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Duluth, Public Works & Util",
  "OperatorStr1": "414 W. 1 St.",
  "OperatorStr2": null,
  "OperatorCity": "Duluth",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55802",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "MND985 692565",
  "EPAFacilityID": "100000158919",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 46.86222,
  "FRS_Long": -91.96,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22406,
      "AltID": null,
      "FacilityID": 16180,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 28642,
          "ProcessID": 22406,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 22993,
          "ProcessID": 22406,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12210,
              "Process_NAICS_ID": 22993,
              "SafetyReviewDate": "1999-05-22 00:00:00",
              "PHA_Date": "1999-02-03 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-04 00:00:00",
              "TrainingReviewDate": "1999-03-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Video training",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-01 00:00:00",
              "EquipmentInspectionDate": "1998-06-01 00:00:00",
              "EquipmentTested": "Hoist Inspection, SCBA, Piping, Cylinders",
              "ChangeMgmtDate": "1988-01-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-03 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-03 00:00:00",
              "ContractorSafetyReviewDate": "1999-02-03 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Changing One-Ton Chlorine Cylinders",
              "_chemicals": [
                {
                  "PrimaryKey": 17351,
                  "PreventionProgram3ID": 12210,
                  "ProcessChemicalID": 28642
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16180,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-03-19 00:00:00",
    "ERTrainingDate": "1999-05-11 00:00:00",
    "CoordinatingAgencyName": "DULUTH FIRE DEPT.",
    "CoordinatingAgencyPhone": "2187233201",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16180,
      "SummaryText": "Duluth Public Works and Utilities Department\nExecutive Summary to water treatment facility Risk Management Program\n\nU.S. Environmental Protection Agency (EPA) Risk Management Program(RMP) regulations are intended to prevent and minimize the impacts of accidental releases of extremely hazardous substances.  These rules are applicable to water treatment facilities that have maximum inventories above set thresholds.  The City of Duluth's Lakewood Water Treatment Plant exceeds the EPA's threshold limit (2500 lb) for Chlorine.  Our maximum Intended Inventory is 14,000 lbs.  Consequently, the City has assessed the risk posed by our facility to the community and outlined past and present efforts to run a safe and community-aware plant.  We take pride in having provided the highest level of water quality without incident since the present plant was built in 1976 and before. \n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE LAKEWOOD FACILITY\n \nOur goal in developing our Risk Management Program is to reduce the risk to employees and the public of injury or death from accidental release of chemicals.  The organization's  management is committed to achieving this goal.  High-level management commitment will promote employee commitment to success and will aid in procuring and productively using the necessary financial, physical, and personnel resources.\nThe purpose of the management program is to ensure that everyone who plays a part in the RMProgram understands their roles and responsibilities and that responsibilities are assigned for all program elements.\nThe Systems Operations Manager has overall responsibility for development, implementation and integration of the RMProgram.  The Chief Water Plant Operator holds overall responsibility for the RMProgram in the absence of the Systems Operations Manager.\nThe \"Compliance Guidance And Model Risk Management Program For Water Treatment Plants\"  compiled by the American Water Works Association is the model the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16180,
      "SummaryText": "Duluth Department of Water Gas used for developing this Risk Management Program.\n\nLAKEWOOD ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Lakewood Water Plant is toured and inspected annually by the Duluth Fire Department for purposes of familiarizing themselves with the layout of the plant in case of an emergency response to a chemical spill or\nfire.  The Fire Department has the power to cite us and enforce abatement of safety hazards, if any, during this inspection.  The Duluth Fire Department is HazMat trained and knowledgeable in  dealing  with all of the chemicals located on site.  Our operators will help as back-up,  off-site sources of information to the HazMat team as needed.  Our personnel are respirator trained and certified so in the obscure event additional assistance is required we can respond safely.\nThe plant has a written Emergency Action Plan which will direct employees in the best methods to prevent an incident and how to respond if one occurs.\n\nREGULATED SUBSTANCES HANDLED AT THE LAKEWOOD PUMP STATION\n\nThe Lakewood Water Treatment Plant & Pump Station is located at 8130 Congdon Boulevard in Duluth, Mn.  Water is drawn from Lake Superior at a point 1,560 feet from shore and at a depth of 72 feet.  The daily average pumped is 19,554,427 gallons.  The water is filtered and treated for asbestos-like fibers, bacteria, and turbidity through the use of floculants,  Chlorine and Flouride.   The treated water is held in a  500,000 gallon clear-well resevoir until it is pumped into the water distribution system by  42 and  36 inch diameter effluent main lines.\nA maximum total inventory of 14,000 lbs of Chlorine is on site.  Other regulated chemicals are below the EPA threshold for RMP requirements.  \nAt the Lakewood water treatment facility we test for the following:\n     1. Turbity                                   7. Hardness                          13. Nitrite                 19. Silica\n     2. Color                                  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16180,
      "SummaryText": "    8. Alkalinity                           14. Chloride             20. Flouride\n     3. Dissolved Solids                    9. Dissolved Oxygen (O2)    15. Sulfate               21. Zinc\n     4. Suspended Solids                10. Chemical O2 Demand       16. Calcium             22. Aluminum \n     5. Specific Conductance          11. BioChemical O2 Demand  17. Sodium              23. Copper\n     6. PH                                         12. Nitrate                               18. Iron                   24. Chlorine\n                                                                                                                                     25. Ammonia\n\nThere are also dedicated  test points along the Duluth water distribution system that are used to periodically test for: PH, total coliform, residual chlorine and occasionally iron if complaints are received.\n\nTHE WORST CASE SCENARIO AND THE ALTERNATE RELEASE SCENARIO\n\nThe Worst case release scenario (CLW-3) for Duluth's water treatment deals with the release of 2000 lbs of liquid chlorine from a ton cylinder. The cylinder is located within the interior structure of the facility.  The release is a catastrophic failure due to corrosion or impact and vaporization ultimately occurs.  The chlorine leaves the cylinder at a rate of 200 lbs per minute for a duration of 10 minutes.  The topography around the treatment facility is strictly rural and lies adjacent to Lake Superior.  The distance to the radial endpoint is 3.03 miles; an estimated population of 1200 individuals make up the total offsite impact area when campsites and hotels are full.\n\nThe alternate release scenario (CLA-4) for Duluth's water treatment facility is the release of 2000 lbs liquid chlorine from a ton cylinder.  Under this scenario, the cylinder is located within the interior structure of the facility.  The release is due to a tubing failure, bad connection, or valve failure resulting in the release of liquid through a 5/16 inch diameter"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16180,
      "SummaryText": " valve body opening.  Vaporization under this scenario ultimately occurs.  The chlorine leaves the cylinder at a maximum average sustained release rate of 69.5 lbs per minute for a duration of 31 minutes.  The topography around Duluth's treatment facility is strictly rural  with a radial extension that includes an estimated population of 700 individuals making up the total offsite impact area (seasonally when campsites are full.) \nThis alternate release scenario was chosen because of its specific model as a release from a horizontal cylindrical tank with the release occurring through a fuseable plug or valve in the bottom of the tank.  The chlorine escapes as a gas and liquid mixture.  This two- phase flow scenario best fits Duluth's water treatment facility.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM & CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Lakewood Water Treatment Plant complies with rules and regulations divised and enforced by the Minnesota Health Department, the EPA, the MPCA, OSHA, and  the National Fire Code.  The Minnesota Department of Health conducts annual inspections as does the Duluth Fire Department.  All hoists are inspected annually as well by certified hoist inspectors.\n\nGenerally, the City of Duluth has a strong Safety Program with a common goal of assuring every employee a safe and healthful work environment.  Policies have been developed and training conducted to meet all requirements of the Regulations.  Job Safety Analyses have been developed to ensure maximum safety and consistent training in changing Chlorine  cylinders.  Other JSA's are being planned.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe Lakewood Water Plant has never had an accidental release of chlorine\n\nTHE LAKEWOOD EMERGENCY RESPONSE PROGRAM \n\nThe Emergency Response Program for the Lakewood Water Treatment Facility is heavily dependent upon the local fire department.  The Duluth Fire Department has knowledge of the chemicals stored at Lakewood and are well trained and equipped in HazMat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16180,
      "SummaryText": " response  methods and procedures.  They will use perameters set down by this report for public notification.  The Fire Department has procedures set up for evacuation as appropriate to each emergency  situation. \n\nThe Fire Department and the Water Operators have had on-going training on Chlorine cylinder repair as well as all personal protective equipment needed to complete the job safely.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe  Lakewood Treatment facility is in the process of purchasing and installing a new electronic chlorine detector with alarms and digital read-out which will indicate leaks as well as their concentrations.\n\nWe will be retrofitting the hoist and trolley in the Chlorine Storage Room with a variable-speed control for more smooth movement of cylinders as they're rotated in and out of service.\n\nAnnual inspections as indicated will be continued and all recommendations of inspectors will be implemented  providing an assurance that safety of the plant and the community will remain paramount."
    }
  ]
}