{
  "FacilityID": 16191,
  "FacilityName": "City of Tempe - Papago Water Treatment Plant",
  "FacilityStr1": "255 East Marigold Lane",
  "FacilityStr2": null,
  "FacilityCity": "Tempe",
  "FacilityState": "AZ",
  "FacilityZipCode": "85280",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.448056",
  "FacilityLongDecDegs": "-111.935833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74466814,
  "ParentCompanyName": "City of Tempe",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Tempe, Water Management Div",
  "OperatorStr1": "P.O. Box 31",
  "OperatorStr2": null,
  "OperatorCity": "Tempe",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85280",
  "OperatorZipCodeExt": null,
  "FTE": 87,
  "OtherEPAFacilityID": "AZD982446767",
  "EPAFacilityID": "100000158964",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-02-15 00:00:00",
  "DeRegistrationEffectiveDate": "2004-09-01 00:00:00",
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.446685,
  "FRS_Long": -111.936828,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22417,
      "AltID": "Chlorine Injection Proces",
      "FacilityID": 16191,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 28653,
          "ProcessID": 22417,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23004,
          "ProcessID": 22417,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12215,
              "Process_NAICS_ID": 23004,
              "SafetyReviewDate": "1999-05-13 00:00:00",
              "PHA_Date": "1997-12-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-04 00:00:00",
              "TrainingReviewDate": "1999-04-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-04 00:00:00",
              "EquipmentInspectionDate": "1999-01-04 00:00:00",
              "EquipmentTested": "Tank regulators, hoses, valves, & piping; feeder tubes, hoses, regulators, valves & piping; injectors on manifold valves",
              "ChangeMgmtDate": "1998-11-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-18 00:00:00",
              "PreStartupReviewDate": "1999-01-10 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-12-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-02-17 00:00:00",
              "ContractorSafetyEvalDate": "1998-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17356,
                  "PreventionProgram3ID": 12215,
                  "ProcessChemicalID": 28653
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16191,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Tempe Fire Department",
    "CoordinatingAgencyPhone": "4808587271",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16191,
      "SummaryText": "The City of Tempe Water Management Division operates a safe, efficient water treatment facility at Papago Park which provides a quality drinking water supply to the citizens of Tempe, Arizona.\n\nThe City of Tempe Water Management Division developed this document to meet the requirements for a Program 3, Risk Management Plan (RMP) under the Accidental Release Prevention Program, Clean Air Act Amendments of 1990 for its water chlorination process located at the Papago Water Treatment Plant, 255 East Marigold Lane, Tempe, Arizona.\nThis RMP was prepared in accordance with the US Environmental Protection Agency (USEPA) requirements in 40 Code of Federal Regulations (CFR) Part 68.\nThe City of Tempe prepared this RMP in conjunction with the Arizona branch of EMCON Environmental Associates (EMCON).\nThe City of Tempe Accidental Release Prevention & Emergency Response Policies\nThe City of Tempe\u0012s policy is to conduct all operations in a safe and conscientious manner to prevent accidental releases of any hazardous material, including substances regulated through the Federal Accidental Release Prevention Program.  The City of Tempe trains its employees at this facility to properly handle and store hazardous materials to minimize the possibility of adversely affecting its worker's health, the workplace, the public, and the environment.  A chlorine gas detection system operates continuously in the areas where chlorine is stored or used for chlorination of water.\nIn the event of an emergency, the City of Tempe will contact the Tempe Fire Department to respond.  A designated emergency contact for the plant initiates emergency notifications.  All employees are trained in the proper procedures and their appropriate role in an emergency.  The Papago plant maintains a highly cooperative relationship with the Tempe Fire Department to ensure a full understanding of the chlorination system and emergency response and evacuation procedures related to regulated substances.\nGeneral Description"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16191,
      "SummaryText": "of Regulated Substance and Stationary Source\nThe City of Tempe's Papago Water Treatment Plant is located at 255 East Marigold Lane, Tempe, Arizona.  The Papago plant supplies drinking water to residents and businesses in Tempe.  Pressurized containers of liquid chlorine are stored and used at the plant.  The liquid chlorine is connected to the chlorine injection process and vaporized so that small amounts of chlorine gas are added to the water as a disinfectant. The North American Industrial Classification System (NAICS) code for this process is 22131, Water Supply and Irrigation Systems.\nChlorine is a dense, greenish-yellow gas with a pungent, irritating odor.  Chlorine used at the plant is contained in metal vessels designed to Department of Transportation standards.  The containers are stored and used in a concrete building with a chlorine gas detection system and a ventilation/scrubber system.  The ventilation/scrubber system is designed to neutralize a release of chlorine gas, should it occur.\nOff-Site Consequence Analyses Results\nThe RMP Program requires the evaluation of an accidental release of the regulated substance, in this case chlorine, from the process being considered.  In its General Guidance for Risk Management Programs, July 1998, USEPA states that the results obtained from modeling release scenarios should not be considered to predict the likely results of an accidental release.  The assumptions made in the computer models are very conservative and tend to overpredict the impact from an accidental release.  The results from such models have a high degree of uncertainty and should be viewed as providing a basis for discussion, rather than hard predictions.  \nAs required by USEPA for the RMP, the City of Tempe assessed two types of release scenarios for the chlorine process.  The first scenario is a worst-case release which is mandated by USEPA to be \u0013the release of the largest quantity of a regulated substance that results in the greatest distance"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16191,
      "SummaryText": "from the point of release to a specified endpoint\u0014 (40CFR'68.3).  The second scenario is an alternative release scenario which is more likely to occur than the worst-case scenario and reaches an endpoint offsite. For chlorine, the \u0013specified endpoint\u0014 is a concentration of 0.0087 milligrams per liter of air.  This endpoint concentration is intended to be conservative and protective.  This is a concentration below which it is believed nearly all individuals could be exposed for up to one hour without any serious health effects.  Details of these two scenarios are presented below.\nWorst-Case Release Scenario\nUSEPA requires that the worst-case release scenario be the release of the entire contents of the single largest vessel containing the regulated substance, in our case a container of chlorine.  USEPA\u0012s RMP*CompT model was used as the method for estimating the distance to the endpoint.  The RMP*CompT default values for release duration, wind speed, and atmospheric stability class were utilized for this modeling.  These default values are very conservative in predicting the distance to the endpoint.\nThe worst-case release scenario was designated as the release of 2,000 pounds of chlorine gas from a one-ton vessel at the facility.  This scenario allowed consideration that the release of chlorine gas to the outside air was slowed because these containers are located inside the chlorination building.  No other containers are affected by this release scenario.  USEPA does not allow active mitigation, such as the ventilation/scrubber system, to be considered when modeling the worst-case release.  Therefore, the effect of the scrubber was not considered for this scenario.  The distance from the site of the release to the endpoint extended beyond the boundaries of the Papago plant.  Public receptors are located within this distance to the endpoint.\nAlternative Release Scenario\nThe alternative release scenario gives us an opportunity to present a potential release impact wh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16191,
      "SummaryText": "ich is more credible than the worst-case scenario.  However, it should be noted, given the safety and accident prevention mechanisms in place at Papago, this alternative release scenario is not considered to be highly likely.  The RMP*CompT default values for release duration, wind speed, and atmospheric stability class were utilized for this modeling.  Once again, these values are very conservative.  \nFor the alternative release scenario it was assumed that an operator failed to close the valve on a one-ton vessel at the facility before disconnecting the regulator for maintenance.  Under this scenario approximately 11 pounds of chlorine gas are released into the interior of the chlorination building.  When this occurs the chlorine monitoring sensors detect the release and activate the ventilation/scrubber system.  The scrubber system is designed to neutralize 100% of a release of this size.  It was conservatively assumed that 98% of the chlorine released was neutralized by the scrubber system.  The distance from the site of the release to the endpoint did not extend beyond the boundaries of the Papago plant.  Public receptors are not located within this distance to the endpoint.\nSummary of the General Accidental Release Prevention Program & Chemical Specific Prevention Steps\nThe City of Tempe's release prevention program complies with Federal Accidental Release Prevention requirements for chlorine.  The City of Tempe's prevention program emphasizes thorough training for its employees in hazard communication; proper handling, transfer, storage, and use methods; and awareness level emergency response.  The City of Tempe's standard operating procedures include diligent observation of the chlorine system vessels, piping, valves, and other equipment.  The chlorination system is designed and constructed in accordance with Chlorine Institute standards and Occupational Safety and Health Administration requirements for safety.  Secondary containment designed to contain a li"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16191,
      "SummaryText": "quid chlorine release is present in the chlorination building.  A chlorine detection system monitors the inside and outside of the chlorination building continuously for chlorine.  If a chlorine release is detected by the sensors, an audible and visual alarm will sound to initiate emergency response procedures and the ventilation/scrubber system is automatically activated. \nSummary of Five-Year Accident History\nOn the basis of a review with the City of Tempe during preparation of this RMP, there have been no accidents or accidental releases involving the Papago chlorine system in the last five years.\nSummary of the Emergency Response Program\nThe City of Tempe's Papago facility has a written Emergency Response Plan.  The focus of the plan is to protect the public, protect employees, protect public property, and protect Papago facilities.  The facility uses a continuous chlorine detection system to monitor for a release 24 hours a day.  Immediately after discovering a release of chlorine, Papago personnel are instructed to notify the Tempe Fire Department for initial response and evacuate the area affected by the release.  The Tempe Fire Department will be the primary responder to a chlorine release.\nPlanned Changes to Improve Safety\nThe City of Tempe Water Management Division Papago Water Treatment Plant has an excellent safety record and is continually evaluating ways to improve safety at the site.  Chlorine system operators and maintenance personnel are trained and updated in the hazards of chlorine and proper operation of the chlorine  system."
    }
  ]
}