{
  "FacilityID": 16196,
  "FacilityName": "ADC-Gary",
  "FacilityStr1": "3400 West 4th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Gary",
  "FacilityState": "IN",
  "FacilityZipCode": "46406",
  "Facility4DigitZipExt": "1706",
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.606667",
  "FacilityLongDecDegs": "-87.355833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74403296,
  "ParentCompanyName": "Anderson Development Company",
  "Company2Name": null,
  "CompanyDUNS": 2931228,
  "Company2DUNS": null,
  "OperatorName": "Anderson Development Company",
  "OperatorStr1": "1415 East Michigan",
  "OperatorStr2": null,
  "OperatorCity": "Adrian",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49221",
  "OperatorZipCodeExt": "3499",
  "FTE": 21,
  "OtherEPAFacilityID": "46404NDRSN3400W",
  "EPAFacilityID": "100000159017",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-01-13 00:00:00",
  "DeRegistrationEffectiveDate": "2005-09-30 00:00:00",
  "AnniversaryDate": "2004-06-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.604042,
  "FRS_Long": -87.380493,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22424,
      "AltID": "SBR Resin",
      "FacilityID": 16196,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 28665,
          "ProcessID": 22424,
          "ChemicalID": 120,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23011,
          "ProcessID": 22424,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12220,
              "Process_NAICS_ID": 23011,
              "SafetyReviewDate": "1998-04-17 00:00:00",
              "PHA_Date": "1999-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-04-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "regular checks of rupture disks",
              "OpProceduresReviewDate": "1999-01-25 00:00:00",
              "TrainingReviewDate": "1998-09-30 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "review written instructions",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-20 00:00:00",
              "EquipmentInspectionDate": "1998-12-20 00:00:00",
              "EquipmentTested": "reactors & tanks",
              "ChangeMgmtDate": "1999-01-25 00:00:00",
              "ChangeMgmtReviewDate": "1998-09-30 00:00:00",
              "PreStartupReviewDate": "1999-02-28 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1998-07-11 00:00:00",
              "InvestigationChangeDate": "1998-08-07 00:00:00",
              "ParticipationPlansReviewDate": "1997-11-03 00:00:00",
              "HotWorkPermitReviewDate": "1997-05-13 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-31 00:00:00",
              "ContractorSafetyEvalDate": "1997-11-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17362,
                  "PreventionProgram3ID": 12220,
                  "ProcessChemicalID": 28665
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16196,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-20 00:00:00",
    "ERTrainingDate": "1998-03-17 00:00:00",
    "CoordinatingAgencyName": "Gary Fire Department",
    "CoordinatingAgencyPhone": "2198814779",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16196,
      "SummaryText": "Risk Management Plan Executive Summary\n                                       Anderson Development Company - Gary Plant\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nAnderson Development Company is strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program that includes design, installation, operating procedures, maintenance, and employee training in the processes at our facilities. It is our policy to implement appropriate controls to prevent releases of hazardous substances. If such a release does occur, our highly trained personnel will respond to control and mitigate the effects of the release. We also coordinate our training and response efforts with the Gary Fire Department which provides additional emergency response administrative capabilities. \n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nADC-Gary manufactures a range of specialty chemicals including styrene butadiene resins, urethane curatives, and high purity organic borate compounds. We have one hazardous material at our Gary plant which is subject to the Risk Management Plan regulations. Our maximum inventory of 1,3-butadiene exceeds the RMP threshold quantity of 10,000 pounds and could be involved in a worst case scenario.   \n\n\n3.    The Worst Case Release Scenario and the Alternative Release Scenarios, including administrative        controls and mitigation measures to limit the distances for each reported scenario\n\nRequired offsite consequence analysis has been performed using the  tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance. \n\nThe worst case release scenario for 1,3-butadiene calls for the release of the maximum raw material contents of a rail car over 10 minutes in gaseous form. Under the most unfavorable atmospheric conditions, the EPA estimates such a release could result i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16196,
      "SummaryText": "n an explosion which would impact a maximum distance of half a mile when an overpressure of 1 psi is used as the impact endpoint.\n\nAn alternative release scenario for 1,3-butadiene could involve the release of the several thousand pounds of butadiene in gaseous form for 10 minutes. Under the most unfavorable atmospheric conditions, the EPA estimates such a release could result in a flammable vapor cloud for an area significantly less than 0.1 mile from the source.\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific \n       Prevention Steps\n\nADC has taken all necessary steps to comply with the accidental release prevention requirements. Our Gary facility meets all requirements of State Building Codes and Indiana OSHA' s Process Safety Management standard for chemical processes, as well as the Community Right To Know notification requirements of EPCRA and TRI. The following sections briefly describe the elements of the accidental release prevention program in place at the ADC-Gary facility. \n\nProcess Safety Information - Detailed records of process safety information describing chemical hazards, operating parameters and equipment designs are maintained for all processes.\n\nProcess Hazard Analysis - Comprehensive HAZOP studies are conducted for our chemical processes to ensure that all potential hazards are identified and controlled efficiently. The methodology for these logic analyses is generally a software package of what if checklists. The studies are performed by teams of qualified personnel from engineering, safety, management, and operators who are familiar with the operational details of each particular process. The studies are revalidated at intervals of three years or whenever major process changes occur. Any findings related to the hazard analysis are addressed.\n\nOperating Procedures - Written operating procedures are maintained for all processes. These procedures cover initial startup, normal operations, temporary conditions"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16196,
      "SummaryText": ", normal shutdown and emergency shutdown.  The information is regularly reviewed and routinely followed by process operators.\n\nTraining - Our comprehensive training program is the basis for certification of the process specific competency of each operator. Refresher training training is provided every three years at the time of PHA reviews. \n\nMechanical Integrity - ADC performs documented maintenance checks on process equipment to ensure reliable operations. Process equipment inspected includes: reactors, storage tanks, piping systems, relief and vent systems, emergency generators and shutdown systems, pumps, and control systems. Maintenance operations are performed by qualified personnel trained and certified in maintenance practices. All identified deficiencies are corrected in a safe and timely manner.\n\nManagement of Change - Necessary process changes to chemicals, technology, equipment and procedures are made in accordance with methodical written management procedures. Process operators and maintenance personnel are informed of and provided training to safely and reliably deal with necessary process modifications.  \n\nPreStartup Safety Reviews - Whenever startups of new processes or modified processes occurs, a hands on review is conducted to confirm that construction, equipment, operating and  maintenance procedures are suitable before equipment is placed into operation.\n\nCompliance Audits - Extensive reviews of all compliance aspects of accident prevention programs are performed every three years. Prompt corrective actions are performed upon audit completion.\n\nIncident Investigation - Any incident that has resulted in, or could reasonably result in the release of a hazardous substance is promptly investigated. These investigations are undertaken to identify the root cause of each incident as well as to identify any corrective actions to prevent releases from occurring.\n\nEmployee Participation - Process safety and accident prevention are a team effort. All proce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16196,
      "SummaryText": "ss employees are included in discussions concerning accident prevention issues and to recommend improvements. All process employees have access to all information in the accident prevention program, especially information from process hazard analyses.  \n\nContractors - ADC hires numerous area contractors to perform specialized maintenance and construction activities. The safety programs and performance of all contractors are evaluated and continually monitored. All individuals working for contractor firms hired by ADC receive annual safety training from ADC's Safety Department. ADC informs all contractor workers of known potential hazards related to each project's plan of action. All contractors are also informed of emergency response procedures and required to cease working should an accidental release occur.\n\n  \n5.    Five Year Accident History\n\nThere have been no accidental releases of RMP regulated chemicals from ADC's Gary facility which resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n6.   Emergency Response Plan\n\nADC has developed a written comprehensive emergency response plan to deal with all emergencies, including the accidental release of hazardous substances. The plan covers all aspects of emergency response including first aid and medical treatment, evacuations, shelter in place, notification of local emergency response agencies and the public, as well as post incident decontamination of affected areas. All emergency response equipment is regularly inspected and serviced. The emergency plan is promptly updated to incude response to any process changes. \n\n\n\n7.   Planned Changes to Improve Safety\n\nADC strives to continuously improve and update operating procedures, replace or maintain equipment to meet or exceed original specifications or design codes and to develop and implement safety improvement capital projects.\n\n\n8.   C"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16196,
      "SummaryText": "ertification Statement \n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:  Randy Gibbs\nTitle:    Environmental Engineer                                                                                        \nDate:   28 June 1999"
    }
  ]
}