{
  "FacilityID": 16234,
  "FacilityName": "Fountain Valley Authority Water Treatment Plant",
  "FacilityStr1": "13250 Ray Nixon Road",
  "FacilityStr2": null,
  "FacilityCity": "Fountain",
  "FacilityState": "CO",
  "FacilityZipCode": "80817",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08041",
  "LEPC": "Colorado Springs LEPC",
  "FacilityLatDecDegs": "38.633333",
  "FacilityLongDecDegs": "-104.7",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.csu.org",
  "FacilityEmailAddress": "http://www.csu.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Fountain Valley Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Colorado Springs Utilities",
  "OperatorStr1": "102 South Weber",
  "OperatorStr2": null,
  "OperatorCity": "Colorado Springs",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80903",
  "OperatorZipCodeExt": null,
  "RMPContact": "Curtis Mitchell",
  "RMPTitle": "Treatment Services Division Manager",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000034786",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-03 00:00:00",
  "SafetyInspectionBy": "Colorado Springs Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.65468,
  "FRS_Long": -104.69701,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22497,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 16234,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23085,
          "ProcessID": 22497,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 28765,
          "ProcessID": 22497,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 528765,
          "ProcessID": 22497,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16234,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Fountain Valley Authority Water Treatment Plant (FVA WTP), one of several facilities owned in part and operated in whole by the Colorado Springs Utilities (CSU).\n\nPrevention and Response Policies\nCSU believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, CSU has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the FVA WTP RMP for the chlorine system.  Correspondingly, CSU has determined to comply with the RMP Program 3 requirements although it is eligible for the less comprehensive requirements of Program 2.  By doing so, CSU affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of regulated chemicals.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  Accordingly, a well-developed and properly-implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\nCSU takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are well-informed regarding the hazards associated with the regulated processes (e.g., chlorine at the FVA WTP) and actively participated in comprehensive process hazard analyses.  The system employees are p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16234,
      "SummaryText": "roperly trained in the safe operation of the covered processes and the safe handling of treatment chemicals.  They are aided in this work by complete, understandable system operating procedures.\n\nCSU management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the FVA WTP RMP procedures and policies.\n\nAs for emergency response, CSU has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nStationary Source and Regulated Substances\nThe FVA WTP is located at 13250 Ray Nixon Road near Fountain, El Paso County, Colorado.  The FVA WTP takes Fry-Ark water from the Pueblo Reservoir and through a series of pump stations to the treatment plant, where the water is treated through coagulation, flocculation, sedimentation, filtration, and disinfection.  Chlorine is added to the raw water before coagulation, before filtration, and as the water leaves the plant for storage in the finished tank.\n\nThe plant treats six to eighteen million gallons per day (MGD), depending on the time of year.  The design treatment capacity of the FVA WTP is 18 MGD, which is expected to be the average daily treatment rate in 2006.  From the plant, the treated water is pumped to five different entities for public consumption.  Approximately 104,000 households or 250,000 over a 60 square mile area are served.\n\nThe FVA WTP utilizes chlorine as a biocide in the treatment of drinking water.  The chlorine is stored in one-ton containers with a maximum intended inventory of six containers (12,000 pounds) on site.  Therefore, the FVA WTP is regulated under the RMP rule due to the volume of chlorine stored and used at the facility.\n\nRelease Scenarios\nWorst-case and alternative release scenar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16234,
      "SummaryText": "ios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For worst-case release scenario, the regulation is clear.  The assumption is that a full one-ton container of chlorine is released over a ten-minute period.  No active mitigation may be considered.  Therefore, the scrubber is assumed not to work in this scenario.  Worst-case meteorological conditions as specified in the RMP regulation are also assumed to be present.  The release is also assumed to occur outdoors.\n\nFor the alternative release scenario, the facility reviewed the consequences of the loss of a fusible plug from a full one-ton container during offloading activities.  The incident would occur outdoors so that the scrubber or other active mitigation devices would not be effective.\n\nResults of the off-site consequence analyses are described in Sections 2 and 3 of the RMP*Submit plan for the FVA WTP.\n\nPrevention Steps for Chlorine\nThe prevention program and chemical-specific prevention steps are described in detail in the FVA WTP RMP manual.  The prevention program includes the following elements:\n7 Process safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment\n7 Process hazard analysis (PHA), which includes a systematic evaluation (by an employee team) of:  the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls\n7 Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions\n7 Training for each FVA WTP employee involved in operating the chlorine system\n7 Mechanical integrity procedures to maintain the on-going in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16234,
      "SummaryText": "tegrity of the chlorine process equipment\n7 Management of change procedures to manage changes (other than \"replacements in kind\") to the chlorine system\n7 Pre-startup safety review for additions or significant modifications to the chlorine process, or any new regulated chemical process\n7 Compliance audits at least every three years from 1999 to evaluate FVA WTP RMP compliance\n7 Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of chlorine from the FVA WTP\n7 Employee participation in the development and implementation of the FVA WTP RMP, and employee access to RMP information\n7 Hot work prohibition policy on or near the chlorine system when chlorine is present in the affected section of the process\n7 Contractor management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the FVA WTP emergency evacuation plan, limited access to the chlorine process, and evaluation of contractor performance\n\nIn addition to these elements, the chlorine storage facility at FVA WTP is equipped with a chemical scrubber.  In the event of a release of chlorine in the storage room, the normal ventilation system shuts down and the chlorine-contaminated air is sent to the scrubber for neutralization.  The scrubber is maintained and tested on a regular basis to ensure proper operation during a chlorine release event.\n\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of chlorine meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies, including the City of Colorado Springs Hazardous Materials Response Team.  The program is described in detail in the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16234,
      "SummaryText": " FVA WTP RMP manual and meets the requirements of 40 CFR 68.95, which include facility notification of emergency responders and evacuation.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held regularly at the FVA WTP.  Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nAs part of the development of the FVA WTP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered process."
    }
  ]
}