{
  "FacilityID": 16248,
  "FacilityName": "Wilbur West Power Plant",
  "FacilityStr1": "1900 Wilbur Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Antioch",
  "FacilityState": "CA",
  "FacilityZipCode": "94509",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.0125",
  "FacilityLongDecDegs": "-121.784167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 68135144,
  "ParentCompanyName": "GWF Power Systems Company Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GWF Power Systems Company Inc.",
  "OperatorStr1": "4300 Railroad Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "CAL000027429",
  "EPAFacilityID": "100000049752",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-29 00:00:00",
  "SafetyInspectionBy": "County Health Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-06-10 00:00:00",
  "DeRegistrationEffectiveDate": "2002-05-06 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.01251,
  "FRS_Long": -121.77722,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22519,
      "AltID": "DENOX System",
      "FacilityID": 16248,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 28798,
          "ProcessID": 22519,
          "ChemicalID": 56,
          "Quantity": 50880.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 23108,
          "ProcessID": 22519,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12274,
              "Process_NAICS_ID": 23108,
              "SafetyReviewDate": "1997-05-01 00:00:00",
              "PHA_Date": "1999-06-02 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Plant wide alarm system",
              "OpProceduresReviewDate": "1998-06-01 00:00:00",
              "TrainingReviewDate": "1998-06-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-07-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "Vaporizer",
              "ChangeMgmtDate": "1998-11-14 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-10-14 00:00:00",
              "AuditCompletionDate": "1999-04-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-07 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-17 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "DENOX System",
              "_chemicals": [
                {
                  "PrimaryKey": 17443,
                  "PreventionProgram3ID": 12274,
                  "ProcessChemicalID": 28798
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16248,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Contra Costa County Health Services",
    "CoordinatingAgencyPhone": "5106462286",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16248,
      "SummaryText": "EXECUTIVE SUMMARY FOR RMP*SUBMIT\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nGWF Power Systems Company, Inc. (GWF)'s Contra Costa County Power Plants store and utilize anhydrous ammonia at their facilities.  It is GWF's policy to comply with all applicable governmental regulations.  Further, it is GWF's objective to be a responsible citizen of the community in all of its business activities.\n\nGWF emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific training, operators and maintenance personnel receive training in fire prevention, fire control, accident prevention, safety, and first aid.  Additionally, an emergency action plan has been prepared for GWF and a chain of command to respond to emergencies has been established.\n\nGWF has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the Process Safety Management (PSM) standard and 40 CFR Part 68 (RMP regulations).  At least every three years, GWF audits these programs and any findings of noncompliance are documented and responded to and the deficiencies are corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nGWF Power Systems Company, Inc. built and operates five power plants located in Contra Costa County, California.  These plants, which began operation during 1989 and 1990, utilize petroleum coke as a fuel to produce electricity.  The GWF facilities and their addresses are listed below.\n\n    GWF East Third Power Plant, 895 East Third St., Pittsburg\n    GWF Loveridge Road Power Plant, 1600 Loveridge Rd., Pittsburg\n    GWF Wilbur West Power Plant, 1900 Wilbur Ave., Antioch\n    GWF Wilbur East Power Plant, 3400 Wilbur Ave., Antioch\n    GWF Nichols Road Power Plant, 555 Nichols Rd., Bay Point\n\nAt the GWF Contra Costa County Power Plants, there is one process that handles a regulated substance above the threshold quantity.  Anhydrous ammonia is used in th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16248,
      "SummaryText": "e fluidized bed combustion systems to help control the emissions of nitrogen oxides (NOx) from the exhaust stack.  These ammonia-based NOx reduction (DENOX) systems involve the injection of ammonia vapor into each of the recycle cyclones in the fluidized bed combustion system.  \n\nAlthough anhydrous ammonia is a stable compound, it begins to dissociate into nitrogen and hydrogen at approximately 8500 F.  Since the recycle cyclones operate at approximately 17000 F, the ammonia rapidly dissociates to nitrogen and hydrogen.  The dissociated ammonia reacts with the oxides of nitrogen in the flue gas to form nitrogen gas and water.\n\nLiquid ammonia is stored in a 11,000 gallon (water capacity) storage tank at each plant.  The maximum fill capacity of each of the ammonia storage tanks is limited due to a liquid level control system to 86.5 percent of the storage tank volume, which is slightly less than allowed by the American National Standard Institute's K61.1 safety requirements and the Occupational Safety and Health Administration (OSHA) regulations published in Section 1910.111 of 29 CFR (and Section 509 of Title 8, CCR).  Assuming the unlikely event that ammonia is delivered at 300F, the storage tank could hold 50,879 pounds of ammonia at 86.5 percent of the storage capacity.\n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  This concentration has been established by the American Industrial Hygiene Association as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16248,
      "SummaryText": "o assist in emergency response planning.  The RMP regulations require the owner or operator of a stationary source to analyze the offsite impacts due to an accidental release of a regulated substance.  The offsite consequence analysis for a Program 3 process must analyze the worst-case release scenario and an alternative release scenario.  Since GWF's DENOX systems are considered Program 3 processes, both release scenarios were evaluated in the offsite consequence analyses.\n\nThe offsite consequence analysis must include an estimate of the residential population within an area potentially affected by the accidental release scenario.  This area is defined as a circle with a radius equivalent to the distance the release would travel with concentrations at or above the endpoint.  The circle also defines the area in which potential environmental receptors must be identified.\n\nThe worst-case release is defined by the U.S. EPA as the total release of the contents of the single largest vessel or pipe within 10 minutes.  For liquefied gases stored under pressure, the entire contents of the vessel or pipe are assumed to be released as a vapor.  A total vapor release is highly unlikely.  However, this standardized worst-case scenario was developed for emergency response agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the worst-case release scenario.  For GWF, the alternative release scenario was selected based on the results of the Hazard and Operability Study for the ammonia-based DENOX process.  The worst credible release event with the highest discharge rate would potentially have the greatest offsite impact.  A failure of the ammonia delivery hose was identified in the Hazard and Operability Study as the worst credible release event having the highest release rate, and therefore, was chosen as the alternative release scenario.   \n\nGWF has analyzed the offsite consequences of the worst-case and alternati"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16248,
      "SummaryText": "ve release scenarios.  For the worst-case release scenario, the release of 50,880 lbs. of ammonia with a duration of 10 minutes, the plume would travel 2.6 miles at concentrations at or above the endpoint.  The population potentially affected within the worst-case release scenario circle for each facility is as follows:\n\nGWF East Third Power Plant:  40,000 persons\n\nGWF Loveridge Road Power Plant:  55,000 persons\n\nGWF Wilbur West Power Plant:  36,000 persons\n\nGWF Wilbur East Power Plant:  22,000 persons\n\nGWF Nichols Road Power Plant:  13,000 persons\n\nInformation on the sensitive receptors potentially affected by the worst-case release scenario is provided in RMP*Submit.\n\nAccording to the U.S. Geological Survey maps, the Sherman Island Waterfowl Management Area is the only environmental receptor within a worst-case release scenario circle.  This receptor would potentially be affected by a worst-case release event from GWF's East Third Power Plant, Loveridge Power Plant, Wilbur West Power Plant, or Wilbur East Power Plant.\n\nGWF has installed passive and active mitigation systems to aid in the control of ammonia, if a release were to occur.  A concrete containment wall surrounds the ammonia storage and vaporizer system.  A release of liquid ammonia from the storage tank could be contained within this area.  The containment would limit the ammonia surface area in contact with the ambient air, thereby decreasing the rate of evaporation.  \n\nThe ammonia storage system also includes an ammonia monitoring system which is designed to alarm if the ambient ammonia concentration reaches 50 ppm.  If the ambient concentration reaches 100 ppm, the monitoring system will activate a water deluge system that will spray water onto and around the storage tank and over the truck unloading station.  Since ammonia is soluble in water, the deluge system could reduce the atmospheric ammonia concentration around the storage tank and possibly help mitigate certain releases.  In the event of a f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16248,
      "SummaryText": "tion of the area.\n\nBased on a review of the U.S.G.S. maps, there are no environmental receptors that would be affected by the alternative release scenario from any of the GWF Contra Costa County Power Plants.\n\nGeneral Accidental Release Prevention Program and Chemical- Specific Prevention Steps\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been developed at GWF to address the anhydrous ammonia system.  The PSM program includes the following chemical-specific prevention steps:\n\n    Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\n    An initial Process Hazard Analysis (PHA) was performed and has been updated and revalidated at least every five years.\n\n    Written operating procedures have been developed and implemented, and are reviewed at least annually.\n\n    Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility have been developed and implemented.\n\n    Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\n    Written mechanical integrity procedures have been established and implemented.\n\n    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n    Pre-startup safety reviews are performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\n    Audits are conducted at least every three years to evaluate compliance with the PSM regulations.\n\n    Incident investigation procedures have been established.\n\n    A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n    Hot work permits are issued for all hot work operations "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16248,
      "SummaryText": "ire, this deluge system would cool the tank and help mitigate a temperature induced overpressure release.\n\nThe ambient ammonia monitoring system is designed to detect low concentrations of ammonia around the storage tank and alarm in the control room.  Early detection of a leak on the ammonia storage system may allow operations personnel to isolate the problem and limit any consequences of the release.\n\nThe ammonia storage tank is equipped with excess flow valves on the liquid and vapor pipelines.  Additionally, GWF has installed spring loaded isolation valves on the ammonia delivery pipelines.\n\nAlthough mitigation systems are installed, specific mitigation factors cannot be assigned to the systems in accordance with the U.S. Environmental Protection Agency's RMP Offsite Consequence Analysis Guidance document.  Therefore, no mitigation factors were included in the modeling.  As such, the modeling results should be substantially overstated.\n\nIn the alternative release scenario, a failure of the delivery hose was modeled as a release of liquefied ammonia stored under pressure.  For a release of 691 lb/min, the plume would travel 0.2 mile at concentrations at or above the endpoint.  \n\nAll of GWF's Contra Costa County Power Plants are located within industrial areas.  Other than industrial buildings, the only sensitive receptors within 0.2 miles of the facilities are a few residences near the GWF Wilbur West Power Plant and the GWF Wilbur East Power Plant.  There are no residences or other sensitive receptors within 0.2 miles of the GWF East Third Power Plant, the GWF Loveridge Power Plant, or the GWF Nichols Road Power Plant.  \n\nResidential receptors reported in RMP*Submit for the alternative release scenario were calculated by the LandView(tm) Environmental Mapping Software using 1990 Census data.  From visual observations of the area surrounding each facility, it is apparent that the population data provided by LandView significantly overstates the residential popula"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 16248,
      "SummaryText": "conducted on or near the ammonia system.\n\n    A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, GWF has assigned overall responsibility for the RMP elements to the Director of Environmental and Safety Programs.  The Director of Environmental and Safety Programs has the overall responsibility for the development, implementation, and integration of all of the RMP elements.\n\nFive-Year Accident History\n\nGWF's Contra Costa County Power Plants have not had any accidental releases from the ammonia-based DENOX system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nGWF has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facilities since GWF employees will not respond to accidental releases of ammonia, the facilities are included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n\nPlanned Changes To Improve Safety\n\nSince the PHAs were performed in January 1994, GWF has implemented the following improvements to improve safety:\n\n1)    Installed an extension of the deluge water spray system over the truck unloading area.\n\n2)    Installed hose bleed-off and fill pipe bleed-off for blind changing.\n\n3)    Increased frequency of valve overhaul from 5 years to 2 years.  \n\n4)    Re-tagged valves in the ammonia system for identification and implemented a daily check of the ammonia valves for leaks.  \n\n5)    Removed the vent line and installed a plug in the vaporizer vent.  Discontinued the practice of \"burp\" venting the vaporize"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 16248,
      "SummaryText": "rs.\n\n6)    Retrained employees at individual sites in valve line up, logbook entries, and lockout/tagout procedures.  \n\n7)    Changed the pressure control valve on each vaporizer.\n\n8)    Implemented hydrotesting procedures as part of the vaporizer inspections.\n\n9)    Replaced turbine meter flow transmitter with orifice plate flow transmitter.\n\n10)    Implemented monthly checks of all ammonia piping and valves outside of containment area.  \n\n11)    Added pressure transducer to the ammonia tank to allow board operators to check ammonia tank pressure (tank was already equipped with high/low alarms to the control room).\n\nThe following improvements will be completed by September 1, 1999 to improve safety:\n\n1)    Install an automated stop valve on the liquid line from the ammonia storage tank to the ammonia vaporizer.  If the ammonia tank pressure exceeds normal operating pressure limits, this stop valve will automatically close and isolate the ammonia tank from the vaporizer.  Activation of this isolation process will initiate an alarm in the control room and prevent further pressure increases by stopping the vaporization of liquid ammonia.\n\n2)    Add manual activation to the deluge system.\n\nCurrently, GWF is assessing a change from anhydrous ammonia to aqueous ammonia.  The potential impact of a release of aqueous ammonia would be significantly less than a release of anhydrous ammonia.  GWF is reviewing aqueous ammonia systems at other industrial plants and is having discussions with various equipment and chemical suppliers.  The feasibility of an aqueous ammonia system and the construction and operational costs are being reviewed.\n\nThrough the accidental release prevention program, GWF regularly evaluates the need for any additional changes to improve safety."
    }
  ]
}