{
  "FacilityID": 16411,
  "FacilityName": "Hatter's Pond Gas Plant",
  "FacilityStr1": "Radcliff Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Creola",
  "FacilityState": "AL",
  "FacilityZipCode": "36525",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.893889",
  "FacilityLongDecDegs": "-88.0675",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "madderl@texaco.com",
  "FacilityDUNS": 1345164,
  "ParentCompanyName": "Four Star Oil & Gas Co.",
  "Company2Name": "Texaco Exploration & Producing Inc.",
  "CompanyDUNS": 42064568,
  "Company2DUNS": 131114662,
  "OperatorName": "Texaco Exploration & Producing Inc.",
  "OperatorStr1": "Radcliff Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Creola",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36525",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff K. Lehrmann",
  "RMPTitle": "Asset Manager",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000058643",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Applied for",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.89389,
  "FRS_Long": -88.0675,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 22815,
      "AltID": "Hatter's Pond Plant",
      "FacilityID": 16411,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23405,
          "ProcessID": 22815,
          "NAICSCode": "21111",
          "_desc": {
            "NAICS_CODE": "21111",
            "NAICS_DESCRIPTION": "Oil and Gas Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 29219,
          "ProcessID": 22815,
          "ChemicalID": 155,
          "Quantity": 2700000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 20317,
              "ProcessChemicalID": 29219,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 20318,
              "ProcessChemicalID": 29219,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 20319,
              "ProcessChemicalID": 29219,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 20320,
              "ProcessChemicalID": 29219,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 20321,
              "ProcessChemicalID": 29219,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 529219,
          "ProcessID": 22815,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16411,
      "SummaryText": "Four Star Oil & Gas\nHatter's Pond Gas Plant\nRisk Management Plan\n\nExecutive Summary\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Four Star, Hatter's Pond Gas Plant has a long-standing commitment to worker and public safety. This commitment is demonstrated by our efforts in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, facility personnel will evaluate the situation, take actions within the capabilities of the facility, and/or notify the necessary outside agencies.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Hatter's Pond Gas Plant, located in Creola Alabama, U.S.A., operates a variety of processes to produce Condensate, Propane, Butane and Residue gas. The Hatter's Pond Gas Plant has regulated flammables, including:\n7 Iso-butane\n7 Normal Butane\n7 Ethane\n7 Methane\n7 Iso-Pentane\n7 Normal Pentane\n7 Propane\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThe worst-case scenario (WCS) associated with a release of flammable substance(s) at the Hatter's Pond Plant is a vapor cloud explosion (VCE) involving the largest inventory of propane contained in a single vessel/storage tank. The maximum inventory in this vessel/storage tank is 212,556.48 pounds. The entire inventory is assumed to release and ignite, resulting in a Vapor Cloud Explosion (VEC). The maximum distance to the 1-psi endpoint for this WCS is 0.50 miles as determined by EPA-RMP Comp (TM). Although we have numerous controls to prevent such releases and to manage their consequences, no credit for passive mitigation measures was taken into account in evaluating this WCS.\n\nThe alternate release scenario (ARS) for flammable substances at the Hatter's Pond Plant is a vapor cloud explosion resulting from a release of a flammable mixture from an Inlet Separa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16411,
      "SummaryText": "tor (2,469 lbs.). The maximum distance to the 1-psi endpoint for this event is 0.12 miles as determined by EPA-RMP Comp (TM). There are no toxic substances held above the threshold quantities at the Hatter's Pond Plant. \n\nEMPLOYEE PARTICIPATION\n \nEmployees are consulted with on developing process hazard analyses, investigating incidents, writing operating procedures, and developing different aspects of PSM/RMP. Every employee has access to documentation and files included in PSM/RMP. It is the responsibility of every employee at the plant to comply with the aspects of PSM/RMP. The document entitled \"Employee Participation\" explains this section of PSM/RMP in greater detail.\n\n\n\nPROCESS SAFETY INFORMATION (PSI)\n\nAccording to the PSM/RMP standard, there are three main aspects of Process Safety Information required to properly inform employees/public of the potential hazards of processes involving potentially hazardous chemicals.  They are the following:\n\nPotential hazards of chemicals in process:\n\nInformation concerning the chemicals in the process is included in Material Safety Data Sheets (MSDS).  They include information on the toxicity, permissible exposure limits, physical data, reactivity, corrosivity, thermal and chemical stability of the produced/processed materials and chemicals used in the plant. The potential hazards of different chemicals being mixed are covered under this subsection. Also covered are a worst case scenario and an alternate scenario, which could affect off site receptors.\n\nTechnology of process:\n\nThe technology of the process refers to descriptions of processes at the plant, maximum intended inventories, inventory calculations and safe upper and lower limits on temperatures, pressures, flow rates, and compositions.  Included in this subsection is the plant Process Flow Diagram (PFD).\n\n\nEquipment in process:\n\nRequired information about equipment used in the plant includes: materials of construction, piping & instrumentation diagrams (P&ID's),"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16411,
      "SummaryText": " electrical classifications, relief systems, and safety systems.  The design, maintenance, inspection, testing and operation of equipment is documented.\n\n\nPROCESS HAZARD ANALYSIS\n\nThe Process Hazard Analysis requirement is met by the Hazard and Operability (HAZOP) Studies conducted at the plant.\n\n\nOPERATING PROCEDURES  \n\nThe operating procedures provide clear and thorough step-by-step instructions on operating various sections of the plant.  Operating limits and health considerations of the different processes, which are covered in Process Safety Information, are also requirements of operating procedures.  Step by step procedures for safe work practices, such as lockout/tagout, confined space entry, etc. are also included in this section.\n\nTRAINING \n\nTraining is required for employees involved in operating a process.  Types of training include operating procedures, maintenance procedures, mechanical integrity testing procedures, safety and potential health hazards, emergency operations, and safe work practices.  After initial training, refresher training is required every three- (3) years, or more often if necessary or requested.  Training documentation includes the employee who received training, the date of training, and testing to verify that the employee understood the training. \n\nCONTRACTORS    \n\nThis section of PSM/RMP covers contractors working on or adjacent to a covered process.  Both Plant personell and the contractor have responsibilities under this section.  The Plant's responsibilities include:\n\nEvaluating contract employer's safety performance and programs\nInforming contract employer of potential hazards related to the work\nExplaining the plant's emergency action plan\nControlling contract employers entrance and exit to and from the plant\nPeriodically evaluating contractor's safety performance and maintaining an injury and illness log of contractor's work at the plant\n\nThe contract employer's responsibilities include:\n\nTraining contract employees in saf"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 16411,
      "SummaryText": "e work practices of his/her job\nInstructing employees on potential hazards of the job or process\nInforming a Plant Representative of potential hazards in the contractor's work\n\n\nPRE START-UP SAFETY REVIEW \n\nThe Pre Start-Up Safety Review includes a review of operations and code requirements for new facilities, and modified facilities, which require a change in their Process Safety Information.  This section of PSM/RMP does not apply to Hatter's Pond since it was in operation before the PSM/RMP regulation. New facilities or equipment added to the plant after the compliance dates is covered under \"Management of Change\".  \n\n\nMECHANICAL INTEGRITY  \n\nMechanical integrity refers to the maintenance, inspection, testing, and repair of process equipment to maintain the quality of equipment and prevent catastrophic releases.  Written maintenance, inspection and testing procedures are necessary for employees involved in maintaining the on-going integrity of process equipment.  Documentation of inspection and testing is required & kept.  \n\n\nHOT WORK PERMIT \n\nThe hot work permit currently being used at the plant meets the Hot Work requirements of PSM/RMP.\n\n\nMANAGEMENT OF CHANGE  \n\nManagement of Change is required for changes made at the plant that is not \"replacement-in-kind\" or changes outside the normal deviation and operating limits of equipment, chemical requirement, processes and operating conditions.  A change in one part of a process may affect another part of that process or another section of the plant.  Employees are trained in new procedures or practices brought about by Management of Change and how those new procedures and practices are documented.  A new procedure for handling \"Work Orders\" is also covered under this section.\n\nINCIDENT INVESTIGATION \n\nInvestigation is required for incidents that did or could have resulted (\"near miss\") in a catastrophic release of potentially hazardous or flammable materials.  For each incident, a team with at least one member who h"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16411,
      "SummaryText": "EAR ACCIDENT HISTORY\n\nThere have been no releases of regulated substances that resulted in onsite or offsite effects during the past 5 years.(1995-1999) We investigate accidents/incidents to determine ways to prevent similar accidents/incidents from recurring."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16411,
      "SummaryText": "as knowledge of the process involved is established to investigate and fill out a report.  The investigation starts as soon as possible, but no later than 48 hours following the incident.  The findings and recommendations are addressed promptly.  The report is reviewed with affected personnel and retained on file for five (5) years.\n\n\nEMERGENCY PLANNING AND RESPONSE \n\nEmergency Planning and Response is the action plan for personnel to follow during an emergency.  At Hatter's Pond, Emergency Planning and Response includes:\n\nProcedures for handling small releases\nStaging areas at the plant\nEmergency equipment available at the plant    \nEmergency medical transportation\nSpill Control and Countermeasure Plan (SPCC)\nContingency plan\n\n\nCOMPLIANCE AUDITS \n\nEvery three- (3) years, a compliance audit on PSM/RMP is conducted.  Documentation of audit findings and solutions, and the correction of those findings is required by PSM/RMP. The findings are tracked until resolved.\n\n(*)          RMP compliance date 6/21/99\n\n\nRELEASE PREVENTION\n\nThe processes at the Hatter's Pond Plant have hazards that must be managed for continued safe operation. Following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility. Collectively, these safety features help prevent potential accident scenarios that could be caused by equipment failures and human error.\n\nHydrocarbon/hydrogen sulfide detectors with audible and visual alarms\nProcess relief valves that discharge into the plant flare system\nAutomated & manual valves to permit isolation of  the process\nPlant/compressor station emergency shutdowns\nFire and smoke detection system with audible and visual alarms\nCurbing and/or diking to contain liquid releases \nRedundant equipment and instrumentation (e.g., uninterruptible power supply for process control system\n\nRELEASE MITIGATION\n\nFire suppression and extinguishing equipment\nPersonnel trained in emergency action\nPPE \n\nFIVE Y"
    }
  ]
}