{
  "FacilityID": 16614,
  "FacilityName": "Glenmore Farmers Grain and Supply",
  "FacilityStr1": "15052 Glenmore Road",
  "FacilityStr2": null,
  "FacilityCity": "Ohio City",
  "FacilityState": "OH",
  "FacilityZipCode": "45874",
  "Facility4DigitZipExt": "9561",
  "FacilityCountyFIPS": "39161",
  "LEPC": "Van Wert County LEPC",
  "FacilityLatDecDegs": "40.785917",
  "FacilityLongDecDegs": "-84.69975",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Glenmore Farmers Grain and Supply",
  "OperatorStr1": "15052 Glenmore Road",
  "OperatorStr2": null,
  "OperatorCity": "Ohio City",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45874",
  "OperatorZipCodeExt": "9561",
  "RMPContact": "Keith Martin",
  "RMPTitle": "Risk Coordinator",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106814",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-13 00:00:00",
  "SafetyInspectionBy": "Ohio Department of AG",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.78562,
  "FRS_Long": -84.69853,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23157,
      "AltID": "NH3 Storage Tank",
      "FacilityID": 16614,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 23751,
          "ProcessID": 23157,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 29593,
          "ProcessID": 23157,
          "ChemicalID": 56,
          "Quantity": 232000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 529593,
          "ProcessID": 23157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16614,
      "SummaryText": "The accidental release prevention end emergency response policy:  The location and design of this system\ncomplies with the Ohio Administrative Code 901:5-3-01 to 901:5-3-14, \"Regulations for Storing and Handling Fertilizer Anhydrous Ammonia\", as administered and enforced by the Ohio Department of Agriculture.  It is the policy of this facility to adhere to all applicable federal, state, and local laws.  Management, and employees are committed to the prevention of accidental releases of anhydrous ammonia.  If an accidental release should occur, the facility is prepared to work with the local fire department, county LEPC, EPA, and any other applicable authorities to mitigate the release and minimize its impact on people and the environment.\n\nA description of the facility and the regulated substance handled:  The primary activity at this facility is the storage and blending of fertilizers for sale to farmers.  Anhydrous ammonia is received, stored, filled into nurse tanks, and sold to the customer for direct application as a crop production nutrient.  The maximum quantity stored is 232,000 pounds in 4/12,000 gallon storage tanks.\n\nThe worst-case release scenario:  The worst-case scenario is the release of the total contents of the largest storage tank or rail tank car released as a gas over a period of 10 minutes.  The maximum quantity released would be 58,000 pounds, which is the volume of the largest storage tank at 85 percent capacity as limited by design standards.  The distance to the endpoint (point of dispersion to 200 ppm) is 0.83 miles (The Fertilizer Institute Worst-Case Anhydrous Ammonia Releases Table 1).  There are 38 private homes and a total population of 89 people within the distance to the endpoint.  \n\nThe alternative release scenario:  The alternative release scenario, based on the most likely potential incident, is a release from a transfer hose failure (1.5\" hose).  Based on The Fertilizer Institute Alternate-Case Releases of Anhydrous Ammonia Table"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16614,
      "SummaryText": " 1, assuming that the release is stopped by acitve/passive mitigation after 2 minutes and a wind speed of 3 meters/second, the following is a summary of results:\n\nRelease rate                              3,563 lb/min\nMaximum quantity released       7,127 lb\nDistance to 200 ppm endpoint   0.46 miles\n\nThere are 32 private homes and a total population of 74 people within the distance to the endpoint.\n\nThe general accidental release prevention program and chemical-specific prevention steps:  This facility has implemented the provisions of \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\", published by the American National Standards Institute (ANSI), and the standards of the U.S. Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\".  All employees are trained in the equipment safety features and the safe handling of anhydrous ammonia.\n\nThe five-year accident history:  There has been no accidental release of anhydrous ammonia in the past five years that has caused any deaths, injuries, or significant property damage at the facility.  Neither has there been a release that, to our knowledge, resulted in offsite deaths, injuries, evacuations, sheltering in place, property or environmental damage.\n\nThe emergency response program:  The facility has a written Emergency Response Plan in accordance with OSHA standards, 29 CFR 1910.38 and 1910.120, including pre-emergency planning and employee training.  A copy of the Emergency Response Plan has been given to the local fire department, and to the Local Emergency Planning Committee.  The local fire department has been on site for safety and emergency response training.  The facility submits annual community right-to-know information as required under SARA Title III (EPCRA).\n\nPlanned changes to improve safety:  Safety improvement is an on-going process at this facility.  Periodic evaluations are performed by company personnel and by the Ohi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16614,
      "SummaryText": "o Department of Agriculture to assure the safety of equipment and procedures.  There are no additional specific anhydrous ammonia safety recommendations for implementation at this time."
    }
  ]
}