{
  "FacilityID": 16826,
  "FacilityName": "KEMIRON PACIFIC, INC. - MOJAVE FACILITY",
  "FacilityStr1": "18700 HIGHWAY 14 NORTH",
  "FacilityStr2": null,
  "FacilityCity": "MOJAVE",
  "FacilityState": "CA",
  "FacilityZipCode": "93501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.088806",
  "FacilityLongDecDegs": "-118.147556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "MWBkiron@gte.net",
  "FacilityDUNS": 627945702,
  "ParentCompanyName": "KEMIRON PACIFIC, INC.",
  "Company2Name": null,
  "CompanyDUNS": 627945702,
  "Company2DUNS": 627945702,
  "OperatorName": "KEMIRON, INC.",
  "OperatorStr1": "316 BARTOW MUNICIPAL AIRPORT",
  "OperatorStr2": null,
  "OperatorCity": "BARTOW",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33830",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": "CAD982447088",
  "EPAFacilityID": "100000160513",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "Yes",
  "PostmarkDate": "1999-08-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.08527,
  "FRS_Long": -118.1425,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23551,
      "AltID": null,
      "FacilityID": 16826,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 30083,
          "ProcessID": 23551,
          "ChemicalID": 62,
          "Quantity": 1080000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 24160,
          "ProcessID": 23551,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 12993,
              "Process_NAICS_ID": 24160,
              "SafetyReviewDate": "1999-05-05 00:00:00",
              "PHA_Date": "1999-08-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "EXPANSION CHAMBERS",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "INCREASED TRAINING - INSTALLATION OF CENTRAL EMERGENCY VACUUM RELIEF DEVICE.",
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "ALL SYSTEM COMPONENTS.",
              "ChangeMgmtDate": "1993-07-15 00:00:00",
              "ChangeMgmtReviewDate": "1994-02-01 00:00:00",
              "PreStartupReviewDate": "1993-07-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1994-02-01 00:00:00",
              "ContractorSafetyReviewDate": "1997-05-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18375,
                  "PreventionProgram3ID": 12993,
                  "ProcessChemicalID": 30083
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 16826,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-12 00:00:00",
    "ERTrainingDate": "1999-04-12 00:00:00",
    "CoordinatingAgencyName": "MOJAVE FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "6618244581",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 16826,
      "SummaryText": "resents a graphical representation of the vulnerable zones for the alternative release scenario for accidental releases involving chlorine. \n\nES 3.0 Five YEAR Accident HISTORY \n\nDuring the five years preceding the submittal of this RMP, the facility has NOT had any releases of chlorine which have resulted \n\nin: \n   Onsite deaths, injuries, or significant property damage; or \n   Known off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place. \n\nES 4.0 accidental RELEASE PRVENTION PROGRAM AND CHEMICAL SPECIFIC PREVIENTION STEPS \n\nThe Accidental Release Prevention Program at Kemiron's Mojave facility consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving chlorine. These programs include design and operating controls, compliance with specified codes, the facility's health and safety program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program), site security, the management of change program, pre-start-up review, fire prevention/fire protection/hot work permit program, management of- and safety of- contractors, accident/incident investigation procedures, emergency response plan, RW compliance auditing program, record keeping and a variety of training programs. Details of each of these components of the \nES-2 \n\nfacility's Accidental Release Prevention Program are provided in the document entitled Risk Management Plan (RMP), Volume I - Prevention Program (maintained at the facility). \n\nThere are several chlorine leak detection and monitoring devices and other protective devices (e.g.., for fire protection, etc.) placed at strategic locations throughout the facility. \n\nES 5.0 EMERGENCY RESPONSE \n\nKemiron recognizes that EMERGENCY planning and EMERGENCY RESPONSE are an integral component of risk management. As such, Kemiron currently has EMERGENCY action plans a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 16826,
      "SummaryText": "nd EMERGENCY evacuation plans in place. In addition, the facility has developed a Fire Prevention Plan. These programs work together to mitigate the effects of unplanned releases or events. However, as a continuous measure to improve safety, the facility reviews its EMERGENCY RESPONSE plan, evacuation plan and fire prevention plan on a continuous basis. This also ensures that the facility incorporates the latest safety developments into its existing programs. \n\nES 6.0 PLANNED Changes To IMPROVE SAFETY \n\nA detailed hazard and operability study (i.e., hazards analysis) was performed on ALL operations involving chlorine in order to evaluate the potential for accidental releases. As required under the California Code of Regulations, Title 19, Division 2, Chapter 4.5, section 2745.7 (q)(1-4), the hazards analysis included an analysis of natural and human caused external events. Additionally, in 1994 the facility conducted a detailed seismic risk assessment. As a result of the most recent hazards analysis conducted, a number of recommendations were made to improve the safety of the operations conducted. The recommended actions are summarized in Table ES-1. Table ES-1 also presents the implementation status of the recommended actions. As shown, Kemiron has already implemented a number of the recommendations. Table ES-1 also presents the expected date of implementation for those recommendations not yet implemented. \n\nThe most recent field verification that major process equipment is installed and maintained as designed was conducted in 1994. As part of the facility's preventive maintenance program, field verification that other process components are installed and maintained as designed is conducted on an ongoing basis. The most recent such review was conducted in June 1999. \n\nES 7.0 FOR MORE INFORMATION \n\nKemiron recognizes that some persons may be interested in obtaining more detailed INFORMATION regarding risk management and prevention program components not discussed he"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 16826,
      "SummaryText": "rein. Interested parties that have additional questions regarding the facility's Risk Management Plan, are directed to contact: \nMr. Victor Moralles \nKemiron Pacific, Inc. \n18700 Highway 14 North Mojave, California 93501 \nES-3"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 16826,
      "SummaryText": "EXECUTIVE SUMMARY \n\nThis document comprises the Risk Management Plan (RMP) for the Kemiron Pacific, Inc. (Kemiron) facility located at 18700 Highway 14 North in Mojave, California 93501 (also referred to within Kemiron as the Mojave Plant). The facility is located in an undeveloped area approximately 1.5 miles northeast of the town of Mojave. The Mojave Airport, which is the nearest neighboring facility, is approximately 1 mile away. \n\nThe purpose of this document is to comply with the risk management planning requirements as set forth in Section 25535(d) of Article 2 of Chapter 6.95 of the California Health and Safety Code (also known as the California Accidental Release Prevention Program - CalARP) and Part 68 of Title 40 of the Code of Federal Regulations (40CFR Part 68), also known as the federal Accidental Release Prevention Requirements: Risk Management Programs or the federal RMP. \n\nThe scope of the RMP includes all operations conducted at Kemiron's Mojave facility which involve the storage, handling and/or use of chlorine (i.e., chlorine is the only regulated substances which is handled at the facility above the threshold quantity). \n\nES 1.0 DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED PRIMARY OPERATIONS \n\nThe primary operation conducted at Kemiron's Mojave facility is the manufacture of ferrous chloride and ferric chloride (NAICS Code 325188, SIC Code 2819). The primary components utilized in the process include water, hydrochloric acid, chlorine and scrap iron. Chlorine is a regulated substance subject to the above-referenced regulations. Chlorine is the only such regulated substance handled at the facility. Provided below, is a brief description of the storage, handling and use of chlorine at the site. \n\nSTORAGE, HANDLING AND USE OF CHLORINE \n\nThe manufacturing process consists of the following components: \n    A maximum of six 90-ton railcars of chlorine (i.e., a maximum onsite inventory of 1,080,000 pounds of chlorine); \n   Two co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16826,
      "SummaryText": "to an unknown external event. This scenario could be initiated by some unknown external event (i.e., an airplane, missile or meteorite impacting the railcar). It is highly improbable that this scenario would be initiated by a seismic event. This scenario is considered to be extremely unlikely. In the highly unlikely case that this scenario occurs, approximately 180,000-pounds of chlorine would be released. The resulting chlorine vapor cloud was assumed to freely migrate off-site. Utilizing the methodology specified by USEPA (and assuming a rural topographic surrounding), the estimated vulnerable zone for these types of scenarios is greater than 25 miles. \n\nAlternative Release Scenarios \n\nAlternative release scenarios which are considered to be more Rely to occur are those which may result in the release of anywhere from less than one-pound to up to 3500-pounds of chlorine. These scenarios include situations such as delivery of a leaking railcar of chlorine to the facility, a pinhole leak in the chlorine transfer piping, pressure relief from a railcar, a partial or complete failure of the liquid chlorine transfer lines and a partial of complete failure of overhead vent lines containing chlorine vapor from the chlorinators to the Central Emergency Vacuum Relief Device (CEVRD). Failure of the transfer lines can occur at various points in the system. In order to be conservative in the estimation of the vulnerable zone, it was assumed that 3500- pounds of chlorine was released during an accident involving the complete failure of a liquid transfer line from a railcar to a chlorinator. It was further assumed that the material was released over a 1 minute time period after which it was assumed that the system was either automatically or manually shut down. The resulting chlorine vapor cloud was assumed to freely migrate off-site. Utilizing the methodology specified by USEPA, the estimated vulnerable zone for these types of scenarios is approximately 2.5 miles. Figure ES-1 p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16826,
      "SummaryText": "ntinuous chlorinators for reacting water, chlorine, and hydrochloric acid to manufacture ferrous chloride;     Six batch chlorinators utilized to convert ferrous chloride to ferric chloride;     Three settling tanks; \n    A number of heat exchangers; and \n    System piping, controls and instrumentation. \n\nNinety ton railcars of chlorine are delivered to the facility and parked in dedicated spots. Liquid chlorine from the railcar, hydrochloric acid and water are mixed in two continuous chlorinators. The resulting solution is circulated through dissolver tanks containing scrap iron/steel. This results in the manufacture of a weak ferrous chloride solution. The solution is recirculated until a rich ferrous chloride solution is made. \n\nThe rich ferrous chloride solution is fed to one of six batch chlorinators. Chlorine is added to the chlorinator until the desired ferric chloride solution is manufactured. The resulting solution is fed to settling tanks and on to product storage tanks. \n\nCentral Emergency Vacuum Relief Device (CEVRD) \n\nKerniron has installed a central emergency vacuum relief device (CEVRD). The CEVRD is connected to the overhead relief of each of the chlorinators onsite. The CEVRD utilizes a weak solution of ferrous chloride to scrub out excess chlorine. \n\nES 2.0 ACCIDENTAL RELEASE SCENARIOS \n\nThe RMP regulations require that at least two types of release scenarios be evaluated for their potential to impact off-site populations: \nES-1\n\n\n    the worst case release; and \n    an alternative release (that is more credible). \n\nA number of hypothetical accidental release scenarios were postulated and evaluated for the RMP. These scenarios were categorized into worst-case release scenarios and alternative release scenarios. Each of these categories of hypothetical accidental release scenarios is discussed below. \n\nCHLORINE \n\nWorst-Case Release Scenario \n\nIn this scenario, one of the railcars containing 90 tons of chlorine experiences a catastrophic failure due"
    }
  ]
}