{
  "FacilityID": 16871,
  "FacilityName": "Slaughter Gasoline Plant",
  "FacilityStr1": "4 miles West of Sundown, Tx. on",
  "FacilityStr2": "Hwy. 301",
  "FacilityCity": "Sundown",
  "FacilityState": "TX",
  "FacilityZipCode": "79372",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48219",
  "LEPC": "Hockley County LEPC",
  "FacilityLatDecDegs": "33.48",
  "FacilityLongDecDegs": "-102.563333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 965209133,
  "ParentCompanyName": "BP Amoco Corporation",
  "Company2Name": "Shell Western E&P",
  "CompanyDUNS": 1344258,
  "Company2DUNS": 109003467,
  "OperatorName": "Altura Energy Ltd.",
  "OperatorStr1": "4 miles West of Sundown, Tx. on",
  "OperatorStr2": "Hwy. 301",
  "OperatorCity": "Sundown",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79372",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Newberry",
  "RMPTitle": "Regulatory Coordinator",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160666",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00559",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-08-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.4561,
  "FRS_Long": -102.4888,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 23647,
      "AltID": "Storage-C5+ in spheroids",
      "FacilityID": 16871,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24257,
          "ProcessID": 23647,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 30334,
          "ProcessID": 23647,
          "ChemicalID": 125,
          "Quantity": 2100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 530334,
          "ProcessID": 23647,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 16871,
      "SummaryText": "(a)    Accidental Release Prevention and Emergency Response Policies\n\nAltura Energy Ltd's. Slaughter Gasoline Plant (SGP) is committed to operating and maintaining all of our processes (especially regarding the use of hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention safeguards and programs and emergency response programs to address the safety of our employees and the public, and to protect the environment.  Our policy is to integrate process controls and administrative procedures that are designed to prevent the release of regulated substances.  This document provides a brief overview of the risk management activities we have designed and implemented.\n\n(b)    Description of the Stationary Source and Regulated Substances Handled\n\nThe primary purpose of the Slaughter Gasoline Plant is to process gas for sale.  This plant includes facilities for compressing, sweetening, treating, dehydrating, and fractionating  the gas to the required specifications.  Product streams which result from these processing facilities include ethane-propane mix, propane, butane, 12# natural gasoline and sulfur.  Our evaluation of the regulated substances involved in the SGP process resulted in our classifying this as a Program Level 1 process with our pentane inventory being the source of our worst case scenario.\n\n(c)    Worst Case Scenario\n\nThe worst case scenario (WCS) for SGP was associated with an instantaneous release and ignition resulting in a vapor cloud explosion of the 2,100,000 lbs. inventory of the pentane in the facilities largest storage tank.  Even though we have several safeguards and controls in place to prevent such a release and manage the consequences, we took no credit for any passive mitigation measures in the WCS evaluation.  Our WCS results in no offsite impact on any public or environmental receptor.\n\n(d)    General Accidental Release Prevention Program\n\nSGP is a Program Level 1 and is not required to have a specific "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 16871,
      "SummaryText": "prevention program.  However, we do have an active PSM program, which incorporates accidental release prevention.\n\n(e)    Five-year Accident History \n\nIn our review of the SGP incident records for the past five years, we have not experienced an accidental release from a covered process resulting in deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\n(f)    Emergency Response Program\n\nSGP maintains a written emergency action plan to control and contain an accidental release of a regulated substance.  Our plan considers all federal, state, and local regulatory requirements for emergency response planning.  The plan is designed to respond to a release of a regulated substance and provides first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, and notification of local emergency response agencies.  We have coordinated our emergency response activities with the Hockley County, Texas emergency response agencies.\n\n(g)    Planned Changes to Improve Safety\n\n1.    We will continue to develop and utilize a root cause failure methodology in analyzing any SGP incidents.\n2.    We will continue to develop and share management practices involving operations and maintenance activities between Altura plants.\n3.    We will review our active process safety management program from time to time for appropriate improvements to the program.\n\nCertification\n\nBased on the criteria in 40 CFR 68.10, the distance to the specific endpoint for the worst case accidental release scenario for the pentane inventory is less than the distance to the nearest public receptor:\n\nWithin the past 5 years the process (es) has (have) had no accidental release that caused offsite impacts provided in 40 CFR 68.10(b)(1).  No additional measures are necessary to prevent offsite impacts from accidental releases.  In the event of fire, explosion, or a release of regulated substance from the process (es), entry within the distance to th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 16871,
      "SummaryText": "e specified endpoints may pose a danger to the public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP plan.  The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nSignature:\n\n\n\nJim Richardson\nTitle:  Team Leader\nDate:  June 15, 1999"
    }
  ]
}