{
  "FacilityID": 17122,
  "FacilityName": "CR BRIGGS",
  "FacilityStr1": "8 MILES SOUTH OF BALLARAT,",
  "FacilityStr2": "ON WINGATE ROAD",
  "FacilityCity": "TRONA",
  "FacilityState": "CA",
  "FacilityZipCode": "93592",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06027",
  "LEPC": null,
  "FacilityLatDecDegs": "35.945861",
  "FacilityLongDecDegs": "-117.195583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "briggsenv@iwvisp.com",
  "FacilityDUNS": 825979578,
  "ParentCompanyName": "CANYON RESOURCES",
  "Company2Name": null,
  "CompanyDUNS": 37441573,
  "Company2DUNS": null,
  "OperatorName": "CR BRIGGS",
  "OperatorStr1": "8 MILES SOUTH OF BALLARAT",
  "OperatorStr2": "ON WINGATE ROAD",
  "OperatorCity": "TRONA",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93592",
  "OperatorZipCodeExt": null,
  "FTE": 130,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160915",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Mine Safety and Health Assn.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.940942,
  "FRS_Long": -117.195969,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24029,
      "AltID": "storage tank and transfer",
      "FacilityID": 17122,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 30805,
          "ProcessID": 24029,
          "ChemicalID": 56,
          "Quantity": 59255.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 24647,
          "ProcessID": 24029,
          "NAICSCode": "212221",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 9267,
              "Process_NAICS_ID": 24647,
              "SafetyReviewDate": "1999-06-14 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-14 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "none",
              "OpProceduresReviewDate": "1999-06-14 00:00:00",
              "TrainingReviewDate": "1999-06-14 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-14 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "06-01-99",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 9700,
                  "PreventionProgram2ID": 9267,
                  "ProcessChemicalID": 30805
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 24030,
      "AltID": "PROPANE",
      "FacilityID": 17122,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 30806,
          "ProcessID": 24030,
          "ChemicalID": 98,
          "Quantity": 27779.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 24648,
          "ProcessID": 24030,
          "NAICSCode": "212221",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17122,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-26 00:00:00",
    "ERTrainingDate": "1999-05-26 00:00:00",
    "CoordinatingAgencyName": "San Bernardino Fire Department",
    "CoordinatingAgencyPhone": "7603725988",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Mine Safety Health Administration"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17122,
      "SummaryText": "CR Briggs                                    FEDERAL\n  P.O.Box 668\n  Trona, CA 93592\n                              \n                              \n                              \n               General Executive Summary for \n                CR Briggs Open Pit Gold Mine\n  \n     1.     Accidental Release Prevention and Emergency Response Policies\n  We at CR Briggs  are strongly committed to employee, public and environmental\n  safety.  This commitment is demonstrated by our comprehensive accidental release\n  prevention program that covers areas such as design, installation, operating procedures,\n  maintenance, and employee training associated with the processes at our facility.  It is\n  our policy to implement appropriate controls to prevent possible releases of regulated\n  substances.  Unforeseeably, if such a release does occur, our highly trained emergency\n  response personnel are at hand to control and mitigate the effects of the release.\n  \n  \n     2.     The Stationary Source and the Regulated Substances Handled\n  Our facility's primary activities encompass open pit gold mining.  We have three regu-\n  \n  lated substances present at our facility.  These substances include Ammonia, Propane\n  and Hydrochloric acid.  The regulated substances at our facility are involved in several\n  uses.  Ammonia is used in the Specialized Catalyst Reduction (SCR.) of oxides of\n  nitrogen.  Propane is used for heating and the firing of the dore=furnace for gold\n  recovery.  Hydrochloric acid  is used for an acid wash of carbon in the recovery of\n  gold.\n  \n  The maximum inventory of Ammonia at our facility is 59255 lb. while Propane and\n  Hydrochloric acid  are present at our facility in quantities of 27779 lb. and 15658 lb.\n  respectively.\n  \n     3.     The Worst Case Release Scenario(s) and the Alternative Release\n     Scenario(s), including administrative controls and mitigation mea-\n     \n     sures to limit the distances for each reported scenario\n  To evaluate the worst cas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17122,
      "SummaryText": "ed with\n  our processes are identified and controlled efficiently.  The inspections are undertaken\n  by qualified supervisors and mine personnel with expertise in process operations and\n  are revalidated at a regular interval.  Any findings related to the hazard analysis are\n  addressed in a timely manner.\n  \n  Operating Procedures\n  For the purposes of safely conducting activities within our covered processes, CR\n  Briggs  maintains written operating procedures.  These procedures address various\n  modes of operation such as initial startup, normal operations, temporary operations,\n  emergency shutdown, emergency operations, normal shutdown and startup after a\n  turnaround.  The information is regularly reviewed and is readily accessible to\n  operators involved in the processes.\n  \n  Training\n  CR Briggs  has a comprehensive training program in place to ensure that employees\n  who are operating processes are competent in the operating procedures associated with\n  these processes.  Refresher training is provided yearly and more frequently as needed.\n  \n  Mechanical Integrity\n  CR Briggs  carries out highly documented maintenance checks on process equipment to\n  ensure proper operations.  Process equipment examined by these checks includes\n  among others; pressure vessels, storage tanks, piping systems, relief and vent systems,\n  emergency shutdown systems, controls and pumps.  Maintenance operations are carried\n  out by qualified personnel with previous training in maintenance practices. \n  Furthermore, these personnel are offered specialized training as needed.  Any\n  equipment deficiencies identified by the maintenance checks are corrected in a safe and\n  timely manner.\n  \n  Management of Change\n  Written procedures are in place at CR Briggs  to manage changes in process chemicals,\n  technology, equipment and procedures.  Process operators, maintenance personnel or\n  any other employee whose job tasks are affected by a modification in process\n  conditions are promp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17122,
      "SummaryText": "e scenarios, we have used the look-up tables and equations\n  provided by the EPA in the RMP Offsite Consequence Analysis Guidance as well as\n  Equations from Appendix D of the EPA's Offsite Consequence Analysis Guidance. \n  For alternative release scenario analyses, we have employed the look-up tables and\n  equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance. \n  The following paragraphs provide details of the chosen scenarios.\n  \n  \n  The worst case release scenario submitted for Program 2 and 3 toxic substances as a\n  class involves a catastrophic release from storage tank and transfer piping to the SCR\n  Catalyst System for reduction of oxides of nitrogen.   The scenario involves the release\n  of 59255 lb. of Ammonia in a gaseous form over 10 minutes.  Passive mitigation\n  controls such as dikes, sumps and berms are also taken into account to calculate the\n  scenario.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum\n  distance of 8.1 miles is obtained corresponding to a toxic endpoint of 0.14 mg/L.\n  \n  One alternative release scenario will be submitted for each toxic substance present in\n  Program 2 and Program 3 processes cumulatively.\n  \n  The alternative release scenario for Ammonia involves a release from the SCR Bed\n  located at the crusher in the storage tank and transfer piping to SCR Catalyst System\n  for oxides of  nitrogen reduction.  The scenario involves the release of 59255 lb. of\n  Ammonia in a gaseous form over 10 minutes.  Passive mitigation controls such as dikes\n  and berms are taken into account to calculate the scenario.  The release is also assumed\n  to be controlled by active mitigation measures that include water curtain(s).  Under\n  neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L\n  of Ammonia is 2.8 miles.\n  \n  The worst case release scenario submitted for Program 2 and 3 flammable substances\n  as a class involves a catastrophic release from the propane stor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17122,
      "SummaryText": "age vessel at refinery\n  used for heating in the gold extraction process.  The scenario involves the release of\n  27439 lb. of Propane.  It is assumed that the entire quantity is released as a vapor,\n  which finds an ignition source, with 10 percent of the released quantity participating in\n  a vapor cloud explosion.  Under worst case weather conditions, the maximum distance\n  of 0.24 miles is obtained corresponding to an endpoint of 1 psi over pressure.  \n  \n  The alternative release scenario submitted for Program 2 and 3 flammable substances\n  involves a release from storage vessel at the refinery used for heating in the gold\n  extraction circuit.  The release is assumed to result in a Vapor Cloud Explosion.  The\n  scenario involves the release of 27439 lb. of Propane in 10 minutes.  The release is\n  also controlled by active mitigation measures that include water curtain(s).  Under\n  neutral weather conditions, the maximum distance to the flammable endpoint of 1 PSI\n  over pressure is 0.16 miles.\n  \n  \n  \n     4.     The General Accidental Release Prevention Program and the\n     Chemical-Specific Prevention Steps\n  Our facility has taken all the necessary steps to comply with the accidental release\n  prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was\n  designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  Our\n  facility is also subject to EPCRA Section 302 notification requirements.  We also have\n  an air operating permit ID under Title V of the Clean Air Act.    The following\n  sections briefly describe the elements of the release prevention program that is in place\n  at our stationary source.\n  \n  Process Safety Information\n  CR Briggs maintains a detailed record of safety information that describes the chemical\n  hazards, operating parameters and equipment designs associated with all processes.\n  \n  Process Hazard Analysis\n  Our facility conducts daily pre-shift inspections to ensure that hazards associat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17122,
      "SummaryText": "tly made aware of and offered training to deal with the\n  modification.\n  \n  Pre-startup Reviews\n  Pre-start up safety reviews related to new processes and to modifications in established\n  processes are conducted as a regular practice at CR Briggs .  These reviews are\n  conducted to confirm that construction, equipment, operating and maintenance\n  procedures are suitable for safe startup prior to placing equipment into operation.\n  \n  Compliance Audits\n  CR Briggs  conducts audits on a regular basis to determine whether the provisions set\n  out under the RMP rule are being implemented.  These audits are carried out at least\n  every 1 years and any corrective actions required as a result of the audits are\n  undertaken in a safe and prompt manner.\n  \n  Incident Investigation\n  CR Briggs  promptly investigates any incident that has resulted in, or could reasonably\n  result in a catastrophic release of a regulated substance.  These investigations are\n  undertaken to identify the situation leading to the incident as well as any corrective\n  actions to prevent the release from reoccurring.  All reports are retained for a\n  minimum of 5 years.\n  \n  Employee Participation\n  CR Briggs truly believes that process safety management and accident prevention is a\n  team effort.  Company employees are strongly encouraged to express their views\n  concerning accident prevention issues and to recommend improvements.  In addition,\n  our employees have access to all information created as part of the facility's\n  implementation of the RMP rule, including information resulting from process hazard\n  analyses in particular.\n  \n  Contractors\n  On occasion, our company hires contractors to conduct specialized maintenance and\n  construction activities.  Prior to selecting a contractor, a thorough evaluation of safety\n  performance of the contractor is carried out.  CR Briggs has a strict policy of\n  informing the contractors of known potential hazards related the contractor's work and\n  the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17122,
      "SummaryText": "processes.  Contractors are also informed of all the procedures for emergency\n  response should an accidental release of a regulated substance occur.\n  \n  \n     5.     Five-year Accident History\n  CR Briggs has had an excellent record of preventing accidental releases over the last 5\n  years.  Due to our stringent release prevention policies, there has been no accidental\n  release during this period.\n  \n     \n     6.     Emergency Response Plan\n  CR Briggs  carries a written emergency response plan to deal with accidental releases\n  of hazardous materials.  The plan includes all aspects of emergency response including\n  adequate first aid and medical treatment, evacuations, notification of local emergency\n  response agencies and the public, as well as post-incident decontamination of affected\n  areas.\n  \n  To ensure proper functioning, our emergency response equipment is regularly\n  inspected and serviced.  In addition, the plan is promptly updated to reflect any\n  pertinent changes taking place within our processes that would require a modified\n  emergency response.\n  \n     7.     Planned Changes to Improve Safety\n  Continual training in Hazmat and Hazardous Waste are some of the major steps we\n  want to take to improve safety at our facility.  These changes are expected to be\n  implemented in the fall of 1999.\n  \n  8. Certification Statement\n  The undersigned certifies that to the best of my knowledge, information, and belief,\n  formed after reasonable inquiry, the information submitted is true, accurate and\n  complete.\n  \n  Name:  Sandra Corporon\n  \n  Signature:\n  \n  Title:  Safety Coordinator\n  \n  Date signed:"
    }
  ]
}