{
  "FacilityID": 17181,
  "FacilityName": "The Sherwin-Williams Company - Effingham DSC",
  "FacilityStr1": "711 W. Wabash",
  "FacilityStr2": null,
  "FacilityCity": "Effingham",
  "FacilityState": "IL",
  "FacilityZipCode": "62401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17049",
  "LEPC": "Effingham County LEPC",
  "FacilityLatDecDegs": "39.112167",
  "FacilityLongDecDegs": "-88.553556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 150937803,
  "ParentCompanyName": "The Sherwin-Williams Company",
  "Company2Name": null,
  "CompanyDUNS": 4206397,
  "Company2DUNS": 0,
  "OperatorName": "The Sherwin-Williams Company",
  "OperatorStr1": "P.O. Box 190",
  "OperatorStr2": null,
  "OperatorCity": "Effingham",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62401",
  "OperatorZipCodeExt": null,
  "FTE": 278,
  "OtherEPAFacilityID": "ILD150937803",
  "EPAFacilityID": "100000143784",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Effingham DSC",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.11283,
  "FRS_Long": -88.55063,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24103,
      "AltID": "Aerosol Warehouse",
      "FacilityID": 17181,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 30885,
          "ProcessID": 24103,
          "ChemicalID": 155,
          "Quantity": 7301762.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 22869,
              "ProcessChemicalID": 30885,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 22870,
              "ProcessChemicalID": 30885,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 22871,
              "ProcessChemicalID": 30885,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 22872,
              "ProcessChemicalID": 30885,
              "ChemicalID": 130
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 24724,
          "ProcessID": 24103,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17181,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-11-05 00:00:00",
    "ERTrainingDate": "1999-03-01 00:00:00",
    "CoordinatingAgencyName": "Effingham Fire Department",
    "CoordinatingAgencyPhone": "2173422555",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17181,
      "SummaryText": "Enclosed is The Sherwin-Williams Company (Sherwin-Williams) Risk Management Plan (RMP) submittal for the Effingham Warehouse facility. Sherwin-Williams does not believe it was the intent of the Clean Air Act 1990 to cover finished good aerosol storage at warehouse locations. The regulations and written responses from USEPA are unclear as to whether finished good storage is a regulated process under 40 CFR 68. Sherwin-Williams is submitting this plan for compliance purposes only, and these fillings shall not be construed as an agreement by Sherwin-Williams that these facilities are covered by the rule.  Therefore, Sherwin- Williams reserves its right to withdraw, amend or alter its plan at any time and to refrain from any future filing under this rule.\n\nIt is the policy of The Sherwin-Williams Company to conduct its business operation in such a manner as to protect the safety and health of our employees, our customers, the public and the environment.\n\nThe safety and health of employees, customers, the public and the environment is of the highest priority to The Sherwin-Williams Company.  We will implement programs which help to protect employees, customers, the public and the environment.  We will comply with all applicable laws and regulations and implement programs to help ensure compliance.\n\nWe will review all present and planned facilities, processes and products to ensure conformance with the applicable laws and regulations.  We will manufacture products that can be used, handled, stored, distributed and disposed safely with common safety practices and The Sherwin-Williams Company's safety and health information.\n\nThe facility is a distribution warehouse for aerosol products.  The products may include paint, lubricants, adhesives, cleaners, disinfectants and air fresheners. Propane, butane, isobutane and methyl ether (i.e., propellants) are the RMP flammable substances used in the packaging of aerosols.  When the propellants in each aerosol container are added t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17181,
      "SummaryText": "ogether, the amount stored on-site is in excess of the threshold quantity.  There are no listed toxic substances handled at this site in excess of the threshold quantity.\n\nThe worst case scenario is a hypothetical release of any of the hazardous materials listed under RMP rule as determined by the USEPA. The EPA mandates that companies presume the release of the entire quantity of the substance.  Only passive safety controls, such as those controls in place that do not require action by an employee to initiate, can be considered.  An example of a passive safety control is storage of a limited quantity. The worst case scenario presumes none of the site's mechanical controls or safety systems requiring energy or human intervention are operational. \n\nThe worst-case release scenario was determined by EPA to be a vapor cloud explosion. This scenario assumes that the total quantity of the flammable substance in the site's largest storage vessel (an aerosol container) is released into a vapor cloud, which then explodes.  The endpoint for the impact zone was determined by EPA to be an overpressure level of 1 pound per square inch (psi) from the explosion of the vapor cloud. The results were modeled using an EPA model, RMP*Comp.\n\nThe modeling for the warehouse assumed a release from the largest aerosol container has 300 grams of a flammable mixture (i.e., propellant). This resulted in an endpoint of 0.007 miles (37 feet). Please note that this distance is reported as \"0.01 miles\" in the submittal due to software limitations.  This would not have an off-site impact. These results are very conservative.  EPA's own guidance indicates that EPA considers not only the release of the total quantity of a flammable substance in a vessel into a vapor cloud to be highly unlikely, but also the explosion of a vapor cloud to be an unlikely event.  Further, the guidance states that the endpoint of 1 pound per square inch is intended to be conservative and protective, and does not define a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17181,
      "SummaryText": "level at which severe injuries of death would be commonly expected.\n\nThere has not been an accident or incident that has met the RMP criteria involving propane, butane, isobutane, or methyl ether at the facility during the last five years.  Criteria for RMP reporting are accidents that have resulted in death, injury, significant property damage, evacuation, sheltering in place, or environmental damage.  The warehouse has never had a release that caused off-site injury in its entire history. \n\nThe warehouse maintains trained responders to handle a variety of emergencies at the site including incipient fires and chemical spills. The site has also made arrangement for assistance from the local fire department and emergency responders to respond to incidents of a larger scale.\n\nThe site continually reviews and, if necessary, improves the safety programs and systems at the facility."
    }
  ]
}