{
  "FacilityID": 17233,
  "FacilityName": "Ohio Manufacturing   Cairo Sulphur Products",
  "FacilityStr1": "7680 Ottawa Road",
  "FacilityStr2": "P.O. Box 310",
  "FacilityCity": "Cairo",
  "FacilityState": "OH",
  "FacilityZipCode": "45820",
  "Facility4DigitZipExt": "0310",
  "FacilityCountyFIPS": "39003",
  "LEPC": "Allen County LEPC",
  "FacilityLatDecDegs": "40.848611",
  "FacilityLongDecDegs": "84.077222",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "N/A",
  "FacilityEmailAddress": "marsulex.com",
  "FacilityDUNS": 248016495,
  "ParentCompanyName": "MARSULEX, Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 248016495,
  "Company2DUNS": 0,
  "OperatorName": "MARSULEX, Inc.",
  "OperatorStr1": "111 Gordon Baker",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "North York",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "Timothy J. Haniford",
  "RMPTitle": "Plant Manager",
  "FTE": 21,
  "OtherEPAFacilityID": "OHD097231211",
  "EPAFacilityID": "100000114798",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0302000001",
  "SafetyInspectionDate": "1998-11-17 00:00:00",
  "SafetyInspectionBy": "BWC",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": "Ontario",
  "ForeignZipCode": "M2H3R1",
  "ForeignCountry": "CA",
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.84904,
  "FRS_Long": -84.08312,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24209,
      "AltID": "SO2 Storage Tank #23",
      "FacilityID": 17233,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24832,
          "ProcessID": 24209,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31060,
          "ProcessID": 24209,
          "ChemicalID": 49,
          "Quantity": 260000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531060,
          "ProcessID": 24209,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 24210,
      "AltID": "Oleum Towers",
      "FacilityID": 17233,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24833,
          "ProcessID": 24210,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31061,
          "ProcessID": 24210,
          "ChemicalID": 69,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 69,
            "ChemicalName": "Oleum (Fuming Sulfuric acid)  [Sulfuric acid, mixture with sulfur trioxide]",
            "CASNumber": "8014-95-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531061,
          "ProcessID": 24210,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17233,
      "SummaryText": "Risk Management Plan Executive Summary for Marsulex Cairo Sulfur Products\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nWe at Cairo Sulfur Products are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are  coordinated with the Allen County Emergency Services  and Cairo Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nOur facilitys primary activities encompass production of sulfuric acid and liquid sulfur dioxide. We have four (4) RMP regulated substances present at our facility in significant quantities.  These substances include sulfur dioxide, chlorine, ammonia and oleum, a mixture of sulfuric acid and sulfur trioxide.  The regulated substances at our facility are involved in several uses.  Sulfur dioxide is used for the production of sulfuric acid and is sold as a product. Oleum is used for producing sulfuric acid and sulfur dioxide. Chlorine is used in water treatment. Ammonia is used in refrigeration.\n\nThe maximum inventory of oleum that is expected to be present in this facility based on process/operational requirements is 18000 lb. The maximum inventory of sulfur dioxide that is expected to be present in this facility based on process/operational requirements is 500,000 lb. The maximum inventory of chlorine that is expected to be present in this facility based on process/operational requirements is 1350 lb which is below the Threshold Planning Quantity for RMP. The maximum inventory of am"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17233,
      "SummaryText": "monia that is expected to be present in this facility based on process/operational requirements is 3000 lb which is below the Threshold Planning Quantity for RMP.\n\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from one liquid sulfur dioxide storage tank.  The scenario involves a release of 260,000 lb. Sulfur dioxide.  Toxic liquid is assumed to be immediately released to a pool of height 1 cm, from which evaporation takes place.  The entire pool is estimated to have evaporated over 10 minutes.  At Class F atmospheric stability and 1.5 m/s wind speed, the maximum distance of 25 miles is obtained corresponding to a toxic endpoint of 0.0078 mg/L (3 ppm).\n\nOne alternative release scenarios has been submitted for each toxic substance present in Program 3 processes. \n\nThe alternative release scenario for oleum involves a release from oleum in the oleum towers.  The scenario involves the release of 14700 lb. of oleum.  Toxic liquid is assumed to be immediately released to form a pool of height 1 cm. from which evaporation takes place.  Passive mitigation controls such as Inventory are taken into account to calculate the scenario.  The release is also assumed to be controlled by active mitigation measures that include neutralization.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.01 mg/L of oleum is 2.1 miles.\n\nThe alternative release scenario for sulfur dioxide involves a release of sulfur dioxide from a loading hose.  The sce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17233,
      "SummaryText": "nario involves the release of 33900 lb. of sulfur dioxide.  Toxic liquid is assumed to be immediately released to form a pool of height 1 cm. from which evaporation takes place. Passive mitigation controls such as Inventory are taken into account to calculate the scenario.  The release is also assumed to be controlled by active mitigation measures that include neutralization.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0078 mg/L of sulfur dioxide is 2.7 miles.\n\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The sulfur dioxide processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.  \n\nProcess Safety Information\nCairo Sulfur Products maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of (time period).  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Cairo Sulfur Products maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17233,
      "SummaryText": "ions, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nCairo Sulfur Products has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.   Refresher training is provided at least every  three   years and more frequently as needed.  \n\nMechanical Integrity\nCairo Sulfur Products carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Cairo Sulfur Products to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Cairo Sulfur Products.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nCairo Sulfur Products conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are car"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17233,
      "SummaryText": "ried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nCairo Sulfur Products promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.  \n\nEmployee Participation\nCairo Sulfur Products truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facilitys implementation of the RMP rule, including information resulting from process hazard analyses in particular.  \n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Cairo Sulfur Products has a strict policy of informing the contractors of known potential hazards related to the contractors work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.  Five-year Accident History\n\nCairo Sulfur Products has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, No accidental releases have occurred during this period. \n\n\n6.  Emergency Response Plan\n\nCairo Sulfur Products carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17233,
      "SummaryText": " first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  \n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. \n\n7.  Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Secondary containment and monitoring are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemented by the end of year 2000.\n\n8.  Certification Statement\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName: Timothy J. Haniford\nSignature:\nTitle: Plant Manager\nDate signed:June 11, 1999"
    }
  ]
}