{
  "FacilityID": 17279,
  "FacilityName": "Union County Fertilizer Co.",
  "FacilityStr1": "47675-County Road 1B",
  "FacilityStr2": null,
  "FacilityCity": "Elk Point",
  "FacilityState": "SD",
  "FacilityZipCode": "57025",
  "Facility4DigitZipExt": "0327",
  "FacilityCountyFIPS": "46127",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "42.681861",
  "FacilityLongDecDegs": "-96.670306",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "N/A",
  "FacilityEmailAddress": "N/A",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Vermillion Fertilizer Co.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Union County Fertilizer Co.",
  "OperatorStr1": "47675-County Road 1B",
  "OperatorStr2": null,
  "OperatorCity": "Elk Point",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57025",
  "OperatorZipCodeExt": "0327",
  "RMPContact": "Craig Myron",
  "RMPTitle": "Owner",
  "FTE": null,
  "OtherEPAFacilityID": "045360-SD-001",
  "EPAFacilityID": "100000128514",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 1,
  "CompletionCheckDate": "1999-09-07 00:00:00",
  "ErrorReportDate": "1999-09-07 00:00:00",
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2009-04-14 00:00:00",
  "DeRegistrationEffectiveDate": "2009-04-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.78952,
  "FRS_Long": -96.69066,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24262,
      "AltID": "18000 gallon",
      "FacilityID": 17279,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 24886,
          "ProcessID": 24262,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31129,
          "ProcessID": 24262,
          "ChemicalID": 56,
          "Quantity": 84000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531129,
          "ProcessID": 24262,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17279,
      "SummaryText": "Union County Fertilizer has prepared an Emergency Response and Contingency Plan which is given too, and would be coodinated with the Elk Point Fire Dept., Union County Sheriffs Office, Elk Point Police Dept., Jefferson Fire Dept. and the Union County LEPC. We reveiw annually with the Elk Point Fire Dept. any changes that have been made and do on site inspections and training with them every other year.               Employees working with anhydrous ammonia have received  training with the use of videos and on the job training for the safe operating  procedures established for the transfer, transportation and storage.             Union County Fertilizer supplies seed, fertilizer and farm chemicals to the local agricultural community. We store anhydrous ammonia in a 18,000 gallon tank for fertilizing crops.  It is  tranfered to nurse tanks that are used to transport the product to the customer.                                                                                            The worst case scenario detailing a catastrophic failure of the main tank, as well as a mroe likely scenario of a broken pipe have been prepared. In the worst case scenario, the tank will have a maximum capacity of 15,500 gallons because written operating procedures prevent more than 15,500 gallons being present in the tank. If the main storage tank were to fail, assuming the entire contents of the tank were released within 10 minutes, a vapor cloud would span 4.9 miles necessitating an evacuation of residencies within that range. This event is unlikely to occur because of periodic examinations and maintence of the tank and hoses. If a catastrophic failure were to occur, the Elk Point Fire Department would be incharge of evacuation, the Elk Point Police Department, Union County Sheriffs Department and South Dakota Highway Patrol will be in charge of the traffic control.                                                                                                      A much more likely "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17279,
      "SummaryText": "event would be pipe or hose failure, which would result in a much smaller and slower release of anhydrous ammonia. In such an event Union County Fertilizer employees would proceed with emergency shutdown procedures as well as deluging the release ammonia with water to absorb as much as possible. The assumption used in the wosrt case scenario is that ammonia is released for 1 minute before it is shut off. Using EPA RMP*Comp modeling program is what determined that the release would necessitate an evacuation of areas within 1.3 miles. In the event of this scenario occurring, the Elk Point Fire Dept., the  Elk Point Police Dept and  the Union County Sheriffs Office would be contacted.                     Union County Fertilizer's accident prevention program conducted involves continual reveiw of operational procedures and safe methods of working with anhydrous ammonia. Employees also have informational literature available if questions would arise concerning handling of anhydrous ammonia. Periodic checks and mainenance of equipment also contribute to a safe enviroment by preventing accidents from occurring. Due to the diligence paid to preventative measures, there have been no accidental releases of anhydrous ammonia by this facility within the past five years.                                                                          The Union County LEPC, Elk Point Fire Dept., Elk Point Police Dept. and Union County Sheriffs Office have been provided with our Emergency Response and Contingency Plan which gives evacuaction and reponse plans, along with detailed descriptions and maps of this facility to assist them if an emergency were to occur.  The South Dakota Department of Agriculture conducts an annual inspection of all of our handling equipment and facility to ensure compliance and maintenance of all anhydrous ammonia equipment. Union County fertilizer is constantly  watching for better ways to improve the safety at the facility and for the safety of it's employees"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17279,
      "SummaryText": " and the community."
    }
  ]
}