{
  "FacilityID": 17289,
  "FacilityName": "TPCG Pollution Control  North Treatment Plant",
  "FacilityStr1": "2000 St. Louis Canal Road",
  "FacilityStr2": null,
  "FacilityCity": "Houma",
  "FacilityState": "LA",
  "FacilityZipCode": "70364",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22109",
  "LEPC": "Terrebonne Parish LEPC",
  "FacilityLatDecDegs": "29.628333",
  "FacilityLongDecDegs": "-90.733611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Terrebonne Parish Consolidated Government",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Terrebonne Parish Consolidated Govt",
  "OperatorStr1": "P. O. Box 2768",
  "OperatorStr2": null,
  "OperatorCity": "Houma",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70361",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136952",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-08-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-08-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.62938,
  "FRS_Long": -90.736201,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24275,
      "AltID": null,
      "FacilityID": 17289,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31144,
          "ProcessID": 24275,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 31145,
          "ProcessID": 24275,
          "ChemicalID": 49,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 24899,
          "ProcessID": 24275,
          "NAICSCode": "56221",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 9343,
              "Process_NAICS_ID": 24899,
              "SafetyReviewDate": "1997-02-06 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute, Compressed Gas Association,",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-20 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-20 00:00:00",
              "TrainingReviewDate": "1999-05-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Vendor certified instructors",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-20 00:00:00",
              "EquipmentInspectionDate": "1999-05-24 00:00:00",
              "EquipmentTested": "Chlorine contact chamber, vacuum regulator, chlorinator, sulfonator, chlorine diffusers",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 9780,
                  "PreventionProgram2ID": 9343,
                  "ProcessChemicalID": 31144
                },
                {
                  "PrimaryKey": 9781,
                  "PreventionProgram2ID": 9343,
                  "ProcessChemicalID": 31145
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17289,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Terrebonne Parish OER",
    "CoordinatingAgencyPhone": "5048736357",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 17289,
      "SummaryText": "a release at the Terrebonne Parish Consolidated Government North Wastewater Treatment Plant are outlined in the North Treatment Plant & South Treatment Plant Risk Management, Chemical Accidental Release Prevention Program.   Response actions have been coordinated with the Terrebonne Parish, Office of Emergency Preparedness (OEP).  The telephone numbers for the OEP, the state and local law enforcement agencies, as well as other reporting agencies are included in the above referenced document.  Step by step procedures for on site personnel are outlined in the event that a leak is detected including identifying the severity of the release, use of prepackaged repair kits, reporting and follow-up procedures, as well as severe weather procedures.  Detailed procedures for use of the repair kits are provided in the equipment specific manuals."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 17289,
      "SummaryText": "2694 LDEQ Facility ID Number\n\n\nUnited States Environmental Protection Agency (U.S. EPA) rule \"Chemical Accident Prevention Provisions,\" 40 CFR Part 68, states that \"the goal of the rule is to prevent accidental releases of toxic and flammable substances that can cause serious harm to the public and the environment and to mitigate the effects of releases that do occur\".  \n\nThe process that is covered under the Risk Management Program for the Terrebonne Parish Consolidated Government North Treatment Plant (TPCG-NTP) includes the use and storage of seven (7) 2,000-pound chlorine tanks and seven (7) 2,000-pound sulfur dioxide tanks.  The substances are used in the treatment of wastewater at the Terrebonne Parish Consolidated Government facility located at 2000 Saint Louis Canal Road near Houma, Louisiana.  The individual storage containers of the covered process do not exceed the threshold quantities outlined in 40 CFR Part 68; however, the containers for each substance are maintained in close enough proximity as to be considered one process for chlorine and sulfur dioxide.  The facility process met the Program 2 criteria, because it did not qualify for consideration under Program 1 due to the distance of the nearest receptor within the impact areas identified during the evaluation of the worst-case scenarios, and did not qualify for Program 3, because the facility is not subject to the OSHA Process Safety Management requirement.   \n\nProgram 2 requirements include: 1) the development of a management program which identifies the responsibilities of management personnel relative to the Risk Management Program, 2) a Prevention Program to establish procedures and document information that will help to prevent an accidental release, 3) an Emergency Response Program that outlines the necessary procedures and contacts in the event of an accidental release, 4) and the evaluation of a worst case and alternative scenario of a potential release from the covered process.   \n\nThe TP"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17289,
      "SummaryText": "CG has prepared specific accidental release prevention and emergency response policies to ensure the safety of employees and receptors, which fall within the distance of the worst-case scenario endpoint.  These policies include monthly maintenance and inspection procedures to ensure proper operation of the equipment and integrity of the storage vessels; biannual safety training by certified instructors regarding equipment and regulated substance use.   These policies are documented in written operating and maintenance procedures.\n\n1.0  PROGRAM IDENTIFICATION\n1.1 APPLICABILITY OF 40 CFR SECTION 68\n1.1.1 Stationary Source Identification\n\nClean Air Act (CAA) Section 112(r)(2)(c) defines stationary sources as \"any buidlings, structures, equipment, installations, or substances emitting stationary activities which belong to the same industrial group, which are located on one or more contiguous properties, which are under the control of the same person, and from which an accidental release may occur.\"   \n\nThe Terrebonne Parish Consolidated Government-North Treatment Plant (TPCG-NTP) meets the definition of stationary source.\n\n\n1.1.2 Regulated Substance Identification\n\nA facility is subject to the Chemical Accident Prevention Provisions (40 Code of Federal Regulations (CFR) Part 68) if they handle, manufacture, use or store any of the toxic and/or flammable substances listed in 40 CFR 168.130 above the specified threshold quantities in a process.  A review of site operations revealed that two substances stored on site were regulated under Section 68.130, which include chlorine and sulfur dioxide.  Seven 2,000-pound chlorine tanks and seven 2,000-pound sulfur dioxide tanks are stored at the northeast corner of the plant site, next to the sludge press building.  The total maximum on-site storage of chlorine is 14,000 pounds, and the total maximum on-site storage of sulfur dioxide is 14,000 pounds.   The threshold limits for these substances are 2,000 pounds and 5,000 pounds,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17289,
      "SummaryText": "respectively.\n\n1.1.3 Process Identification\n\nA process is defined in 40 CFR 68.3 as \"any activity involving a regulated substances, including any use, storage, manufacturing, handling, or on-site movement of such substances, or combination of these activities.  For the purposes of this definition, any group of vessels that are interconnected, or separate vessels that are located such that a regulated substance could be involved in a potential release, shall be considered a single process.\"\n\nOne process was identified at the TPCG-NTP.  As stated above, seven 2,000-pound chlorine tanks and seven 2,000-pound sulfur dioxide tanks are located at the plant site.  Both substances are considered one process due to the close proximity of the chlorine and sulfur dioxide tanks to each other.   \n \n1.2 PROGRAM IDENTIFICATION\n\nThe process identified at the TPCG North Treatment Plant was determined to meet the criteria for Program 2 status.  The facility has had no accidents within the past five years, and the facility is not subject to Occupational Safety and Health Administration, Process Safety Management (OSHA, PSM) requirements, because it is a local governmental facility.  However, the endpoint for the worst case scenario falls beyond the boundaries of the facility and reaches public receptors including residences and schools.  Because the process does not meet Program 1 or Program 3 status, it must fall within the requirements of Program 2.  The program criteria are described in the following sections.\n\n1.2.1 Worst-case Release Scenario\n\nA worst case scenario evaluates a release of the largest quantity of the regulated substance from a single vessel or a release from a process line failure, whichever results in the greatest distance to an endpoint.  One worst-case release scenario is required to represent all toxic substances held above the threshold quantity.\n\nThe worst case release scenario considered included the failure of one 2,000-pound chlorine tank.  EPA's RMP*Comp,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17289,
      "SummaryText": "Version 1.06 was used to calculate the distance to the endpoint of the release.  The program assumed that the release was liquid chlorine under pressure in an urban setting with many obstacles with the given default values.  The endpoint was determined to be 1.3 miles from the center of the facility.   \n\n1.2.2\tAlternative Release Scenario\n\nAn alternative release scenario is an event that is more likely to occur than the worst case scenario and that will reach an endpoint offsite.   One alternative release scenario for each toxic substance held above the threshold quantity is required.  \n\nThe alternate release scenario was considered to be the sheer of a process line of >-inch diameter resulting in the release of liquid chlorine occurring over a period of 10 minutes.  The alternative release scenario was calculated using RMP*Comp and the distance to the endpoint was determined to be 0.6 miles from the center of the facility.   \n\nAn alternative release scenario was also determined for a sheer of a >-inch diameter process line resulting in a release of liquid sulfur dioxide occurring over a period of 10 minutes.  The alternative release scenario was calculated using RMP*Comp and the distance to the endpoint was determined to be 0.50 miles from the center of the facility.  \n \n1.2.3\tManagement Program\n\nRegulations require that a management system be developed to oversee the implementation of the risk management program (RMP).  Terrebonne Parish Consolidated Government has assigned responsibility for development, implementation and integration of the RMP persons familiar with the process.  Responsibility is documented at the facility.\n\n2.0  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nProgram 2 requires the compilation of up-to-date safety information related to the regulated substances, process, and equipment.  The seven elements listed below are part of a general accidental release prevention program, which are detailed in subsequent sections:\n\n7 Safety Information\n7"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17289,
      "SummaryText": "Hazard Review\n7 Operating Procedures\n7 Training\n7 Maintenance\n7 Compliance Audits\n7 Incident Investigation         \n\n2.1   SAFETY INFORMATION\n\nWritten safety information pertaining to the hazards of the regulated substances used or produced by the process and information pertaining to the technology and equipment of its process at the North Treatment Plant have been compiled prior to conducting the hazard analysis required by this rule.  Safety information required for the RMP include the following: \n\n7 Material Safety Data Sheets (MSDS)  \n7 Maximum Intended Inventory                 \n7 Safe Upper and Lower Parameters\n7 Equipment Specifications\n7 Codes and Standards  \n \n2.1.1  Material Safety Data Sheets\n\nMaterial Safety Data Sheets (MSDS) are maintained to identify and understand the hazards posed in the process involving regulated substances.  MSDS's for chlorine and sulfur dioxide are maintained on file.\n\n2.1.2   Maximum Intended Inventory\n2.1.2.1 Chlorine \n\nThe maximum number of tanks currently stored at the North Treatment Plant is seven 2,000-pound chlorine tanks.  The Chlorine Institute recommends that chlorine tanks not be filled beyond 95% capacity at a maximum temperature of 1220F.  The maximum filling density is 125%.\n\n2.1.2.2\tSulfur Dioxide\n\nThe maximum number of tanks currently stored at the North Treatment Plant is seven 2,000-pound sulfur dioxide tanks. Information related to the safe temperature and filling capacity of tanks is provided by the Compressed Gas Association and is provided in the Risk Management document maintained at the facility.\n\n2.1.3 Storage and Process Limits\n\nStorage and process limits provide safety information relative to the recommended storage parameters for the specific equipment used on site including tanks and lines.  Refer to the equipment specification manuals maintained at the facility for specific information related to individual pieces of equipment.\n\n2.1.4   Equipment Specifications\n\nInformation pertaining to process"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17289,
      "SummaryText": "equipment is used to identify and understand hazards involving the operation of the equipment.  Equipment specifications were provided by the manufacturer/supplier and are kept on file.\n\n2.1.5 Codes and Standards\n\nSubpart C, Section 68.48 of the rule states that the owner must ensure that the process is designed according to good engineering practices.  Compliance with state and federal codes and industry specific standards meets this requirement.  The equipment specification manuals  list the codes and standards used for the design and installation of the process equipment.\n \n2.2   HAZARD REVIEW\n\nThe hazard review includes the identification and documentation of hazards associated with the handling and use of chlorine and sulfur dioxide, opportunities for malfunctions and errors that could lead to releases, safeguards used or needed to prevent causes of releases, and steps used or needed to detect, or monitor releases.  The following two specific hazards are identified by the Chlorine Institute as main causes for chlorine releases.\n\nReuse of gaskets - according to the Chlorine Manual, prepared by the Chlorine Institute, a release of chlorine is most often a result of reusing gaskets.  The operating procedures specify the use of new gaskets during change out of tanks at the NTP.\n\nImproperly made up pipe joints - Specifications for pipe joints are outlined in the equipment manuals for making up pipe joints and are incorporated into the operation procedures for the NTP.\n\nThe hazard review provides a means for determining if the process is designed and operated in accordance with standard industry codes and federal and/or local regulations.   The review requires a documented inspection of the process and operating procedures to ensure compliance.  The hazard review must be updated, at a minimum, every five years or after major process changes.  A copy of a hazard review checklist provided in the Risk Management Program Guidance for Wastewater Treatment Plants is inclu"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17289,
      "SummaryText": "ded in the Risk Management Plan document maintained at the facility.  This checklist is used to perform Hazard Reviews at the NTP.\n\n2.3   OPERATING PROCEDURES\n\nWritten step-by-step operating procedures that describe activities associated with the covered process are on file.  Operating procedures were developed based upon manufacturer's/supplier's written specifications as documented in the equipment manuals and biannual training provided by certified instructors.   \n\n2.4   TRAINING\n\nSafety related training is conducted biannually by certified instructors although it is only required every three years.  Training includes classroom instruction and on the job training. Testing is conducted by observing the trainee while he/she performs the operations.  Safety information is obtained from the equipment manuals, the MSDS's, and the training courses conducted by certified instructors.\n \n2.5   MAINTENANCE\n\nEquipment is inspected monthly and maintained in accordance with manufacturers or suppliers specifications.  Specific maintenance instructions are maintained at the facility.  A maintenance action form is used to schedule maintenance activities outside of the regularly scheduled events.  A log is kept on file to document the dates and actions completed during maintenance events as well as management oversight of maintenance activities.\n \n2.6   COMPLIANCE AUDITS\n\nCompliance audits are conducted every three years to certify that the process is in compliance with EPA's requirements for the Program 2 Prevention Program.   The audit serves as a means for identifying potential deficences related to the procedures and practices developed under the rule.  The Compliance Audit Checklist contains the checklist that was provided in the RMP Guidance Document that is used to complete the compliance audit at the NTP.   Compliance audits are maintained on file for a minimum of five years.\n\n2.7   INCIDENT INVESTIGATION\n\nIncidents that result in, or reasonably could result in a catastro"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17289,
      "SummaryText": "phic release, are investigated as quickly as possible, but no later than 48 hours following the incident.  Investigation results are documented and maintained on file for use in training employees about incident prevention and determining the potential need to re-evaluate operating or safety procedures, or update equipment. The following information is provided during the course of the incident investigation\n\n7 Date of incident\n7 Date investigation began\n7 Description of incident\n7 Factors contributing to incident\n7 Recommendations resulting from incident\n7 Recommendations, resolutions, and corrective actions shall be documented\n7 Findings will be reviewed with affected employees\n7 Investigation summaries will be retained for five years\n\n2.8   FIVE YEAR ACCIDENT HISTORY\n\nA review of accidental releases at the NTP which resulted in deaths, injuries, or significant property damage on site or known off-site deaths, injuries, evacuations, sheltering in place, property or environmental damage are documented in the five year accident history.  Terrebonne Parish Consolidated Government North Treatment Plant has had no accidental releases under the definition established by this rule.\n\n2.9   CHEMICAL SPECIFIC PREVENTION\n\nThe North Treatment Plant & South Treatment Plant Risk Management, Chemical Accidental Release Prevention Program on file at the facility outlines step by step procedures for cylinder receipt, physical leak check, stowage procedures, connection and disconnection and start up.  The chlorine and sulfur dioxide containers are stored in a covered area to prevent direct exposure to sunlight and elevated temperatures within the tanks that could result in a rupture.   As discussed previously, the use of new gaskets and the proper make up of pipe joints are used to prevent the release of chlorine or sulfur dioxide.   Manufacturer's specifications are followed to ensure safe use of these substances.\n \n\n3.0  EMERGENCY RESPONSE\n\n\nEmergency response actions relative to"
    }
  ]
}