{
  "FacilityID": 17383,
  "FacilityName": "Lompoc Water Treatment Plant",
  "FacilityStr1": "601 East North Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lompoc",
  "FacilityState": "CA",
  "FacilityZipCode": "93436",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": null,
  "FacilityLatDecDegs": "34.653333",
  "FacilityLongDecDegs": "-120.448056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A2",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City Of Lompoc",
  "OperatorStr1": "601 East North Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Lompoc",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93436",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063833",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-07-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-14 00:00:00",
  "DeRegistrationEffectiveDate": "2002-08-13 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.653383,
  "FRS_Long": -120.451192,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24454,
      "AltID": "chlorine disinfection",
      "FacilityID": 17383,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 31365,
          "ProcessID": 24454,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 25080,
          "ProcessID": 24454,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 13532,
              "Process_NAICS_ID": 25080,
              "SafetyReviewDate": "1999-05-27 00:00:00",
              "PHA_Date": "1999-04-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Fusible Plugs",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "VRCU and Chlorinators",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-27 00:00:00",
              "TrainingReviewDate": "1999-05-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-27 00:00:00",
              "EquipmentInspectionDate": "1999-04-30 00:00:00",
              "EquipmentTested": "Chlorine Containers  Vacuum Regulator  Chlorinators  Leak Detector No. 1 and 2  Caustic Bulk Tank  Scrubber Pump  Caustic Scrubber  Piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-27 00:00:00",
              "PreStartupReviewDate": "1999-05-27 00:00:00",
              "ComplianceAuditDate": "1999-05-27 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-27 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-27 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-27 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 19205,
                  "PreventionProgram3ID": 13532,
                  "ProcessChemicalID": 31365
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 17383,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-26 00:00:00",
    "ERTrainingDate": "1999-03-30 00:00:00",
    "CoordinatingAgencyName": "Lompoc Fire Department",
    "CoordinatingAgencyPhone": "8057364513",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17383,
      "SummaryText": "Executive Summary for RMP Submission to EPA\nCity of Lompoc Water Treatment Plant\n\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at Lompoc Water Treatment Plant are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass treatment of municipal potable water.  We have one regulated substance present at our facility.  This substance is chlorine.  Chlorine is used for disinfection of the municipal potable water supply.  The maximum inventory of chlorine at our facility is 8,000 pounds at present.  (If necessary, the inventory can be increased up to 12,000 pounds of chlorine to accommodate public health needs.)\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's RMP Guidance for Wastewater Treatment Plants Reference Tables and/or Equations.  The following paragraphs provide details of the two chosen scenarios the worst case scenario and the alternative scenario.\n\nWorst Case Scenario\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from chlorine in the disinfection process.  In this scenario 2000 pounds of chlorine is released.  The toxic liquid released is assumed to form a 1-centimeter deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  Fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17383,
      "SummaryText": "r this scenario, the released quantity has not been limited by a system of administrative controls.  At Class F atmospheric stability and 1.5 meters per second (m/s) windspeed, the maximum distance of 1.3 miles is obtained corresponding to a toxic endpoint of 0.0087 milligrams per liter (mg/l).\n\nAlternative Release Scenario\nThe selected alternative release scenario for chlorine involves a vapor release from a break in the flexible 3-16-inch tubing.  Since the system is under vacuum, a break alone would result in only a small release of chlorine gas from the tubing downstream of the regulator and upstream of the break.  However, if the break occurred and was accompanied by failure of the vacuum regulator, a release could occur from a valve.  The opening would be about 3/16-inch and potentially 5 lbs of chlorine per minute could be released.  This scenario would result in the release inside the chlorine building.  We conservatively assume the duration of the release is 30 minutes.  The leak detectors would notify an operator and the automatic controls would activate the emergency scrubber.  Standby help would arrive within minutes.  The leak would more likely be 15 minutes, the estimated maximum response time from detection and alarm to securing the leak.\nA caustic scrubber is activated that can neutralize 1 ton of chlorine in 2 hours and reduce concentrations to less than 1 part per million (ppm) in 3 hours.  Assuming 99.9 percent efficiency on the scrubber, we estimate that 0.2 pounds of chlorine would be released in 30 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/l of chlorine is less than 0.1 miles.  This is the minimum distance on the reference tables.  We anticipate that the release will not go offsite and there will be no impacts.\n4.\tAccidental Release Prevention Program and Chlorine-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention req"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17383,
      "SummaryText": "uirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 or later Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nLompoc Water Treatment Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The Process Hazard Analysis (PHA) methodology used to carry out these analyses is the Hazard and Operability (HAZOP) Study.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 3 years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA update was performed on April 30, 1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Lompoc Water Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nLompoc Water Treatment Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 2 years and more frequently as needed.\n\nMechanical Integrity\nLompoc Water Treatment Plant carries out documented maintenance checks on process equipment t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17383,
      "SummaryText": "o ensure proper operations.  Process equipment examined by these checks includes, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Lompoc Water Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on April 27, 1999.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to modifications in the established processes are conducted as a regular practice at Lompoc Water Treatment Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nLompoc Water Treatment Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on April 27, 1999.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  No changes to the process have been recommended at this time.\n\nIncident Investigation\nLompoc Water Treatment Plant will promptly investigate any incident that results in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations will be u"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17383,
      "SummaryText": "ndertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  There have been no reportable incidents at the facility.  If there should be one in the future, all reports will be retained for a minimum of 5 years.\n\nEmployee Participation\nLompoc Water Treatment Plant truly believes that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Lompoc Water Treatment Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.\tFive-year Accident History\nLompoc Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no reportable accidental release during this period.\n\n6.\tEmergency Response Plan\nLompoc Water Treatment Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17383,
      "SummaryText": "equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.\tPlanned Changes to Improve Safety\nWe are pleased with our safety record at the Lompoc Water Treatment Plant, therefore we have no planned changes to improve safety."
    }
  ]
}