{
  "FacilityID": 17492,
  "FacilityName": "Messinger Trucking & Warehouse Corporation",
  "FacilityStr1": "84-132 Lockwood Street",
  "FacilityStr2": null,
  "FacilityCity": "Newark",
  "FacilityState": "NJ",
  "FacilityZipCode": "07105",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34013",
  "LEPC": "Newark City LEPC",
  "FacilityLatDecDegs": "40.7375",
  "FacilityLongDecDegs": "-74.1325",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jon, Rich, Jeff, Larry Messinger",
  "OperatorStr1": "84-132 Lockwood Street",
  "OperatorStr2": null,
  "OperatorCity": "Newark",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07105",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rich Messinger",
  "RMPTitle": "Vice President of Messinger",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161576",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-17 00:00:00",
  "SafetyInspectionBy": "NJDEP",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-06-11 00:00:00",
  "DeRegistrationEffectiveDate": "2001-05-30 00:00:00",
  "AnniversaryDate": "2004-09-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.73561,
  "FRS_Long": -74.13316,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24653,
      "AltID": null,
      "FacilityID": 17492,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25279,
          "ProcessID": 24653,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31669,
          "ProcessID": 24653,
          "ChemicalID": 21,
          "Quantity": 530.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 31670,
          "ProcessID": 24653,
          "ChemicalID": 118,
          "Quantity": 470.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531669,
          "ProcessID": 24653,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531670,
          "ProcessID": 24653,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17492,
      "SummaryText": "Risk Management Plan\n\n\nExecutive Summary\n\nThis Risk Management Plan (\"RMP\") has been completed by Regulatory Compliance Services, Inc. for Messinger Trucking and Warehouse Corporation (Referred to as \"Messinger\") in compliance with the Environmental Protection Agency (\"EPA\") Clean Air Act, Section 112(r). Messinger operates a closed container public warehouse facility with hazardous substances that are covered under 112(r). \n\nRegulatory Compliance Services, Inc. (\"RCS, Inc.\") has been retained by Messinger to investigate this facility's need to implement a Risk Management Plan. RCS, Inc. reviewed Material Safety Data Sheets (MSDS) for all the products stored at Messinger. After the product review, four (4) products stored at the facility contained constituents that were listed under RMP. \n\nThe second stage in completing this plan was to investigate the storage history for each constituent. After review of the inventories, two products, epichlorohydrin and butane, exceeded thresholds outlined by the EPA. This plan was created to reflect these two substances.\n\nThe RMP requirements were designed to facilitate communication to responders and the public in the event of a catastrophic release of the listed substances. These requirements also insure the continuing improvement and safety of each identified process. Major facilities needing to comply with 112(r) may be defined as; a facility that is used to store large volumes of highly hazardous substances for use in manufacturing, treatment processes or bulk storage. Some of the requirements are not applicable to a closed container non-bulk facility. All items that are not applicable are provided with an explanation in the attachments to this plan.\n\nThe RMP has three different models to follow when completing a plan. The models are based on types of products, processes, quantities, etc. This plan meets the requirement of Program 2.\n\n\n1)    The accidental release prevention and emergency response policies at the stationary sou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17492,
      "SummaryText": "rce.\n\nMessinger operates a private, contract warehouse. The facility is located in an urban area in Northeast New Jersey, 84-132 Lockwood Street, Newark, Essex County, New Jersey. Product stored in the warehouse exceeds threshold requirements outlined in the Code of Federal Regulations (\"CFR\") Title 40, Part 68. In fully demonstrating compliance with the standards set forth in Section 112(r) of the 1990 Clean Air Act, Messinger is implementing a Risk Management Program through this Risk Management Plan.\n\nThe facility is a closed-container distribution facility for appropriately marked, labeled, and packaged non-bulk products. Some products contain substances that are considered extremely hazardous by the Environmental Protection Agency (\"EPA\"). These products are stored within code approved storage areas within the warehouse. These code approved areas have been designed to store certain products, following guidelines established by Building Officials Code Association (\"BOCA\") 1996 Guidelines, and National Fire Protection Association (\"NFPA\") Guidelines.\n\nMessinger is dedicated to providing a safe, publicly aware, environmentally friendly solution to logistics management. All procedures at the facility have been written to ensure employee and public safety. Procedures are continuously scrutinized and revised based on employee suggestion and management review.\n\nEmployee discovery of a release of a hazardous substance would result in implementation of the emergency response procedures developed at Messinger. The first step for an employee would be to immediately notify his or her supervisor. The supervisor will immediately contact the Primary Emergency Coordinator. Upon notification of a release, the Primary Coordinator will immediately contact the local fire department, the police department, the Community Emergency Planning Committee, the New Jersey Department of Environmental Protection (\"NJDEP\") Emergency Hotline, and the outside response contractor.\n\nEvacuation of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17492,
      "SummaryText": " the facility due to a release will occur whenever directed by an alarm signal, direction from facility management or by the local response officials. The emergency coordinator will direct all incoming vehicles to the facility, for normal operations of the facility, including but not limited to shipping and receiving, away from the facility. Those vehicles will avoid roads used for emergency vehicles and the entrance to the facility to wait for further direction.\n\n\n2)    The stationary source and regulated substances handled.\n\nMessinger is a closed container public warehouse. The facility does not manufacture, package, transfer, or otherwise deal with raw product. Therefore, the facility only has one process that deals with hazardous substances regulated by the Risk Management Program.\n\nThe process includes the entrance of trucks containing containerized product, unloading the trailers using motorized forklifts, storage of the product in designated areas within the warehouse, loading the trailers with motorized forklifts, and the exit of the trucks from the property.\n\nThe products that are stored at this facility are varied in concentrations, physical states, and constituents. Only a small amount of the products in the warehouse contain regulated hazardous substances.\n\nDue to the constant change in inventory driven by the industry demand for \"real-time\" readily available chemicals, Messinger does not have a steady amount of regulated substances in the warehouse. To determine the maximum amount of the regulated substances stored in the building, a review of product inventories was conducted to achieve a historical maximum storage. The maximum storage was used to calculate possible quantities that may be released. \n\nDuring a review of all the products, including constituents and concentrations, it was determined that epichlorohydrin, CAS # 106-89-8, and butane, CAS # 106-97-8, are above the thresholds designated by the EPA. The quantity of epichlorohydrin is 534.78 pound"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17492,
      "SummaryText": "s and the quantity of butane is 474.63 pounds.\n\n\n3)    Worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nEpichlorohydrin is governed under the toxic substance category in the RMP. The worst case scenario would be a comprehensive incident, an \"act of God\" that is not controlled by Messinger. In this worst case scenario, the only mitigating measures would be the internal containment of the building. The building has an internal containment capacity of approximately 490,942 gallons with an overflow capacity of 21,840 gallons. If the product vaporized and could escape the confines of the building structure, under worst case weather conditions it would travel 0.55 miles before dispersing enough to no longer pose a hazard to the public. The endpoint distance was calculated using the EPA's Offsite Consequence Analysis (OCA) guidance.\n\nThe alternative release scenario for toxic substances would be a comprehensive incident, an \"act of God' that is not controlled by Messinger. This may cause for destruction of one sea freight container, holding eighty 55-gallon drums. In this alternative release scenario, no mitigating measures are present to contain the release. The dispersion cloud would travel 0.31 miles before dispersing enough to no longer pose a hazard to the public. The endpoint distance was calculated using the EPA's Offsite Consequence Analysis (OCA) guidance.\n\nButane is governed under the flammable substance category in the RMP. The worst case scenario would be a comprehensive incident, an \"act of God\" that is not controlled by Messinger. In this worst case scenario, the only mitigating measures would be the internal containment of the building. The building has an internal containment capacity of approximately 490,942 gallons with an overflow capacity of 21,840 gallons. If the product vaporized and could escape the confines of the building stru"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17492,
      "SummaryText": "cture, under worst case weather conditions it would travel 0.06 miles before dispersing enough to no longer pose a hazard to the public. The endpoint distance was calculated using the EPA's Offsite Consequence Analysis (OCA) guidance.\n\nThe alternative release scenario for flammables would be a comprehensive incident, an \"act of God\" that is not controlled by Messinger. This may cause for destruction of one sea freight container, holding sixteen (16) pallets, forty (40) cases per pallet, 36 boxes per case, and 24 vessels per box. In this alternative release scenario, no mitigating measures are present to contain the release. The dispersion cloud would travel 0.16 miles before dispersing enough to no longer pose a hazard to the public. The endpoint distance was calculated using the EPA's Offsite Consequence Analysis (OCA) guidance.\n\n\n4)    The general accidental release prevention program and chemical specific prevention steps.\n\nAt the time, Messinger is not required to maintain a plan in accordance with the Occupational Safety and Health Administration's (\"OSHA\") Process Safety Management (\"PSM\") rules. In addition, this facility does extensive training, procedural reviews, and complies with the requirements of this rule. \n\nUpon hiring, and every year there after, each employee is given Department of Transportation (\"DOT\") hazardous materials training, OSHA Hazard Communication (\"HAZCOM\") training, and EPA Right-To-Know (\"RTK\") training. In addition, all new employees are given additional training regarding Personal Protection Equipment (\"PPE\") use and maintenance, loading and unloading, handling of material, forklift operation, emergency response, and evacuation procedures.\n\nThis facility has also developed a safety committee. The safety committee is comprised of workers and management that meet once a month. The purpose of the safety committee is to review any incidents that may have occurred and discuss safety related issues in the facility. All issues are addressed "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17492,
      "SummaryText": "and discussed until a viable solution is derived. \n\n\n5)    The five-year accident history.\n\nMessinger has been operational since January 1971. Due to the nature of the processes, extensive training, and thorough operating procedures, this facility has not had a release in the past five years.\n\n\n6)    The emergency response program.\n\nMessinger has an emergency response program in place. This plan describes the procedures to be implemented as a result of a release. Twice per year, the facility runs mock evacuations based on a release or fire. All mock evacuations are reviewed for effectiveness.\n\nIn addition, Messinger has developed and implemented a Discharge Prevention Control and Countermeasures/Discharge Cleanup and Removal (\"DPCC/DCR\") plan. This plan is registered with the State of New Jersey.\n\n\n7)    Planned changes to improve safety.\n\nMessinger is continually reviewing and altering procedures and processes to improve performance and safety. At this time, the facility will not be planning drastic changes to building structure, grounds, or mitigation systems.\n"
    }
  ]
}