{
  "FacilityID": 17607,
  "FacilityName": "Grain Processing Corporation",
  "FacilityStr1": "1600 Oregon Street",
  "FacilityStr2": null,
  "FacilityCity": "Muscatine",
  "FacilityState": "IA",
  "FacilityZipCode": "52761",
  "Facility4DigitZipExt": "0072",
  "FacilityCountyFIPS": "19139",
  "LEPC": "Muscatine County LEPC",
  "FacilityLatDecDegs": "41.397861",
  "FacilityLongDecDegs": "-91.060889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.grainprocessing.com",
  "FacilityEmailAddress": "lawdept@varied.com",
  "FacilityDUNS": 198484180,
  "ParentCompanyName": "Varied Investments, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5269923,
  "Company2DUNS": 0,
  "OperatorName": "Grain Processing Corporation (GPC)",
  "OperatorStr1": "1600 Oregon Street",
  "OperatorStr2": null,
  "OperatorCity": "Muscatine",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52761",
  "OperatorZipCodeExt": "0072",
  "RMPContact": "Doyle Tubandt",
  "RMPTitle": "Vice President, Operations",
  "FTE": 863,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052603",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Applied for.",
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-09-17 00:00:00",
  "ErrorReportDate": "1999-09-17 00:00:00",
  "ReceiptDate": "1999-09-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-13 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.39814,
  "FRS_Long": -91.06258,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 24800,
      "AltID": null,
      "FacilityID": 17607,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25433,
          "ProcessID": 24800,
          "NAICSCode": "31111",
          "_desc": {
            "NAICS_CODE": "31111",
            "NAICS_DESCRIPTION": "Animal Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 31833,
          "ProcessID": 24800,
          "ChemicalID": 9,
          "Quantity": 258400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 31834,
          "ProcessID": 24800,
          "ChemicalID": 12,
          "Quantity": 58052.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 31835,
          "ProcessID": 24800,
          "ChemicalID": 25,
          "Quantity": 69700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531833,
          "ProcessID": 24800,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531834,
          "ProcessID": 24800,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 531835,
          "ProcessID": 24800,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17607,
      "SummaryText": "EXECUTIVE SUMMARY\nGrain Processing Corporation (GPC) uses every means at it's disposal to operate a safe workplace.  This includes implementing the provisions of 29 CFR 1910.119 (OSHA PSM) and 40 CFR part 68 (E.P.A. RMP) which are systemic approaches for chemical process hazards management designed to eliminate or minimize the potential for major catastrophes caused by the release of highly hazardous chemicals.  GPC will employ these measures to ensure that the means for preventing a catastrophic release, fire, or explosion are understood by all personnel onsite, and to ensure the necessary preventative measures and lines of defense are installed and maintained.  Management will ensure that these measures are properly established and utilized.\nGPC is located in the city of Muscatine, Muscatine County, Iowa.  The facility covers approximately 110 acres.  GPC is a corn wet miller.  GPC produces beverage and denatured alcohol, crude corn oil, superabsorbent polymers, methyl glucoside, feed by-products, starches, maltrodextrins and corn syrup solids.  GPC facilities include storage tanks and processes typical of a corn wet milling plant.  \n\nThe primary plant operations of concern include:\nRailcar and tank truck unloading areas.\nEthylene oxide storage and transfer systems..\nAcrylonitrile storage, transfer and process systems.\n\nUse of regulated substances.\nEthylene oxide and propylene oxide are used in the process to produce various starches.\nAcrylonitrile is used in the process to produce superabsorbent polymers.\nQuantities handled or stored:\nEthylene Oxide\n    Minimum inventory        -0-\n    Maximum inventory        258,400 lbs.\nPropylene Oxide\n    Minimum inventory        -0-\n    Maximum inventory         58,052 lbs.\nAcrylonitrile\n    Minimum inventory        -0-\n    Maximum inventory        69,700 lbs.\n\n\n C.    Offsite consequence analyses have been done for three chemicals.  These chemicals are ethylene oxide (CAS No. 75-21-8, propylene oxide (CAS No. 75-56-9 and acrylonitrile (CAS No. 107-13-1).  Two scenarios were consi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17607,
      "SummaryText": "dered for each substance.  These two scenarios are the \"worst case release\" and the \"alternative scenario\".  EPA defines the worst case release to be that...\"the     maximum quantity in the largest vessel.... is released as a gas over 10 minutes,\" due to an unspecified failure.  The alternative scenario is defined as more likely to occur than the worst case release scenario.  The alternative scenarios were developed by reviewing the Process Hazard Analyses for these substances (which were done as part of the OSHA Process Safety Management (PSM) planning) as well as talking to area supervisors and operators.\n\nEPA requires that \"one worst case release scenario be submitted to represent all regulated toxic substances held above the threshold quantity and one worst case release scenario to represent all flammable substances held above the threshold quantity.\"  The owner/operator must also submit \"information on one alternative release scenario for each regulated toxic substance held above the threshold quantity and one alternative release scenario to represent all flammable substances held above the threshold quantity.\"  No regulated flammables are held on site.\n\nAccordingly, one worst case scenario is being submitted for ethylene oxide.  In addition, alternative release scenarios are being submitted for ethylene oxide, propylene oxide and acrylonitrile (all toxics held above the threshold quantity).  Explanations of all release scenarios (worst case and alternative case) for each of the four regulated substances may be found in Appendix XX of this document.\n\nThe worst case release scenario for ethylene oxide involves the rupture of the storage tank and subsequent release of its entire contents as a liquid over a \n10 minute period as required by EPA.  The liquid is contained in a dike which represents a passive mitigation technique as allowed by EPA.  The liquid in the dike boils and evolves ethylene oxide gas at a rate of 69.6 lb/minute.  These are conservative estimates "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17607,
      "SummaryText": "because ethylene oxide readily combines with any available water (including water vapor in the air) to form ethylene glycol.  Ethylene glycol is not a regulated toxic under RMP.  The reaction of ethylene oxide to ethylene glycol is exothermic.  The heat generated by the reaction will enhance reduce plume density, increase turbulence at the boundary layer and incorporate more air and water into the plume (which, in turn, perpetuates the reaction and generates more heat).  None of these effects are considered by current models and all will reduce the distance to the endpoint.  This additional conservatism assures that the reported results are truly the worst case conditions.\n\nAtmospheric dispersion modeling was done to determine the distance traveled by the ethylene oxide vapor until the concentration decreases to the \"toxic endpoint\" selected by EPA of 90 mg/m3 which is also the Emergency Response Planning Guideline Level-2 (EPRG-2).  This is defined by the American Industrial Hygiene Association (AGHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\"  A circle with a radius equal to the distance to the toxic endpoint must be drawn and the potentially exposed population within that circle must be determined.\n\nEPA mandated the use of extremely stable meteorological conditions for dispersion modeling analyses.  These EPA default values were used:  Stability Class F, 1.5 m/s wind speed, 77oF ambient temperature and 50% relative humidity.  The latest version of the EPA approved guideline model Degadis was used.  This is appropriate for a dense gas such as ethylene oxide.  The model results show that the distance to the toxic endpoint is 0.47 miles and  the potentially affected population is 56.\n\nThe alternative release scenario inv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17607,
      "SummaryText": "olves a break in the one-inch transfer line while ethylene oxide is being transferred.  The use of active and passive mitigation techniques allowed by EPA would limit this release to five minutes (at an absolute maximum) and the release rate would be 718 lb/min.  There are difficulties evaluating this scenario using either the EPA look-up tables or dispersion models due to the short release duration of this scenario.  The look-up tables give a distance to the endpoint of 0.77 miles (after modifying the emission duration to 10 minutes) while dispersion modeling gives a distance of 0.92 miles.  However, this is an inappropriate use to the Degadis model.  It is not appropriate to compare a five minute release to a one hour averaging time.  The 90 mg/m3 ERPG value is based upon a one-hour averaging time.  The endpoint concentration can be modified using available exposure/concentration relationships to match the five minute release duration.  This yields a value of 312 mg/m3.  Using this as an endpoint gives a distance 0.14 miles.  The plume never crosses the plant fenceline so there are no offsite consequences.\n\nPropylene oxide is is used in much the same way as ethyene oxide.  However, it is stored and used in much smaller quantities.  The alternative release scenario for propylene oxide involves a break in the two inch line to the transfer pump inside the starch building.  A deluge and foam system has been installed to deal with such an accident.  This release would occur inside the starch building which further mitigates the release to the outside environment.  EPA allows the consideration of active and passive mitigation techniques when conducting consequence analyses for alternative release scenarios.\n\nThe effect of the mitigation was calculated using equations approved by EPA in their RMP Offsite Consequence Analysis Guidance.  The total release of propylene oxide would be 19,200 pounds.  The mitigation techniques restrict this release to 63 lb/min.\n\nAtmospheric "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17607,
      "SummaryText": "dispersion modeling was done to determine the distance traveled by the propylene oxide vapor until the concentration decreases to the \"toxic endpoint\" selected by EPA of 590 5mg/m3 which is also the Emergency Response Planning Guideline Level-2 (EPRG-2).  A circle with a radius equal to the distance to the toxic endpoint must be drawn and the potentially exposed population within that circle must be determined.\n\nThe Degadis model predicts a distance to the toxic endpoint of 0.11 miles.  A circle with this radius centered on the point of release falls fully within the plant fenceline so there are no offsite consequneces.\n\nAcrylonitrile is the third chemical to be considered.  The alternative release scenario for acrylonitrile involves a break in the 2 inch transfer line.  A deluge and foam system has been installed to mitigate the release from such an event.  The total release in this scenario would be 5250 pounds.\n\nAtmospheric dispersion modeling was done to determine the distance traveled by the acrylonitrile vapor until the concentration decreases to the \"toxic endpoint\" selected by EPA of 76 5g/m3 which is also the Emergency Response Planning Guideline Level-2 (EPRG-2).  A circle with a radius equal to the distance to the toxic endpoint must be drawn and the potentially exposed population within that circle must be determined.\n\nThe modeling was done using two different approaches.  Acrylonitrile is a liquid which is not very volatile.  The evaporation rate can be calculated using the Clewell Equation for non-boiling liquids on land (see Appendix) and would be be 17.7 lb/min.  In the first modeling approach it was assumed that this evaporation rate would be cut in half by the deluge/foam mitigation system.  The result, 8.8 lb/min was used as the input to the Degadis model and it was run in the gas release mode.  The distance to the toxic endpoint was predicted to be 0.09 miles.  The second approach allows the Degadis model to do the evaporation calculation.  The c"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 17607,
      "SummaryText": "alculated evaporation rate was almost half of the prediction of the Clewell Equation (9.8 lb/min vs. 17.7 lb/min).  if this evaporation rate is halved to account for the deluge/foam system and the modeling is run again the distance to the toxic endpoint is predicted to be 0.08 miles.  Both distances are similar and both are the impact does not cross the plant fenceline so there are no offsite consequences.\n\nEPA's recommendation for the alternative case is scenario is to use the same release event (complete release of the tank contents in 10 minutes) but to adjust the yield factor for the vapor cloud explosion to 3%.  Again the recommended EPA formula was used.  This scenario gives a distance to the 1 psi overpressure endpoint of 0.26 miles.  The potentially affected population is 8.\n D.    The general accidental release prevention program and chemical-specific prevention steps at GPC includes but are not limited too:\nAll elements of 29 CFR 1910.119 (OSHA PSM)\nNFPA (National Fire Protection Association)\nE.P.A., A.P.I. (American Petroleum Institute)\nASTM (American Society for Testing of Material)\nNBIC (National Board of Boiler and Pressure Vessel Inspections.)\nASME (American Society of Mechanical Engineers)\n\nIn addition policies and procedures are set forth in GPC's corporate safety and PSM manuals outlining both normal and emergency procedures.\n\nGPC has conducted as part of the Process Safety Management rule, a process hazard analysis (PHA) of PSM covered areas, critical processes and mitigation systems to ensure safety systems are maintained for regulated chemicals.  Based on the findings and recommended actions of the P.H.A.'s many changes to improve safety have been implemented.\n\nE.    The facilities emergency response program is coordinated with the city of Muscatine's Local Emergency Planning Committee (LEPC).\nSafety committees consisting of salaried and hourly operating personnel meet quarterly to evaluate and implement as deemed prudent, safety recommendations.  In "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 17607,
      "SummaryText": "addition, plant-wide safety meetings for all GPC personnel are held on a quarterly basis.  The V.P. of Production and the plant Safety Director meet on a regular basis to ensure recommendations are being addressed in a timely and practical manner.\n F.\nEthylene Oxide\nWorst Case Scenario\n\nEthylene Oxide has a boiling point of 51 oF.  It is stored as a subcooled liquid at about 45 oF.  The worst case scenario would be a tank rupture creating an instantaneous spill of the entire tank contents.  The tank capacity is 40,000 gallons.  Administrative controls are present which stipulate that the tank contents will not exceed 85% of capacity or 34,000 gallons (258,400 lbs).  It is assumed that since ethylene oxide is stored as a subcooled liquid it would be released as a liquid and would not flash immediately to a vapor.  This is born out by evaporation equations.\n\nEPA Technique:\n\nThe evaporation rate is determined from the following equation.\n\n    QR = 1.4 x LFB x A\n\n    Where:    QR = evaporation rate (lb./min)\n            LFA = Liquid Factor Boiling = .12 (Exhibit B-2, Appendix B, \n            p. 86 EPA Guidance)\n            A = Diked area = 1200 ft2\n\n    QR = 1.4 x 0.12 x 1200 = 201.6 lb./min\n\n    258,400 lb/201.6 lb./min. = 1282 minutes for total evaporation\n\nUse the lookup table (Reference Table 6, p. 29 EPA guidance) to find the distance to the toxic endpoint of 3.3 miles.\n\nEPA Technique with Modeling:\n\nThe scenario can be modeled as a continuous ground level gaseous release using the EPA derived release rate of 201.6 lb./minute.  This should be modeled as a non-isothermal release to account for heat transfer between the gas cloud and the surrounding air and ground.  This gives a distance to the toxic endpoint of 0.79 miles.  \n\nSB Equation Modeling Approach:\n\nThe SB Equation allows for the calculation of the evaporation rate of boiling liquids on land.  This value can be inserted into the model in lieu of the EPA derived value.  The SB Equation is designed for liquid pools that are relatively shallow which wo"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 17607,
      "SummaryText": "spreading.\nThe first step is to determine the quantity of ethylene oxide which would be lost in this scenario.  If the pipe ruptured during transfer the release rate can be determined by using the equation of Crowl and Louvar.\n\n    Q = CD x pl x A x (2gc(Ps-Pa)/pl + 2gh)0.5\n\n    Where:    Q = Discharge rate, lb./sec.\n            CD = Discharge coefficient = 0.61\n            pl = density of liquid = 7.6 lb./gal = 56.85 lb./ft3\n            A = Area of discharge 1\" dia. = 0.00545 ft2\n            gc = Acceleration of gravity = 32.2 ft/sec2\n            Ps = Storage pressure = 35 psig = 49.7 psia = 7157 psf\n            Pa = Ambient Pressure = 14.7 psia = 2117 psf\n            h = Liquid head in tank = 10 ft.\n\nQ = 0.61 x 56.85 x .00545 x (2 x 32.2(7157-2117)/56.85 + 2 x 32.2 x 10)0.05\n        = 0.189(79.7)\n\n        = 15.1 lb./sec\n\n258,400 lb/15.1 lb./sec = 17,153 seconds = 286 minutes (4.8 hours) to empty tank\n\nA release of this type would be detected by the sensors monitored by the gas chromatograph at South Starch.  Detection would be nearly immediate and the valve could be closed in less than 5 minutes.  Therefore, the total release would be:\n\n    15.1 lb./sec x 5 min. x 60 sec/min = 4530 lbs\n\nThe evaporation rate using EPA techniques is:\n\n    QR = QS x 2.4 x LFA x DF\n\n    Where:    QR = Quantity released to air (evaporation rate), lb./min\n            QS = Quantity released = 4530 lbs\n            LFB = Liquid Factor Boiling = .12\n            DF = Density Factor = .55\n\n    QR = 4530 x 2.4 x .12 x .55 = 718 lb./min\n\n\nEPA technique:\n\nUsing the look-up table (Reference Table 15, EPA Guidance p. 60) the distance to the toxic endpoint is 2.4 miles.  \n\nEPA Technique with Modeling:\n\nThe scenario can be modeled as a continuous ground level gaseous release using the EPA derived release rate of 718 lb./minute.  This should be modeled as a non-isothermal release to account for heat transfer between the gas cloud and the surrounding air and ground.  This gives a distance to the toxic endpoint of 0.92 miles.  \n\nSB Equation Modeling Approach:\n\nThe SB Equation allows for the calculation of the evaporatio"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 17607,
      "SummaryText": "uld not be the case if the EO tank ruptured and filled the dike.  The calculation will be done for comparison purposes.\nThe SB Equation is as follows:\n\nm = 4Xks(Ta-Tb) x (2 x 3.14159 x g x Vo)0.5 x t.50/(dHv x 3.14159 x as)0.5\n\n    Where:    m = mass flux rate (evaporation rate), kg/sec\n            X = surface roughness correction factor = 1 for concrete\n            ks = thermal conductivity of surface = 0.92 for concrete\n            Ta = Ambient Temperature = 25 oC = 298 K\n            Tb = Liquid boiling point = 283.77 K\n            g = 9.8 m/s\n            Vo = Volume of Liquid Released = 128.7 m3\n            t = time after spill (sec)\n            dHv = latent heat of vaporization = 569,000 j/kg\n            as = thermal diffusivity of surface = 4.16 x 10-7 for concrete\n\n    m = 4 x 1 x 0.92 x (298 - 284) x (2 x 3.14149 x 9.8 x 128.7)0.5 x t0.5\n            (569,000) x (3.14159 x 4.16 x 10-7)0.5\n\n        = 3.68 x (14) X (7924.7)0.5 X t.5\n        569,000 x (1.31 x 10-6)0.5\n\n        = 4586.4 x t.5\n        650.5\n        = 7.05 x t.5 kg/sec\n\nSolving this equation on a spreadsheet indicates that the entire tank contents would be evaporated in about 840 seconds (14 minutes).  This is two orders of magnitude less than the EPA's equation predicts due to the fact that the SB Equation includes no term for the surface area of the pool.  Degadis predicts that an unrestricted pool would cover 138,536 ft2 (to a depth of 0.1 cm) and take 2552 seconds (42.5 minutes) to evaporate.  This is comparable to the SB Equation results.  Restricting pool formation with a dike reduces the surface area of the liquid exposed to the air and greatly reduces the evaporation rate.  The SB Method grossly overestimates the evaporation rate because it fails to account for surface area and is thus rejected.\n\nPure Modeling Approach:\n\nThe Degadis model will calculate the evaporation rate internally and apply it to calculate the distance to the toxic endpoint.  Unfortunately, it can only do this for a continuous release of liquid which is not the case.  The model can be run and the evaporation rate determined, then input th"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 17607,
      "SummaryText": "is value into the model again as a continuous gas release (because the release is much longer than the averaging time used).  The evaporation rate determined in this manner is 69.6 lb./min which would take 3713 minutes (61.9 hours) for the EO to evaporate completely.  This should be modeled as a continuous, ground level, isothermal release.  Degadis indicates that the toxic endpoint (90 mg/m3) extends 0.47 miles for this case.\nSummary:\n\nThe last method is the most realistic approach although it probably overstates the extent of the toxic endpoint.  However, this conservative approach is acceptable for the worst case scenario.  The distance to the toxic endpoint of 0.47 miles should be used.\n\n\nAlternative Case Scenario\n\nEthylene Oxide has a boiling point of 51 oF.  It is stored as a subcooled liquid at about 45 oF.  The worst case scenario would be a tank rupture creating an instantaneous spill of the entire tank contents.  The tank capacity is 40,000 gallons.  Administrative controls are present which stipulate that the tank contents will not exceed 85% of capacity or 34,000 gallons (258,400 lbs).  It is assumed that since ethylene oxide is stored as a subcooled liquid it would be released as a liquid and would not flash immediately to a vapor.  This is born out by evaporation equations.\nThe most likely release scenario would occur from a break in the 1 inch line from the transfer pump.  It is likely that this release would occur inside the building which would reduce the release rate of EO.  A deluge system is also in place which would further mitigate the release.  The presence of these active and passive mitigation devices make calculation of the release rate to the atmosphere difficult.  It is possible that the break could occur within the dike or outside the dike and outside the building.  The \"worst\" alternative case would be the latter which would form a liquid pool on the ground which would evaporate more quickly than if it occurred in the dike (due to pool "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 17607,
      "SummaryText": "n rate of boiling liquids on land.  This value can be inserted into the model in lieu of the EPA derived value.  The SB Equation is designed for liquid pools that are relatively shallow which is appropriate for this scenario.\n\nThe SB Equation is as follows:\n\nm = 4Xks(Ta-Tb) x (2 x 3.14159 x g x Vo)0.5 x t.50/(dHv x 3.14159 x as)0.5\n\n    Where:    m = mass flux rate (evaporation rate), kg/sec\n            X = surface roughness correction factor = 1 for concrete\n            ks = thermal conductivity of surface = 0.92 for concrete\n            Ta = Ambient Temperature = 25 oC = 298 K\n            Tb = Liquid boiling point = 283.77 K\n            g = 9.8 m/s\n            Vo = Volume of Liquid Released = 79.7 ft3 = 2.26 m3\n            t = time after spill (sec)\n            dHv = latent heat of vaporization = 569,000 j/kg\n            as = thermal diffusivity of surface = 4.16 x 10-7 for concrete\n    m = 4 x 1 x 0.92 x (298 - 284) x (2 x 3.14149 x 9.8 x 2.26)0.5 x t0.5\n            (569,000) x (3.14159 x 4.16 x 10-7)0.5\n\n        = 3.68 x (14) X (7924.7)0.5 X t.5\n        569,000 x (1.31 x 10-6)0.5\n\n        = 607.8 x t.5\n        650.5\n\n        = .93 x t.5 kg/sec\n\n       = 123.3 x t.5 lb./min\n\nSolving this equation on a spreadsheet indicates that the entire tank contents would be evaporated in about 200 seconds (3.3 minutes).  This rate is higher than the EPA's equation predicts (average of 1318 lb./min vs. 718 lb./min) but both methods yield evaporation rate's which indicate near instantaneous evaporation.  Therefore, a gaseous release will be modeled of 5 minute duration.\nDegadis has difficulty doing this analysis because the release resembles more of a puff than a continuous release..  It simply tracks the isopleth representing 90 mg/m3, the toxic endpoint.  This dissipates after about 12 minutes but the 90 mg/m3 value is based on a 1-hour averaging time.  However, the concentration could exceed a much larger value for a short averaging time and, even if it went to zero for the remainder of the hour, the 1-hour average would still exceed the toxic endpoint.  For example, if the plume reached a conce"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 17607,
      "SummaryText": "ntration of 900 mg/m3 (using a 6-minute average) after six minutes and then went to zero for 54 minutes, the 1-hour concentration would be 90 mg/m3.  EPA suggests looking at this situation with shorter averaging times when the anomalous results are obtained.\nThe highest results are usually obtained for an averaging time that is close to the duration of the release.  A 5-minute averaging time would be used for this case.  Conducting the analysis in this manner gives a distance to the toxic endpoint of 0.26 miles.  \n\nSummary:  \n\nModeling the alternative case using the results obtained from the SB Equation is the most realistic approach.  This yields a distance to the toxic endpoint of 0.26 miles.\n\nPropylene Oxide\nWorst Case Scenario\n\nPropylene Oxide has a boiling point of 100 oF.  It is stored as a subcooled liquid at about 50 oF.  The worst case scenario would be a tank rupture creating an instantaneous spill of the entire tank contents.  The tank capacity is 10,500 gallons.  Administrative controls are present which stipulate that the tank contents will not exceed 80% of capacity or 8400 gallons (58,052 lbs).\n\nEPA technique:\n\nThe evaporation rate is determined from the following equation.\n\n    QR = 1.4 x LFA x A\n\n    Where:    QR = evaporation rate (lb./min)\nLFA = Liquid Factor Ambient = .093 (Exhibit B-2, Appendix B, \n            p. 86 EPA Guidance)\n            A = 364 ft2\n\n    QR = 1.4 x 0.093 x 364 = 47.4 lb./min\n\n    8400 gallons x 6.911 lb./gal. = 58,052 lb. PO released\n\n    58,052 lb/47.4 lb./min. = 1225 (20.4) minutes for total evaporation\n\nUse the lookup table (Reference Table 6, p. 29 EPA guidance) to find the distance to the toxic endpoint of 0.40 miles.\n\n\nEPA Technique with Modeling:\n\nThe scenario can be modeled as a ground level gaseous release using the EPA derived release rate of 47.4 lb./minute.  Modeling should be done as a non-isothermal release since there will be energy transfer between the vapor cloud and the atmosphere because of the temperature difference.  This gives a distance "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 17607,
      "SummaryText": "to the toxic endpoint of 0.09 miles.  \n\nClewell Equation Modeling Approach:\n\nThe Clewell Equation allows for the calculation of the evaporation rate of non-boiling liquids on land.  This value can be inserted into the model in lieu of the EPA derived value.\n\nThe Clewell Equation is as follows:\n\n    m = 0.08 x u 0.75 x A x (1 + 0.0043Tp2) x Z\n\n    Where:    m = mass flux rate (evaporation rate)\n            u = wind speed =1.5 m/s\nA = Surface area of spill = diked area = 18.67 x 19.5 = 364 ft2 (33.82 m2)\n            Tp = Ambient Temperature = 25 oC\n            Z = PVB x MWB/PVH x MWH = (60,675 x 58.5)/(1477 x 32)\n            = 75.48\n\n    m = 0.08 x 1.5 0.75 x 33.82 (1 + 0.0043 x 252) x 75.48\n\n        = 0.08 x 1.36 x 33.82 (1 + 2.6875) x 75.48\n\n        = 1020.7 kg/hr = 2245.5 lb./hr = 37.4 lb./min\n\nIf we insert 37.4 lb./min. into the Degadis model we arrive at a distance to the toxic endpoint of 0.08 miles.\n\n\nPure Modeling Approach:\n\nThe Degadis model will calculate the evaporation rate internally and apply it to calculate the distance to the toxic endpoint.  Degadis calculates an evaporation rate of 14.9 lb./min.  Degadis indicates that the toxic endpoint (590 mg/m3) is extends only to 0.05 miles.\n\nSummary:\n\nThe last two methods are the most realistic approaches and both result in distances to the toxic endpoint, which fall within the plant fenceline.  The worst case, therefore, does not affect the public.\n Alternative Case Scenario\n\nPropylene Oxide has a boiling point of 100 oF.  It is stored as a subcooled liquid at about 50 oF.  The tank capacity is 10,500 gallons.  Administrative controls are present which stipulate that the tank contents will not exceed 80% of capacity or 8400 gallons.  The normal storage pressure is 10 - 20 psig.  The most likely alternative scenario would be a broken line from the tank.  There is a 3-inch valve on the tank which immediately reduces to a 2 inch line to the transfer pump.  The discharge from the transfer pump is 1 inch in diameter.\nThe most likely release scenario would occur from a"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 17607,
      "SummaryText": " break in the 2-inch line.  It is likely that this release would occur inside the building which would reduce the release rate of PO.  A deluge system and foam system are also in place which would further mitigate the release.  The presence of these active and passive mitigation devices make calculation of the release rate to the atmosphere difficult.\nThe first step is to determine the quantity of propylene oxide which would be lost in this scenario.  If the pipe ruptured during transfer the release rate can be determined by using the equation of Crowl and Louvar.\n\n    Q = CD x pl x A x (2gc(Ps-Pa)/pl + 2gh)0.5\n\n    Where:    Q = Discharge rate, lb./sec.\n            CD = Discharge coefficient = 0.61\n            pl = density of liquid = 6.911 lb./gal = 51.7 lb./ft3\n            A = Area of discharge 2\" dia. = 0.0218 ft2\n            gc = Acceleration of gravity = 32.2 ft/sec2\n            Ps = Storage pressure = 15 psig = 29.7 psia = 4277 psf\n            Pa = Ambient Pressure = 14.7 psia = 2117 psf\n            h = Liquid head in tank = 10 ft.\n\n    Q = 0.61 x 51.7 x .0218 x (2 x 32.2(4277-2117)/51.7 + 2 x 32.2 x 10)0.05\n\n        = 0.6875(93.07)\n\n        = 64.0 lb./sec\n\n    58,052 lb/64 lb./sec = 907.1 seconds = 15.1 minutes to empty tank\n\nA release of this type would be detected by the sensors monitored by the gas chromatograph at South Starch.  Detection would be nearly immediate and the valve could be closed in less than 5 minutes.  Therefore, the total release would be:\n\n    64.0 lb./sec x 5 min. x 60 sec/min = 19,200 lbs\n\n\nThe release rate for a substance inside of a building is taken to be 5% of the evaporation rate outdoors (EPA Guidance, p. 42).  However, it is assumed that the duration increases so that the entire amount released would eventually enter the atmosphere.  The evaporation rate using EPA techniques is:\n\n    QR = QS x 2.4 x LFA x DF\n\n    Where:    QR = Quantity released to air (evaporation rate), lb./min\n            QS = Quantity released = 19,200 lbs\n            LFA = Liquid Factor Ambient = .093\n            DF = Density Factor = .59\n\n    QR = 19,200 x 2.4 x .093 x .59 = 252"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 17607,
      "SummaryText": "8 lb./min\n\n    QRbuilding = 2528 x 0.05 = 126 lb./min\n\nAssuming that the foam and water spray reduce the evaporation by an additional 50%:\n\n    QRoutside = 126 x 0.5 = 63 lb./min\n\nUsing the look-up table (Reference Table 15, EPA Guidance p. 60) the distance to the toxic endpoint is 0.09 miles.  If the 63 lb./min is input into Degadis a distance of 0.11 miles is calculated.  Both distances are well within the fenceline of the plant.\n\nSummary:  \n\nBoth methods produce similar results and neither distance extends outside of the plant fenceline.  No public receptors are affected\n\nAcrylonitrile\nWorst Case Scenario\n\nAcrylonitrile has a boiling point of 172 oF.  It is stored as a liquid at ambient temperature and pressure.  The worst case scenario would be a tank rupture creating an instantaneous spill of the entire tank contents.  The tank capacity is 12,000 gallons.  Administrative controls are present which stipulate that the tank contents will not exceed 85% of capacity or 10,200 gallons.\n\nEPA technique:\n\nThe evaporation rate is determined from the following equation.\n\n    QR = 1.4 x LFA x A\n\n    Where:    QR = evaporation rate (lb./min)\nLFA = Liquid Factor Ambient = .018 (Exhibit B-2, Appendix B, \n            p. 86 EPA Guidance)\n            A = Area of Dike = 364 ft2\n\n    QR = 1.4 x 0.018 x 364 = 9.17 lb./min\n\n    69,000 lb/9.17 lb./min. = 7522 minutes (5.2 days) for total evaporation\n\nUse the lookup table (Reference Table 6, p. 29 EPA guidance) to find the distance to the toxic endpoint of 0.59 miles.\n\nEPA Technique with Modeling:\n\nThe scenario can be modeled as a ground level gaseous release using the EPA derived release rate of 9.17 lb./minute.  This is a very slow evaporative process at nearly constant temperature so the release can be considered continuous.  The modeling should be done as an isothermal process indicating no transfer of energy from the vapor to the surrounding atmosphere.  This gives a distance to the toxic endpoint of 0.19 miles.  EPA allows the use of administrative controls and passi"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 17607,
      "SummaryText": "ve mitigation techniques when determining the worst case impact.\n\nClewell Equation Modeling Approach:\n\nThe Clewell Equation allows for the calculation of the evaporation rate of non-boiling liquids on land.  This value can be inserted into the model in lieu of the EPA derived value.\n\nThe Clewell Equation is as follows:\n\n    m = 0.08 x u 0.75 x A x (1 + 0.0043Tp2) x Z\n\n    Where:    m = mass flux rate (evaporation rate)\n            u = wind speed =1.5 m/s\nA = Surface area of spill = diked area = 18.67 x 19.5 = 364 ft2 (33.82 m2)\n            Tp = Ambient Temperature = 25 oC\n            Z = PVB x MWB/PVH x MWH = (11,446 x 53.06)/(1477 x 32)\n            = 12.85\n\n    m = 0.08 x 1.5 0.75 x 40 (1 + 0.0043 x 252) x 12.85\n\n        = 0.08 x 1.36 x 40 (1 + 2.6875) x 12.85\n\n        = 206.2 kg/hr = 453.7 lb./hr = 7.56 lb./min\nNote that this evaporation rate (7.56 lb./min) is similar to the value derived from EPA guidance.  If we insert 7.56 lb./min. into the Degadis model we arrive at a distance to the toxic endpoint of 0.17 miles.\n\nPure Modeling Approach:\n\nThe Degadis model will calculate the evaporation rate internally and apply it to calculate the distance to the toxic endpoint.  Degadis indicates that the toxic endpoint (76 mg/m3) is reached out to a distance of 0.16 miles.  This is in agreement with the previous two techniques.\n\nSummary:\n\nThe last two methods are the most realistic approaches.  Both result in the toxic endpoint being reached at 0.16 - 0.17 miles.  This is within the plant property line and no public receptors are affected. \n\nAlternative Case Scenario\n\nAcrylonitrile has a boiling point of 172 oF.  It is stored as a liquid at ambient temperature and pressure.  Administrative controls are present which stipulate that the tank contents will not exceed 85% of capacity or 10,200 gallons.  There is a 3-inch valve on the tank which immediately reduces to a 2 inch line to the transfer pump.  The most likely release scenario would occur from a break in the 2-inch line.  It is likely that this release could occur outside"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 17607,
      "SummaryText": " the building.  A system of dikes would contain the spill to reduce spreading of the pool.  A deluge system and foam system are in place which would mitigate the release.  The presence of these active mitigation devices make calculation of the release rate to the atmosphere difficult.\nThe first step is to determine the quantity of acrylonitrile which would be lost in this scenario.  If the pipe ruptured during transfer the release rate can be determined by using the equation of Crowl and Louvar.\n\n    Q = CD x pl x A x (2gc(Ps-Pa)/pl + 2gh)0.5\n\n    Where:    Q = Discharge rate, lb./sec.\n            CD = Discharge coefficient = 0.61\n            pl = density of liquid = 6.83 lb./gal = 51.1 lb./ft3\n            A = Area of discharge 2\" dia. = 0.0218 ft2\n            gc = Acceleration of gravity = 32.2 ft/sec2\n            Ps = Storage pressure = 1\" w.c. = 2121 psf\n            Pa = Ambient Pressure = 14.7 psia = 2117 psf\n            h = Liquid head in tank = 10 ft.\n\n    Q = 0.61 x 51.7 x .0218 x (2 x 32.2(2121-2117)/51.1 + 2 x 32.2 x 10)0.05\n\n        = 0.6875(25.48)\n\n        = 17.5 lb./sec\n\n    58,052 lb/17.5 lb./sec = 3943 seconds = 65.7 minutes to empty tank\n\nA release of this type would be detected by the sensors monitored by the gas chromatograph at MEG/CoPo.  Detection would be nearly immediate and the valve could be closed in less than 5 minutes.  Therefore, the total release would be:\n\n    17.5 lb./sec x 5 min. x 60 sec/min = 5250 lbs\n\n    \nThe evaporation rate using the EPA techniques is:\n\n    QR = 2.4 x LFA x A\n\n    Where:      QR = Quantity released to air (evaporation rate), lb./min\n              LFA = Liquid Factor Ambient = 0.018\n            A = Area of Dike = 600 ft2 (sum of diked areas)\n\n    QR = 2.4 x 0.018 x 600 = 25.9 lb./min\n\nThe deluge/foam system would reduce this emission rate in half to 13.0 lb./min.  Using the EPA look-up tables (Reference Table 15, EPA Guidance, p. 60) the distance to the toxic endpoint is 0.13 miles.  \n\nClewell Equation Modeling Approach:\n\nThe Clewell Equation is appropriate for the calculation of the evaporation rate of non-boiling liquids on land."
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 17607,
      "SummaryText": "  This value can be used in the EPA look-up tables or inserted into the model in lieu of the EPA derived value.\n\nThe Clewell Equation is as follows:\n\n    m = 0.08 x u 0.75 x A x (1 + 0.0043Tp2) x Z\n\n    Where:    m = mass flux rate (evaporation rate)\n            u = wind speed = 3.0 m/s\n            A = Surface area of spill (1 cm deep) = 600 ft2 = 55.8 m2\n             Tp = Ambient Temperature = 25 oC\n            Z = PVB x MWB/PVH x MWH = (11,446 x 53.06)/(1477 x 32)\n            = 12.85\n\n    m = 0.08 x 3.00.75 x 55.8 (1 + 0.0043 x 252) x 12.85\n\n        = 0.08 x 2.28 x 55.8 (1 + 2.6875) x 12.85\n\n        = 482.2 kg/hr = 1060.8 lb./hr = 17.7 lb./min\n\nIf the deluge/foam system reduces evaporation by 50% then the emissions would be 8.8 lb./min.  Using the look-up table (Reference Table 15, EPA Guidance, p. 60) the distance to the toxic endpoint is 0.10 miles.  If this value is inserted into Degadis using the gas release mode and an isothermal release a distance to the toxic endpoint of 0.09 miles is the result.  \nThe liquid spill mode gives an evaporation rate of 9.8 lb./min (4.9 lb./min when the foam is applied).  This also gives a distance to the endpoint of 0.08 miles.\n\nSummary:  \n\nBoth methods produce similar results and neither distance extends beyond the plant boundaries.  No public receptors are affected.\n"
    }
  ]
}