{
  "FacilityID": 17770,
  "FacilityName": "Whites Creek Wastewater Treatment Plant",
  "FacilityStr1": "1360 County Hospital Road",
  "FacilityStr2": null,
  "FacilityCity": "Nashville",
  "FacilityState": "TN",
  "FacilityZipCode": "37218",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47037",
  "LEPC": "Davidson County LEPC",
  "FacilityLatDecDegs": "36.181389",
  "FacilityLongDecDegs": "-86.856667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": "www.nashville.org/ws/",
  "FacilityEmailAddress": "jay.tant@nashville.gov",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Metro Water and Sewer Department",
  "Company2Name": null,
  "CompanyDUNS": 605166941,
  "Company2DUNS": 605166941,
  "OperatorName": "Metro Department of Water Services",
  "OperatorStr1": "1360 County Hospital Road",
  "OperatorStr2": null,
  "OperatorCity": "Nashville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37218",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jay Tant",
  "RMPTitle": "Operations Engineer",
  "FTE": 18,
  "OtherEPAFacilityID": "TN0024970",
  "EPAFacilityID": "100000081458",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "none",
  "SafetyInspectionDate": "1993-11-19 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-12-27 00:00:00",
  "DeRegistrationEffectiveDate": "2012-11-14 00:00:00",
  "AnniversaryDate": "2004-09-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.18056,
  "FRS_Long": -86.85667,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25058,
      "AltID": "Disinfection",
      "FacilityID": 17770,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25699,
          "ProcessID": 25058,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 32306,
          "ProcessID": 25058,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 532306,
          "ProcessID": 25058,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17770,
      "SummaryText": "Executive Summary of Risk Management Plan\nWhites Creek Wastewater Treatment Plant\n\n\n\n1.  The city of Nashville's Department of Water and Sewerage Services (Metro Water Services) Risk Management Plan is a combination of technology, procedures, training and management.  Each element of the U.S. Environmental Protection Agency Risk Management program is addressed.  The approach is to prepare a plan tailored for each facility to increase knowledge, prevent accidents, and to respond to emergencies.\n\n2.  The Whites Creek Wastewater Treatment Plant has been in existence in its current location almost twenty-five (25) years.  The plant is currently designed to treat 37.5 million gallons of wastewater each day.  The maximum capacity is 47.5 MGD and the peak capacity is 75 MGD.  These capacities are the result of a major expansion completed in 1991. The facility is located in the west section of Nashville and encompasses approximately 95 acres.  The purpose is to treat the sewage from the west and north sections of the city.  The water received at the plant as sewage is treated to remove the contaminants by a multi-step process known as activated sludge treatment.  The material removed from the water is called sludge or biosolids.  Each month the plant removes approximately 600 dry tons of biosolids, which is pumped to the Central Wastewater Treatment Plant for disposal.   The clean, clear water is then returned to the Cumberland River.  The final phase of treatment is chlorination, to disinfect the water.  The water usually has a chlorine residual of .9 mg/l leaving the plant.  The chlorine facility includes piping, valves, pressure gauges, evaporators, and chlorinators. Chlorine is hazardous because it is a respiratory irritant when inhaled.  Liquid chlorine is stored and used from one ton cylinders.  The maximum quantity of chlorine on site is ten (10) cylinders. The amount of chemical used varies with the plant flow and its characteristics.  The quantity used is normally "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17770,
      "SummaryText": "in the range of 500 pounds per day.  The chlorine facility is normally unmanned, however; it is monitored remotely from the plant control room.  The plant is manned 24 hours a day, seven days a week and the operators visit the chlorine site at various times during the day.  Various types of safety equipment, alarms,  and sensors, are in place at this facility.     \n\n3.  Off site consequence analysis has been completed for each chemical.  Both the worse case and alternative release scenarios have been calculated using three different methods.  Manual calculations, TVA air models, and RMP comp were all used and each method obtained virtually the same results. The calculations used are from TVA.  The off site consequence analysis has been submitted to the EPA and to our Local Emergency Planning Committee (LEPC).  These details may be obtained in the Department of Metro Water Services.\n   \n\n4.   The accident release prevention program for the Whites Creek Wastewater Treatment Plant includes the following:\n\n7    Extensive operator training.\n7 Preventive Maintenance Program for the chlorine equipment.\n7 Use of state of the art process and safety equipment.\n7 Use of specific operating procedures written and reviewed by plant personnel.\n7 Scheduled performance reviews for hazards in the procedures and equipment.\n7 Implementation of a compliance inspection program.\n \n Presently, specific accident prevention measures include the following:\n \n7 The chlorine equipment is in the same building as the control room.\n7 Electronic leak detectors are in place, which provide audible and visual alarms in the event of a chlorine leak. Chlorine flow stops if a leak develops in a vacuum line.                                                                                                                                                                                              \n7 Breathing air tanks and self-contained breathing apparatus (SCBA) are available in the event of leaks and for "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17770,
      "SummaryText": "personnel protection during connection/disconnection.\n7 Leak repair \"B\" kits are available in the plant.\n7 The building is marked with universal fire code hazard symbols.\n\n5.  No off site accidental releases have occurred at this plant in the last five (5) years.\n\n6.  The plant has an emergency response plan and the Nashville Fire Department is aware \nof the possible hazards.  Metro Water Services and the Nashville Fire Department are members of the Local Emergency Response Planning Committee (LEPC).  The program includes a response decision flow chart and a notification plan.  Plant personnel respond to and repair minor leaks and the Fire Department is called in the event of a significant accident. \n\n7.  Future plans include a more extensive training program for the plant staff beginning September 1999.  New safety systems will be installed as current technology is surpassed. One important safety feature being considered for this plant is the installation of automatic shut off valves for the chlorine cylinders."
    }
  ]
}