{
  "FacilityID": 17793,
  "FacilityName": "Cacique, Inc.",
  "FacilityStr1": "14940 Proctor Ave.",
  "FacilityStr2": null,
  "FacilityCity": "City of Industry",
  "FacilityState": "CA",
  "FacilityZipCode": "91746",
  "Facility4DigitZipExt": "3219",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.0275",
  "FacilityLongDecDegs": "-117.971944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 70936554,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gilbert de Cardenas",
  "OperatorStr1": "P.O. Box 91330",
  "OperatorStr2": null,
  "OperatorCity": "City of Industry",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91715",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gilbert de Cardenas",
  "RMPTitle": "Owner",
  "FTE": 215,
  "OtherEPAFacilityID": "019999003297",
  "EPAFacilityID": "100000057626",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-09-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.02816,
  "FRS_Long": -117.97154,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25089,
      "AltID": "Cheese Manufacturer",
      "FacilityID": 17793,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25733,
          "ProcessID": 25089,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 32338,
          "ProcessID": 25089,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 532338,
          "ProcessID": 25089,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17793,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nCacique, Inc. facility has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the RMPP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe Plan provides the response organization and notification procedures, evacuation assembly areas, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Cacique facility was initially built in 1961 and was designed and constructed in accordance with all applicable federal, state, and local regulations.  The facility is located at 14940 Proctor Ave., City of Industry, CA 91746 and began operation in 1985.\n\nThe area immediately surrounding the facility is largely industrial complexes with some residential areas.  The facility covers approximately 4 acres and is situated approximately 1.5 miles north of State Highway 60, and 0.25 miles south of Valley Boulevard.\n\nThe ammonia refrigeration system uses 19,000 pounds of ammonia within a closed system for the purpose of manufacturing cheese products.  The entire charge of ammonia can be held within the High Pressure Receiver.  The system cycles ammonia through various physical states in order to provide cooling in the cheese production processes and cold storage rooms.  The facility remains one of the most sophisticated cheese manufacturing facilities in the world.\n\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\nScenario Description: Release of the maximum quantity of ammonia that can be stored in a vessel - 19,000 pounds in 10 minutes.  The release rate was calculated to be 1,900 poun"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17793,
      "SummaryText": "ds per minute.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  The reference table, Exhibit 4-4, from the EPA's Risk Management Program Guidance for Ammonia Refrigeration was used to determine the distance to the toxic endpoint of 200 ppm for a release of 2,000 pounds per minute.  This release reaches offsite and may affect public receptors.  No environmental receptors were affected by this potential release.\n\nAlternative Release Result Summary\nScenario Description: A release of ammonia gas from a 1/4 inch diameter leak.  The release rate of ammonia due to the pressure of the tank is 126 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability. The reference table, Exhibit 4-5, from the EPA's Risk Management Program Guidance for Ammonia Refrigeration was used to determine the distance to the toxic endpoint of 200 ppm for a release of 150 pounds per minute.  This release reaches offsite and may affect public receptors.  No environmental receptors were affected by this potential release.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe facility is equipped with an two manual shut off buttons which shuts down compressors and closes the solenoid king valve.  If a release were to occur, operators can activate this prevention measure.  The facility is staffed 24 hours a day and at least one maintenance personnel is on site 24 hours a day.  The majority of the ammonia equipment is located next to the parts room where a release can be detected. \n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere is no accident history at this facility within the past five years (October 1994 to October 1999).\n\n\nEMERGENCY RESPONSE PROGRAM\n\nCacique has an emergency response plan in effect at the facility.  If a release of ammonia were to occur, Cacique will determine the extent of the emergency.  They will actuate the alarm and determine if an evacuation is necessa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17793,
      "SummaryText": "ry.  They will call 911 in order to reach the Los Angeles County Fire Department HazMat team who will respond to the ammonia release.  \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nBelow is a summary of the recommendations resulting from the most recent Process Hazard Analysis study (including a HAZOP study and What-If Walkthrough) performed on August 10, 1999 at Cacique.  Cacique would like to note that the estimated implementation date for performing these recommendations is August 2000 unless otherwise noted:\n\nR01  Consider the feasibility of installing an emergency solenoid king valve shut down switch next to the ammonia plant emergency shut down switch which is located inside the building prior to entering the machine room.  \n\nR02  Consider the feasibility of venting the outlet of the fire control box to a water dilution tank per 1994 Uniform Mechanical Code.  Note that this also requires facilities to pipe the pressure relief valve discharge to the water dilution tank (1994 Uniform Mechanical Code, Section 1119).\n\nR03  Include in the Mechanical Integrity section to manually exercise the 3-way valve on the dual relief valve assemblies annually in order to ensure that they are sliding properly.  Cacique would like to note that this recommendation is complete.\n\nR04  Include in the Mechanical Integrity section to inspect the High Pressure Receiver annually for rust and repair/paint as necessary.  Cacique would like to note that this recommendation is complete.\n\nR05  Include an oil draining procedure in the Operating Procedure section.  Cacique would like to note that this recommendation is complete.\n\nR06  Install a warning tag on the isolation valve warning operator to purge the transfer tank before closing the valve downstream of the check valve.  Cacique would like to note that the estimated implementation date for this recommendation is December 1999.\n\nR07  Consider having a high level shut down for the machine room as per the Uniform Mechanical Code 1994, Section 1120"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 17793,
      "SummaryText": ".1.\n\nR08  Include in the Mechanical Integrity section to annually check/test the high level switches  on the suction accumulators to ensure the high level switch is operable.  Cacique would like to note that this recommendation is complete.\n\nR09  Include in the Emergency Response Training program to inform all employees that: 1) ammonia is at the facility; 2) how to report an emergency if they smell ammonia; and 3) where to go in an emergency (evacuation).  Cacique would like to note that this recommendation is in progress.\n\nR10  Consider feasibility of installing an eyewash/shower on the roof.\n\nR11  Have operator give an estimated time of return and check-in with someone when performing maintenance on the roof.  Cacique would like to note that this recommendation is in progress.\n\nR12  Obtain a hand held ammonia detector for inspecting/repairing a leak or checking an alarm.  Proper calibration and documentation showing such must also be performed and maintained.  Cacique would like to note that this recommendation is in progress.\n\nR13  Develop an evacuation assembly area and include this in the Emergency Response Section of the PSM/RMP.  Cacique would like to note that this recommendation is complete.\n\nR14  Set the ammonia detector in the machine room to alarm in order to notify maintenance of a leak and consider recommendation R07.\n\nR15  Include in the Mechanical Integrity section to test/calibrate the ammonia sensors as recommended by the manufacturer.  Cacique would like to note that this recommendation is in progress.\n\nR16  Include in the Mechanical Integrity section to record the amount of oil that is put into the compressor.  Cacique would like to note that this recommendation is complete.\n\nR17  Include in the Operating Procedure section, a written procedure for manually purging non condensibles from the condenser to a bucket of water.  Cacique would like to note that this recommendation is in progress.\n\nR18  Consider purchasing an auto purger for the condense"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 17793,
      "SummaryText": "r, especially if the ammonia refrigeration system will be expanded in the future.\n\nR19  Incorporate a lockout/tagout plan when cleaning the inside of the condenser.  Cacique would like to note that this recommendation is complete.\n\nR20  Label each line (valves) inside the fire control box identifying the vessel that would be relieved.\n\nR21  Install an NFPA Hazard Communication Label outside the machine room doors and on the High Pressure Receiver, Condenser, Ice Bank, Silo surge tanks, and Evaporators.  Cacique would like to note that this recommendation is in progress.\n\nR22  Consider the feasibility of installing a visual/audible alarm outside the machine room outside of the building in order to warn maintenance of a potential leak.  Cacique would like to note that the estimated implementation date for this recommendation is December 1999.\n\nR23  Train operators for each shift the circumstances of when to shut down the solenoid king valve and document that the training was given.\n\nR24  Identify oil valves on those vessels where oil draining occurs.  Cacique would like to note that the estimated implementation date for this recommendation is December 1999.\n\nR25  Install a wind sock so that it is visible from the street and evacuation assembly areas for all shifts.  Cacique would like to note that the estimated implementation date for this recommendation is December 1999.\n\nR26  Revise the Emergency Response Plan such that the evacuation assembly area is not located near the machine room.  Consider employees sheltering-in-place.  Cacique would like to note that this recommendation is complete.\n\nR27  Perform an annual evacuation drill for each shift at the facility.  Cacique would like to note that this recommendation is complete and on-going."
    }
  ]
}