{
  "FacilityID": 17825,
  "FacilityName": "Commerce  Water Treatment Plant",
  "FacilityStr1": "265 Water Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Commerce",
  "FacilityState": "GA",
  "FacilityZipCode": "30529",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13011",
  "LEPC": "None",
  "FacilityLatDecDegs": "34.261944",
  "FacilityLongDecDegs": "-83.489722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Commerce",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Commerce",
  "OperatorStr1": "P.O. Box 348",
  "OperatorStr2": null,
  "OperatorCity": "Commerce",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30529",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry McLocklin",
  "RMPTitle": "Water Plant Superintendent",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151355",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.26194,
  "FRS_Long": -83.48972,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25140,
      "AltID": null,
      "FacilityID": 17825,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 25786,
          "ProcessID": 25140,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 32411,
          "ProcessID": 25140,
          "ChemicalID": 62,
          "Quantity": 6450.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 532411,
          "ProcessID": 25140,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 17825,
      "SummaryText": "The Risk Management Program for the Commerce Water Treatment Plant minimizes the likelihood and potential effects of a chemical accident involving chlorine by identifying and reducing potential hazards as well as preparing employees and responders to handle a chemical emergency.  This is accomplished by establishing a program in accordance with the EPA's requirements outlined in 40 CFR Part 68 providing for employee and public safety\n\nThe importance dedicated to the safe operation of the Commerce plant is reflected in its record of no reportable releases or accidents involving chlorine over the past 5 years.  The continued safety to the plant's employees and the surrounding community will be further ensured through the implementation of the Risk Management Program.\n\nThe Commerce WTP, located on Water Plant Road, north of Commerce, Georgia, uses chlorine to disinfect raw water as part of the treatment process necessary to provide drinking water for the Commerce area.  The plant stores as much as 6,450 lbs. of liquefied chlorine under pressure in containers holding 2,000 lbs. and cylinders of 150 lbs.  The chlorination process involves a system where chlorine gas is piped from these containers and then controlled and metered until being applied to the raw water creating a chlorine solution.\n\nAtmospheric dispersion modeling was conducted, using software provided by the EPA for this purpose called RMP*Comp, to assess the potential off-site area at risk given an accidental release of chlorine from the plant were to occur.  A worst-case scenario was first considered involving an unlikely event in which the entire contents of a single container, 2,000 lbs., escaped over a ten-minute period.  An alternate-case scenario was then conducted to assess a potential accident thought to be more likely to occur than the worst-case.  This situation assumed chlorine was released at a rate of 10.5 lbs./sec. for 60 minutes consistent with what would be expected from a leak involving a f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 17825,
      "SummaryText": "aulty valve or bad connection.   In each case, the modeling was performed to determine the distance a chlorine cloud could possibly reach before dissipating to an acceptable level, called the toxic endpoint, at which it is believed that an individual can be exposed for up to an hour without experiencing significant effects.\n\nThe worst-case scenario resulted in an endpoint distance of 3.0 miles.  Within this radial distance from the plant there live an estimated population of 1,560 people which could potentially be effected.  The alternate- case was calculated to reach no more than 0.2 miles effecting approximately 13 people. \n\nFor each of these scenarios it is important to point out that the modeling results are intended to serve as a simplified guide in establishing the entire area surrounding the plant at risk in the event of a chlorine release. The actual behavior of a chlorine cloud will depend to a large degree on the local topography since chlorine gas is 2.5 times as heavy as air.  The toxic cloud will be more likely to flow downhill than to have its path determined by prevailing winds. Furthermore, no mitigation measures such as enclosures and the abundance of trees in the area, which would each hinder the advance of a toxic cloud, were considered when inputting information into the models.\n\nTo lessen the likelihood and mitigate the effects of a potential release of chlorine, the Commerce  WTP's Risk Management Program provides a means for ensuring that the plant operators' preparedness is improved in the following important areas:\n\n1.  Chlorine hazard and safety\n2.  Operating procedures for safely operating the chlorine system\n3.  Operator training on operating procedures and emergency response\n4.  Preventive maintenance\n5.  Emergency action and emergency response\n\nTo ensure that an emergency situation is handled effectively, this RMP includes an Emergency Action Plan (EAP) and an Emergency Response Plan (ERP).  The EAP details appropriate procedures for th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 17825,
      "SummaryText": "e plant operators to follow in responding to a chlorine accident including stopping a leak and contacting emergency personnel.  The ERP, which will be included in the community emergency response plan, provides local emergency responders with information necessary to sufficiently understand the hazards a potential escaping chlorine cloud poses to the community and to properly respond to an accident at the plant.  The ERP includes a prediction of the most likely path a toxic cloud may take based on the local topography.  \n\nEffective emergency action and response is ensured through ongoing training of emergency response procedures.  Plant operators are trained on chlorine hazards, stopping chlorine leaks, and emergency procedures and equipment.  \n\nTo further improve safety at this facility the plant has recently installed electronic air monitoring equipment to ensure that, if a leak were to occur, personnel will respond and correct it as quickly as possible.\n\nThis Risk Management Program is designed so that each element may be easily implemented and maintained ensuring that potential hazards are closely monitored, operators stay sufficiently trained, and an emergency will be handled as efficiently as possible.  This will assure that the Commerce Water Treatment Plant will continue the safe operation of its chlorination process while providing quality drinking water for the surrounding region."
    }
  ]
}