{
  "FacilityID": 1797,
  "FacilityName": "InterCities Cold Storage",
  "FacilityStr1": "1075 Oak Street",
  "FacilityStr2": null,
  "FacilityCity": "Pittston",
  "FacilityState": "PA",
  "FacilityZipCode": "18640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42079",
  "LEPC": "Luzerne County LEPC",
  "FacilityLatDecDegs": "41.308333",
  "FacilityLongDecDegs": "-75.775",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "James Brown Sr.",
  "OperatorStr1": "1075 Oak Street",
  "OperatorStr2": null,
  "OperatorCity": "Pittston",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18640",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Brown Jr.",
  "RMPTitle": "Vice President",
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000021932",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-17 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 41.30786,
  "FRS_Long": -75.77055,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1963,
      "AltID": "refrigeration",
      "FacilityID": 1797,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2001,
          "ProcessID": 1963,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2099,
          "ProcessID": 1963,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502099,
          "ProcessID": 1963,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1797,
      "SummaryText": "InterCities Cold Storage, Inc. is located at 1075 Oak Street, in Pittston, Luzerne County, Pennsylvania.  The facility provides commercial cold storage warehousing for industry.  Products housed in cold storage at the facility consist of various types of perishable foods.  These products are temporarily stored and then removed from the facility by commercial trucks.  Forklifts are used to load and unload the trucks.  Currently, sixteen storage freezers are used at the facility for cold storage.  Of these sixteen freezers, three are chilled with freon and thirteen are chilled with anhydrous ammonia.\n\nThe building covers approximately 130,000 square feet.  The three freon chilled freezers have two compressors that circulate freon to air units inside the freezers.  Freon is circulated through pipes that are located along the interior walls and ceilings of the freezers.  Approximately 500 pounds of Freon are stored and circulated between the two compressors.\n\nThe thirteen anhydrous ammonia freezers receive ammonia from a mechanical room located along the west side of the building.  Inside this room is an ammonia cylinder that contains approximately 15,000 pounds of ammonia.  Compressors located in this room circulate ammonia to air units inside the frezzers.  The mechanical room also houses controls for freezer operations that includes a computerized control progam (MYSTIC) networked with Triple A Security Systems to detect leaks and notify facility personnel.  The piping that transfers ammonia to air units runs along the outside roof of the building and connects into the air units located inside the freezers.  Ammonia gas recirculates from the air units through three condensers, which is then recycled back into the system.  The condensers are located on the roof of the mechanical room.\n\nACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES\n\nAreas where ammona spills and leaks may occur would include the mechanical room, (where bulk ammonia is stored), air circulation unit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1797,
      "SummaryText": "s and piping.  With the bulk of ammonia stored in this room, a large scale release of gas or liquid would be possible here.  A ventilation fan in the mechanical room is present to vent ammonia gas out of the building if a large scale release occured.  Venting would prevent a dangerous concentration of ammonia gas from accumulating in this room.  This fan is automatically controlled by the computer control system (MYSTIC) which is Y2K compliant, or can be manually operated.  The piping runs along the top of the building and enters air circulators through the roof.  An ammonia gas or liquid release would most likely occur from piping and air circulators.\n\nThe computer control system conducts constant monitoring of the ammonia cooling system and provides automatic emergency action by shutting down all or parts of the freezers if a release occurs.  This automatic shutdown would not apply to a catastrophic release in the mechanical room\n\nIn the event of a release, plant personnel are not trained to handle an ammonia release.  The plant employees will be evacuated to a predetermined point outside the building, depending on wind direction.  InterCities has hired an outside contractor, Datom Products, Inc., to handle any releases or spills that may occur on the property.\n\nWORST CASE SCENARIO AND ALTERNATE RELEASE SCENARIO\nThe worst case scenario at the facility would be a ruptured pressure vessel or tank releasing the entire charge of ammonia.  The ALOHA mapping program indicates an area 1.7 miles surrounding the plant would be affected.  There are numerous safety features and backup systems to prevent this from happening such as relief valves, and the Mystic Computer system which would shut the system down when pressure starts to build.  For the alternate case scenario, a pipe failure was chosen.  The piping is located on the roof of the building and the affected area outside the plant for a 7,000 pound release over 1 hour would be 0.2 miles.  If a pipe failed, the pipe wo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1797,
      "SummaryText": "uld be isolated by the computer system or by manually closing valves.  The major causes of a pipe failure would be due to corrosion or damage by a forklift.  To prevent these from happening, a contractor inspects the entire system monthly and there are forklift guards in place in the building where the piping may be accidently hit.\n\nInterCities has not had an ammonia release in the history of the plant.  The facility complies with all Federal, State and Local regulations.  These regulations include OSHA  29 CFR 1910.38 and State EPCRA Laws.\n\nEMERGENCY RESPONSE PROGRAM\nInterCities plant personnel are trained to evacuate the building in case of a release.  The facility personnel are not trained to handle ammonia releases.  InterCities has hired, Datom Products, Inc.of Dunmore Pa.,  a certified Pennsylvania Emergency Management Agency Hazardous Materials Team to respond for any emergencies at the plant.  The release should be able to be controlled by the computer system from any modem computer off site.  If this is not possible, Datom would patch the leak any way possible.  Notification to the public of any danger would be handled through the Luzerne County Emergency Management Office.\n\nInterCities coordinates the emergency response plan through Luzerne County Emergency Management Agency.  Drills are conducted annually for plant personnel to review emergency procedures and a drill is scheduled for the summer of 1999 with Luzerne County EMA, Pittston Twp. Police, Fire, EMS, PADEP, and Datom."
    }
  ]
}