{
  "FacilityID": 18021,
  "FacilityName": "Water Treatment Plant",
  "FacilityStr1": "Water Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Port St. Joe",
  "FacilityState": "FL",
  "FacilityZipCode": "32457",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12045",
  "LEPC": "Gulf County Emerg Manag Agency",
  "FacilityLatDecDegs": "29.829333",
  "FacilityLongDecDegs": "-85.300139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 91657932,
  "ParentCompanyName": "The City of Port St. Joe",
  "Company2Name": null,
  "CompanyDUNS": 91657932,
  "Company2DUNS": 0,
  "OperatorName": "The City of Port St. Joe",
  "OperatorStr1": "Po Box 278",
  "OperatorStr2": null,
  "OperatorCity": "Port St. Joe",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32457",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000067134",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-05-24 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-07-30 00:00:00",
  "DeRegistrationEffectiveDate": "2010-06-18 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.82239,
  "FRS_Long": -85.30931,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25460,
      "AltID": "PotableWater Chlorination",
      "FacilityID": 18021,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 33177,
          "ProcessID": 25460,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26116,
          "ProcessID": 25460,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 9728,
              "Process_NAICS_ID": 26116,
              "SafetyReviewDate": "1998-12-17 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1999-01-02 00:00:00",
              "ChangeCompletionDate": "1999-01-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-02 00:00:00",
              "TrainingReviewDate": "1998-12-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "12/17/19",
              "MaintenanceReviewDate": "1999-12-17 00:00:00",
              "EquipmentInspectionDate": "1999-12-17 00:00:00",
              "EquipmentTested": "Entire Chlorine Injection Process",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-12-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "PREVENTION PROGRAM\nProcess safety information  There is an up to date copy of the MSDS for CHLORINE. The MSDS is for use by employees who use or maintain the CHLORINE system. There are no known materials in the process area that will react dangerously with chlorine.  \nA Process Hazard Analysis (What-If) was conducted and the results indicated a few concerns and all were addressed. One ton CHLORINE cylinders are designed for safe operating at normal extremes in ambient temperature. Thus with out an additional heat source ton CHLORINE cylinders are safe in this usage. All usage of CHLORINE in this process is gaseous. The feed rate is controlled based on the need to maintain a CHLORINE residual concentration. The lines and injectors are sized to take the full flow from the cylinders valves  Ton CHLORINE cylinders have fusible plugs designed to melt at 158 to 165 F to prevent over pressuring from a temperature rise which prevents a tank rupture.  \nWritten operating procedures for the RMP covered CHLORINE systems are maintained on the site and copies are provided each employee during their training.  These procedures address the hazards of CHLORINE and how to safely complete the task and adress the following: Normal operations, Normal shutdown, Initial startup, Temporary operations, Emergency shutdown,  Emergency operations, Startup after an emergency shutdown, Startup after a normal shutdown, Startup after a change to the CHLORINE, Consequences of a deviation and steps too correct or avoid the deviation, Equipment inspections There is a written procedure for ensuring that operating procedures are up-to-date and any changes that are necessary are made. \nEach employee operating or maintaining the CHLORINE system has had training in the safety requirements of working with CHLORINE. Refresher training shall be conducted as often as necessary to insure employees are operating or maintaining the system according to current procedures and are adhering to the current procedures. The refresher training will include safety and the hazards of CHLORINE and avoidance of unsafe conditions.  Refresher training will be provided at least every three years.  Written procedures are maintained for insuring the ongoing maintenance of the integrity of the CHLORINE system equipment. There is a training program for each employee involved in maintaining the ongoing integrity of the CHLORINE system equipment to insure that each employee can do the job in a safe manner.  Visual inspection are conducted every two hours by operating personnel to observe the process, to check and adjust flow of CHLORINE to control the residual concentration, check inventory, and to report any problems seen. \nBefore a contractor is allowed to work on (including delivery of cylinders) the CHLORINE system they must submit evidence that their employees are trained and qualified to conduct the required work and do it safely. \nAny incident that did or could have resulted in a catastrophic release of CHLORINE will be investigated. Use will be made of an Incident Investigation Form. This form and its proper use will be a part of the safety training each employee involved in handling CHLORINE will receive. An incident investigation team composed of (at a minimum) the employee and their supervisor will be formed and their investigation will start within 48 hours of the incident. The facility procedures establish that prompt addressing and resolving the incident investigation teams findings and recommendations is a requirement. \nOnce every three years an audit of the entire RMP system will be conducted.",
              "_chemicals": [
                {
                  "PrimaryKey": 10192,
                  "PreventionProgram2ID": 9728,
                  "ProcessChemicalID": 33177
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18021,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-01-02 00:00:00",
    "ERTrainingDate": "1999-01-02 00:00:00",
    "CoordinatingAgencyName": "Port St. Joe Fire Department",
    "CoordinatingAgencyPhone": "8502292770",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18021,
      "SummaryText": "EXECUTIVE SUMMARY\nCITY of PORT St. JOE\nWATER TREATMENT PLANT\n\nPolicy\nIt is the policy of the City of Port St. Joe's Water Treatment Plant (WTP) to conduct its business to insure the likelihood of a release of chlorine is minimized and if there is a release the offsite consequence will be reduced. To accomplish this the chlorine ton cylinders, pipe lines, fittings, and injectors are maintained according to good engineering and maintenance practices, DOT regulations and using only parts, equipment and procedures that conform to Chlorine Institute's specifications.  Our operating and maintenance employees utilizing the chlorine system are trained annually in the requirements of chlorine safety.\n\nDescription of Industrial Wastewater Treatment Plant operation\nThe City of Port St. Joe operates a 2 mgd ground and surface water treatment plant. The WTP utilizes the following processes, lime softening, aeration, stabilization and chlorination after the treatment plant. Raw water for the treatment plant is obtained from two wells and a fresh water canal.\n\nDescription of chlorine system\nThe chlorine system consists of ton cylinders connected through an injector into the force main feeding the chlorine contact system. Chlorine feed rate is based on the need to maintain a residual chlorine concentration through out the potable water distribution system. Chlorine is withdrawn from the cylinder by vacuum through Wallace & Tiernan V-75 Chlorinator and no external vaporizer is used in the process. \n\nRMP requirements at the facility\nA review of all the materials used at the WTP has determined that chlorine is the only substance at or above a threshold quantity of an RMP regulated substance. The quantity of chlorine is enough to have a worst-case release scenario offsite impact thus a Program 2 level RMP has been developed.\n\nWorst-case release scenario\nThe maximum quantity of chlorine that will be in the largest container on site at any one time will be 2,000 pounds. This is a single "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18021,
      "SummaryText": "one ton cylinder. The maximum quantity of chlorine that will be released in a worst-case scenario is 2,000 pounds at a release rate of 200 pounds per minute. A worst-case release of any one cylinder will not cause an effect on the other cylinders. This will result in a distance to the endpoint is 3.0 miles using the Model Aloha 5.2.1\n\nAdministrative controls\nThere are no administrative controls on chlorine inventory in use at the facility that will effect the worst-case release scenario.\n\nPassive controls\nThere are no passive control measures in place at the facility.\n\nAlternative release scenario\nA cylinder is in service with a regulator in place. The regulator is hit causing the regulator to break off. This will result in a leak equal to the maximum withdrawal rate from the cylinder. Release quantity of chlorine will be 23.4 pounds or 0.39 pounds / minute and last for 60 minutes. The distance to the endpoint using the model ALOHA 5.2.1 is 125 yards. Under all conditions of alternative release scenarios there will be one house within the circke, this in occupied by the WTP operator.  \n\nFive-year accidental release history\nThere have been no RMP releases of chlorine within the five years of 1994 to date.  \n \nAccidental release prevention program\nAn OSHA PSM program is not required for this facility for chlorine. Our operators are trained in chlorine safety and correct operating procedures. The operators conduct inspection rounds of the WTP, including the chlorine system, to insure the WTP is operating correctly.  Any concerns, including safety of the chlorine process, are reported to the maintenance department so corrections can be made.\nOur maintenance employees are trained in chlorine safety and how to complete the required work.\n\nGeneral prevention activities\nThe facility has a staff of experienced and knowledgeable employees that receive refresher safety training annually. Each employee working with chlorine has the training and experience needed to approach a l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18021,
      "SummaryText": "eak, determine its cause and take corrective actions. Any event involving a release of chlorine is investigated and a root cause determined.    \n\nEmergency response program\nThis facility's employees will respond to an emergency release scenario of chlorine which could have an off site consequence. The Gulf County Emergency Management Agency and the City of Port St. Joe Fire Department has been informed of the storage of chlorine and have a copy of this Risk management Plan.\n\nThe Gulf County Emergence Management Agency and the City of Port St. Fire Department was given the opportunity to inspect the site and make recommendations for inclusion in this Risk Management Program development. Their recommendations are included in the documentation."
    }
  ]
}