{
  "FacilityID": 18065,
  "FacilityName": "VESPER NH3, FARMWAY CO-OP, INC.",
  "FacilityStr1": "East Hwy. 24",
  "FacilityStr2": null,
  "FacilityCity": "Beloit",
  "FacilityState": "KS",
  "FacilityZipCode": "67420",
  "Facility4DigitZipExt": "0096",
  "FacilityCountyFIPS": "20105",
  "LEPC": "Lincoln County LEPC",
  "FacilityLatDecDegs": "39.031389",
  "FacilityLongDecDegs": "-98.279722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "FARMWAY CO-OP, INC.",
  "Company2Name": null,
  "CompanyDUNS": 6942486,
  "Company2DUNS": 0,
  "OperatorName": "JOHN C. WIEBKE",
  "OperatorStr1": "RR 1 BOX 96",
  "OperatorStr2": null,
  "OperatorCity": "LINCOLN",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67455",
  "OperatorZipCodeExt": "0096",
  "RMPContact": "STANLEY L. ODLE",
  "RMPTitle": "SAFETY/COMPLIANCE DIRECTOR",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000008573",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "KANSAS DEPT AG",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-07 00:00:00",
  "AnniversaryDate": "2004-05-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.4156,
  "FRS_Long": -98.1216,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25520,
      "AltID": "VESPER NH3",
      "FacilityID": 18065,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26176,
          "ProcessID": 25520,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33239,
          "ProcessID": 25520,
          "ChemicalID": 56,
          "Quantity": 67000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533239,
          "ProcessID": 25520,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18065,
      "SummaryText": "FARMWAY SAFETY POLICY (VESPER NH3)\nEmergency Response Statement\nFarmway's Emergency Response Policy \n\nFarmway officer's and management's first concern in an emergency is people-employees, customers, visitors, contractors, and the surrounding community of the facilities of Farmway Co-op, Inc.\n\nAll emergency efforts shall be to avoid personal injury or death, avoiding damage to the environment, and minimizing loss of property or product, in that order.\n\nNo employee shall endanger himself/herself without adequate personal protective devices and proper training for the hazard.\n\nTAKE NO ACTION IF UNREASONABLE RISK IS INVOLVED.  Call in professional services and wait for them to arrive.\n\nThe highest-ranking supervisor present has final authority to determine all action until arrival of a higher qualified supervisor or professional services.\n\nEXECUTIVE SUMMARY FOR FARMWAY CO-OP, INC., VESPER, KS 67455\n\nThe information issued by the board and management of Farmway Co-op, Inc, a cooperative located in north central Kansas with home offices located at 204 E. Court, Beloit, KS 67420-0568.  This summary is pertaining to the RMP Clean Air Act Section 112 (r) plan under section 68.155 of the Code of Federal Regulations (CFR).\n\nThe board, management and employees of the facility are committed to prevent accidental release of anhydrous ammonia.  If any release should occur, the facility employees will take immediate action and call 911 dispatch reporting the release to mitigate any release and minimize impact of the release on people or the environment.\n\nThe facility preformed a hazard assessment and developed plans to submit according to the requirements of the Clean Air Act Section 112(r).  According to this assessment the facility falls into the Program 2 category. The facility shall store anhydrous ammonia in 3-6,000 gallon-approved tanks.  The total product stored shall not exceed 85% capacity at 60 degrees Fahrenheit for a maximum of the largest vessel of 20,000 pounds of pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18065,
      "SummaryText": "duct.  Ammonia is an agricultural product sold to customers of Farmway Co-op as a source of nitrogen for plants.\n\nAll measures shall be taken to implement passive mitigation of operational equipment making sure that automatic procedures are in place to prevent a release of product from valves and lines.  All equipment will be checked and tested according to manufacturer specifications and at least annually and documented as to the testing and results.\n\nEmergency response measures shall be in place in case of any release of materials.  Employees are instructed to abide by all policies and procedures as pointed our in the Employee Risk Management Manual.  Training of such procedures will be annually and with any new employee at the job involving anhydrous ammonia. \n\nThe worst-case release of anhydrous ammonia would be the release from the largest vessel identified as 6,000 gallon tank holding 20,000 pounds of anhydrous ammonia liquefied under pressure by design standards.  By using RMP*Comp version 1.04 it was determined that a release of this would meet the endpoint of 2.6 miles.  The impact would be on residents of about 25 resident receptors.\n\nThe alternative-case release of anhydrous ammonia was to demonstrate an overfilled tank while off loading.  The case would show a release of 1000lbs.ammonia over a 10 minute period with an effect of a reading of .2 mile to the toxic endpoint using RMP*Comp version 1.04.  There would be no receptors at this distance.\n\nIn the hazard assessment it was found that there has been no accidents or reportable off-premises release at this facility.  Therefore, no report is in this plan for the 5 year history.\n\nThe emergency response program is on file with the county emergency preparedness division.  The Farmway Co-op plan is included in the Employee Risk Management Manual chapter three.  This manual is to be collected and taken to the head count area after a release or emergency.  The assessment of the incident is to be done and if wa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18065,
      "SummaryText": "rranted call 911.  The highest person at the facility will take command of the incident until other higher official of the company can be summoned to the scene.  The Safety Director is the highest incident command person of the company and all command is give to the Fire Chief of the responding company.\n\nThe facility has implemented the state safety requirements for storage and handling of ammonia under K61.1 published by the American National Standards Institute, Inc.  and the standards of the U.S. Occupational Safety and Health Administrations (OSHA), 29 CFR 1910.111, \"Storage and handling of anhydrous ammonia\".  Safety training is offered to new employees upon introduction to the job.  Annual training is provided through in-house training or employees are to attend outside association offered training.\n\nThe emergency response and release program was written in 1992 and in accordance with OSHA standard 29 CFR 1910.38.  The training of employees is initiated upon employment in the area of ammonia and annual review training is completed with knowledge testing documenting learned processes. The emergency plan is reviewed annually and provided the state and local authorities with a visit at the facilities annually by emergency response trained departments. The written program in accordance with OSHA 29 CFR 1910.120, includes pre-emergency planning and training.\n\nSafety improvement is on-going at the facility with certification of trained employees a goal for the company.  Employee performance evaluations are assessed annually and a training path developed for each employee.\n\nPresident of Farmway Co-op, Inc.: Byron Ulery\nChairman of the Board of Directors: Michael Jordan\nFacility Branch Manager: John C. Wiebke\nFacility Division Manager: Kent Miller\nSafety/Compliance Director: Stanley Odle"
    }
  ]
}