{
  "FacilityID": 18085,
  "FacilityName": "Skelgas of Park Rapids",
  "FacilityStr1": "Hwy. 71 South & Industrial Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Park Rapids",
  "FacilityState": "MN",
  "FacilityZipCode": "56470",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27057",
  "LEPC": null,
  "FacilityLatDecDegs": "46.900056",
  "FacilityLongDecDegs": "-95.050083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Skelgas of Park Rapids",
  "OperatorStr1": "P.O. Box 425",
  "OperatorStr2": "Hwy 71 South & Industrial Blvd",
  "OperatorCity": "Park Rapids",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56470",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Olafson",
  "RMPTitle": "Owmer/Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014708",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-15 00:00:00",
  "SafetyInspectionBy": "Kleespie & Skelgas",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-10-20 00:00:00",
  "DeRegistrationEffectiveDate": "2011-10-12 00:00:00",
  "AnniversaryDate": "2004-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 46.90006,
  "FRS_Long": -95.05008,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Only sell for home heating",
  "_processes": [
    {
      "ProcessID": 25544,
      "AltID": "Propane",
      "FacilityID": 18085,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26200,
          "ProcessID": 25544,
          "NAICSCode": "115112",
          "_desc": {
            "NAICS_CODE": "115112",
            "NAICS_DESCRIPTION": "Soil Preparation, Planting, and Cultivating"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33263,
          "ProcessID": 25544,
          "ChemicalID": 98,
          "Quantity": 162163.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533263,
          "ProcessID": 25544,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18085,
      "SummaryText": "              Risk Management Plan (RMP) - Propane\n                       Executive Summary\n                     Skelgas of Park Rapids\n                     Park Rapids, Minnesota\n                                \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at Skelgas of Park Rapids in Park Rapids are strongly committed to employee, public, and\nenvironmental safety.  This commitment is an inherent part of our comprehensive accidental release\nprevention program that covers areas such as design, installation, operating procedures, maintenance,\nand employee training associated with the processes at our facility.  It is our policy to implement\nappropriate controls to prevent possible releases of regulated substances.  If such a release does\noccur, our trained emergency response personnel are at hand to control and mitigate the effects of\nthe release.  We also coordinate our response efforts with the Park Rapids Fire Department, which\nprovides additional emergency response expertise.\n\n  2. Stationary Source and Regulated Substances Handled\nOur facility's primary activities include support services for crop production.  We have propane \nstored in 18,000- and 30,000-gallon interconnected tanks located at our facility in Park Rapids\n(Figure 1).  The maximum amount stored is 38,400 gallons (162,163 pounds) at the maximum fill\ncapacity of 80%.\n\n  3. Worst Case Release and Alternative Release Scenarios\nWe utilized RMP PRO for the worst case and alternate case scenarios of the required offsite\nconsequence analysis for our facility.  The following details these scenarios.\n\nThe worst case release scenario involves a catastrophic release of the entire contents of the\ninterconnected propane storage tank (162,163 pounds) in gaseous form over a 10-minute period.  At\nClass F atmospheric stability and 1.5 m/s wind speed, the maximum distance to an endpoint of 1 psi\noverpressure is 0.44 miles (Figure 2).  This amount of overpress"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18085,
      "SummaryText": "ure can cause partial demolition of\nhouses and can result in serious injury to people within this distance.  The estimated population\nwithin a 0.44-mile radius of this facility is 500.\n\nThe alternative release scenario involves a 30-minute release of propane from a product line that\ncontacts an ignition source and detonates, resulting in a vapor cloud explosion.  Under neutral\nweather conditions, the maximum distance to an endpoint of 1 psi overpressure is 0.14 mile (Figure\n3).  The estimated population within a 0.14-mile radius of this facility is 50.\n\n     4. General Accidental Release Prevention Program\n\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\nof the release prevention program that is in place at our stationary source.\n\n\nProcess Safety Information\nSkelgas of Park Rapids maintains a detailed record of safety information that describes the chemical\nhazards, operating parameters, and equipment designs associated with all processes (Appendix D).\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a\ntimely manner.\n\nOperating Procedures\nSkelgas of Park Rapids maintains written operating procedures to ensure that activities within our\ncovered processes are conducted safely.  These procedures address various modes of operation; the\ninformation is regularly reviewed and is readily accessible to operators involved in the processes\n(Appendix B).\n\nTraining\nSkelgas of Park Rapids has a comprehensive training program in place to ensure that employees who\nare operating processes are competent in the operating procedures associated with these processes.\n\nMechanical Integrity\nSkelgas of Park Rapids conducts documented maintenance checks on process equipmen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18085,
      "SummaryText": "t to ensure\nproper operation.  Maintenance checks are performed by qualified personnel with previous training\nin maintenance practices.  Examples of process equipment that would receive maintenance checks\ninclude:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\nshutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance\nchecks are corrected in a safe and timely manner (Appendix C).\n\nManagement of Change\nWritten procedures are in place at Skelgas of Park Rapids to manage changes in process chemicals,\ntechnology, equipment, and procedures.  Process operators, maintenance personnel or other\nemployees whose job tasks are affected by a modification in process conditions are promptly notified\nof the modification and offered training to deal with it.\n\nPre-startup Reviews\nSkelgas of Park Rapids routinely conducts pre-startup safety reviews related to new processes and\nmodifications in established processes.  These reviews are conducted to confirm that construction,\nequipment, and operating and maintenance procedures are suitable for safe startup prior to placing\nequipment into operation.\n\nCompliance Audits\nSkelgas of Park Rapids conducts compliance audits on a regular basis to determine whether the\nprovisions of the plan, as set out under 40 CFR part 68, are being implemented.  Any non-\ncompliance issue discovered during the audit is promptly corrected.\n\nEmployee Participation\nSkelgas of Park Rapids truly believes that process safety management and accident prevention is a\nteam effort.  Company employees are strongly encouraged to express their views concerning\naccident prevention issues and to recommend improvements.  In addition, our employees have access\nto all information created as part of the facility's implementation of the RMP particularly\ninformation resulting from process hazard analyses.\n\n  5. Five-year Accident History\nSkelgas of Park Rapids has had an excellent record of preventing accide"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18085,
      "SummaryText": "ntal releases over the last\n5 years.  Due to our stringent release prevention policies, no accidental release has occurred during\nthis period.\n\n  6. Emergency Response Plan\nSkelgas of Park Rapids maintains a written emergency response plan to deal with accidental releases\nof hazardous materials.  The plan addresses all aspects of emergency response including first aid and\nmedical treatment, evacuations, and notification of local emergency response agencies and the public\n(Appendix A).\n\n  \n"
    }
  ]
}