{
  "FacilityID": 1816,
  "FacilityName": "Baker Boy Bake Shop, Inc.",
  "FacilityStr1": "170 GTA Drive",
  "FacilityStr2": "West Industrial Park",
  "FacilityCity": "Dickinson",
  "FacilityState": "ND",
  "FacilityZipCode": "58601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38089",
  "LEPC": "Stark County LEPC",
  "FacilityLatDecDegs": "46.873056",
  "FacilityLongDecDegs": "-102.846944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 60480589,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Baker Boy Bake Shop, Inc.",
  "OperatorStr1": "170 GTA Drive",
  "OperatorStr2": "West Industrial Park",
  "OperatorCity": "Dickinson",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Fred Schauer",
  "RMPTitle": "Safety Coordinator",
  "FTE": 185,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000021353",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Dickinson, ND",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 46.87312,
  "FRS_Long": -102.84654,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1984,
      "AltID": "Frozen Bakery Products",
      "FacilityID": 1816,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2022,
          "ProcessID": 1984,
          "NAICSCode": "311813",
          "_desc": {
            "NAICS_CODE": "311813",
            "NAICS_DESCRIPTION": "Frozen Cakes, Pies, and Other Pastries Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2120,
          "ProcessID": 1984,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502120,
          "ProcessID": 1984,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1816,
      "SummaryText": "The Baker Boy Bake Shop, Inc. facility located in Dickinson, North Dakota is a producer of frozen bakery products that handles ammonia which is considered toxic by EPA. The primary purpose of this facility is to make frozen dough products and pan baked products that are frozen for distribution to independent distributors.  The facility started up a new portion of the ammonia refrigeration system in 1998 bringing the amount of ammonia on site from less than 500 pound to an amount less than 10,000 in 1998.\n\nAmmonia is used at the facility to refrigerate areas to maintain a safe storage and processing of food products.  Ammonia is a valuable chemical used in the facility refrigeration system, providing the means to remove heat from the products being handled.  Ammonia is contained in equipment in the facility and is compressed, condensed and evaporated to remove heat from areas within the facility.\n\nSince ammonia is classified by EPA as a toxic chemical, it is necessary to observe certain safety precautions in handling the chemical to prevent unnecessary human exposure, to reduce the health threat to our own workers, and reduce the threat to nearby members of the community.  It is our policy to adhere to all Federal and State rules and regulations.  Safety depends upon the manner in which we handle ammonia combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel.\n\nAn accidental release prevention program has been in place since the start up of the existing facility. The facility was constructed using the International Institute of Ammonia Refrigeration (IIAR) guidelines, and is in compliance with state codes.  This bakery goods facility complies with EPAs Accidental Release Prevention Rule and with all applicable state codes and regulations. \n\nAll of our ammonia refrigeration operators have been trained using the refrigeration contractor including information based"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1816,
      "SummaryText": " on materials from IIAR a nationally recognized authority in ammonia refrigeration, and also have Process Safety Management training, and on the job training.  This program consists of having an effective preventative maintenance program and comprehensive employee training to insure adequate response to equipment integrity.  The facility plans to replace Safety Relief Valves on a 5 year interval as recommended by IIAR.  \n\nOur emergency response program is based upon federal guidelines as they apply to this facility.  The emergency response plan includes procedures for notification of the local fire authority, local emergency response agencies, and notification of any potentially affected neighbors. The facility emergency response plan is based on all known applicable regulations and requirements.  The emergency response plan has been discussed with the Dickinson City and Rural Fire Departments and other agencies involved with a response including the Local Emergency Planning Commission.  Representatives of the Dickinson area Fire Departments visited this plant on an annual basis.  \n\nThere have been no reportable accidents in the past 5 years related to the ammonia system.  Furthermore, there have been no reportable releases at this facility in the past 5 years.  \n\nIn regards to the worst case release scenario for ammonia as defined by EPA, the worst case release scenario for ammonia from the high pressure receiver (located outside) could extend beyond the Baker Boy property.  An alternative, more likely, release scenario could just extend beyond the property.  \n\nIn all cases of a potential release, the extent of downwind areas affected is dependent on the amount of chemical released, weather conditions, wind speed and direction, etc.."
    }
  ]
}