{
  "FacilityID": 18253,
  "FacilityName": "Agrium U.S. Inc.",
  "FacilityStr1": "1557 County Road 1400 N.",
  "FacilityStr2": null,
  "FacilityCity": "Henry",
  "FacilityState": "IL",
  "FacilityZipCode": "61537",
  "Facility4DigitZipExt": "0216",
  "FacilityCountyFIPS": "17123",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.121667",
  "FacilityLongDecDegs": "-89.340556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": "@agrium.com",
  "FacilityDUNS": 808957229,
  "ParentCompanyName": "Agrium U.S. Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": 0,
  "OperatorName": "James Epley/ Plant Manager",
  "OperatorStr1": "P.O.Box 216",
  "OperatorStr2": "Richards Road",
  "OperatorCity": "Henry",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61537",
  "OperatorZipCodeExt": "0216",
  "RMPContact": "James Epley",
  "RMPTitle": "Plant Manager",
  "FTE": 45,
  "OtherEPAFacilityID": "61537HNRYFRICHA",
  "EPAFacilityID": "100000097012",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.1108,
  "FRS_Long": -89.3911,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 25739,
      "AltID": "Ammonia System",
      "FacilityID": 18253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26403,
          "ProcessID": 25739,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33480,
          "ProcessID": 25739,
          "ChemicalID": 56,
          "Quantity": 305990.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533480,
          "ProcessID": 25739,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18253,
      "SummaryText": " Executive Summary, Henry Fertilizer Operation\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Agrium Henry Operation are  committed to employee, public and environmental safety.  This commitment is demonstrated by our continuing devlopment and implementation of measures and policies intended to prevent the possible release of  regulated substances.  In the unlikely event of a release, Henry Operations has an emergency response plan in place to minimize the potential effects of a release.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass the manufacturing of granulated Nitrogen(N),Phosphate(P), Potash(K) fertilizers.  We have 1 regulated substance present at our facilit,  Ammonia (anhydrous).  Ammonia (anhydrous) is used  as a source of nitrogen in granulated NPK fertilizers.\n \nThe maximum inventory of Ammonia(anhydrous) at our facility is 305,990 lb..\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used TFI Look Up Tables.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from the Ammonia System.  In this scenario 160,000 lb. of Ammonia (anhydrous) is released to atmosphere.  The toxic liquid released in a gaseous form to the atmosphere at Class F atmospheric stability and 1.5 m/s windspeed, to a toxic endpoint of 0.14 mg/L, which could result in potential off site consequences. \n\nThe alternative release scenario for Ammonia (anhydrous) involves a release from the Ammonia System 2\" piping.  The scenario involves the release of 11,908 lb. Ammonia(anhydrous) to atmosphere, assuming the release is stopped by human intervention after 2"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18253,
      "SummaryText": " minutes.   The release is also assumed to be controlled by excess flow valves, scrubbers, Emergency Response Procedures and emergency shutdown systems.  These active mitigation systems have the effect of reducing the potential of a release resulting in off site consequences.  Under neutral weather conditions, the toxic endpoint of 0.14 mg/L.\n\n \n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nAgrium Henry Operations maintains a  record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the process.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the  HAZOP methodology.  The studies are undertaken by a team of qualified personnel with expertise in process operations.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 03/04/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered process, Agrium Henry Operations maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nAgrium Henry Operations has a  training program in place to ensure that employees who are operating processes ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18253,
      "SummaryText": "e competent in the operating procedures associated with these processes.  \n\n\nMechanical Integrity\nAgrium Henry Operations carries out  documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Agrium Henry Operations to manage changes in process chemicals, technology, equipment and procedures..  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are  made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety review related to new processes and to modifications in established processes are conducted as a regular practice at Agrium U.S. Inc..  The Henry Operations has written procedures in place to conduct a Pre-startup Review, there have been no new processes added to date.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nAgrium U.S. Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The Henry Operation is scheduled for a Compliance Audit in the thirs quarter of 1999. These audits will be conducted every three years and any corrective actions required as a result of the audits will be undertaken in a safe manner.\n\nIncident Investigation\nAgrium Henry Operations investi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18253,
      "SummaryText": "gates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nAgrium Henry Operations company employees are  encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, an evaluation of the safety performance of the contractor is carried out.  Agrium Henry Operation has a  policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur, this is done through a Contractor Orientation Program.\n\n\n5.    Five-year Accident History\nAgrium Henry Operation has had an excellent record of preventing accidental releases over the last 5 years.  Due to our release prevention policies, there has been no accidental release during this period.\n\n6.    Emergency Response Plan\nAgrium Henry Operation carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes  aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18253,
      "SummaryText": ".  In addition, the plan is updated to reflect any pertinent changes taking place within our process that would require a modified emergency response.\n\nMarshall County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. The installation of in plant emergency alarm systems, continued development of operational skills training, continued development of the plant preventive maintenance programs as well as plant up grades  are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemented by 12/31/99.\n"
    }
  ]
}