{
  "FacilityID": 18365,
  "FacilityName": "Linweld Acetylene Plant",
  "FacilityStr1": "11th Street",
  "FacilityStr2": null,
  "FacilityCity": "Oakland",
  "FacilityState": "NE",
  "FacilityZipCode": "68045",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31021",
  "LEPC": null,
  "FacilityLatDecDegs": "41.845278",
  "FacilityLongDecDegs": "-96.466111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": "www.linweld.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 35070515,
  "ParentCompanyName": "Linweld Mfg.",
  "Company2Name": null,
  "CompanyDUNS": 35070515,
  "Company2DUNS": null,
  "OperatorName": "Steve O'Mara",
  "OperatorStr1": "Rt. 2",
  "OperatorStr2": null,
  "OperatorCity": "Oakland",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68045",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000149975",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-10-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-09-27 00:00:00",
  "DeRegistrationEffectiveDate": "2011-07-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.847259,
  "FRS_Long": -96.466831,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility sold",
  "_processes": [
    {
      "ProcessID": 25883,
      "AltID": "130 ft3 acetylene cyl",
      "FacilityID": 18365,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 33633,
          "ProcessID": 25883,
          "ChemicalID": 155,
          "Quantity": 13030.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 25142,
              "ProcessChemicalID": 33633,
              "ChemicalID": 96
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26550,
          "ProcessID": 25883,
          "NAICSCode": "32512",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18365,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1999-06-15 00:00:00",
    "CoordinatingAgencyName": "Oakland Fire Department",
    "CoordinatingAgencyPhone": "4026855113",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "NFPA 58",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18365,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at Linweld Manufacturing  Acetylene Plant are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass Acetylene Gas Manufacturing Plant & Propane Storage / Cylinder Filling Facility.  We have 1 regulated substances present at our facility. Acetylene  [Ethyne] is manufactured at this facility, then stored until it can be transported to retail locations.                                      .\n\nThe maximum inventory of Acetylene [Ethyne] in a flammable gas mixture with acetone at our facility is 20,687 pounds stored in individual cylinders ranging from 330 cubic feet (22.45 lbs) down to 10 cubic feet (.68 lbs).\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo evaluate the worst case scenarios, we have used the EPA's OCA Guidance Reference Tables or Equations.  For alternative release scenario analyses we have employed .  The following paragraphs provide details of the chosen scenarios.\n\n130 ft3 acetylene cylinder storage qualifies as a program level 1 process.  In the worst case scenario for this process 8.9 lb. of Flam. Mix.: Acetylene  [Ethyne] is released.   It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor clou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18365,
      "SummaryText": "d explosion.  Under worst case weather conditions, the calculated distance of 0.02 miles is obtained corresponding to an endpoint of 1 psi overpressure.  This distance is less than the distance to the nearest public receptor.\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA 51A & NFPA 58.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nLinweld Acetylene Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the review of RexArc equipment and acetylene manufacturing recommendations, NFPA 51A and Compressed Gas Association safety guidelines for the processing and safe handling of acetylene.  The studies are undertaken by a team of qualified personnel with expertise in acetylene process operations and are revalidated at a regular interval.  Personnel responsible for the operations at the facility attend acetylene safety seminars sponsored by the Compressed Gas Industry once every two years.  Any findings related to the hazard analysis conducted at acetylene planst throughout the industry are addressed at these safety seminars with all personnel in attendance.  Linweld personnel then review the processes at our facility to insure all measures discussed from the hazard analysis presentations are addressed at the Oakland facility.  \n\nOperating Procedures\nFor the purposes of sa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18365,
      "SummaryText": "fely conducting activities within our covered processes, Linweld Acetylene Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nLinweld Acetylene Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided on a continuous basis and at least every  year and more frequently as needed.\n\nMechanical Integrity\nLinweld Acetylene Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices of acetylene equipment.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance/operators checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Linweld Acetylene Plant to manage changes in process chemicals, technology, equipment and procedures.  With the manufacturing of acetylene, very few operating changes occur because of the tight controls established for the manufacture of the product.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18365,
      "SummaryText": "ocesses and to modifications in established processes are conducted as a regular practice at Linweld Acetylene Plant.  Every hour on the hour the manufacturing process and equipment is reviewed to insure the acetylene generator and other equipment is kept within the required operating parameters. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nLinweld Acetylene Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent comliance audit was conducted on June 15, 1999.  These audits are carried out at least once every 1 year and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nLinweld Acetylene Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nLinweld Acetylene Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Linweld Acetylene Plant has"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18365,
      "SummaryText": "a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.\tFive-year Accident History\nLinweld Acetylene Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.\tEmergency Response Plan\nLinweld Acetylene Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.\tPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. These changes involve the continual monitoring of the acetylene generator to insure the temperature and water levels are maintained within the normal operating procedures."
    }
  ]
}