{
  "FacilityID": 18427,
  "FacilityName": "Rocky Mount Gathering System Facility",
  "FacilityStr1": "3.5 mi. NE Rocky Mount, on lease Rd",
  "FacilityStr2": null,
  "FacilityCity": "Rocky Mount",
  "FacilityState": "LA",
  "FacilityZipCode": "71241",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22015",
  "LEPC": "Bossier-Caddo Parish LEPC",
  "FacilityLatDecDegs": "32.860639",
  "FacilityLongDecDegs": "-93.605528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Brammer-Keystone Energy, L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brammer-Keystone Energy, L.L.C.",
  "OperatorStr1": "333 Texas Street, Suite 1425",
  "OperatorStr2": null,
  "OperatorCity": "Shreveport",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71107",
  "OperatorZipCodeExt": "5323",
  "RMPContact": null,
  "RMPTitle": "Director of Safety & Environmental",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163137",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Program 1: NGL Storage Tank",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-10-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-03-23 00:00:00",
  "DeRegistrationEffectiveDate": "2014-08-29 00:00:00",
  "AnniversaryDate": "2004-10-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.7365,
  "FRS_Long": -92.242,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility was sold. Devon is no longer owner / operator",
  "_processes": [
    {
      "ProcessID": 25952,
      "AltID": "Natural Gas Liquids",
      "FacilityID": 18427,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26621,
          "ProcessID": 25952,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33709,
          "ProcessID": 25952,
          "ChemicalID": 98,
          "Quantity": 33814.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533709,
          "ProcessID": 25952,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18427,
      "SummaryText": "\n    Executive Summary\n\nThis Risk Management Plan has been developed for Brammer-Keystone Energy, L.L.C.'s (BKE, L.L.C.) Rocky Mount Gathering System Facility in accordance with 40 CFR part 68.  This facility is subject to the requirements of this program due to the manufacturing and storage of natural gas liquids (approximately 90% propane) in an amount greater than 10,000 lbs.\n\nThe facility is located approximately 3.5 miles northeasterly of Rocky Mount, Louisiana down an unimproved road off of Fire Tower Rd. within Bossier Parish. The area surrounding the facility is sparsely populated forestland used primarily for timber and oil and gas exploration and production purposes.  The latitude and longitude of the facility was obtained using a hand-held Garmin 75 GPS device with an accuracy of +/-100 meters.  The facility can be located on the USGS quadrangle map entitled Ivan, LA.\n\nThe facility processes natural gas, natural gas liquids (NGL), and condensate/oil from various field wells.  High-pressure gas, approximately 900 psig, from the incoming wells is directed to the discharge line of the facility's main gas compressor system.  It is then sent through an inlet separator prior to being routed to a glycol dehydration system.  Dry gas from the glycol contact tower is routed into the facility's fluid extraction system.  This system is designed to reduce incoming gas pressure to approximately 300 psig thereby forcing a reduction in temperature.  This cooling effect causes the gas stream to partially condense thus forming NGL.  NGL is a mixture of propane, butane, pentane and other heavier hydrocarbons.  The NGL is stored in a 10,000 gallon pressurized tank until it is transported for sales by a pressurized tank truck service.\n\nSince propane is the predominant (approximately 90%) substance in NGL with the highest heat of combustion, the properties of the mixture are assumed to be similar to that of propane.  The threshold quantity for flammable substances under 40 CFR pa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18427,
      "SummaryText": "rt 68 is 10,000 lbs. It is the industry standard to not exceed 80% of the total tank capacity, therefore the maximum amount of NGL on-site at this facility is approximately 8,000 gallons (80% of 10,000).  According the Gas Processors Suppliers Association's Engineering Data Book Volume II the liquid density of propane is 4.2268 lbs./gal.  Based on this information the facility stores a maximum of 33,814 lbs. of NGL.\n\nThe worst-case release scenario would involve the release of the greatest amount from a single vessel as required by 40 CFR part 68.25 (b)-Determination of worst-case release quantity. This type of release may occur as a result of catastrophic natural or other unforeseen disaster, such as total tank failure as well as the failure of all installed safety devices.  A release of 33,814 lbs. of NGL for a duration of 10 minutes in the form of a vapor cloud explosion due to a to 1 psi overpressurization results in a 0.3 mile distance to the endpoint.  According to USGS maps and operator knowledge of the surrounding area there are no public or environmental receptors within a 0.30-mile radius of the facility.  The nearest known public receptor is a private residence located approximately 0.9 mile west of the facility.\n\nAn alternative scenario is not required for this facility because it is classified as a program 1 site.\n\nThe facility has not experienced a release that caused on or off site injury, death or property damage within the past five years.  \n\nA prevention program is not required for this facility.  As a prudent operator BKE, L.L.C. is aware of the General Duty Clause and therefore provides the proper training to its employees to maintain a safe working environment and to minimize the possibility of an accidental release.  The 10,000-gallon storage tank is equipped with a relief valve venting to the atmosphere that automatically operates according to preset pressure specifications.  Manual shut-off valves are located at the NGL extraction vessel effl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18427,
      "SummaryText": "uent line and the inlet to the storage tank\n\nThe Rocky Mount Gathering System Facility does not have a site-specific emergency response plan.  BKE, L.L.C. does operate under a company emergency response plan that is available to all facility personnel.  Emergency response procedures have been coordinated with the Caddo-Bossier Parish Local Emergency Planning Committee.\n\nThis facility qualifies as a Program 1 facility because:\n        *The facility has not experienced an accidental release that caused death, injury or          property damage within the past five years.\n        *The distance to the flammable endpoint for the worst-case release scenario is less          than the distance to the nearest public receptor\n        *Emergency response procedures have been coordinated with the local emergency          planning and response organizations.\n"
    }
  ]
}