{
  "FacilityID": 18534,
  "FacilityName": "SFE Citrus Processors LP, Ltd.",
  "FacilityStr1": "625 Bridgers Avenue West",
  "FacilityStr2": null,
  "FacilityCity": "Auburndale",
  "FacilityState": "FL",
  "FacilityZipCode": "33823",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12105",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "28.061306",
  "FacilityLongDecDegs": "-81.798778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "flglobal@aol.com",
  "FacilityDUNS": 798197621,
  "ParentCompanyName": "Florida Global Citrus Limited",
  "Company2Name": "PAI Holding LLC",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pasco Acquisition Inc.",
  "OperatorStr1": "400 N Tampa Street",
  "OperatorStr2": null,
  "OperatorCity": "Tampa",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33601",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Tegreene",
  "RMPTitle": "Operations Manager",
  "FTE": 155,
  "OtherEPAFacilityID": "42071RYNMLECHES",
  "EPAFacilityID": "100000163547",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1050037-001-AV",
  "SafetyInspectionDate": "1999-02-02 00:00:00",
  "SafetyInspectionBy": "Applied Associates International, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-10-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-10-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2005-02-23 00:00:00",
  "AnniversaryDate": "2004-10-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 28.06217,
  "FRS_Long": -81.79833,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26101,
      "AltID": null,
      "FacilityID": 18534,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26771,
          "ProcessID": 26101,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33912,
          "ProcessID": 26101,
          "ChemicalID": 56,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533912,
          "ProcessID": 26101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 26102,
      "AltID": null,
      "FacilityID": 18534,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 26772,
          "ProcessID": 26102,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 33913,
          "ProcessID": 26102,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 533913,
          "ProcessID": 26102,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18534,
      "SummaryText": "FLorida Global Executive Summary\n                                                  FLORIDA GLOBAL CITRUS                 \n                                            RISK MANAGEMENT PROGRAM\n                                                     EXECUTIVE SUMMARY\n\n1.  General accidental release and prevention policy of Florida Global Citrus.\n\nIn this frozen citrus juice processing facility we utilize anhydrous ammonia as a refrigerant. \nAnhydrous ammonia is considered hazardous by the Environmental Protection Agency. The same\nproperties that make ammonia a valuable refrigerant also makes it necessary to observe certain\nsafety precautions during it's use to prevent exposure to our workers, the surrounding community\nand the environment. \nIt is our policy at Florida Global to implement the requirements of the Risk Management Program\nby managing and operating this facility in full compliance with all applicable federal and state\nregulations that we are governed by. The objective is to minimize the risk of an accidental release\nof hazardous materials. Safety depends directly on our proper handling of ammonia. Our plant\npersonnel have been trained on the equipment operating procedures and the various safety devices\nthat are incorporated in our facility to prevent the possibility of accidental releases.\n\n2.  Stationary source and regulated substance handled.\n\nFlorida Global Citrus, 625 Bridgers Ave., Auburndale, Florida operates four (4) independent\nrefrigeration systems utilizing anhydrous ammonia as the primary refrigerant. \n\nMechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as a\nheat exchanging fluid to maintain a desired temperature in an enclosed environment. The\nrefrigeration cycle consists of evaporation, compression, condensation and expansion.\nEvaporation and condensation are designed to alter the quantity of energy associated with the\nrefrigerant. Compression and expansion are designed to change the availability of the assoc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18534,
      "SummaryText": "iated\nenergy. The refrigeration cycle is a closed loop process. The ammonia cycle utilizes fluid\ntemperature, pressure and latent heat of vaporization for cooling. The refrigeration system uses\nthis phenomenon to remove heat from a desired space, and then to discard that heat through\ncondensation, to an area where it is of no consequence.\nThe Florida Global facility uses ammonia refrigeration to maintain storage room, freezers and\nprocessing area temperatures for the citrus products they produce. The refrigeration systems\ncontain the following equipment: Seventeen compressors, seven evaporative condensers, thirty\neight vessels, thirty cooler/freezer evaporators, five chillers and a system purger. The refrigeration\nsystems contain the following amounts of ammonia: Machine Room #1, 4,300 pounds, Machine\nRoom #2, 21,800 pounds, Machine Room #3, 14,000 pounds and Machine Room #4, 5,000\npounds of aggregate ammonia.\nThere are approximately 150 employees at this facility during peak season, this includes hourly\nand salary personnel.  This facility processes frozen citrus products approximately 24 hours a day,\nfive days a week.  \n\nThe potential hazards that could lead to an accidental release of the ammonia include, but are not\nlimited to, equipment failure, damage to piping, damage to equipment, human error, etc.\n \nAlthough ammonia is a colorless, tasteless liquid, it's dominant characteristic is it's pungent,\ndistinct odor.  Persons exposed to ammonia will not voluntarily stay in areas of even small\nconcentrations, although these levels would not normally result in any health risks. Risks from\naccidental exposure to ammonia in a vapor state are irritations to the eyes, nose and throat. The\nextent of irritation depends on the exposure amount and length of time exposed.  \nAmmonia is classified non-flammable by the Department of Transportation.  Ammonia will burn,\nbut only in a very narrow concentration level when accompanied with a constant ignition source.\n\n3. Worst case  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18534,
      "SummaryText": "and alternate case release scenarios including administrative and\nengineering controls to limit/ prevent accidental release.\n\nWorst case scenario depicts continuous source leak from the High Pressure Receiver located just\noutside machine room #2.  This vessels normal operating level is 9,000 pounds of liquid ammonia, \napproximately 50% of it's total capacity. Although the receiver is capable of holding 18,000\npounds of liquid ammonia, this far exceeds company policy  and engineering controls which limits\nthe liquid level within the receiver.  Considering the \"catastrophic\" possibility does exist for this\nvessel to release it's entire contents, engineering controls incorporated into the system would\nnormally prevent such a release.\n\n     Worst case release scenario criteria for the Florida Global Citrus facility:\n\n     Ammonia Quantity:                  9,000 pounds\n     Rate of Release:                       900 lbs / min. (10 min. release)\n     LOC (Level of Concern):         200 ppm  (EPA ERPG-2)  \n     Physical State:                          Gas \n     Type of Area:                           Urban\n     Wind Speed:                             1.5 m/sec\n     Distance to Endpoint                1.7 miles\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief\nvalve (SRV) due to an overpressurization condition on the controlled pressure receiver vessel\nlocated outside machine room #2. The indicated relief valve would be performing exactly as it is\ndesigned to do during an overpressurization condition. Valve would open to relieve the over-\npressure and vent immediatley into the atmosphere.\n    \n Alternate case release scenario criteria for Florida Global Citrus facility:\n\n     Ammonia Quantity:                     366 pounds\n     Rate of Release:                          32 pounds/min. (22 min. release)\n     Wind Speed:                               3.0 m/sec.\n     Distance to Endpoint:                  .1 miles\n     \n     The f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18534,
      "SummaryText": "ollowing administrative and engineering controls are in place at Florida Global\nCitrus. These controls are designed to eliminate, or reduce the possibilities of an accidental\nrelease from the refrigeration system.\n     \n     *  High level alarms are installed on all pressure vessels that are configured directly to a\ncompressor. Associated compressor will shut down if a high level condition is sensed by the level\nalarm. All four (4) machine rooms are configured with this shut-down system.\n     *  All compressors are configured with critical safety controls (high pressure, low\npressure, high oil temp cut-outs, etc.) to shut down the respective compressor in the event of an\nabnormal operating condition.\n     *  Safety Relief Valves are configured to all pressure vessels, condensers and compressor\noil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n     *  System wide shut-down is installed in all machine rooms. If system head pressure rises\nabove a pre-determined set point the refrigeration equipment will shut down automatically.\n     *  Periodic Maintenance Program is incorporated into the maintenance department to\nensure the refrigeration system and it's components are kept in optimum mechanical and operating\nstatus.\n     *  Refrigeration personnel on site twenty four (24) hours a day, five days a week. Security\nmonitors equipment head pressure every hour during weekends. If an abnormal condition is\npresent, security notifies refrigeration personnel via pager. \n\n4.  Five-year accident history.\n\nFlorida Global Citrus has had zero accidental releases to report during the last five (5) years.\n\n5.   Emergency Response Program\n\nThe purpose of the Florida Global Emergency Action Plan is to:\n\n     1.   Minimize exposure to our employees and the surrounding community in the event of a\n     hazardous material release or spill.\n\n     2.  Assure the safe emergency evacuation of the plant in the instance that it is required.\n\n     "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18534,
      "SummaryText": "3.  Provide for prompt medical attention to any employees who become seriously injured\n     or ill at work.\n\n     4.  Facility management has developed an Emergency Response Plan to ensure a fast and   \n           efficient response in the event of an accidental release of hazardous materials. \n\nOur Emergency Action Plan currently meets requirements as set forth in OSHA 29 CFR 1910.38,\nEmployee Emergency and Fire Prevention Plans.  \n "
    }
  ]
}