{
  "FacilityID": 18625,
  "FacilityName": "Systech Environmental Corporation",
  "FacilityStr1": "South Cement Road",
  "FacilityStr2": null,
  "FacilityCity": "Fredonia",
  "FacilityState": "KS",
  "FacilityZipCode": "66736",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20205",
  "LEPC": "Wilson County LEPC",
  "FacilityLatDecDegs": "37.508333",
  "FacilityLongDecDegs": "-95.825",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sysenv.com",
  "FacilityEmailAddress": "systech@erinet.com",
  "FacilityDUNS": 38721056,
  "ParentCompanyName": "Lafarge Corporation",
  "Company2Name": null,
  "CompanyDUNS": 67568246,
  "Company2DUNS": null,
  "OperatorName": "Systech Environmental Corporation",
  "OperatorStr1": "South Cement Road",
  "OperatorStr2": "P.O. Box 111",
  "OperatorCity": "Fredonia",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66736",
  "OperatorZipCodeExt": null,
  "FTE": 41,
  "OtherEPAFacilityID": "KSD 980633259",
  "EPAFacilityID": "100000154726",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "pending",
  "SafetyInspectionDate": "1999-07-20 00:00:00",
  "SafetyInspectionBy": "MSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": "Fredonia",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-11-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-11-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-11-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.507728,
  "FRS_Long": -95.824133,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26220,
      "AltID": "Co-Processing",
      "FacilityID": 18625,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34063,
          "ProcessID": 26220,
          "ChemicalID": 25,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 34064,
          "ProcessID": 26220,
          "ChemicalID": 4,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 34065,
          "ProcessID": 26220,
          "ChemicalID": 155,
          "Quantity": 1200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 25368,
              "ProcessChemicalID": 34065,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 25369,
              "ProcessChemicalID": 34065,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 25370,
              "ProcessChemicalID": 34065,
              "ChemicalID": 92
            },
            {
              "FlamMixChemID": 25371,
              "ProcessChemicalID": 34065,
              "ChemicalID": 118
            }
          ]
        },
        {
          "ProcessChemicalID": 34066,
          "ProcessID": 26220,
          "ChemicalID": 29,
          "Quantity": 29000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 26893,
          "ProcessID": 26220,
          "NAICSCode": "562211",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 10116,
              "Process_NAICS_ID": 26893,
              "SafetyReviewDate": "1999-04-08 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "NFPA, API, NEC",
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-08 00:00:00",
              "ChangeCompletionDate": "2000-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Fusible link fire detection",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Improved administrative controls",
              "OpProceduresReviewDate": "1999-09-15 00:00:00",
              "TrainingReviewDate": "1999-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-07-02 00:00:00",
              "EquipmentInspectionDate": "1999-11-19 00:00:00",
              "EquipmentTested": "Grinder",
              "ComplianceAuditDate": "1999-05-17 00:00:00",
              "AuditCompletionDate": "1999-05-21 00:00:00",
              "IncidentInvestigationDate": "1999-10-28 00:00:00",
              "InvestigationChangeDate": "1999-11-10 00:00:00",
              "MostRecentChangeDate": "1999-05-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10590,
                  "PreventionProgram2ID": 10116,
                  "ProcessChemicalID": 34063
                },
                {
                  "PrimaryKey": 10591,
                  "PreventionProgram2ID": 10116,
                  "ProcessChemicalID": 34064
                },
                {
                  "PrimaryKey": 10592,
                  "PreventionProgram2ID": 10116,
                  "ProcessChemicalID": 34065
                },
                {
                  "PrimaryKey": 10593,
                  "PreventionProgram2ID": 10116,
                  "ProcessChemicalID": 34066
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18625,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-03 00:00:00",
    "ERTrainingDate": "1999-10-08 00:00:00",
    "CoordinatingAgencyName": "Fredonia Fire Department",
    "CoordinatingAgencyPhone": "3163782188",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "MSHA 30 CFR 56"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18625,
      "SummaryText": "THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\nSystech Environmental Corporation is located in Wilson County, Kansas. This facility receives and processes flammable industrial waste into a fuel that is used by the neighboring Lafarge Corporation cement plant. Systech pioneered the process by which the energy value of wastes is recovered, thus not only providing an inexpensive source of energy, but also consuming waste that would otherwise present a disposal problem. Systech is located on an 11-acre tract of land in a rural setting about 2 miles south of the center of the City of Fredonia.\n\nSystech began operation in Fredonia in 1982. Today there are 41 employees with an annual payroll of $1,750,000. Systech also supports the community by buying about $2,600,000 annually in supplies, services, and utilities.\n\nThe Risk Management Plan is being submitted predictively in anticipation of the possibility of receiving RMP-listed chemicals in future. Systech has identified three RMP-listed toxics - acrylonitrile, chloroform, and vinyl acetate, and four RMP-listed flammables - ethyl ether, isopentane, pentane, and butane. Generally, these chemicals would be received as components of waste mixtures which would greatly reduce any hazards they may present in the pure form. Many of the activities and programs recently required by the RMP Rule have been in place at our plant since the beginning of the fuels program. Safety has long been part of our program.\n\nTHE ACCIDENTAL RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nIt has always been Systech's policy to meet the requirements of all applicable safety, health and environmental regulations. Contingency plans and safety procedures are in place at the facility to protect on-site employees. In addition to Systech employees, the procedures are in place to protect contractors, the environment, and outside communities.\n\nA related program in which we are participating is a company-wide Y2K"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18625,
      "SummaryText": "effort to ensure that Y2K issues associated with our computer-based systems and those of our suppliers will not impact the safety and environmental performance of our operations.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe have in place a thorough risk management (RM) Program. This program calls for implementation and maintenance of procedural and engineered safeguards at the plant to minimize the likelihood of a significant release of a hazardous chemical, and to eliminate or reduce the effects of any release that might occur. We have invested and continue to invest substantial effort and capital in maintaining our strong safety and environmental performance. A recent example of our investments is the expansion of the fire-fighting systems at the site. \n\nSafety is a day-to-day focus at the facility. Systech's program includes elements such as:\n\n(1) Hazard Reviews - Systech performs and maintains up to date, systematic and thorough studies of our operations to identify what could go wrong, identifies means of eliminating or reducing design or procedural weaknesses, and implements improvements.\n\n(2) Process Design - Systech's processes and equipment are designed for safety in accordance with applicable industry standards and best engineering practices. Designs include, as appropriate, emergency shutdown systems, pressure relief devices, and ventilation systems. Systech's storage vessels, which contain the greatest inventories of chemicals, are contained in concrete catch basins (dikes) that would confine any waste spills. \n\n(3) Training - our operations and maintenance personnel are trained thoroughly on their job tasks, on safe work practices as they apply to their jobs, and emergency contingency actions, before they may operate or maintain equipment. They also receive refresher training. Systech's procedures for operating and maintaining processes, general safe work practices, and emergency response, are fully docum"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18625,
      "SummaryText": "ented and maintained up to date in light of any changes at the site.\n\n(4) Maintenance - Each item of equipment at the site that is involved in maintaining safety or in responding to an abnormal situation is inspected, tested and/or maintained on a frequency that reflects its service and condition.\n\n(5) Management of Change - no change to equipment or procedural practices can take place at the site without a thorough review of the implications of that change to safety. No change must adversely impact the safety built into the design and operations of our processes.\n\nOur RM Program is tuned to reflect the specific hazards of the chemicals we handle. For example, our operating, maintenance, safe work, and emergency procedures address personal protective equipment appropriate to the chemicals being handled. Also, equipment is selected based on its intended service and chemical exposures, including release detection devices. \n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\nWe have had no events that would qualify for inclusion in the RMP 5-year accident history.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nWe have in place a written emergency contingency plan that we coordinate with the Wilson County Sheriff's Department, the Fredonia Fire Department, and the Fredonia Regional Hospital Ambulance Service. New personnel are trained on the plan, we conduct refresher training annually, and we train on any revisions to the plan. The plan is in compliance with RMP requirements, as well as with EPA RCRA requirements.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nOur safety program is ongoing, involving the identification and implementation of numerous means of incremental safety performance.\n\nTHE WORST-CASE RELEASE SCENARIOS AND THE ALTERNATIVE RELEASE SCENARIOS\n\nThe RMP provides a detailed prescription for what should be considered worst case scenarios (WCSs). Under that prescription we have identified two WCSs which are extremely unlikely and hypothetical. One is a spontaneous, catastrophic failure of a railcar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18625,
      "SummaryText": "resulting in a spill of waste mixture that contains chloroform as one component. The other involves the catastrophic failure of a railcar containing a flammable mixture, assumed per RMP-specification to result in a vapor cloud explosion. Based on use of the EPA Offsite Consequence Analysis Guidance, each of these scenarios is calculated to have offsite impacts. More credible scenarios, called alternative release scenarios (ARSs), were also analyzed.\n\nAs required by the RMP Rule, we chose hypothetical ARSs that are severe enough to have effect beyond our fenceline. The selected ARSs are highly unlikely scenarios of the type our RM Program protects against. Our ARSs involve overfilling a storage vessel during the transfer of raw materials (flammables, or a mixture containing chloroform, acrylonitrile, or vinyl acetate) from the delivery vehicle. The spill accumulates in the vessel catch basin and begins to evaporate resulting in the production of vapor which, based on the use of EPA modeling tools, is predicted to have impact beyond our fenceline. The scenarios involving a chloroform mixture, a vinyl acetate mixture, or flammables are assessed to have effect up to 176 yards from the storage tank which may impact our industrial neighbor, but would not reach members of the public. The scenario involving an acrylonitrile mixture is assessed to have effect up to 352 yards from the storage tank, which would not reach any residences. These scenarios are extremely unlikely since the storage tanks are equipped with high level alarms. Even in the unlikely event that these alarms failed, operators are required to be present throughout the waste unloading process and would respond immediately to signs of a spill by shutting down the unloading transfer.\n\nWe expect scenarios such as these ARSs to continue to be highly hypothetical and unlikely due to our ongoing program of risk management."
    }
  ]
}