{
  "FacilityID": 18887,
  "FacilityName": "The Ensign-Bickford Company - Graham, KY",
  "FacilityStr1": "Highway 171",
  "FacilityStr2": null,
  "FacilityCity": "Graham",
  "FacilityState": "KY",
  "FacilityZipCode": "42344",
  "Facility4DigitZipExt": "0130",
  "FacilityCountyFIPS": "21177",
  "LEPC": "Muhlenberg LEPC",
  "FacilityLatDecDegs": "37.239167",
  "FacilityLongDecDegs": "-87.295",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 61557054,
  "ParentCompanyName": "Ensign-Bickford Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 58509654,
  "Company2DUNS": 0,
  "OperatorName": "The Ensign-Bickford Company",
  "OperatorStr1": "P.O. Box 130",
  "OperatorStr2": null,
  "OperatorCity": "Graham",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42344",
  "OperatorZipCodeExt": "0130",
  "FTE": 100,
  "OtherEPAFacilityID": "42344THNSGSTATE",
  "EPAFacilityID": "100000083429",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-19 00:00:00",
  "SafetyInspectionBy": "Department of Defense",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.23917,
  "FRS_Long": -87.295,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26586,
      "AltID": "Nitration",
      "FacilityID": 18887,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 34574,
          "ProcessID": 26586,
          "ChemicalID": 58,
          "Quantity": 280000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27268,
          "ProcessID": 26586,
          "NAICSCode": "32592",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14628,
              "Process_NAICS_ID": 27268,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "PHA_Date": "1999-06-15 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Visual Inspections",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-10 00:00:00",
              "TrainingReviewDate": "1998-11-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "tanks and pumps",
              "ChangeMgmtDate": "1998-08-28 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-22 00:00:00",
              "PreStartupReviewDate": "1999-04-10 00:00:00",
              "ComplianceAuditDate": "1998-05-18 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": "1998-12-22 00:00:00",
              "InvestigationChangeDate": "1998-12-23 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-12 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "PREVENTION PROGRAM SUMMARY\n\nThe Ensign-Bickford Company, Graham, KY\n\n\n1 INTRODUCTION\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address key features of a successful accident prevention program such as:\n7 Process safety information (PSI)\n7 Process hazard analysis\n7 Operating procedures\n7 Training\n7 Mechanical integrity\n7 Management of change\n7 Pre-startup review\n7 Compliance audits\n7 Incident investigation\n7 Employee participation\n7 Hot work permit\n7 Contractors\n\nThese individual elements of our accident prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n2 PROCESS SAFETY INFORMATION\n\n\nIn accordance with Section 68.65 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(d)), we systematically control the creation, updating, and retention of written documentation associated with our process chemicals, process technology, and process equipment. This information is essential for supporting all of the other elements of our risk management program and supports our ISO9002 certification.  We also use this information directly to ensure that our equipment is suitable for its intended use.\n\n2.1     Process Safety Information Details\nWe maintain the following chemical process information for each regulated substance in a RMP covered process as well as for other hazardous materials in both covered and noncovered processes:\n7 Toxicity information\n7 Permissible exposure limits\n7 Physical data\n7 Reactivity data\n7 Corrosivity data\n7 Thermal and chemical stability data\n \n We use material safety data sheets (MSDSs) to provide most of the process chemical information.  Whenever required information, such as corrosivity data is not available in MSDSs, we utilize other reference materials such as; Dangerous Properties of Industrial Materials by Irving Sax, and The Merck Index to obtain the necessary information.\n \n We maintain the following required process technology information: \n7 Block flow or simplified process flow diagram\n7 Process chemistry\n7 Maximum intended inventory\n7 Safe upper and lower limits for parameters such as temperature, pressure, flow, or composition\n7 Evaluation of the consequences of deviations from established operating limits\n \n Most of this information comes from the engineering design documents for the processes, but in some cases, we have developed such information through special projects.  Additionally, operating limits, maximum intended inventories, and consequences of deviations not available from engineering design documentation were developed as part of PHAs.\n \n We also maintain the following information pertaining to equipment in our RMP regulated processes (as well as for many of our non-RMP regulated processes):\n7 Materials of construction\n7 Piping and instrument diagrams (P&IDs)\n7 Electrical classification\n7 Relief system design and design basis\n7 Ventilation system design\n7 Design codes and standards employed\n7 Safety systems (interlocks, detection, or suppression systems)   \n\nAgain, most of this information comes from the engineering design documents for the processes as well as from our own maintenance files.  Whenever required information was not available, we obtained the information from equipment vendors, process designers, plant engineering, and/or research and development departments.  In conjunction with our equipment information collection efforts, EBCo has evaluated the existing design against appropriate safety criteria and determined that the equipment is designed, maintained, inspected, tested, and operated in a safe manner.\n\n3 PROCESS HAZARD ANALYSIS\n\nIn accordance with Section 68.67 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(e)), we use process hazard analyses (PHAs) to systematically identify, evaluate, and control process hazards.  The most important products of our RMP process PHA are recommendations for reducing the most significant risks of accidental chemical releases.  All recommendations from our PHAs are resolved and the information from those PHAs (including recommendation resolutions) is communicated to potentially affected employees.\n\n3.1     Process Hazard Analysis Details\nWe conducted systematic PHAs of our RMP regulated process and other hazardous processes at our facility according to an established schedule.  This schedule ensured that we addressed each process in a prioritized order (based on the extent of process hazards, the number of potentially affected employees and/or offsite population, the age of the process, and the operating history of the process).  EBCo updates/revalidates each PHA at least every five years.  We also conduct PHAs of new processes before those processes are placed in service.  \n\nWe primarily use the \"What If\" technique provided in PHAWorks. software developed by PrimaTech, an industry recognized Process Safety Management consultant, to perform PHAs, although we may use other EPA/OSHA approved techniques if they are more appropriate for specific applications.  Our PHA's include the following:\n7 Hazards of the process\n7 Identification of any previous incident that had a potential for catastrophic consequences\n7 Engineering and administrative controls applicable to the hazards and their interrelationships\n7 Consequences of failure of engineering and administrative controls\n7 Stationary source (plant) siting\n7 Human factors\n7 Qualitative evaluation of a range of the possible safety and health effects of failure of controls\n\nOur PHA teams are composed of personnel with engineering and process operating experience, including at least one person who has knowledge and experience in the process to be evaluated and a PHA team leader trained in the application of the hazard evaluation technique used for the PHA. \n\nWe have a system in place to resolve PHA team findings and recommendations, and we communicate findings/recommendation resolutions to potentially affected personnel.   PHAs are implemented in a written report for each analysis after the analysis meetings are completed.  We review and resolve the PHA recommendations after receiving the report.  We maintain a written action plan tracking the resolution status of each recommendation, including an individual responsible for resolving each recommendation and a target completion date. We document the final resolution of each recommendation.\n\n4 OPERATING PROCEDURES\n\nIn accordance with Section 68.69 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(f)), we use process specifications, work instructions and checklists to define how process-related job tasks assigned to our personnel should be performed to avoid incidents.  We use these process specifications, work instructions and checklists to (1) train our employees/contractors before they perform tasks in the field, (2) serve as reference guides for personnel performing tasks, and (3) specify what to do if a process upset or operating emergency occurs.\n\n4.1     Operating Procedure Details\nOur process engineers, operators, and shift supervisors work together to develop and maintain our process specifications for all phases of operations including:\n7 Initial startup\n7 Normal operations\n7 Temporary operations\n7 Emergency shutdown, including the conditions under which emergency shutdown is required and assignment of shutdown responsibility to qualified operators to ensure that emergency shutdown is executed in a safe and timely manner\n7 Emergency operations\n7 Normal shutdown\n7 Startup following a turnaround or after an emergency shutdown\n \n Our development teams use PSI, information from process designers/equipment manufacturers, and their own experience to create and validate the procedures. \n \n Our procedures address the following information:\n7 Steps for safely conducting activities \n7 Safe operating limits\n7 Consequences of process deviations, as well as steps required to correct or avoid such deviations\n7 Safety and health considerations including (1) properties of, and hazards presented by, the chemicals used in the process, (2) precautions necessary to prevent exposure, including engineering controls, administrative controls, and personal protective equipment, (3) control measures to be taken if physical contact or airborne exposure occurs, and (4) any special or unique hazards\n7 Safety systems and their functions\n\nIn addition to our process-specific procedures, we also develop and maintain more widely applicable safe work practices addressing issues such as lockout/tagout, confined space entry, and hot work permits.  These safe work practices apply to our employees and our contractors.  \n\nWe have a formal review process to approve procedures and changes to procedures.  Furthermore, we regularly review existing procedures, make any needed revisions, and certify the procedures as current and accurate.  We keep our procedures in locations that are readily accessible to employees who may need the procedures.\n\n5 TRAINING\n \n In accordance with Section 68.71 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(g)), we train our employees to safely perform their assigned tasks.  Our training program includes initial training as well as periodic refresher training and training updates when major process/equipment changes are made.  As part of our training, we include provisions for ensuring that employees understand the training (written tests, field demonstrations, etc.).\n \n 5.1     Training Details\n We provide our operators with initial and refresher training, which includes a general overview of the process, properties of chemicals in the process, and safety and health hazards, as well as a detailed understanding of the process operating procedures and safe work practices.  We provide initial training to new hires or newly assigned employees before they are allowed to work independently as operators.\n \n Periodically, we provide our operators with refresher training that, depending on job classification, can include operating procedure training, equipment-specific training, and/or advanced (beyond HAZCOM) chemical-specific training. Our refresher training courses emphasize process overview information, safe work practices, operating procedures, and any operating issues requested by the shift group.  Our operators were consulted at safety meetings on the frequency of refresher training, and their input is documented and considered when preparing training schedules.  \n \nAll training is accompanied by some form of evaluation to verify that our training has been understood. We use a combination of physical demonstration of skills, oral reviews, and written tests using a one-on-one format or in a group setting to evaluate the effectiveness of the training.  We review the information missed by an employee who does not pass all testing requirements, and we do not allow resumption of work until minimum testing requirements are met.\n \n All training is documented and includes the employee's name, date of training, and the length of training conducted/scheduled for that training exercise.\n \n6 MECHANICAL INTEGRITY\n\nIn accordance with Section 68.73 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(j)), we maintain the mechanical integrity (MI) of our process equipment using an inspection and testing program and a quality assurance program.  EBCo ensures that our equipment is designed and installed correctly so that it operates properly.  We train our maintenance personnel in the hazards of the process, and we also provide additional training on procedures for maintaining the ongoing integrity of our process equipment so those job tasks are performed safely.\n\n6.1     Mechanical Integrity Details\nWe consider all process-related equipment and safety systems that are critical for preventing and/or mitigating releases of regulated substances to be covered by our MI program.   Examples include:\n7 Pressure vessels and storage tanks\n7 Piping systems including valves\n7 Relief and vent systems and devices\n7 Emergency shutdown systems\n7 Controls such as monitoring devices, sensors, alarms, and interlocks\n7 Pumps\n \n Our MI program uses equipment surveillance and preventive maintenance activities to identify equipment that is deteriorating and needs repair or replacement before failure occurs.  This program also specifies the repairs (or parts replacement) needed to return deteriorated equipment to acceptable specifications.  We maintain written procedures that support our MI  program as follows:  \n7 Our plant process specifications specify functional tests that operators must perform on specific equipment, as well as procedures to remove equipment from operation for maintenance or return equipment to service following maintenance.  Also, temporary process specifications exist for continuing safe operations when certain equipment deficiencies occur.  \n7 Our standard maintenance procedures describe the methods that mechanics use to perform repairs, replacements, and installations.  \n7 Our procedures for safe work practices and safety policies specify safe practices for performing maintenance tasks such as lockout/tagout, hot work, confined space entry, line or equipment opening, and control over entry/exit for a covered facility by plant and/or contract maintenance personnel.\n7 Our inspection, test, and preventive maintenance procedures describe the methods used by mechanics to perform inspections, tests, and preventive maintenance tasks on process equipment.  These procedures follow generally accepted good engineering practices.  The equipment inspection and test frequency is conducted at scheduled predetermined intervals.  \n \n We document all inspection, test, and preventive maintenance activities including:\n7 Date of inspection, test, or preventive maintenance\n7 Person performing the activity\n7 Equipment identifier\n7 Description of the activity performed\n7 Results of the activity (including any deficiencies noted)\n\nWe identify equipment deficiencies through our inspection, test, and preventive maintenance activities or from routine operating and maintenance tasks and correct them promptly.  If we cannot immediately correct identified equipment deficiencies, we implement protective measures to ensure safe operation until repairs can be made.\n\nWe have a quality assurance program that addresses new facilities, equipment, maintenance materials, and spare parts.  Our program seeks to verify proper fabrication of new equipment, proper installation of new or repaired/replaced equipment, and use of suitable maintenance materials and spare parts in the preventive maintenance and repair tasks.\n\nOur training program uses the procedures described previously.  For example, all mechanics, maintenance supervisors, and maintenance engineers are trained on hazards associated with the chemicals used in the various processes and on safe work practices.  Our maintenance personnel also receive training on safe maintenance procedures, preventive maintenance practices, and special skills requiring craft certification. All training, as described above, occurs before employees perform tasks on any processes independently.\n\n7 MANAGEMENT OF CHANGE\n\nIn accordance with Section 68.75 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119), we evaluate and approve all proposed changes (i.e., modifications that are not replacements in kind) to covered procedures prior to implementation through our management of change (MOC) program, also referred to as Document & Data Control. This program helps ensure that inadvertent or unintended changes are prevented, that any safety and health impacts are addressed, that affected procedures are updated, and that our employees and contract employees are informed of and trained in the approved changes.  We use this review of Document & Data Control such that changes do not adversely impact employees, public safety, or the environment.\n\n7.1     Management of Change Details\nWe analyze each proposed change and confirm that:\n7 The technical basis for the change is appropriate\n7 The safety and health impacts of the change are understood and appropriate controls are in  place\n7 The procedures are modified as appropriate for the change\n7 The permissible time period is established for temporary changes\n7 The change is authorized by appropriate personnel\n\nOur Document & Data Control procedure outlines the approval process.  We use a Product Change Request Form to document the approval process.  Changes are communicated to our employees and contract employees who are affected by the change before the change is implemented.  When approved changes require updates to our process safety information and/or process specifications, we revise these documents and train employees on these changes before operations resume.  \n\n8 PRE-STARTUP REVIEW\n\nIn accordance with Section 68.77 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(i)), we perform a pre-startup review as a final check to ensure the safety of a new or modified process before it is placed in service.\n\n8.1     Pre-Startup Review Details\nWe perform pre-startup reviews on new stationary sources and on modified stationary sources when the modification is significant enough to require a change in the process safety information.  Our pre-startup review is completed before RMP regulated substances are brought into the process and only after we have confirmed that:\n7 Construction and equipment are in accordance with design specifications\n7 Safety, maintenance, operating, and emergency procedures are in place and are adequate \n7 PHAs have been performed on new stationary sources and all recommendations have been resolved\n7 MOC requirements have been satisfied for modified processes\n7 Training has been completed (and documented) for affected employees\n\nWe use a Pre-Startup Safety Review Checklist as an aid in documenting the performance of our pre-startup reviews. Our checklist contains a list of safety questions covering process considerations that must be addressed prior to startup.  The person responsible for the project or maintenance task prepares the Pre-Startup Safety Review Checklist and provides the names of the reviewer responsible for confirmation of each of the pre-startup review safety questions.  Each reviewer signs off on the title page of the final report of the PHA when satisfied that all assigned safety questions are complete and no problems exist.  All reviewers must sign off before startup can be authorized.\n\n\n9 COMPLIANCE AUDITS\n\nIn accordance with Section 68.79 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(o)), we audit our covered processes to be certain that our prevention programs are effective.  Our compliance audit program seeks to confirm that prevention program practices for the covered process are consistent with written programs, that the programs adequately address all requirements of the regulations, and that management systems are in place to ensure continued compliance.\n\n9.1     Compliance Audit Details\nWe conduct and certify compliance audits of the prevention programs for RMP covered processes at least every three years.  We integrate these audits into PSM audits.  Our audit teams consist of a team leader and an appropriate number of team members based on the size and complexity of the processes to be audited.  The audit team collectively possesses the following skills and knowledge:\n7 Ability to understand the prevention program requirements of the OSHA PSM and EPA RMP regulations\n7 Capability to conduct interviews and collect audit data\n7 Capability to document audit results\n7 Knowledge of the process to be audited\n\nOur audit team members receive training in regulatory requirements, interview techniques, and methods for data collection before participating in an audit.  They will use a protocol or a checklist that contains a series of questions that systematically address each requirement of the prevention program regulations.  The team leader assigns each auditor specific elements to cover in the audit.  Information obtained through field observations, interviews, and document reviews is documented, and weaknesses or noncompliances are identified.  At the conclusion of the audit, our audit team prepares a report that identifies any specific items that need to be addressed.\n\nWe have a Product Center-Manager of Safety, Health and Environmental that reviews the audit findings, determines an appropriate response for each finding, assigns responsibility for implementation of a recommended action, and assigns a target completion date.  The recommended actions are placed in a tracking system and progress is monitored until open issues are resolved.\n\n10 INCIDENT INVESTIGATION\n\nIn accordance with Section 68.81 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(m)), we perform incident investigations to help ensure that incidents with catastrophic magnitude or potential are thoroughly investigated, root causes are identified and corrected, and relevant findings are communicated throughout our organization to help prevent a recurrence.\n\n10.1     Incident Investigation Details\nWe investigate all incidents that result in, or could reasonably have resulted in, a large uncontrolled release of a regulated substance, serious injuries to our employees or the public, and/or damage to the environment.  We train our employees to identify occurrences requiring investigation and to notify the appropriate person should such an event occur. If the incident meets the above criteria, we initiate an investigation within 48 hours.  We assemble an investigation team consisting of:\n7 At least one person knowledgeable in the process or activity involved\n7 A contract employee if the incident or near miss incident involved the work of a contractor or had acute, adverse health effects on contract employees\n7 Others with appropriate knowledge and skills to thoroughly investigate and analyze the event\n \n The investigation team follows a written investigation protocol that addresses the key steps of fact finding, determination of cause, and development of recommendations/actions to be taken.  From the raw data collected, the incident investigation team prepares the text for an incident summary report, which contains:\n7 Date and time of the event\n7 Date and time the investigation started\n7 Description of the event\n7 Identification of contributing factors\n7 Recommendations from the investigation\n\nWe resolve the report recommendations and develop action plans that are tracked to completion. We review the incident investigation report and action plan items with employees (and contract employees, as appropriate) who work in the affected area and/or perform job tasks relevant to the investigation findings. We accomplish this review by routing a copy of the approved report to potentially affected employees (and contract employees) and by discussing the event at the next safety meeting.  Incident investigations are also discussed at tiered risk management meetings.  We retain incident reports permanently.\n\n11 EMPLOYEE PARTICIPATION\n \n In accordance with Section 68.83 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(c)), our employee participation plan helps ensure that all employees have appropriate involvement in developing and implementing our prevention programs.\n \n 11.1     Employee Participation Details\n We have a written employee participation program that meets PSM/RMP requirements.  In this document, we describe the many different ways that employees participate in each element of the prevention program. We periodically update this document as changes occur.\n \n We consult with the employees and their representatives on ways to improve participation.  Periodically, in our safety meetings, we review results of PHAs and resolutions of their recommendations.\n \n\n12 HOT WORK PERMITS\n \n \n In accordance with Section 68.85 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(k)), we use our hot work permit program to ensure that OSHA's fire prevention and protection precautions, specified in 29 CFR 1910.252(a), are in place before hot work (work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operation) begins on or near an RMP-covered process.\n \n 12.1     Hot Work Permit Details\n We studied OSHA's fire prevention and protection regulation 29 CFR 1910.252(a) and developed a procedure that addresses these requirements.  We also created a Hot Work Permit Form to document job requirements, the dates for the hot work, and the object on which the work is to be performed.  Hot work permit forms are retained for a period of one year.\n \n13 CONTRACTORS\n\nIn accordance with Section 68.87 of the RMP rule and consistent with OSHA's PSM program (29 CFR 1910.119(h)), we have a contractor screening procedure to help ensure that we hire and use only contractors who accomplish the desired job tasks without compromising the safety and health of our plant employees, the public, or the environment.\n\n13.1     Contractor Details\nWe have a detailed contractor safety program that applies to contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process.  This program does not apply to contractors providing incidental services that do not influence process safety.\n\nWe provide a safety orientation for Contractor Supervisors before they begin work on site.  (We require these Contractor Supervisors to provide this same safety orientation to their employees who will work in our plant.)  We use the orientation meeting to familiarize contractors with the type of operations and associated hazards in the areas in which they will be working. We provide copies of our Safety Rules, Regulations and Procedures for Contract Employers and Contract Employees, which contains plant safety rules/policies, safe work practices, a material hazards summary, and an outline of emergency actions for contractors.  We make available MSDSs for our hazardous materials that may affect the contractor work area, copies of plant safe work practices and policies, and emergency response actions associated with the contractor's work.  \n\nWe require our contractors to perform the following tasks to help ensure process safety:\n7 Train each of their employees in the work practices necessary to safely perform the contracted work\n7 Provide each of their employees with the same safety orientation that we provide for contractors and supervisors\n7 Train each of their employees on our plant's safe work practices\n7 Document that each of their employees has received and understands the training noted above \n7 Ensure that each of their employees follows our plant safety rules and safe work practices \n7 Report to our staff any hazards created or found by their employees at the job site\n7 Provide access and responses to our personnel who may appear at the job site to evaluate contractor safety performance\n7 Provide information on contract employee job site injuries/illnesses to our designated representative",
              "_chemicals": [
                {
                  "PrimaryKey": 21133,
                  "PreventionProgram3ID": 14628,
                  "ProcessChemicalID": 34574
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18887,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-20 00:00:00",
    "ERTrainingDate": "1999-01-28 00:00:00",
    "CoordinatingAgencyName": "Muhlenberg County LEPC",
    "CoordinatingAgencyPhone": "5023383902",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18887,
      "SummaryText": "EXECUTIVE SUMMARY\nThe Ensign-Bickford Company - Graham, KY\n\n1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt The Ensign-Bickford Company, Graham, KY, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n7 A description of our facility and use of substances regulated by EPA's RMP regulation\n7 A summary of results from our assessment of the potential offsite consequences that could be associated with accidental chemical releases\n7 An overview of our accidental release prevention programs\n7 A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n7 An overview of our emergency response program\n7 An overview of planned enhancements at the facility to further prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n7 The certifications that EPA's RMP rule requires us to provide\n7 The detailed information (called data elements) about our risk management program\n\n2  STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility consists of four distinct operations: the nitration plant, the detonating cord plant, the plastic bonded explosives (PBX) plant, and the multiple reaction facility (MRF).  Our nitration facility produces pentaerythritoltetranitrate (PETN).  The detonating cord plant produces cords containing PETN, cyclotrimethylene trinitramine (RDX) and other secondary high explosives.  The PBX plant produces plastic bonded explosive products in various configurations (sheet, cord, cutting tapes, etc.) for both commercial and mili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18887,
      "SummaryText": "tary applications.  The MRF is designed to manufacture or process a wide variety of materials, generally in low-to-moderate quantities.\n\nIn our processes, we may have on site the following chemicals, in quantities greater than the RMP threshold amount, that EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release:\nToxics\nNitric Acid (concentration greater than 80%)\nFlammables\nNone\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\n3  KEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPA's RMP rule requires that we provide information from our study of the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-Case Release Scenario - Regulated Toxic Chemicals\n\nWe have reviewed our process and have determined our worst-case release scenario is represented by a catastrophic failure caused by a detonation which releases the entire contents of the nitric acid (concentration > 80%) storage tank (located near the processing area).  The maximum volume of nitric acid (concentration > 80%) storage tank is 9,500 gallons, however the maximum quantity that could potentially be stored in this tank is 6,650 gallons.  This maximum inventory is administered by administrative controls and high level alarms.  The quantity of nitric acid that would be released under this scenario is 83,000 pounds.  The worst-case scenario assumes, for purposes of this study, the entire contents of the vessel is instantly released followed by volitization into the air.  The worst-case release dispersion is required to be evaluated at wind speeds of "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18887,
      "SummaryText": "1.5 meters per second (3.3 miles per hour) and at an atmospheric stability class F.  Only passive mitigation measures (i.e. those measures that function without human, mechanical, or other energy input), such as dikes, may be considered to operate to minimize the effects of the release.  Given the constraints of the worst-case scenario, the estimated exposure distance, as determined using EPA's RMP Offsite Conssequence Analysis Guidance, is 7.9 miles.\n\nThe Ensign-Bickford Company utilizes both active and passive mitigation systems to limit the potential for a catastrophic event such as this to occur.  Our active mitigation systems, which were not used in determining the worst-case scenario, include routine inspections of storage vessels for evidence of structural defects before a release occurs; managerial and inventory controls that limit the frequency of deliveries of concentrated nitric acid; trained in-house emergency response teams equipped with personal protective equipment that can respond to a release and neutralize the released acid; and on-site equipment that can be employed to create dams, dikes and berms that can contain the potential spread of released material and improve neutralization and recovery efforts.\n\nAlternative Release Scenario - Regulated Toxic Chemicals\n\nThe RMP Rule also requires a facility to evaluate alternative release scenarios.  These scenarios involve a study of an event, which would be more likely to occur than the worst-case scenario, and must produce an endpoint off-site.  These scenarios may include: transfer hose releases due to splits or sudden hose uncoupling; failures at flanges joints, or welds; vessel over flow and spill or overpressurization; and shipping container mishandling or breakage.  Although several alternative release scenarios were evaluated, none of the scenarios could produce an off-site endpoint.  Due to the distance to the nearest public receptor (approximately 4000 feet) an alternative scenario which produce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18887,
      "SummaryText": "d an off-site endpoint would have to release atleast 1,000 gallons.  A release of 1,000 or more is more likely to be a catastrophic release than a reasonable alternative release scenario.\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nWorst-Case Release Scenario- Regulated Flammable Chemicals\nNot Applicable   \nAlternative Release Scenario - Regulated Flammable Chemicals\nNot Applicable   \nThe Ensign-Bickford Company does not store any RMP regulated flammable chemicals over threshold quantities.\n\n4 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe maintain a number of programs to help prevent accidental releases and provide safe operation.  The accident prevention programs in place include:\n  + Process Safety Management\n        - Written Process SpecificationsProcess Hazard Analysis\n        - Training\n        - Employee Participation\n        - Compliance Audits\n   + Active and Passive Mitigation Systems\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n5 FIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  The Ensign-Bickford Company has had 0 accidental releases of nitric acid in volumes greater than 5 gallons over the past five years.  None of the accidents have resulted in either:\n7 Deaths, injuries, or significant property damage on-site, or\n7 Deaths, injuries, evacuations, shelterings-in-place, property damage, or environmental damage offsite.\n\n\n6 EMERGENCY RESPONSE PROGRAM\n \n We maintain a site-specific Emergency Action Plan, which c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18887,
      "SummaryText": "onsolidates the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we have established coordination for emergency response and provided copies of our plan to local and county fire departments, medical facilities, police and public works. \n \n7 PLANNED FACILITY ENHANCEMENTS\n\nThe Ensign-Bickford Company regularly reviews, and audits its RMP covered process to minimize the potential for accidental chemical releases, with modifications being made as needed.  The following are some of the physical and organizational enhancements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n7 Increasing the dike capacity to completely contain contents of nitric acid process storage tank\n7 A review of emergency response equipment, including personal protective equipment, and neutralization materials, to improve response time to potential nitric acid releases.\n\n8 CERTIFICATIONS\n \n The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true accurate, and complete.\n \n Signature\n Title\n Date\n \n9 RMP DATA ELEMENTS\n\nThe following pages present additional information about our risk management program that EPA's RMP rule has asked us to provide.  This information is categorized as follows:\n\n7 Registration\n7 Offsite Consequence Analysis\n7 Five-year Accident History\n7 Prevention Program\n7 Emergency Response"
    }
  ]
}