{
  "FacilityID": 18885,
  "FacilityName": "Consumers Pa. Water Company - Roaring Creek",
  "FacilityStr1": "204 East Sunbury Street.",
  "FacilityStr2": null,
  "FacilityCity": "Shamokin",
  "FacilityState": "PA",
  "FacilityZipCode": "17824",
  "Facility4DigitZipExt": "9741",
  "FacilityCountyFIPS": "42097",
  "LEPC": "Northumberland County LEPC",
  "FacilityLatDecDegs": "40.820833",
  "FacilityLongDecDegs": "-76.495833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7917222,
  "ParentCompanyName": "Philadelphia Suburban Corporation",
  "Company2Name": null,
  "CompanyDUNS": 8341648,
  "Company2DUNS": 0,
  "OperatorName": "Consumers Pa. Water - Roaring Creek",
  "OperatorStr1": "204 E. Sunbury St.",
  "OperatorStr2": null,
  "OperatorCity": "Shamokin",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17872",
  "OperatorZipCodeExt": "4859",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082901",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.7932,
  "FRS_Long": -76.5537,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26584,
      "AltID": null,
      "FacilityID": 18885,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 34572,
          "ProcessID": 26584,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27266,
          "ProcessID": 26584,
          "NAICSCode": "325181",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14627,
              "Process_NAICS_ID": 27266,
              "SafetyReviewDate": "1999-02-16 00:00:00",
              "PHA_Date": "1999-04-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-03 00:00:00",
              "TrainingReviewDate": "1999-04-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-12 00:00:00",
              "EquipmentInspectionDate": "1999-04-15 00:00:00",
              "EquipmentTested": "leak detectors",
              "ChangeMgmtDate": "1999-03-30 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-22 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-22 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21132,
                  "PreventionProgram3ID": 14627,
                  "ProcessChemicalID": 34572
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18885,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Northumberland County LEPC",
    "CoordinatingAgencyPhone": "5709884539",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18885,
      "SummaryText": "Consumers Pennsylvania Water Company                                                                                  May 26, 1999\nRoaring Creek Division\n204 E. Sunbury St.\nShamokin Pa. 17872\n\n\n\nEXECUTIVE SUMMARY FOR RISK MANAGEMENT PLAN\n\n\n    Consumers Pennsylvania Water Company - Roaring Creek Division, owns and operates a water treatment and filtration facility along Route 54, Bear Gap, east of Elysburg, Pennsylvania. The plant takes raw water from three reservoirs, treats it chemically, and passes it through a clarification and filtration process.  Our mission in operating this water treatment plant is to maintain public health by providing our customers with drinking water that is free of pathogens and meets or exceeds all federal and state regulations. This involves the use of chemicals, one being chlorine gas which is used as a disinfectant to \"inactivate\"  microbial organisms that may be  found in drinking water supplies.  As important as chlorine is to protecting the health of the public for drinking water, it can also be very hazardous to the public if an accidental release should occur.\n\n    The EPA has regulated many hazardous chemicals to prevent or minimize the impact of accidental releases of these substances. Of  these hazardous chemicals chlorine is the only one that the Roaring Creek Water Treatment Facility stores and handles. Because the treatment facility stores chlorine in excess of the EPA's threshold quantity of 2500 pounds, it is required to develop a Risk Management Program (RMP) and submit its plan to the EPA for approval. In accordance with the EPA's Risk Management Program the company has documented a \"Management System\" that identifies responsibilities of company personnel and their dedication to the program to minimize any risk to the public from this hazardous substance. The Risk Management Program requires the company to list any incidents that have occurred within the last 5 years. Consumers Pennsylvania Water Company - Roaring Creek Divi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18885,
      "SummaryText": "sion has never had an accidental release of chlorine gas that has caused serious injury or evacuation of the general public.\n\n    To comply with the Risk Management Program (RMP), the company has identified the key personnel responsible for specific requirements, completed a hazard assessment, a prevention program, and an emergency response plan and submitted the necessary information to the EPA.       \n\n    The Hazard Assessment was performed to estimate the potential impact of a \"worst case\" and  \"alternative\" release scenario and compile a 5-year accidental release history. As previously mentioned there have been no incident of an accidental release in the last 5 years at its facility. The company contracted an independent engineering firm to determine the severity and the population affected at different release scenarios if an incident should occur. The firm, CH2MHill, compiled the data pertaining to the location of the facility, normal weather conditions, wind speeds, passive mitigation that the plant provides and the impact of different release types. \n\nThe worst case scenario assumes the entire release of a full one-ton cylinder over a period of ten minutes. This unlikely occurrence would impact a radius of 1.4 miles from the plant and a population of approximately 50 people. A mitigation factor of 0.55 was used and assumes the building doors are closed and the exhaust fans in the chlorine storage area are inactivated so the released chlorine is enclosed within the building. The company realizes the importance of this scenario and, therefore, provides the necessary training to its operators to provide for the safe handling and maintenance of the overall chlorination system. Written \"standard operating procedures\" (SOP's) are followed and no work is performed without proper notification to the plant supervisor, a standby operator to assist in the work and a thorough inspection of that completed work by the supervisor. \n\n    The alternative release scenario assumes a p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18885,
      "SummaryText": "inhole leak has occurred in the gas piping system. This scenario would result in a much lower release rate and impact approximately 10 people within a 0.10 mile radius of the facility. By performing daily inspections of the system and utilizing the maintenance schedules developed under the RMP, the likelihood of an occurrence is reduced. Both the chlorine storage and feed areas have leak detection equipment installed to alert the operator of a release so he can follow the appropriate procedures in a manner to insure his own safety and the safety of the public. \n\n    The Prevention Program is the most comprehensive section of the RMP and includes Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Mechanical Integrity, Management of Change, Pre-Startup Review, Compliance Audits, Incident Investigation, Employee Participation Plan, Hot Works Permit and Contractors. In addition we fall under the federal OSHA regulations and follow guidelines provided by our chlorine supplier and AWWA resources. The use of different training programs, videos, and seminars are used to insure the operator receives adequate training, which includes hands on handling of one ton cylinders and the chlorination system. \n\n    The Emergency Response Plan has been updated to comply with the Risk Management Program. The company has written policies concerning chain of command,  communications, evacuations and action levels to be taken. The establishment of good working conditions with local fire departments and emergency management people and using their expertise in handling an incident should one occur is the main force behind our emergency response plan. Training, again, is one of the most important aspect of developing an effective emergency response plan which can significantly reduce the risk to the operator and the public should a release occur. \n\n    The treatment facility has been in operation four years and the original design includes many provisions to further r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18885,
      "SummaryText": "educe the possibility of a release occurring. Automatic switchover from empty to full cylinders reduces operator exposure at a critical time when chlorine needs to be fed. All alarms at the chlorine site automatically send a signal to the facility's computer system thereby notifying the operator of a potential problem. The training received during plant startup was an excellent tool for properly maintaining the system in a safe manner. Of course, refresher training is always a priority at the water treatment plant.\n\n   \n    In summary, Consumers Pennsylvania Water Company - Roaring Creek Division takes great pride in its history of handling chlorine safely. The development of the Risk Management Program will certainly compliment that achievement and insure even safer handling of this chemical in the future."
    }
  ]
}