{
  "FacilityID": 18962,
  "FacilityName": "Carolina Turkeys",
  "FacilityStr1": "1628 Garner's Chapel Road",
  "FacilityStr2": null,
  "FacilityCity": "Mount Olive",
  "FacilityState": "NC",
  "FacilityZipCode": "28365",
  "Facility4DigitZipExt": "0589",
  "FacilityCountyFIPS": "37061",
  "LEPC": "Duplin County LEPC",
  "FacilityLatDecDegs": "35.14275",
  "FacilityLongDecDegs": "-77.912583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.carolinaturkeys.com",
  "FacilityEmailAddress": "cturkeys@carolinaturkeys.com",
  "FacilityDUNS": 122262280,
  "ParentCompanyName": "Maxwell Farms",
  "Company2Name": "Carroll's Foods Processing",
  "CompanyDUNS": 555944073,
  "Company2DUNS": 24847444,
  "OperatorName": "Carolina Turkeys",
  "OperatorStr1": "P.O.Box 589",
  "OperatorStr2": "1628 Garner's Chapel Road",
  "OperatorCity": "Mount Olive",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28365",
  "OperatorZipCodeExt": "0589",
  "FTE": 2353,
  "OtherEPAFacilityID": "NCD122262280",
  "EPAFacilityID": "100000127542",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "578T03",
  "SafetyInspectionDate": "1999-04-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Poultry Processing with ammonia refrigeration",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.142302,
  "FRS_Long": -77.912458,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26679,
      "AltID": "Ammonia Refrigeration sys",
      "FacilityID": 18962,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34678,
          "ProcessID": 26679,
          "ChemicalID": 56,
          "Quantity": 119686.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27366,
          "ProcessID": 26679,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14656,
              "Process_NAICS_ID": 27366,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "PHA_Date": "1999-12-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "water dilution",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "portable test units",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "community college",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-20 00:00:00",
              "EquipmentTested": "condensers",
              "ChangeMgmtDate": "1999-04-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": "1999-04-03 00:00:00",
              "ComplianceAuditDate": "1996-10-20 00:00:00",
              "AuditCompletionDate": "1999-10-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-08 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-08 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21166,
                  "PreventionProgram3ID": 14656,
                  "ProcessChemicalID": 34678
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 26680,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 18962,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34679,
          "ProcessID": 26680,
          "ChemicalID": 56,
          "Quantity": 30775.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27367,
          "ProcessID": 26680,
          "NAICSCode": "311615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18962,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1999-06-16 00:00:00",
    "CoordinatingAgencyName": "Duplin County LEPC",
    "CoordinatingAgencyPhone": "9102962160",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18962,
      "SummaryText": "CAROLINA TURKEYS\n1628 GARNER CHAPEL ROAD\nP.O. BOX 589\nMOUNT OLIVE, NORTH CAROLINA  28365\n\n\nRISK MANAGEMENT / PROCESS SAFETY MANAGEMENT PROGRAM\n\n\nEXECUTIVE SUMMARY\n\n\nA. Describe Accidental Release Prevention and Emergency Policies\n\nCarolina Turkeys recognizes our corporate responsibility in protecting the surrounding community,its associates, property, equipment and the environment.  The safety and health of the public and all plant personnel are very important.  The control of accidents has been and will continue to be a basic responsibility of all personnel at Carolina Turkeys.\n\nTo accomplish Carolina Turkeys' goal in controlling accidental releases, the facility has blished a Company Safety & Health Program.  The objectives of the Company Safety & Health Program are to achieve maximum efficiency and safety performance by complying with the Occupational Safety & Health Administration 's (OSHA) Process Safety Management regulation and the Environmental Protection Agency's (EPA) Risk Management Program.\n\nOne of the activities associated with the Company Safety & Health Program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with OSHA's Process Safety Management (PSM) standard (29 CFR 1910.119) and EPA's Risk Management Program (RMP) regulation (40 CFR Part 68).  The Safety & Health Director and Facilities Maintenance Manager are responsible for the management of the accidental release prevention and emergency response programs.\n\nThe purpose of Carolina Turkeys' accidental release prevention and emergency response programs is to prevent the occurrence, and minimize the consequences, of significant releases of Anhydrous Ammonia as well as fires, explosions, and other types of catastrophic accidents. Overall, these programs protect the community, prevent accidents, injuries and illnesses and avoid property damage.\n\nB. Stationary Source and Regulated Substances Handled\nCarolina Tur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18962,
      "SummaryText": "keys operates a poultry (turkey) processing facility at this location in Duplin County.  It is currently the largest and most modern turkey processing plant in the United States.   Our processing includes live slaughter, as well as cooked ready-to-eat products.  We operate and maintain two industrial refrigeration systems that utilize anhydrous ammonia as the refrigerant.  These systems provide the cooling and freezing requirements to operate a food production facility under the United States Department of Agriculture (USDA) rules and regulations.  The volumes of anhydrous ammonia (CAS #7662-41-7) contained in each system totals approximately 150,000 pounds.  System #1 contains approximately 120,000 pounds and System #2 contains approximately 30,000 pounds.  Either system is over the 10,000 pound threshold limit which requires the Occupational Safety and Health's (OSHA) Process Safety Management (29 CFR 1910.119) rule and regulations to apply.  These volumes of ammonia also require the Environmental Protection Agency's (EPA) Risk Management Plan (40 CFR Part 68) Program Level 3 rules and regulations to apply.  The possibility of anhydrous ammonia releases from these systems could pose a risk of offsite public impact.\n\nSystem #1 consists of two single high stage, separate suction levels.  One suction level provides refrigeration utilizing accumulator/pump liquid equipment to circulate cold liquid ammonia through a heat exchanger to chill water for the process.  The recirculated liquid/vapor returns to be compressed to higher pressure, then condensed and returned to accumulator packages to repeat the cycle.  Also, that same system supplies cold liquid ammonia to air cooling units through the same accumulator/pump packages to cool the process rooms.\n\nThe second suction level performs in the same manner as the first except at a colder temperature and supplies cold liquid ammonia to large flooded coils for a freezing process, as well as making ice.\n\nSystem #2 consists of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18962,
      "SummaryText": "multi-stage compression equipment to supply refrigerant at four (4) different levels of pressure and temperature.  Identical equipment, as is found in System #1, is utilized for supplying the required refrigeration.  Accumulator/pump packages send cold liquid ammonia through fan/coil units to chill air to maintain cold temperatures in rooms, such as freezers, coolers, blast freezers and shipping docks.  This cold liquid ammonia returns to be compressed in the low stage compressors and is then discharged to the high stage compressors where the pressure is raised high enough so that the ammonia can be condensed back to a liquid for the repeat cycle.  The large amount of equipment, such as vessels, piping, evaporators, compressors, condensers, controls, etc. are necessary to operate a safe refrigeration system.\n\n\nC. Summary of Worst Case and Alternative Release Scenarios\nThe worst case release scenario at Carolina Turkeys involves the release of 24,628 pounds of Ammonia over a 10-minute period due to the failure of one of the high-pressure receivers.  The maximum level in each high pressure receiver is limited to 80% of the vessel capacity during pump down operations by facility procedures.  Under worst case weather conditions, Ammonia could travel 2.5 miles before dispersing below  a level in the air that would no longer pose a hazard to the community and general public.  \n\nThe worst case release scenario is unlikely for the following reasons:\n* The worst case weather conditions which were used for this scenario are uncommon;\n* Industry standards were followed for the manufacture and quality control of these receivers, as well as annual inspections;\n* Ammonia is not corrosive in this service and the vessels are relatively new;\n* Pressure safety valves limit operating pressures in these receivers and these relief valves are replaced every five years; the receivers are inspected annually, State inspected every two years;\n* Carolina Turkeys has a preventative maintenanc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18962,
      "SummaryText": "e program in place to maintain the on-going mechanical integrity of the vessels;\n* Carolina Turkeys has a training program designed to ensure that the system is operated by qualified personnel;\n* Carolina Turkeys has emergency response procedures in place which enable trained on-site personnel to respond quickly to isolate any potential releases, and;\n* The Ammonia refrigeration system is operated, manned and monitored 24 hours a day, 7 days a week by Facilities Maintenance Technicians.  These technicians are referenced above in regards to training, emergency response and preventative maintenance procedures.\n\nThe alternative release scenario at Carolina Turkeys involves the release of 15,100 pounds of Ammonia over a 25-minute period due to a forklift striking and breaking off a sight glass column on the high pressure receiver.  Under normal weather conditions, ammonia could travel 0.6 miles before dispersing below  a level in the air that would no longer pose a hazard to the community and general public.\n\nThe alternative release scenario is unlikely for the following reasons:\n* Industry standards were followed for the manufacture and quality control of this piping and equipment;\n* Ammonia is not corrosive in this service;\n* Carolina Turkeys has a preventative maintenance program in place to maintain the on-going integrity of the system;\n* Carolina Turkeys has a training program designed to ensure that the system is operated by qualified personnel;\n* Carolina Turkeys has emergency response procedures in place which enable trained on-site personnel to respond quickly to isolate any potential releases, and;\n* The Ammonia refrigeration system is operated, manned and monitored 24 hours a day, 7 days a week by Facilities Maintenance Technicians. These technicians are referenced above in regards to training, emergency response and preventative maintenance procedures.\n\nD. Description of the Accidental Release Prevention Program:\n\nThe prevention program consists of the follo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18962,
      "SummaryText": "wing elements:\n\n* Employee Participation:  This program involves the associates in establishing and implementing the program.  Associates are also to be involved when a process hazard analysis is conducted.  The program also ensures that all associates have complete access to the program.\n\n* Process Safety Information:  Written information has been collected which enables the associates to identify and understand the potential hazards in the systems.  The written information includes the Ammonia MSDSs and a description of the design of the Ammonia refrigeration systems.\n\n* Process Hazard Analysis:  Formal studies using the What-If Technique have been conducted to look at the systems and identify potential hazards.\n* Operating Procedures:\tWritten, detailed procedures have been developed which describe the steps which should be followed to safely operate the Ammonia refrigeration systems.\n\n* Training:  A training program is in place which ensures that associates are trained on all aspects of the systems and on the duties which they should perform to ensure the safe operation of the Ammonia refrigeration systems.  Facilities Maintenance Technicians are required to have certifications, licenses, specialized training through the International Institute of Ammonia Refrigeration (IIAR) and the Refrigeration Engineers and Technicians Association (RETA) to operate these Ammonia refrigeration systems.\n\n* Contractors:  All contractors are screened and evaluated before they perform work on or near the Ammonia refrigeration systems.  The contractors are also periodically evaluated to ensure that they perform work by following safe work practices.  Only recognized industrial Ammonia refrigeration contractors are allowed to design and/or perform maintenance and repair on the Ammonia refrigeration systems.  In addition, all contractors are required to participate in an on-site safety orientation class prior to initiating any work at the facility.\n\n* Pre-Startup Safety Review:  A"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 18962,
      "SummaryText": "pre-startup safety review is completed for all new Ammonia projects to verify that all safety programs are in place, training has been performed, and construction has been completed according to design standards before the project is put into use.\n\n* Mechanical Integrity:  This program ensures that the Ammonia refrigeration systems are built and maintained using preventative maintenance procedures to minimize unexpected breakdowns or failures.\n\n* Hot Work Permit:  These procedures ensure that a signed permit is obtained prior to any cutting, welding, or burning on or immediately near the Ammonia refrigeration systems.\n\n* Management of Change:  The procedures are designed to ensure that all changes made to the Ammonia refrigeration systems are properly reviewed.\n\n* Incident Investigation:  The procedures ensure that any incidents (and near misses) are investigated, reviewed and documented using an investigative team.\n\n* Compliance Audits:  There are procedures to conduct regular audits of the program to ensure that the program is in place and working properly.  Outside third party compliance audits are conducted every three years.\n\nE. Five-Year  Accident History\n\nNo Ammonia-related incidents, as defined by ** EPA's Risk Management Program regulation, which resulted in significant onsite or offsite consequences were identified for Carolina Turkeys in the previous 13-year history.\n\n   **NOTE:  EPA's requirement for this subpart is defined in 40 CFR Part 68.42 as the following:\n\n            The owner or operator shall include in the five-year accident history all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nF.  Description of the Emergency Response Program\n\nAn emergency response program has been implemented at Carolina Turkeys.  This program contains procedures describing how the facili"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 18962,
      "SummaryText": "ty will respond to Ammonia spills and other emergencies, including evacuation procedures.  The program is being forwarded to the Duplin County Local Emergency Planning Committee (LEPC) for incorporation into their own Emergency Response Program. In addition, the local Fire and Rescue departments, having jurisdiction, will be forwarded the Emergency Response Program as well.  Also, Carolina Turkeys' Emergency Response Program includes references to the mutual aid agreements between Duplin County with Wayne, Lenoir and Sampson. \n\n\nThe emergency response program consists of the following elements:\n\n* Organization Plan and Responsibilities\n* Communications Procedures\n* Detailed Action Plans\n* Fire Response Procedures\n* Emergency Medical Treatment Procedures\n* Evacuation Plans\n* Description of Outside Assistance Available\n* Site Re-Entry Procedures\n* Training Programs and Drills\n\nG.  Planned Changes to Improve Safety\n\nDue to audits, reviews, etc., we continue to improve and make changes to the Ammonia refrigeration systems to improve and ensure the safety and health of the surrounding community, facility associates and general public."
    }
  ]
}