{
  "FacilityID": 18974,
  "FacilityName": "Super Drip Facility",
  "FacilityStr1": "5.7 Mile West of Hwy 60 and",
  "FacilityStr2": "1.5. M North of Route 3",
  "FacilityCity": "Pampa",
  "FacilityState": "TX",
  "FacilityZipCode": "79065",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48179",
  "LEPC": "Gray County LEPC",
  "FacilityLatDecDegs": "35.5125",
  "FacilityLongDecDegs": "-101.04",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 966578957,
  "ParentCompanyName": "KN Energy, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 809850316,
  "Company2DUNS": null,
  "OperatorName": "KN Energy, Inc.",
  "OperatorStr1": "Route 1",
  "OperatorStr2": "P.O. Box 115",
  "OperatorCity": "Pampa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79065",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000134865",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0-00530",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-11-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-06-09 00:00:00",
  "DeRegistrationEffectiveDate": "2016-06-06 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.512705,
  "FRS_Long": -101.042919,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source has been re-evaluated and does not meet the criteria for RMP.",
  "_processes": [
    {
      "ProcessID": 26694,
      "AltID": "NGL Drip Storage",
      "FacilityID": 18974,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 34693,
          "ProcessID": 26694,
          "ChemicalID": 155,
          "Quantity": 256383.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 25881,
              "ProcessChemicalID": 34693,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 25882,
              "ProcessChemicalID": 34693,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 25883,
              "ProcessChemicalID": 34693,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 25884,
              "ProcessChemicalID": 34693,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 25885,
              "ProcessChemicalID": 34693,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 25886,
              "ProcessChemicalID": 34693,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27382,
          "ProcessID": 26694,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 10345,
              "Process_NAICS_ID": 27382,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-01 00:00:00",
              "ChangeCompletionDate": "1999-05-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-01-18 00:00:00",
              "EquipmentTested": "Load Out Automation",
              "ComplianceAuditDate": "1999-05-01 00:00:00",
              "AuditCompletionDate": "1999-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-01-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 10834,
                  "PreventionProgram2ID": 10345,
                  "ProcessChemicalID": 34693
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 18974,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1999-05-01 00:00:00",
    "CoordinatingAgencyName": "Gray County LEPC",
    "CoordinatingAgencyPhone": "8066695820",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 18974,
      "SummaryText": "RISK MANAGEMENT PLAN\nKN Energy, Inc.\nSuper Drip Facility\nKingsmill, Texas\nPROJECT NO. 23997031\nJune 2, 1999\n1.\tExecutive Summary (40 CFR 68.155)\n\nThe Executive Summary is a brief description of the Risk Management Plan (RMP).  KN Energy, Inc. (KN) will submit the Executive Summary to a central point as specified by the Environmental Protection Agency (EPA) prior to June 21, 1999.\n1.1.\tAccidental Release Prevention and Emergency Response Policies (40 CFR 68.155(a))\n\nKN's accidental release prevention policy involves a unified approach that integrates procedures and management practices.  Applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are generally adhered to.  KN's emergency response policy involves the preparation of response plans which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.\n\nKN's spill policy seeks to implement appropriate controls to prevent accidental releases of regulated substances.  If such a release does occur, the Facility personnel are prepared to work with the local fire department, Local Emergency Planning Commission, and other authorities to control and mitigate the effects of the release.\n1.2.\tStationary Source and Regulated Substance Handled (40 CFR 68.155(b))\n\nThe primary activity at KN's Super Drip Facility, herein referenced as the stationary source and the Facility, is the handling and storage of natural gas liquids (NGL) condensate.  As part of the facility operation, natural gas liquids (NGL) are stored on site, and sold to a petroleum refiner.  The flammable regulated chemical mixture at the Facility is Natural Gas Liquid (NGL) that is an aliphatic and aromatic hydrocarbon mixture.  The flammable regulated chemicals contained in the mixture include ethane, propane, isobutane, N-butane, isopentane and N-pentane.  These regulated flammable chemicals have a regulated thresh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 18974,
      "SummaryText": "ting work.  \n1.4.5.\tCompliance Audits\n\nKN conducts audits on a regular basis to determine whether the provisions of the RMP rule are being implemented.  These audits are performed at least every 3 years as required by 40 CFR 68.  Corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n1.4.6.\tIncident Investigation\n\nKN promptly investigates any incident that has resulted in, or could have reasonably resulted in a catastrophic release of a regulated substance.  These investigations are performed to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Reports are retained for a minimum of 5 years.  \n1.5.\tFive-year Accident History (40 CFR 68.155(e))\n\nKN's Super Drip Facility has not had a reportable accident of covered processes in the five years previous to June 21, 1999, the effective date of the RMP regulation.\n1.6.\tEmergency Response Program (40 CFR 68.155(f))\n\nKN's Super Drip Facility has an Emergency Response Program that is called their Emergency Response Plan.  The Emergency Response Plan describes response procedures to minimize hazards to human health and the environment in the event of a regulated substance accidental release.  Aspects of emergency response include adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident cleanup of affected areas.  In the event of a covered process accident, first aid procedures, and procedures to inform authorities and the public are described in the Emergency Response Plan.  A general emergency practice drill is performed at least annually and includes an invitation to the local authorities.  A site map, MSDSs, and a list of chemicals kept on the site are kept at the Facility.\n1.7.\tPlanned Changes to Improve Safety (40 CFR 68.155(g)\n\nMechanical integrity checks, maintenance checks, compliance audits, management of change proc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 18974,
      "SummaryText": "edures and incident investigations will identify changes to improve safety.  KN has a continued commitment to update equipment and improve safety regarding the covered process when necessary.\n\nn:\\projects\\23997031\\SDexcsum.doc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 18974,
      "SummaryText": "old quantity of 10,000 pounds (lbs.).  The maximum inventory of NGL is 135,000 gallons, which contains an average of 461,489 lbs. of regulated flammable chemicals.  \n\n1.3.\tWorst Case Release Scenario and Alternative Release Scenario (40 CFR 68.155(c))\n\nMethodology given in the RMP Offsite Consequence Analysis Guidance by the EPA was applied using the RMP-COMP model approach to perform worst case release scenario (WCRS) and alternative release scenario (ARS).\n\nThe WCRS submitted for Program 2 flammable substances assumed the release was the total quantity of the 75,000-gallon bulk storage tank which forms a vapor cloud within the lower and upper flammability limits, and the cloud detonates.  For flammable substances, the endpoint is overpressure of 1 pound per square inch (psi) for vapor cloud explosions.\n\nUsing the flammable endpoint of 1 psi overpressure the distance to the endpoint was calculated at 0.5 miles from the Facility. \n\nAfter considering possible ARSs, a release involving a pool fire of the NGL condensate from a failure of a 2-inch steel pipe connected to the NGL condensate bulk storage tank was selected.  The ARS distance to endpoint for the above-described release was calculated at less than 0.07 miles from the Facility.\n1.4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps (40 CFR 68.155(d))\n\nKN's Super Drip Facility has taken the necessary steps to comply with the accidental release prevention requirements of 40 CFR 68.  This Facility was designed and constructed in accordance with applicable state and federal regulations as listed in the RMP.  The following sections briefly describe the elements of the release prevention program that are in place at the stationary source.\n1.4.1.\tProcess Safety Information and Hazard Review\n\nKN maintains a written Emergency Response Plan regarding safety information that describes the chemical hazards associated with regulated substances at the Facility.  Further safety inf"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 18974,
      "SummaryText": "ormation is also detailed in the RMP.  In addition, operating procedures and equipment design codes and standards associated with the operations at the Facility are maintained in the RMP at the Facility.\n\nThe Facility conducts safety inspections to identify and control the hazards associated with the process.  KN inspects the bulk storage vessels, pipes, valves, gauges, and pumps on a regular basis.  Any findings related to the hazard analysis are addressed in a timely manner.\n1.4.2.\tOperating Procedures\n\nFor the purposes of safely conducting activities at the Facility associated with regulated substances, KN maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, emergency shutdown, emergency operations, normal shutdown and startup after an emergency shutdown.  The information is reviewed as needed and is readily accessible to operators involved with the processes.\n1.4.3.\tTraining\n\nKN has an operator safety-training program in place to train employees involved in the process.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided annually and more frequently as needed.  In addition, employees not operating the process are involved in safety training on the hazards associated with the regulated substances at the Facility.\n1.4.4.\tMaintenance Procedures\n\nKN performs maintenance checks on the Facility equipment to ensure proper functions.  Qualified personnel carry out maintenance operations.  Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nWhen outside contractors are required for maintenance and construction activities, those personnel are accompanied by KN employees or are briefed by the area supervisor on the rules, regulations, and emergency procedures outlined in the Emergency Response Plan before initia"
    }
  ]
}