{
  "FacilityID": 19101,
  "FacilityName": "Coors Brewing Company, Shenandoah",
  "FacilityStr1": "5135 South East side Hwy",
  "FacilityStr2": null,
  "FacilityCity": "Elkton",
  "FacilityState": "VA",
  "FacilityZipCode": "22827",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51165",
  "LEPC": "Rockingham County LEPC",
  "FacilityLatDecDegs": "38.361389",
  "FacilityLongDecDegs": "-78.676944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 622406635,
  "ParentCompanyName": "Coors Brewing Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Coors Brewing Company",
  "OperatorStr1": "P.O. Box 25",
  "OperatorStr2": null,
  "OperatorCity": "Elkton",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22827",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Rinker",
  "RMPTitle": "EHS Representitive",
  "FTE": 413,
  "OtherEPAFacilityID": "22827DLPHCROUTE",
  "EPAFacilityID": "100000138111",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "81012",
  "SafetyInspectionDate": "1998-09-24 00:00:00",
  "SafetyInspectionBy": "Virginia DEQ",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.3567,
  "FRS_Long": -78.6764,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26850,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 19101,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27543,
          "ProcessID": 26850,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34879,
          "ProcessID": 26850,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534879,
          "ProcessID": 26850,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 26851,
      "AltID": "Chlorine Addition at WTP",
      "FacilityID": 19101,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27544,
          "ProcessID": 26851,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34880,
          "ProcessID": 26851,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534880,
          "ProcessID": 26851,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19101,
      "SummaryText": "The Coors Brewing Company (CBC) operates a beer blending, finishing and packaging facility near Elkton, Virginia (CBC Shenandoah facility).  The facility uses chlorine and ammonia.  Use of these chemicals is regulated under the Clean Air Act Amendments (CAAA), Section 112(r), and the United States Environmental Protection Agency (EPA) Accidental Release Prevention Risk Management (RM) Planning regulations (40 CFR, Part 68) herein referred to as the RM regulations.  Under the CAAA and the RM regulations, the facility is considered to be a stationary source.\n\nThis document addresses the five EPA regulatory requirements for an RM Plan which form the basis of the RM program for the Shenandoah facility.  EPA's five key regulatory requirements for an RM program are:\n\n1) Management Plan\n2) Hazard Assessment\n3) Accidental Release Prevention Program\n4) Emergency Response\n5) Risk Management (RM) Plan and Data Elements\n\nThis RM plan is based on the requirements listed above and is organized to reflect them in five sections, as summarized below.\n\nRequirement 1.  Management Plan\nThe RM Program Manager for CBC is a Senior Environmental, Health & Safety (EHS) Manager who reports to the Director, Core Environmental, Health, Safety, and Energy (EHSE), who, in turn, reports to the Vice President, Engineering and Technical Services.  The RM Program Manager is assisted by a Process Safety Management (PSM) Coordinator and an EHS representative at Shenandoah.  The PSM Coordinator is responsible for the accidental release prevention program for the ammonia refrigeration, and chlorination processes.  Utilities supervisors, maintenance supervisors, operators, engineers, and staff level personnel also execute component activities to maintain compliance with RM regulations.  At Shenandoah, individuals have been assigned responsibility for all five requirements of the RM program.\n\nReguirement 2.  Hazard Assessment\nPotential accidental releases of ammonia and chlorine were modeled to evaluate p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19101,
      "SummaryText": "ossible offsite impacts. Modeling procedures followed EPA guidance to identify worst case release scenarios (WCS) and alternate case release scenarios (ACS) as defined by the RM regulations.  EPA personnel freely admit that the assumptions used for WCS are not realistic and in some cases are not physically possible.  However, EPA guidance was followed  endpoints were identified.  The WCSs were identified by comparing the results for each process and selecting the scenario that resulted in the greatest distance to the endpoint.  The number of permanent offsite residents located inside a circle (centered on the release point with a radius equal to the endpoint) was then estimated using EPA's Landview III software (Version 1.0). This software is the approved EPA source, but inconsistencies due to approximations necessary in considering small land areas. The offsite population estimates do not include 413 CBC employees at Shenandoah.  RM Regulations require reporting of a WCS for each regulated process that could impact different offsite populations, and an ACS for each chemical. \n\nFor the group of regulated  substances (ammonia and chlorine), a release of 50,000 pounds of ammonia in 10 minutes was identified as the WCS.  This WCS would produce the greatest distance to a toxic endpoint (defined as 15 parts per million [ppm] ammonia in vapor form).  The distance to the toxic endpoint for the WCS is 4.0 miles.  An estimated population of 3,500 is located within this radius.\n\nTo develop more realistic, although conservative, estimates of offsite impacts, as required by RM regulations, several ACSs were also evaluated for the ammonia and chlorine systems.  For the toxics, the chlorine  ACS was identified for emergency response planning purposes. The alternative chlorine release scenario consists of a =-inch pipe failure.  For chlorine, in a rural environment, the distance to the  endpoint is 1.1 miles.  An estimated population of 170 is located within this radius. \n\nIn the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19101,
      "SummaryText": "past five years, none of the processes subject to RM regulations have had releases that have resulted in offsite property damage or offsite health consequences requiring medical treatment for chemical releases or fire. On-site releases have been reported to regulatory agencies as required.\n\nRequirement 3.  Prevention Program\nThe Shenandoah facility has a chemical release prevention program for each regulated process.  The prevention programs for the chlorine and ammonia processes were developed to comply with Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations (29CFR 1910.119) and have been in place since 1993.  The 12 key provisions of the release prevention program for the ammonia and chlorination processes, for which  EPA require  Program 3 prevention programs,  are as follows.\n\n- Employee Participation\n- Process Safety Information\n- Process Hazard Analysis\n- Operating Procedures\n- Contractors\n- Pre-Startup Safety Review\n- Training\n- Mechanical Integrity\n- Hot Work Permit\n- Management of Change\n- Incident Investigation\n- Compliance Audits\n\nRequirement 4.  Emergency Response \nThe emergency response program at the facility consists of personnel trained to recognize releases and immediately notify Coors Security by telephone.  Security sends a trained incident commander to the scene to assess the situation and engage the proper internal and external emergency response personnel and equipment.  When external emergency responders are needed, a joint command is then established which is led by the authority having jurisdiction (AHJ) and supported by CBC Security and CBC personnel.  The AHJ will initially be the Elkton Fire Department.  The AHJ can call additional external emergency response resources to the scene that would include the Rockingham County Hazmat team, Virginia State Police and other agencies, as needed.\n\nRequirement 5.  RM Plan and Data Elements\nThe specific data elements required to be electronically reported"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19101,
      "SummaryText": " to EPA are included in this submittal.  The data elements are supported by an RM plan which documents and provides additional detail for each RM regulatory requirement.  \n\nPlanned Improvements\nThe facility is currently verifying calculations for relief valve capacities on the ammonia refrigeration system to ensure that the basis for their sizing/selection is correct and documented.  This effort is expected to be completed in 1999."
    }
  ]
}