{
  "FacilityID": 19132,
  "FacilityName": "DPC ENTERPRISES",
  "FacilityStr1": "6051 OLD 41A HIGHWAY",
  "FacilityStr2": null,
  "FacilityCity": "TAMPA",
  "FacilityState": "FL",
  "FacilityZipCode": "33619",
  "Facility4DigitZipExt": "8786",
  "FacilityCountyFIPS": "12057",
  "LEPC": "HILLSBOROUGH COUNTY LEPC",
  "FacilityLatDecDegs": "27.890556",
  "FacilityLongDecDegs": "-82.383333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DX HOLDING COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "MIKE FRANKS",
  "OperatorStr1": "P.O. BOX 24600",
  "OperatorStr2": null,
  "OperatorCity": "HOUSTON",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77229",
  "OperatorZipCodeExt": "4600",
  "RMPContact": "JOY MONTANIO",
  "RMPTitle": "SR. REGULATORY AFFAIRS COORDINATOR",
  "FTE": 6,
  "OtherEPAFacilityID": "FLR000049791",
  "EPAFacilityID": "100000083367",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "DPC-FL",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-10-05 00:00:00",
  "DeRegistrationEffectiveDate": "2015-09-30 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.8779,
  "FRS_Long": -82.39067,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26890,
      "AltID": "Chlorine Repackaging",
      "FacilityID": 19132,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27584,
          "ProcessID": 26890,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34919,
          "ProcessID": 26890,
          "ChemicalID": 62,
          "Quantity": 450000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534919,
          "ProcessID": 26890,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 26891,
      "AltID": "Sulfur Dioxide Storage",
      "FacilityID": 19132,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27585,
          "ProcessID": 26891,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34920,
          "ProcessID": 26891,
          "ChemicalID": 49,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534920,
          "ProcessID": 26891,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19132,
      "SummaryText": "Executive Summary\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\nDPC Enterprises (DPCE) is strongly committed to employee, public and environmental safety.  \nThis commitment is demonstrated by our comprehensive accidental release prevention program \nthat covers areas such as design, installation, operating procedures, maintenance, and employee \ntraining associated with the processes at our facility.  It is our policy to comply with all \napplicable federal, state, and local regulations as well as implement appropriate controls to \nprevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, \nour highly trained emergency response personnel are at hand to control and mitigate the effects \nof the release.\n\nOur emergency response program includes procedures for notification of the local fire \ndepartment; notification of any potentially affected neighbors; and notification of local, state and \nfederal agencies.   Safety is an essential part of our operations, the safety devices built-in to the \ndesign of this facility, the safe handling procedures that we use, and the extensive training of our \npersonnel.\n\n2.    The Stationary Source and the Regulated Substances Handled\nDPCE is a 52-year-old company whose primary activities encompass distributing and \nrepackaging inorganic chemicals and compressed gases as well as manufacturing water treatment \nproducts. For example, chlorine is used to produce sodium hypochlorite commonly know as \nhousehold bleach.   We are headquartered in Houston, Texas and operate more than 20 plants \nacross the United States.\n \nWe have these regulated substances at our facility: Chlorine, and Sulfur Dioxide (anhydrous).  \nDPCE transfers and/or stores these materials in 150-lb. cylinders, and ton containers for use by \nour customers.\n\nThe maximum inventories of these substances at this facility are:\n\nChlorine  - 450,000 lbs.\nSulfur dioxide (anhydrous)  25,000 lbs.\n\n3.    The Worst Case Release Scenari"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19132,
      "SummaryText": "o(s) and the Alternative Release \nScenario(s), including administrative controls and mitigation measures to \nlimit the distances for each reported scenario\n\nTo perform the required offsite consequence analysis for our facility, we have used EPA's RMP \nGuidance for Wastewater Treatment Plants Reference Tables or Equations.  The following \nparagraphs provide details of the chosen scenarios.\n\nExecutive Summary\n\n\nThe worst case release scenario submitted for Program 3 toxic substances as a class involves a \ncatastrophic release from Chlorine repackaging.  The scenario involves releasing the entire \ncontents of a railcar in a gaseous form over 10 minutes.  This release would reach the toxic \nendpoint (0.0087 mg/l or 3 ppm) and public receptors.\n\nOne alternative release scenario has been submitted for each toxic substance present in Program \n3 processes.\n\nThe alternative release scenario for Chlorine is the failure of a = hose on the filling station in \nthe repackaging process.  This would release material in a gaseous form over 15 minutes.  It is \nassumed to be controlled by active mitigation measures that include emergency shutdown \nsystems. This release would reach the toxic endpoint (0.0087 mg/l or 3 ppm) and public \nreceptors.\n\nThe alternative release scenario for Sulfur dioxide (anhydrous) is a vessel leak.  This would \nrelease material in a gaseous form over 15 minutes.  No active mitigation systems were assumed. \nThis release would reach the toxic endpoint (0.0078 mg/l or 3 ppm) and public receptors.\n\n4.    The General Accidental Release Prevention Program and the Chemical-\nSpecific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention \nrequirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are \nsubject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to \nEPCRA Section 302 notification requirements.    The following sections briefly describe "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19132,
      "SummaryText": "the \nelements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nDPCE maintains a detailed record of safety information that describes the chemical hazards, \noperating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes \nare identified and controlled efficiently.  The methodology used to carry out these analyses is the \nWhat if/Checklist (combined).  The studies are undertaken by a team of qualified personnel with \nexpertise in engineering and process operations and are revalidated every 5 years as required or \nas necessary.  Any findings related to the hazard analysis are addressed in a timely manner. \n\n\nExecutive Summary\n\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, DPCE maintains \nwritten operating procedures.  These procedures address various modes of operation such as \ninitial startup, normal operations, temporary operations, emergency shutdown, emergency \noperations, and normal shutdown.  The information is regularly reviewed and is readily \naccessible to operators involved in the processes.\n\nTraining\nDPCE has a comprehensive training program in place to ensure that employees who are \noperating processes are competent in the operating procedures associated with these processes.  \nRefresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\nDPCE carries out highly documented maintenance checks on process equipment to ensure proper \noperations.  Process equipment examined by these checks includes among others; pressure \nvessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, \ncontrols and pumps.  Qualified personnel carry out maintenance operations with previous \ntraining in maintenance practices.  Furthermore, these personnel are offered sp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19132,
      "SummaryText": "ecialized training \nas needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a \nsafe and timely manner.\n\nManagement of Change\nWritten procedures are in place at DPCE to manage changes in process chemicals, technology, \nequipment and procedures.  Process operators, maintenance personnel or any other employee \nwhose job tasks are affected by a modification in process conditions are promptly made aware of \nand offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes \nare conducted as a regular practice at DPCE.  These reviews are conducted to confirm that \nconstruction, equipment, operating and maintenance procedures are suitable for safe startup prior \nto placing equipment into operation.\n\nCompliance Audits\nDPCE conducts audits on a regular basis to determine whether the provisions set out under the \nRMP rule are being implemented.  These audits are carried out at least every 3 years and any \ncorrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nExecutive Summary\n\n\nIncident Investigation\nDPCE promptly investigates any incident that has resulted in, or could reasonably result in a \ncatastrophic release of a regulated substance.  These investigations are undertaken to identify the \nsituation leading to the incident as well as any corrective actions to prevent the release from \nreoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nDPCE truly believes that process safety management and accident prevention is a team effort.  \nCompany employees are strongly encouraged to express their views concerning accident \nprevention issues and to recommend improvements.  In addition, our employees have access to \nall information created as part of the facilitys implementation of the RMP rule, including \ninformation resulting from process hazard analyses in part"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19132,
      "SummaryText": "icular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction \nactivities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the \ncontractor is carried out.  DPCE has a strict policy of informing the contractors of known \npotential hazards related the contractors work and the processes.  Contractors are also informed \nof all the procedures for emergency response should an accidental release of a regulated \nsubstance occur.\n\n5.    Five-year Accident History\nDPCE has had an excellent record of preventing accidental releases over the last 5 years.  Due to \nour stringent release prevention policies, there have been no accidental releases during this \nperiod.\n\n6.    Emergency Response Plan\nDPCE carries a written emergency response plan to deal with accidental releases of hazardous \nmaterials.  The plan includes all aspects of emergency response including adequate first aid and \nmedical treatment, evacuations, notification of local emergency response agencies and the \npublic, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and \nserviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place \nwithin our processes that would require a modified emergency response.\n\nThe Hillsborough County LEPC is the Local Emergency Planning Committee (LEPC) with \nwhich our emergency plan has been coordinated and verified.\n\n\nExecutive Summary\n\n\n7. Planned Changes to Improve Safety\nDPCE continues to participate in the Chlorine Institute, and continues to improve our operations.\n\n8.    Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after \nreasonable inquiry, the information submitted is true, accurate and complete.\n\nName:        Wayne Penick\n\n\nSignature: __________________________________________________                 \n\n\nT"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 19132,
      "SummaryText": "itle:        Manager  Safety, Health, and Environmental Services Department\n\n\nDate signed: ________________________________________________\n\nDPCE  TAMPA, FLORIDA\n"
    }
  ]
}