{
  "FacilityID": 19159,
  "FacilityName": "Sparks Branch Wastewater Treatment Plant",
  "FacilityStr1": "Farm to Market Road at city limits",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "TX",
  "FacilityZipCode": "75686",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48063",
  "LEPC": "Camp County LEPC",
  "FacilityLatDecDegs": "32.994417",
  "FacilityLongDecDegs": "-94.940528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Pittsburg",
  "OperatorStr1": "P.O. Box 462",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75686",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Reynolds",
  "RMPTitle": "Water Superintendent",
  "FTE": 5,
  "OtherEPAFacilityID": "TX0000463901",
  "EPAFacilityID": "100000155663",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "City of Pittsburg, Texas",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-10-05 00:00:00",
  "DeRegistrationEffectiveDate": "2004-03-31 00:00:00",
  "AnniversaryDate": "2004-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.99442,
  "FRS_Long": -94.94053,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 26931,
      "AltID": "Wastewater Treatment",
      "FacilityID": 19159,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27625,
          "ProcessID": 26931,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 34960,
          "ProcessID": 26931,
          "ChemicalID": 62,
          "Quantity": 4750.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 534960,
          "ProcessID": 26931,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19159,
      "SummaryText": "     Sparks Branch Wastewater Treatment Plant lies just outside the city limits.  A chain link fence delineates the facility's boundaries.  The site has appropriate buffers from residential areas.  The Sparks Branch Wastewater Treatment Plant remains an essential facility for the City of Pittsburg, Texas.  The plant currently treats 100% of the city's wastewater.\n\n     Wastewater treatment is the regulated process at this facility.  This facility only stores chlorine above the stated threshold quantity.  Chlorine gas disinfects the water removing any harmful microorganisms.  The use of chlorine gas for wastewater treatment results in a cost-effective method for meeting state and federal surface water discharge rules and regulations.  The plant safely stores a maximum of 4,750 pounds of chlorine.\n\n     The City of Pittsburg's water superintendent edited the written operating procedures around safety and site specific information.  In addition, all operators must have a wastewater operator's license from the Texas Natural Resource and Conservation Commission.  All employees who handle chlorine know about the dangers of chlorine and how to safely handle the gas.  Procedures for the safe handling of chlorine gas come from the Chlorine Institute.  The chief operator facilitates chlorine safety by coordinating Chlorine maintenance with the Texas Engineering Extension Service.  In addition, the small size of the plant makes it extremely easy to effectively communicate safe handling procedures. \n\n     The worst case release scenario models the complete release of a one ton container in ten minutes.  A rural environment best describes the surrounding area.  The EPA's RMP Comp Ver. 1.06 models the distance to toxic endpoint.  The release has offsite impacts.  They include hospitals, schools, residences, and public recreational areas.  However, such a release is unlikely due to several reasons.  First of all, chlorine containers are located away from busy areas and kept free f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19159,
      "SummaryText": "rom falling objects.  Second, operators use extreme caution when handling the containers.  Third, the one ton containers all have relief valves that open when the temperature exceeds a set level.\n\n     The alternative release scenario for chlorine models the failure of a 5/16 valve on the ton container.  The EPA's RMP Comp Ver. 1.06 models the distance to toxic endpoint.  The 5/16-inch valves on each of the one ton containers limit the release rate to 10.5 lbs. per minute.  The offsite impacts are residences.  The Sparks Branch Wastewater Treatment Plant applies preventative maintenance and inspections to replace any deficient parts before they become a serious problem.  The alternative release scenario aids in planning for the emergency response. \n\n     The Sparks Branch Wastewater Treatment Plant complies with the rules and regulations of the EPA RMP.  The most important preventative measure for avoiding accidental release involves the gas feed systems.  The chlorine gas feeds via gas vacuum.  The gas will cease to flow when gas tubing breaks and vacuum is lost downstream of the automatic gas switchover.  The only potential for gas escaping is the very small amount left in the <\" tubing from the automatic gas switchover to the chlorinator.  This ensures that any failure in the process equipment will cease gas flow immediately.  This helps to eliminate accidental chlorine gas releases.  A building with adequately designed ventilation systems and with firewalls separate the process area from the storage area.  In addition, gas detectors in the process area will alarm personnel that a leak has occurred and chlorine gas is present.  \n\n     All operators are trained in the written operating procedures.  Preventative maintenance procedures aid in changing out wearable parts before they fail.  For example, all gaskets are replaced after any servicing.  Routine inspections of the storage area and process area help to ensure that all valves and components are quite capable"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19159,
      "SummaryText": " of proper shut down.  The gas storage area and process are in close proximity with each other.  This allows for streamlining safety, maintenance, and inspection procedures.  The close proximity also allows for efficient inspections and increases reaction time.  The SCBA's and gas detectors are tested on a routine basis for proper function.\n\n     The City of Pittsburg, Sparks Branch Wastewater Treatment Plant has not had any accidental releases within the last five years that resulted in personal injury, property damage offsite or onsite.\n\n     This facility coordinates emergency response with the local community emergency response and relies on offsite response.  Any incidence of a chlorine chemical leak or spill subject to off-site contamination will result in a 911 call by plant personnel.  The caller will state the nature of the emergency and whether or not to contact the police and volunteer fire department and implement the community emergency evacuation plan.  In addition, the city can call in a HAZMAT team to clean up any toxic spill.  Finally, the water superintendent, being a member of the City of Pittsburg's volunteer fire department, has detailed knowledge about the facility and how to handle emergencies.       \n\n     The Sparks Branch Wastewater Treatment Plant is planning to improve safety and offsite impacts with improved safety and inspections.  Facility management encourages continuing education.  Inspections and tests procedures have been outlined and new forms exist for documentation."
    }
  ]
}