{
  "FacilityID": 19209,
  "FacilityName": "California Dairies, Inc. Turlock",
  "FacilityStr1": "475 South Tegner Road",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": null,
  "FacilityLatDecDegs": "37.491778",
  "FacilityLongDecDegs": "-120.887194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9868035,
  "ParentCompanyName": "California Dairies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "California Dairies, Inc.",
  "OperatorStr1": "475 South Tegner Road",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "CAL000172641",
  "EPAFacilityID": "100000164314",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "N-2149-0-0",
  "SafetyInspectionDate": "1999-05-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-12-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-12-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.49033,
  "FRS_Long": -120.88539,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27006,
      "AltID": null,
      "FacilityID": 19209,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 35037,
          "ProcessID": 27006,
          "ChemicalID": 56,
          "Quantity": 16600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27700,
          "ProcessID": 27006,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 14803,
              "Process_NAICS_ID": 27700,
              "SafetyReviewDate": "1999-10-26 00:00:00",
              "PHA_Date": "2001-11-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Diffusion system and ammonia detection system which activates emergency ventilation",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Engine room detectors which activate emergency ventilation system",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-11-01 00:00:00",
              "TrainingReviewDate": "1999-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-11-01 00:00:00",
              "EquipmentInspectionDate": "1999-12-03 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-11-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-11-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-11-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-11-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21333,
                  "PreventionProgram3ID": 14803,
                  "ProcessChemicalID": 35037
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19209,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-11-24 00:00:00",
    "ERTrainingDate": "1999-11-06 00:00:00",
    "CoordinatingAgencyName": "Turlock Fire Department",
    "CoordinatingAgencyPhone": "2096685580",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 19209,
      "SummaryText": "t California Dairies, the high pressure receiver, contains approximately 5,222 pounds of ammonia at 80% liquid level - the safe fill level for the vessel. Therefore, the worst-case release scenario for the facility is a release of the entire contents of the high pressure receiver (5,222 pounds of ammonia) in 10 minutes.  Catastrophic failure of the high-pressure receiver is required for this scenario to occur.  As required by the RMP regulations, pessimistic atmospheric conditions, very conservative chemical dispersion characteristics, and a toxic endpoint of 200 parts per million (ppm) ammonia vapor were assumed.  The predicted distance to the toxic endpoint for the worst case release scenario is approximately 0.66 mile.  The SLAB Model was used for modeling the worst case release scenario.  SLAB was first developed by Lawrence Livermore National Laboratory under contract with the U.S. Department of Energy.  SLAB has been revised and updated by the USAF Engineering and Services Center and the American Petroleum Institute.  SLAB is commonly used to simulate the atmospheric dispersion of denser-than-air releases.\n\nCalifornia Dairies used the alternative release scenario described in the EPA's Model Risk Management Program and Plan for Ammonia Refrigeration, November 1998.  The release scenario is described as a <-inch effective diameter orifice leaking liquid ammonia and resulting in an airborne release, representative of a pipe connection leak or a gasket rupture.  The evaluation used a release rate of 78.8 pounds per minute and average weather conditions.  The predicted distance to the toxic endpoint for the alternative release scenario is approximately 0.11 mile.  The SLAB Model was also used for modeling the alternative release scenario.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  California Dairies has incorporated many safety features in the ammonia refriger"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19209,
      "SummaryText": "ation system to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The California Dairies ammonia system is continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.  The major pressure vessels in the system are connected to a diffusion panel.  Ammonia from the vessels can be mixed with water (neutralized) and discharged to the city sewer to prevent over-pressurization of the vessels.  Further, all pressure vessels in the system are equipped with pressure relief valves.\n\nOther safety features at the facility include: \n7 emergency shutdown systems\n7 component specific safety shutdowns\n7 pressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\n7 all major vessels are connected to a fire diffusion panel\n7 engine room is equipped with ammonia detection system\n7 engine room is equipped with emergency shut down switches\n7 engine room is equipped with a ventilation system\n7 many of the ammonia pipes, valves and components are labeled\n7 a fire sprinkler system is installed in the plant\n7 operators receive ongoing training in operations, maintenance and emergency response\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, California Dairies has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP/PSM auditing and in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19209,
      "SummaryText": "spection program.  Written standard operating procedures (SOPs) are being prepared for the ammonia system at the facility.  The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nCalifornia Dairies is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A preventive maintenance system is utilized to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility includes daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment.  The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nChanges to improve safety at the facility are ongoing.  Many of the mitigation measures suggested by the process hazard analysis team have already been implemented.  Others will be implemented during the next several months.  The status of significant mitigation measures is as follows:\n7 preventive maintenance program is being reviewed to verify that all ammonia system components are included and maintenance frequencies are appropriate\n7 management is evaluating installing oil drain pots on accumulators, recirculators and glycol chillers\n7 management is evaluating installing an audible alarm connected to ammonia detection system for the maintenance shop and outside engine room\n7 management is evaluating connecting an automatic phone dialer to ammonia detection system\n7 management is evaluating installing an emergency evacuation alarm system\n7 ammonia awareness will be added to forklift training program\n7 management is evaluating safe work practices and emergency response plan\n\nCalifornia Dairies will respond to all suggested mitigation measures promptly. California Dairies is scheduling completion of proposed actions.  Management responses and support will be consis"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 19209,
      "SummaryText": "tent with California Dairies' commitment to safe and environmentally responsible operations.\n\nCalifornia Dairies recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility.  As such, this document and related attachments and program elements will evolve as California Dairies continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community.  California Dairies will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations.  However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with California Dairies' internal review practices, and California Dairies will maintain the most current versions on site.  Thus, the most current version RMP/PSM and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 19209,
      "SummaryText": "CALIFORNIA DAIRIES, INC.\nRISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\nAnhydrous Ammonia Refrigeration System\n\nRevised December 1999\n\nEXECUTIVE SUMMARY\n\n\n\nCalifornia Dairies, Inc. (California Dairies) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations.  The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et. Seq.  The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68.  Finally, both the Occupational Safety and Health Association (OSHA) and the California Occupational Safety and Health Association (CalOSHA) regulate facilities with certain acutely hazardous materials under the PSM regulations, as defined in CCR Title 8 Section 5189 and CFR Title 29 Part 1910 Section 119, respectively.\n\nCalifornia Dairies prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility.  California Dairies incorporated many state-of-the-art safety features into the ammonia refrigeration system at the facility as part of the original system construction and system modifications.  California Dairies will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM.  In the unlikely event that a chemical release does occur at the facility, California Dairies personnel are trained in the appropriate response measures, relying on support services provided by the local fire department and hazardous materials response team.\n\nCalifornia Dairies is located at 475 South Tegner Road in Turlock, California. The site is b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19209,
      "SummaryText": "ordered by Tegner Road to the east, West Main Street to the north, Ruble Road to the south, and industrial businesses to the west.  California Dairies is approximately 0.8 mile west of Highway 99. The surrounding area consists of industrial and commercial businesses and residential development.\n\nThe facility was originally constructed in the late-1980s.  The refrigeration system was remodeled in the mid-1990s.  Operations at the facility consist of the storage, processing, packaging, and distribution of milk and dairy products.  The facility is staffed by a refrigeration operator or mechanic 24 hours per day, 365 days per year.\n\nAnhydrous ammonia is used in a refrigeration system at the facility.  The refrigeration system, which is a closed system, contains approximately 16,600 pounds of anhydrous ammonia.  The system provides cooling for production areas, product, and water chilling.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, and compressor controls.  \n\nThe RMP/PSM regulations require a review of the five-year accident history at a regulated facility.  The California Dairies facility reported no accidental releases of ammonia within the past five years. \n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP.  Program 3 requirements of the RMP apply to the California Dairies facility due to the quantity of ammonia used.  Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario.  The regulations define a worst-case release scenario as \u0005the greatest amount held in a single vessel\u0005released as a gas over 10 minutes.  An alternative release scenario is defined as a release that is more likely to occur at the facility.\n\nThe largest ammonia vessel a"
    }
  ]
}