{
  "FacilityID": 19291,
  "FacilityName": "Arnco - South Gate",
  "FacilityStr1": "5141 Firestone Place",
  "FacilityStr2": null,
  "FacilityCity": "South Gate",
  "FacilityState": "CA",
  "FacilityZipCode": "90280",
  "Facility4DigitZipExt": "3535",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.951417",
  "FacilityLongDecDegs": "-118.176611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.arnconet.com",
  "FacilityEmailAddress": "arnco@arnconet.com",
  "FacilityDUNS": 59795468,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sheldon Angel Enterprises",
  "OperatorStr1": "5820 S. Corning Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90056",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Negrey",
  "RMPTitle": "Operations Manager",
  "FTE": 24,
  "OtherEPAFacilityID": "90280-RNC-5141F",
  "EPAFacilityID": "100000066509",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-04-07 00:00:00",
  "DeRegistrationEffectiveDate": "2007-04-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.95128,
  "FRS_Long": -118.17657,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27138,
      "AltID": null,
      "FacilityID": 19291,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 27834,
          "ProcessID": 27138,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 35415,
          "ProcessID": 27138,
          "ChemicalID": 77,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 535415,
          "ProcessID": 27138,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19291,
      "SummaryText": "\nArnco is in the business of synthetic rubber manufacturing, Standard Industrial Classification (SIC) Code #2821.  One of the major raw material ingredients is toluene diisocyanate (TDI) unspecified isomer CAS# 26471-62-5.  TDI is the only acutely hazardous material (AHM) used in the production.  The established State Threshold Quantity for TDI unspecified isomer is not listed, but toluene-2,4-diisocyanate is 500 pounds and that of toluene-2-6-diisocyanate is 100 pounds.  The established StateToxic endpoint is .0070 mg/l.\n\nA hazard and operability (HAZOP) study was conducted by a safety team in September 1999.  The HAZOP study was based and compared to a prior study conducted on October 25, 1995.  The team consisted of facility personnel including the Operations Manager, Plant Manager, Production Crew, Maintenance Engineer, Quality Assurance Chemist and an Environmental Health and Safety consultant.  In accordance with the prior study, the guide word approach was used for HAZOP identification.  The risk matrix algorithms were utilized utilized for hazard ranking.  The existing safeguards for AHM release were identified.  Based upon the HAZOP study, certain control measures were recommended for implementation.  \n\nA total of four external event categories were evaluated; they were transportation accidents, fire, flooding, and nearby pipelines.  It was concluded that external events posted no risk to the normal operations in the plant.\n\nThe off-site consequence analysis was conducted to evaluate the health and environmental impacts associated with the potential acute impacts of an accident.  Data from the Aloha model (developed by EPA and the National Oceanic and Atmospheric Association for predicting the dispersion of toxic material releases in air) determined the worst-case and alternative release endpoint distance for TDI releases. \n\nOne worst case scenario was modeled.  The worst case was assumed to be a rupture of the 5,000-gallon TDI storage tank, regardless of i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19291,
      "SummaryText": "ts cause or likelihood.                                                                        One alternative case scenario was modeled.  The alternative case was assumed to be a pipe leak of 50-gallons, regardless of its cause or likelihood.\n\n\n\nFACILITY DESCRIPTION\nArnco's facility is in South Gate, California and produces three main varieties of tire-fill:  Permacor, Re-pneu, and Superflex.  These three products account for over 85 percent of the volume of goods produced at this facility. \n\nThe main building was designed and built in 1951.  The property was leased from Sheldon Angel Enterprises in 1974.  The contact person is Mr. Howard Sheldon or Mr. Luis Angel at (310) 670-0811.  Arnco currently employs 24 people in South Gate, 7 people in production and 17 in the office.  There is only one shift and employees are in the plant from 4 AM until 4 PM daily, Monday to Friday.  Both Schultz and DSL, two immediate neighbors, operate 24 hours a day and have private security and CCTV cameras on the premises.  There is always activity around Arnco.  The South Gate facility is Arnco's headquarters.\n\nArnco's building currently occupies 22,500 ft2 on a 45,000 ft2 lot.  The building is located at 5141 Firestone Place in the City of South Gate, California, approximately 1,700 ft west of the 710 Freeway and 300 ft north of Firestone Boulevard.  Included in this RMP is a neighborhood site map showing the M-3 heavy manufacturing zone in which Arnco is located. \n\nTDI is a water-white to pale yellow liquid under room temperature.  The approximate vapor pressure at 200 C is 0.01 mm.  TDI slowly produces CO2 and polyureas when reacted with water.  Inhalation exposure and ingestion of TDI will cause strong irritation to skin and tissue, especially to the eyes.  The current Occupational Safety & Health Administration (OSHA) time weighted average (TWA) is 0.005 ppm."
    }
  ]
}