{
  "FacilityID": 19387,
  "FacilityName": "Pine Valley Water Treatment Plant",
  "FacilityStr1": "630 West Monument Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "USAir Force Academy",
  "FacilityState": "CO",
  "FacilityZipCode": "80840",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08041",
  "LEPC": "Colorado Springs LEPC",
  "FacilityLatDecDegs": "38.988194",
  "FacilityLongDecDegs": "-104.894722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.csu.org",
  "FacilityEmailAddress": "http://www.csu.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Colorado Springs Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Colorado Springs Utilities",
  "OperatorStr1": "102 South Weber",
  "OperatorStr2": null,
  "OperatorCity": "Colorado Springs",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80903",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": "COR000010983",
  "EPAFacilityID": "100000037239",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-19 00:00:00",
  "SafetyInspectionBy": "Colorado Springs Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-12-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-07-22 00:00:00",
  "DeRegistrationEffectiveDate": "2008-07-01 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.97003,
  "FRS_Long": -104.89472,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "the Pine Valley & McCullogh RMPs have been combined using EPA ID 100000034839",
  "_processes": [
    {
      "ProcessID": 27254,
      "AltID": "Drinking Water Disinfect.",
      "FacilityID": 19387,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 35547,
          "ProcessID": 27254,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 27953,
          "ProcessID": 27254,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 10581,
              "Process_NAICS_ID": 27953,
              "SafetyReviewDate": "1999-02-03 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "Pikes Peak Regional and Uniform Building Codes, Uniform Plumbing Code, NEC, and Chlorine Institute Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1998-08-12 00:00:00",
              "ChangeCompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "physical damage to process equipment; operator error",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-08 00:00:00",
              "TrainingReviewDate": "1999-05-06 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-15 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "Evaporators",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "CSU has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Pine Valley WTP RMP for the chlorine system, in particular.  The RMP-regulated process consists of the use of chlorine for disinfection in the treatment of drinking water.  Chlorine gas flows from one ton containers, through small diameter steel and PVC piping, to streams of water.  In the process, chlorine gas pressure is reduced to a slight vacuum, is measured, and enters a moving stream of water through injection valves.  Equipment in this process includes pressure regulators, relief valves, block valves, chlorinators (measuring devices), and injector valves.",
              "_chemicals": [
                {
                  "PrimaryKey": 11080,
                  "PreventionProgram2ID": 10581,
                  "ProcessChemicalID": 35547
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19387,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-16 00:00:00",
    "ERTrainingDate": "1999-04-28 00:00:00",
    "CoordinatingAgencyName": "Air Force Academy Fire Station #1",
    "CoordinatingAgencyPhone": "7193334260",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19387,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Pine Valley Water Treatment Plant (Pine Valley WTP), one of several facilities owned and operated by the Colorado Springs Utilities (CSU).\n\nAccidental Release Prevention and Emergency Response Policies\nCSU has determined that this facility is required to comply with RMP Program 2.  CSU believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, CSU has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Pine Valley WTP RMP for the chlorine system.\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of regulated chemicals.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  Accordingly, a well-developed and properly-implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\nCSU takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are well-informed regarding the hazards associated with the regulated processes (e.g., chlorine at the Pine Valley WTP) and actively participated in comprehensive process hazard analyses.  The system employees are properly trained in the safe operation of the covered processes and the safe handling of treatment chemicals.  They are aided in this work by complete, understandable system operating procedures."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19387,
      "SummaryText": "\n\nCSU management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the Pine Valley WTP RMP procedures and policies.\n\nAs for emergency response, CSU has established and maintains procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nStationary Source and Regulated Substances\nThe Pine Valley WTP is located at 630 West Monument Creek Road on the Air Force Academy property in  El Paso County, Colorado.  The facility treats surface water through a series of physical and chemical treatment operations including pre- and post-chlorination to provide potable drinking water to residents of the Colorado Springs area.  More than 42 million gallons of water are treated daily prior to discharge into the water distribution system.\n\nThe Pine Valley WTP utilizes chlorine as a disinfecting agent in the treatment of drinking water.  The chlorine is stored in one-ton containers with a maximum intended inventory of ten containers (20,000 pounds) on site.  Therefore, the Pine Valley WTP is regulated under Program 2 of the RMP rule due to the volume of chlorine stored and used at the facility.\n\nRelease Scenarios\nWorst-case and alternative release scenarios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For worst-case release scenario, the regulation is clear.  The assumption is that a full one-ton container of chlorine is released over a ten-minute period.  No active mitigation may be considered.  Therefore, the scrubber is assumed not to work in this scenario.  Worst-case meteorological conditions as specified in the RMP regulation are also assumed to be present.  The release is also assumed to occur outdoors.\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19387,
      "SummaryText": "For the alternative release scenario, the facility reviewed the consequences of the loss of a fusible plug from a full one-ton container during offloading activities.  The incident would occur outdoors so that the scrubber or other active mitigation devices would not be effective.\n\nResults of the off-site consequence analyses are described in Sections 2 and 3 of the RMP*Submit plan for the Pine Valley WTP.\n\nPrevention Steps for Chlorine\nThe prevention program and chemical-specific prevention steps are described in detail in the Pine Valley WTP RMP manual.  The prevention program includes the following elements:\n7 Safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment\n7 Hazard review, which includes a systematic evaluation (by an employee team) of:  the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls\n7 Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions\n7 Training for each Pine Valley WTP employee involved in operating the chlorine system\n7 Computerized maintenance program including schedules and job plans to maintain the on-going integrity of the chlorine process equipment\n7 Compliance audits at least every three years from 1999 to evaluate Pine Valley WTP RMP compliance\n7 Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of chlorine from the Pine Valley WTP\n\nIn addition to these elements, the chlorine storage facility at Pine Valley WTP is equipped with a chemical scrubber.  In the event of a release of chlorine in the storage room, the nor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19387,
      "SummaryText": "mal ventilation system shuts down and the chlorine-contaminated air is sent to the scrubber for neutralization.  The scrubber is maintained and tested on a regular basis to ensure proper operation during a chlorine release event.\n\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of chlorine meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program, which includes an evacuation plan.  The program is coordinated with local response agencies, including the City of Colorado Springs and Air Force Academy Fire Departments and Hazardous Materials Response Teams.  The program is described in detail in the Pine Valley WTP RMP manual and meets the requirement of 40 CFR 68.95, which include facility notification of emergency responders and evacuation.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.  CSU works closely with the Colorado Springs LEPC and other local industries and agencies to coordinate local response activities.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held regularly at the Pine Valley WTP.  Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of those hazards."
    }
  ]
}