{
  "FacilityID": 19708,
  "FacilityName": "Swift & Company",
  "FacilityStr1": "402 N 10th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Marshalltown",
  "FacilityState": "IA",
  "FacilityZipCode": "50158",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19127",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "42.054722",
  "FacilityLongDecDegs": "-92.896111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.conagra.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7258908,
  "ParentCompanyName": "ConAgra, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": 0,
  "OperatorName": "Mike Weber",
  "OperatorStr1": "402 N 10th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Marshalltown",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50158",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ryan Mannion",
  "RMPTitle": "Safety Director",
  "FTE": 1950,
  "OtherEPAFacilityID": "50158SWFTNNORTH",
  "EPAFacilityID": "100000127524",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-01-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Marshalltown, IA",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.05397,
  "FRS_Long": -92.89601,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27653,
      "AltID": "Refrigeration",
      "FacilityID": 19708,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28356,
          "ProcessID": 27653,
          "NAICSCode": "311611",
          "_desc": {
            "NAICS_CODE": "311611",
            "NAICS_DESCRIPTION": "Animal (except Poultry) Slaughtering"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36024,
          "ProcessID": 27653,
          "ChemicalID": 56,
          "Quantity": 175862.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536024,
          "ProcessID": 27653,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19708,
      "SummaryText": "The accidental release prevention and emergency response policies at the plant consist of all regulations that are regulated by OSHA and the PSM program at the facility.  Some refrigeration employees and some supervisors are trained in the 40 HAZMAT course to respond to accidental releases on a volunteer basis.  All refrigeration maintenance personnel go through training on all the SOP's from the PSM program.  These procedures are reviewed yearly to help insure that all problems are corrected.  All refrigeration maintenance personnel are currently scheduled to go through ammonia refrigeration school to teach them the operations and safety.  The preventative maintenance program is periodically reviewed and updated as the monitoring and repair on equipment is performed.  This process has been of great benefit to the plant in finding problems in a timely manner.\n\nThe Swift & Company plant in Marshalltown, Iowa, is a pork slaughter and processing facility.  The plant is defined by the EPA as a \"Complex Slaughter\" facility.  Final products produced include: meat products, edible lard, inedible lard, dried blood and meat and bone meal.  The regulated substance used at this facility that meets threshold quantities is anhydrous ammonia.  Ammonia is used as a manufacturing aid in the refrigeration process.  Refrigeration is used in processing and storing of the meat and meat products.  The total calculated amount of anhydrous ammonia in the facility is equal to 175,862 pounds.  This combined total is the result of equipment and piping in two separate systems within the plant.\n\nThe worst-case scenario for this facility is a rupture in the high pressure receiver resulting in a loss of the entire contents of 33,055 pounds of ammonia.  This loss will occur within 10 minutes and the spilled liquid will vaporize at room temperature releasing gas to the atmosphere.  The American Industrial Hygiene Association (AIHA) has determined that the maximum airborne concentration below which"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19708,
      "SummaryText": " it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action for anhydrous ammonia is 200 parts per million (ppm).  Under the worst-case weather conditions with dispersion into an urban area, the distance that the release would travel before it no longer causes a health threat is 2210 meters (1.37 miles).  Because of the safety proceedures and PSM plan in place at the plant, the risk factor of a release of this magnitude is very low.\n\nThe alternative or more likely case scenario for this facility is a relief valve failure resulting in a loss of approximately 600 pounds of ammonia in a 1 hour period.  The distance that the release would travel before it no longer causes a health threat is 100 meters (0.06 Mile).  The risk factor for a release of this type is moderate.\n\nThe Swift & Company facility is in compliance with all OSHA PSM rules and this RMP rule requirements.  The procedural and managerial steps that are in place are a preventative measure to accidental release prevention as well as maintenance and training programs that are in place.\n\nThere have been no releases at this facility in the past five years that have resulted in death, injuries, or property damage on site or in death, injuries, evacuations, sheltering in place, property damage, or environmental damage offsite.\n\nThe Swift & Company facility has an emergency response plan on file with the local emergency planning committee (LEPC).  The facilities HAZMAT team conducts regular drills and training of specialized personnel.  The policies for reporting spills and releases is documented in the \"Policies and Procedures\" manual updated by the Corporate Environmental Operations office.\n\nThe ammonia compressor rooms of this facility are protected by monitoring systems.  The facility will continue with HAZMAT training for plant perso"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19708,
      "SummaryText": "nnel as a deterrent to toxic release danger."
    }
  ]
}