{
  "FacilityID": 19798,
  "FacilityName": "Parmalat - New Atlanta Dairies",
  "FacilityStr1": "777 Memorial Drive, S.E.",
  "FacilityStr2": null,
  "FacilityCity": "Atlanta",
  "FacilityState": "GA",
  "FacilityZipCode": "30316",
  "Facility4DigitZipExt": "1195",
  "FacilityCountyFIPS": "13121",
  "LEPC": "Fulton County LEPC",
  "FacilityLatDecDegs": "33.74625",
  "FacilityLongDecDegs": "-84.362194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 101391761,
  "ParentCompanyName": "Parmalat U.S.A.",
  "Company2Name": null,
  "CompanyDUNS": 101391761,
  "Company2DUNS": null,
  "OperatorName": "Parmalat New Atlanta Dairies",
  "OperatorStr1": "777 Memorial Drive, S.E.",
  "OperatorStr2": null,
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30316",
  "OperatorZipCodeExt": "1195",
  "FTE": 80,
  "OtherEPAFacilityID": "GAD981246044",
  "EPAFacilityID": "100000165812",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-10 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-01-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-08-17 00:00:00",
  "DeRegistrationEffectiveDate": "2009-03-31 00:00:00",
  "AnniversaryDate": "2005-01-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.745556,
  "FRS_Long": -84.36,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27763,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 19798,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36224,
          "ProcessID": 27763,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28468,
          "ProcessID": 27763,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15178,
              "Process_NAICS_ID": 28468,
              "SafetyReviewDate": "1999-12-01 00:00:00",
              "PHA_Date": "1999-10-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-12-20 00:00:00",
              "TrainingReviewDate": "1999-12-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-10-07 00:00:00",
              "EquipmentInspectionDate": "1999-12-10 00:00:00",
              "EquipmentTested": "Condenser, Glycol Chiller",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-12-20 00:00:00",
              "PreStartupReviewDate": "2000-01-08 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-12-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-12-20 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-12-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22032,
                  "PreventionProgram3ID": 15178,
                  "ProcessChemicalID": 36224
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19798,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fulton County LEPC",
    "CoordinatingAgencyPhone": "4047305600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 19798,
      "SummaryText": "od.  The toxic endpoint used was 200 parts per million (0.14 milligrams per liter), as defined in the EPA's Risk Management Program Guidance for Ammonia Refrigeration.  With a wind speed of 1.5 meters per second, and a Stability Class of F in an urban area, the endpoint was calculated to be 1.2 miles from the receiver, using the RMP*Comp(tm) modeling software.  The public receptors within a one-mile radius of the facility are schools, public parks, residential areas, and commercial buildings.  The total population of this area was estimated to be 20,367, based on U.S. Census data obtained from Landview III.  \n\nAlternate Case Release Scenario\n\nThe Alternate Case release scenario for the Parmalat facility was chosen to be a rupture in a liquid line.  The specific line chosen was a one-inch diameter liquid feed line which runs from the high pressure receiver to one of the glycol chillers located on the roof of the production building.  The release duration was selected to be five (5) minutes.  The line has a normal operating pressure of approximately 150 pisg.  The piping run is approximately 150 feet in length and experiences an approximate 10-foot change in elevation from the receiver to the chiller. The toxic endpoint used was 200 parts per million (0.14 milligrams per liter), as defined in the EPA's Risk Management Program Guidance for Ammonia Refrigeration.  Using a wind speed of 3 meters per second, and a Stability Class of D in an urban area, the endpoint was calculated to be 0.3 mile from the facility, using the RMP*Comp(tm) modeling software. The public receptors within a 0.3-mile radius of the facility are schools, residential areas, and commercial buildings.  The total population of this area was estimated to be 970, based on U.S. Census data obtained from Landview III.\n\n\nPollution Prevention Program\n\nProcess Safety Information\n\nProcess safety information relating to the covered processes is divided into three categories: chemical hazards, process technology"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19798,
      "SummaryText": "ammonia (commonly used as a household cleaner).\n\nCommercially, ammonia is made by combining free nitrogen and hydrogen gases under high pressure and temperature in the presence of a catalyst.  The process most commonly used is the Harber-Bosch method.  Industrial Grade Anhydrous Ammonia serves as the most economically abundant and efficient heat transfer medium for industrial refrigeration processes.  Its pungent odor serves as a self-alarming characteristic.\n\nAnhydrous ammonia is the liquid form of pure ammonia gas, technically water-free, and the substance used universally as an industrial refrigerant.  Anhydrous means without water.  Ammonia has a higher refrigerating effect, per unit of liquid volume, than any other type of commonly used refrigerant; other advantages are low initial cost and low pipe friction losses.  \n\nFor transport purposes, anhydrous ammonia is classified as a non-flammable gas by the U.S. Department of Transportation (DOT).  The nitrogen component of the substance is inert in the combustion reaction and accounts for the limited flammability of anhydrous ammonia.  The flammable limits at atmospheric pressure are 16% to 25% (by volume) of ammonia in air.  Ammonia's high lower limit of flammability and low heat of combustion substantially reduce its combustion-explosion and fire hazards. \n\nExposure to ammonia causes intense irritation to the surface tissues of the eyes, nose, throat and lungs.  Exposure to high concentrations of ammonia may blind, burn, strangle or kill.  The effect of ammonia on the skin is that of a caustic burn, varying in severity with the concentration of ammonia and the length of time exposed.  Changes in respiratory and heart action are produced as reflex actions resulting from the irritation of the respiratory tract.  \n\nWorst-Case Release Scenario\n\nThe worst-case scenario for the Parmalat facility is a release of 12,000 pounds of ammonia from the system's largest vessel, the high-pressure receiver, in a ten-minute peri"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19798,
      "SummaryText": ", and process equipment.  PSI relating to the chemical hazards is included in MSDS's, that are kept in readily accessible locations for all employees.  PSI relating to the process technology is generally indicated on process drawings, and is referenced in applicable Operating Procedures and Process Hazard Analyses.  PSI relating to process equipment is located in the Maintenance Office.\n\nProcess Hazard Analysis\n\nProcess Hazard Analyses (PHAs) will be conducted on each covered process every five years, or when the process changes.  A PHA on the ammonia refrigeration process was conducted on October 6 and 7, 1999.  PHAs have been and will be conducted by a team of knowledgeable individuals representing, at a minimum: operations, maintenance, engineering, and safety.  PHAs have and will address the hazards of the process, identification of previous incidents that had a likely potential for a catastrophic release, engineering and administrative controls applicable to the hazards, \n \nOperating Procedures\n\nWritten operating procedures for the ammonia refrigeration system are currently under development and will be maintained by the Maintenance Department, the department which is responsible for operating the system.  The draft operating procedures include provisions for initial startup, normal operations, emergency operations, normal shutdown, and startup following a shutdown.  The draft operating procedures also address the operating limits of the covered systems, and the consequences of deviation from those operating limits.  Safety and health considerations are an integral component of the draft operating procedures.  Parmalat expects to finalize the operating procedures not later than March 17, 2000.\n\nTraining\n\nParmalat provides on-the-job and classroom training to employees responsible for operating the ammonia refrigeration system.  The trainees must demonstrate to the satisfaction of the supervisor that they possess the skills and knowledge to perform the required"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 19798,
      "SummaryText": "duties prior to being assigned the responsibilities.  Refresher training on the Operating Procedures will be provided at a minimum every three years.  Hazard Communication and Chemical Training are provided to each maintenance employee on an annual basis.\n\n\nMechanical Integrity\n\nParmalat is currently modifying written instructions for inspection and testing of pressure vessels, storage tanks, piping systems (including valves), relief and vent system devices, emergency shutdown systems, controls, alarms, and interlocks that are part of ammonia refrigeration system.  Tests and inspections will follow applicable and acceptable codes and standards, will be performed at a frequency called for by the applicable and acceptable codes and standards, or more frequently.  Maintenance employees will be trained on the acceptable work practices relating to the inspection and testing requirements.  Parmalat expects to have written instructions for inspection and testing of the ammonia refrigeration system equipment not later than March 17, 2000.  Parmalat expects to provide refresher training to maintenance employees on acceptable work practices relating to the inspection and test requirements not later than March 17, 2000.\n\nManagement of Change\n\nParmalat is currently developing a written Management of Change (MOC) procedure that will ensure that proposed changes to the ammonia refrigeration system will address: the technical basis of the proposed change; the impact on safety and health; modifications to operating procedures; the time period of the change; and the authorization requirements for the proposed change.  The procedure will also address employee training and updating of process safety information.  \n\nParmalat is in the process of adding new equipment to the ammonia refrigeration system.  The draft MOC procedure is currently being used and tested by Parmalat during this facility expansion project.  The procedure is expected to be finalized not later than January 31, 2000"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 19798,
      "SummaryText": "o ensure they receive a high priority for accomplishment.\n\nEmployee Participation\n\nThe Parmalat New Atlanta Dairies actively encourages employee participation at all levels of development, implementation, and maintenance of the RMP program at the Atlanta, Georgia facility.  \n\nHot Work Permit\n\nThe Parmalat facility is revising the Hot Work Program.  The permit system will cover such items as: appropriate fire protection, fire watch requirements, timeframe for work to be conducted, equipment to be worked on, the responsible individual for the work, and appropriate signatures/approval.  Parmalat expects to have the Hot Work Program fully modified not later than January 31, 2000. \n\nContractors\n\nThe Parmalat facility has 24-hour security.  A guard mans the main entrance to the facility 24 hours a day.  Contractors must stop at the gate and be cleared for entry.  Parmalat is currently developing a contractor approval procedure that will ensure that the contractor's safety record is considered prior to selection.  Additionally, Parmalat is developing a program to ensure that all contractors receive appropriate training on the hazards of the ammonia refrigeration system prior to working at the facility.  Parmalat expects to complete these programs not later than March 17, 2000.\n\n\nFive-Year Accident History\n\nParmalat New Atlanta Dairies has had no releases of RMP-covered chemicals which resulted in on-site deaths, injuries, or significant property damage or known off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.  In preparation of this RMP Parmalat reviewed files of previous incidents at the facility. \n\nEmergency Response Program\n\nThe Parmalat facility is considered to be a Non-Responding Facility under 40 CFR Part 68.90.  Parmalat is currently developing a comprehensive Emergency Response Plan, to include coordination with the appropriate local agencies.  Parmalat expects to have a completed Plan, and have local agency co"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 19798,
      "SummaryText": "ordination not later than March 17, 2000.  \n\nPlanned Changes to Improve Safety\n\nA PHA was conducted for the ammonia system on October 6 and 7, 1999.  Parmalat plans to reevaluate the recommendations of the PHA by March 3, 2000.  Additionally, Parmalat commits to having the above described policies and procedures implemented by the dates given.\n\n\t7\n\nExecutive Summary for Risk Management Program\t\tJanuary 10, 2000\nParmalat New Atlanta Dairies - Atlanta, Georgia"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 19798,
      "SummaryText": "This document represents the Risk Management Program submittal for the following facility:\n\nParmalat New Atlanta Dairies\n777 Memorial Drive SE\nAtlanta, Georgia 30316-1195\n\n\nCERTIFICATION STATEMENT\n\nI certify that to the best of the undersigned's information, knowledge and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n\n\t\t\t\t\t\t\t\t\t\t\t\nEd Kubale III\t\t\t\t\t\t\tDate\nVice President/General Manager\nParmalat New Atlanta Dairies\n\n\nEXECUTIVE SUMMARY\n\n\nAccidental Release, Prevention, and Emergency Response Policies\n\nParmalat New Atlanta Dairies is committed to providing the optimum in employee and public safety and health.  It is the policy of Parmalat to assure, so far as possible, that every employee has a safe and healthful place in which to work.  Parmalat is dedicated to providing the resources necessary to fulfill these commitments.  It is also the policy of the company to expect each employee and contract employee to live up to the responsibility of following all safety rules and committing to safety.  Violations of safety rules are not tolerated.\n\nIt is Parmalat New Atlanta Dairies' policy to ensure adequate emergency response capabilities exist to handle an on-site emergency regarding RMP-covered chemicals.  Parmalat executes this policy through employee training, equipment purchases, and coordination with local emergency response agencies.\n\nFacility Description\n\nThe Parmalat New Atlanta Dairies facility is located at 777 Memorial Drive, in eastern Atlanta, Georgia.  The facility is situated just of Interstate Highway 20, in Fulton County.  Parmalat produces various dairy products at this facility.  Raw milk is delivered via tanker trucks, and is processed to make milk, chocolate milk, buttermilk, and egg nog.  Additionally, various fruit juices are manufactured at this facility.  The finished products are packaged for retail distribution.\n\nParmalat's products require constant refrigeration.  The refrigeration system uti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19798,
      "SummaryText": "lizes anhydrous ammonia in a single-stage closed-loop system.  In general, ammonia gas is compressed by one of four compressors.  The high-pressure ammonia gas then moves on to condensers located on the roof of the production facility.  The ammonia is condensed to a liquid and is routed to the high-pressure receiver.  The receiver is located outside the compressor room.  From the receiver, the ammonia travels to the various coolers and process tanks where it is passed through an expansion valve.  The rapid expansion of the liquefied ammonia returns it to a gaseous state as it removes heat from the product/room.  The low-pressure ammonia gas then passes through an accumulator where any remaining liquid is separated out, and then back to the compressors. \n\nAnhydrous Ammonia is purchased for use the facility's refrigeration system.  A private company delivers ammonia to the site, as necessary, via tanker truck.  The largest quantity of ammonia is typically stored in the high-pressure receiver, located outside the facility's compressor room.  The high-pressure receiver has a maximum capacity of 13,200 pounds.  However, normal operating conditions are for the receiver to maintain a volume of 12,000 gallons.  The entire ammonia refrigeration system typically contains approximately 14,600 pounds of ammonia.  \n  \nParmalat is also covered under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) of Highly Hazardous Chemicals, 29 CFR 1910.119.  Therefore, the facility is subject to Program 3 requirements as identified in the RMP.\n\nSummary of Hazards\n\nAmmonia (NH3) at normal temperatures and pressures, is a colorless gas made up of one part nitrogen and three parts hydrogen.  It is lighter than air and has a sharp, pungent odor that serves as a warning of its presence.  While ammonia is a relatively toxic substance, it is not a cumulative poison.  It is highly soluble in water and forms a solution known as ammonium hydroxide (NH4OH) or aqua"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 19798,
      "SummaryText": ".  \n\nPre-Startup Safety Review\n\nParmalat is currently developing a written Pre-Startup Safety Review (PSSR) procedure.  The procedure will confirm that prior to introduction of anhydrous ammonia to new/modified equipment: construction and equipment is in accordance with design specifications; safety, operating, maintenance, and emergency response procedures are in place; the MOC requirements have been met; a process hazards analysis has been performed (if necessary); and that employees have been properly trained.  \n\nAs described above, Parmalat is in the process of adding new equipment to the ammonia refrigeration system.  The draft PSSR procedure and checklist will be used and tested prior to new system startups.  A PSSR was conducted on January 8, 2000 on a new condenser unit for the ammonia refrigeration system.  The procedure is expected to be finalized not later than January 31, 2000.  \n\n\nCompliance Audits\n\nParmalat plans to conduct a compliance audit of the RMP program at the Atlanta, Georgia at least every five years.  The initial audit of the RMP program in place at the Plant is planned for March 20 - 24, 2000.  The audit will consist of a records review, evaluation of on-site conditions, and interviews with employees.  The audit will be conducted by an independent consulting company.\n\nIncident Investigations\n\nIncident investigations will be conducted for each incident that resulted in or could have reasonably resulted in a catastrophic release of a covered chemical.  Investigation teams will be comprised of representatives from Safety, Maintenance, Production, and any other affected group (i.e. contractors).  Investigations will be initiated within 48 hours of the incident, or sooner.  Investigation reports will contain, at a minimum: date of incident, description of the incident, investigation team members, factors contributing to the incident, and the recommended corrective actions.  Management will review open corrective action items on a regular basis t"
    }
  ]
}