{
  "FacilityID": 19819,
  "FacilityName": "Superior Propane Terminal",
  "FacilityStr1": "2802 Elmira Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Superior",
  "FacilityState": "WI",
  "FacilityZipCode": "54880",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55031",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "46.705278",
  "FacilityLongDecDegs": "-92.114444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "csimaple@win.bright.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "COOPERATIVE SERVICES",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "COOPERATIVE SERVICES",
  "OperatorStr1": "P O BOX 215",
  "OperatorStr2": null,
  "OperatorCity": "MAPLE",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54854",
  "OperatorZipCodeExt": null,
  "RMPContact": "DAN CAMPBELL",
  "RMPTitle": "GENERAL MANAGER",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165992",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-08-01 00:00:00",
  "SafetyInspectionBy": "fire marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-11-14 00:00:00",
  "DeRegistrationEffectiveDate": "2013-11-08 00:00:00",
  "AnniversaryDate": "2005-01-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 46.70612,
  "FRS_Long": -92.11489,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 27792,
      "AltID": "propane storage",
      "FacilityID": 19819,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28497,
          "ProcessID": 27792,
          "NAICSCode": "42271",
          "_desc": {
            "NAICS_CODE": "42271",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36259,
          "ProcessID": 27792,
          "ChemicalID": 98,
          "Quantity": 660000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536259,
          "ProcessID": 27792,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19819,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental release prevention and emergency response policies:\nOur company is committed to protecting the environment and operating facilities in a manner that promotes the safety of employees and the general public. At this facility, we store and handle propane. The management has adopted and implemented policies that adhere to all applicable Federal and state rules and regulations. The most current editions of NFPA 58 and 54 are followed for the safe handling of propane and the installation and maintenance of storage equipment. Safety is the number one consideration in the handling of propane, the design and maintenance of the equipment, and the training of our personnel. The National Propane Gas Association Safety and Technical Support Manual is the guide for safety practices and procedures at this terminal.\nOur emergency response plan is based upon the \"Guidelines for Developing Plant Emergency Procedures\" and \"How to Control L-P Gas Leaks and Fires\". Terminal staff will not respond to accidental releases of flammable substances at our facility, but has coordinated response actions with the local fire department. Our response plan includes procedures to call the local emergency responders such as the fire and law enforcement departments as well as any potentially affected neighbors.  \n \nThe stationary source and regulated substance handled.\nThe regulated substance handled at this terminal is propane.\nThe purpose of this facility is to store propane for distribution to wholesale customers. Most of the propane is received by rail car and stored in six large storage tanks. In rare cases, it is received by truck transports. This facility is equipped to unload rail cars and truck transports. It is set up to load transports and bobtails. The majority of the propane is loaded into transports that haul the propane to wholesale customers. Bobtails are also loaded for transportation and distribution to retail customers. The installation of the storage t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19819,
      "SummaryText": "anks and the loading and unloading equipment has been done according to the provisions of NFPA 58.The facility is enclosed by fence and access is restricted to authorized personnel only.\n\nThe worst-case release scenario and alternative release scenario.\nWorst-case: Failure of the largest storage tank release 110,000 pounds of propane. It is assumed the entire contents are released as a vapor. It is also assumed that 10% of the released quantity would be involved in a resulting explosion when the released propane reached a source of ignition. The distance to the end point of 1-psi for the worst-case scenario is 0.40 mile.\nAlternative-case: A break in one of the primary pipes is used as the alternative case scenario. This scenario would develop in a situation whereby the piping is damaged by force. The pipes that carry the propane are two (2) inches in diameter and are schedule 80 thickness. The piping system has excess flow valves in the event of a separation equal to the size of the pipe, however in the unlikely event that a break was to happen, a release of propane would occur. For a two inch pipe, the quantity of propane would be 75,804 pounds at 1-psi overpressure. The distance to the end point would be 0.3 mile. Each of these scenarios would have the potential of off- site consequences.\n\nThe general accidental release prevention program and chemical-specific prevention steps.\n    This terminal complies with all Federal and state rules and regulations that govern the storage, handling and transportation of propane. It also complies with the EPA's Accidental Release Prevention Rule. The terminal was designed and constructed in accordance with NFPA 58 code for the storage and handling of propane. Periodic inspection of the entire system is done to ensure continued safe operations. All maintenance and improvements are done per the latest NFPA code in effect at the time. Regulatory authorities, to ensure that it is operated and maintained properly, inspect this terminal"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19819,
      "SummaryText": ".  The employee's are trained as required by the appropriate codes and regulations using the NPGA's Certified Employee Training Program. \n\n\nThe five-year accident history.\nNo accidental releases of propane have occurred at this terminal resulting in off-site consequences.\n\nThe emergency response program.\nThe emergency response plan at this terminal was based upon the NPGA bulletins \"Guidelines for Developing Plant Emergency Procedures\" and \"How to Control Small Leaks and Fires\". Employees are trained in emergency operating procedures such as controlling sources of ignition and leaks. Employees are not trained in emergency medical response and are not equipped to respond to offsite releases. Facility employees will not respond to accidental releases of a regulated flammable substance. Emergency response will be coordinated with the local fire authorities. The plan identifies who is responsible for calling emergency responders and notifying potentially affected neighbors.\n\nPlanned changes to improve safety.\n\nThe facility was constructed and is maintained in compliance with NFPA 58. The staff has been trained using the Certified Employee Training Program developed by the National Propane Gas Association in addition to industry safety practices and procedures. Department of Transportation personnel have trained the staff in safety procedures for unloading rail cars. Safety practices are continually reviewed. Equipment and maintenance programs are monitored on an ongoing basis. At the submission of this plan, no immediate changes are scheduled."
    }
  ]
}