{
  "FacilityID": 19815,
  "FacilityName": "Crescent Hill Water Treatment Plant",
  "FacilityStr1": "3018 Frankfort Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40206",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.253611",
  "FacilityLongDecDegs": "-85.683083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.lwcky.com",
  "FacilityEmailAddress": "info@lwcky.com",
  "FacilityDUNS": 9004239,
  "ParentCompanyName": "Louisville Water Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mr. Steve Hubbs",
  "OperatorStr1": "3018 Frankfort Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40206",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Steve Hubbs",
  "RMPTitle": "VP, Production and Delivery of Wate",
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164617",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-06-26 00:00:00",
  "SafetyInspectionBy": "Air Pollution Control District",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Chlorine and Ammonia",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-09-10 00:00:00",
  "DeRegistrationEffectiveDate": "2015-08-27 00:00:00",
  "AnniversaryDate": "2004-12-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.25461,
  "FRS_Long": -85.68411,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27781,
      "AltID": "Water Treatment/Filtratio",
      "FacilityID": 19815,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28486,
          "ProcessID": 27781,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36245,
          "ProcessID": 27781,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 36246,
          "ProcessID": 27781,
          "ChemicalID": 56,
          "Quantity": 62000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536245,
          "ProcessID": 27781,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536246,
          "ProcessID": 27781,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19815,
      "SummaryText": "(a) The accidental release prevention and emergency response policies at the stationary source.\n\nLouisville Water Company continues to be committed to preventing accidental releases of chlorine, ammonia, or any other hazardous chemical.  Since the rule requiring this plan is specifically directed toward the prevention of chlorine and ammonia releases, the discussion will be confined to those two chemicals.  Extremely conservative engineering practices have been observed in the design and operation of the company's chorine and ammonia feed system such that the probability of accidental release is minimal.  Examples of these practices include the building of chlorine storage container containment building, installation of automatic chlorine flow shut-off devices, and the installation of four chlorine detection units which can detect chlorine concentrations as low as one part per million chlorine gas.  These devices are located inside the chlorine containment building in the immediate vicinity of the chlorine storage containers.  Two of these detectors control automatic chlorine flow shut-off devices.  These valves are pneumatically operated and will close within 30 seconds of detection of chlorine.  The other two sensors provide continuous remote indication of chlorine concentration inside the containment building to the master water treatment control room, which is continuously manned.  The chorine containment building's ventilation and heating systems are interlocked to the chlorine detection system such that both systems automatically stop upon chlorine leak detection.  Most notably, LWC operates a state-of-the-art chlorine vacuum feed system, which ensures that any chlorine outside of the containment building is inside piping under vacuum until the chlorine is introduced into the water.  Chlorine piping downstream of the vacuum regulators operate under a vacuum and will not leak unless a break in the chlorine vacuum piping and failure of the vacuum regulator occur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19815,
      "SummaryText": " simultaneously, which would be highly unlikely.  In the event of a chlorine leak on the pressurized side of the chlorine feed system, there is evacuation piping inside the containment building which will provide suction path to a scrubbing system which will remove chlorine from the air prior to air's reintroduction to the environment.  Power to the chlorine vacuum feed system is supplied from two independent electric substations.  Dikes are installed beneath the chlorine tank cars in order to contain any liquid chlorine spilled in order to minimize the surface area of the spilled chemical.  This will reduce the evaporation rate of any spilled chlorine.  Once a railroad bulk car is loaded into the containment building, derailing equipment is installed on the railroad tracks outside the building, which will prevent a runaway car from entering the containment building.  All modifications made to the chlorine containment buildings fully meet all code requirements of the Department of Housing, Buildings, and Construction Division of Fire Prevention for the State of Kentucky.  \n\nIn the event of a chlorine leak, operations personnel have quick access to NIOSH approved half-mask filters so that quick and safe egress and initial investigation may be conducted.  Self-contained breathing apparatus is readily available for more thorough investigation and isolation in a contaminated atmosphere.\n\nIn any capital improvement project within the production or distribution system, exhaustive effort is performed to ensure the identification of a safety-related item.  Once identified, the resolution of the safety issue is written into contract.\n\nThe emergency response plan, developed in 1992, is fully integrated into operations at both water treatment plants.  The plan was developed in conjunction with public emergency response authorities, in compliance with local, state, and federal laws, and has been tested to respond effectively in the unlikely event of a chemical leak.  LWC person"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19815,
      "SummaryText": "nel are trained to initially respond to leak events, train annually to install chlorine \"B\" and \"C\" containment kits, plus conduct an annual drill with the Louisville Fire Department Hazards Response Unit to simulate response to a chemical leak.\n\n(b) The stationary source and regulated substances handled.\n\nThe Crescent Hill Water Treatment Plant (CHWTP) is located at 3018 Frankfort Avenue, Louisville, Kentucky 40206.  The chemicals that are regulated by the Clean Air Act at the facility are chlorine and anhydrous ammonia.\n\n(c) The worst-case release scenarios and alternative release scenarios including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nThe worst case scenario for CHWTP involves the catastrophic release of one 90-ton chlorine railroad car.  This will release 180,000 pounds of chlorine into the atmosphere.  The chlorine containment building limits the release rate to 9900 pounds per minute.  RMP Comp was used to calculate the distance to endpoint of 9.9 miles.  The population within this distance is approximately 657,903 persons.  This would include residences, daycare centers, schools, shopping centers, hospitals, business districts, government centers, manufacturing facilities, and nursing homes.\n\nThe alternative case scenarios for CHWTP are described below including the necessary calculations.  RMP Comp was used with the stated release rates to calculate the distance to toxic endpoint.\n\nCrescent Hill Chlorine:\nGuillotine break of a 1\" liquid chlorine header, which conveys liquid chlorine from a 90-ton railcar to an evaporator.  Both the evaporator and the railcar are housed in a 48,032 cubic foot containment building.  \n\nThe railcar excess flow control valve limits the leak rate to 15,000 lbs./hr.  Chlorine leak detectors rapidly detect the leak and activate an automatic tank car shut-off valve and a chlorine scrubber system within two minutes.  The chlorine scrubber is rated for 5,000 scfm and a max"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19815,
      "SummaryText": "imum outlet concentration of 5 PPM.  The following assumptions were made:\n\n1. Temperature remains constant at 770 F.\n2. Due to large floor surface area, the liquid leaked is assumed to evaporate at rate of leak.\n3. Railcar pressure = vapor pressure of chlorine @ 770 F = 113 psia (OCA B.1 Table)\n\nRelease rate calculations:\n1. Leak:  250 lbs./min (15000 lbs./hr.) for 2 minutes for a total of 500 pounds leaked.\n2. Density of chlorine gas in containment building = \n500 lbs./48032 ft3 = 0.01041 lbs./ ft3\n3. Scrubber rating = 5,000 scfm (ft3/min) with maximum outlet concentration of 5 PPM of chlorine.  Time to scrub 500 lbs. of chlorine = \n500 lbs. chlorine/0.01041 lbs./ft X 5000 ft3/min = 9.6 min ; 10 minutes of release\n4. Thus, release to atmosphere duration = 10 minutes\n\nRelease Rate:\n1.Maximum Release concentration = 5 PPM = 0.0145 mg/l\n2. Release Rate = 5000 cfm (ft3/min)\n3. Release in pounds/minute = 0.0145 mg/l X 28.32 l/ ft3 X 1 lb./453,600 mg X 5000 ft3/min = 0.0045 lbs. chlorine/minute\n4. Total Release = 0.0045 lbs./min X 10 minutes = 0.045 lbs.\n5. Percent mitigated by scrubber = 99.991%\n6. Distance to toxic endpoint = <1.0 miles\nThis distance would affect approximately 56 persons in a residential area.  No schools or other facilities would be affected.  The release would be primarily contained to the Louisville Water Company grounds and those residences immediately adjacent to the treatment facility.\n\nCrescent Hill Ammonia:\nA pressure relief valve is sheared from the 62,000-pound ammonia storage tank resulting in a 1\" hole and 1\" gas leak.  Leak is stopped after 60 minutes.  No passive or active mitigation measures were considered.\n\nRelease Calculations:\n1. Tank Pressure = vapor pressure of ammonia @ 770 F = 145 psia (OCA B.1 Table)\n2. Release Rate QR (in lbs./min):\nQR = (APSGF)/ (square root TS)\nQR = release rate of gas from the hole (lb./min)\nA = area of hole (square inch)\nPS = storage pressure (psia)\nGF = Gas factor\nTS = storage temperature of gas (K)\nGF amm"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19815,
      "SummaryText": "onia = 14\nPS = vp ammonia @ 770 F = 145 psia\nTS = 25 + 273.2 = 298.2 K\nA = 0.7854 in2\nQR = (0.7854 X 145 X 14) / (square root 298.2)\nQR = 92 lbs./min\n3. Release Duration = 60 minutes\n4. Total Release = 92 lbs./min X 60 minutes = 5540 lbs.\n5. Distance to Toxic Endpoint = 0.1 mile\nThis distance would affect approximately 56 persons in a residential area.  No schools or other facilities would be affected.  The release would be primarily contained to the Louisville Water Company grounds and those residences immediately adjacent to the treatment facility.\n\n(d) The general accident prevention program and chemical-specific prevention steps.\n\nLWC has installed numerous administrative controls and mitigation measures to reduce the probability of an accidental release of ammonia or chlorine.  The most significant is the containment building, which acts as a passive mitigation device.  This building completely encloses the chlorine storage containers at the water treatment plant.  Active mitigation devices include chlorine scrubbers installed to remove chlorine from the air inside the containment buildings, several in-line automatic chlorine flow shut-off devices, chlorine leak detectors which control the automatic flow shut-off valves, scrubbing system and doors to the containment buildings, excess flow valves installed in railroad cars which protect from accidental catastrophic release from the car, and automatic derailers which prevent runaway railroad cars from entering the containment building on the rails.  Administrative controls include adherence to Process Safety Management, for example, standard operating procedures are utilized throughout the water treatment facility.\n\nStrict adherence to the Process Safety Management Program aids in the prevention of incidents.  The Louisville Water Company Process Safety Management Handbook was recently reviewed and updated to reflect changes in safety processes.  The revision was completed in March 1999.  The Handbook includes ge"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 19815,
      "SummaryText": "neral process safety management, process hazards analysis, management of change procedures, operating procedures, safe work practices, training guidelines, mechanical integrity procedures (including maintenance checklists and daily equipment checks), pre-startup review procedures, emergency response procedures, incident investigation guidelines, and audit guidelines for the program.  \n\n\n(e)  The five year accident history:\nAccording to Federal Register/Volume 61, No. 120, Section 68.42, \"the owner or operator shall include in the five-year accident history all accidental releases from covered processes (ammonia and chlorine) that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage\".  There have been no instances that would satisfy the above criteria within the previous five years of operation of the Louisville Water Company.\n\n(f)  The emergency response plan:\nLWC has individual emergency response plans for each of the water treatment plants regulated by the Clean Air Act.  The plan for CHWTP was placed in effect on March 31, 1992.  The plans specifically detail the Louisville Water Company's emergency response plan in compliance with S.A.R.A. Title III Emergency Response and Community Right to Know Act of 1986.  The plans were coordinated with the Kentucky Emergency Response Commission and the Louisville-Jefferson County, Kentucky Local Emergency Planning Committee. \n\nThe general plan includes:\n1. Steps for the prevention of hazardous material spills - includes ongoing surveys of hazardous material storage and handling and employee training.\n2. Preparation for a spill - includes organization charts for handling the spill and site specific training for containment of the spill\n3. Spill Control Plan - includes the steps in notifying personnel involved and the community.\n\n(g)  Planned changes to improve safety:\nAs a Total Quality Organization,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 19815,
      "SummaryText": " LWC actively encourages improvement to all processes.  All employees are trained to recognize when and how processes can be improved.  Operating under the guidelines of Process Safety Management with the management of change element provides a mechanism for constant internal review and improvement in production quality and safety.  Plus, Process Safety Management requires five-year reviews on all aspects of the program.  Any avenue for improvement in safety missed over the course of the previous five years would be identified during the exhaustive review conducted every five years."
    }
  ]
}