{
  "FacilityID": 19838,
  "FacilityName": "East Turkey Plant",
  "FacilityStr1": "2222 South East Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "97321",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.72",
  "FacilityLongDecDegs": "-119.773056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Zacky Farms",
  "Company2Name": null,
  "CompanyDUNS": 8338980,
  "Company2DUNS": null,
  "OperatorName": "Zacky Farms",
  "OperatorStr1": "2222 S. East Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Fresno",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93721",
  "OperatorZipCodeExt": null,
  "FTE": 258,
  "OtherEPAFacilityID": "CAL920784019",
  "EPAFacilityID": "100000139021",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-01-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-07-30 00:00:00",
  "DeRegistrationEffectiveDate": "2019-07-26 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 36.719167,
  "FRS_Long": -119.774167,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 27826,
      "AltID": "Turkey Slaughter",
      "FacilityID": 19838,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36297,
          "ProcessID": 27826,
          "ChemicalID": 56,
          "Quantity": 9000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28531,
          "ProcessID": 27826,
          "NAICSCode": "31161",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15224,
              "Process_NAICS_ID": 28531,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "PHA_Date": "1999-06-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "Manual inspection of refrigeration equipment, (Daily)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": "1999-06-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22085,
                  "PreventionProgram3ID": 15224,
                  "ProcessChemicalID": 36297
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 19838,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1998-11-15 00:00:00",
    "CoordinatingAgencyName": "Fresno City Fire Department",
    "CoordinatingAgencyPhone": "5592911580",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 19838,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies\n\nWe at Zacky Farms are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program that addresses the design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  \n\nIt is our policy to implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the Region 5 LEPC Inland South, and the Fresno Fire Department, which provide additional emergency response expertise.\n\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nZacky's primary activity in Fresno is poultry processing. At our East Avenue facility, located at 2222 S. East Avenue in Fresno, CA, we store and ship both frozen and fresh poultry products. Ammonia is our only RMP-regulated substance, and is used to provide refrigeration for the cold storage of our poultry products. The maximum inventory of ammonia at our facility is approximately 9,000 lb.\n\n\n3.  The Worst Case Release Scenario and the Alternative Release Scenarios \n(including administrative controls and mitigation measures to limit the distances for each reported scenario).\n\nThe offsite consequence analysis for our facility was completed using the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance and EPA Model RMP for Ammonia Refrigeration. Consequence modeling was conducted to determine the release distances from the site. \n\nThe worst-case release scenario selected was a release from the receiver (the vessel containing the largest amount of ammonia), over a 10-minute release period. This resulted in a release of 7,840 pounds of ammonia. Release distances were calculated"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 19838,
      "SummaryText": "using Class F atmospheric stability and 1.5 m/s windspeed, and toxic endpoint of 0.14 mg/L.  Results for the WCS were modeled using EPA's RMP-Comp based on a toxic gas release that has been liquefied under pressure, and is located in an open space. This resulted in a toxic endpoint distance of 1.1 miles.\n\nThe alternative scenario selected was of an ammonia release occurring due to failure of a fill hose with an inside diameter of >\", while charging the system from an ammonia truck. The scenario results in a release rate of 823 lbs./minute.  The guidance used to develop the release distance did not assume a specific release duration and is applicable to releases of all lengths. In the event of an actual release, it is expected that an operator would intervene to stop the release within 10-minutes.. EPA permits the alternative release scenarios to allow the facility to account for administrative controls and mitigation systems that could be used in case of an emergency. However, for purposes of this analysis, no such mitigation has been assumed.  While mitigation systems and controls do exist, the analysis intended to report more conservative results.\n\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The ammonia refrigeration system is also subject to the OSHA PSM standard under 29 CFR 1910.119, and to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that are in place at our stationary source.\n\nProcess Safety Information\nZacky Farms maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazards Analysis\nOur facility conducts comprehensive studies to ensure that hazards associ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 19838,
      "SummaryText": "ated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of at least five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Zacky Farms has developed written operating procedures.  These procedures address various modes of operation such as initial startup, normal operation, emergency shutdown and startup, and normal shutdown and startup. This information will be regularly reviewed and readily accessible to operators involved in the processes.\n\nTraining\nZacky Farms has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.  All training will be documented and validated.\n\nMechanical Integrity\nZacky Farms carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance is carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Zacky Farms to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a m"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 19838,
      "SummaryText": "odification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Zacky Farms.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nZacky Farms will conduct audits on a regular basis to verify that the provisions set out under the RMP rule are being implemented.  These audits will be carried out at least every 3 years and any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\nIncident Investigation\nZacky Farms promptly investigates any incident that has resulted in, or could have resulted in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nZacky Farms believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, particularly information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Zacky Farms has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 19838,
      "SummaryText": "nformed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.  Five-year Accident History\nZacky Farms has had a good record of preventing accidental releases. No incidents have occurred over the last 5 years (since between June 21, 1994).\n\n6.  Emergency Response Plan\nZacky Farms carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Zacky Farms East Avenue facility coordinates its emergency response plan with the Region 5 LEPC and the Fresno Fire Department.\n\n7.  Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. Completion of all PHA recommendations are expected within the next eighteen months."
    }
  ]
}