{
  "FacilityID": 20066,
  "FacilityName": "A.E. Staley Manufacturing-Dayton",
  "FacilityStr1": "5600 Brentlinger Drive",
  "FacilityStr2": null,
  "FacilityCity": "Dayton",
  "FacilityState": "OH",
  "FacilityZipCode": "45414",
  "Facility4DigitZipExt": "3512",
  "FacilityCountyFIPS": "39113",
  "LEPC": "Greene/Montgomery County LEPC",
  "FacilityLatDecDegs": "39.821167",
  "FacilityLongDecDegs": "-84.169417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": "http:\\\\www.aestaley.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74694746,
  "ParentCompanyName": "Tate & Lyle Citric Acid",
  "Company2Name": null,
  "CompanyDUNS": 74694746,
  "Company2DUNS": 0,
  "OperatorName": "Tate & Lyle Citric Acid",
  "OperatorStr1": "2200 East Eldorado Street",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62521",
  "OperatorZipCodeExt": "1578",
  "FTE": 76,
  "OtherEPAFacilityID": "45414MLSNC5600B",
  "EPAFacilityID": "100000159703",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "08-57-04-1333",
  "SafetyInspectionDate": "1998-10-19 00:00:00",
  "SafetyInspectionBy": "Dayton Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-08-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 39.82126,
  "FRS_Long": -84.16912,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28120,
      "AltID": "Ammonia (Anhydrous)",
      "FacilityID": 20066,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 36730,
          "ProcessID": 28120,
          "ChemicalID": 56,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28836,
          "ProcessID": 28120,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15343,
              "Process_NAICS_ID": 28836,
              "SafetyReviewDate": "1999-06-04 00:00:00",
              "PHA_Date": "1999-02-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Energy Release",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Change in Addition Time",
              "OpProceduresReviewDate": "1997-10-09 00:00:00",
              "TrainingReviewDate": "1997-10-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-03-07 00:00:00",
              "EquipmentInspectionDate": "1999-03-31 00:00:00",
              "EquipmentTested": "Ammonia Tank flanges,etc; Ck Calibration on Instrumentation",
              "ChangeMgmtDate": "1999-02-26 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-04 00:00:00",
              "PreStartupReviewDate": "1999-02-10 00:00:00",
              "ComplianceAuditDate": "1997-06-20 00:00:00",
              "AuditCompletionDate": "1997-12-31 00:00:00",
              "IncidentInvestigationDate": "1997-02-15 00:00:00",
              "InvestigationChangeDate": "1997-03-07 00:00:00",
              "ParticipationPlansReviewDate": "1997-04-29 00:00:00",
              "HotWorkPermitReviewDate": "1994-09-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-09-14 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Ammonia (anhydrous)",
              "_chemicals": [
                {
                  "PrimaryKey": 22295,
                  "PreventionProgram3ID": 15343,
                  "ProcessChemicalID": 36730
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20066,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-06-26 00:00:00",
    "ERTrainingDate": "1999-06-17 00:00:00",
    "CoordinatingAgencyName": "Dayton Fire Department",
    "CoordinatingAgencyPhone": "9372249241",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20066,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nWe at A.E. Staley Manufacturing Company-Dayton are strongly committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\nOur facility's primary activities encompass the manufacture of citric acid.  We have one regulated substance at our facility.  This substance is Ammonia (anhydrous).  Ammonia (anhydrous) is used in the fermentation of dextrose to citric acid.\n\nThe maximum inventory of Ammonia (anhydrous) is 65,000 lb.\n\nTHE WORST CASE RELEASE SCENARIO AND THE ALTERNATE RELEASE SCENARIOS \nTo evaluate the worst case scenario and the alternate release scenarios we have used EPA's RMP Guidance for Waste Water Treatment Plants and EPA's RMPComp software. The following paragraphs provide details of the chosen scenarios.\n\nThe WORST CASE RELEASE SCENARIO submitted involves a catastrophic release from the Ammonia tank.  In this scenario 65,000 lb. of Ammonia (anhydrous) is released in a gaseous form over 10 minutes.  At class F atmospheric stability, 1.5 m/s windspeed, and urban topography a distance of 3.1 miles is obtained corresponding to a toxic endpoint of 0.14mg/L.\n\nTHE AMMONIA ALTERNATE RELEASE SCENARIO involves sending a charge of Ammonia to an empty fermentor when no dextrose is present. This scenario would release 200 lb of Ammonia over 5 minutes.   Under neutral weather conditions of class D atmospheric stability and 3 m/s wind speed and assuming urban topography the maximum distance to the toxic endpoint of 0.14 mg/L of Ammonia (anhydrous) is 0.1 miles.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20066,
      "SummaryText": " AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with ANSI Standard K61.1, 1989 edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nPROCESS SAFETY INFORMATION-A.E. Staley Manufacturing Company-Dayton maintains a record of safety information that describes the chemical hazards, operating parameters, and equipment design associated with all processes.  \n\nPROCESS HAZARD ANALYSIS-Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the What If/Checklist method.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA review for the Ammonia (anhydrous) system was performed February 10, 1999.\n\nOPERATING PROCEDURES-For the purposes of safely conducting activities within our covered processed, A.E. Staley Manufacturing Company-Dayton maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operation, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a maintenance shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTRAINING-A.E. Staley Manufacturing-Dayton has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided as needed.\n\nMECHANIC"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20066,
      "SummaryText": "AL INTEGRITY-A.E. Staley Manufacturing Company-Dayton carries out documented maintenance checks on process equipment to insure proper operations.  Process equipment examined by these checks includes: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nMANAGEMENT OF CHANGE-Written procedures are in place at A.E. Staley Manufacturing-Dayton to manage changes in process chemicals, technology, equipment, and procedures.  The most recent review/revision of maintenance procedures was performed March 7, 1997.  Process operators, maintenance personnel, or any other employee whose job task are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPRE-START UP REVIEW-Pre-start up safety reviews related to new processes and to modifications is established processes are conducted as a regular practice at A.E. Staley Manufacturing Company-Dayton.    These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment in operation.\n\nCOMPLIANCE AUDITS-A.E. Staley Manufacturing Company-Dayton receives corporate audits on a regular basis to determine whether the provisions set out under the PSM rule and RMP rule are being implemented.  The most recent compliance audit was conducted June 20, 1997.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nINCIDENT INVESTIGATION-A.E. Staley Manufacturing Company-Dayton promptly investigates any incident that has resulte"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20066,
      "SummaryText": "d in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEMPLOYEE PARTICIPATION-A.E. Staley Manufacturing Company-Dayton truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In additions, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analysis.\n\nCONTRACTORS-Our company hires contractors to conduct specialized and routine maintenance and construction activities.  Long term relationships have been established with the contractors that work on a routine basis. All contract personnel are required to have site specific training.  This contractor training must be documented before a contractor worker is allowed on the job site.   The contractor safety representative meets with an A.E. Staley Manufacturing Company-Dayton representative regularly.  The contractor notifies A. E. Staley Manufacturing-Dayton about any incident involving a near miss, accident, or injury of contract personnel.  A.E. Staley Manufacturing-Dayton keeps copies of the entire meeting notes and incident investigation reports to document past safety performance.  A.E. Staley Manufacturing Company-Dayton has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nFIVE YEAR ACCIDENT HISTORY\nA.E. Staley Manufacturing Company-Dayton has had an excellent record of preventing accidental "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20066,
      "SummaryText": "releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases of Ammonia (anhydrous) during this period that resulted injury, offsite impact or property damage.\n\nEMERGENCY RESPONSE PLAN\nA.E. Staley Manufacturing Company-Dayton carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan in promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nMontgomery & Greene County Emergency Planning Committee is the Local Emergency Planning Committee with which our emergency plan has been coordinated and verified."
    }
  ]
}