{
  "FacilityID": 20077,
  "FacilityName": "Houma Water Treatment Plant #2",
  "FacilityStr1": "1551 Barrow Street",
  "FacilityStr2": null,
  "FacilityCity": "Houma",
  "FacilityState": "LA",
  "FacilityZipCode": "70361",
  "Facility4DigitZipExt": "0000",
  "FacilityCountyFIPS": "22109",
  "LEPC": "Terrebonne Parish LEPC",
  "FacilityLatDecDegs": "29.58",
  "FacilityLongDecDegs": "-90.721583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Terr. Par. Consolidated Waterworks District No. 1",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TPCW District No. 1",
  "OperatorStr1": "P.O. Box 630",
  "OperatorStr2": null,
  "OperatorCity": "Houma",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70361",
  "OperatorZipCodeExt": "0000",
  "RMPContact": "Bryan Sampey",
  "RMPTitle": "Plant Supervisor",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071307",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-01-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2003-05-08 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 29.58,
  "FRS_Long": -90.72158,
  "FRS_Description": "OTHER",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28132,
      "AltID": null,
      "FacilityID": 20077,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 28848,
          "ProcessID": 28132,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36743,
          "ProcessID": 28132,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536743,
          "ProcessID": 28132,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20077,
      "SummaryText": "27836    LDEQ Facility ID Number\n\n1. Facility accidental release prevention and emergency response policies:\n     Terrebonne Parish Consolidated Waterworks (TPCW) District No.1 pledges to protect the environment and the health and safety of employees and the community in which we operate.  As a public body, we recognize the continuing challenge of fulfilling this pledge while accomplishing our goals.  Each of us shares this responsibility to ensure our long-term success.  To achieve our goals, we will:\n     a. Commit to leadership by operating and growing our business in compliance with legal requirements and TPCW District No. 1 environmental, health and safety operating standards, which may be more stringent.\n     b. Safeguard our employees' health by promoting an accident-free workplace, minimizing exposure to hazardous substances, and providing preventive health care systems.\n     c. Promote safe handling, use and disposal of our products by acquiring and communicating information and education to our employees and customers.\n     d. Minimize the environmental impact of our operations by promoting pollution prevention and environmental conservation.\n     e. Anticipate, evaluate and manage risks by maintaining crisis management programs that emphasize prevention and effective emergency preparedness, response and recovery plans.\n     f. Commit to continuous improvement by monitoring compliance with regulations and our internal standards and by striving for performance, which compares favorably with industry leaders.\n     g. Earn the public trust by communicating openly about our policies, programs and performance and advocating sound laws and regulations.\n  \n2. Facility description and regulated substances handled:\n     The Houma Water Treatment Plant #2 provides drinking water to the City of Houma and Districts 2 (Bayou Grand Caillou) and 3 (Bayou Dularge) in the event that the Houma Water Treatment Plant is non-operational.\n     At this facility, chlorine is the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20077,
      "SummaryText": "only regulated substance that exceeds the threshold quantity for toxicity listed under section 112(r) of the Clean Air Act.  The average inventory includes one (1) one-ton (2,000 lb.) containers on stand-by and one (1) on-line, for a total of 3,000-lbs.  The maximum inventory includes two (2) one-ton (2,000 lb.) containers on stand-by and one (1) on-line, for a total of 6,000-lbs.\n\n3. The worst-case and alternative release scenario's:\n     The worst-case release scenario is failure of a one-ton (2,000 lb.) chlorine container resulting in a direct release.  The entire contents would be released in 10-minutes (200 lbs./min.).  The resulting radius to the toxic endpoint (ERPG-2) is 1.30 miles, with an estimated population of 2,100 people.\n     The alternative release scenario is based on a one-ton (2,000 lb.) chlorine container tubing failure, bad connection, or valve failure resulting in the release of gas through the 5/16-inch diameter valve body opening.  It is assumed that the release is limited by the flow of gas through the 5/16-inch valve and that 702-lbs. is released over 60-minutes (estimated release rate = 11.7 lbs./min.).  The resulting radius to the toxic endpoint (ERPG-2) is 0.10 miles, with an estimated population of 59 people.\n     No passive or active mitigation was considered in the release scenario.  The releases were assumed to occur outdoors (e.g., garage door open in facility chlorine process area) in an urban area.\n     The American Water Works Association (AWWA) Compliance Guidance and Model Risk Management Program for Water Treatment Plants manual was used for reference in preparing the RMProgram submittal.  RMP*Comp (Ver. 1.06) was used to perform the offsite consequence analyses.  LandView .III mapping software was used to obtain census data for the release scenario.\n\n4. The general accidental release prevention program and the specific prevention steps:\n     The facility complies with EPA / LDEQ accident prevention rule and all applicable sta"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20077,
      "SummaryText": "te and local codes and regulations.  This facilities chlorine system was designed and constructed in accordance with standards from the Chlorine Institute.  All facility personnel are certified in safely operating the Chlorine processes performed at this facility.\n\n5. Five year accident history:\n     The Houma Water Treatment Plant #2 had no reportable accidents in the last five (5) years.\n\n6. The emergency response program:\n     In the event of an accident or incident involving the facilities chlorine system, the first responder will notify the Terrebonne Parish Consolidated Government (TPCG) Office of Emergency Preparedness and request that they respond to the emergency.  The TPCG Office of Emergency Preparedness is the primary response service and will work with Fire and Law Enforcement personnel to minimize effects of a hazardous material (HAZMAT) incident.  Depending on the severity of the incident, additional local, state, federal and private resources may be called upon to assist in HAZMAT response.  \n\n7. Planned changes to improve safety:  \n     No changes to improve safety have been reviewed at this time."
    }
  ]
}