{
  "FacilityID": 20098,
  "FacilityName": "RMax, Inc.",
  "FacilityStr1": "1649 South Batesville Road",
  "FacilityStr2": null,
  "FacilityCity": "Greer",
  "FacilityState": "SC",
  "FacilityZipCode": "29650",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45045",
  "LEPC": null,
  "FacilityLatDecDegs": "34.856667",
  "FacilityLongDecDegs": "-82.233333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 91365452,
  "ParentCompanyName": "The Hart Group",
  "Company2Name": null,
  "CompanyDUNS": 91365452,
  "Company2DUNS": 91365452,
  "OperatorName": "RMax, Inc.",
  "OperatorStr1": "1649 South Batesville Road",
  "OperatorStr2": null,
  "OperatorCity": "Greer",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29650",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": "29650RMXNC1649S",
  "EPAFacilityID": "100000166198",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "To Be Issued",
  "SafetyInspectionDate": "1999-05-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-01-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-01-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 34.85516,
  "FRS_Long": -82.23273,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28154,
      "AltID": "Hydrocarbon injection sys",
      "FacilityID": 20098,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36776,
          "ProcessID": 28154,
          "ChemicalID": 115,
          "Quantity": 66000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28870,
          "ProcessID": 28154,
          "NAICSCode": "326121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15365,
              "Process_NAICS_ID": 28870,
              "SafetyReviewDate": "1999-11-03 00:00:00",
              "PHA_Date": "1999-11-05 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-01-17 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Development of loading procedure, Installation of splash shield, Additional spare parts added to maintenance inventory",
              "OpProceduresReviewDate": "2000-01-17 00:00:00",
              "TrainingReviewDate": "2000-01-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-01-17 00:00:00",
              "EquipmentInspectionDate": "2000-01-14 00:00:00",
              "EquipmentTested": "hydrocarbon injection system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-01-17 00:00:00",
              "PreStartupReviewDate": "2000-01-17 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-11-03 00:00:00",
              "HotWorkPermitReviewDate": "2000-01-03 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-01-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22327,
                  "PreventionProgram3ID": 15365,
                  "ProcessChemicalID": 36776
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20098,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Pelham Batesville Fire Department",
    "CoordinatingAgencyPhone": "8648779621",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20098,
      "SummaryText": "RMax, Inc.\n1649 South Batesville Road\nGreer, South Carolina 29650\n\nRisk Management Plan\nExecutive Summary\n\nSource and Process Description\n\nRMax, Inc. (RMax), located at 1649 South Batesville Road, in Greer, South Carolina, is a facility that manufactures foam insulation products for use in both residential and commercial applications. The raw materials used in the production of foam are all liquids and are transported to the facility by truck. The raw materials are stored on-site in bulk tanks ranging in size up to 12,000 gallons, or in drums or totes. The liquid raw materials, through the use of a series of tanks and high pressure pumps, and mixed together and injected between a facer material. Once all of the liquids are combined together in the desired proportions, they react to form a foam. Following the injection, the foam passes through a laminator heater that further solidifies and hardens the foam. Following the laminator, the foam is cut to the desired width and length, stacked, and packaged for shipment. The foam insulation products, once packaged, are typically stored in a separate, on-site warehouse building for short time, prior to their shipment to RMax's customers.\n\nRegulated Substances\n\nIn its manufacturing process, RMax has the ability to use a flammable hydrocarbon, which contains Isopentane (CAS # 78-78-4), as a blowing agent. Isopentane is a substance that is regulated by the EPA's Chemical Accident Prevention Provisions. RMax maintains a supply of this hydrocarbon blowing agent in a 12,000 gallon bulk storage tank, located on-site, for use in its manufacturing process.\n\nRelease Scenarios\n\nIn accordance with EPA's Risk Management Program requirements, RMax has evaluated the potential consequences of an accidental release of Isopentane from its facility. This evaluation included an analysis of a worst case release scenario (as defined by EPA) and an analysis of an alternative release scenario. In both scenarios, the distance to the endpoint and th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20098,
      "SummaryText": "e affected area were determined through the use of formulas taken from EPA's RMP Offsite Consequence Analysis Guidance.\n\nAs defined by EPA, the Worst Case Release Scenario considers an unmitigated release of the entire contents of the largest single container of Isopentane at the facility. This scenario is represented by the release of approximately 66,000 pounds from the on-site bulk storage tank. The amount 66,000 pounds is the tank (12,000 gallons) filled to 90% capacity, the most administratively allowed by RMax. It is assumed that the entire contents is released as vapor and then 10% of the released gas participates in a subsequent vapor cloud explosion. The distance to the endpoint (1 psi overpressure) for this Worst Case Release Scenario is 0.33 miles. Since the facility is in a developed area, the Worst Case Release Scenario does have off-site impacts. Although there are no environmental receptors located within 0.33 miles of RMax, there are several types of public receptors, and a limited estimated residential population.\n\nThe alternative release scenario evaluated considers an accidental release during the process of filling of the tank. In order to provide a conservative estimate, this analysis assumes that: (1) a complete break / disconnect of the tank transfer hose occurs; and (2) Blowing Agent continues to be discharged from the truck for 10 minutes. This would result in the release of approximately 12,000 pounds of Isopentane. It is assumed that the release forms a pool of flammable liquid, which subsequently catches fire. The distance to the endpoint (a radiant heat of 5 kilowatts per square meter) for this Alternative Release Scenario is 0.11 miles. As with the Worst Case Release Scenario, there are no environmental receptors within this distance from the facility, but there are several types of public receptors and a limited estimated residential population. \n\nPrevention of Accidents / Accidental Releases\n\nPrevention of accidents / accidental relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20098,
      "SummaryText": "ses at the facility is accomplished through not only compliance with EPA's Accidental Release Prevention provisions and other Federal and State regulations (including OSHA's Process Safety Management of Highly Hazardous Chemicals requirements), but through application of RMax's corporate philosophies and commitment to provide a safe work environment. RMax believes its employees are an extremely valuable resource. Employee training and employee involvement are important components of its accident / accidental release prevention programs. \n\nSafe work practices are documented through the development and implementation of written operating procedures for production and maintenance personnel. Employee training is comprehensive, focusing on proper procedures for job specific routine and non-routine tasks, as well as providing an overview and awareness of the components of RMax's Risk Management Plan. Training is provided by a competent, experienced person, and employee comprehension of training is assessed through the use of examinations.\n\nPreventive maintenance programs focus on inspection and/or testing of all process components including tanks, piping, pumps, valves, controls, instruments, and safety systems. In addition to helping ensure safe and reliable operation by maintaining the mechanical integrity of the process equipment, the results of this program are used to identify opportunities for system improvement. \n\nNumerous safety systems and controls have been incorporated into RMax's manufacturing process. These include redundant pressure regulators and pressure relief devices, excess and insufficient flow detection and shutoff devices, a gas detection and monitoring system, several ventilation systems, a fire suppression system, and control of potential electrical ignition sources. A variety of sensors and interlocks provide process control and rapid, automatic response to releases or threats of releases, These responses include increased process/building ventila"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20098,
      "SummaryText": "tion, raw material feed shutoff, process shutdown, and activation of facility evacuation alarms.\n\nRMax has implemented a Management of Change program that requires a very detailed safety assessment and management approval for any significant change to equipment, safety systems, and/or operating procedures associated with its manufacturing process. RMax's Contractor Safety Program is designed to ensure any contractors performing work at the facility are experienced, properly trained, and capable of performing the required work as well as informed of the relevant facility hazards, operating and safety procedures.\n\nRMax conducts a Process Hazard Analysis at regular intervals and as needed. This detailed, critical analysis of equipment, procedures, process parameters and potential deviations is used to identify opportunities for incremental safety improvements. \n\nEmergency Action Procedures\n\nRMax has implemented an Emergency Action  Plan that has been prepared in accordance with the requirements of 29 CFR 1910.38. This plan establishes detailed facility evacuation, response, and reporting procedures for potential facility emergencies including, fires/explosions, spills, accidental releases, power failures, natural disasters, bomb threats, civil disturbances, and medical emergencies. The Plan designates a facility Emergency Coordinator who is responsible for implementing the plan during an emergency. The plan also provides for emergency action procedure training for all facility personnel. Emergency action procedures that may be implemented in the event of an accidental release of Isopentane include the use of portable fire extinguishers, facility evacuation, and/or response by the appropriate local agencies. The facility is protected from fire by an automatic sprinkler system. The procedures in this plan have been coordinated with the appropriate local emergency response agencies."
    }
  ]
}