{
  "FacilityID": 20109,
  "FacilityName": "CoorsTek, Arkansas Operations",
  "FacilityStr1": "1912 Dale Street",
  "FacilityStr2": null,
  "FacilityCity": "Benton",
  "FacilityState": "AR",
  "FacilityZipCode": "72015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05125",
  "LEPC": "Saline County OES",
  "FacilityLatDecDegs": "34.548611",
  "FacilityLongDecDegs": "-92.609444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CoorsTek, Arkansas Operations",
  "OperatorStr1": "1912 Dale Street",
  "OperatorStr2": null,
  "OperatorCity": "Benton",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72015",
  "OperatorZipCodeExt": null,
  "FTE": 39,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166278",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-26 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-01-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-01-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-09-15 00:00:00",
  "DeRegistrationEffectiveDate": "2009-07-01 00:00:00",
  "AnniversaryDate": "2005-01-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 34.548611,
  "FRS_Long": -92.609444,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28173,
      "AltID": "SiC CVD",
      "FacilityID": 20109,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 36798,
          "ProcessID": 28173,
          "ChemicalID": 16,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 36799,
          "ProcessID": 28173,
          "ChemicalID": 149,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 28889,
          "ProcessID": 28173,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15382,
              "Process_NAICS_ID": 28889,
              "SafetyReviewDate": "1999-10-22 00:00:00",
              "PHA_Date": "2000-02-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Foam suppression system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-01-07 00:00:00",
              "TrainingReviewDate": "2000-01-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-01-07 00:00:00",
              "EquipmentInspectionDate": "2000-01-07 00:00:00",
              "EquipmentTested": "Process Equipment",
              "ChangeMgmtDate": "1999-09-02 00:00:00",
              "ChangeMgmtReviewDate": "1999-09-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-09-13 00:00:00",
              "HotWorkPermitReviewDate": "1999-09-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-09-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22346,
                  "PreventionProgram3ID": 15382,
                  "ProcessChemicalID": 36798
                },
                {
                  "PrimaryKey": 22347,
                  "PreventionProgram3ID": 15382,
                  "ProcessChemicalID": 36799
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20109,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-11-23 00:00:00",
    "ERTrainingDate": "1999-11-11 00:00:00",
    "CoordinatingAgencyName": "Saline County OES",
    "CoordinatingAgencyPhone": "5013035667",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 20109,
      "SummaryText": "ulated Substances:           Methyltrichlorosilane            Hydrogen\nMaximum Quantity (lbs):                16,000                     11,000 \n\n\n 3.0  Hazard Assessment Results\n\n\nCoorsTek performed an offsite consequence analysis to estimate the potential impacts of accidental releases of the methyltrichlorosilane and hydrogen from our process. The regulated substances were evaluated for a possible worst-case release scenario and alternative release scenario.  It is important to understand that CoorsTek has invested extensive resources to prevent releases, and the potential for a worst-case release is extremely small.  The alternative release scenario represents a more realistic potential for occurrence and is based on historical data from other similar processes.  By identifying these potential releases, CoorsTek has developed an extensive program to prevent such an occurrence. This program is discussed in detail in the Prevention Program section of this plan.\nThe primary objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public and/or the environment as a result of an accidental release.  This point is called the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances farther than the endpoint, the effects would be less.\n\n3.1  Hazard Assessment - Toxic Substances\n\nThe worst-case scenario (WCS) associated with Regulated Toxic Substances is a failure of a 100 gallon storage tank of methyltrichlorosilane (MTS).  A toxic cloud formed by the evaporating MTS would reach offsite endpoints and public receptors.\nAn alternative release scenario (ARS) for MTS releases is a release from an uncoupled hose on the storage tank.  The modeled release lasted for 4.85 minutes before it is stopped.  A toxic cloud formed by the evaporating MTS would reach offsite endpoints and public receptors.\n\n3.2  Hazard Assessment - Flammable Substances\n\nThe worst-c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20109,
      "SummaryText": "ase scenario (WCS) associated with a Regulated Flammable Substance is the failure of a storage vessel containing 10,652 pounds of hydrogen.  Though CoorsTek has numerous controls to prevent such releases, no administrative controls, passive mitigation or active mitigation measures were considered for this release scenario.  The maximum distance to the 1-psi overpressure would reach offsite endpoints in populated areas and nearby public receptors.\nAn alternative release scenario (ARS) for hydrogen is the severing of the hydrogen gas line to the process unit resulting in a flash fire.  The maximum distance to the Lower Flammability Limit (LFL) endpoint would reach only nearby offsite receptors, but would not reach populated areas.\n\n\n4.0  Accidental Release Prevention Program Program 3\n\n\nThe CoorsTek Silicon Carbide Chemical Vapor Deposition Process is covered by the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Silicon Carbide Chemical Vapor Deposition Process Prevention Program consists of the following elements.\n\n4.1  Process Safety Information\n\nCoorsTek maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\n\n7 physical properties of hazardous substances handled,\n7 chemical properties and associated hazards of those substances,\n7 operating parameters and limitation(s) of the process equipment,\n7 design basis and configuration of the equipment, and\n7 specific chemical inventories.\n\nCoorsTek ensures that the process safety information is available to all CoorsTek employees, the Local Emergency Planning Committee (LEPC), and the local fire department.  The Production Manager is responsible for maintaining and updating this information, as needed.\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20109,
      "SummaryText": "ntenance personnel, and\n7 documentation of maintenance activities.\n\n4.6  Management of Change\n\nCoorsTek has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Silicon Carbide Chemical Vapor Deposition Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training related to the change.\n\n4.7  Pre-startup Review\n\nCoorsTek performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\n\n7 construction and equipment are in accordance with design specifications,\n7 adequate safety, operating, maintenance, and emergency procedures are in place,\n7 employee training has been completed, and\n7 for covered processes, a PHA has been performed for new processes and management of change \n  requirements have been completed for modified processes.\n\nA pre-startup review team uses checklists to verify all aspects of readiness.  The review involves field verification of the construction elements and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n4.8  Compliance Audit\n\nCoorsTek conducts periodic audits of the Silicon Carbide Chemical Vapor Deposition Process to ensure the CoorsTek Prevention Program has been effectively implemented and addresses the safety issues of our operations.  Compliance audits are conduct"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 20109,
      "SummaryText": "1.0  Accidental Release Prevention and Response Policies\n\n\nCoorsTek has a long standing commitment to operating our facility in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is the CoorsTek system to help ensure the safe operation of our processes.  Our commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our processes, as well as, extensive training of our operating personnel. \nIn the event of an accidental release, CoorsTek has procedures which are designed to control and contain the release in a manner which will be safe for our employees and will help prevent injury to the public and the environment.  The CoorsTek emergency response personnel receive thorough training in handling accidental releases.  An emergency response coordinator has been assigned to oversee response activities and to coordinate response efforts with local emergency agencies. Communications with the Local Emergency Planning Committee (LEPC) have been ongoing throughout the preparation of this plan and policies.\nIn order to effectively implement these policies, CoorsTek established a management system headed by the Production Manager to ensure the proper implementation and effectiveness of our Risk Management Program.\n\n\n2.0  CoorsTek and Regulated Substances\n\n\nCoorsTek, located in Benton, Arkansas, is primarily involved in the manufacture of aluminum oxide, silicon carbide and tungsten carbide products.  To manufacture one of our products, CoorsTek utilizes Two regulated substances in sufficient quantities to be covered by the Risk Management Program Rule (RMP Rule).  The following table lists the CoorsTek covered process under the RMP Rule and the associated Regulated Substances with their respective maximum quantities:\n\nProcess Description:  Silicon Carbide Chemical Vapor Deposition Process  \nProgram Level:  3\nReg"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 20109,
      "SummaryText": "ed at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Silicon Carbide Chemical Vapor Deposition Process.  The team evaluates the CoorsTek Prevention Program and other aspects of the CoorsTek Risk Management Program.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  CoorsTek maintains records of at least the last two audits conducted.\n\n4.9  Incident Investigation\n\nCoorsTek promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n4.10  Employee Participation\n\nCoorsTek developed a written employee participation program for the Silicon Carbide Chemical Vapor Deposition Process and other aspects of our operations to ensure that the safety concerns are addressed.  CoorsTek encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of the CoorsTek Risk Management Plan (RMP) and participate on PHA and Compliance Audit teams.\n\n4.11  Hot Work Permits\n\nCoorsTek established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility.  CoorsTek utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form must"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 20109,
      "SummaryText": "be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\n\n4.12  Contractors\n\nCoorsTek established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that CoorsTek hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\n\n7 perform their work in a safe manner,\n7 have the appropriate knowledge and skills,\n7 are aware of the hazards in the workplace,\n7 understand what to do in the event of an emergency,\n7 understand and follow the CoorsTek safety rules, and\n7 inform CoorsTek personnel of any hazards identified during their work.\n\nProgram efforts are accomplished by providing contractors with:\n\n7 a process overview,\n7 information about safety and health hazards,\n7 emergency response plan requirements, and\n7 safe work practices prior to beginning work.\n\n\n5.0  Chemical Specific Prevention Steps\n\n\nIn addition to the required prevention program elements, CoorsTek has implemented safety features specific to the hazardous substances used at our facility.  The following describe some of these safety features:\n\n7 specialized maintenance and emergency response training provided by the manufacturer of \n  methyltrichlorosilane,\n7 installation of a foam based fire and vapor suppression system in the event of a spill or fire involving \n  methyltrichlorosilane,\n7 inert gas equipment purging system to reduce the risk of minor releases of methyltrichlorosilane and \n  hydrogen during equipment maintenance activities, and\n7 installation of a leak detection system to warn of releases of methyltrichlorosilane and hydrogen before \n  levels reach hazardous concentrations.\n\n\n6.0  Five-Year Accident History\n\n\nThe CoorsTek Silicon Carbide Chemical Vapor Deposition Pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20109,
      "SummaryText": "is provided in material safety data sheets (MSDSs) and manufacturer guides.  This information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates on the hazards of methyltrichlorosilane and other chemicals used in our processes.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are addressed and communicated to the appropriate parties.\nCoorsTek also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes:\n\n7 materials of construction,\n7 design pressures,\n7 temperature ratings,\n7 electrical ratings,\n7 flow limits,\n7 block flow diagrams,\n7 consequences of deviation from operating limits,\n7 safety systems,\n7 applicable design codes and standards,\n7 process chemistry, and\n7 design basis for relief and ventilation systems.\n\nWhen information was not available for design documents, it was developed through special project committees or during the Process Hazard Analyses (PHAs) of the Silicon Carbide Chemical Vapor Deposition Process.  Many of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\n\n7 train employees,\n7 perform Process Hazard Analyses (PHAs), and\n7 help maintain the equipment.\n\nAll the above mentioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Silicon Carbide Chemical Vapor Deposition Process are not compromised.\n\n4.2  Process Hazard Analysis\n\nCoorsTek performed and will periodically update the process hazard analyses (PHAs) of the Silicon Carbide Chemical Vapor Deposition Process to help identify proc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20109,
      "SummaryText": "ess hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Silicon Carbide Chemical Vapor Deposition Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\nTo perform the PHAs, CoorsTek primarily uses the What-if/Checklist technique.  The PHAs are conducted using a team of people with experience in engineering and Silicon Carbide Chemical Vapor Deposition Process operation and a leader with experience in process hazard analysis techniques.  This team identifies and evaluates hazards of the process as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, including a list of recommendations ranked according to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the Production Manager and is tracked through completion.  The final resolution of each finding is documented and retained.\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, CoorsTek periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Silicon Carbide Chemical Vapor Deposition Process is no longer in operation.  The results and findings of these updates are documented and retained.  The team findings are forwarded to the Production Manager for consideration, and the final resolution of the findings is documented and retained.\n\n4.3  Operating Procedures\n\nCoorsTek engineers, operators, and supervisors work together to develop and maintain written operating procedures to define how tasks related to the Silicon Carbide Chemical Vapor Deposition Process operation should be safely performed.  These written procedure"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20109,
      "SummaryText": "s address various modes of process operations, such as:\n\n7 unit startup,\n7 normal operations,\n7 temporary operations,\n7 emergency shutdown,\n7 normal shutdown, and\n7 initial startup of a new process.\n\nThe written operating procedures include:\n\n7 steps for safely conducting process tasks,\n7 applicable process safety information, such as safe operating limits and consequences of process \n  deviations, and\n7 safety and health considerations, such as chemical hazards, personal protective equipment \n  requirements, and action(s) to take in the event of an exposure to a hazardous substance.\n\n4.4  Training\n\nCoorsTek trains workers to safely and effectively perform their assigned tasks.  The CoorsTek training program includes both initial and refresher training that covers:\n\n7 a general overview of the Silicon Carbide Chemical Vapor Deposition Process,\n7 the properties and hazards of the substances in the process, and\n7 a detailed review of the process operating procedures and safe work practices.\n\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of the CoorsTek ongoing safety training effort.\n\n4.5  Mechanical Integrity\n\nCoorsTek maintains the mechanical integrity of Silicon Carbide Chemical Vapor Deposition Process equipment to help prevent failures that could endanger workers, the public, or the environment.  The CoorsTek mechanical integrity program includes:\n\n7 an inspection and testing program to help identify equipment deterioration and damage before the \n  equipment fails,\n7 a quality assurance program to help ensure that the new and replacement equipment meet the design \n  standards required for service in our process,\n7 procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or \n  equipment opening,\n7 training of mai"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 20109,
      "SummaryText": "cess is a new process at the facility and therefore has no Five Year Accident History.\n\n\n7.0  Emergency Response Programs\n\n\nCoorsTek maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  \nCoorsTek emergency response program includes procedures for:\n\n7 informing the local LEPC, fire department, and public about accidental releases that could reasonably \n  result in offsite consequences,\n7 providing proper first aid and emergency treatment for accidental human exposure to hazardous \n  substances,\n7 evacuation plans and methods for accounting for personnel after an evacuation,\n7 controlling and containing accidental releases of hazardous substances, including the use of emergency\n   response equipment,\n7 inspecting and maintaining emergency response equipment,\n7 post-incident cleanup and decontamination requirements, and\n7 reviewing and updating the emergency response plan.\n\nCoorsTek maintains an emergency response team trained in the emergency response procedures.  All CoorsTek personnel are trained in evacuation procedures.  Drills are conducted periodically to test our evacuation and emergency response procedures.  Annual drills are conducted with local emergency response agencies to ensure emergency plans are properly coordinated. \n\n8.0  Planned Changes to Improve Safety\n\n\nCoorsTek continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes.  As a result of these efforts, CoorsTek has planned the following changes in our process to improve safety:\n\n7 employment of outside resources to assist in en"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 20109,
      "SummaryText": "vironmental, safety and health efforts."
    }
  ]
}