{
  "FacilityID": 20253,
  "FacilityName": "Arapahoe Station",
  "FacilityStr1": "2601 South Platte River Drive West",
  "FacilityStr2": null,
  "FacilityCity": "Denver",
  "FacilityState": "CO",
  "FacilityZipCode": "80223",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08031",
  "LEPC": "Denver LEPC",
  "FacilityLatDecDegs": "39.667778",
  "FacilityLongDecDegs": "-105.004444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "New Century Energies",
  "Company2Name": null,
  "CompanyDUNS": 159835099,
  "Company2DUNS": 0,
  "OperatorName": "Public Service Company of Colorado",
  "OperatorStr1": "1225 17th Street",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dick Chuvarsky",
  "RMPTitle": "Arapahoe Station Manager",
  "FTE": 90,
  "OtherEPAFacilityID": "COD980285951",
  "EPAFacilityID": "100000020764",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "960PDE136",
  "SafetyInspectionDate": "1998-09-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Correction for Chlorine Removal 01/2000",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-02-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-02-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-01-20 00:00:00",
  "DeRegistrationEffectiveDate": "2003-01-08 00:00:00",
  "AnniversaryDate": "2005-02-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 39.62833,
  "FRS_Long": -105.00278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28331,
      "AltID": "Flue Gas Conditioning",
      "FacilityID": 20253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29050,
          "ProcessID": 28331,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36981,
          "ProcessID": 28331,
          "ChemicalID": 49,
          "Quantity": 73600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536981,
          "ProcessID": 28331,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20253,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the Public Service Company of Colorado (PSC) Arapahoe Station.  This correction is submitted to document the deletion of the chlorine system from the facility.   On December 6, 1999, the chlorine system was removed from Araphaoe Station;  this system was previously included in the June 1999 RMP Plan submittal for the facility.  The chlorine system previously used for cooling and process water biocidal control has been replaced with a treatment system not regulated under the EPA RMP rule.\n\nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are represented in the Emergency Planning and Response Sections of the Arapahoe Station PSM/RMP manual for the sulfur dioxide/sulfur trioxide system. PSC takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are properly trained in the safe operation of covered processes and the safe handling of treatment chemicals.  As for emergency response, PSC has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nPSC management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the RMP manual.\n\nStationary Source and Regulated Substances\nArapahoe Station is a coal-burning electric generating station.  The regulated substance handled at this facility is sulfur dioxide/sulfur trioxide.  The maximum sulfur dioxide inventory at the Arapahoe Station is 6500 gallons (73,600 pounds) in the main tank, as maintained using administrative inventory controls.  The maximum amount of SO2 in the day tank is 450 pounds.  (Sulfur trio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20253,
      "SummaryText": "xide is the result of the chemical reaction between the sulfur dioxide and vanadium pentoxide catalyst.  Sulfur trioxide is consumed for emission control by further chemical reactions as it is generated.)\n\nRelease Scenarios\nWorst-case and alternative release scenarios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For worst-case release scenario, the regulation is clear.  The assumption is that the single largest container of a regulated substance (6500 gallons of sulfur dioxide) is released over a ten-minute period.  No active mitigation may be considered.  Worst-case meteorological conditions are also assumed to be present.  The RMP*Comp air dispersion model was used to determine distances to toxic endpoints.  For sulfur dioxide/sulfur trioxide, a distance of 9.1 miles to the toxic endpoint was calculated for a release of 73,600 pounds in ten minutes.  The results of the worst-case release scenario for sulfur dioxide are included in the RMP registration.\n\nThe alternative release scenario for sulfur dioxide consists of a release of 55,960 pounds of sulfur dioxide over a one-hour period due to overpressurization and subsequent failure of the 2 inch safety relief valve on the sulfur dioxide storage tank.  A distance of 1.3 miles to the toxic endpoint was calculated.\n\nPrevention Steps for Sulfur Dioxide System\nThe prevention program and chemical-specific prevention steps are described in detail in the Arapahoe Station Sulfur Dioxide/Sulfur Trioxide System PSM/RMP manual.  The prevention programs include the following elements:\n7 Employee participation, which includes provisions for active participation by plant employees in the development and implementation of the plant PSM/RMP program, as well as ready access to program information\n7 Process safety information, which has been collated into the PSM/RMP manual located in the Arapahoe Station Controlled File Document Room\n7 Process haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20253,
      "SummaryText": "ard analyses (PHAs) - The initial PHA for the sulfur dioxide/sulfur trioxide system was conducted in June 1995.  The PHA was revalidated in March 1999.  All recommendations from the PHAs have been addressed.\n7 Operating procedures for the sulfur dioxide process, which are included in the system PSM/RMP manual\n7 Training for all personnel involved in the operation and maintenance of the sulfur dioxide/sulfur trioxide system\n7 Contractor management policy, which is not to allow contractors to operate or maintain the sulfur dioxide system\n7 Pre-startup safety review procedure for implementation for significant system changes to ensure that the construction and equipment installation is according to design specifications, appropriate procedures are in place and accurate, a PHA has been done and the recommendations resolved, and employees are trained prior to startup of the modified system\n7 Mechanical integrity program through the facility SSR system to ensure that the sulfur dioxide/sulfur trioxide system equipment is maintained in good and safe working condition.  Facility personnel conduct daily visual inspections of the sulfur dioxide system.  The date and equipment included in 7.7b and c address the most recent major PM activity.\n7 Hot work procedures to require the evacuation of the regulated chemicals from the system equipment (using the Arapahoe Station Clearance Procedures) before hot work is performed on the sulfur dioxide/sulfur trioxide system\n7 Management of change program to ensure that proposed system changes are comprehensively evaluated before implementing the change\n7 Incident investigation procedures for the investigation of any catastrophic (or potentially catastrophic) incident associated with the sulfur dioxide/sulfur trioxide system, using the PSCo Root Cause Investigation Report form\n7 Compliance audits to be conducted at least once every three years to ensure the continued compliance of the Arapahoe Station sulfur dioxide/sulfur trioxide PSM/RMP"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20253,
      "SummaryText": " program.  A PSM audit was conducted on the process in 1996; a PSM/RMP audit was conducted on the system in 1999.  Issues identified in the audit were, or are being, addressed.\n7 Trade secrets provisions allowing contractors and employees or their representatives access to system information\n\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of sulfur dioxide/sulfur trioxide meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies.  The program is described in detail in the Emergency Planning and Response section of the PSM/RMP compliance manual and meets the requirement of 40 CFR 68.95.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sought from employees.  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nDuring the development of the Arapahoe Station PSM/RMP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered processes."
    }
  ]
}