{
  "FacilityID": 20266,
  "FacilityName": "Pfister Chemical Inc.",
  "FacilityStr1": "1200 Linden Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Ridgefield",
  "FacilityState": "NJ",
  "FacilityZipCode": "07657",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34003",
  "LEPC": "Ridgefield Boro OEM",
  "FacilityLatDecDegs": "40.842778",
  "FacilityLongDecDegs": "-74.009722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.pfisterchemical.com",
  "FacilityEmailAddress": "Pfister@pfisterchemical.com",
  "FacilityDUNS": 1293216,
  "ParentCompanyName": "Pfister Chemical Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Allan Bendelius",
  "OperatorStr1": "1098 US Route 46 East",
  "OperatorStr2": "Linden Avenue",
  "OperatorCity": "Ridgefield",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07657",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard E. Braun",
  "RMPTitle": "Vice President, Operations",
  "FTE": 54,
  "OtherEPAFacilityID": "07657PFSTRLINDE",
  "EPAFacilityID": "100000157616",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "00381",
  "SafetyInspectionDate": "1999-08-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Pfister Chemical Inc.",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-10 00:00:00",
  "ErrorReportDate": "2000-02-10 00:00:00",
  "ReceiptDate": "2000-02-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-02-07 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2002-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2002-06-19 00:00:00",
  "AnniversaryDate": "2005-02-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 40.8434,
  "FRS_Long": -74.0087,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28344,
      "AltID": "Bromination",
      "FacilityID": 20266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29063,
          "ProcessID": 28344,
          "NAICSCode": "325192",
          "_desc": {
            "NAICS_CODE": "325192",
            "NAICS_DESCRIPTION": "Cyclic Crude and Intermediate Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36994,
          "ProcessID": 28344,
          "ChemicalID": 60,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 60,
            "ChemicalName": "Bromine",
            "CASNumber": "7726-95-6",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536994,
          "ProcessID": 28344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 28345,
      "AltID": "Nitration",
      "FacilityID": 20266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29064,
          "ProcessID": 28345,
          "NAICSCode": "325192",
          "_desc": {
            "NAICS_CODE": "325192",
            "NAICS_DESCRIPTION": "Cyclic Crude and Intermediate Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36995,
          "ProcessID": 28345,
          "ChemicalID": 58,
          "Quantity": 62250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 58,
            "ChemicalName": "Nitric acid (conc 80% or greater)",
            "CASNumber": "7697-37-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536995,
          "ProcessID": 28345,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 28346,
      "AltID": "Sulfonation",
      "FacilityID": 20266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29065,
          "ProcessID": 28346,
          "NAICSCode": "325192",
          "_desc": {
            "NAICS_CODE": "325192",
            "NAICS_DESCRIPTION": "Cyclic Crude and Intermediate Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 36996,
          "ProcessID": 28346,
          "ChemicalID": 69,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 69,
            "ChemicalName": "Oleum (Fuming Sulfuric acid)  [Sulfuric acid, mixture with sulfur trioxide]",
            "CASNumber": "8014-95-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 536996,
          "ProcessID": 28346,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20266,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nPfister Chemical is committed to protecting the public, employees, and the environment while producing chemicals that are important to industry and providing employment for its employees.  This Executive Summary describes the processes that are used at this facility and the precautions that are taken to prevent the escape or release of noxious materials.  \n\nFacility Description\n\nThe Pfister plant occupies the area between US Route 46, the Overpeck Creek, and the north-south CSX Rail tracks, in Ridgefield, New Jersey, and consists of nine buildings, including administrative offices, a laboratory, and the Number 7 process building of interest.  In this building, the regulated chemicals - Bromine, Nitric acid, and Oleum - are used in four reactors.  Although these are reactive and toxic materials, special procedures and controls are used in their handling and processing.  As a result, there have been no serious incidents involving any of these materials since they were first used at the plant.  \n\nWorst-Case Release Scenario\n\nOleum is stored in a 7,500 gallon tank, in a concrete diked area which has sufficient capacity to hold the entire contents of the tank as well as several inches of rainfall.  The vapor pressure of Oleum is so low that in the event of a rupture of the storage tank,  the distance that could be reached by any vapors would be only 1100 feet (0.2 miles).  Such an incident would be considered a \"worst-case\" scenario.  \n\nOleum is received in tank trucks that are approved by the U. S. Department of Transportation [DOT], having capacities up to 45,000 pounds.  It is theoretically possible that a transportation container could rupture.  However, at the Pfister site, \"passive\" mitigation of tank truck releases would occur since any spilled material would run into a trench system which is partially filled with water.  Since Oleum is miscible with water it would be immediately diluted and any vapori"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20266,
      "SummaryText": "zation would be greatly reduced.  \n\nBromine is received in tank trucks or ISO containers that are approved by the U. S. Department of Transportation [DOT], having capacities up to 45,000 pounds.  It is theoretically possible - but highly unlikely (because of the construction and safety devices) - that a transportation container could rupture.  However, at the Pfister site, \"passive\" mitigation of tank truck releases of Bromine is provided, in the form of a water-filled \"drowning pit\" beneath the tank truck being unloaded.  Since Bromine is almost three times denser than water and is not miscible with water, any spilled Bromine would fall through the water, and the \"supernatant\" water layer would prevent vaporization of Bromine.  \n\nThis \"drowning pit\" would also minimize the vaporization of spilled Nitric acid, which also is unloaded at this location, since Nitric acid is very soluble in water.  Any spilled acid would be substantially diluted down to a strength that would not produce vapors.  \n\nAn alternative scenario would be failure of the 3,000-gallon Bromine storage tank, but this tank also is \"passively\" protected by being installed within a 13-foot-by-17-foot dike having a capacity of 4,500 gallons and within an enclosure (that is \"actively\" exhaust-ventilated to a caustic scrubber).  A layer of water is also maintained inside the dike,  so any spilled Bromine would sink beneath it and any evolution of vapors would be prevented.  \n\nComparison of the consequences of these scenarios, in terms of the distances attained by the \"Toxic-Endpoint\" concentrations, indicates that failure of the diked Oleum storage tank would be the \"worst-case\" scenario for this site.  \n\nA \"worst-case\" release could affect nearby businesses.  To determine the consequences of the \"worst-case\" release, the USEPA \"Offsite Consequence Analysis [OCA] Guidance\" is used.  Use of the OCA \"Toxic-Endpoint\" tables leads to the conclusion that a concentration of 0.01 milligram per liter could occur "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20266,
      "SummaryText": "at a distance of about 0.2 mile, for rupture of the diked Oleum storage tank.  Nearly all individuals could be exposed for up to one hour to this concentration without experiencing or developing irreversible or serious health effects or symptoms.  \n\nThe USEPA also requires that the total number of persons resident within a circle having this 1100 foot radius be estimated.  There are not known to be any residences within this potentially affected area.  \n\nAmong the safety features which are provided to prevent the occurrence of the \"worst-case\" (or other) releases are full-time attendance by operators during unloading; devices to prevent overpressurization of the storage tanks or the tank trucks, excess-flow shutoff valves; a \"drowning pit\" under the tank-truck unloading spot for Bromine and Nitric acid; Bromine-leakage detectors; remote-controlled shutoff valves; diking of the storage tanks; water-sprinkler protection against fire exposure to containers; and systems to control temperatures, pressures, container levels, and flows.  \n\nAlternative Release Scenarios\n\nThe USEPA also requires that consequences of \"alternative\" release scenarios be evaluated, such as leaks from piping or other equipment for each of the regulated materials.  With the close control of storage, transfers, and processes, such releases are unlikely and would be stopped promptly.  As a result, it is unlikely that the safety of the public, the environment, or employees would be affected by Pfister operations.  \n\nAccidental Release Prevention Programs\n\nOperations involving Bromine, Nitric acid, and Oleum (sulfur trioxide in sulfuric acid) at the Pfister plant are regulated by the \"Process Safety Management\" standard of the Occupational Safety and Health Administration and by the \"Accidental Release Prevention\" standard of the U. S. Environmental Protection Agency.  To comply with these standards, Pfister follows strict guidelines for operating procedures, training of employees, analysis of process"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20266,
      "SummaryText": "es for potential hazards, preventive maintenance programs, emergency plans, and investigation of incidents, with employee participation in this process safety effort.  In addition, the Pfister facility has been involved in the New Jersey Toxic Catastrophe Prevention Act [NJTCPA] program since its inception in 1990.   There have been annual reviews of the regulated processes, annual inspections of the facility by the New Jersey Department of Environmental Protection, and two process-safety audits by an independent consultant since that date.  \n\nFive-Year Accident History\n\nThere have been no incidents involving release of Bromine, Nitric acid, or Oleum in the past five years.  The most-recent incident occurred on September 3, 1992, and involved the release of about 1/2 pound of bromine from a pump (in the storage-tank dike) which was believed to be empty.  An employee was injured when some of the Bromine entered a glove, but there were no off-site effects.  \n\nEmergency Response Program\n\nAs a part of the NJTCPA program, the Pfister facility has conducted emergency-response drills every year since 1990.  Most of these drills have involved the Ridgefield Police and Fire Departments, the Local Emergency Planning Committee, Bergen County Hazmat and the Mid Bergen Mutual Aid Group as well as employees who are trained to recognize and respond to the simulated emergency situation and to activate shutdown and other protective systems.  Annual tours are arranged for members of the Fire Department, to show the locations of the unloading and storage facilities and fire protection systems.  A weather station is maintained on-site, to provide information to local authorities regarding the protection of occupants of residences and business establishments in the downwind direction.\n\nPlanned Changes to Improve Safety\n\nAdditional containment will be provided around the Nitric acid storage tank.  There will be improvements made to the Bromine storage,  and extra containment provided.  \n"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20266,
      "SummaryText": "\nThe improvements that have been made to the Bromine, Nitric acid, and Oleum facilities recently and over the past ten years provide for continued safe operation and protection of the public, environment, and employees."
    }
  ]
}