{
  "FacilityID": 20315,
  "FacilityName": "Amfine Chemical Corporation",
  "FacilityStr1": "6805 John Rivers Road",
  "FacilityStr2": null,
  "FacilityCity": "Hopkinsville",
  "FacilityState": "KY",
  "FacilityZipCode": "42240",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21047",
  "LEPC": "Christian County E. O. C.",
  "FacilityLatDecDegs": "36.7875",
  "FacilityLongDecDegs": "-87.376667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "G1",
  "LatLongDescription": "FC",
  "FacilityURL": "www.amfine.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 847934924,
  "ParentCompanyName": "Asahi Denka Kogyo Japan",
  "Company2Name": "Mitsubishi Corp. Japan / Mitusubishi Int. USA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Steve Buchanan, Plant Manager",
  "OperatorStr1": "6805 John Rivers Road",
  "OperatorStr2": null,
  "OperatorCity": "Hopkinsville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42240",
  "OperatorZipCodeExt": null,
  "FTE": 32,
  "OtherEPAFacilityID": "KYR-000-028-225",
  "EPAFacilityID": "100000172868",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-09-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-11-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-11-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-11-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-11-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.790449,
  "FRS_Long": -87.378331,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28405,
      "AltID": "NA-11",
      "FacilityID": 20315,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37073,
          "ProcessID": 28405,
          "ChemicalID": 70,
          "Quantity": 2175.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29124,
          "ProcessID": 28405,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15477,
              "Process_NAICS_ID": 29124,
              "SafetyReviewDate": "2000-08-06 00:00:00",
              "PHA_Date": "1999-07-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-08-06 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Under Trial Production",
              "OpProceduresReviewDate": "2000-09-01 00:00:00",
              "TrainingReviewDate": "2000-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Simulated",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-10-01 00:00:00",
              "EquipmentInspectionDate": "2000-10-30 00:00:00",
              "EquipmentTested": "Vessel VE-7201",
              "ChangeMgmtDate": "2000-08-04 00:00:00",
              "ChangeMgmtReviewDate": "2000-08-04 00:00:00",
              "PreStartupReviewDate": "2000-09-24 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2000-10-06 00:00:00",
              "InvestigationChangeDate": "2000-10-06 00:00:00",
              "ParticipationPlansReviewDate": "2000-10-18 00:00:00",
              "HotWorkPermitReviewDate": "2000-08-04 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-08-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22455,
                  "PreventionProgram3ID": 15477,
                  "ProcessChemicalID": 37073
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 28406,
      "AltID": "PEP-36 / PEP-24",
      "FacilityID": 20315,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37074,
          "ProcessID": 28406,
          "ChemicalID": 59,
          "Quantity": 3380.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29125,
          "ProcessID": 28406,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20315,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-07-07 00:00:00",
    "ERTrainingDate": "2000-07-07 00:00:00",
    "CoordinatingAgencyName": "Cristian county EOC",
    "CoordinatingAgencyPhone": "2708901400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20315,
      "SummaryText": "Executive Summary\n\nAmfine Chemical Corporation was incorporated in March of 1994 by Asahi Denka Kogyo and Mitsubishi Corporation. Amfine manufactures and markets a wide variety of specialty plastic additives, including Nucleating Agents, high-molecular weight Ultraviolet Absorbers, high-performance Antioxidants, and Heavy Metal ''FREE'' heat stabilizers for PVC. These value added products give longevity, increased physical properties and greater processability to many types of plastics which find their way into our every day life.\n\nThe Amfine's specialty organic chemical manufacturing facility in United States is located at 6805 John Rivers Road in Hopkinsville, Christian County, Kentucky.  This facility was constructed in 1999/2000 on approximately 8 acres of the 43 acre site. Currently, the plant is in startup/trial production phase. Commercial production is expected to start in Dec 2000. The 1997 North American Industrial Classification Standard (NAICS) is #325199 and the 1987 Standard Industrial Classification Code (SIC Code) for Amfine is specified as #2869.  \n\nAmfine is committed to continuous improvement in all aspect of safety and environmental performance. Plant manager is responsible for operating the plant and has overall responsibility for compliance with all aspect of Risk Management Plan.\n\nThe facility receives bulk deliveries of chemical products, water treatment chemicals, and deliveries of other materials related to operations by truck. Finished products are stored inside the main manufacturing building in the warehouse area. The facility also stores nitrogen in a 6000-gallon pressure vessel for process purposes. In the event of a vessel or pipe leak, the materials would immediately vent to atmosphere. \n\nChemicals used at the facility are stored at the Tank Farm (south end), Hazardous Material Building (east side), and Flammable Raw Materials in drums (east side). The tanks are contained inside separately diked secondary containment. All bulk liquid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20315,
      "SummaryText": "is stored in the tank farm. Delivery of these chemicals is by tanker trucks in the unloading area. Hazardous waste at the site is segregated according to the waste stream and its chemical compatibility.  Hazardous waste in drums will be stored for a maximum of 90 days as per EPA regulations.\n\nAmfine also manages a wastewater Pre-treatment system for its low concentration process wastewater and non-contact wastewater. Wastewater produced inside the facility is discharged into the sanitary sewer system upon proper treatment in pre-treatment system.  Hopkinsville Water Authority serves the sanitary sewer system. No RMP regulated material has been identified in wastewater pre-treatment area.\n\nExcept for PVC stabilizers, all products are manufactured in the Process Area. All Amfine processes are batch process. The process starts by feeding a mixture of reactants along with catalyst and other chemicals into the main reactor.  The reaction takes place both under normal pressure as well as under vacuum. Once the reaction is complete, oil and water phases are separated. Water phase is sent to a recovery vessel for the recovery of chemicals. Oil phase containing the product, is sent to the crystallizer where solvent is boiled off. The vessel is cooled down slowly, at which time the product crystals are allowed to form. Raw recovered solvent is sent to solvent recovery vessels where it is further purified and is sent to Tank Farm for storage.\n\nThe product slurry is then fed into the centrifuge, and rinsed with solvent and/or water.  The wet bed cake is scraped into a hopper, which is eventually fed into the dryer.  Once the product is dry, it is further processed by mill to its final particle size in the Powder Handling Area. Powder Handling area houses particle size reduction equipment and a powder mixer. \n\nAmfine's Hopkinsville facility is an OSHA PSM covered facility. This facility has several process vessels, heat exchangers and pumps. Amfine also maintains cooling tower,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20315,
      "SummaryText": "air compressors, chillers and two natural gas fired boilers to meet its utilities demand. All equipment including piping and control systems meet applicable design code and standards as required by regulations and/or suggested by good engineering practices.   Amfine is register with Kentucky EPA air quality division as minor source and is, therefore, not covered by CAA title V. However, all vents from the process go through one of three scrubbers to insure that the air discharge surpasses the air quality standard. Amfine is a hazardous waste generator. This facility is registered with DOT as a Large Quantity Generator and is committed to be in compliance with RCRA. All Amfine members have been provided initial OSHA and EPA mandated training. This training will be updated on an as required basis. \n\nAmfine uses several chemicals to manufacture its non-hazardous plastic additives. Two EPA's RMP- regulated substance exceeding the threshold quantity has been identified:  Phosphorous oxychloride and phosphorous trichloride at a maximum quantity of 46,000 lb. These raw materials are stored in 600 lb drum. Other hazardous chemicals that Amfine uses are: acetone, methanol, xylene, tri-ethylamine, di-ethylamine, caustic soda, para-formaldehyde. Though these chemical are not RMP regulated chemical, Amfine has contingency plan to deal with any accidental release. An updated list of all chemicals used by the facility has been provided to Hopkinsville Fire Department and Christian County Emergency Operation Center.\n  \nAmfine's offsite consequence analysis, using EPA RMP-Comp, indicated that a worst-case toxic release could have an offsite impact. This scenario was based on the failure of 600 lb drum containing phosphorous Oxychloride and phosphorous trichloride. A 600 lbs release of phosphorous Oxychloride would cause a toxic end point 0.0030 mg/l at an estimated distance of 1.0 mile. A similar release of phosphorous trichloride will have an end point concentration of .028 withi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20315,
      "SummaryText": "n 0.2 of a mile. To prevent such a catastrophe from occurring one third of Amfine's work force is trained in HAZMAT. It is important to note that parent company Asahi Denka Kogyo has handled this material safely for over thirty years. Training, operating procedures, safety systems and preventive maintenance programs are all in place to insure safe handling of this material.  Since the begining of startup in May 2000, there has been no reportable accident.\n\nUsing same approach an alternate release scenario for phosphorous oxychloride and phosphorous trichloride, an alternative release scenario was also developed that could have an offsite impact. Alternate release scenario was based on assumption of overfilling Feed vessel from drum using manual drum pump. An 8 lbs release of phosphorous oxychloride would cause a toxic end point 0.0030 mg/l at an estimated distance of .2 miles. Phosphorous trichloride will have an end point concentration of .028 with in one tenth of a mile.\n\nAmfine has Emergency Response Program for managing an emergency crisis to that may arise due to a chemical release. This plan is focused on protecting the life, health and well being of employees and the general public; protecting the company, community and personal property; and protecting the environment. In case of any chemical release, fire or other emergencies of similar nature alarm will sound in the whole plant. Hopkinsville Fire Department and Christian County Emergency Operation Center will be notified by alarm system default. Alarm system is tested frequently. Amfine has trained all its employees on Emergency Response Program. This training will be updated on an as needed basis."
    }
  ]
}