{
  "FacilityID": 20310,
  "FacilityName": "ASH GROVE CEMENT COMPANY - FOREMAN, ARKANSAS",
  "FacilityStr1": "4457 HIGHWAY 108",
  "FacilityStr2": null,
  "FacilityCity": "FOREMAN",
  "FacilityState": "AR",
  "FacilityZipCode": "71836",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05081",
  "LEPC": "Little River LEPC",
  "FacilityLatDecDegs": "33.692778",
  "FacilityLongDecDegs": "-94.422222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ashgrove.com",
  "FacilityEmailAddress": "mike.harrell@ashgrove.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "ASH GROVE CEMENT COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 614256501,
  "Company2DUNS": 614256501,
  "OperatorName": "ASH GROVE CEMENT COMPANY",
  "OperatorStr1": "P.O. BOX 25900",
  "OperatorStr2": null,
  "OperatorCity": "OVERLAND PARK",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66225",
  "OperatorZipCodeExt": null,
  "FTE": 184,
  "OtherEPAFacilityID": "71836SHGRVPOB",
  "EPAFacilityID": "100000172813",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "75-AR-9",
  "SafetyInspectionDate": "1999-02-02 00:00:00",
  "SafetyInspectionBy": "MINING SAFETY & HEALTH AD",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-11-07 00:00:00",
  "ErrorReportDate": "2000-11-07 00:00:00",
  "ReceiptDate": "2000-10-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-10-09 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2010-11-16 00:00:00",
  "DeRegistrationEffectiveDate": "2010-08-23 00:00:00",
  "AnniversaryDate": "2005-10-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.6953,
  "FRS_Long": -94.423,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28400,
      "AltID": "CEMENT MANUFACTURING",
      "FacilityID": 20310,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37064,
          "ProcessID": 28400,
          "ChemicalID": 35,
          "Quantity": 22700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 37065,
          "ProcessID": 28400,
          "ChemicalID": 29,
          "Quantity": 170300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 37066,
          "ProcessID": 28400,
          "ChemicalID": 4,
          "Quantity": 35300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 37067,
          "ProcessID": 28400,
          "ChemicalID": 27,
          "Quantity": 36200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29119,
          "ProcessID": 28400,
          "NAICSCode": "32731",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11112,
              "Process_NAICS_ID": 29119,
              "SafetyReviewDate": "1999-06-14 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "API 620 (Newer Standard); API 650 (2 small tanks)",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-14 00:00:00",
              "ChangeCompletionDate": "2000-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-14 00:00:00",
              "TrainingReviewDate": "1997-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-14 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "INSPECTIONS ARE CARRIED OUT DAILY, WEEKLY AND MONTHLY ON THE UNLOADING, SAMPLING, PROCESSING AREAS AND TANK STORAGE UNITS.",
              "ComplianceAuditDate": "1999-06-14 00:00:00",
              "AuditCompletionDate": "1999-06-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 11641,
                  "PreventionProgram2ID": 11112,
                  "ProcessChemicalID": 37064
                },
                {
                  "PrimaryKey": 11642,
                  "PreventionProgram2ID": 11112,
                  "ProcessChemicalID": 37065
                },
                {
                  "PrimaryKey": 11643,
                  "PreventionProgram2ID": 11112,
                  "ProcessChemicalID": 37066
                },
                {
                  "PrimaryKey": 11644,
                  "PreventionProgram2ID": 11112,
                  "ProcessChemicalID": 37067
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20310,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-11-01 00:00:00",
    "ERTrainingDate": "1997-11-01 00:00:00",
    "CoordinatingAgencyName": "FOREMAN FIRE DEPT.",
    "CoordinatingAgencyPhone": "8705426222",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20310,
      "SummaryText": "INTRODUCTION\nThe Ash Grove Cement Plant (the Plant), located in Foreman, Arkansas, manufactures portland cement in three rotary kilns using the wet process.  Liquid waste-derived fuel (LWDF) is used to supplement coal and natural gas.  LWDF is received from clients who ship the waste to Ash Grove as a method of disposal.  Prior to shipment of any LWDF, each client must submit a waste profile and prequalification sample to Ash Grove.  Clients are required to disclose any 112(r) listed chemicals present in the waste stream.  Ash Grove subsequently quantifies the waste stream to determine the concentration of hazardous chemicals, including the 112(r) listed chemicals, that are present.  Ash Grove accepts, accepts conditionally, or rejects the waste stream based on this information.  Once a waste stream profile is accepted, Ash Grove performs additional testing as the LWDF arrives to ensure that it matches the waste profile and that it can be managed in accordance with the Plant's Waste Analysis Plan.\n\nIt is possible to receive wastes that have in excess of one percent of a 112(r) listed chemical, and it is possible, under rare conditions, that the listed chemicals can reach or exceed one percent of a storage tank volume.  In order to plan and prepare for such an occurrence, Ash Grove has developed this Risk Management Plan (RMP).  The Plan will be submitted as a predictive filing for all the 112(r) listed chemicals that have been identified in existing waste profiles.  Waste profiles submitted or updated in the future will be reviewed for 112(r) listed chemicals.  If listed chemicals not previously included in the RMP are identified; the RMP will be updated to include them before accepting the waste on site.  \n\nPLANT DESCRIPTION\nThe Plant is located at 4457 Highway 108, Foreman, Arkansas in a rural area and has been in operation since 1956.  The surrounding population includes commercial and residential properties as well as public access sites.  Highway 108 runs throu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20310,
      "SummaryText": "gh the northern portion of the property.  A rail line also services the facility.  The plant manufactures over 900,000 tons per year of portland cement.  Limestone is mined on site, crushed, ground and added to water with other raw materials to form a slurry.  The slurry is fed to kiln numbers 1, 2 and 3 and processed to form portland cement clinker.  The clinker is mixed with a small amount of gypsum and ground to produce portland cement.  Coal is the primary fuel source for heating the rotary kilns.  Natural gas can be used also.  Hazardous waste-derived fuel (HWDF), including liquid waste-derived fuel (LWDF) and solid waste-derived fuel (SWDF), and tires are used as supplemental fuels.  The LWDF is pumped from the storage tanks to the kilns through a series of pipes and valves.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY REPONSE POLICIES OVERVIEW\nAsh Grove is committed, at both the corporate and plant level, to reducing the risks of accidental releases and minimizing the impacts if such a release occurs.  This commitment is demonstrated by the following programs and activities:\n\n  *  Plant security procedures and equipment, including surveillance and fences.\n\n  *  Documented safety inspection schedules and checklists.\n\n  *  Design and construction of equipment and structures to prevent releases. \n\n  *  A contingency plan to minimize hazards should a release occur.  \n\n  *  A well-documented and managed personnel training program to provide workers with tools to meet \n     desired safety goals.\n\n  *  Well-documented Standard Operating Procedures to provide consistent, safe guidelines for executing \n     work in a manner that minimizes potential for releases.\n\nLIQUID WASTE-DERIVED FUEL (LWDF) SYSTEM DESCRIPTION\nAsh Grove accepts only approved waste shipments based on an initial characterization of the LWDF.  Corrosive and reactive materials, shipments containing polychlorinated biphenyls, and LWDF with inadequate heat content are not accepted.  Additional qualitati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20310,
      "SummaryText": "ve and quantitative testing is conducted on the waste fuel as shipments are delivered.  LWDF is delivered by both rail car and truck.  The maximum rail car and truck loads are approximately 180,000 pounds and 40,000 pounds, respectively.  The maximum LWDF storage capacity is approximately 1,330,000 pounds.  The largest storage vessel on site is a 100,000 gallon tank (approximately 834,000 pounds).  There are also two 25,000 gallon storage vessels.  New shipments of LWDF are transferred to the 25,000 gallon tanks and blended.  The contents of the 25,000 gallon tanks are then transferred to the 100,000 gallon tank for further blending and storage prior to being fed to the kilns.  At no time are shipments of LWDF unloaded directly from delivery tank trucks or rails cars  to the cement kilns. \n\nAsh Grove tests every shipment of LWDF prior to unloading to ensure it meets all specifications for acceptability in accordance with the Plant's Waste Analysis Plan.  LWDF typically consists of a mixture of oil and grease (40-60%), water (10-15%), volatile organic liquids (10-15%), metal oxides (2-5%), and other chemicals.  The heat content is typically in the range of 11,000-14,000 Btu/lb.  The majority of LWDF shipments contain no 112(r) listed toxic chemicals.  Historical records of waste characterization tests show that a very small percentage of shipments contain small amounts of 112(r) listed toxic chemicals. \n\nTOXIC CHEMICALS\nAsh Grove conducts Gas Chromatograph/Mass Spectrometer (GCMS) analysis on LWDF prequalification waste stream samples sent by prospective suppliers and on annual requalification of the same waste streams.  If a supplier changes its waste stream during the year, it is required to submit another prequalification sample to Ash Grove for analysis.  The GCMS provides a Relative Area Percent (RAP) measurement for a toxic chemical present in the waste stream sample.  The RAP is the ratio of the toxic chemical to the sum of all organic compounds detected using"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20310,
      "SummaryText": "the GCMS.  The GCMS does not detect some constituents including water, metals, oxides and some heavy organics; thus, the RAP overstates the actual percent of a given toxic chemical by a factor of two or more.  \n\nIf a 112(r) listed chemical is identified during the prequalification or the requalification, a management decision is made as to whether or not the waste stream will be accepted, accepted conditionally or rejected.  If waste streams containing 112(r) listed chemicals not previously included in the RMP are accepted, the RMP will be updated to include the new chemicals prior to acceptance on site. \n\nDuring a review of waste profiles and analytical data from the last four-years, six different 112(r) listed toxic chemicals that may have been received at the Foreman Plant were identified.  The six chemicals identified are:\n\n  *  chloroform (CAS # 67-66-3),\n  *  crotonaldehyde, (E)- (CAS # 123-73-9),\n  *  vinyl acetate monomer (CAS # 108-05-4),\n  *  allyl alcohol (CAS  107-18-6).\n\nEach of the chemicals identified would be delivered as a constituent of a mixture of wastes.  The concentration is, in all cases, small.  No 112(r) listed chemical is received in pure form.  However, the RMP rule arbitrarily requires that a worst case release scenario be developed for a release of pure chemical.  In order to fulfill the requirements of the rule, the off-site consequence analyses were made for each of the identified chemicals as if they were spilled in pure form and the entire amount of the listed chemical was readily available for release.   \n\nWORST-CASE RELEASE SCENARIO\nThe worst-case release scenario is based on the calculated loss of the largest, single storage tank at the Plant in accordance with the definition provided in the Environmental Protection Agency  (EPA) guidance for RMP development.  Only passive control systems, namely the secondary containment area and enclosure surrounding the LWDF tank, were taken into consideration as mitigating factors.  The condi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20310,
      "SummaryText": "tions of the scenario, including release time and weather conditions are those provided in the EPA Off-Site Consequence Analysis Guidance.  Modeling of the area of potential impact was performed using the RMP*Comp software developed by the EPA.\n\nFor modeling purposes, it was assumed that one 100,000 gallon tank ruptures and releases 834,000 pounds of material (LWDF) at the maximum RAP determined for each chemical.  As required by EPA guidance, the release scenario assumes that the quantity of the vessel is spilled instantaneously to form a liquid pool.  In this case, the liquid will collect in a diked area, the surface area of the actual pool created is used to determine the volatilization rate of the liquid.  The toxic chemical is considered to pose no further risk to the public when it has dissipated to a concentration less than the toxic endpoint specified in the RMP rule.\n\nThe results of the Off-Site Consequence Analysis are presented in the table below:\n\nChemical                                Maximum RAP(%)   Distance to Endpoint (miles)  Number of Persons Affected\nCrotonaldehyde, (E)-                      3.14                               0.4                                          25\nVinyl Acetate Monomer                23.56                               0.3                                          25\nChloroform                                     4.88                                0.3                                          25\nAllyl Alcohol                                   5.0                                  0.4                                          25\n\nIt is emphasized that these results are unrealistic due to the fact that the chemical of concern is not readily available for release because it is part of a mixture.  \n\nMaps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.  Potential receptors include:\n\n  *  A commercial trucking facility located on property leased"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20310,
      "SummaryText": "from Ash Grove and \n\n  *  Residential housing.\n\nALTERNATIVE RELEASE SCENARIOS\nThe alternative release scenario is, by definition, a more likely release scenario than the worst-case.  Engineered controls, such as chemical detection systems and alarms, are considered in the analysis.  Modeling was again performed using RMP*Comp.  As with the worst-case release scenario, conditions of the alternative release scenario, including release time and weather conditions, are dictated in the EPA Off-Site Consequence Analysis Guidance. \n\nThe type of system failure selected for the alternative release was the loss of LWDF due to a release from a rail car.  Railroad tracks enter the property from the northwest.  They cross Highway 108 before reaching the LWDF unloading area.  This crossing is not equipped with warning lights or crossing gates.  In the event of the railcar being hit by an oncoming vehicle, the entire contents of the railcar, up to 180,000 pounds, could be released.  For modeling purposes, it was assumed that the 112(r) listed chemicals are present at a concentration of one percent, or 1,800 pounds, and the release occurs over a period of ten minutes. \n\nThe results of the Off-Site Consequence Analysis using RMP*Comp are shown in the table below:\n\nChemical                         Distance to Endpoint(miles)   Number of Persons Affected\nCrotonaldehyde, (E)                     0.2                                             10\nVinyl Acetate Monomer                0.1                                             10\nChloroform                                    0.1                                            10\nAllyl Alcohol                                  0.2                                            10\n\nIt is emphasized that these results are unrealistic due to the fact that the chemical of concern is not readily available for release because it is part of a mixture.\n\nA map of the area is provided in the Off-Site Impact Analysis Section.  Potential receptors include:"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20310,
      "SummaryText": "*  A commercial trucking facility located on property leased from Ash Grove.\n\nPROCESS HAZARD ANALYSIS\nA process hazard analysis (PHA) was performed on the LWDF system beginning with railcar and truck unloading and ending with the LWDF entering the kiln burners.  A combination checklist and modified What if type of analysis was used.  General questions regarding the storage and use areas as well as practices and protocols associated with the management of the LWDF system were answered.  A copy of that checklist is included in this plan.  Following the checklist, each valve, line and piece of equipment in the system was assessed from the initial LWDF storage tank to the point of LWDF introduction to the burners using system flow diagrams.  The valves and other points in the systems where LWDF could be released are identically numbered in the field and on the facility inspection forms.  Compliance with code requirements, considerations of potential failure, maintenance and inspection concerns and standard operating procedures were reviewed for each point in the system.  The results of the PHA are summarized in the Process Hazard Analysis section.\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\nAll LWDF storage tanks include pressure relief valves, breathing vents, high-level sensor alarms, and pump shut-off switches.  LWDF storage tanks are inspected daily, weekly, monthly, or annually as prescribed in the LWDF Tank Inspection Schedule.  The daily, weekly, and monthly inspections cover the following:\n\n  *  Exterior portions of the LWDF tanks to detect corrosion, erosion, and leaking of fixtures and seams. \n     Specifically, the exterior of the tanks and associated piping are inspected for discoloration, deteriorated\n     paint, cracks, bulges, ruptures, and wet spots.  \n\n  *  Areas immediately surrounding the tanks and within the containment area for obvious signs of leakage, \n    such as wet spots or discoloration.  \n \n  *"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 20310,
      "SummaryText": "Overfill controls on the tanks for proper functioning.\n\n  *  Transfer piping from the LWDF tanks to the kilns for leaks, corrosion, or deterioration.  \n\nThe annual inspection includes the following:\n\n  *  An independent, registered professional engineer performs visual inspection of the tank exteriors, \n     measures the tank wall thickness and checks process piping, in critical wear areas, for wall thickness.  \n\nThe LWDF feed system will automatically shut off if operating conditions deviate from established ranges.  Trucks and rail cars delivering LWDF are inspected upon arrival and at least daily thereafter.  The transfer equipment and overfill/ spill control equipment is observed hourly while LWDF is being transferred.  Other security, safety, and emergency equipment are inspected weekly and monthly.  Ash Grove has documented Standard Operating Procedures (SOP)s that address LWDF transfers to minimize the risks of spill or release.\n\nEMERGENCY RESPONSE PROGRAM\nAsh Grove has a contingency plan that addresses the manner in which facility personnel would respond in the event of an emergency spill or release.   The contingency plan is designed to minimize hazards to human health, the environment, and public and private property.   Emergency responder names, titles, addresses, responsibilties, and telephone numbers are provided for personnel within and outside Ash Grove.  Agreements for emergency assistance have been secured from the following agencies:\n\n  Foreman Fire Department\n  Little River County Sheriff's Office\n  Little River Memorial Hospital\n  Wadley Regional Medical Center\n  St. Michael Health Care Center\n  Ashdown Medical Clinic\n  Arkansas Emergency Transport (AET)\n  Lifenet Helicopter Service\n  Lifenet Ambulance\n  Waste Services Inc.\n  Spilltech Services, Inc.\n  PWI Transport and Industrial Waste Division\n\nA copy of the plan is included as an appendix to this RMP.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nAsh Grove corporate and plant staff periodically reviews"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 20310,
      "SummaryText": "safety practices at the Plant. Recommended changes in equipment, procedures, training, or management practices are implemented as soon as practical.  The recent PHA did not result in significant recommendations to be implemented.\n\nFIVE-YEAR ACCIDENT HISTORY\nThe plant has had no accidental releases as defined in 40 CFR Part 68.3 over the last five years."
    }
  ]
}