{
  "FacilityID": 2038,
  "FacilityName": "Kraft Foods, Inc.   Norcross, Georgia",
  "FacilityStr1": "6205 Best Friend Rd",
  "FacilityStr2": null,
  "FacilityCity": "Norcross",
  "FacilityState": "GA",
  "FacilityZipCode": "30071",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13135",
  "LEPC": "Frank Daniel/Gwinnett County",
  "FacilityLatDecDegs": "33.92075",
  "FacilityLongDecDegs": "-84.221306",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 792841314,
  "ParentCompanyName": "Kraft Foods, Inc",
  "Company2Name": "Philip Morris companies, Inc.",
  "CompanyDUNS": 39010590,
  "Company2DUNS": 144628310,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "6205 Best Friend Rd",
  "OperatorStr2": null,
  "OperatorCity": "Norcross",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30071",
  "OperatorZipCodeExt": "2910",
  "FTE": 350,
  "OtherEPAFacilityID": "GAD984302604",
  "EPAFacilityID": "100000024626",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2012-09-24 00:00:00",
  "AnniversaryDate": "2004-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.4",
  "FRS_Lat": 33.92518,
  "FRS_Long": -84.21561,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2240,
      "AltID": "Anhydrous ammonia",
      "FacilityID": 2038,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 2384,
          "ProcessID": 2240,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2282,
          "ProcessID": 2240,
          "NAICSCode": "42241",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 597,
              "Process_NAICS_ID": 2282,
              "SafetyReviewDate": "1998-04-24 00:00:00",
              "PHA_Date": "1996-04-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-08-14 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "power failure",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-04-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-27 00:00:00",
              "EquipmentTested": "Ammonia Gas Detectors",
              "ChangeMgmtDate": "1998-04-08 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-08 00:00:00",
              "PreStartupReviewDate": "1996-05-04 00:00:00",
              "ComplianceAuditDate": "1999-03-14 00:00:00",
              "AuditCompletionDate": "1999-03-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-01 00:00:00",
              "ContractorSafetyEvalDate": "1997-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "ammonia (anhydrous)",
              "_chemicals": [
                {
                  "PrimaryKey": 677,
                  "PreventionProgram3ID": 597,
                  "ProcessChemicalID": 2384
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2038,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-03-14 00:00:00",
    "ERTrainingDate": "1999-05-27 00:00:00",
    "CoordinatingAgencyName": "Gwinnett County Emergency Services",
    "CoordinatingAgencyPhone": "7705135555",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "no"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2038,
      "SummaryText": "\n\n\n\n                                                           KRAFT FOODS, Norcross \n                                                     RISK MANAGEMENT PROGRAM\n                                                           (Executive Summary)\n\n\n\nEXECUTIVE SUMMARY\n\n1.0    Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Norcross, Georgia, has an excellent record in preventing and minimizing releases of anhydrous* ammonia.  This facility has a thorough emergency training program for on-site emergency responders.  The facility uses a real time data base to track inspection dates and issue reminders to responsible groups. Training is tracked on an internal spreadsheet.\n\nThe emergency response policies at this facility ensure that there is emergency response coverage ( 24 hours - 7 days per week).  There are also adequate provisions for coordination with outside agencies, such as with the Gwinnett County Department of Fire & Emergency Services ,and the Gwinnett County Hazmat Team,  in the event of an emergency.\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0    Process Description and Regulated Substances\n\nAt this location Kraft Foods  Distributes assorted Kraft products for human consumption. The NAICS code for the primary process at this facility is 42241 ( Sic code 5141). This facility stores and distributes meats and other varieties of refrigerated and frozen as well as non-refrigerated products. Some areas of the facility are refrigerated to preserve the meat and refrigerated products.  These areas include: West and South docks, Refrigerated cooler, Freezer, and Cool Room. The backup power source, for these areas, are two diesel powered generators located on the West side of the Refrigerated Distribution Center.\n\nKraft Foods, Norcross has one regulated substance under 40 CFR 68: ammonia at this location.  The Norcross facility has 26,000 lbs. of ammonia on site. Ammonia is used as a refriger"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2038,
      "SummaryText": "ant in the refrigeration of the meats and various other refrigerated products in areas described above. \n\n\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia stored on-site is 26,000 lbs.  Thus, 40 CFR 68 is applicable to Kraft Foods in Norcross , Ga.\n\n\n\n\n3.0    Worst-case and Alternative Release Scenarios\n\nThe ammonia refrigeration system has associated hazards that can potentially effect on-site employees and the general public off-site if there is a release from either system. Although the alternative release scenario is more likely, the US EPA requires that one worst-case and one alternative release scenario be reported for each regulated chemical. Described below are the associated hazards and the worst-case and alternative release scenarios for each regulated chemical.\n\nAmmonia \n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\nThe risks to persons in an accidental release of ammonia include:\n\n1.    Irritation of respiratory tract,\n2.    Corrosive attack of skin and other tissue,\n3.    Freezing of skin and other body tissue when contacted by liquid ammonia.\n\n\n\nBelow is a description of the release scenarios for ammonia and their off-site consequences:\n\n     Worst-case scenario - The largest potential release of ammonia will occur with a puncture in one of the receivers located on the south side of the plant approximately 10 feet from the fence line.  Because of interconnecting pipe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2038,
      "SummaryText": " work and other vessels, that can discharge into this pipe work, the amount of ammonia released will be greater than amount stored in one of the receivers.  The connected \"other\" vessels include the condensers (eight) and the liquid transfer units.  The low and high temperature accumulators are connected to the receivers through pipe work; however, the accumulators cannot discharge ammonia into the receivers.  The ammonia release in pounds is grouped in the following way:\n\n1.    Receivers = 9,000 pounds\n2.    High Temperature Recirculator = 100 pounds\n3.    Low Temperature Recirculator = 50 pounds\n4.    Interconnecting pipe work = 45 pounds\n\nTotal Ammonia Released = 9,200 pounds)\n\n\n\nUnder Section 68.25(c)(1), a regulated substance such as ammonia, which is normally a gas at ambient temperature and handled as a liquid under pressure, shall be considered to be released as a gas over a ten-minute period.  Thus, ammonia's physical state in the worst-case release is a gas.   Passive mitigation controls were not applicable to the worst-case release at this plant.\n\n     The BREEZE HAZ DEGADIS+ air dispersion model was used to model the worst-case scenario at the Kraft facility in Norcross. DEGADIS+, developed by the US Coast Guard, is an EPA approved model as identified in the RMP Offsite Consequence Analysis Document (May 24, 1996). It predicts containment movement for heavier-than-air gases for instantaneous and continuous ground level releases. It was selected because of its applicability towards modeling of dense gases (such as ammonia) and use for emergency response planning. DEGADIS+ was used to determine the distance from the facility to an endpoint chemical concentration of 200 ppm.  The distance to the endpoint of 200 ppm was determined to be 0.74 miles.\n           \n       \n\n           The endpoint of 200 ppm for ammonia is based on the Emergency Response Planning Guideline, Level 2 (EPRG-2), developed by the American Industrial Hygiene Association. This level is the concentrati"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2038,
      "SummaryText": "on to which an individual could be exposed to for up to one hour without suffering from irreversible or other serious health effects that could impair that individual's ability to leave the affected area.\n\n     The estimated affected residential population is 1,800 people.  A public recreation area (Best Friend Park), commercial/industrial areas, a school, and residential areas would be affected in the worst-case release scenario.\n\n     Alternative Release Scenario - The worst-case release is less likely to occur than the following scenario: An alternative release scenario chosen, because it was a more likely occurrence, was the US EPA's default scenario. This alternative release scenario is most likely to be caused by a gasket rupture or pump seal leak, which would result from a 0.25\" diameter orifice. The release rate of ammonia due to the leakage through a failed seal or gasket is calculated to be 100 lb./min.\n\n      The BREEZE HAZ DEGADIS+ was used to model the alternative case release scenario at the Kraft facility in Norcross. DEGADIS+ developed by the US Coast Guard, Is an EPA approved model as identified in the RMP Offsite Consequence Analysis Document (May 24, 1996). It predicts contaminant movement for heavier-than-air gases for instantaneous and continuous ground level releases. It was selected because if its applicability towards modeling of dense gases (such as ammonia) and used for emergency response planning. DEGADIS+ was used to determine the distance from the facility to an endpoint chemical concentration of 200 ppm. The distance to the endpoint of 200 ppm determined to be 0.20 miles or 1,100 feet.\n\n\nThe estimated effected residential population is 2 people. A public recreation area (Best Friend Park), commercial/industrial areas, and a residential area would be affected in the alternative case release scenario. \n\n\n\n4.0    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n This facility has developed an OSHA PSM program for t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2038,
      "SummaryText": "heir ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention program, which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program 3.  Thus, Kraft's ammonia PSM has been reviewed and determined to be complete for the RMP document.  \n\nThere are several aspects of the prevention program that are key:\n\n1.    Most of the ammonia pipe work is out of the way of people and machinery which lessens the chance of an ammonia release.\n\n.There are many safeguards which provide early warning system to indicate an ammonia release and shut the ammonia system down to minimize the loss of ammonia from the system. These include alarms, process area sensors, perimeter monitors, and automatic system shut-offs.\n.Kraft maintains excellent training, certification and employee awareness of operating procedures. Training exercise include classroom lectures and \"on the job\" simulations of an ammonia release. Videotaping of the emergency response team in action during the simulated release provides valuable feedback to responders.\n.A computerized monitoring system is employed to provide accurate measurements of the ammonia system and is connected to the facility's alarm system to immediately warn operators of hazardous conditions.\n\n\n\n5.0    Five-year Accident History\n\nThe review of this facility's accident history includes the following range of dates: June 22, 1994 - June 21, 1999.  To date, there have been no accidental spills or releases of ammonia at this facility as defined by 40 CFR part 68.42.\n\n\n\n\n6.0    Emergency Response Program\n\n As mentioned earlier, this facility has developed an emergency response program in which plant employees are divided into various management and response teams. There are two primary in-plant contacts for an emergency, which can be found in the Emergency Response Plan.  There are also back-up personnel in the event that the primary incident response pers"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2038,
      "SummaryText": "onnel cannot be contacted.  The emergency response plan includes information about the frequency of employee emergency response training as well as a detailed description of the training content.  There are also specific procedures to follow in the event of a fire and ammonia emergency.  \n\nAt the discretion of the Incident Commander, the Gwinnett County Department of Fire and Emergency Services will be called to provide back-up emergency responders and equipment.   The Gwinnett County Hazmat Team will be called for all fire related emergencies.  In all cases where the fire department is called, an ambulance will also be called to the scene.\n\n7.0    Planned Changes to Improve Safety\n\nBased on the PHA completed for ammonia a list of action items was developed and is being monitored to determine if implementation was accomplished. Examples of safety improvements (and status) as a result of the PHA action items include\n\n1.    Initiate visual inspections of relief valves on condensers on a monthly basis. (Completed, 3/96)\n\n.Revise SOP's to include semi-annual inspection and testing of low and high level cutouts on the recirculators. (Completed, 3/96)\n\n.Install pump assisted liquid transfer from high temperature recirculator for liquid supply for low temperature recirculator. (Completed, 3/96)\n\n.Add differential transfer switch to Phillips Liquid Transfer System. (Completed, 3/96)\n\n.Revise SOP's to include an annual super heat check on cool room evaporators. (Completed, 3/96)\n\n.Revise SOP's to include pump-out prior to cleaning of evaporators. (Completed, 3/96)\n\n.Install protective device in cool room to warn against lift truck impact. (Completed 9/96)\n\n.Lock and tag atmospheric vent valve. (Completed, 1/96)\n\n.Revise SOP's for Pump-Out Accumulator to include closing pump-out valve and lock and tag before component is opened. (Completed, 3/96)\n\n.Install piping to pump-out compressor oil cooler oil drain. (Completed 2/97)\n\n.Revise operator SOP's to include additional personnel co"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2038,
      "SummaryText": "ntacts and numbers for security in case current contacts cannot be reached. Also, ensure that current contacts have appropriate contact report numbers at all times. (completed, 2/97)\n\n.Make vessel and condenser valves more accessible through installing ladders and platforms. (Completed, 2/97)\n\n.Install catwalk for condenser. (Completed 2/97)\n\n.Installed leak detectors at tank farm. (Completed, 1996)\n\n.Eliminated product space below UC units in cooler. (Completed, 1996)\n\n.Install enter lock to shut Break room HVAC off in the event of an ammonia leak. (Completed, 1996)"
    }
  ]
}