{
  "FacilityID": 20396,
  "FacilityName": "Sumitomo Sitix Silicon, Inc. Albuquerque Division",
  "FacilityStr1": "9401 San Mateo Blvd., NE",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87113",
  "Facility4DigitZipExt": "2232",
  "FacilityCountyFIPS": "35001",
  "LEPC": "Bernalillo LEPC",
  "FacilityLatDecDegs": "35.194278",
  "FacilityLongDecDegs": "-106.588278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "http://www.sitix.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 868689621,
  "ParentCompanyName": "Sumitomo Metal USA Corporation",
  "Company2Name": null,
  "CompanyDUNS": 617377106,
  "Company2DUNS": 0,
  "OperatorName": "Sumitomo Sitix Silicon, Inc.",
  "OperatorStr1": "9401 San Mateo Blvd., NE",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87113",
  "OperatorZipCodeExt": "2232",
  "FTE": 157,
  "OtherEPAFacilityID": "87113SMTCM9401",
  "EPAFacilityID": "100000036588",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-10-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-10-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.19088,
  "FRS_Long": -106.58667,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28571,
      "AltID": "HCl trailer",
      "FacilityID": 20396,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 37263,
          "ProcessID": 28571,
          "ChemicalID": 54,
          "Quantity": 3000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29295,
          "ProcessID": 28571,
          "NAICSCode": "334413",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 29296,
          "ProcessID": 28571,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 15584,
              "Process_NAICS_ID": 29296,
              "SafetyReviewDate": "1999-03-16 00:00:00",
              "PHA_Date": "1999-03-16 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 1,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-16 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-16 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-02-18 00:00:00",
              "EquipmentInspectionDate": "2000-09-25 00:00:00",
              "EquipmentTested": "HCl System",
              "ChangeMgmtDate": "1995-09-05 00:00:00",
              "ChangeMgmtReviewDate": "2000-03-17 00:00:00",
              "PreStartupReviewDate": "1995-07-01 00:00:00",
              "ComplianceAuditDate": "2000-04-07 00:00:00",
              "AuditCompletionDate": "2000-04-07 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-09-01 00:00:00",
              "HotWorkPermitReviewDate": "2000-01-12 00:00:00",
              "ContractorSafetyReviewDate": "2000-09-21 00:00:00",
              "ContractorSafetyEvalDate": "2000-09-21 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22578,
                  "PreventionProgram3ID": 15584,
                  "ProcessChemicalID": 37263
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 28572,
      "AltID": "Trichlorosilane",
      "FacilityID": 20396,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 37264,
          "ProcessID": 28572,
          "ChemicalID": 153,
          "Quantity": 1000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29297,
          "ProcessID": 28572,
          "NAICSCode": "334413",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 29298,
          "ProcessID": 28572,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20396,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-10-01 00:00:00",
    "ERTrainingDate": "1999-01-28 00:00:00",
    "CoordinatingAgencyName": "Albuquerque Fire Department",
    "CoordinatingAgencyPhone": "5052436601",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20396,
      "SummaryText": "Sumitomo Sitix Silicon-Risk Management Plan\nExecutive Summary\n\nAccidental Release Prevention and Emergency Response Policies\nSumitomo Sitix Silicon, Inc. (Sitix) is committed to employee, public and environmental safety. This commitment is demonstrated by comprehensive and well-documented inspection, maintenance, and training programs. Written procedures are in place for preventing accidental releases.\n\nSitix also has a thorough emergency response plan and a trained emergency response team. Sitix emergency response procedures have been distributed to medical facilities and responding agencies. The emergency response team undergoes regular training and practice drills.\n\nSource and Regulated Substances \nThe facility's primary activity is silicon wafer preparation. There are two regulated substances stored at the facility: anhydrous hydrogen chloride (HCl) and trichlorosilane (TCS). The facility has a maximum capacity of 21,000 pounds of HCl either stored or used in a process. Sitix also has up to approximately 10,000 to 15,000 lbs of TCS stored or used in a process. The TCS is stored in 1000 lb containers. HCl is stored in 3000 lb containers on a tube trailer with a maximum capacity of 21,000 lbs. Both chemicals are used for wafer preparation\n\nWorst Case Release and Alternative Release Scenarios\nTo perform the required offsite consequence analysis for the facility, Sitix used EPA's RMP*Comp software, the Areal Locations of Hazardous Atmospheres (ALOHA) model (developed by EPA and NOAA), and EPA's current guidance for offsite consequence analysis. Modeling parameters were as recommended by EPA in their guidance document for offsite consequence analysis. \n\nTCS Modeling\nFor TCS, a release scenario was evaluated based on the worst-case scenario mandated by EPA. The nominal worst-case release scenario for TCS is a failure of one container, resulting in a release of 1000lb of TCS. Modeled as a 10 minute release occurring under conditions of F stability, 1.5 m/s wind speed, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20396,
      "SummaryText": "and a temperature of 77?F, the calculated affected radius to the endpoint of 1 psi overpressure is 60m. Distance to this endpoint was determined using EPA's RMP*Comp software. The details from the modeling exercise are included in Section 3 of this document, please refer to that section for more information. \n\nThe facility meets the criteria for Program 1 for TCS as follows:\n\n? There have been no accidents at the facility in the previous 5 years\n? There are no public receptors within the worst-case affected radius \n? Emergency response coordinated with local responders\n\nThere are no offsite impacts at public receptors from a worst-case release of 1000 lbs of TCS and the facility otherwise meets the criteria for Program 1. Therefore only a single worst-case release of TCS was evaluated for offsite consequences.\n\nHCl Modeling\nThe facility meets the criteria for Program 3 for Hydrogen Chloride as follows:\n\n? The facility is not eligible for Program 1 because there are public receptors within the potential affected radius\n? The facility is subject to OSHA PSM \n\nAccordingly, three release scenarios were evaluated for HCl: the artificial worst-case scenario mandated by EPA, and two realistic alternative release scenarios. The details from the modeling exercise are included in Section 3 of this document, please refer to that section for more information.\n\nThe nominal worst-case release scenario is based on a catastrophic release from a single tube of the trailer, resulting in a release of 3000 pounds of HCl. This scenario is modeled as a 10-minute release occurring under conditions of F stability, with 1.5 m/s wind speed, and a temperature of 77?F. The calculated affected radius to the endpoint of 0.03 mg/L is 3.8 km. This scenario is based on worst case meteorological conditions that could not occur at the site.\n\nAlternative release scenarios were selected based on the anticipated worst-case damage to the two ends of each storage tank, where they appear to be most vulnera"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20396,
      "SummaryText": "ble.  These are the places where there are penetrations in the tanks, and are thus the most likely to be susceptible to leakage and/or mechanical failure.\n\nThe first alternative release scenario evaluated is based on failure of a rupture disk, resulting in a continuous release of the contents of one container of HCl (3000lb). This is the most likely worst-case failure of the storage system. Although unlikely, it has a potential to occur through either operator error or mechanical failure. The rupture disk of each tank is located at the towing end of the system. The rupture disk for each tank at this point is equipped with a 5/16\" orifice, specifically designed to limit flow in the event of an accident.\n\nThis scenario was modeled under conditions of B stability class, 3 m/s wind speed, and an ambient temperature of 77?F. These meteorological conditions are typical daytime conditions for the Albuquerque area. This alternative release was evaluated with ALOHA. This alternative release scenario results in a release rate of 276 lbs/min, and will empty a 3000 lb tube in 11 minutes. The calculated affected radius to the endpoint for this scenario is approximately 1.6km.\n\nAnother, even more realistic alternative release scenario was also considered, that of a leak through a 0.08\" hole or tube. This scenario represents any long-duration releases such as leaking valves or fittings. All operating valves and fittings are located at the end opposite of the rupture disk on each tank. The penetration of the tank at this point is equipped with a 0.08\" orifice, specifically designed to limit flow in the event of an accident.\n\nThis scenario was modeled using the same meteorological conditions as the first alternative scenario. This scenario results in a release rate of 201 lbs/hr and was also modeled with ALOHA using daytime meteorological conditions typical for the Albuquerque area. This results in a calculated affected radius to the endpoint of 158m.\n\nAccidental Release Prevention "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20396,
      "SummaryText": "Program \nThe facility has taken all necessary steps to comply with the accidental release prevention requirements established at 40 CFR 68. The facility was designed and constructed in accordance with all standards in effect at the date of construction, 1994. The facility is subject to EPCRA Section 302 notification requirements. A number of processes are subject to the OSHA PSM standard, 29 CFR 1910.119. The RMP release prevention program is based on the OSHA PSM program. The following sections briefly describe the elements of the release prevention program that is in place at the facility.\n\n1 Process Safety Information\nSitix maintains detailed records of safety information for all processes. Employees participate in regular safety meetings. The extent and degree of participation varies depending on the level of involvement required of the employee. Employee suggestions and information relating to process safety is solicited at these meetings. Employees are consulted for information used in developing operating procedures and specifications. Employees are advised of hazards through routine training and by their supervisors.\n\n2 Process Hazard Analysis\nThe facility's process safety management (PSM) program addresses both the TCS and HCl systems. A process hazard analysis of the HCl tube trailer and gas supply system was conducted prior to installation by Air Products Company, the supplier and operator of the HCl supply system. The hazard analysis was conducted using the \"What if?\", checklist, fault tree, and HAZOP methodologies. \n\nSitix also conducted an independent process hazard analysis of the covered process in March 1999 using the \"What-if?\" methodology. The hazard analysis was performed by a team of qualified personnel with expertise in engineering and process operations and will be re-validated periodically.\n\n3 Operating Procedures\nEach significant activity involving a covered process is described in a written procedure or specification. Employees involved in "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20396,
      "SummaryText": "covered processes are consulted regarding the development and revision of operating procedures. Employees are advised of changes in operating procedures through routine training and by their supervisors. Operating and maintenance procedures are thoroughly documented are reviewed at least annually.\n\n4 Training\nSitix provides general and job-specific training to employees, including initial training and periodic refresher training. Information gathered through job hazards analyses is integrated with other sources of information such as ongoing health and safety reviews and surveys and regulatory requirements and incorporated into the initial and refresher training. In addition to the ongoing training, supervisors are apprised of imminent hazards as information develops so that they can convey the information to employees. \n\n5 Mechanical Integrity\nSitix has written specifications describing each significant activity or equipment involved in a covered process. Employees involved with process equipment receive the necessary training to ensure the integrity of process vessels, piping, and other containment. Employees are expected to report hazards, conditions, or acts that may compromise the mechanical integrity of processes involving hazardous materials.\n\n6 Management of Change\nWritten procedures are in place at Sitix to manage changes in process chemicals, technology, equipment and procedures. Affected employees receive the necessary training to continue to work safely and effectively when processes, materials, equipment, and procedures involving hazardous materials are changed. MSDSs are maintained for all hazardous materials used at the facility. Equipment-, task-, and location-specific training is provided for all employees. Employees are expected to report hazards immediately. Reported hazards and employee concerns are addressed in the ongoing training.\n\n7 Pre-startup Reviews\nBefore a process involving hazardous materials is initiated or significantly changed, the c"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20396,
      "SummaryText": "hange is reviewed by the Environmental, Health and Safety Department. Comments of employees associated with the process are welcomed during the review. The results of the EH&S review are communicated to employees associated with the process.\n\n8 Compliance Audits\nSitix conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years. Employees are interviewed in conjunction with compliance audits. Specifications, procedures, and training programs may be revised as a result of audit findings. Employees will be appraised of the revised specifications or procedures or re-trained as necessary.\n\n9 Incident Investigation\nSitix takes accidents and near-misses seriously. All incidents which result in or could reasonably result in a catastrophic release of a highly hazardous chemical are investigate immediately and thoroughly by Environmental/Health and Safety and other departments as appropriate. At least one employee, contractor, or other person with specific knowledge of the covered process will be involved in the incident investigation. Incident investigation will begin as soon as practical, and no later than 48 hours after an incident involving a covered process. All reports are retained for a minimum of 5 years.\n\n10 Employee Participation\nSitix believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements Sumitomo Sitix has extensive employee communication programs, training programs, and procedures in place which satisfy the RMP requirements for covered processes. \n\n11 Contractors\nSitix contractors are required to implement OSHA-compliant safety programs. Contractors are advised of hazards specific to their work by the Sitix staff overseeing the contractor work. Contractors are expected to report hazards, unsafe "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20396,
      "SummaryText": "acts or conditions immediately. Contractors may participate in safety training if appropriate.\n\nFive-year Accident History\nThere have been no accidental releases since the facility was constructed.\n\nEmergency Response Plan\nSitix has a comprehensive emergency plan fully compliant with 29 CFR 1910.38(a). The emergency plan includes procedures for responding to small releases of highly hazardous chemicals. The plan also includes responding to hazardous waste emergencies. \n\nSitix maintains an Emergency Response Team (ERT) composed of employees with special training in emergency response. ERT members receive refresher training and meet regularly. ERT members are encouraged to propose changes in procedures.\n\nPlanned Changes \nSitix is evaluating active mitigation systems such as a water deluge and scrubber system for the HCl storage trailer. The purpose of such a system is to greatly reduce the consequences of catastrophic failure by immediately neutralizing the bulk of the released material. While active systems cannot be considered in evaluating the artificial worst-case RMP scenario, in reality they will reduce the volume of released gas, and the corresponding consequences, by up to an order of magnitude for any feasible release scenario."
    }
  ]
}