{
  "FacilityID": 20439,
  "FacilityName": "RUSSELL STOVER CANDIES, INC. - IOLA, KS",
  "FacilityStr1": "1995 MARSHMALLOW LANE",
  "FacilityStr2": null,
  "FacilityCity": "IOLA",
  "FacilityState": "KS",
  "FacilityZipCode": "66749",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20001",
  "LEPC": "Allen County LEPC",
  "FacilityLatDecDegs": "37.941833",
  "FacilityLongDecDegs": "-95.414917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.russellstover.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "RUSSELL STOVER CANDIES, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "RUSSELL STOVER CANDIES",
  "OperatorStr1": "1000 WALNUT STREET",
  "OperatorStr2": null,
  "OperatorCity": "KANSAS CITY",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64106",
  "OperatorZipCodeExt": "2198",
  "RMPContact": "DAVID RAETZEL",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 380,
  "OtherEPAFacilityID": "KS0001555606",
  "EPAFacilityID": "100000172911",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-05-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-11-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-11-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-11-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 37.94183,
  "FRS_Long": -95.41492,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28655,
      "AltID": null,
      "FacilityID": 20439,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29383,
          "ProcessID": 28655,
          "NAICSCode": "31133",
          "_desc": {
            "NAICS_CODE": "31133",
            "NAICS_DESCRIPTION": "Confectionery Manufacturing from Purchased Chocolate"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 37363,
          "ProcessID": 28655,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 537363,
          "ProcessID": 28655,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20439,
      "SummaryText": "Introduction\nThe Russell Stover Candies, Inc. plant, located in Iola, Kansas, manufactures specialty candies under the Russell Stover, Whitman, and Pangburn labels.  Chocolate, nuts and other ingredients are accepted at the plant and used in the manufacture of specialty candies.\n\nThe facility maintains two separate ammonia refrigeration systems which sustain a milk and nut cooler, a -10?F freezer unit, plant process water coolers and facility air conditioners.  Anhydrous ammonia is used in the refrigeration systems in excess of the 112(r) threshold and is the only 112(r) listed chemical used at the facility.\n\nPlant Description\nThe facility is located just north of the town of Iola, off State Street at 1995 Marshmallow Lane.  The facility consists of a large, brick fronted, single-story, metal frame structure approximately 130,000 square feet in size that houses production, offices, and the Candy Store.\n\nThe facility began production in May 1997.  The facility operates 24 hours with two production shifts and one maintenance shift.  Facility operations include receiving and storage of raw materials, measurement of the various ingredients into specific batch quantities, blending of ingredients prior to hand finishing of the various chocolates, packaging and warehousing of product prior to shipment.  \n\nOn the east side of the building there is a concrete secondary containment dike where the 12,000-gallon fuel oil tank is located.  Also within the containment dike is a 300-gallon diesel fuel tank.  Bulk unloading, loading docks and waste containers are under roof within the plant. \n\nThe grounds are open with access to employee parking and the Candy Store from Marshmallow Lane to the west.  Land-use in the immediately surrounding area is agricultural, light industrial, commercial and residential.  The Neosho River lies approximately one mile to the west.\n\n Ammonia Refrigeration System Description\nThe facility maintains a milk and nut cooler, as well as a -10?F freezer uni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20439,
      "SummaryText": "t.  The cooler, freezer, and the plant process water coolers and air conditioners are cooled using two independent ammonia refrigeration systems.\n\nThe total charge on the plants two refrigeration systems is approximately 23,200 pounds of ammonia.  Each of the systems includes a receiving tank, suction accumulator, compressors, evaporative condenser(s), and associated piping to the systems served.  The systems are closed loops, and little or no ammonia is needed annually to replenish minor losses due to routine maintenance activities.  \n\nThe larger of the two systems, referred to as the South System, contains approximately 16,200 pounds of ammonia and serves the milk and nut cooler as well as air cooling Niagara systems and process water cooling. \n\nThe smaller system, referred to as the North System, contains approximately 7,000 pounds of ammonia and serves the -10?F freezer.  \n\nBoth refrigeration systems are visually inspected daily by the operators.  Each system is provided with emergency pressure relief valves piped to diffusers on the roof of the building.  The mechanical rooms where the receivers are located are equipped with ammonia sensors which trigger an audible alarm throughout the plant.  In addition to the ammonia sensors, there are either equipment electric panel lights or computer monitoring readings for temperature, pressure and/or liquid level on all pressurized elements of the systems.\n\nThe Worst-Case Release Scenario\nThe worst-case release scenario is calculated based on the loss of the largest, single ammonia storage vessel and associated piping used in accordance with the definition provided in the Environmental Protection Agency guidance for RMP development.  As required by EPA guidance for the toxic worst-case scenario, the contents of the ammonia refrigeration process are assumed to be released instantaneously to form a liquid pool.  In accordance with rule guidance, only passive control systems capable of withstanding the release event have be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20439,
      "SummaryText": "en taken into consideration.  Determination of the area of potential impact was made using RMP*Comp, modeling software developed by the EPA. \n\nFor modeling purposes, it was assumed that the largest of the two ammonia receiving tanks fails and releases 16,200 pounds of anhydrous ammonia.  The receiving tank is located in a building which serves to mitigate the release.  The ammonia is assumed to volatilize from the pool and dissipate to the atmosphere through building openings.  Release time and weather conditions are dictated by EPA guidance.  The ammonia gas is considered to pose no further risk to the public when it has dissipated to a concentration less than the toxic endpoint specified in the RMP rule.  The toxic endpoint is 0.14 mg/L and the distance to the toxic endpoint is 1.7 miles (8,976 feet).  The estimated number of people affected by the release is 5,145.\n\nAlternative Release Scenario\nThe alternative release scenario is, by definition, a more likely release scenario than that considered for the worst case.  Engineered controls, such as chemical detection systems and alarms, are included in the analysis.  As with the worst-case release scenario, modeling is performed using RMP*Comp software provided by EPA.  Release conditions, including release time and weather conditions, are dictated in the EPA Off-Site Consequence Analysis Guidance. \n\nThe type of system failure identified for the alternative release was the loss of ammonia due to a failure of the flexible hosing used to fill the ammonia receiver tank.  The tank is filled from a tank truck via a fifty foot metal reinforced pressure hose.  The hose is affixed to the truck and, through the nearest building door to the mechanical room where the tank is located, to the receiver fill port.  Should there be a rupture of the hose, excess flow valves on the truck and receiver tank will cut off the flow of ammonia.  Only the amount of ammonia in the hose will be released.  The hose will release 0.6 pounds of a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20439,
      "SummaryText": "mmonia.  Calculations showing the amount of ammonia lost are included in the Appendix.  \n\nThe distance to the toxic endpoint is < 0.1 miles (<530 feet).  Due to the small size of this release, no off-site receptors will be affected.\nProcess Hazard Analysis\nA process hazard analysis (PHA) was performed on the ammonia refrigeration systems beginning with loading the receiver tanks with ammonia and ending with the ammonia returning to the receiver tank after having cycled through the entire refrigeration system.  A HAZOP type of analysis was used.  General questions regarding the storage and use areas as well as practices and protocols associated with the management of the ammonia systems were answered.  Following the checklist, each valve, line and piece of equipment in the system was assessed.  The valves and other points in the systems where ammonia could be released are identically numbered in the field and on the facility inspection forms.  Compliance with code requirements, considerations of potential failure, maintenance and inspection concerns and standard operating procedures were reviewed for each point in the system.  The results of the PHA are summarized in a separate Process Hazard Analysis Report.  \n\nFive-Year Accident History\nNo accidents have occurred at the plant since operations began in May 1997."
    }
  ]
}