{
  "FacilityID": 20583,
  "FacilityName": "The Somerset Refinery, Inc.",
  "FacilityStr1": "501 Refinery Road",
  "FacilityStr2": null,
  "FacilityCity": "Somerset",
  "FacilityState": "KY",
  "FacilityZipCode": "42501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21199",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "37.07",
  "FacilityLongDecDegs": "-84.638889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.somersetoil.com",
  "FacilityEmailAddress": "jcacrea@somersetoil.com",
  "FacilityDUNS": 5078175,
  "ParentCompanyName": "Somerset Oil, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 21733787,
  "Company2DUNS": 0,
  "OperatorName": "The Somerset Refinery, Inc.",
  "OperatorStr1": "600 Monticello Street",
  "OperatorStr2": "PO Box 1547",
  "OperatorCity": "Somerset",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42502",
  "OperatorZipCodeExt": "1547",
  "RMPContact": "F. Roy Shirley, Jr.",
  "RMPTitle": "Chief Executive Officer",
  "FTE": 34,
  "OtherEPAFacilityID": "42501SMRST600MO",
  "EPAFacilityID": "100000167277",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-84-124",
  "SafetyInspectionDate": "1996-11-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-02-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-02-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2000-11-01 00:00:00",
  "AnniversaryDate": "2005-02-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 37.07194,
  "FRS_Long": -84.60944,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 28941,
      "AltID": "Millenium Fuels",
      "FacilityID": 20583,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 29686,
          "ProcessID": 28941,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 29687,
          "ProcessID": 28941,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 37689,
          "ProcessID": 28941,
          "ChemicalID": 155,
          "Quantity": 364614.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 28882,
              "ProcessChemicalID": 37689,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 28883,
              "ProcessChemicalID": 37689,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 28884,
              "ProcessChemicalID": 37689,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 537689,
          "ProcessID": 28941,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20583,
      "SummaryText": "Executive Summary\n\nPolicies [68.155(a)]\n\nThe Somerset Refinery, Inc. (\"Somerset\") has based its accidental release prevention and emergency response policies to meet three goals: 1) the prevention of injury or death for persons on- and off-site, 2) the protection of property on- and off-site, and 3) the protection of the environment.  For this reason, Somerset has placed an emphasis on accidental release prevention based upon employee training, public awareness, and proactive maintenance.  To ensure proper emergency response policies, Somerset has contracted with additional company for added response capabilities and is coordinated with the local and regional emergency response agencies.\n\nStationary Source & Regulated Substance [68.155(b)]\n\nSomerset is a privately-owned Class A refinery that has been in operation since the 1950's with crude oil storage occurring as far back as the early 1900's.  Somerset processes crude oil into finished products by physical separation and reforming.  These finished products include gasoline, diesel, kerosene, heavy gas oil, No.6 black oil, and naphtha.  The finished products are then stored and transported to customers, including Somerset's own service stations, across Kentucky and other nearby states.  Recently, Somerset formed a joint venture with Millennium Fuels to produce a high-octane racing fuel.  This process involves the only regulated substances present at the facility at or above the threshold quantity.  This substance is a flammable liquid containing Butane, n-Pentane, and iso-pentane.  Somerset estimates that during the initial startup of this program it will have approximately 370,000 pounds of this flammable liquid on-site.  Somerset and its partner envision an expansion of the process within the first eighteen months that could increase this amount by four- or fivefold.\n\nRelease Scenarios [68.155(c)]\n\nThe worse-case scenario is the vapor gas explosion of one of the two main storage tanks (Tank 203 & 204).  Each tank"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20583,
      "SummaryText": " is permitted by law to store up to 30,000 gallons of the flammable liquid.  Somerset will not exceed that 30,000-gallon limit in either tank.  These tanks are the largest structures in this process.  This scenario was modeled using the RMPComp program.  The off-site consequence analysis shows this scenario affecting residences, office buildings and other businesses, a Norfolk-Southern railroad line, a community wastewater treatment system, and a Department of Highway's maintenance and equipment storage facility.  Using the population density of the cities of Somerset and Ferguson over the 0.5-mile radius determined to be affected by this scenario (minus the area of the facility itself), Somerset estimates that approximately 2,221 people could be affected by this scenario.  Somerset believes, however, that the actual population in the affection is much lower than this estimate since much of the area along Sinking Creek, which runs through the facility, is not developed.  While there are no artificial mitigation measures associated with this process, a natural mitigation factor that could not be accounted for in the RMPComp model is the topography surrounding the facility.  The storage tank in question sits on the eastern slope of the valley created by Sinking Creek.  The top of the valley is more than twenty-five feet in elevation above the storage tanks.  Somerset believes that the location will mitigate much of the explosion that is the basis for this scenario.\n\nThe alternate-case scenario is the vapor gas explosion of the fuel drum (FD101).  This 950-gallon vessel is the next largest container in the Millennium Fuels project.  This scenario was modeled using the RMPComp program.  The only off-site consequence for this scenario is a disruption of a Norfolk-Southern railroad line located along the eastern side of the facility.  No other alternate-case scenario tested extended beyond the boundaries of the facility; thus, no other alternate-case scenario had any off-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20583,
      "SummaryText": "site consequences.\n\nAccidental Release Prevention Program [68.155(d)]\n\nSomerset's general accidental release prevention program can be divided into three areas: 1) inspections, 2) proactive maintenance, and 3) training.  Somerset personnel conduct inspections of the systems at a minimum on a daily basis.  If these inspections uncover a condition that might cause an accidental release, Somerset repairs the system before it can cause a release.  Somerset has a training program in place covering the various factors that might result in such a release.  Because of the newness of the Millennium Fuels project, Somerset is still refining some of these areas.  Somerset will conduct additional inspections and be more wary of conditions that might result in an accidental release.\n\nFive-year Accidental Release History [68.155(e)]\n\nBecause this is a new production process, there have been no accidental releases.\n\nEmergency Response Program [68.155(f)]\n\nSomerset emergency response program is based upon a three-pronged strategy: 1) Somerset own in-house response personnel and equipment, 2) contract responders, and 3) local and regional response agencies.  Somerset coordinates all of its response activities with the regional director of the Department of Emergency Services, Malcolm Franklin, and the local director, Gilbert Robinson.  Somerset notifies the public of an emergency in two ways: 1) a alarm system at the facility that can be heard in the nearby neighborhoods and 2) by contacting all of the local radio stations in the county.  Somerset training policies are based upon those set forth in its Emergency Response Plan as well as those set forth in its Facility Response Plan and Spill Prevention, Control, and Countermeasure Plan.\n\nPlanned Changes to Improve Safety [68.155(f)]\n\nBecause this is a new production process, Somerset has not yet had sufficient experience to have any changes currently planned.  Somerset will update its safety training as well as operating and mainten"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20583,
      "SummaryText": "ance procedures as is warranted.\n\nOther Explanations\n\nSomerset is still in the process of obtaining its Title V permit; thus, we did not have the permit number to submit with the RMP.  Instead, Somerset has submitted the number of its most recent air operating permit (O-84-124 Revised)."
    }
  ]
}