{
  "FacilityID": 20746,
  "FacilityName": "Pacific Cold Storage - Plant 2 West",
  "FacilityStr1": "3420 East Vernon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Vernon",
  "FacilityState": "CA",
  "FacilityZipCode": "90058",
  "Facility4DigitZipExt": "1812",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.005444",
  "FacilityLongDecDegs": "-118.210694",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7965817,
  "ParentCompanyName": "P&O Incorporated",
  "Company2Name": "Penninsular & Oriental Steam Navigation",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "P&O Incorporated",
  "OperatorStr1": "3420 East Vernon Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90058",
  "OperatorZipCodeExt": "1812",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066698",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-24 00:00:00",
  "SafetyInspectionBy": "City of Vernon Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-03-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-03-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 34.005444,
  "FRS_Long": -118.210694,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29184,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 20746,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 37954,
          "ProcessID": 29184,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 29923,
          "ProcessID": 29184,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16019,
              "Process_NAICS_ID": 29923,
              "SafetyReviewDate": "1999-05-25 00:00:00",
              "PHA_Date": "1999-05-25 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Water Diffusion Tank for relief valves",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Added seismic bracing to pipe runs.",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-09 00:00:00",
              "EquipmentTested": "Complete ammonia refrigeration inspection in accordance with IIAR.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-05-11 00:00:00",
              "AuditCompletionDate": "1999-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-25 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 23041,
                  "PreventionProgram3ID": 16019,
                  "ProcessChemicalID": 37954
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20746,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-05-20 00:00:00",
    "ERTrainingDate": "1998-05-20 00:00:00",
    "CoordinatingAgencyName": "City of Vernon Fire Department",
    "CoordinatingAgencyPhone": "3235834821",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20746,
      "SummaryText": "A.\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\n\tPOLICIES\n\nThe emergency response procedures for the facility are included as part of the Process Safety Management/Risk Management Program manual.  These procedures were designed to meet the following objectives:\n\n\t1.\tTo save lives.\n\t2.\tTo minimize and avoid injuries.\n\t3.\tTo protect the environment.\n\t4.\tTo minimize property damage.\n\nPacific Cold Storage maintains an emergency response team, whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes. \n\n\nB.\tSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Pacific Cold Storage Plant 2 West facility is located at 3420 East Vernon Avenue, Vernon, California.  The complete Plant 2 facility consists of twelve main cold storage rooms and two separate engine rooms and occupies approximately 7 acres.  Each engine room has separate equipment and supplies refrigeration to separate areas of the facility; therefore, they are two separate processes.  The Plant 2 West system is in one engine room and in Rooms 10, 11, and 12 and uses 10,200 pounds of ammonia.  The Plant 2 East system occupies a second engine room and supplies ammonia to Rooms 1-9. This process uses 7000 pounds of ammonia; therefore, this submittal refers to the Plant 2 West process only.  The area immediately surrounding the facility is industrial, consisting primarily of meat packaging and cold storage facilities. \n\nThe original Pacific Cold Storage Plant 2 facility (Rooms #1, #2, #3, and #4) was built in 1965 with additional rooms (#5, #6, #7, #8, #9, #10, #1"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20746,
      "SummaryText": "1, and #12) being added in 1972, 1982, 1990, and 1996.  More specifically, West Engine Room and Rooms #10, #11, and #12 were added in 1996. \n\nOperational Theory:\n\nA refrigeration system is used to reduce the temperature of a space or substance.  Ammonia (NH3), because of its excellent thermodynamic properties as well as being environmentally friendly, is used as the refrigerant in the refrigeration system.\n\nThe ammonia is circulated through a closed loop system that employs screw type compression to create the desired pressures/temperatures in the heat exchangers (low side evaporators) that are situated in the spaces to be refrigerated.\n\nAmmonia is metered into the evaporators where it absorbs heat from the air and is thereby vaporized.  The vaporized ammonia is moved via piping and vessels to the compressors' suction ports where a lower pressure is created by the rotation of the compressor.\n\nThe system is equipped with piping, vessels, and controls arranged to ensure that only vaporized refrigerant enters the compressors.  The compressors are installed and piped in series to make up a Two Stage compression type system. The first stage compression, called booster compressors, maintains a low pressure in the low temperature applications (for example freezer storage rooms) and discharges ammonia vapor, via the intercooler, to the suction intake of the second stage compressors.  This is referred to as the Intermediate Stage.  This pressure range is approximately 30 psi. The second stage compressors discharge ammonia vapor at approximately 150 psi into the condensers, where the vapor is cooled and condensed back to a liquid state.  The high pressure liquid ammonia is piped down into a vessel (receiver) that is a reservoir for the system.  From the receiver, the ammonia is piped to the heat exchangers (evaporators) completing  the closed loop cycle and continuing the refrigeration affect.\n\n\nThe total ammonia inventory is 10,200 pounds.  \n\nHAZARD ASSESSMENT SUMMARY\n\nW"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20746,
      "SummaryText": "orst Case Release Result Summary\n\nThe worst case release for this facility was that of the maximum quantity of ammonia that can be stored in a vessel.  The largest vessel is the high pressure receiver which is located on the roof of the engine room.  This vessel can hold the entire system charge of 10,200 pounds of ammonia.  This quantity was released in 10 minutes.  Since the vessel is located outside, no passive mitigation measures were incorporated into the release rate calculation (1020 pounds/minute). The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  The facility is located in an urban setting.  \n\nThe downwind distance to 200 ppm was determined using Exhibit 4-4 from the EPA Risk Management Program Guidance for Ammonia Refrigeration, November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nAlternative Release Result Summary\n\nThe alternative release scenario was that of a 0.25 inch diameter leak of high pressure gas ammonia for one hour.  This scenario was chosen because the facility has high pressure gas lines external to the facility and a 0.25 inch leak could be caused by a flange seal leak or a valve packing leak.  The quantity of ammonia released in one hour at this rate is 7,560 pounds.  The meteorological conditions used were 3 meters/second wind speed, and D stability. The facility is located in an urban setting.  \n\nThe downwind distance to 200 ppm was determined using Exhibit 4-5 from the EPA Risk Management Program Guidance for Ammonia Refrigeration, November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) g"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20746,
      "SummaryText": "uidelines and standards including the following:\n\n¿\tIIAR Bulletin 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\n¿\tIIAR Bulletin 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System\n¿\tIIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\n¿\tIIAR Publication R-1, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\n\nIn addition, the facility has implemented a Process Safety Management program for compliance with the Cal-OSHA 5189 regulation since June 1996, when Plant 2 West began operations.\n\nEngineering Measures\nThe Pacific Cold Storage facility has no emergency power supply for process equipment.  In the event of a power failure, all pumps would stop and the solenoid valves would fail closed.  The result would be a shut down of the system.  It was determined during the Hazard and Operability Study that a services failure at Pacific Cold Storage would pose no safety hazards.\n\nThe alarm and monitoring system at Pacific Cold Storage consists of an ammonia sensor located in the engine room and throughout the Plant 2 West area.  If a sensor is triggered, an ammonia alarm is tripped.  When electricity is lost the alarms are powered by emergency power.  The ammonia sensors are located as follows:\n\nRoof near high pressure receiver (1)\nEach Cold Storage Room (12)\nRoof near evaporator piping (3)\nEngine Room (1)\n\nThe alarm and monitoring system consists of numerous equipment status indicators (pressure, temperature, liquid level, and flow).  These indicators monitor the status of the different devices.  Some status indicators trigger another device to start up or shut off, and some are remote indicators that are monitored on a routine basis during operations.  \n\nAll of the pressure safety valves (PSV) throughout the Plant 2 West system are connected to two 16,800 gallon water tanks.  These two water tanks are used for dilution if a PSV opens within th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20746,
      "SummaryText": "e system.\n\nFIVE YEAR ACCIDENT HISTORY\n\nSince the startup of the system (June 1996) to date,  there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no injuries resulting from an ammonia release.  Pacific Cold Storage was operating other ammonia refrigeration facilities, namely Plant 2 East which is located at the same address and there were no releases of ammonia at that facility within the five year accident history examination (June 1994 through June 1999).\n\nEMERGENCY RESPONSE PROGRAM\n\nAll Pacific Cold Storage employees have read and are familiar with the Emergency Response Programs document that outlines the Business Plan, Emergency Response, and Hazardous Communication Program for the Pacific Cold Storage Facility.  All employees and management have read this plan thoroughly and have signed an acknowledgment to this fact.  The Emergency Response Programs document (ERP) is designed to assure proper protection during a crisis/emergency situation.  In the event of an emergency, the Emergency Coordinator will assess the situation.  The Emergency Coordinator (EC) for the Pacific Cold Storage facility is the Chief Engineer of Refrigeration.  \n\nThe following subsections detail the emergency response organization, notification, and evacuation procedures, as well as mitigating procedures such as spill containment.\n\n**Response Organization and Notification Procedures\n\nIn the event of an emergency that could threaten human health or the environment, the Emergency Coordinator shall assess the situation and determine if area evacuations are necessary.  The EC will notify the local authorities and surrounding areas.  The EC is the primary contact for the local authorities when they arrive at the scene.   This individual will oversee the management of the overall operation.\n\nIt is the responsibility of the supervisor/lead person to sound an alarm when a situation occurs that requires evacuation.  He"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20746,
      "SummaryText": "is also responsible for ensuring that all his employees have evacuated the area.\n\n**Evacuation Procedures \n\nThe Pacific Cold Storage evacuation plan is outlined in the ERP which is available to all employees upon hiring.  When the evacuation alarm is heard, the employees and their visitors are to exit the facility following the primary route if available and assemble at Boyle Avenue sidewalk, east side, just south of the railroad tracks.  The Pacific Cold personnel have been instructed to remain at the assembly area until the EC has instructed them to return.  During this time, the supervisor/lead person takes a head-count to verify that all employees have evacuated the facility.  \n\nThe emergency evacuation routes along with the first aid stations and fire extinguisher locations are posted throughout the facility (employee bulletin boards).  When an employee is working in an area that is not his regular area, it is his responsibility to become familiar with the exit and safety equipment locations.\nEvacuation drills are performed at the facility at least on a semi-annual basis.  The drill procedures are outlined in the ERP.  Prior to the drill, notice is given to the employees, emergency response agencies, and neighbors.  A record of the employees in attendance is maintained along with a record of the results of each drill.  Evacuation and drill procedures are reviewed for new employees upon hire.\n\n**Mitigation Measures\n\nThe proper safety equipment is situated throughout the facility and inspected monthly.  Spill clean up procedures are outlined in the ERP and includes an outline of the proper personal protective equipment to be used in the event of an ammonia spill.  \n\nAll employees are familiar with and know the uses of the different types of fire extinguishers.  They have been instructed as to the use of a fire extinguisher and understand when to call for back up assistance.\n\n**Ammonia Spill Response\n\nThe Pacific Cold Storage Emergency Response Team has been train"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20746,
      "SummaryText": "ed (Technician Level and Incident Commander Level) on how to respond to a liquid or vapor spill of ammonia.  The spill response procedures are detailed in the Emergency Response Team Training manual and summarized in this section.  \n\nIn the event of an accident, for example a forklift breaking a section of unprotected ammonia piping, the response team is put into action.  Once all personnel are evacuated and the emergency personnel have donned airpacks and protective clothing, mitigation of the spill can commence.  The response team will isolate the failure and stop the flow of ammonia to the area by closing valves.  If the leak occurred inside the warehouse, the response team will try to minimize damage to the stored product and the environment.  In the majority of ammonia releases, the response team will have to deal with vapor.  The gas or vapor that forms will effuse throughout the warehouse.  Prior to entry, an ammonia concentration reading is taken at the point of entry.  If the concentration is in the flammability (16%-25%) range, then entry is prohibited.  If the concentration is below the flammability range, entry is permitted and periodic readings are taken closer to the break.  A Self Contained Breathing Apparatus (SCBA) is worn by all members that enter the contaminated area.\n\nVentilation will be started as soon as possible (once the area has been adequately evacuated).  The facility is equipped with several fans that can be placed near the break.  If there is liquid ammonia in the area, the response team will soak up the liquid with some type of absorbent material maintained on site, put it in barrels, and remove it from the premises.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA detailed Process Hazard Analysis and Seismic Risk Assessment was conducted for the facility prior to charging the system with ammonia in June 1996.  The majority of recommendations from this study were implemented prior to or shortly after startup.  During the Process Hazard Analysis"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 20746,
      "SummaryText": "revalidation session on May 25, 1999, a thorough review of these mitigation measures was conducted. It was revealed that they had been resolved with the following exceptions:\n\n1.  Install a manual shut off switch for the immersion oil heater.\n2.  Change the electrical so that the liquid pumps remain off in the event of a power failure until an operator manually restarts the system.\n\nThese mitigation measures have been implemented (February 14, 2000)."
    }
  ]
}