{
  "FacilityID": 20824,
  "FacilityName": "City of Fortuna Wastewater Treatment Plant",
  "FacilityStr1": "180 Dinsmor Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fortuna",
  "FacilityState": "CA",
  "FacilityZipCode": "95540",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "40.590556",
  "FacilityLongDecDegs": "-124.156333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 982362253,
  "ParentCompanyName": "City of Fortuna",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fortuna",
  "OperatorStr1": "180 Dinsmor Drive",
  "OperatorStr2": null,
  "OperatorCity": "Fortuna",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95540",
  "OperatorZipCodeExt": null,
  "RMPContact": "Charles W. Clark",
  "RMPTitle": "Director of Public Works",
  "FTE": 6,
  "OtherEPAFacilityID": "CAD982362253",
  "EPAFacilityID": "100000149626",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-03-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-03-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 40.58779,
  "FRS_Long": -124.15544,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29305,
      "AltID": "Chlorination",
      "FacilityID": 20824,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30045,
          "ProcessID": 29305,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 38092,
          "ProcessID": 29305,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 538092,
          "ProcessID": 29305,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20824,
      "SummaryText": "Executive Summary\n\n\nThe City of Fortuna is submitting this executive summary in accordance with the California Accidental Release Prevention (CalARP) program including the Federal Accidental Release Prevention program [Title 40, Code of Federal Regulations (CFR) Part 68] with certain additions specific to the state pursuant to Article 2, Chapter 6.95, of the Health and Safety Code.\n\nBackground\n\nThe City of Fortuna is located in Humboldt County on California's Scenic North Coast and is approximately 250 miles north of San Francisco.  The wastewater treatment plant, which was constructed in 1958, serves a population of approximately 10,063 people.  Wastewater flows from the City of Fortuna range between 0.75 million gallons per day during dry weather and 2.4 million gallons per day during winter storms.  Most wastewater receives secondary treatment with activated sludge.  Secondary clarifier overflow is disinfected and dechlorinated prior to discharge to the Eel River at the confluence of Strongs Creek.  Wastewater is discharged to a percolation pond on an exposed gravel bar during summer months.   A series of ponds provides influent flow equalization during winter storms.  During prolonged periods of precipitation chlorinated effluent from the final pond discharges to Strongs Creek near the confluence with the Eel River.\n\nRegulated Toxic Substance in Question\nThe City of Fortuna currently uses 4,000 pounds of chlorine, Standard Industrial Classification code (4952), in a process to disinfect wastewater.  The maximum quantity of chlorine stored on-site as listed on the RMP is 6,000 pounds.  The chlorine is stored as a liquid under pressure, which enables operators to use the chlorine gas for the disinfecting process.  The City of Fortuna has used chlorine for this purpose since 1958 with a history of no accidents.\n\nWorst-case and Alternative Release Scenarios\n\nAn off-site consequence analysis was performed using an EPA recommended air dispersion model, RMP*Comp. Both "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20824,
      "SummaryText": "worst-case and alternative scenarios were evaluated using the air dispersion model. \n \n? The worst-case scenario was modeled assuming that an existing 2,000-pound chlorine tank ruptured releasing chlorine gas into the environment over a 10-minute period.  The release rate was 200lb/min with no mitigation measures.  For the worst-case scenario, the effective distance to a toxic endpoint of 0.0087 mg/l was determined to be 3.0 miles over rural surroundings.  Other assumptions include a wind speed of 1.5 m/s, wind stability class F, and a air temperature of 77 degrees.  The effective distance encompasses approximately 10,000 people, Fortuna Union High School, U.S. 101 Freeway, and the Eel River.  The worst-case scenario does not account for the current vented containment, existing chlorine detection alarm system, or strength of the chlorine tanks.  \n \n? An alternative scenario was modeled. Release duration of 45 minutes, with a wind speed of 3 m/sec and rural topography was chosen for the air dispersion model.  For the alternative scenario, the effective distance to a toxic endpoint of 0.0087 mg/l was determined to be 0.6 miles.  However, the alternative scenario does not consider the vacuum that the chlorinating system experiences under operation.  When a leak occurs in the chlorinating system the vacuum is lost causing all gas flow to stop, resulting in a very small loss of chlorine gas.  Other assumptions include a wind stability class D and an air temperature of 77 degrees.  The effective distance encompasses approximately 800 people, the Fortuna Wastewater Treatment Plant and Public Works Department, Fortuna High School, US 101, and a portion of the Eel River.\n\nThe City of Fortuna feels the alternative scenario is a more appropriate modeling scenario for the chlorinating process at the Fortuna Wastewater Treatment Plant.\n\nEmergency Response Program\n\nThe City of Fortuna maintains a detailed emergency response plan.  In the event of an accidental release of chlorine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20824,
      "SummaryText": " gas, the chlorine detection system would sound an alarm and a rotating beacon would alert plant personnel. The Fortuna Police Department is notified automatically by a resident emergency response monitoring system, and the chlorinating system would shut down due to loss of vacuum.  The Eureka Fire Department under the provision of a Joint Powers Agreement with Humboldt County and the City of Fortuna now operates a Hazardous Materials Response Team which is available 24 hours a day to assist in the identification and containment of hazardous materials such as chlorine. Employees are directed to call 911 as soon as a leak is detected and to evacuate upwind out of the area.  Trained personnel onsite would be the first on the scene to assess and if manageable, repair the chlorine leak.  The Fire Department or Fortuna Police Department would seal off the area and stand by with fresh oxygen containers.  The movement of the gas cloud would be monitored with air dispersion models and depending on the prevailing wind direction, further evacuations could become necessary.\n\nSafety Training\n\nThe City of Fortuna maintains special training for dealing with toxic substances.  All employees complete a chlorine awareness course once every two years, provided by either a certified vendor or by the City of Fortuna.   All aspects of chlorine safety are covered, including emergency container repair.  Plant employees are trained in the use of chlorine institute A and B container repair kits.  Tyvek suits, rubber gloves and boots, and a Self Contained Breathing Apparatus are all located at the Fortuna Wastewater Treatment Plant.  All employees complete a CPR class, as well. \n\n\nAccident History\n\nDue to an excellent accidental release program and safe practices the City of Fortuna has never experienced an accidental release of the regulated substance chlorine that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, shelteri"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20824,
      "SummaryText": "ng in place, property damage, or environmental damage.\n\nCompliance with Rules and Regulations\n\nTo the best of our knowledge, the City of Fortuna is and has been in compliance with rules and regulations regarding the toxic substance chlorine, with federal, state, and local authorities.\n\nPlanned Safety Improvements\n\nAt this time the City of Fortuna has no planned safety improvements dealing with chlorine or the chlorinating process.  However, in order to maintain a high standard of safety, meetings are held on the first day of each week to discuss any safety matters that are of concern.\n\nThe City of Fortuna is fully aware of the potential problems that are inherent with the use of chlorine or any other toxic substance.  Safety and prevention of an accidental release of a toxic substance are of the utmost concern.  The City of Fortuna has reviewed its accidental release prevention program and emergency response program.  Based on its excellent accident history and accidental release prevention program, the City of Fortuna is confident that current procedures and safe practices will effectively mitigate any accidental release.  \n"
    }
  ]
}