{
  "FacilityID": 20870,
  "FacilityName": "Albemarle Corporation East Plant",
  "FacilityStr1": "5610 Shuler Road",
  "FacilityStr2": null,
  "FacilityCity": "Magnolia",
  "FacilityState": "AR",
  "FacilityZipCode": "71753",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05139",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "33.186389",
  "FacilityLongDecDegs": "-92.930056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Albemarle Corporation",
  "Company2Name": null,
  "CompanyDUNS": 825080096,
  "Company2DUNS": null,
  "OperatorName": "Albemarle Corporation",
  "OperatorStr1": "P.O. Box 729",
  "OperatorStr2": null,
  "OperatorCity": "Magnolia",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71754",
  "OperatorZipCodeExt": "0729",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168365",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-03-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-03-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-11-02 00:00:00",
  "DeRegistrationEffectiveDate": "2010-08-16 00:00:00",
  "AnniversaryDate": "2005-03-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 33.18653,
  "FRS_Long": -92.93048,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29385,
      "AltID": "Bromine East",
      "FacilityID": 20870,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 38276,
          "ProcessID": 29385,
          "ChemicalID": 56,
          "Quantity": 110000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 38277,
          "ProcessID": 29385,
          "ChemicalID": 60,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 38278,
          "ProcessID": 29385,
          "ChemicalID": 62,
          "Quantity": 78000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30127,
          "ProcessID": 29385,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16144,
              "Process_NAICS_ID": 30127,
              "SafetyReviewDate": "2000-01-15 00:00:00",
              "PHA_Date": "1999-11-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-06-01 00:00:00",
              "TrainingReviewDate": "2000-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-06-01 00:00:00",
              "EquipmentInspectionDate": "2000-06-01 00:00:00",
              "EquipmentTested": "NA",
              "ChangeMgmtDate": "2000-06-01 00:00:00",
              "ChangeMgmtReviewDate": "2000-06-01 00:00:00",
              "PreStartupReviewDate": "2000-06-01 00:00:00",
              "ComplianceAuditDate": "2000-06-01 00:00:00",
              "AuditCompletionDate": "2000-06-01 00:00:00",
              "IncidentInvestigationDate": "2000-06-01 00:00:00",
              "InvestigationChangeDate": "2000-06-01 00:00:00",
              "ParticipationPlansReviewDate": "2000-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2000-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2000-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2000-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 23243,
                  "PreventionProgram3ID": 16144,
                  "ProcessChemicalID": 38276
                },
                {
                  "PrimaryKey": 23244,
                  "PreventionProgram3ID": 16144,
                  "ProcessChemicalID": 38277
                },
                {
                  "PrimaryKey": 23245,
                  "PreventionProgram3ID": 16144,
                  "ProcessChemicalID": 38278
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20870,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-06-01 00:00:00",
    "ERTrainingDate": "2000-06-01 00:00:00",
    "CoordinatingAgencyName": "Union County LEPC (Primary)",
    "CoordinatingAgencyPhone": "8708641906",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20870,
      "SummaryText": "CTB   S:\\ENVIRO\\SARA\\RMP\\EPEXESUM.WPDALBEMARLE EAST PLANT\r\nRisk Management Plan\r\n\r\nEXECUTIVE SUMMARY\r\n\r\n\r\n\r\nAbout our Facility:  \r\n\tThe East Plant Facility is located in rural western Union County, about 13 miles west of El Dorado and 17 miles south southeast of Magnolia, Arkansas.  Land use in the immediate vicinity of the site is primarily agricultural, with silviculture and animal operations predominating.  There is a bromine manufacturing facility operated by Great Lakes Chemical Corporation southwest of the East Plant Facility.  The plant is located on the west side of a low north - south trending hill or ridge just east of an intermittent stream.  The East Plant is a new facility scheduled to begin operation in 2000.  \r\n\tThe location of the plant is due to the presence of natural brine deposits located about 1.5 miles beneath the plant.  These brines are withdrawn through a system of wells and processed to produce bromine and hydrogen sulfide, and then replaced into the same geologic formation by a second system of wells.  \r\n\tThe East Plant Facility produces bromine only.   \r\nAbout our accidental release prevention and emergency response policies:\r\n\tThe East Plant Facility has very active accidental release prevention and emergency response programs.  It is the policy of the East Plant Facility to reduce the risk of chemical release to the extent feasible.  The main vehicle for chemical risk reduction is the Process Safety Management (PSM) program.  When the OSHA PSM standard was promulgated, existing programs were subsumed into the PSM program following the OSHA standard.  The East Plant is subject to the same internal and external requirements as its sister plants in South Arkansas.  \r\n\tThe Policy of the East Plant is to first prevent the occurrence of emergency situations, but if prevention measures are unsuccessful, to respond to those situations in a professional and appropriate manner.  The site has an integrated Emergency Plan which follows EPA's \"One"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20870,
      "SummaryText": "Plan\" concept.  East Plant personnel respond to emergencies on site with a trained fire brigade, HazMat responders, and a corps of trained EMTs.  The emergency plan provides for coordination with local care givers, first responders, law enforcement, and the county emergency response infrastructure through the county-wide emergency plan.  \r\n\tBriefly, if a chemical incident appears to have the potential for off site impact, the local County Emergency Coordinator would assume situational control, while East Plant personnel work to mitigate the problem.  If a situation has impact beyond the borders of Union County, the county-wide emergency plan provides for coordination with adjoining counties and parishes.\r\n\tAll of our south Arkansas facilities use the same basic accidental release prevention and emergency response programs.  Using the same plan makes training easier and coordination with local off site responders better.  Details of the emergency plans (such as maps; locations of response equipment) are different due to the physical differences in the facilities.\r\nRegulated substances handled at the East Plant:\r\n\tThe East Plant will manage three listed chemicals in one process.  Information on the handling and storage was gathered.  These three chemicals and one process were found to be subject to the RMP rule.  The accidental release prevention and emergency response programs are exactly the same for covered and non-covered processes; covered and non-covered chemicals are both subject to both programs.\r\n\tThe Risk Management Program has been incorporated into the PSM program to provide continuity.  A description of our risk management program is found below.  \r\nOur accidental release prevention program:\r\n\tWe have included chemical specific steps for release prevention under each alternate-case scenario.\r\n\tThe East Plant Facility is subject to the OSHA PSM standard.  We have internal procedures which drive compliance with both the OSHA PSM standard and the new EPA RMP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20870,
      "SummaryText": "standard.\r\n\tWe have compiled detailed information on all process (both covered and non-covered) which includes hazard information on each substance, technical process information, and process equipment information.  This information is used in the Process Hazard Analysis (PHA).\r\n\tPHA's have been conducted on all processes, and are repeated according to a regular schedule (maximum of 5 years) or when certain events trigger performance of the PHA.  The PHA identifies any and all possible mishaps, the likelihood and consequences of mishaps, and predicts how safety and mitigation systems will perform in the event of a mishap.  For each PHA, a team is formed which possesses the requisite expertise in engineering, process operations, hazard analysis, industrial hygiene, safety systems, and emergency response.  Several standard methods may be used to analyze the available information, and more than one method may be applied to a process hazard analysis.  The PHA documentation is retained for the life of the process.  This information is used to eliminate hazards when possible, and mitigate those hazards when elimination is not possible or impractical.\r\n\tStandard Operating Procedures (SOPs) exist when each process is first started up, and undergo continual review and improvement.  Some of the items included in SOP's are procedures for start-ups, shut-downs, routine or hazardous procedures, operation of safety and environmental control systems, and mitigation of process hazards.  SOPs are updated to reflect current operating conditions.  Each SOP is reviewed no less often than annually.\r\n\tTraining is the key aspect of accident prevention.  Each employee in an operating process receives job specific and general training on safety and health hazards, emergency operations, and safe work practices.  This training is administered according to the needs of the employee and the specific requirements of the program.  \r\n\tPreventative Maintenance (PM) is an integral part of our accid"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20870,
      "SummaryText": "ental release prevention program.  Our PM program addresses equipment and controls whose failure could lead to injury, significant release, or property loss.  The program includes regular inspections and tests of process equipment consistent with manufacturer's recommendations, good engineering practices, and field experience.  Documentation of the results of tests and maintenance is maintained.  \r\n\tWhen a new or modified system is started up for the first time, the likelihood of unexpected consequences is increased.  For this reason, pre-start-up reviews are conducted with the aim of insuring that: design specifications are adequate and have been met; adequate safety, operating, maintenance, and emergency procedures are in place; and that employee training is adequate and has been completed.\r\n\tMany historical accidents may be traced to a seemingly minor or inconsequential process change.  We manage process changes through a system that insures the impact of a change is assessed and appropriately addressed before the change is implemented.  Part of this program (Management of Change) is communication of the change and anticipated effects to all affected employees, and training provided as necessary.\r\n\tTo assure compliance with this program, regular audits are conducted. \r\n\tWe make every effort to minimize risk through training, preparation, and planning.  Yet an incident may occur.  When an incident occurs, an investigation is performed to determine the root causes for the incident and to recommend corrective action to prevent a reoccurrence.  These investigations are performed on minor (even trivial) incidents.  Lessons learned on trivial (no impact) and \"near miss\" incidents often can often be used to teach us how to avoid more serious consequences.  Documentation of the investigation is maintained.  \r\n\tThe best source of information about process hazards is employees who work in an existing process.  Line employees are an integral part of our process of chemical"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 20870,
      "SummaryText": "hazard analysis.  Employee access to the results of PHAs and other aspects of the risk management program is ensured and encouraged.\r\n\tWe use a permit system to ensure that all aspects of a job (non-routine) must be considered before performing that job.  Each process issues Safe Work Permits for non routine jobs done in that area each day.  Permits generally expire at the end of a shift and are critical to communicating jobs in progress within a process area.  A Safe Work Permit may require the permittee to initiate and complete a Hot Work Permit before performing certain tasks.  Sometimes, tasks involving welding, cutting, braising, or other flame or spark producing activities, must be performed in areas where flammable chemicals are present.  Hot work permits ensure fire prevention and protection requirements have been implemented prior to beginning the work.  Another essential part of the risk management program is the use of \"lock out/ tag out\" procedures.  When a safe work permit is issued, the permit requires the permittee to assure that all sources of potential energy have been deactivated.  For instance, the permittee may perform the following procedures before working on a pump: Check the Safe Work Permit to make sure operations has purged and drained the pump; check the red tags in place to make sure the pump is isolated from the process; register the red tag on the unit Red Tag Master; and place a personal locking device on the electrical switchgear energizing the pump.  No employee can remove a red tag, actuate a tagged component, or remove a personal locking device placed by another employee.  \r\n\tWe depend on contractors and contract employees for many essential services.  Under our PSM program, we ensure that contractor preformed maintenance, repair, and general operations are preformed safely.  Contractors are fully informed of the potential hazards of the relevant processes and applicable portions of the facility emergency response plan.  The contra"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 20870,
      "SummaryText": "ctor, in turn, must control the entry, presence, and exit from process areas.  The contractor, as a condition of employment, must adhere to all facility safe work standards and practices.  \r\n\tYou will find specific prevention program information in section 7 of this plan.  Section 8 does not apply to this facility.\r\nFacility five year accident history:\r\n\tThe East Plant has no history of incidents with offsite consequences.  The EPA RMP program requires reporting on \"regulated\" chemicals in \"covered\" processes in the five years proceeding the date of RMP submission.  The East Plant (New in 2000) does not have any incidents which meet the EPA criteria. \r\n\r\n\r\nFacility emergency response program:\r\n\tOur emergency response plan is in the format developed by EPA.  This format is commonly known as the \"One Plan.\"  This particular format was developed to address the off site responder need for simplicity while complying with all regulatory requirements.  \r\n\tThe emergency response program is based on the principle that the facility should respond to incidents within the scope of the facility's expertise, while the local authorities respond within the scope of the Union County Emergency Response Plan.  This means that the facility is responsible for preventing incidents before they happen.  But if a incident does occur, the facility is responsible for mitigating the offsite consequences of the incident by source control.  The Union County Department of Emergency Management is charged with implementing the Union County Emergency Plan and coordinating the response.  The Union County Emergency Plan was developed by the Union County Local Emergency Preparedness Committee (UCLEPC) under the direction of the Union County Emergency Response Director with the aid of the Union County Judge.\r\n\tThe East Plant Emergency Plan contains procedures for response to chemical releases, fires, and natural disasters.  Provision is made for informing the public through responsible officials accordi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 20870,
      "SummaryText": "ng to the provisions of the County Emergency Plan.  The emergency plan describes the location and mode of use of specialized emergency response equipment.  The plan also describes the delivery of medical treatment for injuries.\r\n\tPublic awareness is an important component of an emergency response program.  The East Plant facility maintains continual contact with the public through regular meetings of the Community Advisory Panel (CAP).  The CAP advises the facility on the need, frequency, and effectiveness of public communications. \r\nPlanned changes to improve safety:\r\n\tThe best way to protect the public is by preventing accidents.  We use the Process Safety Management process to identify and prevent chemical releases.  The PSM process drives continual improvement in process safety.\r\n\tOffsite, we have been active in supporting (through donations, participation and membership) the Columbia County LEPC since its formation in 1987, and expect to support the UCLEPC in the same way.  EPA's implementation of the Clean Air Act Amendments of 1990 caused us to examine, and plan for, incidents which are extremely unlikely.  As a result of this examination, the entire emergency response process has benefitted.  \r\n\tTwo UCLEPC initiatives are worthy of mention.  The first is the filming of a public service video, which instructs the public how to \"shelter in place.\"  The second is the purchase and installation of an automated telephone system capable of calling citizens likely to be affected by a chemical emergency or natural disaster and delivering specific instructions.  \r\nGeneral comments about chemical release scenarios:\r\n\tAll release modeling included in this plan comes from EPA's \"Off Site Consequence Analysis Guidance,\" May 24, 1996, extensively revised April 15, 1999.  Endpoint distances were calculated using the EPA provided tool \"RMP Comp, Ver. 1.06.\"  Results from other versions of \"RMP Comp\" may not match the results of Ver. 1.06, the latest version available in May"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 20870,
      "SummaryText": "1999.  The Worst Case Scenario (WCS) is rigidly defined by the RMP rule.  \r\n\tFor simplicity's sake, we have used the recommendation of EPA guidance for atmospheric conditions.  For the WCS, this is a temperature of 77 deg. F., wind speed 1.5 meters per second, atmospheric stability class F.  For the Alternate Case Scenarios these conditions are 77 deg. F., wind speed 3.0 meters per second, and atmospheric class D.  In both WCS and ACS, the forested, rolling terrain around the East Plant is characterized by a surface roughness factor \"urban.\"  When interpreting impact, it should be remembered that an actual release travels in the direction of the prevailing wind, and does not disperse much toward the sides of the centerline of the direction of travel.  Information on the Toxics WCS is found in section 2 of this plan; section 3 contains Toxics ACSs.  The East Plant does not have flammables reportable under sections 4 and 5 of this plan.\r\n\tThe Alternate Case Release Scenarios (ACS) were developed by a knowledgeable panel of safety, industrial, and environmental professionals.  This panel reviewed several sources in developing the scenarios: Actual reported incidents; Process Hazard Analyses (PHAs); Data from the EPA ARIP database (nationwide); and collective process hazard knowledge.  Although some of the ACS may have roots in actual recorded incidents, the scenario may have been intentionally manipulated so as to have off site consequences which were absent in the real incident.  For instance, two real incidents may have been combined to have more serious consequences (for modeling purposes) than did the actual incident.  The most weight was given to the concerns of the process unit leadership.\r\n\tFor public receptor identification, we used the \"Landview III Environmental Mapping Software\" developed by the EPA and the Department of Commerce.   \r\nToxic chemical worst-case release scenario:\r\n\tAt the East Plant, the Worst Case Scenario (WCS) is a sudden release of all the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 20870,
      "SummaryText": "chlorine in the chlorine storage tank and an interconnected tank trailer.  The conditions are for a wind speed of 1.5 m/sec, atmospheric stability class F, air temperature 77 deg. F.  The forested, rolling terrain around the East Plant is characterized by a surface roughness \"urban.\"  Results of the WCS may be found in section 2.\r\n\t\"RMP Comp\" estimates the distance to the toxic endpoint as 14 miles.  \r\n\"RMP*Comp Ver. 1.06,  Results of Consequence Analysis:\r\nChemical: Chlorine   CAS #: 7782-50-5\r\nCategory: Toxic Gas; Scenario: Worst-case; Liquefied under pressure; Quantity Released: 77,486 pounds; Release Duration: 10 min.; Release Rate: 7,750 pounds per min.; Mitigation Measures: NONE; Topography: Urban surroundings (many obstacles in the immediate area); Toxic Endpoint: 0.0087 mg/L; basis: ERPG-2. Estimated Distance to Toxic Endpoint: 8.6 miles (13.8 kilometers)\r\nAssumptions About This Scenario:  Wind Speed: 1.5 meters/second (3.4 miles/hour); Stability Class: F; Air Temperature: 77 degrees F (25 degrees C).\"\r\n\tThis scenario is unlikely due to the robust construction of the chlorine tank and tank trailer, and the physical properties of chlorine.  A sudden loss of pressure combined with vaporization of the tank contents would tend to freeze the chlorine in the vessel, greatly reducing the release rate.\r\nToxic chemical alternate-case scenario #1:\r\n\tThe first East Plant Alternate Case Scenario (ACS) is for a release of anhydrous ammonia.  Ammonia is a gas under standard conditions, and is stored liquefied under pressure.  The ACS selected postulates a leak near the bottom of the ammonia storage tank, resulting in a opening of about 3.14 square inches.  An opening of this size could result in the immediate release of 60,000 pounds of ammonia in 7.9 minutes.  \r\n\"RMP Comp\" estimates a distance to Toxic Endpoint of 0.5 miles.\r\n\"RMP*Comp Ver. 1.06, Results of Consequence Analysis:\r\nChemical: Ammonia (anhydrous)  CAS #: 7664-41-7\r\nCategory: Toxic Gas; Scenario: Alternative"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 20870,
      "SummaryText": "; Liquefied under pressure; Release Duration: 6.1 minutes; Storage Parameters: Hole in liquid space of tank; Hole or puncture area: 3.14 square inches; Height of liquid above hole: 84 inches.  Release Rate: 7,560 pounds per min.; Mitigation Measures: NONE; Topography: Urban surroundings (many obstacles in the immediate area); Toxic Endpoint: 0.14 mg/L; basis: ERPG-2.\r\nEstimated Distance to Toxic Endpoint: 0.5 miles (0.8 kilometers)\r\nAssumptions About This Scenario: Wind Speed: 3 meters/second (6.7 miles/hour); Stability Class: D; Air Temperature: 77 degrees F (25 degrees C).\"\r\n\tThis scenario has not occurred, and practices are in place to prevent such an occurrence.  The tank is heavily constructed and well protected.  There are no fittings below the liquid level, which eliminates the possibility that one might be sheared off. \r\nToxic chemical alternate-case scenario #2:\r\n\tThe second East Plant ACS is for a release of bromine.  Bromine is a liquid at standard conditions.  The ACS selected is based on the bromine tanker trailer driver pulling off the load spot while still connected, breaking off the loading connections.  The release rate used was 7610 pounds per minute for 5 minutes.    \r\n\t\"RMP Comp\" estimates a distance to Toxic Endpoint of 2.1 miles.\r\n\"RMP*Comp Ver. 1.06, Results of Consequence Analysis:\r\nChemical: Bromine   CAS #: 7726-95-6\r\nCategory: Toxic Liquid; Scenario: Alternative; Quantity Released: 38,100 pounds; Release Duration: 5 minutes; Storage Parameters: Pipe Initial Operational Flow Rate: 100 pounds per minute; Cross sectional area of pipe: 1.77 square inches; Operational Pipe pressure: 1.1 atm; Change in Pipe Elevation: 45 feet; Release rate: 267 pounds per min.; Liquid Temperature: 105 F.; Mitigation Measures: Diked area, 770 square feet, 2.6 feet high; Release Rate to Outside Air: 229 pounds per minute; Evaporation Time: 166 min.; Topography: Urban surroundings (many obstacles in the immediate area); Toxic Endpoint: 0.0065 mg/L; basis: ERPG-2."
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 20870,
      "SummaryText": "Estimated Distance to Toxic Endpoint: 2.1 miles (3.4 kilometers)\r\nAssumptions About This Scenario:  Wind Speed: 3 meters/second (6.7 miles/hour); Stability Class: D; Air Temperature: 77 degrees F (25 degrees C).\"\r\n\tThere are several procedural safeguards to keep the loader from allowing the truck to pull away while still connected.  Remotely operated shut offs would be activated to stop the flow of bromine.  If bromine is spilled in the area, the dike would be flooded with water to cover the bromine and reduce the emission rate until the bromine could be returned to the process. \r\nToxic chemical alternate-case scenario #3:\r\n\tThe last East Plant ACS is for a release of chlorine.  Chlorine is received in tank trailers and is connected to rigid piping by a special flexible hose.  A scenario which postulates a punctured surge tank or tank trailer is not reasonable (lack of history nationwide).  The scenario selected postulates a liquid chlorine release due to a transfer hose failure. \r\n\t\"RMP Comp\" estimates a distance to Toxic Endpoint of 0.8 miles.\r\n\"RMP*Comp Ver. 1.06,  Results of Consequence Analysis\r\nChemical: Chlorine   CAS #: 7782-50-5\r\nCategory: Toxic Gas; Scenario: Alternative; Liquefied under pressure; Release Duration: 10 minutes; Storage Parameters: Release from Pipe; Initial Operational Flow Rate: 50 pounds per min.; Cross-sectional area of pipe: 0.785 square inches; Operational pipe pressure: 100 psi; Change in pipe elevation: 0 feet; Release Rate: 3,820 pounds per min.; Mitigation Measures: NONE; Topography: Urban surroundings (many obstacles in the immediate area); Toxic Endpoint: 0.0087 mg/L; basis: ERPG-2.\r\nEstimated Distance to Toxic Endpoint: 0.8 miles (1.3 kilometers)\r\nAssumptions About This Scenario:  Wind Speed: 3 meters/second (6.7 miles/hour); Stability Class: D; Air Temperature: 77 degrees F (25 degrees C).\"\r\n\tTo prevent this scenario from happening, we inspect transfer hoses before use and replace them regularly.  To mitigate the effects of an"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 20870,
      "SummaryText": "incident involving chlorine unloading, we use remotely operated block valves at the unloading station and storage tank, as well as excess flow devices to shut off flow on condition of an abnormally high flow rate.\r\nFlammable chemicals:\r\n\tThere are no regulated flammables at the East Plant Facility.\r\n\r\n1"
    }
  ]
}