{
  "FacilityID": 20931,
  "FacilityName": "Ephrata Borough Wastewater Treatment Plant # 1",
  "FacilityStr1": "405 South Reading Road",
  "FacilityStr2": "PA State Route 272 South",
  "FacilityCity": "Ephrata",
  "FacilityState": "PA",
  "FacilityZipCode": "17522",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42071",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "40.176222",
  "FacilityLongDecDegs": "76.197889",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": "ephrataboro.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ephrata Borough Authority",
  "OperatorStr1": "114 East Main Street",
  "OperatorStr2": "Ephrata Borough  WWTP # 1",
  "OperatorCity": "Ephrata",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17522",
  "OperatorZipCodeExt": "2707",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000017661",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-04-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-04-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-04-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-04-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 40.17415,
  "FRS_Long": -76.19647,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29465,
      "AltID": "Chlorination System",
      "FacilityID": 20931,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 38365,
          "ProcessID": 29465,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30208,
          "ProcessID": 29465,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11475,
              "Process_NAICS_ID": 30208,
              "SafetyReviewDate": "2000-03-31 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2000-03-31 00:00:00",
              "ChangeCompletionDate": "2000-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Process controls",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-03-01 00:00:00",
              "TrainingReviewDate": "2000-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Audiovisual Aids, Simulation",
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-03-01 00:00:00",
              "EquipmentInspectionDate": "2000-03-01 00:00:00",
              "EquipmentTested": "Chlorine System",
              "ComplianceAuditDate": "2000-03-31 00:00:00",
              "AuditCompletionDate": "2000-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2000-03-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Disinfection of plant effluent to the Cocalico Creek",
              "_chemicals": [
                {
                  "PrimaryKey": 12007,
                  "PreventionProgram2ID": 11475,
                  "ProcessChemicalID": 38365
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20931,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2000-03-31 00:00:00",
    "ERTrainingDate": "2000-03-01 00:00:00",
    "CoordinatingAgencyName": "LEPC of Lancaster County",
    "CoordinatingAgencyPhone": "7176641204",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20931,
      "SummaryText": "    The Borough of Ephrata's Emergency Response Plan is a comprehensive plan involving a unified approach that integrates technology, procedures, and management practices.  All applicable procedures of the United States Environmental Protection Agency (USEPA) Prevention Program are adhered to.  Ephrata Borough employees take safety seriously as stated in our mission statement.  \"Our mission, as Borough of Ephrata employees is to strive for excellence in protection and service, to accept challenges as opportunities to promote teamwork, affirming our commitment to the community.\"\n\n    The Borough of Ephrata's Wastewater Treatment Plant # 1 (WWTP #1) Chlorination System was installed to disinfect the effluent flow from the plant to the Cocalico Creek to meet the National Pollution Discharge Elimination System (NPDES) Permit Limit for fecal coliform.  The Chlorine Building is a block building located to the west (back end of the Plant) just south of the Return Sludge Building at the WWTP #1.  WWTP #1 is located on the west side of  PA State Route 272,  at 405 South Reading Road across from the new Ephrata Public Library.  The Chlorine Building houses liquid chlorine in  two one ton cylinders on scales with chlorinators (vacuum regulator), a total residual chlorine feed system, various electrical panels, building exhaust fan, and an alarm system.  Additional safety equipment (two SCBA Air Packs) is located in the Adminestration Building.  Inside the chlorine building is a cradle holding one additional container which may be full or empty depending on the delivery schedule.  The WWTP is normally staffed weekdays 7:00 am to 3:00 pm with 8 personal and from 3:00 pm to 11:00 pm with one operator.  On weekends two operators are on site performing only necessary checks and operations.  One operator is always on call for handling emergencies and trouble alarms which may occur.  \n\n    The offsite consequence analysis includes consideration of two chlorine release scenarios, iden"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20931,
      "SummaryText": "tified as \"worst case release\" and \"alternative scenario\".  The first case scenario \"worst case release\" is defined by EPA as \"the owner or operator shall assume that the .. Maximum quantity in the largest vessel ... is released as a gas over 10 minutes,\" due to an unspecified failure.  The second \"alternative scenario\" is defined by EPA as \"more likely to occure than the worst-case release scenario\".  \n\n    Atmospheric dispersion modeling is performed to determine the distance traveled by the chlorine released before its concentration decreases to the \"toxic endpoint\" selected by EPA at 3 ppm, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair the individual's ability to take protective action.\"  The residential population within a circle with a radius corresponding to a toxic endpoint distance is defined, \"to estimate the population potentially affected\".\n\n    The worst-case release scenario at the WWTP #1 involves the failure of a single one ton  cylinder ( 2,000 lbs. ) which is separately connected to its own vacuum regulator.  The offsite consequence analysis for this scenario was preformed using the RMP*Comp! Version 1.03 computer program developed by EPA for this purpose.  Conditions predefined by EPA, namely release of the entire amount as a gas in 10 minutes, use of the one-hour average ERPG-2 as the toxic endpoint, and consideration of the population residing within a full circle with radius corresponding to the toxic endpoint distance were used.  EPA set meteorological conditions to facilitate the performance of the offsite consequence analysis, namely Stability F, wind speed 1.5 meters/sec ( 3.4 miles/hr ), highest daily maximum t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20931,
      "SummaryText": "emperature (77 F).  A distance to a toxic endpoint of 1.3 miles and an estimate of residential population potentially affected of 13,500 was obtained.\n\n    The alternative release scenario at the WWTP #1 assumes the manifold and/or vacuum regulator is detached (broken off) from the one ton cylinder, possibly due to an earthquake.  This assumes a wide-open valve area: 0.11 square inches of a one ton cylinder.    The offsite consequence analysis for this scenario was also preformed using the RMP*Comp! Version 1.03 computer program developed by EPA for this purpose.  The amount of chlorine gas released is 1050 lb., at an average rate over one hour ( the duration of the release ) of 17.5 lb/min.  The toxic endpoint distance to ERPG-2 was obtained. The typical meteorological conditions used were Stability Class D, wind speed 3 meters/second (6.7 miles/hour), average air temperature of 77 F.  The estimated distance traveled to the toxic endpoint is 0.1 miles (530 feet) and an estimate of residential population potentially affected of 12 was obtained.  Activation of the chlorine detector alarm and release in an enclosed space, in direct contact with outside air are active mitigation measures considered.  \n\n     The general WWTP #1 accident release prevention program is based on the following key elements:  \n        Operator training\n        Preventative maintenance program\n        Use of state-of-the-art process and safety equipment\n        Use of accurate and effective operating procedures\n        Performance of a hazard review of equipment and procedures\n        Regular safety inspections and reviews\n\n    Chemical-specific prevention steps include availability of two self-contained breathing apparatuses (SCBA), located in the Auxiliary Building available in the event of an emergency, awareness of the hazardous and toxic properties of chlorine, and presence of chlorine detectors.  \n\n    No accidental release of chlorine has occurred at this facility within the last five y"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20931,
      "SummaryText": "ears.  \n\n    The WWTP #1 has an emergency response plan, which was drafted and approved by the Local Emergency Planning Committee of Lancaster County in compliance with SARA Title III Off-Site Plan (reviewed and updated annually).  This Plan includes an emergency response decision tree and notification plan.  \n\n    Regular safety inspections are conducted quarterly by the Borough of Ephrata's Safety Committee.  At that time recommendations are made for improved safety at the facility.  The most notable safety improvement for the chlorine handling was the requirement of having two operators present and doing the changing of a one ton cylinder during a week day and not on a weekend.  This was instituted to minimize the occurrence of an accident when staff and county safety personnel may not be as readily available.  Most chlorine leaks occur during the changing of a cylinder."
    }
  ]
}