{
  "FacilityID": 20932,
  "FacilityName": "Leonardtown Wastewater Treatment Facility",
  "FacilityStr1": "22620 Van Wert Lane",
  "FacilityStr2": null,
  "FacilityCity": "Leonardtown",
  "FacilityState": "MD",
  "FacilityZipCode": "20650",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24037",
  "LEPC": null,
  "FacilityLatDecDegs": "38.293333",
  "FacilityLongDecDegs": "-76.625",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "PP",
  "FacilityURL": "www.SOMD.com/leonardtown",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Commissioners of Leonardtown",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Commissioners of Leonardtown",
  "OperatorStr1": "Post Office Box 1",
  "OperatorStr2": null,
  "OperatorCity": "Leonardtown",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "20650",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000172877",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-09-15 00:00:00",
  "SafetyInspectionBy": "Local Government Insurance Trust",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-11-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-04-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-04-27 00:00:00",
  "DeRegistrationEffectiveDate": "2005-04-21 00:00:00",
  "AnniversaryDate": "2005-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.29333,
  "FRS_Long": -76.625,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29466,
      "AltID": "Disinfection",
      "FacilityID": 20932,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 38366,
          "ProcessID": 29466,
          "ChemicalID": 62,
          "Quantity": 1800.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30209,
          "ProcessID": 29466,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16181,
              "Process_NAICS_ID": 30209,
              "SafetyReviewDate": "2000-01-21 00:00:00",
              "PHA_Date": "2000-01-21 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-01-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-01-21 00:00:00",
              "TrainingReviewDate": "2000-01-21 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-01-21 00:00:00",
              "EquipmentInspectionDate": "1999-03-20 00:00:00",
              "EquipmentTested": "Chlorine vacuum regulators, chlorinator, injector and gas detector",
              "ChangeMgmtDate": "2000-01-21 00:00:00",
              "ChangeMgmtReviewDate": "2000-01-21 00:00:00",
              "PreStartupReviewDate": "1999-08-31 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-01-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-11-09 00:00:00",
              "ContractorSafetyReviewDate": "1998-03-28 00:00:00",
              "ContractorSafetyEvalDate": "2000-03-29 00:00:00",
              "CBI_Flag": 0,
              "Description": "OSHA Process Safety Management Plan",
              "_chemicals": [
                {
                  "PrimaryKey": 23287,
                  "PreventionProgram3ID": 16181,
                  "ProcessChemicalID": 38366
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 20932,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2000-01-21 00:00:00",
    "ERTrainingDate": "2000-01-21 00:00:00",
    "CoordinatingAgencyName": "Local Emergency Control Center",
    "CoordinatingAgencyPhone": "3014758016",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 20932,
      "SummaryText": "\nRMP Executive Summary\n\nThe Leonardtown Wastewater Treatment Facility is located on Fenwick Street on the east side of Leonardtown, Maryland.  The plant is designed to treat an average daily flow of 0.68 million gallon per day (MGD).  The treatment process consists of facultative lagoons with secondary clarifiers and chlorine contact tanks.  The plant currently treats an average flow of 0.40 mgd, which is discharged into Town Run.\n\nHomes, hospitals and commercial facilities discharge liquid and solid waste materials into the wastewater collection system.  Diseases from human discharges may be transmitted by wastewater.  Typical disease causing microorganisms include bacteria, viruses, and parasites.  These microorganisms are commonly called PATHOGENIC (disease causing) ORGANISMS.\n\nDisease producing microorganisms are potentially present in all wastewater.  These microorganisms must be removed or killed before treated wastewater can be discharged to the receiving waters.  Pathogenic microorganisms are reduced in number by the various treatment processes screening, grit removal, primary sedimentation, activated sludge, and by natural die away or dies off in unfavorable environments many microorganisms remain.  The purpose of disinfection is to destroy essentially all pathogenic microorganisms and thus prevent the spread of waterborne diseases.  Chlorine is the most widely used chemical for disinfection.  Chlorination is one of the final processes before discharging the treated wastewater to Town Run.\n\nGaseous chlorine is delivered to the plant in 150-pound cylinders.  1,200 pounds (8-150 lb. cylinders) of chlorine gas are delivered once every six weeks with a 300-pound reserve.  The total quantity of chlorine at the site is 1,800 pounds (12-150 lbs. cylinders).  These cylinders are stored on site in the loading dock area changed to a brick wall out of the sun\n\nThe cylinders are placed on their appropriate cylinder scale, equipped with securing safety chains.  The scal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 20932,
      "SummaryText": "e is used to detect the amount of gaseous chlorine remaining in the cylinder (one cylinder contains approximately 150 pounds).  The scale is equipped with a visual weight dial and net weight adjustment.  \n\nChlorine gas is removed from the cylinder dependent upon process requirements.  The gas travels through a vacuum regulator, V-Notch chlorinator (gas feeder), rotameter (flow meter), electric actuator controller (flow proportional), and into the injector.  The injector ejects the gas into a 1-1/2 PVC line and mixes it with potable water making a chlorine solution.  The chlorine solution is flows through a 1-1/2 inch PVC line connected to the clarifier final effluent pipe after the magnetic meter in the metering structure into the chlorine contact tank.  Once the chlorine solution has been added, there must be sufficient contact time between the chlorine compound and the wastewater to ensure bacterial destruction.  The chlorine contact tank is designed to give the required contact time necessary to accomplish bacterial destruction.  The desired contact time approximately 15-30 minutes.  When the flow reaches the effluent end of the chlorine contact tank, it enters the sulfur dioxide mixing chamber where sulfur dioxide is added and mixed with the chlorinated effluent.  After passing through the mixing chamber, the effluent flows down a post aeration cascade before entering Town Run.\n\nMany different activities are necessary during this process, such as initial startup, handling special hazards, normal operation, temporary operation, and emergency shutdowns.  Commissioners of Leonardtown have developed Standard Operating Procedures (SOP) describing appropriate and a consistent manner in which the company expects these tasks and procedures to be done.\n\nAn emergency procedure has been established and implemented.  Copies of these procedures are kept at the workplace and made available for employee review.  The Utility Staff consist of three people.  The duties and respon"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 20932,
      "SummaryText": "sibility for the emergency procedures are shared among the three individuals.  The staff is notified of a chlorine leak when the gas detector senses a leak.   The Chloralert continuously monitors a sample of air withdrawn from a selected location for the presence of chlorine gas.  The minimum detection level of chlorine gas is 1ppm.  The presence of chlorine gas will give a signal by the flashing of its \"Alarm\" light and tripping all interconnected auxiliary alarm and an autodialing system which calls the staff if the leak occurs after working hours.\n\nWORST CASE RELEASE SCENARIO\n\nThe worst-case release scenario implemented in this RMP is breaking off the valve stem of a 150-pound chlorine cylinder when trying to open the valve.  The valve on a 150-pound cylinder is closed very tight to eliminate a gas release during transport from the chemical company to wastewater treatment facility.  Opening the valve on a cylinder after properly connecting the vacuum regulator requires the operator to strike the cylinder wrench several times with the palm of his hand before it opens.  The operator is directly exposed to the gas. \n\nThe standard operating procedure for changing a chlorine cylinder is the buddy system.  There are two operators involved.  One change the cylinder and the other is stand by incase of an accidental emergency.  The stand by operator is to assist in getting help.  The cylinder is in an enclosed room with a chlorine gas detector.  The gas detector will give a signal via the flashing of its \"Alarm\" light and tripping all interconnected auxiliary alarm \n\nThe worst-case gas release discussed in this RMP is unlikely because if a cylinder valve is too difficult to open by hand it is reported to the chemical company and returned.\n\nALTERNATIVE CASE RELEASE SCENARIO\n\nThe alternative case release scenario implemented in this RMP is a gas leak from the lead gasket between the gas cylinder outlet valve and the vacuum regulator inlet adaptor.  The lead gasket can leak "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 20932,
      "SummaryText": "chlorine gas if the regulator's yoke screw is over tightened.  The over tightening of the vacuum regulator to the valve outlet is checked by using ammonia hydroxide.  The ammonia hydroxide vapors will give off a white smoke indicating a gas leak.  The cylinder valve is turn off and the lead gasket is replaced with a new lead gasket.  The new gasket connection is rechecked with ammonia hydroxide for leaks.\n\nThe alternative case release discussed in this RMP is unlikely because all of the connection to the process system is checked with ammonia hydroxide after each cylinder change.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Leonardtown Wastewater Treatment Facility has not had an accidental release in the past five years.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Utility Staff will respond and correct small controllable chlorine leaks ONLY.\nSmall controllable leaks are:\n    A. Leaking lead cylinder gasket\n    B. When a vacuum is not present in the vacuum regulator and vents to outside atmosphere.\n    C. Leak in the Teflon gas lines.\n\n\nThe emergency responses for the above conditions are:\n    A. Notify emergency coordinator\n    B. Put on the required Personnel Protection Suit\n    C. Put on the SCBA\n    D. Implement the Buddy System\nE. Enter disinfection room and turn the chlorine cylinders off at the main cylinder valve.\nF. Exist the room, close door.\n G. Wait for the atmosphere to return to normal.\n\nThe Utility Staff will NOT CORRECT the following chlorine leaks:\nA. Large and Uncontrollable (ex. melted fuse plug, hole in the wall of a cylinder, cylinder valve broken off)\nB. They feel unsafe and unsure of the situation\n\nThe emergency responses for the above conditions are:\nA. Call EMERGENCY CONTROL CENTER    }911~, \n\n1. Report the TYPE OF GAS leak emergency,\n2. YOUR NAME,\n3. Location LEONARDTOWN WASTEWATER TREATMENT PLANT\n4. Address 22620 Van Wert Lane.\n5. Phone Number if asked. 301-475-5445\n\nB. Evacuate the facility as shown on the Emergency Evacuation Route\nC. Notify emergency coordinator\n"
    }
  ]
}