{
  "FacilityID": 2096,
  "FacilityName": "Monson Companies, Inc.",
  "FacilityStr1": "154 Pioneer Drive",
  "FacilityStr2": null,
  "FacilityCity": "Leominster",
  "FacilityState": "MA",
  "FacilityZipCode": "01453",
  "Facility4DigitZipExt": "3498",
  "FacilityCountyFIPS": "25027",
  "LEPC": "Leominster LEPC",
  "FacilityLatDecDegs": "47.525",
  "FacilityLongDecDegs": "-71.760278",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A6",
  "LatLongDescription": "OT",
  "FacilityURL": "www.monsonchemical.com",
  "FacilityEmailAddress": "ltibert@monsonco.com",
  "FacilityDUNS": 49419682,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Eugene McDonald",
  "OperatorStr1": "154 Pioneer Drive",
  "OperatorStr2": null,
  "OperatorCity": "Leominster",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01453",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lawrence S. Tibert",
  "RMPTitle": "Dir., Business Systems & Compliance",
  "FTE": 70,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000025652",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-05-06 00:00:00",
  "DeRegistrationEffectiveDate": "2004-05-07 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.53234,
  "FRS_Long": -71.70876,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2302,
      "AltID": "TDI 80 Storage",
      "FacilityID": 2096,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2352,
          "ProcessID": 2302,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2452,
          "ProcessID": 2302,
          "ChemicalID": 77,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502452,
          "ProcessID": 2302,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2096,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Monson Companies, Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with Leominster Fire Department which provides additional emergency response expertise.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass chemical blending, packaging and distribution.  We have one (1) regulated substance present at our facility.  This substance is Toluene diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-].  The regulated substance at our facility is present in one product, TDI 80, which is delivered to the facility in factory sealed drums.\n\nThe maximum inventory of Toluene diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-] at our facility is 120,000 pounds.\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2096,
      "SummaryText": "involves a catastrophic release from TDI 80 Storage.  The scenario involves the release of 120,000 pounds of Toluene diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-].  Toxic liquid is assumed to be immediately released to form a pool of height 1 cm, from which evaporation takes place.  The entire pool is estimated to have evaporated over 4727791.72 minutes.  Passive mitigation controls such as enclosures are also taken into account to calculate the scenario.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 0.06 miles is obtained corresponding to a toxic endpoint of 0.0070 mg/L.\n\nOne alternative release scenario has been submitted for each toxic substance present in Program 2 and Program 3 processes cumulatively.  \n\nThe alternative release scenario for Toluene diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-] involves a release from Commodity Warehouse, Rack Area F in the TDI 80 Storage process.  The scenario involves the release of 550 pounds (1 55 gallon drum) of TDI 80.  Toxic liquid is assumed to be immediately released to form a pool of height 1 cm, from which evaporation takes place.  The entire pool is estimated to have evaporated over 4244684.56 minutes.  Passive mitigation controls such as enclosures are taken into account to calculate the scenario.  The release is also assumed to be controlled by active mitigation measures that include neutralization and use of adsorbent materials.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0070 mg/L of Toluene diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-] is 0.06 miles.\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2096,
      "SummaryText": ", 1967 Edition.  Our facility is also subject to EPCRA Section 302 notification requirements.\n\nAs an active member of the National Association of Chemical Distributors (NACD), Monson has chosen to implement the Responsible Distribution Process (RDP) for chemical distributors in addition to meeting our regulatory obligations.  We are extremely proud of our participation in this stringent program for leaders in the chemical distribution industry.  This process serves as the foundation for our overall chemical management program.\n\nThe following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\nProcess Safety Information\nMonson Companies, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  Material safety data sheets are maintained for all the chemicals stored or handled at our facility.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  Monson uses a series of audits and inspections to carry out these analyses.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated annually.  Any findings related to the hazard analysis are addressed in a timely manner.  In addition to our internal inspections and audits, the facility is also subject to an Responsible Distribution Process (RDP) audit every three years.\n\nOperating Procedures\nFor the purposes of safely conducting activities with TDI 80, Monson Companies, Inc. maintains written operating procedures.  These procedures address various modes of operation such as drum handling, storage area inspection and emergency spill response.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nMonson Companies, Inc. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2096,
      "SummaryText": "has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.  In addition to our regular training, we conduct a spill response drill with the manufacturer of TDI 80 (Arco) every 2-3 years.  In this exercise, a TDI 80 spill is simulated and our personnel respond as if it were an emergency.  This requires donning the required personal protective equipment, containing and neutralizing the spill and cleaning up the spill per specified procedures.  The drill is timed and critiqued.\n\nMechanical Integrity\nMonson Companies, Inc. carries out maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  The drums utilized for TDI 80 meet DOT requirements and are inspected regularly both upon receipt and while in storage within our warehouse.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Monson Companies, Inc. to manage changes in process chemicals, technology, equipment and procedures.  This program at Monson is implemented primarily through our Responsible Distribution Process (RDP).  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in es"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2096,
      "SummaryText": "tablished processes are conducted as a regular practice at Monson Companies, Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nMonson Companies, Inc. conducts monthly inspections and audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nMonson Companies, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for at least 3 years.\n\nEmployee Participation\nMonson Companies, Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Monson Companies, Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work through our contractor training program.  Material safety data sheets (MSDS) are also made available to contractors through our hazard communication program.  Contrac"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2096,
      "SummaryText": "tors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur.  Upon completion of the training, our contractors sign a form acknowledging receipt of this information and training.\n\n\n5.    Five-year Accident History\nMonson Companies, Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to the RDP program in place at our facility and our stringent release prevention policies, there has been no accidental release during this period.\n\n\n6.    Emergency Response Plan\nMonson Companies, Inc. has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nOur Emergency Plan has been shared with the Leominster Local Emergency Planning Committee (LEPC) and the Leominster Fire Department.\n\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  While we feel confident that our existing program will ensure a safe working environment, Monson is planning the construction of a new state of art chemical warehouse which will contain any chemical release.  This facility is expected to be constructed and ready for use by August 2000.\n\n\n8.    Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2096,
      "SummaryText": ": Lawrence S. Tibert\n\nSignature:\n\nTitle: Director, Business Systems and Compliance\n\nDate signed:\n\n"
    }
  ]
}