{
  "FacilityID": 21104,
  "FacilityName": "Foster Farms Kelso Poultry Plant (Rev. 3/00)",
  "FacilityStr1": "1700 South 13th Street",
  "FacilityStr2": null,
  "FacilityCity": "Kelso",
  "FacilityState": "WA",
  "FacilityZipCode": "98626",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53015",
  "LEPC": null,
  "FacilityLatDecDegs": "46.144",
  "FacilityLongDecDegs": "-122.891",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9178856,
  "ParentCompanyName": "Foster  Poultry Farms",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Foster Poultry Farms",
  "OperatorStr1": "1700 South 13th Street",
  "OperatorStr2": null,
  "OperatorCity": "Kelso",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98626",
  "OperatorZipCodeExt": null,
  "FTE": 700,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127294",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-04-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-04-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-04-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 46.126527,
  "FRS_Long": -122.899112,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29659,
      "AltID": "Kelso",
      "FacilityID": 21104,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 38572,
          "ProcessID": 29659,
          "ChemicalID": 56,
          "Quantity": 17500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30420,
          "ProcessID": 29659,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16246,
              "Process_NAICS_ID": 30420,
              "SafetyReviewDate": "2000-02-14 00:00:00",
              "PHA_Date": "2002-02-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-02-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Diffusion Tank for Pressure Relief Valves",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": "Installation of tube heat exchangers",
              "OpProceduresReviewDate": "2000-02-15 00:00:00",
              "TrainingReviewDate": "2000-02-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-02-01 00:00:00",
              "EquipmentInspectionDate": "2000-04-07 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2000-02-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": "2000-03-02 00:00:00",
              "ComplianceAuditDate": "2000-02-16 00:00:00",
              "AuditCompletionDate": "2002-02-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyReviewDate": "2000-03-28 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 23366,
                  "PreventionProgram3ID": 16246,
                  "ProcessChemicalID": 38572
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21104,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-04-01 00:00:00",
    "ERTrainingDate": "1999-09-01 00:00:00",
    "CoordinatingAgencyName": "Longview Fire Department",
    "CoordinatingAgencyPhone": "3605785217",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21104,
      "SummaryText": "FOSTER FARMS\nKELSO POULTRY PLANT\nRISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\n\nAnhydrous Ammonia Refrigeration System\n\nRevised March 2000\n\n\nEXECUTIVE SUMMARY\n\n\n\nFoster Farms Kelso Poultry Plant (referred to hereafter as \"Foster Farms\" or \"Kelso\") prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with Title 40 of the Code of Federal Regulations (CFR), Part 68.  The Environmental Protection Agency (EPA) promulgated the Risk Management Program (RMP) regulations as required in the 1990 Amendments to the Clean Air Act.  The goal of the RMP is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur.  The RMP regulations apply to facilities that handle, manufacture, use, or store toxic and flammable substances above specified threshold quantities. In addition to the RMP regulations, both the State of Washington and Occupational Safety and Health Administration (OSHA) regulate facilities with certain acutely hazardous materials under Process Safety Management (PSM) regulations, as defined in Washington Administrative Code (WAC), Chapter 296-67, and CFR Title 29, Part 1910, Section 119, respectively. As the PSM regulations contain similar requirements to the RMP requirements, Kelso's RMP/PSM was developed with consideration to both.\n\nFoster Farms prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve the anhydrous ammonia handling system and practices at the facility. Foster Farms incorporated many state-of-the-art safety features into the ammonia refrigeration system at the facility as part of the original system construction and system modifications. Foster Farms will continue to improve ammonia handling safety through the implementation of the prevention program elements of the RMP/PSM.  In the unlikely eve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21104,
      "SummaryText": "nt that a chemical release does occur at the facility, Foster Farms personnel are trained in the appropriate response measures and do not rely on support services provided by the local fire department and/or hazardous materials response team for mitigation of the release. Foster Farms will rely on community responders for medical assistance and public evacuation or protection in place, if necessary. \n\nThe Foster Farms facility is located at 1700 South 13th Avenue in Kelso, Washington.  The surrounding area consists of industrial and commercial businesses.  The facility is in an industrial park that is generally bordered by Interstate 5 on the northeast and the Kelso Airport on the southwest.  The Cowlitz River, residential, and commercial development are located northwest of the industrial park.\n\nThe facility was constructed in 1998 for Foster Farms.  Operations at the facility consist of the slaughter, processing, storage, and packaging of poultry products.  The facility is surrounded by chain-link fencing and has a secured entrance that is staffed by security personnel 24 hours per day, 365 days per year.\n\nAnhydrous ammonia is used in a refrigeration system at the facility.  The refrigeration system, which is a closed system, contains approximately 17,500 pounds of anhydrous ammonia. The system provides cooling for production areas, product, water chilling, and ice making.  A central computer system monitors and controls the refrigeration system.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, transfer pumps, and compressor controls.  \n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility.  Foster Farms reported no accidental releases at the facility within the past five years.\n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21104,
      "SummaryText": "systems covered by the RMP/PSM.  Program 3 requirements of the RMP apply to the Foster Farms facility due to the quantity of ammonia used.  Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as \"¿the greatest amount held in a single vessel¿released as a gas over 10 minutes.\"  An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\nThe largest ammonia vessel at Foster Farms, the high-pressure receiver, has a capacity greater than the quantity of ammonia contained in the system.  The normal charge for the ammonia refrigeration system is approximately 17,500 pounds. Therefore, the worst-case release scenario for the facility is a release of 17,500 pounds of ammonia in 10 minutes.  Catastrophic failure of the high-pressure receiver is required for this scenario to occur.  As required by the RMP regulations, pessimistic atmospheric conditions, very conservative chemical dispersion characteristics, and a toxic endpoint of 200 parts per million (ppm) ammonia vapor were assumed.  The predicted distance to the toxic endpoint for the worst case release scenario is approximately 1.35 miles.  This distance is slightly less than previously reported due to the use of atmospheric data more representative of the site.  The SLAB Model was used for modeling the worst-case release scenario.  SLAB was first developed by Lawrence Livermore National Laboratory under contract with the U.S. Department of Energy.  SLAB has been revised and updated by the USAF Engineering and Services Center and the American Petroleum Institute.  SLAB is commonly used to simulate the atmospheric dispersion of denser-than-air releases.\n\nFoster Farms used the alternative release scenario described in the EPA's Model Risk Management Program and Plan for Ammonia Refrigeration, November 1998.  The re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21104,
      "SummaryText": "lease scenario is described as a ¼-inch effective diameter orifice leaking liquid ammonia and resulting in an airborne release, representative of a pipe connection leak or a gasket rupture.  The evaluation used a release rate of 75.2 pounds per minute and average weather conditions.  The predicted distance to the toxic endpoint for the alternative release scenario is approximately 0.12 miles.  The release rate and predicted distance are slightly different than previously reported due to the use of atmospheric data more representative of the site.  The SLAB Model was used also for modeling the alternative release scenario.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Foster Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The Foster Farms ammonia system is continuously monitored by automated control system that shut down components if deviations from normal operating conditions occur.  The major pressure vessels in the system are connected to a diffusion panel.  Ammonia from the vessels can be mixed with water (neutralized) to prevent over-pressurization of the vessels.  Further, all pressure vessels in the system are equipped with pressure relief valves.\n\nOther safety features at the facility include: \n· emergency shutdown systems\n· component specific safety shutdowns\n· an ammonia leak detection system is installed that will close ammonia supply valves if a leak is detected\n· pressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\n· all pressure relief valves discharge to a water filled tank where the ammonia is neu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21104,
      "SummaryText": "tralized\n· all major vessels are connected to a fire diffusion panel\n· most ammonia pipes, valves and components are labeled\n· pressure relief valves are replaced at least every five years\n· a fire sprinkler system is installed in the plant\n· a central computer system monitors the refrigeration system and alarms when safety set-points are exceeded\n· ammonia system can be monitored and controlled remotely through the central computer system\n· facility is fully sprinklered for fire protection\n· engine room is ventilated\n· operators receive ongoing training in operations, maintenance and emergency response\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lock-out/tag-out program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP/PSM auditing and inspection program.  Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility.  The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A preventive maintenance system is being developed to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment.  The system will be used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21104,
      "SummaryText": "parameters.\n Changes to improve safety at the facility are ongoing.  Many of the mitigation measures suggested by the process hazard analysis team have already been implemented.  Others will be implemented during the next several months.  The status of significant mitigation measures is as follows:\n\n· the review and revision of SOPs is nearly completed\n· Foster Farms is evaluating a program to test all safety alarms and shutoffs annually\n· line labeling and valve tagging will be completed\n· Foster Farms is evaluating the installation of spring return valves for all oil draining\n· Foster Farms is reviewing the preventive maintenance program to verify that all ammonia system components are included and maintenance frequencies are appropriate\n· Foster Farms is evaluating equipment protection issues in the plant\n· Foster Farms will add ammonia awareness to forklift training program\n· Foster Farms is evaluating the installation of an audible/visible alarm in the shop that will be actuated by the central computer system or other refrigeration system safeties\n\nFoster Farms will respond to all suggested mitigation measures.  Foster Farms is scheduling completion of proposed actions.  Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Foster Farm continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM and related attachments and program elements will be incorporated consistent"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21104,
      "SummaryText": "with Foster Farms' internal review practices and Foster Farms will maintain the most current versions on site. Thus, the most current version RMP/PSM and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}