{
  "FacilityID": 21156,
  "FacilityName": "PHELPS DODGE SIERRITA, INC.",
  "FacilityStr1": "6200 WEST DUVAL MINE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "GREEN VALLEY",
  "FacilityState": "AZ",
  "FacilityZipCode": "85614",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04019",
  "LEPC": "TUCSON-PIMA OFF. OF EMER. MGMT",
  "FacilityLatDecDegs": "32.361667",
  "FacilityLongDecDegs": "112.371944",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.phelpsdodge.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 173239385,
  "ParentCompanyName": "PHELPS DODGE CORPORATION",
  "Company2Name": null,
  "CompanyDUNS": 1213149,
  "Company2DUNS": null,
  "OperatorName": "PHELPS DODGE SIERRITA, INC.",
  "OperatorStr1": "P.O. BOX 527",
  "OperatorStr2": null,
  "OperatorCity": "GREEN VALLEY",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85622",
  "OperatorZipCodeExt": "0527",
  "FTE": 690,
  "OtherEPAFacilityID": "AZD982478216",
  "EPAFacilityID": "100000098388",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0317-84",
  "SafetyInspectionDate": "1999-01-27 00:00:00",
  "SafetyInspectionBy": "MSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-04-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-04-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-04-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.4",
  "FRS_Lat": 31.87094,
  "FRS_Long": -111.09486,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29724,
      "AltID": "CL for FeCl3 Regeneration",
      "FacilityID": 21156,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 38641,
          "ProcessID": 29724,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 30485,
          "ProcessID": 29724,
          "NAICSCode": "212234",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11650,
              "Process_NAICS_ID": 30485,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "DOT STANDARDS",
              "FR_Comments": null,
              "HazardReviewDate": "1998-10-19 00:00:00",
              "ChangeCompletionDate": "1999-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "EQUIPMENT DESIGN",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-10-30 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-31 00:00:00",
              "EquipmentTested": "CHLORINATION TANKS, PUMPS, ALL VALVES & ASSOCIATED PIPING, MANOMETERS, LOADING/UNLOADING AREA",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1998-06-15 00:00:00",
              "InvestigationChangeDate": "1999-07-31 00:00:00",
              "MostRecentChangeDate": "1998-06-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12185,
                  "PreventionProgram2ID": 11650,
                  "ProcessChemicalID": 38641
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21156,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-14 00:00:00",
    "ERTrainingDate": "1999-06-03 00:00:00",
    "CoordinatingAgencyName": "TUCSON-PIMA OFFICE OF EMER. MGMT.",
    "CoordinatingAgencyPhone": "5207980600",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "MSHA REGULATIONS, 30 CFR PARTS 1 TO 199"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21156,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY.\n\nEach employee of Phelps Dodge Sierrita, Inc. (PDSI) is provided with a General Safety and Environmental Handbook.  In the handbook, the corporate (Phelps Dodge Corporation) and site-specific (Phelps Dodge Sierrita, Inc.) Safety and Health policies are presented.  The policies are included with PDSI's Risk Management Plan submittal.\n\nPDSI has an excellent record for safety and lost-time accidents.  In 1998, PDSI received the most prestigious award in the mining industry, the Sentinels of Safety Award. The Sentinels of Safety Award is cosponsored by the American Mining Congress (AMC) and the U.S. Department of Labor's Mine Safety and Health Administration (MSHA) for recognition of achieving one of the best records for number of employee work-hours in 1997 without a lost-time injury or fatality.\n\nYOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED.\n\nPDSI operates a copper and molybdenum mining and concentrating facility located approximately seven miles west of Green Valley, Arizona.  Ore containing low-grade porphyry copper and molybdenum deposits, is excavated, crushed, conveyed, milled and concentrated to produce a separable copper and molybdenum concentrate slurry. A final flotation and conditioning process is used to separate the copper minerals. The copper sulfide product is filtered and shipped to a smelter by either truck or rail for further concentrating.  The molybdenum sulfide concentrate is filtered to produce a damp cake, which is dried and stored for further processing.  \n\nThe final molybdenum sulfide concentrate still contains a small percentage of copper, which cannot be effectively removed using the final flotation process.  The copper content in the molybdenum concentrate can be significantly lowered using a ferric chloride leach process.  A hot ferric chloride solution is agitated in a series of mixing tanks with the moly concentrate.  The slurry exiting the last tank"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21156,
      "SummaryText": "is a high-grade molybdenum sulfide concentrate.  The copper leached from the process is recovered as cement copper and sent to a smelter for further processing with the copper concentrate.  \n\nThe ferric chloride leach liquor is recycled and regenerated using chlorine and iron scrap.  A 90-ton railroad tank car of chlorine is connected to each of the two 7,000 gallon chlorination tanks.  Typically, two back-up chlorine railcars are stored near the chlorinator area at the west-end of the rail line and/or by the copper concentrate storage area near the mill maintenance shop. The maximum number of railcars anticipated on site at any one time would be seven. Each chlorine railcar provides approximately a seven-day supply of chlorine for the chlorination process.\n\nThe separated molybdenum sulfide is roasted to yield a molybdenum trioxide, which is packaged for distribution.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS.\n\nPDSI is regulated by the Mine Safety and Health Administration (MSHA).  Every six months, MSHA performs a comprehensive inspection of PDSI's facility for compliance with the Federal Metal and Nonmetallic Mine Safety and Health Standards listed in the Federal Code of Regulations (CFR), 30 CFR, Parts 1 to 199.  The role of the MSHA is to enforce compliance with 30 CFR, Parts 1 to 99 as a means to eliminate fatal accidents; to reduce the frequency and severity of nonfatal accidents; to minimize health hazards; and to promote improved safety and health conditions in the Nation's mines.\n\nSeveral mitigation devices are located in the chlorination area to prevent a chlorine release from occurring. Five chlorine sensors are located around the perimeter of the chlorinator area for identifying the presence of chlorine. The sensors are capable of detecting chlorine in concentrations greater than or equal to 1 ppm.  If a release is sensed, the latching relays are de-energized and the two valves from the railcar and the aut"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21156,
      "SummaryText": "omatic addition valve close.  The valves are set up to fail in a closed position in the event of a power or air supply loss.  In addition, all of the railcars supplied by Pioneer Chlor Alkali, PDSI's chlorine supplier, are equipped with check valves, which cut off the chlorine supply if the flowrate were to increase rapidly.\n\nIn addition to the mitigation devices described above, a main chlorine shut-off device can be triggered to cease chlorine supply by manually hitting a red button located in the Moly Control Room.\n \nThe chlorination process is also equipped with an absorption system to prevent over-chlorination of the process, which may result in a chlorine release. The absorption system consists of a 265-gallon tank containing an 18% caustic soda solution.  Chlorine in excess of the process required amount is vented to the chlorination tank, where it is neutralized.  The tank is emptied daily and recharged by the Moly Utility Crew.  \n\nMonthly tank inspections are performed for each of the storage tanks in the chlorination area as part of PDSI's preventative maintenance program.  The inspections are used to monitor any signs of tank deterioration, leaking and corrosion of tanks, valves and all associated piping.  Secondary containment structures, if applicable, are also inspected for stability, leaks, and fluids present in containment structures.\n\nTHE FIVE YEAR ACCIDENT HISTORY\n\nPDSI has had no chlorine releases in the past five years requiring medical treatment other than minor first aid. As a safety precaution, PDSI requires first aid for any and all types of chlorine releases, regardless of the extent of the release.  There have been no reportable releases and no environmental impacts from chlorine releases.\n\nTHE EMERGENCY RESPONSE PROGRAM.\n\nPDSI has established an Integrated Contingency Plan (ICP) which addresses general and chemical specific emergency response procedures.  Recently, a detailed Chlorine Emergency Response Plan was added to the ICP.  Chemic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21156,
      "SummaryText": "al specific emergency response procedures for incidents involving propane were also incorporated into the revised ICP. The ICP and all subsequent revisions are sent to the Pima County Local Emergency Planning Community, Green Valley Local Fire Department, Arizona Emergency Response Commission and St. Mary's Hospital for local emergency response coordination.\n\nIn the event of a chlorine release, an audible alarm will sound.  Evacuation routes have been developed and are posted throughout the Moly area and are in the ICP.  The site has several trained first responders and a spill response team to respond to safety and environmental incidents.  \n\nPLANNED CHANGES TO IMPROVE SAFETY.\n\nThere are several changes being completed to the chlorination area that will improve safety and prevent the possibility of a release from occurring:  \n\n1. A chlorine remote video monitoring system has been purchased and is scheduled for installation by August 1999.  The system will be installed in the Moly Control Room and allow the operator(s) to monitor the loading and unloading of chlorine railcars.  If an incident involving chlorine were to occur during the loading / unloading process, the operator could quickly cease the chlorine supply from the control room.\n\n2. An expansion bottle will be installed between two block valves in the chlorine piping system.  The expansion bottle will prevent liquid chlorine from becoming trapped between the two block valves, if closed.  The estimated completion for this item is early July 1999."
    }
  ]
}