{
  "FacilityID": 2117,
  "FacilityName": "Kraft Foods, Inc.",
  "FacilityStr1": "311 South Oneida",
  "FacilityStr2": "Not Applicable",
  "FacilityCity": "Rupert",
  "FacilityState": "ID",
  "FacilityZipCode": "83350",
  "Facility4DigitZipExt": "2059",
  "FacilityCountyFIPS": "16067",
  "LEPC": "Minidoka County LEPC",
  "FacilityLatDecDegs": "42.616611",
  "FacilityLongDecDegs": "-113.686139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "n/a",
  "FacilityEmailAddress": "n/a",
  "FacilityDUNS": 42833376,
  "ParentCompanyName": "Philip Morris Companies, Inc.",
  "Company2Name": "Not Applicable",
  "CompanyDUNS": 144628310,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "311 South Oneida",
  "OperatorStr2": "Not Applicable",
  "OperatorCity": "Rupert",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83350",
  "OperatorZipCodeExt": "2059",
  "RMPContact": "David Brown",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 106,
  "OtherEPAFacilityID": "000idr00a225",
  "EPAFacilityID": "100000025457",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-05-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-11 00:00:00",
  "ErrorReportDate": "1999-06-11 00:00:00",
  "ReceiptDate": "1999-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-07 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2007-01-18 00:00:00",
  "DeRegistrationEffectiveDate": "2007-01-05 00:00:00",
  "AnniversaryDate": "2004-06-07 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.61083,
  "FRS_Long": -113.6775,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "all anhydrous ammonia was removed from the site",
  "_processes": [
    {
      "ProcessID": 2327,
      "AltID": "refrigeration",
      "FacilityID": 2117,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2377,
          "ProcessID": 2327,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2479,
          "ProcessID": 2327,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502479,
          "ProcessID": 2327,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2117,
      "SummaryText": "\n                                                      Kraft Foods, Rupert, Idaho\n\n                                                     RISK MANAGEMENT PLAN\n\nThis document and the accompanying spreadsheet contain all required information in order to meet\n40 CFR 68 \"Risk Management Program\" including an Executive Summary and RMP data elements\n(68.155 through 68.185).  This document has been submitted to the USEPA.\n\nEXECUTIVE SUMMARY\n\n1.0     Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Rupert, Idaho has an excellent record in preventing and minimizing releases\nof anhydrous ammonia (hereafter, anhydrous ammonia will be referred to as ammonia).  This facility\nhas implemented an electronic preventive maintenance system.  This system uses a real time database\nto track preventive maintenance, training and inspection dates and issue reminders to responsible groups.\n\nThe emergency response procedures at this facility ensure emergency response coverage 24 hours a day,\n7 days per week.  There are also adequate provisions for coordination with outside agencies, such as \nwith the City of Rupert Fire Department and Idaho Emergency Services, in the event of an emergency.\n\n2.0     Process Description and Regulated Substances\n\nKraft manufactures natural cheese, cream cheese, cream, and whey protein concentrate products at the\nRupert, Idaho plant.  The North American Industrial Classification System (NAICS) code for the\nprimary process at this facility is 311513.  Kraft has one regulated substance under 40 CFR 68 at the\nRupert, Idaho plant - ammonia.  The storage and process areas of the plant are refrigerated by ammonia\nto keep the products fresh and wholesome.  Ammonia has been widely used as a refrigerant in the food\nindustry for decades.\n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds.  The quanity of \nammonia stored on-site is approximately 11,000 pounds.\n\n     Ammonia is classified as a Group 2 Refrigerant pe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2117,
      "SummaryText": "r ASHRAE Standard 34-1989.  Its distinctive\n     pungent odor is very noticeable to most people, even in small quanitiies.  Ammonia is flammable\n     in a very narrow and high range of concentration with a high ignition temperature.  It is not\n     poisonous, but it can be corrosive to human tissue.  Ammonia is readily absorbed into the moisture\n     of the skin and, at high temperatures, can cause burns.  The potential risks to people exposed to\n     an accidental ammonia release include irritation of respiratory tract, burning of skin and other tissue\n     when contacted by ammonia vapor, and freezing of skin and other body tissue when contacted by\n     liquid ammonia.\n\n3.0    Worst-Case and Alternative Release Scenarios     \n\n    Although there are quality and safety systems in place at Kraft's Rupert plant, a release from the\n    ammonia refrigeration system could potentially affect employees on-site and the general public offsite.\n    USEPA requires companies to use models for \"worse case\" and \"alternate\" release scenarios for each\n    regulated chemical.  Given the safety precautions at the plant, both scenarios are unlikely to occur.  If a\n    release occurred, however, the alternate scenario would be more likely.\n\n   The ammonia release scenario was modeled using BREEZE HAZ DEGRADIS+ to obtain the distance to \n   the ERPG-2 endpoint.  The Emergency Response Planning Guide, Level 2, ERPG-2, was developed by\n   the American Industrial Hygiene Association.  It refers to the level of ammonia that individuals could be\n   exposed to for up to one hour without being subjected to irreversible or other serious health effects\n   that could make it difficult to leave the affected area.\n\n4.0  General Accident Release Prevention Program and Chemical-Specific Prevention Steps\n\n   This facility has developed an OSHA PSM program for their ammonia refrigeration system.  Ammonia\n   falls under the RMP Program 3 prevention program, which is identical to the OSHA PSM program.\n "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2117,
      "SummaryText": "  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with\n   RMP Program 3.  Kraft's ammonia PSM program has been reviewed and determined to be complete\n   for the RMP document.\n\n   There are several aspects of the prevention program that are key:\n\n        1.  Utility personnel are present on site and assigned to the ammonia system, 24 hours a day,\n             7 days a week, all year round.\n\n       2.  Most ammonia pipe work is located away from employee traffic patterns and machinery to\n            minimize the chance of an ammonia release.\n\n       3.  There is an annual table top exercise for emergency response to ammonia conducted with\n            the Rupert Fire Department.\n\n       4.  About 80 % of the entire ammonia system has been upgraded within the last 36 months to\n            further improve the safety and efficiency of the plant.\n\n5.0     Five-Year Accident History\n\nA review of this facility's accident history since June 22, 1994 was performed.  To date, there has been\nno accidental spills or releases of ammonia at the facility as defined by 40 CFR Part 68.42(a).\n\n6.0     Emergency Response Program\n\nAs mentioned earlier, this facility has developed an emergency response program in which plant\nemployees are divided into various management and response teams.The emergency response\nplan includes information about the frequency of employee emergency response training as well as a\ndetailed description of the training content.  There are specific procedures to follow in the event of a\nfire or ammonia emergency.  The emergency response plan includes but is not limited to, steps to address\nthe following topics:\n\n  a.  accidental discharge of hazardous substances and hazardous waste into the environment\n  b.  the measures to be taken to prevent an accident\n  c.  countermeasures to be taken in the event of an emergency, and:\n  d.  procedures for containing and limiting the duration of the emergency;  measures to be employed "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2117,
      "SummaryText": "for\n       further protection of employees responding to the emergency, as well as other plant personnel\n\nAt the discretion of the Incident Commander, the Rupert City Fire Department will be called to provide\nbackup emergency responders and equipment.  The Rupert City Fire Department will be called for all fire\nrelated emergencies.  In all cases where the Rupert City Fire Department is called, an ambulance will\nalso be called to the scene.\n\nOur comprehensive emergency response plan is designed to protect our employees, environment and the\ncommunity and, among other things, requires that:\n\n  a.  All nonessential personnel immediately exit the area affected by the release;\n  b.  Kraft immediately notify local officials, requesting their assistance, if necessary;\n\nFor a release which leaves the Kraft site, the company would work with local officials to notify neighbors\nso that appropriate safety precautions could be taken.  If ammonia is in the outside atmosphere, the\nsafest place to be is indoors with windows and doors shut and the ventilation system turned off."
    }
  ]
}