{
  "FacilityID": 21228,
  "FacilityName": "Jay-Mar, Inc.",
  "FacilityStr1": "3000 Walnut",
  "FacilityStr2": null,
  "FacilityCity": "Plover",
  "FacilityState": "WI",
  "FacilityZipCode": "54467",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55097",
  "LEPC": "Portage County LEPC",
  "FacilityLatDecDegs": "44.457889",
  "FacilityLongDecDegs": "-89.548917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "jaymar@coredcs.com",
  "FacilityDUNS": 51892735,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dave Warner",
  "OperatorStr1": "P.O. Box 429",
  "OperatorStr2": null,
  "OperatorCity": "Plover",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54467",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Grapsas",
  "RMPTitle": "Sales",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169202",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-05-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-05-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-14 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-14 00:00:00",
  "AnniversaryDate": "2005-05-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 44.45789,
  "FRS_Long": -89.54892,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 29848,
      "AltID": "Ammonia Process",
      "FacilityID": 21228,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30612,
          "ProcessID": 29848,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 38779,
          "ProcessID": 29848,
          "ChemicalID": 57,
          "Quantity": 48100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 538779,
          "ProcessID": 29848,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21228,
      "SummaryText": "Jay-Mar, Inc. is an independent, family-owned company whose primary business is the sale of dry and liquid fertilizers, farm seed, crop protection products and packaging materials for the farmers of central Wisconsin.  Jay-Mar is also a manufacturer (mixing only) of liquid fertilizers for agricultural and turf applications.\n\nJay-Mar, Inc. has developed and trained written emergency response procedures in the event of an accidental release from any of our processes.  These written plans have been provided to the local emergency response agencies including local emergency response personnel, hospitals, and state agencies. A review of the previous five year accident history indicates no releases of a regulated material.\n\nJay-Mar, Inc. uses one chemical regulated by the Environmental Protection Agency Clean Air Act 112(r) Risk Management Program.  This chemical is aqueous ammonia (20% concentration or greater) also known as aqua ammonia.  The on-site storage capacity is 6,500 gallons of aqua ammonia in a bulk storage tank.  This storage tank is located inside our 10,000 square foot building which has a 4\" containment wall around the perimeter plus a 21'x 20' x 7' containment pit.  Aqua ammonia is received via tank trucks and unloaded into the storage tank.  All containers meet DOT specifications.  All storage and ancillary equipment is designed to comply with National Standards including the American Society of Mechanical Engineers (ASME), the Fertilizer Institute, and the National Fire Protection Association (NFPA).\n\nJay-Mar, Inc. has multiple release prevention programs integrated into all phases of operation from design through maintenance.  Each chemical is reviewed for physical hazards, health hazards, environmental hazards and process hazards.  All processes that are subject to the EPA RMP program  undergo a Process Hazard Analysis (PHA).  Written operating procedures have been developed and are reviewed on a regular basis.  Employee training procedures have been "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21228,
      "SummaryText": "developed and are implemented ensuring the employees understand the hazards of the chemical, know how to operate the equipment, know how to shut down the process and how to respond to a release.  Pre-start up safety reviews will be performed prior to operation of new equipment or receipt of new chemicals.  Equipment maintenance procedures have been developed and implemented, including routine inspections and scheduled maintenance.  Jay-Mar, Inc. believes that every incident has the potential for serious impact and will conduct Incident Investigations to determine root cause and corrective action for all releases.\n\nWorst case scenario for aqua ammonia is based on the total loss of the maximum quantity stored in the largest vessel.  Release is assumed to occur instantaneously with the material forming a pool covering the floor area of 10,000 square feet, plus the 21'x 20' x 7' containment pit.  Weather conditions used were as defined by EPA in the Offsite Consequence Analysis Guidance.  Active mitigation is not considered in the worst case scenario, however passive mitigation is accounted for with the release occurring within the building.  Jay-Mar, Inc. has elected to use the RMP*Comp modeling software.\n\nThe alternate release scenario is based on an event that can reasonably be expected to occur.  The scenario used for aqua ammonia assumes a pipe failure which would release 374 pounds per minute from a 2\" hose, into the building.  With an emergency response time to reach the shutoff valves of 10 minutes, a release of 500 gallons into the diked building would occur.  Weather conditions used were as specified in the EPA Offsite Consequence analysis Guidance.  Again, modeling was conducted using RMP*Comp.\n\nJay-Mar, Inc. has developed and maintains an Emergency Response Plan (Contingency Plan).   This Plan is integrated into the Local Emergency Planning Committees' (LEPC's) county wide plan.  The Plan is reviewed and updated as required.  Emergency Responders receive for"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21228,
      "SummaryText": "mal training on the Plan annually.  The Plan includes:\n\n? Actions facility personnel must take in the event of fire, explosion or  release\n\n? Arrangements with the local and state governments in the event of an accident\n\n? Names, addresses and telephone numbers of all emergency responders\n\n? Necessary emergency equipment and how it is to be implemented\n\n? Resources available at the plant for use in responding such as\n     chemical resistant suits, \n     self-contained breathing apparatus, \n     two way radios for communication, \n\nJay-Mar, Inc. is strongly committed to employee and public safety and environmental responsibility and continually works to improve processes."
    }
  ]
}