{
  "FacilityID": 21276,
  "FacilityName": "Tri Valley Growers, Plant 4",
  "FacilityStr1": "3200 E. Eight Mile Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Stockton",
  "FacilityState": "CA",
  "FacilityZipCode": "95212",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": null,
  "FacilityLatDecDegs": "38.057417",
  "FacilityLongDecDegs": "-121.273389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9126079,
  "ParentCompanyName": "Tri Valley Growers",
  "Company2Name": null,
  "CompanyDUNS": 9126079,
  "Company2DUNS": 0,
  "OperatorName": "Tri Valley Growers",
  "OperatorStr1": "3200 E. Eight Mile Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Stockton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95212",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Hancock",
  "RMPTitle": "Production Manager",
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169373",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-01-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-05-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-05-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-05-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-12-16 00:00:00",
  "DeRegistrationEffectiveDate": "2002-12-31 00:00:00",
  "AnniversaryDate": "2005-05-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.4",
  "FRS_Lat": 38.05762,
  "FRS_Long": -121.27538,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 29968,
      "AltID": "Cherry Brinning",
      "FacilityID": 21276,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30736,
          "ProcessID": 29968,
          "NAICSCode": "311421",
          "_desc": {
            "NAICS_CODE": "311421",
            "NAICS_DESCRIPTION": "Fruit and Vegetable Canning"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 38943,
          "ProcessID": 29968,
          "ChemicalID": 49,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 538943,
          "ProcessID": 29968,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21276,
      "SummaryText": "1.0    Executive Summary\nThis Executive Summary includes a brief summary of the following elements of the Risk Management Plan (RMP) prepared by Tri-Valley Growers (TVG) for Plant 4 located at 3200 E. Eight-Mile Road, Stockton, California:\n? Accidental release prevention and emergency response policies\n? Stationary source and regulated substance handling\n? Worst-case scenarios and alternative release scenarios including administrative controls and mitigation measures\n? General accidental release prevention program and chemical-specific prevention steps\n? Five-year accident history\n? Emergency response program\n? Planned changes to improve safety\n1.1    Accidental Release Prevention and Emergency Response Policies\nTri-Valley Growers Plant 4 has the following policies in place to prevent or minimize accidental releases and to respond to emergencies:\n? Designation of a hazard response team including emergency contacts \n? A Hazardous Materials Business Plan and Inventory that describes the facility, emergency contacts, emergency procedures, spill response, evacuation procedures, waste disposal, decontamination procedures, hazardous materials safety and training program and reporting requirements. \n? Step-by-step procedures for the following activities involving sulfur dioxide (brine making):\n- Cylinder loading and unloading\n- Cylinder change-out\n- Cylinder valve operation\n- Cylinder disconnection\n- Emergency operation and shut-down\n? All employees involved in receiving, handling, operation or maintenance of sulfur dioxide receive initial and annual refresher training.  The training consists of viewing a video from the supplier and discussing safe cylinder handling procedures.  \n? Contractors who work on or near a process that presents known potential fire, explosive, toxic release or other hazard are informed of such hazards and are required to train their employees to work safely at the facility.  Contractors are required to perform all work in accordance with TVG policy and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21276,
      "SummaryText": "Cal-OSHA Process Safety Regulation regulations.  Contractors are required to complete a Qualification Questionnaire prior to performing work at TVG.\n? Lock out/tag out and Hot Work policies and procedures.\n? Accident Investigation procedures and documentation.\n1.2    Stationary Source and Regulated Substances\nPlant 4 processes tomato-based products and cherries.  Plant 4 handles the following substance that is subject to the RMP requirements:\nSubstance    Use    Maximum Quantity Onsite\nSulfur dioxide    Brine processing    14,000 pounds\nSulfur dioxide gas is received in 2,000 lb. cylinders, with a maximum inventory of 7 cylinders.  A cylinder is placed on a scale-type rack for dispensing through a hose into a batch tank where it is mixed with lime, calcium chloride and water to make cherry brine solution.  Sulfur dioxide represents approximately 1% of the solution once it is added to the other ingredients in that tank.\nOnce in batch form, the ingredients levels are tested by titration prior to release into the processing system.  Sulfur dioxide ceases to be an acutely hazardous material upon its introduction into the batch tank.  The RMP is therefore restricted to the portion of the process up to the batch tank.\n1.3    Worst-Case Release Scenarios / Alternative Release Scenarios and Administrative Controls and Mitigation Measures\n1.3.1    Worst-Case Release Scenarios\nThe Worst-Case Release Scenario originally developed in the Risk Management Prevention Program in 1995 was re-evaluated and is used in this RMP.  The release is through a ?\" diameter valve orifice resulting in a 2,000 lb. release, 10-minute duration, 1.5 meters per second wind speed, and F stability class.  Use of the look-up tables provided in the USEPA Guidance Document for the worst-case scenario assuming a rural environment, indicate a toxic endpoint distance of 3.1 miles.  Based on the ALOHA model, the sulfur dioxide release resulted in off-site consequences.\n1.3.2    Alternative Release Scenarios and Administrative Contr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21276,
      "SummaryText": "ols and Mitigation Measures\nIn the implementation of the PSM for this facility, TVG has performed \"What If\" analyses using the ARCHIE air dispersion model and evaluated the following scenarios:\n? Human error\n? Vandalism/sabotage\n? Mechanical / electrical failure\n? Physical damage\n? Natural disaster\n? Fire / explosion.\nAdditionally, as part of this RMP TVG performed a \"What If\" Analysis to identify an Alternative Release Scenario (ARS).  The ARS is the release of sulfur dioxide at a leaky hose coupling with a 1/16 inch orifice.  The quantities of sulfur dioxide associated with this ARS  extend beyond the property boundaries given the ARS meteorological conditions recommended in the USEPA Model Risk Management Program and Plan for sulfur dioxide. \n1.4    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nPlant 4 is in compliance with the OSHA PSM and RMP rules.  Specific steps that are key to the TVG prevention program include:\n? Developing and maintaining written Process Safety Information identifying workplace chemical and process hazards, equipment used in the process, and technology used in the processes.\n? Developing and maintaining Process Hazard Analysis used to identify potential failure scenarios and conditions of the process and facility that could result in the release of sulfur dioxide.\n? Developing and maintaining Operating Procedures that are specifically designed to address the handling and maintenance of materials and equipment associated with direct or indirect use of sulfur dioxide.\n? Providing and maintaining Training Programs that are specifically designed to address all operations, maintenance, and emergency aspects of processes associated with the sulfur dioxide systems.\n? Developing and maintaining a program that ensures the Mechanical Integrity of equipment associated with the sulfur dioxide systems.\n? Establishing and maintaining a Management of Change program to address any equipment or process changes associate"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21276,
      "SummaryText": "d with the sulfur dioxide systems. \n? Developing and maintaining a Pre-Startup Safety Review of equipment and process associated with the sulfur dioxide systems.\n? Establishing an on-going Audit component of the RMP that ensures periodic re-evaluation of TVG's prevention program elements.   \n? Developing and maintaining an Accident Investigation program that addresses all types of incidents (e.g., actual releases, fires, near occurrences, etc.) in a timely manner in an effort to prevent the reoccurrence of such incidents. \n? Ensuring that there is Employee Participation at all levels of the organization (e.g., operators, supervisors, etc.). \n? Developing and maintaining a Hot Work Permit system to address any hot work that may directly or indirectly affect the sulfur dioxide system.  \n? Ensuring that Contractors working on or near the process are aware or the hazards associated with the sulfur dioxide system.\n? Maintaining an Emergency Response capability that can address small quantity releases of sulfur dioxide and extinguish incipient fires. \n? Establishing and maintaining a comprehensive Injury and Illness Prevention Program in accordance with State of California OSHA regulations. \n1.5    Five-year Accident History \nPlant 4 has not had an incident involving acutely hazardous materials within the last five years.  \n1.6    Emergency Response Program \nPlant 4 has an Emergency Response Plan that addresses:\n? Hazard response team and responsibilities including contact names and phone numbers\n? Local and regional emergency contacts and numbers including governmental agencies \n? Evacuation plan\n? Response procedures for spills, fire and medical emergency\n? Identification of spill / clean-up contractors\n? Emergency Release Reporting Form\n1.7    Planned Changes to Improve Safety\nBased on the hazard analysis conducted, there are plans to do the following:\n? Provide additional operator training that is specific to SO2.\n? Enforce speed limit around SO2 tank storage areas.\n? Daily ch"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21276,
      "SummaryText": "ecks of system will occur to ensure that all piping and equipment is in proper working order."
    }
  ]
}