{
  "FacilityID": 21307,
  "FacilityName": "City of Frederick Wastewater Treatment Plant",
  "FacilityStr1": "8145 Gas House Pike",
  "FacilityStr2": null,
  "FacilityCity": "Frederick",
  "FacilityState": "MD",
  "FacilityZipCode": "21701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24021",
  "LEPC": "Fred County Ofc of Pub Safety",
  "FacilityLatDecDegs": "39.426389",
  "FacilityLongDecDegs": "-77.383333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cityof frederick.com",
  "FacilityEmailAddress": "scosner@cityoffrederick.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Frederick, MD",
  "Company2Name": null,
  "CompanyDUNS": 74927054,
  "Company2DUNS": 74927054,
  "OperatorName": "City of Frederick",
  "OperatorStr1": "101 North Court",
  "OperatorStr2": null,
  "OperatorCity": "Frederick",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21701",
  "OperatorZipCodeExt": null,
  "RMPContact": "Stona Cosner",
  "RMPTitle": "Superintendent of WWTP",
  "FTE": 19,
  "OtherEPAFacilityID": "NPDES MD0021610",
  "EPAFacilityID": "100000120068",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-11 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-05-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-05-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-05-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-07-25 00:00:00",
  "DeRegistrationEffectiveDate": "2017-07-20 00:00:00",
  "AnniversaryDate": "2005-05-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.42667,
  "FRS_Long": -77.38167,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30008,
      "AltID": "Wastewater Treatment",
      "FacilityID": 21307,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 30776,
          "ProcessID": 30008,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 38999,
          "ProcessID": 30008,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 39000,
          "ProcessID": 30008,
          "ChemicalID": 49,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 538999,
          "ProcessID": 30008,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 539000,
          "ProcessID": 30008,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21307,
      "SummaryText": "The Department of Public Works for the City of Frederick, Maryland operates a wastewater treatment plant (WWTP) in the southeastern area of the city.  Wastewater from the City and nearby Walkersville, Maryland is received and treated at the facility.  The Walkersville, Maryland wastewater is treated with a minimal amount of chlorine and subsequently directed to the wastewater treatment plant for Frederick County (Ballenger Creek WWTP).  The City wastewater is treated through a series of settling basins, clarifiers, chemical treatment, and a sand filter before being discharged to the Monocacy River.  Based on an assessment of the chlorine and sulfur dioxide systems used at the facility (chlorine storage greater than 2,500 pounds and sulfur dioxide storage greater than 5,000 pounds), the WWTP is required under Title 40 of the Code of Federal Regulations (CFR) Part 68 and the United States Environmental Protection Agency (USEPA) to develop and implement a Risk Management Plan (RMPlan).  The chlorine treatment system consists of ten (10) 1-ton cylinders (five in use, five as backup).  Similarly, the sulfur dioxide treatment system consists of ten (10) 1-ton cylinders (five in use, five as backup).  The City operates the chemical treatment systems in accordance with standard industry practices and monitors the performance of each system on a regular basis.  The safety of all WWTP operations are continually reviewed and improved through an internal safety committee that meets monthly.  It is the policy of the City of Frederick to adhere to all applicable federal, state, and local laws.\n\nUSEPA's RMPlan provisions are intended to have facilities 1) prepare for and prevent the potential for a catastrophic release or explosion and 2) coordinate emergency response activities both internally and externally with local emergency planning officials.  The likelihood of the worst-case release described in this plan is very low at the City WWTP.  However, should such an event occur, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21307,
      "SummaryText": "the City WWTP will follow the contents of this plan in response to the emergency or potential emergency.  \n\nUnder 40 CFR 68, facilities are required to comply with the RMPlan requirements by June 21, 1999.  Compliance with this rule includes an electronic submittal to USEPA of required data elements using EPA's RMP*SubmitTM Software.  The RMPlan and the data elements required in the submittal were developed based on USEPA's guidance documents including: General Risk Management Program Guidance (July 1998);  RMP Off-Site Consequence Analysis Guidance (May 24, 1996); and Risk Management Program Guidance for Wastewater Treatment Plants (October 1998). \n\nAfter determining that the chlorine and sulfur dioxide treatment systems were applicable processes, the City WWTP performed a program applicability assessment to determine the specific RMP requirements for the chemical treatment systems.  This assessment is dependent on the following four factors.\n \n(1) Five-Year Accident History: The chlorine and sulfur dioxide systems have never had an accidental release since they were installed in 1985.\n(2) Worst-Case Release Consequence Analysis:  The worst-case release for both the chlorine and sulfur dioxide systems is estimated to be 10,000 pounds based on a failure of five 1-ton cylinders.  Based on the Slab Dense Gas Dispersion Model, the distance to the maximum allowable concentration [3 parts per million (ppm)] for chlorine and sulfur dioxide is estimated to be about 10.50 and 11.19 miles respectively.  Such a release would affect a variety of offsite public receptors including schools, a hospital, a correction facility, residences, recreation areas, and major commercial areas (i.e., the airport).  Because the facility is located within the city limits, the residential population within the 1.3 mile distance was estimated to be 3,700.  Consequently, the treatment system is not applicable to Program 1 of the RMP regulations.\n(3) SIC Code of the Facility: The facility's SIC Co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21307,
      "SummaryText": "de is 4952, sewerage systems.\n(4) Applicability of OSHA Process Safety Management (PSM) Regulations:  The treatment process is subject to the OSHA PSM standard outlined in 29 CFR 1910.119.  Since the worst case analysis identified impacted offsite public receptors and the facility is subject to OSHA's PSM regulations, the treatment processes are subject to Risk Management Program 3.\n\nAs required by the regulations, the facility also performed an alternative-case release consequence analysis for a more realistic (yet still unlikely) release scenario.  Under this scenario, the facility assumed that an accidental gaseous chlorine or sulfur dioxide release would originate from a damaged pipe.  Based on the anticipated reaction of WWTP personnel, a conservative estimate of fifteen pounds of chlorine or sulfur dioxide would be released.  Using this release scenario along with the USEPA's consequence analysis guidance, the City of Frederick estimates the distance to the maximum allowable concentration (3 ppm) for both chlorine and sulfur dioxide is less than 0.1 miles.  Given this distance, the release would affect a public golf course and an airport but no residential populations.\n\nThe City of Frederick has also ensured that the facility is in compliance with the elements required under Prevention Program 3.  These requirements include implementing an emergency management system, maintaining pertinent safety information, conducting necessary hazard reviews, implementing appropriate operating procedures, providing necessary employee and contractor training, conducting routine preventive maintenance activities, and performing compliance audits.  \n\nIf there is an accidental release from either of the two treatment systems, the City WWTP will initiate the Emergency Response Plan and notify the local emergency planning committee (Frederick County Emergency Services Division)."
    }
  ]
}