{
  "FacilityID": 21501,
  "FacilityName": "Gas Supply Resources, Inc. - Auburn Terminal",
  "FacilityStr1": "47 Kittyhawk Drive",
  "FacilityStr2": null,
  "FacilityCity": "Auburn",
  "FacilityState": "ME",
  "FacilityZipCode": "04210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23001",
  "LEPC": null,
  "FacilityLatDecDegs": "44.046611",
  "FacilityLongDecDegs": "-70.296417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 24196342,
  "ParentCompanyName": "Gas Supply Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 931088900,
  "Company2DUNS": 0,
  "OperatorName": "Kenneth Allen",
  "OperatorStr1": "47 Kittyhawk Drive",
  "OperatorStr2": null,
  "OperatorCity": "Auburn",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04210",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kenneth Allen",
  "RMPTitle": "Terminal Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170496",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-06-19 00:00:00",
  "ErrorReportDate": "2000-06-19 00:00:00",
  "ReceiptDate": "2000-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-06-11 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 44.04661,
  "FRS_Long": -70.29642,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30356,
      "AltID": "Proane Storage",
      "FacilityID": 21501,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31125,
          "ProcessID": 30356,
          "NAICSCode": "42271",
          "_desc": {
            "NAICS_CODE": "42271",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 39472,
          "ProcessID": 30356,
          "ChemicalID": 98,
          "Quantity": 443520.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 539472,
          "ProcessID": 30356,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21501,
      "SummaryText": "\nGENERAL EXECUTIVE SUMMARY FOR PROPANE STORAGE DISTRIBUTION FACILITY\nGas Supply Resources, Inc. - Auburn Terminal\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nThe primary function of Gas Supply Resources, Inc. - Auburn Terminal is to act as a propane distribution \nfacility.  By virtue of the flammable effect associated with propane, it is necessary to observe certain \nsafety precautions in handling propane to prevent unnecessary human exposure, to reduce the threat to \nour own personal health as well as the health of our co-workers, and to reduce the threat to nearby \nmembers of the community.  We are strongly committed to employee, public, and environmental safety.  \nSafety at our facility depends upon the manner in which we handle propane as well as on the various \nsafety devices incorporated into the design of our equipment.  Furthermore, comprehensive training \nreceived by our employees adds to the  safety of our distribution facility.\nOur emergency response program is based upon the NPGA's LP-Gas Safety Handbook/Guidelines for \nDeveloping Plant Emergency Procedures/How to Control LP-Gas Leaks and Fires.  In addition to the \npresence of appropriate controls to prevent possible releases of propane, if a release does occur, we are \ncompletely coordinated with the Auburn Fire Department, which provides highly trained emergency \nresponse personnel to control and mitigate the effects of the release.\n\n2.  The Stationary Source and The Regulated Substance Handled:\n\nThe primary purpose of this facility is to repackage and distribute propane to wholesale customers for use \nas a fuel.  Propane arrives at our facility via rail car and is stored in two (2) storage tanks.  This facility has \nequipment for unloading rail cars and transports and for loading transports.  Access to this site is \nrestricted to authorized facility employees, authorized management personnel, and authorized contractors.\nThe regulated substance handled at this facility is prop"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21501,
      "SummaryText": "ane.  The maximum amount of propane that can be \nstored at this facility is 443,520 lbs.\n\n3.  The Flammable Worst Case Release Scenario and the Alternative Release Scenario, Including \nAdministrative Controls and Mitigation Measures to Limit the Distance for Each Reported Scenario:\n\nWe have calculated the worst case release scenario based on EPA's RMP Com (TM) method.  The alternative release scenario analysis is based on EPA's RMP Com (TM) method.  The following paragraphs provide details of the chosen scenarios.\nThe worst case release scenario submitted for propane involves a catastrophic release from the storage \ntanks.  The scenario involves the release of 443,520 lbs. of propane.  The release quantity has been \ncalculated with a wind speed of 1.5 meters/second, stability class: F and an air temperature of 25 degrees \n\nC.,  The estimated distance to 1 psi overpressure is .60 miles.\n\nThe alternative release scenario involves a release from the rail tower header piping resulting in a vapor \ncloud fire.  In this scenario 1,995 lbs. of propane is released in one minute.  This release is also controlled \nby active mitigation measures that include monitor fire nozzles, emergency shutdown valves, and manual \nvalves.  With a wind speed of 3 meters/second, stability Class: D and an air temperature of 25 degrees \nC.  the estimated distance to lower flammability limit is .10 miles.\n\n4.  The General Accidental Release Prevention Program and The Chemical-Specific Prevention Steps:\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention \nrequirements  set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in \naccordance with NFPA-58 Standard, 1995 Edition and NFPA-70, 1993 Edition.\nThe following sections briefly describe the release prevention program that is in place at our stationary \nsources.\n\nSafety Information:\n\nGas Supply Resources, Inc. - Auburn Terminal maintains a detailed record of written safety"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21501,
      "SummaryText": " information, \nwhich describes the chemical hazards, operating parameters and equipment designs associated with all \naspects of our distribution facility.\n\n\nHazard Review:\n\nA visual inspection methodology is used to carry out hazard reviews at our facility.  The reviews focus on \noperating procedures, equipment functions, and handling practices to identify possible hazards.  Any \nfinding related to the hazard reviews are addressed in a safe and timely manner.\n\nOperating Procedures:\n\nFor the purposes of conducting safety  activities within our covered processes, Gas Supply Resources, \nInc. - Auburn Terminal maintains written operating procedures.  These procedures address various modes \nof operation such as emergency shutdown system/ startup procedures, pre-operational visual inspection \nprocedures, rail car unloading procedures, transport loading procedures, transport unloading procedures, \nand emergency shutdown system/ shutdown procedures.  The information is regularly reviewed and \nreadily accessible to operators involved with the processes.\n\nTraining:\n\nGas Supply Resources, Inc. - Auburn Terminal has a comprehensive training program in place to ensure \nthat employees are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently and have passed a written proficiency test.  Refresher training is provided yearly.\n\nMaintenance:\n\nGas Supply Resources, Inc. - Auburn Terminal carries out documented maintenance checks on process \nequipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with \nprevious training in these practices.  Furthermore, personnel are offered specialized training as needed.  \nAny equipment deficiencies identified by the maintenance checks are corrected in a safe and timely \nmanner.   \n\nCompliance Audits:\n\nGas Supply Resources, Inc. -"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21501,
      "SummaryText": " Auburn Terminal conducts audits on a regular basis to determine whether \nthe provisions set out under the RMP rule are being implemented.  These audits are carried out at least \nevery 3 years and any corrective action required as a result of the audits is undertaken in a safe and \nprompt manner.\n\nIncident Investigation:\n\nGas Supply Resources, Inc. - Auburn Terminal promptly investigates any incident that has resulted in, or \ncould reasonably result in, a catastrophic release of propane.  These investigations are undertaken to \nidentify the situation leading to the incident as well as any corrective actions to prevent the release from \nrecurring.  All reports are retained for a minimum of 5 years.\n\n5.  Five-year Accident History:\n\nGas Supply Resources, Inc. - Auburn Terminal has had an excellent record of preventing accidental \nreleases over the last four years (the facility was constructed in 1996).  Due to our stringent release \nprevention policies, there has been no accidental release during this period.\n\n6.  Emergency Response Plan:\n\nGas Supply Resources, Inc. - Auburn Terminal has a written emergency response plan to deal with \naccidental release of propane.  The plan includes all aspects of emergency response including \nevacuations and notification of local emergency response agencies.\nOur facility's emergency response plan is based upon the MPGA's LP-Gas Handbook/Guidelines for \nDeveloping Plant Emergency Response Procedures/How to Control LP-Gas Leaks and Fires.\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In \naddition, the plan is promptly updated to reflect any pertinent changes taking place within our processes \nthat would require a modified emergency response.\n\n7.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted in the implementation of the various elements of our \naccidental release prevention program.  Continued operator training, employee CTEP certification, an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21501,
      "SummaryText": "d \noperational reviews are some of the major steps we want to take to improve safety at our facility.  These \nchanges shall be implemented on an ongoing basis.\n\n8.  Certification Statement:\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after \nreasonable inquiry, the information submitted is true, accurate and complete.\n\nName:  James L. Peschong\nSignature:\nTitle: Director of Engineering Services\nDate Signed: June 9, 2000"
    }
  ]
}