{
  "FacilityID": 21538,
  "FacilityName": "Pittsburg Water Treatment Plant",
  "FacilityStr1": "300 Olympic Drive",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.008333",
  "FacilityLongDecDegs": "-121.902778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "UN",
  "FacilityURL": "http//www.ci.pittsburg.ca.us",
  "FacilityEmailAddress": "waterplant@ci.pittsburg.ca.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Pittsburg, California",
  "Company2Name": null,
  "CompanyDUNS": 179275128,
  "Company2DUNS": 0,
  "OperatorName": "John Fuller",
  "OperatorStr1": "65 Civic Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170717",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.00752,
  "FRS_Long": -121.90253,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30413,
      "AltID": "Water Purification",
      "FacilityID": 21538,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 39566,
          "ProcessID": 30413,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31186,
          "ProcessID": 30413,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 30414,
      "AltID": "Water Purification",
      "FacilityID": 21538,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 39567,
          "ProcessID": 30414,
          "ChemicalID": 56,
          "Quantity": 4400.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31187,
          "ProcessID": 30414,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11813,
              "Process_NAICS_ID": 31187,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "CalARP",
              "FR_Comments": null,
              "HazardReviewDate": "1995-01-09 00:00:00",
              "ChangeCompletionDate": "2000-09-29 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Up-date incident investigation procedures",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Demonstration & exercise",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Leak detection equipment (chlorine), PPE (self-contained breathing equipment), emergency communication systems, and chlorine release patching equipment.",
              "ComplianceAuditDate": "1995-01-09 00:00:00",
              "AuditCompletionDate": "2000-09-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1995-01-09 00:00:00",
              "CBI_Flag": 0,
              "Description": "This section applies to the prevention program for both chlorine and anhydrous ammonia release risks.  The chlorine process unit utilizes a containment structure with automatic scrubbers to control a chlorine release.  In the case of ammonia release risks the plant utilizes spill containment and monitored off-loading to prevent releases and mitigate the potential for both on-site and off-site consequences.",
              "_chemicals": [
                {
                  "PrimaryKey": 12368,
                  "PreventionProgram2ID": 11813,
                  "ProcessChemicalID": 39567
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21538,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-06-01 00:00:00",
    "CoordinatingAgencyName": "Contra Costa County Environ. Health",
    "CoordinatingAgencyPhone": "9256462286",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21538,
      "SummaryText": "EXECUTIVE SUMMARY\nThe Accidental Release Prevention and Emergency Response Policies at\nPittsburg Water Treatment Plant\n\nThe Pittsburg Water Treatment Plant (the \"Plant\") is owned by the City of Pittsburg (the \"City\")\nand is located at 300 Olympia Drive. It operates as a division of its Public Services Department.\nThe City is committed to providing needed services to local residents, businesses and visitors to\nPittsburg, and to being a positive influence on the community. This includes respect for the\nsafety of city workers and the public, as well as concern for the environment. \n\nThe City of Pittsburg values its employees' efforts to find safer, more effective and more\nefficient ways of providing service to the community. Regular safety meetings are held, and\nemployees are encouraged to look for ways to reduce the risk to the community and environment\nthrough implementation of new technology and procedures. This commitment to safe and\nenvironmentally sound operations is documented in the policy and compliance manuals, and the\nmission statement, which are available to all employees. \n\nA copy of the Plant's Accidental Release Prevention Program policy is included as Figure 1-1. \nThe plant also trains and requires all employees to be familiar with the Operations Plan and Plant\nOperations Manual kept on site. This Manual includes all operational procedures, from normal\noperation to emergency and non-emergency plant shut-downs. A HAZOP Study was completed\nin January 1995, regarding the use and handling of chlorine and ammonia at the Plant. This study\ncomplies with OSHA rule 1910.119, \"Process Safety Management of Highly Hazardous\nChemicals.\" A copy is kept at reference library at the Plant. A Risk Management and Prevention\nProgram developed by EQE International was also adopted for the facility in 1995.\n\nStationary source safety and environmental programs include the following:\nweekly tailgate talks with all plant staff present; semi-annual Safety Meetings, periodic Self"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21538,
      "SummaryText": "-\nContained Breathing Apparatus (SCBA) training, including refresher courses for all staff at the\npoint a new employee is hired; instruction on handling of chemicals and the use or Personal\nProtective Equipment (PPE). \n\nIn addition to the above, all new employees receive orientation and a copy of the City's Hazard\nCommunications Policy, including instruction on how to read and understand MSDS sheets\nposted at the Water Plant, and the City's Injury & Illness Prevention Plan. \n\nIn addition, there are regularly scheduled, and unscheduled, safety inspections of all city facilities\nby the Public Services Department Safety Committee, which operates in conjunction with the\nCity of Pittsburg Safety Committee. The latter group involves itself in generalized safety\nconcerns across all city departments, while the Public Services committee specializes in\nmaintenance and operations functions of the department.\n\nSafety inspections by Public Services Department personnel occur most often at the Water\nTreatment Plant, as this has been determined to be a safety-sensitive area. Recommendations\nresulting from these inspections are given to the Safety Committee and to the Plant\nSuperintendent for review and appropriate action. \n\nA Description of the Pittsburg Water Treatment Plant and the regulated\nsubstances handled\nDescription of Stationary Source\n\nAs stated previously, the Pittsburg Water Treatment Plant is located at 300 Olympia Drive in\nPittsburg, approximately three miles south of Suisun Bay and one mile south of State Highway 4.\nThe facility occupies an area of approximately 15 acres.\n\nThe plant operates as a division of the Public Services Department of the City of Pittsburg. As a\nmunicipal facility, the plant is staffed 24 hours each day by public employees who meet or\nexceed training and certification requirements for Water Treatment Plant operators or\ntechnicians. Construction contractors and consultants are hired on occasion to complete those\nprojects deemed to be outside t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21538,
      "SummaryText": "he normal operations and maintenance of the plant.  \n\nHomes border the plant property to the north, east and south. To the west is a strip of\nundeveloped land, beyond which lies Delta View Golf Course and Stoneman Park. \n\nThe nearest residences are approximately 350 feet away from chlorine and ammonia handling\nareas. They are a constant reminder of the need to give top priority to operating in a safe and\nenvironmentally sound manner. Information on the location of sensitive receptors in relation to\nthe facility can be found in the Off-Site Consequence Analysis included in this document.\n\nThe Pittsburg Water Treatment Plant began operation in 1953, with a rated capacity of 8 million\ngallons per day, for the treatment and disinfection of raw water. The facility underwent\nmodernization and upgrades in 1976-77, which increased the rated capacity to 16 million gallons\nper day. In 1988-90, the facility was modernized and upgraded once more, and the capacity of the\nplant reached its current level of 32 million gallons per day. In 1998-99, the plant replaced its on-\nsite 6 million gallon reservoir. The systems for handling chlorine and ammonia were installed\nduring the 1988-90 modernization.\nDescription of the Substances Handled\n\nChlorine is used at the Water Treatment Plant to disinfect raw water drawn from the Contra\nCosta Canal or from wells operated by the City. Elemental chlorine is a greenish-yellow gas that\ncan be readily compressed into a clear, amber-colored liquid. Chlorine is typically packaged as a\nliquefied gas under pressure in steel containers. The liquid is about 1? times as heavy as water,\nand the gas is about 2? times as heavy as air. The liquid vaporizes readily at normal atmospheric\ntemperature and pressure. Chlorine has an unmistakable irritating and pungent odor. \n\nLiquid chlorine is a skin irritant and can cause severe damage, resembling a burn, to body tissues.\nChlorine gas in low concentrations is an irritant to mucous membranes and the respiratory\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21538,
      "SummaryText": "system. Exposure to large concentrations of chlorine gas can cause significant impairment of the\nrespiratory system.  \n\nAnhydrous Ammonia is used at the Plant in combination with chlorine, to control the amount of\ntrihalomethanes (THMs) in potable water. Ammonia is a colorless gas with a very irritating odor,\nand is highly soluble in water. When ammonia is released to the atmosphere, it creates a dense,\nwhite fog because it reacts with water in the atmosphere. At normal temperatures and pressures,\nanhydrous ammonia is a gas. Pressurizing the gas in a container liquefies it. Ammonia is\ncommonly transported and stored as a liquid. At atmospheric pressure, the liquid density of\nammonia is approximately 2/3 that of water. Ammonia gas is lighter than air, so releases of vapor\nto the atmosphere will rise. \n\nAmmonia in the ambient air has an intense effect upon the mucous membranes of the eyes, nose,\nthroat and lungs. Exposure to a high concentration of ammonia can produce corrosive action on\nthese tissues, which can lead to impairment of the respiratory system. \nDescription of Plant Process - Chlorine\n\nThe chlorine system is made up of chlorine supply cylinders, piping and valves. The chlorine\ncylinders are owned and maintained by the chlorine supplier (currently All Pure Chemical\nCompany.)\n\nChlorine is supplied in 1-ton cylinders and stored in the chlorine storage room. The chlorine\ncylinders are owned and maintained by the chlorine supplier. (Note: While the current chlorine\nsupplier is All Pure Chemical Company, the contract for chlorine supply is evaluated and\nawarded on an annual basis.) Chlorine is stored in liquid form, under pressure at ambient\ntemperature. A maximum of ten chlorine cylinders (20,000 pounds) are on-site in the chlorine\nstorage room at any one time. \n\nReceipt of chlorine supply occurs only on Monday through Friday, during normal business hours.\nAdditional facility personnel are on-site at this time to respond if a release were to occur during\nthe d"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21538,
      "SummaryText": "elivery operation.\n \nChlorine cylinders are unloaded by the vendor outside the chlorine storage room. Empty\ncylinders are loaded at the same location. Truck operators are trained by the vendor and are\nresponsible for visual inspection of chlorine cylinders each time they are on the Plant site. Two\nPlant operators work together when moving chlorine cylinders, such as removing empty\ncylinders and hooking up full cylinders. \n\nThe chlorinators, located in the chemical feed room control the flow rate of chlorine to the water\ninjection locations. Water injection acts as a motive force to draw the chlorine from the\nchlorinators to the injection points. A vacuum regulator valve is located upstream of the\nchlorinators. The pressure of the chlorine transfer lines and equipment, from the vacuum regular,\nthrough the chlorinator, to the water injection points, is below atmospheric pressure. \n\nDuring operation, two chlorine cylinders are connected to the process, feeding chlorine to the\nchlorinators, and two backup cylinders are connected to the process by blocked in by closed\nsupply valves. Each on-line or backup cylinder is connected to the chlorine-piping manifold\nthrough a flexible stainless steel tubing connection, or \"pigtail.\" All chlorine cylinders are\nstrapped to their support cradles with steel chains, regardless of whether or not they are\nconnected to the process. \n\nThe pressure in the chlorine cylinders varies with the ambient temperature inside the chlorine\nstorage room. The pressure in the cylinders typically ranges from 72 psig (60 F) to 143 psig (100\nF). Field instruments in the chlorine storage room include pressure gauges installed downstream\nof the chlorine supply cylinders and upstream of the vacuum regulator, one for each pair of\nchlorine cylinders connected to the process. Weight scales are installed at each pair or chlorine\ncylinders connected to the process.  \n\nA vacuum pressure gauge and a high-pressure switch that alarms to the control console are\nlocate"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21538,
      "SummaryText": "d downstream of the chlorine vacuum regulator. Low pressure switches (PSL-601-1/2) are\ninstalled downstream of the chlorine supply cylinders and upstream of the vacuum regulator, one\nfor each pair of chlorine cylinders connected to the process. The high-and low-pressure switches\nalarm to the control console. \n\nChlorine Scrubber System\nThe chlorine storage room is fitted with a scrubber system, designed to remove chlorine from the\natmosphere in the chlorine storage room if an accidental release were to occur. The following\ndescribes the operation and design of the scrubber system:\n\nThe scrubber system operates by circulating approximately 250 gallons per minute of 15 %\nsodium hydroxide (NaOH) solution through a venturi to a NaOH storage/separator vessel with a\n2,000 gallon operating capacity. The circulation through the venturi draws the atmosphere out of\nthe chlorine storage room, through ducts that are located along the floor of the storage room, and\ncontacts the vapor (air and chlorine) from the storage room with the NaOH solution, neutralizing\nthe chlorine. \n\nTwo chlorine leak detectors are installed in the chlorine storage room. Upon detection of 1 ppm\nof chlorine in the storage room, a warning alarm will sound at the operator console in the\nOperations Building. Upon detection of 3 ppm of chlorine in the storage room, a second warning\nalarm will be sounded at the operator console, and the storage room scrubber system will be\nstarted. That is, the NaOH circulation pump will be started. The scrubber system cannot be shut\noff except by direct operator intervention. \n\nThe chlorine storage room is provided with its own HVAC system, including inlet louvers and an\nexhaust fan. The louvers are normally closed and the fan is off, except during hot ambient\nconditions, such a hot summer day. When the scrubber system is activated, the chlorine storage\nroom HVAC inlet louvers are interlocked to close and the exhaust fan is shut off. \n\nThe design of the chlorine storage room "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21538,
      "SummaryText": "scrubber system is described in the Water Treatment\nPlant Expansion Operation and Maintenance Manual, Volumes III, IV & V, Chemical\nEquipment, Electrical, Instrumentation and Controls, September 1988, Engineer: Camp, Dresser\n& McKee, Contractor: Lawson Mechanical Contractors, and is located in the Plant reference\nlibrary. The following information, included in the subject manual, was extracted from Design\nPerformance Calculations for Pittsburg WTP, Emergency Chlorine Exhaust Project, EST Job\nFile #EC89.820, dated September 28, 1989, and was provided by EST Corporation, designer of\nthe scrubber system:\n\n     \"The 14\" Emergency Chlorine Scrubber/Separator Package is designed to handle a slow\n     leak of 2,000 lb. over a two-hour period into a 9500 cu. ft. room. The system will lower\n     the concentration to 1 ppm in less than 3? hours total. A duct resistance of 2\" WC has\n     been allowed at a scrubber capacity of 1700 cfm (The 14\" TYPE 910 Scrubber will\n     provide a 3 ?\" WC draft and the separator will have a maximum pressure drop of 1?\"\n     WC.) The separator will initially be filled with 2000 gal of 15% NaOH solution. The\n     liquid temperature rise will not exceed 74 F.\"\n     \n     \nDescription of Plant Process   Ammonia\nThe ammonia system process flow diagram may be found in the Water Treatment Plant\nExpansion Drawings, Contract No. 87-02, Volumes 1 and 2, September 1988, Camp Dresser &\nMcKee, Inc. located in the Plant reference library. The diagram is titled, Chemical Feed  \nSchematics V, Sheet M-8, (82 of 147).\n\nThe ammonia system is made up of the ammonia supply vessel, piping and valves.\n\nAmmonia is stored in liquid form, under pressure at ambient temperature, in the ammonia supply\nvessel, T-C-901. The vessel is owned by the City and is maintained by the ammonia supplier,\ncurrently LaRoche Industries. LaRoche installed the vessel in 1990, and is responsible for\ninspections of the vessel as needed. The last inspection of this vessel was in 1998. (Note: "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 21538,
      "SummaryText": " before the leak is isolated.\n\nScenario Three assumes that a ? inch diameter hole occurs in the flexible tubing between the\nchlorine cylinders and the piping manifold. It is assumed to occur 30 minutes before the leak is\nisolated.\n\nScenario Four assumes that a   inch pressure relief device opens prematurely on the ammonia\nsupply vessel and sticks open, releasing gaseous ammonia to the atmosphere. It is assumed 30\nminutes elapse before the leak can be isolated.\n\nScenario Five assumes a break occurs in the 1-inch diameter loading hose during delivery of\nammonia to the plant from a vendor's truck. It is assumed the excess flow valve on the ammonia\nsupply truck fails, and that 10 minutes elapse before the leak is isolated.\n\nEach scenario considers seasonal variations in wind speed and direction, ambient temperature\nand relative humidity. Topography in the area surrounding the Plant is also considered. \n\nThe model assigns for each scenario two levels or zones of concern. The Protective Action Zone\nis the area within which people would be notified to \"Shelter-In-Place\" or, in the case of an\nextended release, evacuate. The Notification Zone is that area where no evacuation would be\nnecessary but within which people would be notified of an accidental release.\n\nThere are 14 Sensitive Receptors within one mile of the Plant, and 30 additional Sensitive\nReceptors within three miles of the Plant. These include schools, convalescent hospitals, board\nand care homes and child care facilities. \n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific\nPrevention Steps\nManagement System\n\nThe Pittsburg Water Treatment Plant has developed a management system to plan, organize,\nimplement and control the risk management program elements. This system satisfies the\nrequirements of Section 2735.6 of the CalARP regulation, and ensures that risk management\nprogram elements are developed and continually improved. All records associated with the\nprevention program elements are retai"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 21538,
      "SummaryText": "ined on the emergency response program when initially hired, when the\nemergency response plan is revised, and when employees' responsibilities are changed. All\nemployees receive annual refresher training on the emergency response program. \n\nPlanned Changes to Improve Safety\nTo date, there are no planned changes to improve safety at the Pittsburg Water Treatment Plant. \n\nHowever, the Superintendent and Public Services Department managers will meet to discuss\nrefinements of the following procedures or processes:\n\n  \"  Hot work permits   formalization of policy, and proposal to include other personnel in\n  review process when appropriate.\n\n  \"  Mechanical Integrity   formalization of the procedures for reviewing equipment, and\n  proposal to include additional personnel in review process. \n\n  \"  Incident investigation procedures to comply more fully with current OSHA, CalARP and\n  CCCHSD regulations."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 21538,
      "SummaryText": "The\ncontract for ammonia supply is evaluated and awarded on an annual basis.) \n\nAmmonia is unloaded by the vendor into the vessel. Plant operators stand by during the ammonia\nsupply vessel filling operation. Receipt of ammonia supply occurs only on Monday through\nFriday, during normal business hours. Additional facility personnel are on-site at this time to\nrespond if a release were to occur during the delivery operation.\n\nTruck operators are trained by the vendor and are responsible for visual inspection of regulator\nvalves and other safety equipment related to the vessel each time they are on the Plant site. \n\nThe flow rate of ammonia to the water injection locations is controlled by ammoniators located\nin the chemical feed room. Water injection acts as a motive force to draw the ammonia from the\nammoniators to the injection points. A vacuum regulator valve is located upstream of the\nammoniators. The pressure of the ammonia transfer lines and equipment, from the vacuum\nregulator, through the ammoniator, to the water injection points, is below atmospheric pressure. \n\nThe pressure in the ammonia supply vessel varies with the ambient temperature. The pressure in\nthe vessel typically ranges from 95 psig (60 F) to 195 psig (100 F). The storage vessel capacity is\n1,000 gallons. The maximum amount of ammonia stored in the supply vessel to 850 gallons\n(4,375 pounds at 60 F). The vessel is equipped with a continuous level transmitter with\nindication to the control console. This indicator signal (LE-611) is configured with high-level (at\n900 gallons) and low-level (at 100 gallons) alarms. The ammonia supply vessel is designed with\na maximum operating pressure of 265 psig and is protected by two relief valves that vent to the\natmosphere. \n\nAdditional field instrumentation at the ammonia supply vessel includes a pressure gauge and a\nlocal level indicator. Downstream of the ammonia vacuum regulator are a vacuum pressure\ngauge and a high-pressure switch that alarms to the contr"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 21538,
      "SummaryText": "ol console. Two pressure relief valves\nare installed on the ammonia supply vessel.  \n\nWorst Case Release Scenario and Alternative Release Scenario(s)\n\nThe Pittsburg Water Treatment Plant commissioned an Off-Site Consequence Analysis from\nrespected environmental consultants EQE International of San Francisco. The objectives of the\nstudy were:\n\n  \"  To provide information necessary for realistic emergency response and planning\n  \"  To demonstrate risk management improvements resulting from the Risk Management and\n  Prevention Program of 1995, including the impact those improvements would have on off-\n  site consequences, and,\n  \"  To provide the public with information regarding the potential risk of hazardous materials in\n  their neighborhoods, the risk management practices of facilities using these materials, and the\n  protective action that may need to be taken by the public if a major release of these materials\n  ever occurred. \n\nThe analysis included in this report is based upon modeling of several representative release\nscenarios for chlorine and ammonia. It includes a description of the two substances, as well as\ntheir use and storage; a description of the computer models used in the analysis and the\nconsequences of an accidental release on the area surrounding the Pittsburg Water Treatment\nPlant. \n\nFive release scenarios were selected for modeling. They were:\n\nScenario One assumes a leak in a section of the 1-inch chlorine piping upstream of the vacuum\nregulator, which could be due to a seismic event or mechanical impact. The worst case for a line\nfailure is a complete break. Two 1-ton cylinders are in service at one time, with a maximum\ncapacity of 4,000 pounds that could be released. It is assumed 30 minutes would elapse before\nthe leak is isolated.\n\nScenario Two assumes the lead core in a fusible plug fails completely, resulting in a .03 inch hole\nin a single 1-ton chlorine cylinder. The leak occurs below the liquid level, and is assumed to\noccur 30 minutes"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 21538,
      "SummaryText": "ned for a minimum of five years, unless otherwise\nspecified in the CalARP regulation.\n\n  \"  Planning   The Plant has an overall risk management policy that clearly identifies the goals\n  and objectives of the risk management program.\n  \"  Organizing   The Plant Superintendent was designated as the person responsible for the risk\n  management program elements. While this authority may be further delegated to subordinate\n  staff, contract workers or consultants, the size of the facility does not permit such\n  assignments at this time.\n  \"  Implementing   The Plant Superintendent is responsible for ensuring all appropriate persons\n  are trained in risk management procedures, implementation of the procedures, and\n  documentation. Refresher training is provided on an as-needed basis, but is conducted at a\n  minimum following any changes to procedures, or following reauthorization.\n  \"  Controlling   The Plant Superintendent and his designees will conduct periodic internal\n  reviews or audits against the goals and objectives of the program element. Annually, these\n  procedures are reviewed, revised and reauthorized to ensure they remain accurate and reflect\n  current practices.\n\n\nChemical-Specific Prevention Steps\nChlorine System\n\n  A. The chlorine supply cylinders are stored in an enclosed storage room. During normal\n  operation, the doors into the room are closed. The chlorine storage room is provided with a\n  scrubber system, which is described in detail in the first section of this document.\n \n  B. The chlorine cylinder is designed with cylinder heads (ends) that are concave, or curved into\n  the cylinder. This allows mounting of the cylinder valves inside the end. This design reduces\n  the likelihood of damage to the cylinder valves that may be caused by a collision with tools or\n  equipment.\n \n  C. The chlorine handling system utilizes a vacuum regulator, which minimizes the amount of\n  chlorine that is handled above atmospheric pressure. All chlorine piping and equ"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 21538,
      "SummaryText": "ipment that\n  operate above atmospheric pressure are located inside the chlorine storage room.\n \n  D. The chlorine storage room, which is part of the Operations Building, is designed in\n  accordance with the Uniform Building Code (UBC) 1988 edition.\n \n  E. The chlorine system is installed in accordance with the recommendations of the Chlorine\n  Institute.\n \n  F. Two chlorine leak detectors are installed in the chlorine storage room. Upon detection of 1\n  ppm of chlorine in the storage room, a warning alarm will be sounded at the operator console\n  in the Operations Building. Upon detection of 3 ppm of chlorine in the storage room, a\n  second warning alarm will be sounded at the operator console, and the storage room scrubber\n  system will be started. The storage room scrubber system is designed to remove 2,000 pounds\n  of chlorine from the chlorine storage room over a 3 ? hour period. Shutting off the scrubber\n  system requires operator intervention.\n \n  G. The chlorine storage room is provided with its own HVAC system, including inlet louvers\n  and an exhaust fan. The louvers are normally closed and the fan is off, except during hot\n  ambient conditions, such a hot summer day. When the scrubber system is activated, the\n  chlorine storage room HVAC inlet louvers are interlocked to close and the exhaust fan is shut\n  off. \n\n  H. The chlorine vacuum regulator closes when the downstream pressure exceeds the regulator\n  setting (which may be due to a leak or break in the line or equipment downstream of the\n  regulator. \n\n  I. Chlorine supply cylinders, both full and empty, are strapped down with steel chains to\n  prevent movement. Each cylinder is individually strapped down. \n\n  J. Flexible connectors, or pigtails, are installed between the chlorine supply cylinders and the\n  chlorine piping manifold. Use of pigtails reduces the likelihood of accidental chlorine release\n  caused by inadvertent movement, which may result from a seismic event or mechanical\n  impact, of th"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 21538,
      "SummaryText": "e chlorine cylinders. Pigtails are changed every six months, in January and July\n  of each year, or when excessive wear is noted.\n\n  K. Pressure gauges (field indicators) are installed downstream of the chlorine supply cylinders\n  and upstream of the vacuum regulator, one for each pair on-line chlorine cylinders. A vacuum\n  pressure gauge is installed downstream of the vacuum regulator. Weight scales (field\n  indictors) are installed at each pair of on-line chlorine cylinders. \n\n  L. Low-pressure switches (PSL-601-1/2) are installed downstream of the chlorine supply\n  cylinders and upstream of the vacuum regulator, one for each pair of on-line chlorine\n  cylinders. A high vacuum pressure switch is installed downstream of the vacuum regulator. \n\n  M. Personal Protective Equipment (PPE) is available to isolate a chlorine leak. All Pittsburg\n  Water Plant personnel are trained in the use of MSA 401 breathing apparatus and chemical\n  suits. Four each of MSA 401s and chemical suits are located on-site; two each are located\n  outside the chlorine storage room on the north wall, and two each are located outside the\n  chemical feed room on the south wall.\n\n  N. A Chlorine Institute Emergency Kit \"B\" for ton containers, used for sealing leaks in chlorine\n  cylinders, is available on-site, located in the chemical room, which is adjacent to the chemical\n  storage room. The B Kit is inspected on a quarterly basis to ensure it is complete and all parts\n  are in good condition. All Pittsburg Water Plant personnel are trained in how to use the B\n  Kit. \n\n  O. There is a sprinkler system in the chlorine storage room, which was installed in accordance\n  with the local fire code. No flammable or combustible materials are stored in the chlorine\n  storage room.  \n\n  P. The Plant is crewed 24 hours per day. The operating staff continuously monitors the entire\n  operation. Operators perform surveillance, or rounds, of the entire facility, including the\n  ammonia and chlorine systems, at "
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 21538,
      "SummaryText": "least every four hours. Usage of all chemicals, including\n  chlorine, is recorded every 24 hours. \n\n\nAmmonia System\n\n  A. The ammonia handling system utilizes a vacuum regulator, which minimizes the amount of\n  ammonia that is handled above atmospheric pressure. The vacuum regulator is located as\n  close to the ammonia supply vessel as practical, approximately 5 feet.\n \n  B. The current ammonia supplier, LaRoche Industries, installed the ammonia system. The\n  ammonia supply vessel, C-T-901, was fabricated in accordance with the ASME Boiler and\n  Pressure Vessel Code, Section VIII.\n\n  C. The ammonia system vacuum regulator closes when the downstream pressure exceeds the\n  regulator setting, which may be due to a leak or break in the line or equipment downstream of\n  the regulator. \n\n  D. A pressure gauge (field indicator) is installed at the ammonia supply vessel. A vacuum\n  pressure gauge is installed downstream of the vacuum regulator. A local level indicator (field\n  indicator) is installed at the ammonia supply vessel.\n\n  E. A level transmitter with indication (LE-611) to the control console is installed at the\n  ammonia supply vessel. The level indicator has a low setting (100 gallons) and a high setting\n  (900 gallons) that alarm to the control console. A high vacuum pressure switch is installed\n  downstream of the vacuum regulator. \n\n  F. Two pressure relief valves are installed on the ammonia supply vessel. \n\n  G. PPE is available to isolate an ammonia leak. All Pittsburg Water Plant personnel are trained\n  in the use of MSA 401 breath apparatus and chemical suits. Four each of MSA 401s and\n  chemical suits are located on-site; two each are located outside the chlorine storage room on\n  the north wall, and two each are located outside the chemical feed room on the south wall. \n\n  H. A fire water hydrant is located within 50 feet of the ammonia supply vessel. This hydrant\n  provides the capability to \"knock down\" an ammonia leak with firewater, which may\n  min"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 21538,
      "SummaryText": "imize possible off-site impact of an ammonia release.\n\n  I. The Plant is crewed 24 hours per day. The operating staff continuously monitors the entire\n  operation. Operators perform surveillance, or rounds, of the entire facility, including the\n  ammonia system, at least one every four hours. Usage of all chemicals, including ammonia, is\n  recorded every 24 hours. \n\n\nPrevention Program Elements\nProcess Safety Information\nThe following process safety information is available at the Pittsburg Water Treatment Plant: \n  \"  Operating Standards and Procedures are available for the entire operation of the Pittsburg\n  Water Plant, and are located in the control area of the Operations Building. A written\n  procedure is available for changing the chlorine supply cylinders; that is, moving empty\n  cylinders and replacing them with full cylinders at the on-line location in the chlorine storage\n  room. \n  \"  Water Treatment Plant Expansion, Contract Documents and Specifications, Contract No. 87-\n  02, Volumes 1 & 2, September 1988, Camp, Dresser & McKee Inc., located in the Plant\n  reference library\n  \"  Water Treatment Plant Expansion, Drawings, Contract No. 87-02, Volumes 1 & 2,\n  September 1988, Camp, Dresser & McKee Inc., located in the Plant reference library\n  \"  Water Treatment Plant Expansion, Operation and Maintenance Manual, Volumes III, IV, &\n  V, Chemical Equipment, Electrical, Instrumentation and Controls, September 1988,\n  Engineer: Camp, Dresser & McKee, Contractor: Lawson Mechanical Contractors, located in\n  the Plant reference library\n\nIn addition, the following logs are maintained by Plant personnel to provide a record of the\nfacility operation:\n  \"  Plant operations log, located in the control area\n  \"  Maintenance log, located in the maintenance shop\n\nProcess Hazard Analysis\nA Hazard and Operability Study was conducted on January 9, 1995 regarding the use and\nhandling of chlorine and ammonia at the Pittsburg Water Treatment Plant. \n\nA Hazard and Operability ("
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 21538,
      "SummaryText": "HAZOP) Study was conducted on January 9, 1995, regarding the use\nand handling of chlorine and ammonia at the Pittsburg Water Plant.  This study complies with\nOSHA rule 1910.119, \"Process Safety Management of Highly Hazardous Chemicals.\"  A copy of\nthe HAZOP Study report is available at the Pittsburg Water Plant.\n\nHAZOP Study Deviations\n\nThe study was conducted primarily using the HAZOP Study deviation guideword technique.  The\nguidewords, in conjunction with key process parameters, prompt the HAZOP Study team to\nbrainstorm possible causes and potential consequences of deviations from design operation.  For\nexample, the deviation \"NO FLOW\" would prompt the leader to ask the team, \"What could\ncause no flow in this section or line segment?\"  The \"Possible Cause\" and \"Potential\nConsequence\" scenarios are documented in the study worksheets.  The \"Existing Systems and\nProcedures: (safeguards) that reduce the risk associated with the specific cause / consequence\nscenario are then discussed and documented.  For scenarios involving significant risk,\n\"Recommendations\" that the team believes may further reduce risk or improve the operability of\nthe facility are also documented.\n\n\n\nThe specific steps of the HAZOP Study methodology used in this study were:\n\n       u  Choose a study section or mode\n       u  Apply a deviation (guideword + parameter)\n       u  Brainstorm causes of the deviation\n       u  Develop each cause to its global consequence(s)\n       u  Identify existing safeguards\n       u  Qualitatively assess the risk of the scenario\n       u  If warranted, make recommendations to reduce risk and / or improve the operability\n       of the facility\n\nThe systematic approach of a HAZOP Study requires that deviations (guidewords + parameters)\nbe uniformly applied to all sections under study.  The following deviations were used for each\nstudy session:\n\n\nNo Flow\nLeak / Rupture\nWrong Reaction1 \n\n\nMore Flow\nHuman Factors\nNo Mixing1 \n\n\nLess FlowMechanical Seal\nDamage\nMore Mixing"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 21538,
      "SummaryText": "1\n\n\n\nReverse Flow\nExchanger Tube Leak1\nLess Mixing1\n\n\nMisdirected Flow\nSampling1\nService Failure1\n\n\nMore Temperature\nMaintenance1\nInstrumentation1\n\n\nLess Temperature\nWrong Material1\nTesting1\n\n\nMore Pressure\nCorrosion / Erosion1\nRelief1\n\n\nLess Pressure\nPipe Specification Break1\nIgnition1\n\n\nMore Level\nNo Reaction1\nIsolation1\n\n\nLess Level\nMore Reaction1\nAbnormal Operation1\n\n\nWrong Concentration\nLess Reaction1\nExternal Events1\n\n\nContamination\nAs-well-as Reaction1\nSafety1\n\n\nStartup / Shutdown\n\n\n\n\nWrap-up Discussions\n\nThe HAZOP Study techniques was used to analyze line-by-line the AHM handling systems at the\nPittsburg Water Plant.  However, the HAZOP Study technique may not document all the general\nissues affecting the health and safety of the work place employee or identify all potential AHM\nreleases that could have off-site impact.  In addition to the line-by-line discussions that were\ndocumented in the section worksheets, \"Wrap-up Discussions\" were held at the end of the\nHAZOP Study to ensure that these general topics were covered.\n\nThe \"Wrap-up Discussions\" topics covered in the study included:\n\n       u  Safety / Fire Protection\n       u  Emergency Response\n       u  Procedures\n       u  Loss of Utilities\n       u  Siting / Control Room Location\n       u  Previous Incidents\n       u  Human Factors\n       u  Testing and Inspection\n       u  Maintenance\n       u  External Events\n       u  Other Hazards Analysis Studies\n\n\nRisk Matrix\n\nThe HAZOP Study team members used a risk matrix to qualitatively assess the risk associated\nwith each cause / consequence scenario that was developed during the study.  The matrix used\nfor this HAZOP Study is based on the information provided in the Contra Costa County Health\nServices Department (CCCHSD) RMPP Guidelines.  \n\nRecommendations proposed by the HAZOP Study team are included in this report as Appendix\nA.\n\n\n\nOperating Procedure\n\nCurrent, clearly written standard operating procedures and safe work practices ensure that both\nexperie"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 21538,
      "SummaryText": "nced and inexperienced employees, including contract employees, will respond in a safe,\nconsistent and prescribed manner. The Pittsburg Water Treatment Plant developed a written\noperating procedures manual, satisfying the requirements of Section 2760.3 of the CalARP\nregulation, to ensure that written procedures/practices are developed, reviewed, implemented and\nannually certified as reflective of current plant practice. \n\nThese procedures are available in the control room for each process, and include the following\nsections:\n\nSection I:  Introduction\n            Description of System\n            System Modifications\n            Treatment\n            Emergency Power\n            Storage and Distribution System\n\nSection II:      Monitoring\n          Monitoring Diagrams\n          Flow Diagrams\n          Settled Water Monitoring\n          Backwash Recovery System \n          \nSection III:     Plant Operations\n          Operator Certification\n          Operational Procedure/Responsibilities\n          Plant Start-Up Procedure\n          Plant Shut-Down Procedure\n          Filter Backwash Procedure\n          Emergency Disinfection\n          Equipment Descriptions\n          Jar Testing Outline and Procedures\n          Chemical Vendors List\n          \nSection IV: Emergency Response Procedures\n            Emergency Notification Plan\n\nSection V:  Laboratory Procedures\n\n  \n            \n\n\nTraining\n\nEvery Plant employee is trained in the following:\n\n  \"  The facilities Contingency Plan\n  \"  Proper handling and storage techniques associated with the Hazardous Materials located on-\n  site\n  \"  Proper use and maintenance of both Emergency Response and Personal Protective\n  Equipment, including MSA 401 breathing apparatus and chemical suits, and application of\n  Chlorine Institute Emergency Kit B for ton containers. \n  \"  The human and environmental health hazards associated with the hazardous materials on-site.\n  This includes a review of Material Safety Data Sheets.\n  \"  Emergency res"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 21538,
      "SummaryText": "ponse training and simple spill remediation\n  \"  The location, operation and maintenance of fire extinguishers and spill control equipment\n  \"  Facility shutdown procedures\n  \"  The location of the facility's Contingency Plan\n\nRefresher training is given annually by the Plant Superintendent, or his designee, on an ongoing\nbasis. New employees are trained immediately upon hiring. Employees who receive training so\nattest by signing and dating a training log. All training records are maintained at the Plant, with a\ncopy sent to the Public Services Department Administrative Division.\n\nThese records reflect weekly tailgate safety meetings presented and attended by all Plant\npersonnel. The facility utilizes American Water Works Association (AWWA) safety training\npublications as a guide for its weekly safety discussions. Each year, the Plant uses AWWA's\nupdated series of lecture topics on common utility safety practices.\n\nMechanical Integrity\n\nA well-established mechanical integrity program ensures that equipment critical to process safety\nis fabricated to meet process specifications, installed correctly, and maintained in a safe operating\ncondition. It also allows maintenance employees to preemptively identify and correct equipment\ndeficiencies to avoid associated incidents and down time. The Pittsburg Water Treatment Plant\nhas therefore developed a mechanical integrity and maintenance program, satisfying the\nrequirements of Section 2760.5 of the CalARP regulation, which is comprise of the programs and\nprocedures show below. The program applies to pressure vessels and storage tanks, piping\nsystems, relief and vent systems, emergency shutdown systems, controls and pumps and\nadditional equipment deemed by the plant Superintendent to be important to safety.\n\n  \"  The Superintendent, and when appropriate, consulting engineer, review(s) required\n  mechanical details to ensure the equipment meets or exceeds all design specifications; is\n  properly constructed; is suitable for i"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 21538,
      "SummaryText": "ts application; is designed in accordance with good\n  engineering practice, and will meet the requirements for safety, reliability and product\n  quality. \n\n  \"  The Superintendent and maintenance staff conduct appropriate checks and inspections to\n  ensure the equipment is installed properly and is consistent with the design specifications and\n  manufacturer's instructions.  \n\n  \"  Maintenance employee training. The Plant reviews applicants for employment based on skills\n  and experience pertinent to the job tasks. Additional skills training is provided on an as-\n  needed basis. Maintenance employees are provided with an overview of the plant process, the\n  hazards associated with the process, and safe work practices during initial employee training\n  and annual refresher training. \n\n  \"  Written maintenance procedures for process equipment. Specific maintenance activities are\n  performed on a routine basis. Other maintenance activities are performed on an as-needed\n  basis. All maintenance activities at the Plant are logged in both the maintenance log and the\n  plant (operations) log. \n\nManagement of Change\n\nChanges within a stationary source are sometimes necessary to address safety, environmental and\noperational concerns. A change made in one part of the process or other processes may have\nunintended effects on other parts of the process because the stationary source is an integrated\nsystem. \n\nFor this reason, any change in the systems for handling or storing chlorine or ammonia at the\nPlant would be scrutinized before they area made, to ensure the changes do not compromise the\nsafety and integrity of the process and to avoid adverse effects to worker and public safety, and\nthe environment.\n\nThe Pittsburg Water Treatment Plant is a relatively small industrial facility. Since initial\ninstallation of the current chlorine and ammonia handling systems in 1990, no changes have been\nmade to the chlorine or ammonia handling systems. However, if a change to these systems"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 21538,
      "SummaryText": " was\nplanned, the following practice would be adhered to:\n\nBefore any change is made to the chlorine or ammonia handling systems, the Water Plant\nSuperintendent will ensure that all personnel complete training on the hazards associated with the\nchange. This training will be completed prior to startup of the change. \n\nThis would not apply to \"replacement in kind\" which is defined as replacements that satisfy the\ndesign specifications. \n\nCompliance Audits\n\nThe Pittsburg Water Treatment Plant believes that ensuring the prevention program elements are\nfunctioning properly, that is, that they are complete, current, and applied in compliance with City\npolicy, regulations and good process safety practices, is vital to the continuous improvement of\nthe accidental release prevention program. Personnel perform internal compliance audits at least\nevery three years, to review and evaluate the written documentation and records, and the\nimplementation of the prevention program. Potential areas that can be improved within the\nprevention program elements are identified, and recommendations are formulated and\nimplemented to ensure an effective and improved overall prevention program. The developed\ncompliance audits program satisfies the regulatory requirement of Section 2760.8 of the CalARP\nregulation.\n\nAn audit team will be assembled by the Plant Superintendent, and may include plant personnel,\ncontract employees and/or consultants as appropriate. The team will utilize an audit protocol, to\nperform the following:\n\n  \"  Assessment of the written prevention program elements\n  \"  Review of records, including incident investigations, to assess implementation of the written\n  prevention program elements\n  \"  Employee interviews to assess fundamental level of understanding for applicable programs\n  \"  Interviews with key personnel, who have primary responsibility for each prevention program\n  element, to assess fundamental level of understanding.\n\nThe audit team will formulate findings a"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 21538,
      "SummaryText": "nd recommendations for improvement. The results of the\ncompliance audit will be communicated to all interested personnel, such as members of\nmanagement, employees, during a closed meeting. The Superintendent will be responsible for\nreviewing the recommendations, determining appropriate resolution of each recommendation,\nand assigning responsibility for each recommendation. The facility will track and maintain\nrecords as to the final disposition of the recommendations formulated during compliance audits. \n\n\nIncident Investigation\n\nThe Pittsburg Water Plant uses the \"Facility Incident Check List\" included in the facility\nBusiness Plan submitted annual to the CCCHSD. If an accidental release of chlorine or ammonia\nwere to occur, the facility would use this checklist to document information specific to the\naccidental release. \n\nThe investigation procedure following an incident involves four stages: gathering evidence,\nincluding interviewing witnesses and collecting evidence such as records or samples; analysis of\nthe evidence, including identification of a root cause; developing conclusions and formulating\nrecommendations. \n\nThe result would be a written report on the incident, to be forwarded to Plant Management, the\nPublic Services Safety Committee and CCCHSD and/or OSHA when appropriate. The\ninvestigation result, including the disposition of all formulated recommendations, would be\nreviewed with employees and contractors whose job tasks are relevant to the findings. \n\nHowever, this practice does not currently comply with CCCHSD RMPP guidelines (Section 6.5)\nor with the Occupation Safety and Health Administration (OSHA) Rule 1910.119, Process Safety\nManagement of Highly Hazardous Chemicals, Section (m). \n\nDuring the HAZOP Study for the Plant, the study team recommended development of an incident\ninvestigation program that complies with the CCCHSD guidelines and OSHA Rule 1910.119. To\ndate, this recommendation has not been acted upon.  \n\n\nEmployee Participation\n\nThe Pi"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 21538,
      "SummaryText": "ttsburg Water Treatment Plant, like all divisions of the Public Services Department, relies\non the expertise of employees (including seasonal and contract employees when appropriate) at\nall levels and disciplines to optimize operations and safety. This is achieved by consulting with\nemployees to ensure consideration of their knowledge and experience in all applicable areas of\nthe prevention program. This includes exchanging information with, and soliciting input and\nparticipation from Plant staff, contractors and others as appropriate. \n\n\nHot Work Permit\n\nControlling ignition sources is vital to the Pittsburg Water Treatment Plant's release prevention\nprogram. Therefore, it is critical that personnel at the Plant are notified when hot work (such as\nany spark-producing operation including use of power tools, grinding, burning, welding or\nbrazing) is to be performed in a unit and that appropriate safety precautions are taken prior to the\ninitiation of the work. \n\nWhile the Plant has not developed a formal, written, hot work permit program, the procedures to\nbe followed are common knowledge to all Plant personnel, contractors and maintenance\npersonnel occasionally provided to the plant by other divisions of the Public Service Department. \n\nThat is, no work is to take place without the express consent of the Plant Superintendent. All\nwork orders, purchases and contracts for work are required to have the Plant Superintendent's\nadvance knowledge and signature prior to commencement of work. For a small industrial facility\nwith few employees, this policy is effective, and enforceable. \n\nThe Superintendent will perform an inspection of the area proposed for the hot work, prior to\nauthorization of the work. He will ensure the following:\n\n  \"  The source of ignition may be safely used, and only with approved apparatus. Personnel\n  operating the equipment must be informed of the hazards and properly trained.\n  \"  Combustible materials in areas that will be exposed during hot wo"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 21538,
      "SummaryText": "rk are protected or\n  relocated.\n  \"  Oil accumulations are removed.\n  \"  Proper fire extinguishing equipment is available to personnel performing the hot work.\n  \"  Personnel in the control room are notified prior to initiation of the hot work to make them\n  aware of the ignition source. This allows personnel in the control room to quickly contact the\n  fire district and personnel performing the hot work when continued use of the source of\n  ignition becomes hazardous. \n\nContractors\n\nThe Plant relies on contractors to supplement the existing staff, in particular for facility\nconstruction, as well as equipment repair and maintenance. The Plant and all contractors are\njointly responsible for safety, and must ensure that contractors are trained in and understand the\nfollowing:\n\n  \"  Work practices necessary to perform his or her job;\n  \"  Hazards associated with a process;\n  \"  Applicable sections of the emergency response procedure, including evacuation plans, and\n  \"  Applicable safe work practices.\n\nIt is also critical for contractors to inform Plant personnel of any unique hazards that they\nintroduce while performing their work. \n\n\nFive Year Accident History\n\nThe Pittsburg Water Treatment Plant compiled a five-year accident history for all accidental\nreleases from covered processes that resulted in deaths, injuries, or significant property damage\non site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage or\nenvironmental damage. The compilation of this information satisfies the requirements of Section\n2750.9 of the CalARP regulation. The five year accident history allows the Pittsburg Water\nTreatment Plant to explain to the community factors causing or contributing to accidental\nreleases, the onsite and offsite impacts of accidental releases, and the procedural and\ntechnological changes made to minimize the likelihood that these accidental releases will not\noccur again. \n\nIn a review of Water Plant operational and safety reports,"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 21538,
      "SummaryText": " there have been no documented\naccidental releases of ammonia or chlorine that have resulted in, or had the potential for, off-site\nimpacts. Additionally, the Plant has not had releases of chlorine or ammonia in the last five years\nthat resulted in injuries to facility or contract personnel due to exposure to these chemicals. \nEmergency Response Program\nOverall safety at the Pittsburg Water Treatment Plant is governed not only by the ability to\nprevent accidental releases of regulated substances, but to mitigate any accidental releases that\nmay occur. The facility has developed and Emergency Response Plan, Emergency Response\nProcedures and Emergency Notification Plan, all of which are attached here as Appendix C.\n\nThe Emergency Response Plan is used in the event of a fire or threatening Hazardous Materials\nrelease, and includes evacuation plans, notification to emergency responders, and the use of\npersonal protective equipment in the event a spill response can be performed safely by on-site\npersonnel.\n\nEmergency Response Procedures are written for a wide variety of emergencies, from power\nfailures to disinfection equipment failure. All staff is trained in response and notification\nprocedures. \n\nThe Plant does not have its own fire brigade, and is therefore dependent on the Contra Costa\nConsolidated Fire District for response to fires in the area. All personnel will therefore evacuate\nthe area and call \"911\" in the event of a fire. Properly trained employees may respond to incipient\nfires requiring one fire extinguisher after notifying the fire district. Annually, the fire district\nperforms walk-throughs of the plant and its processes, and maintains a current copy of the\nHazardous Materials Business Plan submitted to the CCCHSD. This pre-planning also ensures\nthat members of the fire department are familiar with stationary source, the hazards of anhydrous\nammonia and chlorine, resources available at the Plant, and the locations of those resources. \n\nEmployees are tra"
    }
  ]
}