{
  "FacilityID": 21588,
  "FacilityName": "EXCELDA MANUFACTURING WAREHOUSE",
  "FacilityStr1": "12839 EMRSON DRIVE",
  "FacilityStr2": null,
  "FacilityCity": "BRIGHTON",
  "FacilityState": "MI",
  "FacilityZipCode": "48116",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26093",
  "LEPC": "Livingston County LEPC",
  "FacilityLatDecDegs": "42.542667",
  "FacilityLongDecDegs": "-83.559972",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5320007,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "WILLIAM A. LAMARRA",
  "OperatorStr1": "12839 EMERSON DRIVE",
  "OperatorStr2": null,
  "OperatorCity": "BRIGHTON",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48116",
  "OperatorZipCodeExt": null,
  "FTE": 87,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120852",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-06-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-06-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2019-06-03 00:00:00",
  "AnniversaryDate": "2005-06-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.50288,
  "FRS_Long": -83.69017,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30491,
      "AltID": "FLAMMABLE MIXTURE STORAGE",
      "FacilityID": 21588,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 39669,
          "ProcessID": 30491,
          "ChemicalID": 155,
          "Quantity": 801000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 29677,
              "ProcessChemicalID": 39669,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 29678,
              "ProcessChemicalID": 39669,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31264,
          "ProcessID": 30491,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21588,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "GREEN OAK TOWNSHIP FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "8102313663",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21588,
      "SummaryText": "Excelda Manufacturing warehouse operations is committed to providing a safe workplace for its employees and the surrounding public.  The facility is located in a somewhat rural area of Brighton, Michigan. The latitude/longitude section is correct according to the RMP suggested internet programs, but the RMP submit program is not accepting them.  I have entered the numbers the program calculated, and I think the problem is our location is so close to Oakland County that  the computer recognizes us as Oakland County.   The function of the facility is storage and distribution of finished consumer automotive service parts.  Excelda Manufacturing Warehouse has provided a site plan of the building and copies of material safety data sheets to the local fire department and they are also kept on site for review and easy access.  In March 1999, Excelda provided the Emergency Planning and Community Right to Know Act (EPCRA) report to the local fire department, the Livingston County Emergency Planning Committee and the State Emergency Planning Committee.  \n\nThe facility is set up with racking systems containing pallet quantities of finished automotive service parts for distribution.  This facility is being reported as a separate stationary source from the other facility across the driveway, since there are seperate street addresses and seperate functions at both facility's.  However, both buildings have the same owner, and the number of full time employees inhabit both buildings.  The employees ship product daily from this facility by truck load and by piece with common carriers to dealerships and other purchasers throughout the country.  We store numerous products on site and because our business is growing very well, we have built an addition to this facility with special storage capabilities for our regulated substances. This warehouse now has a  storage room for aerosols with blast walls, fire rated doors and sprinkling requirements for aerosol storage rooms in warehouses. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21588,
      "SummaryText": " \n\nThe products on site requiring this report are consumer sized aerosol automotive products.  The largest container on site is 18 ounces and the maximum amount we could ever have on site is 801,000 pounds. We do not have this much on site at this time, nor do we expect to ever have this much on site, but we are predicting worse case according to the rules of this report.  \n\nThe worst case release scenario is based on the release of our largest vessel, using the guidance supplied by the Chemical Distributors Reference Tables and Equations.  The largest vessel is 18 ounces or 1.1 pounds.   15% of the product weight is the regulated substance.  Therefore the distance to the endpoint will be 43 feet or (.008 miles).  In the report, I had to use the figure of .01 since I am given only 2 significant digits to work with and therefore this information is a bit different from that section.  This distance will stay within the walls of the warehouse facility.  This type of release is unlikely to occur since this building is only storage and distribution and none of the activities in the warehouse require a flame to be present and smoking is prohibited. \n\nSince our process qualifies for program 1 of the RMP, I could not enter an alternative release scenario in the report section.  However, if this facility is on fire, all products inside will be affected, not just one single vessel.  The distance to the endpoint using the vapor cloud explosion scenario and the endpoint of 1PSI based on the maximum release of the regulated substance will be 2084 feet (.40 miles).   This will affect some homes, commercial, office and industrial areas, state park and recreation area.  As I mentioned earlier, this is not likely to occur since the activities of the warehouse are only storage and distribution.\n\nAccidental release prevention programs at Excelda include the OSHA Hazard Communication and Right to Know training.  Emergency Action Plan training and recently updated plan sent to officials"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21588,
      "SummaryText": " and ongoing employee training.  Emergency Planning and Community Right to Know Act reporting to the local and state agency's.  Inventory control is also part of our release prevention program, as associates check for damaged goods they are pulled from inventory and reworked to avoid any type of hazard or accident with the products as they are being moved and shipped.  \n\nExcelda has not had any accidents at this facility in the past 5 years.\n\nExcelda Maunfaucturing Warehouse has coordinated the RMP with the LEPC and we have also provided information through the EPCRA reports we sent in March 1999.  We have a Pollution Incident Prevention Plan in place for this facility which has the appropriate contacts we need to make in case of a release.  \n\nExcelda is going to continue to provide training to the associates throughout the year and this training will include but not be limited to:  Fire Extinguisher hands on training and evacuation refresher training and Right to Know training."
    }
  ]
}