{
  "FacilityID": 21615,
  "FacilityName": "Simonian Fruit Company",
  "FacilityStr1": "350 North 7th",
  "FacilityStr2": null,
  "FacilityCity": "Fowler",
  "FacilityState": "CA",
  "FacilityZipCode": "93625",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.631972",
  "FacilityLongDecDegs": "119.680972",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Brett Davies",
  "OperatorStr1": "P.O. Box 340",
  "OperatorStr2": null,
  "OperatorCity": "Fowler",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93625",
  "OperatorZipCodeExt": null,
  "FTE": 125,
  "OtherEPAFacilityID": "CAL000046779",
  "EPAFacilityID": "100000170995",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-11-01 00:00:00",
  "SafetyInspectionBy": "County Health Dept.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-07-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-07-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-06-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.632433,
  "FRS_Long": -119.683309,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30556,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 21615,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 39847,
          "ProcessID": 30556,
          "ChemicalID": 56,
          "Quantity": 14500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31330,
          "ProcessID": 30556,
          "NAICSCode": "11133",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 16879,
              "Process_NAICS_ID": 31330,
              "SafetyReviewDate": "2000-07-11 00:00:00",
              "PHA_Date": "2001-07-11 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-07-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-07-11 00:00:00",
              "TrainingReviewDate": "2000-07-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-07-11 00:00:00",
              "EquipmentInspectionDate": "2000-03-01 00:00:00",
              "EquipmentTested": "Reciprocating Compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-08-21 00:00:00",
              "PreStartupReviewDate": "2000-03-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1994-10-31 00:00:00",
              "HotWorkPermitReviewDate": "2000-08-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24557,
                  "PreventionProgram3ID": 16879,
                  "ProcessChemicalID": 39847
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21615,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1994-10-31 00:00:00",
    "ERTrainingDate": "1994-10-31 00:00:00",
    "CoordinatingAgencyName": "Fire Depatment",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21615,
      "SummaryText": "Risk & Process Safety Management Program\n\n\n\nExecutive Summary\n\nfor\n\nSimonian Fruit Co.\n350 N. Seventh\nFowler, California 93625\n(559) 834-5921\nFAX (559) 834-2363\n\n\nJune 21, 1999\n\n\n\n\n\n\n\n\n\n\nPrepared by:\n\nCalifornia Controlled Atmosphere\n39138 Road 56\nDinuba, CA  93618\n559-591-8874\nFax 559-591-8874\nwww.calca.com\n\n \nTable of Contents For Executive Summary\n\n1.  \tSIMONIAN FRUIT CO. RISK & PROCESS SAFETY MANAGEMENT PROGRAM\t1\n2.\tDESCRIPTION OF AMMONIA SYSTEM\t1\n3.\tAMMONIA RELEASE SCENARIOS\t2\n3.1\tWORST CASE SCENARIO\t2\n3.2\tALTERNATIVE CASE SCENARIO\t2\n4.\tGENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\t2\n5.\tFIVE YEAR ACCIDENT HISTORY\t3\n6.\tEMERGENCY ACTION PLAN\t3\n7.\tPLANNED CHANGES TO IMPROVE SAFETY\t3\n\n \n1.  \tSIMONIAN FRUIT CO. RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees, that Simonian Fruit Co. is preparing a unified Risk & Process Safety Management Program to comply with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5, Program Level 3 Elements, and Federally Title 40 CFR Part 68) and California OSHA's Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program is being prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs which can be contained in our refrigeration system. \n\nOur program will promote overall plant, worker, and public safety. The program will enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quite proud of.  Our program incorporat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21615,
      "SummaryText": "es and brings together several existing safety programs that already set forth rules, procedures and practices which help our employees protect themselves and our neighbors.\n2.\tDESCRIPTION OF AMMONIA SYSTEM\nSimonian Fruit Co. operates a commercial cold storage for deciduous tree fruit and grapes.  Our facility has one  ammonia system which can hold a charge of up to 14,500 lbs though we only operate with approximately 9,600 lbs.  The system provides refrigerating capacity to two cold storage rooms equipped with forced air cooling and five cold storage rooms for palleted product.\n\nThe systems operate as follows.  High pressure liquid from our main receiver is piped to each cold room, where it passes through an expansion valve into low temperature & pressure accumulator vessels.  From the accumulators, cold liquid ammonia is circulated through evaporator coils.  As heat is absorbed, the liquid ammonia vaporizes to form low temperature & pressure gas which is returned to the accumulator vessel.  The ammonia vapor is returned from the accumulator vessels through a suction return line to our engine room, where it passes through a compressor.  The high pressure discharge from the compressor is sent to a water cooled condenser where the high pressure gas ammonia is cooled, liquified and returned to our receiver. \n\nThe facility was built by professional refrigeration engineers in accordance with standard design, and installation of ammonia mechanical refrigerating systems.  It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their set point.  Lastly, an emergency dump box contains switches and valves to turn off equipment and vent ammon"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21615,
      "SummaryText": "ia if necessary.\n\nThe ammonia system at our facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected.  Therefore, we are treating our facility as a single process.\n\n3.\tAMMONIA RELEASE SCENARIOS\n3.1\tWorst Case Scenario\nOur worst case scenario is the failure of our high pressure receiver which can contain up to 14,500 lbs of ammonia.  Following the instructions set forth in EPA's Risk Management Program Guidance for Ammonia Refrigeration (40 CFR Part 68), we considered the failure of one vessel.  We did not include any liquid ammonia in the piping connected to the failed vessel.  This vessel is located in the mechanical room, and the release would be passively mitigated.  The ammonia would be released over a ten minute period.  Using the program RMP*Comp we estimate that the ammonia would travel 0.5 miles (urban conditions) before dispersing enough to no longer pose a hazard to the public.  A map showing the area that would be affected is attached.\n\nIn our opinion, it is extremely unlikely that the worst-case scenario will ever take place.  Our receiver meets industry standards for manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety relief valves limit the operating pressure in this vessel; and our operators are trained in the safe operation of our system.\n\n3.2\tAlternative Case Scenario\nThe alternative release scenario selected by Simonian Fruit Co. is as follows. A high-pressure safety relief valve lifts abruptly and fails to reseat.  This can occur when the inlet pressure exceeds the valve setting pressure.  The purpose of these valves is to prevent over-pressurization, which can lead to ruptures or pipe bursts.  These valves are designed to open and close with accurate performance, but occasionally the piston or diaphragm set gets caught on debris and causes the valve to stick i"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21615,
      "SummaryText": "910.120). \n\nStrategically, our plan is Minimal Response. Employees will evacuate to predetermined assembly areas in the event of an emergency.  The first priority will be to operate the ammonia system to bring a release under control safely, from a distance, without donning personal protective equipment.  Steps might include stopping the flow of ammonia to a leak point, or using the compressor to suck ammonia away from a leak point. Further response requiring the donning of personal protective equipment would be performed by an outside agency.  All response activities would be directed by the local fire department and the Fresno County Fire Department Hazardous Materials Response Team.\n7.\tPLANNED CHANGES TO IMPROVE SAFETY\nAs of June 22, 2000, the time that this Executive Summary is being submitted, our Risk & Process Safety Management Plan is not complete.  The reason is that in order to do it right a lot of work must be done.  We simply do not have enough qualified employees or resources to meet the initial deadline. Our company operates seasonally and we have found that our ability to allocate managerial and operator resources to prepare this plan depends upon our workload.  In addition, we have found it necessary to obtain help from outside vendors for some critical elements, such as preparing Piping & Instrumentation Diagrams and conducting a Process Hazard Analysis.  These vendors are attempting to meet the requests of numerous facilities such as ours at the same time, and have the same problem of only a limited number of people qualified to carry out the required tasks.  Thus, these vendors are setting completion dates for plan elements that we cannot entirely control.\n\nHowever, we have prepared the following milestones and allotted times for the completion of our plan:\n\n\nMilestone\tAllotted Time\n·\tConduct Offsite Consequence Analysis\tDone\n·\tPrepare RMP*Submit showing status as of 6/21/00\tDone\n·\tCollect Process Safety Information\t30 days - By July 21, 2000\n·"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21615,
      "SummaryText": "n the upright (open) position.  The industry rated release rate for our high-pressure safety relief valve is 57.6 lbs/min.   It is assumed that the leak would continue for 10 minutes until the header pipe was switched over to the backup safety relieve valve. Following industry practice Simonian Fruit Co. relief valves are installed in pairs with a switch over valve.  The discharge is piped to a release point that is remote from the faulty valve, so the valve can be serviced or replaced in an area that is free from the hazard of the ammonia release.  The discharge would be released to the atmosphere, and under this scenario approximately 600 lbs. of ammonia would be released over a time period of about 10 minutes.\n\nThe likelihood of this release scenario is decreased by the fact that our relief valves are set at the ASHRAE 15 standard -- 25% above maximum system pressure.  This safety factor provides sufficient spring force on the valve seat to maintain a tight seal and still allow for setting tolerances, external temperature extremes, and other factors that cause settings to vary.  In addition, we visually inspect our relief valves on a regular basis.\n\nThe EPA program RMP*Comp was used to estimate the distance ammonia would travel before dispersing enough to no longer pose a hazard to the public. This program uses approved data for variables such as wind speed/atmospheric stability class, ambient temperature/humidity, height of release, surface roughness, dense or neutrally buoyant gases, and temperature of released substance.  The RMP*Comp program calculated that the ammonia would travel less than 0.1 miles (unmitigated urban conditions) before dispersing enough to no longer pose a hazard to the public. A map showing the area that would be affected is attached.\n\n4.\tGENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration system at Simonian Fruit Co. is an integral part of the overall business. The system can contain a total charge of u"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21615,
      "SummaryText": "p to approximately 14,500 lbs thuogh we only operate with approximately 9,600 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.\n\nThe ammonia refrigeration system/process is constantly being monitored by our refrigeration operator.  In addition, the system/process is checked weekly by our outside refrigeration contractor who also performs an annual pre-season preventative maintenance review of our system/process equipment.  The high side equipment in our system is controlled by a computer.\n\nWe inform our employees of the dangers of an accidental release of ammonia through quarterly safety meetings.  During these meetings we also discuss the preventative measures to take, such as evacuation, in order to not be affected by a release.\n\nOur ammonia refrigeration system was designed and built by professional refrigeration engineers in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.  It was also built in compliance with the Uniform Building Code and Uniform Mechanical Code applicable at the time of construction.\n\nOur ammonia refrigeration system is equipped with safety relief valves, which are vented to the atmosphere.  These valves limit the operating pressures of the entire system, and prevent failures due to overpressurization.\n\n5.\tFIVE YEAR ACCIDENT HISTORY\nSimonian Fruit Co. has not had any reportable accidents within the last five years.\n6.\tEMERGENCY ACTION PLAN\nThis facility's emergency response program is based on the Cal OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, Emergency Action Plans and Federally Title 29 CFR 1910.38 and 1910.119) and HAZWOPER (standard (in California CCR Title 8, Section 5192, Hazardous Waste Operations and Emergency Response and Federally Title 29 CFR 1"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21615,
      "SummaryText": "Conduct Process Hazard Analysis\tOn or around July 11, 2000\n·\tFinish PHA documentation including Action List\t60 days - By Aug 21, 2000\n·\tPrepare Process Prevention Program elements\t90 days - By Sept 21, 2000\n·\tPrepare Standard Operating Procedures\t90 days - By Sept 21, 2000\n·\tCompile all elements into Risk & Process Safety \nManagement Program, review internally, and submit\t120 days - By Oct 21, 2000\n\n\n \nWe understand our obligations to consolidate our safety activities in a Risk Management Program under the CalARP regulation.  We are committed to preparing and implementing a Risk & Process Safety Management Program according to the above milestone and timeline chart."
    }
  ]
}