{
  "FacilityID": 21635,
  "FacilityName": "RSA MICROTECH",
  "FacilityStr1": "510 E. TRAIL STREET",
  "FacilityStr2": null,
  "FacilityCity": "DODGE CITY",
  "FacilityState": "KS",
  "FacilityZipCode": "67801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20057",
  "LEPC": "Ford County LEPC",
  "FacilityLatDecDegs": "37.750944",
  "FacilityLongDecDegs": "100.011389",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 274702844,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "RSA MICROTECH",
  "OperatorStr1": "510 EAST TRAIL",
  "OperatorStr2": null,
  "OperatorCity": "DODGE CITY",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67801",
  "OperatorZipCodeExt": null,
  "RMPContact": "LLOYD KEENPORTZ",
  "RMPTitle": "CONSULTANT",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171057",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-07-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2015-03-19 00:00:00",
  "AnniversaryDate": "2005-07-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 37.75173,
  "FRS_Long": -100.02166,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30630,
      "AltID": "MICRONUTRIENT PRODUCTION",
      "FacilityID": 21635,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31405,
          "ProcessID": 30630,
          "NAICSCode": "11511",
          "_desc": {
            "NAICS_CODE": "11511",
            "NAICS_DESCRIPTION": "Support Activities for Crop Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40015,
          "ProcessID": 30630,
          "ChemicalID": 57,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540015,
          "ProcessID": 30630,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21635,
      "SummaryText": "\n\n\n\n\n  \nFACILITY POLICY  \n\nThe owner , management and employees operating our facilities are committed to the prevention of any accidental release of hazardous chemicls transported or stored on our locations. In the event that an accidental releese should occur, we are prepared to work with our Local fire Company, Emergency Response Personnel, and other appropriate authorties deemed applicable depending on the specific incident, to best mitigate any, releese and to minmize the impact of the release to people and the enviroment. \n\n\nFACILITY INFORMATION\n\nThe primary activity of our facility is the production of liquid micronutients for crop production.  The raw materilas used in production includes the receiveing, storeage and use of Ammonium Hydroxide CAS# 1336-21-6, which is included in the EPA Risk Management Program.  This raw material is the subject of this plan and their only raw material on the list used at this facility.  The on-site amount of Ammonium Hydroxide is much lower during our off season of July thru Oct.\n\nOur facility has adequete lighting and is inspected daily during use and the \"Off season\".\n\nWORST-CASE RELEASE SCENARIO:\n\nThe worst-case release scenario would be the releese of 50,000lbs. of material over a period of 10 min. before the arrival of the fier department to apply a water fog. The main storage tank is diked so the major release would be vapor of ammonia gas.  This release would be the rupture of the storeage tank or a tornado.\n\n\nALTERNATIVE RELEASE SCENARIO:\n\nWe have not had a release in the past 5 years of Ammonium Hydroxide however the inspection indicated that a broken transfer hose would be the most likely result of any alternative release.\n\n\nACCIDENTAL RELEASE PROGRAM:\n\nOur accidental release program for Ammonium Hydroxide is based on guidelines found in the American National Sandard Institute(ANSI) for the storeage and handling of  Ammonium Hydroxide, and the Occupational Safety and Health Adminstration (OSHA) standard 29 CFR 1910"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21635,
      "SummaryText": ".111 Storage and Handling of Ammonium Hydroxide. Additionally we conduct annual employee training on the safe handling, storage and use of  Ammonium Hydroxide.  We have installed pressure relief valves, dikeing, and a scrubber on the liquid mixer to try to avoid any accidental release of fumes. We also maintain contact with our local fire department and LEPC to update any changes et. in our operations.\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nWe have not had a release of Ammonium Hydroxide within the past five years that has caused death, injuiry or significant property damage at th facility.  To our knowledge we have not caused any offsite death, injury, evacuation, sheltering in place, property damage or envionmental damage. This facility is included in the written Community Emergency Response Plan as prepared by the Local Emergency Planning Committe(LEPC) and the Kansas Emergency Management Agency(KEMA).  We also include these materials in our own Emergency Action Plan in accordance with OSHA 29 CFR 1910.38. We have provided State and Local authorities all communities right to know information,requested as well as that required under SARA Title III (EPRA).  Our written employee saftey programs include pre-emergency planning and employee training in accordance with OSHA standards, and are offered for review at any time by our Local Emergency Planning Committee to ensure that they conform to the community plan.  We actively encourge participation in our Ammonium Hydroxide training program by the local Fire Department, Local Emergency response team, Hazardous Materials responders, Community Planners,etc. that may be expected to respond to an incident at our site.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nSafety improvement is an on-going process at our facility.  Periodic evaluations are peformed to assess the maintenance of safe conditions.  There are no additional specific recommendations for implementation at this time.\n\n\nADDITIONAL INFORMATION:\n\nDue to the computer program no"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21635,
      "SummaryText": "t accepting actual numbers, the lattitude and longitude may not be totally accurate.  For additional information, response to questions, facility tours, or comments, please contact Lloyd Keenportz 1-800-535-7479."
    }
  ]
}