{
  "FacilityID": 21652,
  "FacilityName": "TYSON FOODS, INC. CHICK-N-QUIK",
  "FacilityStr1": "400 WEST OLRICH ST.",
  "FacilityStr2": "PO BOX 900",
  "FacilityCity": "ROGERS",
  "FacilityState": "AR",
  "FacilityZipCode": "72756",
  "Facility4DigitZipExt": "0988",
  "FacilityCountyFIPS": "05007",
  "LEPC": "Benton LEPC",
  "FacilityLatDecDegs": "36.317778",
  "FacilityLongDecDegs": "-94.123306",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6903702,
  "ParentCompanyName": "TYSON FOODS, INC.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": 0,
  "OperatorName": "TYSON FOODS, INC",
  "OperatorStr1": "400 WEST OLRICH ST.",
  "OperatorStr2": "PO BOX 900",
  "OperatorCity": "ROGERS",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72756",
  "OperatorZipCodeExt": "0988",
  "RMPContact": "TRACY EZELL",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 575,
  "OtherEPAFacilityID": "ARE0178634",
  "EPAFacilityID": "100000171164",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-25 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-07-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-07-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-07-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.31868,
  "FRS_Long": -94.12192,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30648,
      "AltID": "99",
      "FacilityID": 21652,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31423,
          "ProcessID": 30648,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40034,
          "ProcessID": 30648,
          "ChemicalID": 56,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540034,
          "ProcessID": 30648,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21652,
      "SummaryText": "\nEPA RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nTYSON FOODS    (Chick-N-Quik; 400 W. Olrich St. 72756)\n\n\n1.  Accidental release prevention and emergency response polices.                                                            To insure safe operation and release prevention at Tyson Foods (Chick-N-Quik; 400 W. Olrich St. 72756), this facility has implemented The Occupational Safety and Health Administrations Chemical Process Safety Management Program 29 CFR 1910.119.  All operators of systems containing the threshold amount of hazardous chemicals will undergo Chemical Process Safety Management training and operator training specific to the system. \nTo insure proper response to emergency situations, Tyson Foods (Chick-N-Quik; 400 W. Olrich St. 72756), has implemented Emergency Action Plans as required by The Occupational Safety and Health Administrations 29 CFR 1910.38(a) and Emergency Response Plans  29 CFR 1910.120. All safety personnel and operators of the process will be trained in these emergency procedures.\n\n2.  The stationary source and regulated substances handled. \n (Brief description of the facility: Chik-N-Quik is a Poultry further processing facility that will be adding ammonia above threshhold quantities on approximately 10 July 2000.                                                             \n (Use of regulated substances: Ammonia for refrigeration)\n \n (Amount of each regulated substance--45,000 pounds.)\n  \n3.  Worst-case release scenario and alternative release scenario(s).\n\n Worst-case scenario. - Failure of high pressure receiver when full releasing  (28,000 pounds) pounds of ammonia in 10 minutes.   The high pressure receiver will  be full only when the entire system is being pumped down for repairs.  This situation  occurs on the average of 2 to 4 times per year.  Therefore, the  possibility of a worst-case scenario will exist only 2% of the time.  The loss of  (28,000 pounds) pounds of ammonia will have a distance of (2.0 miles) before no longer"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21652,
      "SummaryText": " posing a health hazard to the public. \n\nAlternative release scenario - An upset condition resulting in an overpressurization of the ammonia system causing a safety relief valve to discharge 500 pounds of ammonia in 5 minutes.  The loss of 500 pounds of ammonia has a toxic endpoint of 450 feet before no longer posing a health hazard to the public.  The ammonia system is equipped with high pressure cutouts that help to prevent releases of this nature.\n\n\nEPA RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nTYSON FOODS  (Chick-N-Quik; 400 W. Olrich St. 72756).\n\n\n4.  The general accidental release prevention program.                                                                               This facility complies with the Occupational Safety and Health Administrations   Chemical Process Safety Management 29 CFR 1910.119 and the Environmental Protection Agencies Risk Management Program 40 CFR Part 68                                                                                                                                                                   For ammonia systems Tyson Foods, Inc. has adopted the International Institute of Ammonia Refrigeration guidelines for system operation and maintenance.  Tyson Foods Inc. uses the IIAR Basic Ammonia Refrigeration Training Series or its equivalent for all operators.  \n \n5.  Five-year accident history.\nChik-N-Quik has not had a release of reportable quantity in the previous five years. There has not been an accident due to an ammonia release.)\n\n6.   The emergency response program.\nAn Emergency Response Team is currently undergoing training.  This team will be  trained to the Hazardous Materials Responder-Technician response capability in accordance with OSHA 29 CFR 1910.120 (q).  The team will be capable of affecting all control measures (both confinement operations and containment operations) required to remediate an incident.\n\nA written Emergency Response Plan has been developed and is on record at the Facility.  This pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21652,
      "SummaryText": "n includes Pre-Emergency Planning with Outside Agencies, Personnel Roles and Lines of Incident Command Authority, Facility Hazard Analysis and Emergency Prevention, Safe Distances and Places of Refuge, Site Security and Control, Evacuation Routes and Procedures, Decontamination Procedures, provisions for Emergency Medical Treatment, Emergency Notification Procedures, Chemical Response Procedures, Post Incident Critique, and Personal Protective Clothing and Emergency Equipment.\n\n\nEPA RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nTYSON FOODS   (Chick-N-Quik; 400 W. Olrich St. 72756)\n\nAll Hazmat courses at Tyson Foods, Inc., are designed to meet training requirements of the OSHA 29 CFR 1910.120 (q) (7) and (8).  \nAll  (Chick-N-Quik) Hazmat Team Members will be trained 24 hours initially to the Technician level followed by 8-24 hours of refresher training per year under the direction of the on-site Hazmat Instructor at the facility. Each Instructor receives an initial 40 hours of training and 8-16 hours per year re-certification training that goes to I.C. level. \n\nThe training is designed to teach both theory and hands-on training giving the person an overall understanding of the nature of hazardous materials and the ability to assess and safely respond to the incidents in the Incident Command structure.  Technician level  training includes but is not limited to the following:\n? Knowledge of basic hazards and risk assessment techniques\n? Proper selection and use of appropriate and required PPE for the chemical hazard\n? Terminology associated with Hazmat\n? Advanced site control/security procedures\n? Advanced Containment/Control/Decon procedures\n? Use of Atmospheric Monitoring Equipment and Contaminant Test Procedures\n? Incident Command Structure Roles and Line of Authority\n? Interaction with Local and State Officials\n? Standard Operating Procedures for Clean-up and termination \n? Critique\n\nOn Site facility Instructors have completed in excess of 40 hours of Instructor's train"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21652,
      "SummaryText": "ing, achieving the Incident Command level, over the past ___1__ year and have instructed their team in approximately  _24_____ hours of training.  \n\nAll training materials, hands-on drills and response procedures have been developed under the direction of the Corporate Loss Control Department.\n\nAll Team members are taught in Hazard Communication to report any observed chemical leaks/spills and odors to their supervisor or lead person immediately.  Supervisors and Leads are taught to report the above to the Safety or Process Manager immediately for further investigation and action by the Hazmat team.  MSDS information books are accessible to all team members for review.\n     \n7.  Planned changes to improve safety.\n      None"
    }
  ]
}