{
  "FacilityID": 21679,
  "FacilityName": "ATOFINA Chemicals, Inc.",
  "FacilityStr1": "Rte. 63",
  "FacilityStr2": null,
  "FacilityCity": "Piffard",
  "FacilityState": "NY",
  "FacilityZipCode": "14533",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36051",
  "LEPC": "Livingston County LEPC",
  "FacilityLatDecDegs": "42.831944",
  "FacilityLongDecDegs": "-77.846111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2218436,
  "ParentCompanyName": "ATOFINA Delaware, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 622121697,
  "Company2DUNS": 0,
  "OperatorName": "ATOFINA Chemicals, Inc.",
  "OperatorStr1": "P.O. Box 188",
  "OperatorStr2": null,
  "OperatorCity": "Geneseo",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14454",
  "OperatorZipCodeExt": null,
  "RMPContact": "Martin Foess",
  "RMPTitle": "Plant Manager",
  "FTE": 164,
  "OtherEPAFacilityID": "14533PNNWLROUTE",
  "EPAFacilityID": "100000055931",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1991-12-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-07-28 00:00:00",
  "ErrorReportDate": "2000-07-28 00:00:00",
  "ReceiptDate": "2000-07-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-07-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.83147,
  "FRS_Long": -77.8423,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30680,
      "AltID": "Storage- NPCF",
      "FacilityID": 21679,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31455,
          "ProcessID": 30680,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40076,
          "ProcessID": 30680,
          "ChemicalID": 32,
          "Quantity": 74000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 32,
            "ChemicalName": "Propyl chloroformate  [Carbonochloridic acid, propylester]",
            "CASNumber": "109-61-5",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540076,
          "ProcessID": 30680,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21679,
      "SummaryText": "Introduction\n\nThis Executive Summary describes key elements of the plant's Risk Management Plan, how the employees of our plant strive to protect and maintain the well-being of employees, neighbors, and the community.  We believe it is a comprehensive plan, developed and continually improved over more than 45 years of operation.  However, it is recognized that there may exist a remote possibility that an unforeseen emergency event could occur.  Accordingly, our RMP describes what could theoretically happen in such an event.   This summary is organized as follows:\n\nIntroduction; \nATOFINA Chemicals, Inc. Policies for Health, Environment, and Safety;\nFacility Identification and regulated substances in covered processes;\nHazard Assessment; \nPrevention Program; \nFive-Year Accident History; \nEmergency Response Plan; and\nPlanned Changes to Improve Safety.\n\nATOFINA Chemicals, Inc. Policies for Health, Environment, and Safety\n\nRisk management and safety have been important concerns at ATOFINA Chemicals for many years;  this RMP formalizes and documents these activities.  We are committed to conducting our operations in a safe, responsible manner and to reducing risks to health and the environment.  \n\nThis commitment to health, environment, and safety starts with the Chief Executive Officer (CEO).  Senior management routinely dedicate time to a review of HES matters, including safety.  This emphasis on safety is carried through to the facility level, where the Plant Manager and the Safety Committee regularly review safety performance, take corrective actions, and strive for continuous improvement.  The success of ATOFINA's HES programs is also reflected by a strong commitment to safety by employees and contractors. \n\nATOFINA Chemicals, Inc.'s HES programs include policies, procedures, standards, and guidance materials designed to fulfill its commitment to health, environment, and safety.  These materials include Risk Management Program guidance to help our facilities prevent "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21679,
      "SummaryText": "and/or reduce the risk of accidents. \n\nOur plant keeps health and safety in the forefront of all our activities.  In issues related to emergency response, ATOFINA Chemicals works with the Livingston County Local Emergency Planning Committee (LEPC) to plan responses to emergencies and to assist the Plant Emergency Organization (PEO) in actual response efforts as and if needed.  These emergency plans are reviewed with the LEPC, and other local emergency responders like the fire and police departments, and hospitals.  Our plant's Community Advisory Panel (CAP) was started in early 1998 to inform the community about our plant and related activities and address questions or concerns. \n\nATOFINA Chemicals, Inc. also takes pride in our commitment to protect the environment.  We are dedicated to continuous reduction of waste, and have a comprehensive program called AWARE (Atochem Waste and Release Elimination) designed to promote recycling and waste minimization. \n\nATOFINA is also part of Responsible Care?, an industry-wide initiative among members of the Chemical Manufacturers' Association.  Through Responsible Care, our industry demonstrates its continuing commitment to health, safety, and the environment.\n\nFacility Identification and Regulated Substances in Covered Processes\n\nThe ATOFINA Chemicals, Inc. Geneseo facility, located on Route 63 in Piffard, New York, is proud to be a part of the Genesee Valley community.  Our company is dedicated to achieving the safe manufacture of high-quality products and the continuing protection of the environment.  The Geneseo plant produces organic peroxides that are used primarily in the production of  acrylics, elastomers, low density polyethylene (LDPE), polyesters, polystyrene, and polyvinyl chloride (PVC).  Many common plastic products such as automobile components, toys, food packaging, etc., are manufactured with the chemicals produced at the Geneseo plant. \n\nATOFINA uses one of the substances regulated under 40 CFR Part 68, the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21679,
      "SummaryText": "EPA Risk Management Program (RMP) Rule, above the minimum threshold for RMP applicability.  This listed chemical is normal-propyl chloroformate, or NPCF, and the threshold quantity is 15,000 pounds, or about 1,650 gallons.  Since our plant stores a maximum of 8,100 gallons of this material, an RMP is required to be filed with the EPA.   NPCF is used as a process ingredient to make a product used in the manufacture of some of the plastics described above. \n\n                                                                                         \nHazard Assessment\n\nThe EPA regulation specifies that facilities include in their RMP an analysis of a hypothetical worst case accident (one where all safety systems are assumed to fail at the same time), and a hypothetical alternative accident (one that supposes more realistic conditions).  At ATOFINA, the hypothetical worst case scenario would result from a total release of the contents of our storage tank of NPCF.   A more realistic hypothetical alternative accident scenario would be a leak from a pipeline.  \n \nWorst Case Scenario\nThe hypothetical worst case accidental release scenario would be the release of the entire NPCF storage tank.  NPCF is received as a liquid in isocontainers and unloaded into a dedicated storage tank, which can store up to approximately 9,000 gallons.  Administrative controls limit the NPCF quantity to a maximum of 8,100 gallons.  This quantity was assumed to be released over 10 minutes.   Engineering controls to support the administrative control include a high-level alarm at 90%, or 73,700 pounds.  \n\nFor a Hypothetical Worst Case Scenario to occur, all of these would have to happen:\nEverything held in tank is released\nAll of the chemical is released very quickly\nAll safety controls fail at once\nThere is no strong wind or moderate breeze to quickly dilute the vapors\nNo mitigating action is taken.\n\nThis amount if released under these improbable simultaneous conditions would potentially create a cl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21679,
      "SummaryText": "oud of chemical vapor near the ground that has the potential to travel away from the plant in the direction of the wind.  Hazard assessment modeling shows that, under hypothetical worst-case weather conditions, the hypothetical worst-case release would produce a NPCF plume that could travel up to 3.1 miles before dispersing enough to no longer pose a hazard to the public.  EPA and experts acknowledge that the possibility of this kind of event is extremely remote. \n\nThe multiple layers of preventive measures in effect at the plant make it very unlikely that a significant release of NPCF would occur.  These accident prevention measures are discussed later in this summary.  In addition, in the unlikely event that a release would occur, ATOFINA has an array of mitigation measures to reduce any potential impacts.  Passive mitigation measures include diking which limits the spread of NPCF and, consequently, the release impact.  \n\nActive mitigation systems cannot be considered in modeling worst case scenario impacts, but the significant investment that ATOFINA has made in active mitigation measures should effectively reduce the risk associated with an RMP incident.  These include:\n1.  The diking area is located near a chloroformate waste pretreatment system, which is designed and operated to neutralize any spilled NPCF with caustic, thus preventing the release of NPCF vapors.   \n2.   NPCF tank system is under observation to detect any problems, including operator, supervisor and/or watchman visual inspections (several times daily); and both local and control room indicators for tank levels, nitrogen blanket pressure high and low readings, high temperature readings.\n3.  Shutoff valves can be activated remotely to isolate the tank if necessary.\n\nHazard Assessment- Alternate Case Scenario\n\nThe hypothetical Alternate Case Scenario analysis is based on a leak in a pipeline connecting the NPCF storage tank to the production building.  The chemical release would happen more slowl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21679,
      "SummaryText": "y, safety controls would be operating, and typical weather and wind conditions would exist to dilute vapors.  In this hypothetical accident, there is the potential for 75 gallons of NPCF to be released onto the ground outside the production building.  This release would be expected to go about 0.2 miles, which does not extend beyond the plant property. While this hypothetical accident is more realistic than the worst case, it is still unlikely. \n\nAccidental Release Prevention Program \n\nAt ATOFINA we take handling of chemicals and plant safety very seriously.  We use a variety of safety equipment and written procedures to maintain the integrity of our processes, prevent releases and reduce the impact should releases occur.  In fact, this NPCF storage system is also regulated by the Federal Occupational Safety and Health Administration (OSHA)'s Process Safety Management (PSM) standard (29 CFR 1910.119) as well as EPA's RMP regulations.  \n\nSpecific Accident Prevention Measures We Take in the Case of Normal-Propyl Chloroformate (NPCF):\n\nWe DESIGN for Safety:\n\n NPCF tank is in secondary containment.  If a spill occurred, the entire contents should stay in a dike.\n Automatic high level alarms and shutoffs are installed to prevent tank overfilling.\n The tank is filled to no more than 90% capacity, as additional protection against overfilling. \n Pressure/safety devices are installed so that the tank cannot be over/under pressurized.\n Shutoff valves can be activated remotely to isolate the tank if necessary.\n During tank filling, the unloading trailer is staged in an contained area large enough to hold the entire trailer contents.\n Sewers in the vicinity of the tank can be used if necessary to convey spillage to a pre-treatment system capable of treating NPCF.\n Pre-startup safety reviews are conducted prior to startup of new or modified NPCF equipment.\n Team of trained personnel conducts Process Hazard Analyses at least every 5 years.\n\nWe strive to OPERATE Safely:\n We have e"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21679,
      "SummaryText": "stablished written safe operating limits for the process using NPCF.\n Safety reviews are conducted for proposed process changes.\n We have detailed unloading, operating and maintenance procedures.\n Operators are trained and certified per OSHA requirements.\n Unloading procedure requires two trained operators to monitor activities.\n Operators continuously monitor the process.\n Experienced Chemical Engineers are on staff for troubleshooting if required.\n Written operating and emergency shutdown procedures are regularly reviewed and updated.\n Contractor Safety Program trains outside workers in plant safety rules/procedures.\n\nWe work to MAINTAIN Safe Operations:\n\n NPCF tank was thoroughly inspected in 1997 and is periodically reinspected internally and externally.\n A mechanical integrity program is in place for preventive/predictive maintenance.\n Routine visual inspection of equipment is done by supervisory personnel.\n Maintenance personnel are trained and highly skilled.\n We investigate accidents/ incidents and implement corrective actions as appropriate. \n Critical equipment, including tanks, relief devices, hoses, piping, instruments and shutdown system is regularly tested/ inspected to verify proper operation.\n Facility and Corporate safety assessments are conducted.\n Periodic regulatory inspections are conducted.\n\nFive Year Accident History\n                                                                                                                                                       \nThere have been no RMP off-site releases of NPCF from our plant for the past five years.   \n                                                                                                                                                     \nEmergency Response Plan\n\nA written emergency response plan is maintained at the facility.  The plan was developed in cooperation with local authorities and was coordinated with the community emergency response plan.\n\nThe emergency response plan"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21679,
      "SummaryText": " and crisis communication plan include procedures for notifying local authorities and the public in the event of an incident.  The ERP also includes documentation of proper first-aid and medical treatment necessary to treat accidental human exposures;   procedures for the use of emegrency response equipment and for its inspection and testing;  a description of the training program for all employees in relevant emegency response procedures;  and procedures for review and update, as appropriate, of the emergency response plan to reflect changes at the facility, and to ensure employees are informed of these changes.    Highlights of our ERP follow:\n\n Written Site Emergency Action plan utilizes Incident Command System (a recognized standard for managing emergencies).\n Twenty-four-hour annual training for plant's emergency response team is conducted at off-site training facility (Livingston County's facility in Hamptons Corners)\n On-site emergency response team.  These persons are trained at the Haz-Mat technician level\n First-aid trained personnel on each shift. Plant Nurse on-site on day shift.\n Emergency response and first aid drills are periodically conducted and critiqued.\n Emergency Response Trailer with Haz-Mat equipment is maintained ready on-site.\n\n\nPlanned Changes to Improve Safety\n\nA recent Process Hazard Analysis revalidation audit was conducted for the process building utilizing NPCF.  No corrective actions or improvements were noted to be needed for the NPCF tank system.  \n\nChemical safety has been a part of the working culture at the facility for many years.  Chemical exposure risks to employees and the public have been minimized through ongoing internal risk reduction efforts as well as regulatory requirements. \n\n* ATOFINA Chemicals, Inc.'s has received a \"Notice of Complete Application\" for a Title V draft permit, but has not yet obtained a Title V Operating Permit Number for inclusion into the RMP Submit software."
    }
  ]
}