{
  "FacilityID": 21678,
  "FacilityName": "CH Resources, Beaver Falls",
  "FacilityStr1": "3 Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Beaver Falls",
  "FacilityState": "NY",
  "FacilityZipCode": "13305",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36049",
  "LEPC": "Lewis County LEPC",
  "FacilityLatDecDegs": "43.885611",
  "FacilityLongDecDegs": "-75.434556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CH Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ed Jordan",
  "OperatorStr1": "P.O. Box 69",
  "OperatorStr2": "3 Main Street",
  "OperatorCity": "Beaver Falls",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13305",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": "NY0000559187",
  "EPAFacilityID": "100000171226",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "6232000018",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-07-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-07-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-07-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 43.88611,
  "FRS_Long": -75.43417,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30679,
      "AltID": "SCR Ammonia System",
      "FacilityID": 21678,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 40075,
          "ProcessID": 30679,
          "ChemicalID": 57,
          "Quantity": 20005.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31454,
          "ProcessID": 30679,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 11877,
              "Process_NAICS_ID": 31454,
              "SafetyReviewDate": "2000-05-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "API-620, NYCRR Title V Subchapter D Part 599",
              "FR_Comments": null,
              "HazardReviewDate": "2000-04-27 00:00:00",
              "ChangeCompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Human Error",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Off-Load Containment",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-04-01 00:00:00",
              "TrainingReviewDate": "1998-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-11-01 00:00:00",
              "EquipmentTested": "Tank Inspection",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Selective Catalytic Reduction (SCR) Ammonia System",
              "_chemicals": [
                {
                  "PrimaryKey": 12432,
                  "PreventionProgram2ID": 11877,
                  "ProcessChemicalID": 40075
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21678,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2000-05-01 00:00:00",
    "ERTrainingDate": "2000-02-19 00:00:00",
    "CoordinatingAgencyName": "Lewis County LEPC",
    "CoordinatingAgencyPhone": "3153765305",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21678,
      "SummaryText": "INTRODUCTION\nCH Resources, Inc. owns and operates a combined cycle power generation facility in Beaver Falls, New York. The plant utilizes aqueous ammonia in a 30% concentration for use in ifs Selective Catalytic Reduction (SCR) system located within the HRSG to reduce nitrogen oxide (NOX) emissions from the combustion turbine exhaust gas.\n\nThe 30% aqueous ammonia injected into the HRSG is stored in a 9980 gallon vertical storage tank surrounded by a containment dike capable of containing the entire contents of the storage tank and related piping. No more than 8740 gallons of aqueous ammonia are stored on site at any time including that maintained within the piping system. The aqueous ammonia is pumped from the storage tank to an ammonia skid located within the building. The aqueous ammonia is vaporized in an electric heater at the skid. Subsequent to vaporization, the ammonia is mixed with air and then blown to the injection grid. The grid is a simple pipe system with outlets inside the HRSG.\n\nThe generating plant is subject to U.S. EPA regulations governing Accidental Release Prevention Requirements: Risk Management Program under Section 112(r) of the Clean Air Act (40 CFR Part 68). This Risk Management Plan (RMP) has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G. This RMP certifies that CH Resources, Inc. has instituted a Risk Management Program at the Beaver Falls Generating Plant that is in compliance with U.S. EPA Accidental Release Prevention requirements.\n\nThe RMP includes an Executive Summary and Data Elements following the formal published by U.S. EPA In addition to identifying the applicable corporate policies and risk management systems, the RMP identifies a set of worst case and alternative release scenarios, the potential off?site consequences of those releases, and the facility's five?year accidental release history. This RMP certifies that prevention and emergency response programs are in place so as to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21678,
      "SummaryText": "minimize risks to workers and the potentially affected public.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe ammonia tank and piping system have been designed and constructed to meet the requirements of ASME Section 8, Pressure Vessel, and ASME B31.1 respectively. In addition, CH Resources has implemented operating procedures, training, maintenance, and emergency response procedures to ensure the risks associated with plant operations are minimized and employees, nearby populations, and the environment are protected.\n\nCH Resources has also implemented environmental programs and procedures to ensure compliance with all environmental regulations. These programs and procedures, maintained in manuals at the facility, are kept up?to-date and available to all plant personnel. The program consists of the environmental permits and plans required to operate the facility.\n\nThe plant manager has overall responsibility for maintaining the risk management program. Safety information is maintained at the facility. Operating procedures have been implemented at the facility and address the possible conditions of the ammonia system. A maintenance program is in place and consists of maintenance procedures, testing and inspection schedules, and a work log system that tracks work and inspections performed on the ammonia system.  Hot works procedures, along with other hazards permits (Tagout, etc.) exist at the facility and are applicable to all plant work. Contractors working on the ammonia system or any facility equipment1systern are required to comply with the facility's contractor safety program.\n\nAll personnel must complete initial and refresher training on procedures applicable to their position. All operators and maintenance personnel undergo a qualification process which addresses ammonia system operating procedures and/or maintenance procedures along with emergency response training. Administrative personnel must undergo emergency response training.\n\nCompl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21678,
      "SummaryText": "iance audits are conducted on a biannual basis. These audits consist of a risk management program audit and a safety review of the ammonia system. The program audit reviews the risk management program and procedures to ensure the program is being implemented. The ammonia system safety review consists of an audit of the ammonia system and operating procedures and interviews with plant personnel to ensure that the ammonia system is designed and operated in accordance with the appropriate safety information.\n\nEmployees are included in hazard reviews and incident investigations. In addition, employees participate in regular safety meetings and attend annual training in emergency response and ammonia safety.  CH Resources' has Implemented incident investigation procedures at the Beaver Falls generating plant.\n\n\nPROGRAM LEVEL IDENTIFICATION \nThe Beaver Falls generating plant has not had an accident or off?site release of ammonia. However, the \"worst case' release, as defined by the EPA, results in concentrations at public receptors that exceed ft toxic endpoint for aqueous ammonia listed in Part 68 Appendix A. Aqueous ammonia is not subject to the OSHA PSM standard nor is the process listed among the nine NAJCS codes. Thus, the Beaver Falls generating plant aqueous ammonia process is subject to Program 2. ,\n\n\nHAZARD ASSESSMENT \nA hazard assessment has been completed to comply with the RMP regulations. The hazard assessment consists of analyzing the effects of a worst case scenario and an alternate release scenario The worst case release scenario incorporated EPA prescribed worst case modeling assumptions with an instantaneous release of 8740 gallons of 30% aqueous ammonia into the secondary containment dike of 379 square feet The EPA RMP Comp Model was used to determine the endpoint distance. This model estimated the distance to the endpoint to be 0.1 miles or less from the source. 12 residential homes with population of approximately 40 people and one industrial facility"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21678,
      "SummaryText": " are located within this endpoint range. This scenario does not consider the mitigation actions that may be performed by plant personnel and outside emergency response agencies.\n\nAn alternative release scenario was also analyzed The alternative release scenario developed included a.25 inch diameter hole in an ammonia fine which lasts for one hour. This release model did not include secondary containment. The scenario may also represent a leak from a delivery hose or a crack in a valve. The same model was used to determine off site impacts. The EPA RMP Comp Model determined the endpoint to also be 0. 1 miles or less from the source for the alternative release scenario. The 60 minute time period for the release duration is based upon plant mitigation capabilities and Beaver Falls Fire Department response times and capabilities.\n\n\nEMERGENCY RESPONSE\nThe Beaver Falls generating plant maintains a written emergency response program, which is in place to protect facility personnel and public safety, as well as the environment. The program consists of procedures for responding to an aqueous ammonia leak at the site. The program addresses all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans, accountability for all personnel in an emergency, notification of outside agencies and the public, and clean?up and decontamination. In addition, the plant has written procedures for inspecting and maintaining emergency response equipment All maintenance and operations personnel are trained annually to the Hazardous Materials First Responder Operations Level.\n\nThe overall emergency response program for the Beaver Falls generating plant is coordinated with the Lewis County LEPC. This coordination includes; periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives. The facility has communications capability with appropriate LEPC officials and "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21678,
      "SummaryText": "emergency response organizations to facilitate public protection and quick response to an emergency at the facility. In addition, periodic drills that involve local emergency response agencies are conducted at the facility and the facility provides the Beaver Falls fire department with access to the plant for preplanning and hazard assessment purposes.\n\n\nFIVE YEAR ACCIDENT HISTORY\nThe Beaver Falls generating plant has an excellent record of accident prevention and there have been no reportable accidents over the past 5 years involving the release aqueous ammonia."
    }
  ]
}