{
  "FacilityID": 21726,
  "FacilityName": "Apio, Inc.",
  "FacilityStr1": "41646 Road 62",
  "FacilityStr2": null,
  "FacilityCity": "Reedley",
  "FacilityState": "CA",
  "FacilityZipCode": "93654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.552889",
  "FacilityLongDecDegs": "-119.436139",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 964905897,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Apio, Inc.",
  "OperatorStr1": "4595 W. Main",
  "OperatorStr2": null,
  "OperatorCity": "Guadalupe",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93434",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155976",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-08-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-08-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.54687,
  "FRS_Long": -119.43496,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30755,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 21726,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 40225,
          "ProcessID": 30755,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31535,
          "ProcessID": 30755,
          "NAICSCode": "111339",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17025,
              "Process_NAICS_ID": 31535,
              "SafetyReviewDate": "2000-07-25 00:00:00",
              "PHA_Date": "2000-07-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-07-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Change Preventative Maintenance Procedures",
              "OpProceduresReviewDate": "2000-04-24 00:00:00",
              "TrainingReviewDate": "1999-04-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "RETA",
              "MaintenanceReviewDate": "1998-03-02 00:00:00",
              "EquipmentInspectionDate": "2000-05-01 00:00:00",
              "EquipmentTested": "Screw Compressors",
              "ChangeMgmtDate": "2000-05-31 00:00:00",
              "ChangeMgmtReviewDate": "2000-07-19 00:00:00",
              "PreStartupReviewDate": "2000-06-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-07-19 00:00:00",
              "HotWorkPermitReviewDate": "2000-07-19 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-07-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24825,
                  "PreventionProgram3ID": 17025,
                  "ProcessChemicalID": 40225
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21726,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-07-19 00:00:00",
    "ERTrainingDate": "1998-09-14 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21726,
      "SummaryText": "Risk & Process Safety Management Program\n\n\n\nPreface - Executive Summary\n\nfor\n\nApio, Inc.\n41646 Road 62\nReedley, California 93654\n(559) 591-0632\nFAX (559) 591-7755\n\n\n\n\nEPA Facility ID#:  1000 0015 5976 19993\n\n\n\n\nJuly, 19 2000\n\n\n\n\n\n\n\nPrepared by:\n\nSolutions Environmental Health & Safety, Inc.\n6687 N. Blackstone Avenue, Suite 103\nFresno, California 93710\n559-435-4244\nwww.SEHS-Inc.com\n \nTable of Contents for Preface - Executive Summary\n\n1.\tTHE  APIO, INC., RISK & PROCESS SAFETY MANAGEMENT PROGRAM\t1\n2.\tDESCRIPTION OF AMMONIA SYSTEM\t1\n3.\tAMMONIA RELEASE SCENARIOS\t2\n3.1\tWORST CASE SCENARIO\t2\n3.2\tALTERNATIVE CASE SCENARIO\t2\n4.\tGENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\t3\n5.\tFIVE YEAR ACCIDENT HISTORY\t3\n6.\tEMERGENCY ACTION PLAN\t3\n7.\tPLANNED CHANGES TO IMPROVE SAFETY\t4\nAPPENDIX A: OFFSITE CONSEQUENCE ANALYSIS MAPS\nAPPENDIX B: RMP*SUBMIT PRINTOUT\nAPPENDIX C: LETTERS OF CERTIFICATION\n\n \nLiving Document Approach To Regulatory Compliance\n\nThis program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5 and the California Process Safety Management Program, CCR Title 8, Section 5189 as enforced by the local Certified Unified Program Agency and the Fed/EPA.  \n\nThis program is intended to be a living document.  As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible. To accomplish this elements have been organized in a way which is consistent with the corporate organization, how frequently different elements are accessed, and who needs to refer to the program.  The order of elements within this organization is not the same as they are listed in the regulations, and in some cases portions of elements may be found in more than one location.  Therefore, for the purposes of auditing and regulatory review the following table is provided to provide concordant information regarding the program and the required regulatory"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21726,
      "SummaryText": "fe Operating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.  \n\t\nThe Risk & Process Safety Management Program documentation forms and company policy forms pertaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Our operator assisted in the writing of Standard Operating Procedures, and they are presented in a format that is easy to use.  \n\nFor the future, Apio, Inc. now thinks of the Risk & Process Safety Management Program as a living document.  It is an interactive framework that guides safe action for Apio, Inc. employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program Apio, Inc. will continue to profit while maintaining overall plant, worker and public safety."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21726,
      "SummaryText": "elements. \n1.\tTHE  APIO, INC., RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees, that Apio, Inc. has prepared a unified Risk & Process Safety Management Program.  The program is in compliance with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68), and California OSHA's Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials, and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system. \n\nOur program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety.  We have: (1) prepared a unified program based on the PSM plan to meet CalARP obligations as well; (2) reorganized the program so that it meshes more closely with general Apio, Inc. business practices; and (3) reviewed plan documentation forms and responsibilities.  The unified Risk & Process Safety Management Plan sets forth rules, procedures and practices that will help our employees protect themselves and our neighbors.\n\n2.\tDESCRIPTION OF AMMONIA SYSTEM\nThe Apio, Inc. facility is a commercial packinghouse for deciduous tree fruit - apricots, nectarines, peaches, plums, grapes, and kiwi fruit.  The fa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21726,
      "SummaryText": "cility has an ammonia system that provides refrigeration capacity to five cold rooms equipped with forced air cooling for cooling fruit.   Apio, Inc. has one ammonia mechanical room with a total system charge of 26,000 lbs.  Each of our cold rooms have stored palleted product.  We also have an older system that runs on freon.  We have a little more than 1,000 lbs of freon at the site at any given time, so we are only doing a level 3 RMP/PSM for ammonia.  \n\nHigh pressure liquid from a high pressure receiver is piped to a series of a liquid feed solenoid valves.  From there, high pressure liquid is piped to each cold room, where it passes through an expansion valve into a low pressure accumulator vessel mounted on the outside walls of the rooms.  Low temperature liquid circulates by thermal convection through the evaporator coils located behind bunker walls in the cold rooms.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line.  The suction line returns the vapor to one of two primary accumulator vessels located in the engine room, which separates any residual liquid from the gas.  The gas is piped to screw compressors which elevate the temperature and pressure of the gas.  The high pressure discharge from the compressor is sent to water cooled evaporative condensers where the high pressure gas ammonia is liquified and returned to the high pressure receiver. Liquid separated from the suction return gas in the primary accumulator vessels drains into a liquid transfer vessel.  Operation of a float switch activated solenoid valve raises the pressure in the liquid transfer vessel to the point the liquid can be drained into the high pressure receiver. \n\nThe facility was built by professional refrigeration engineers in accordance with standards applicable at the time of construction.  It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21726,
      "SummaryText": "of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to a water diffusion tank if the pressure in the system exceeds their set point.  In addition, ammonia detectors are located in selected areas of the facility, and will shut down equipment if ammonia is detected.  Lastly, an emergency dump box contains switches and valves to turn off equipment and vent ammonia if necessary.\n\nThe ammonia system at this facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected.  Therefore, the facility is treated as a single process.\n\n3.\tAMMONIA RELEASE SCENARIOS\n3.1\tWorst Case Scenario\nAt Apio, Inc., the worst case scenario is the failure of our high-pressure receiver.  This vessel can contain up to 26,000 lbs. of ammonia.  Following the instructions set forth in EPA's Risk Management Program Guidance for Ammonia Refrigeration (40 CFR Part 68), we considered the failure of one vessel.  We did not include any liquid ammonia in the piping that connects to the failed vessel.  Under this scenario, the release would not be passively mitigated by the fact that the primary receiver vessel is outside.  The ammonia would be released over a ten-minute period. \n\nUsing RMP*Comp we estimate that the ammonia would travel 2.9 mile (rural conditions) before dispersing enough to no longer pose a hazard to the public.  The potentially affected area can be found on a site map in Appendix A. \n\n3.2\tAlternative Case Scenario\nOur ammonia refrigeration system is equipped with safety relief valves.  These valves limit the operating pressures of the entire system, and prevent failures due to over pressurization.  Our alternative release scenario is as follows.  A high-pressure safety relief valve lifts and fai"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21726,
      "SummaryText": "ls to reseat.  The rated release rate for our high-pressure safety relief valve is 70 lbs./min.  We assume the leak would continue for 10 minutes until the header pipe was switched over to the backup safety relieve valve. Following industry practice, our relief valves are installed in pairs with a switch over valve, and the discharge is piped to a release point that is remote from the valve. Under this scenario 700 lbs. of ammonia would be released over a time period of 10 minutes. \n\nUsing RMP*Comp we estimate that the ammonia would travel less than 0.2 miles (rural conditions) before dispersing enough to no longer pose a hazard to the public. The potentially affected area can be found on a site map in Appendix A.\n\n4.\tGENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration systems at the  Apio, Inc. facility are an integral part of the overall business.   The system contains a total charge of approximately 26,000 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.\n\nOur refrigeration personnel monitor the ammonia refrigeration system/process and keep an active journal of all procedures and transactions that pertain to ammonia.  In addition, the system/process is checked frequently by our outside refrigeration contractor who also performs preventative maintenance reviews of our system/process equipment upon request.  Our system/process is controlled by a computer which monitors many process variables and allows remote control.  In the event of a system upset the computer actuates a dialing program that alerts key personnel and responders.\n\nOur ammonia refrigeration system was designed and built by professional refrigeration engineers in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.  It was also"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21726,
      "SummaryText": "built in compliance with the Uniform Building Code and Uniform Mechanical Code applicable at the time of construction.\n\n5.\tFIVE YEAR ACCIDENT HISTORY\nApio, Inc. has not had any reportable accidents within the last five years.\n\n6.\tEMERGENCY ACTION PLAN\nThis facility's emergency response program is based on the Cal/OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, Emergency Action Plans.  Federally, Title 29 CFR 1910.38 and 1910.119), HAZWOPER (standard (in California CCR Title 8, Section 5192, Hazardous Waste Operations and Emergency Response, and Title 29 CFR 1910.120). \n\nStrategically, we will respond defensively to a release.  Under this plan our ammonia refrigeration personnel will take whatever steps are necessary to bring a release under control. The first priority will be to operate the ammonia system to bring a release under control safely, from a distance, without donning personal protective equipment. To better prepare for this type of action, initial training to the defensive level (First Responder, Operations Level) as defined in the HAZWOPER regulations has taken place this past year. All response activities would be done in coordination with the local fire department and the Fresno County Fire Department Hazardous Materials Response Team. \n\n7.\tPLANNED CHANGES TO IMPROVE SAFETY\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and public safety.  Nevertheless, Apio, Inc. continually strives to improve in all areas, including safety.  Preparation of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\n\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with Apio, Inc. business practices rather than the order presented in the law.  Thus, Sa"
    }
  ]
}