{
  "FacilityID": 21749,
  "FacilityName": "Butler Warner GPlant",
  "FacilityStr1": "1723 State Road-Custer Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Fayetteville",
  "FacilityState": "NC",
  "FacilityZipCode": "28301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "35.098611",
  "FacilityLongDecDegs": "-78.829444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "AB",
  "FacilityURL": "www.faypwc.com",
  "FacilityEmailAddress": "reggie.wallace@faypwc.com",
  "FacilityDUNS": 80887367,
  "ParentCompanyName": "PWC-Fayetteville",
  "Company2Name": null,
  "CompanyDUNS": 80887367,
  "Company2DUNS": 0,
  "OperatorName": "PWC",
  "OperatorStr1": "1723 State Road-Custer Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Fayetteville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28301",
  "OperatorZipCodeExt": null,
  "RMPContact": "Reggie Wallace",
  "RMPTitle": "Plant Superintendent",
  "FTE": 33,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128961",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "03029-R7",
  "SafetyInspectionDate": "1998-09-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-08-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-08-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-08-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-07-16 00:00:00",
  "DeRegistrationEffectiveDate": "2004-12-01 00:00:00",
  "AnniversaryDate": "2005-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.0429,
  "FRS_Long": -78.824,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30813,
      "AltID": "Ammonia Refrigerant",
      "FacilityID": 21749,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31604,
          "ProcessID": 30813,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40311,
          "ProcessID": 30813,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540311,
          "ProcessID": 30813,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21749,
      "SummaryText": "RISK MANAGEMENT PROGRAM\nFOR\nBUTLER WARNER GENERATION PLANT\n\n\nEXECUTIVE SUMMARY\n\nRevision 1 to June 1999 submittal\n\nThis Executive Summary for the Risk Management Program for the Butler Warner Generation Plant (BWGP) conforms to Sections 68.155 through 68.185.  Referenced documents, such as the PWC Comprehensive Emergency Management Plan, Process Safety Management Plan, Spill Prevention, Containment and Countermeasures (SPCC) and Oil Pollution Act of 1990 (OPA 90) plans are maintained at BWGP) for inspection by authorized individuals.\n\nDescription of the Facility\n\nThe BWGP is located on SR 1723 (Custer Ave.), Fayetteville, North Carolina.  It employs about 33 employees.  The plant site is rurally situated about four miles northeast of the city of Fayetteville area and approximately 1.5 miles east of the Cape Fear River.\n\nBWGP is an intermediate peaking electrical generating facility consisting of eight gas turbine generating units (2 simple and 6 combined cycle) rated at 28.5 MW each, burning natural gas as the primary fuel, with #2 fuel oil as a backup.  In addition, there is a Thermal Energy Storage (TES) Unit, cooling tower, and various support buildings and structures located at the site.  With anhydrous ammonia as refrigerant and ice as the thermal storage medium, the TES increases output by cooling the air entering the turbines that generate electricity.\n\nAnhydrous ammonia (AA) is a cryogenic utilized as a cooling agent within  the refrigeration system that makes the ice.  It is a chemical made up of one part nitrogen and three parts hydrogen.  The physical and chemical properties of this chemical make it one of the most potentially dangerous chemicals on the market.  Anhydrous means without water.  When AA contacts water, it rapidly combines with the moisture and forms ammonium hydroxide.  If the liquid or gas contacts body tissue, especially the eyes, skin and respiratory tract, it will remove the water and cause dehydration, cell destruction and severe chemi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21749,
      "SummaryText": "cal burns.  Victims exposed to even small amounts of ammonia may require immediate treatment to avoid permanent injury.\n\nPrevention and Emergency Response Policies\n\nIt is the policy of the Butler Warner Generation Plant (BWGP) to prevent accidental releases through the use of thourough preventive maintenance programs,including testing, calibrations, routine maintenance, inspections, replacement of equipment as necessary and training personnel.  A work order system is in place for any employees to formally report deficiencies and their status.\n\nBWGP's overall policy is to provide a safe environment for all employees, contractors, visitors and neighbors.  This extends to the design, training, and implementation of a programs, which result in saving lives and reducing property damage during an emergency.\n\nIt is also our policy to operate in an environmentally responsible manner consistent with  policies, procedures and regulations that best serve the needs of employees, the community, and the company.  Operations of the BWGP are designed so as not to adversely affect the environment of the surrounding area during emergency situations or normal operating periods.\n\nIt is the intent of all our employees to prevent all emergencies from ever occurring.  However, should an event occur, the immediate goal is to keep the emergency and its effects within facility boundaries and not allow it to present a threat to the general public. Preserving life is the prime consideration, so all procedures will be carried out in a manner as to minimize the risk to all employees and emergency response personnel.  Rescue and medical activities have priority over all other actions.\n\nIt is the emergency response policy of the facility to immediately notify Cumberland County Emergency Management Agency, LEPC, and the SERC of an accidental release of anhydrous ammonia in excess of 100 pounds.  The Fayetteville Fire Department will be contacted if an ammonia alarm indicates a concentration that ex"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21749,
      "SummaryText": "ceeds 300 ppm.  PWC Employees are not trained to respond and remediate ammonia releases.  If possible, employees are allowed to eliminate the release source (i.e. closing valves, shutting down pumps, etc.) or contain the release.  \n\n\n\nRelease Scenarios: Alternative/Worst Case\n\nBoth case scenarios were developed using ALOHA 5.2.1.  This model is listed in 40 CFR Part 51, Appendix W as an acceptable EPA Guideline Model.\n\nWorst-Case \n\nThe following charts summarize the worst-case scenarios.\n\nMaterial Identification    Anhydrous Ammonia\nQuantity 21,684 pounds\nProcess/Storage Conditions Tank; gaseous\nTopography Urban\nToxic Endpoint 1.6 miles\nMeteorological Conditions1.5m/sec\nAdministrative Limitation\nPublic and Environmental Receptors    No\nGround Composition\nAmbient Temperature 77F\nRelease Duration    10 minutes\n  \n\nAlt-Case \n\nThe following charts summarize the worst-case scenarios.\n\nMaterial Identification    Anhydrous Ammonia\nQuantity 150 pounds\nProcess/Storage Conditions    Tank; gaseous\nTopography Urban\nToxic Endpoint    .06 miles\nMeteorological Conditions    3m/sec\nAdministrative Limitation    \nPublic and Environmental Receptors    Yes\nGround Composition    \nAmbient Temperature    77F\nRelease Duration    37 minutes\n\n\nGeneral Accidental Release Prevention Program\n\nThe intent of the BWGP facility is that of full compliance with the OSHA PSM rule and the EPA RMP rule.  Additionally, the use of Safety and Operating Procedures provide a system to avert accidental releases by focusing on specific components of each shipment.  The safety and operating procedures manual consists of safety procedures and operating procedures uniquely designed for specific job tasks.  The manual is reviewed annually and revised as necessary to address any changes.  Each and every inbound chemical shipment receives a detailed pre-unloading inspection, inspection during unloading, and post unloading inspection by the loading technician.  The chief technician for quality assurance performs a final inspection.  Employees and contr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21749,
      "SummaryText": "actors are trained regularly to insure proficiency in all phases of the operation.\n\nFive Year Accident History\n\n1994    1995    1996    1997    1998    1999\nNone    None    None    None    None    None\n\nAs listed, no accidental releases of Anhydrous Ammonia greater than 100 pounds have occurred in the last 5 years from a covered process at the BWGP facility.\n\nIn the case of an incident involving an accidental release of anhydrous ammonia, an incident investigation will take place.  \n\nCorporate Strategy \n\nThe BWGP follows the company-wide Comprehensive Emergency Management Plan (CEMP) designed to address prevention, preparation, response and recovery from a wide variety of potential emergencies to include an accidental release of a regulated substance at the facility.  The facility, its employees and business operations are susceptible to emergencies such as natural disasters, severe weather, and man-made hazards.  The CEMP, in conjunction with the Risk Management Program and OSHA's Process Safety Management Program (PSM) aid in managing potential emergency situations. \n\nThe facility maintains an aggressive training program for all members of its emergency awareness teams.  In addition to the initial training programs for all BWGP employees, annual refresher training is provided along with periodic drills and exercises.  Emergency equipment is maintained in prime condition and includes SCBA for protection during evacuations.  During emergencies the Lead Operations staff member will serve as the Incident Coordinator, until the area respondents take charge of the incident.\n\nBecause of the rural nature of the location, BWGP coordinates training programs with the local fire and rescue teams.  Training is periodically provided, but at a minimum of annually.\n\nWind-flags are used to determine the wind direction and the fume flow of the plume in the event of a release.  Wind-flags have been installed in areas that are readily visible.\n  \nIncidental releases of ammonia may occur when the following operati"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21749,
      "SummaryText": "ons are executed on the system:\n\n? Manually purging the refrigeration system\n? A series of one to two second relief valve lifts that last no more than two minutes in any 24 hour period\n? Residual liquid contained in changing hoses, small gauges and their fittings\n? Minor leakage may occur if a valve packing nut is loosened a half turn to open or close the valve\n \nAll other releases constitute an \"abnormal release\" and the response to them is handled in two levels of severity.\n\nAwareness Emergency Level and limited response.  \n1) No off site resources needed.\nMinor Emergency Level \n1) Requires sounding of the emergency alarm and evacuating the site including the main office building.  A full scale response effort will be launched to protect employees and the community\n2) Outside response teams will be called when authorized by the Incident Coordinator.  These teams shall have fully trained personnel at the Hazardous Materials Technicians level. Periodic visits will be scheduled with these teams to will allow familiarity with the premises and to promote effective response to emergencies\nA building plan showing the location of ammonia storage vessels and surge drums will be available to  the City of Fayetteville's Fire Department\n? A written critique of each necessary emergency response action or drill will be filed and forwarded to the Risk Management Department.\n \nPlanned Changes to Improve Safety\n\nThe following items are planned changes to improve safety and reduce the likelihood an anhydrous ammonia release at BWGP:\n? Relief valve discharges shall be rerouted per Code\n? Purge valves on the evaporative condensers shall be locked out until relocation of the valves can be made\n? Emergency Response Plan training shall be continued and evaluated to insure effectiveness\n? Relief valves around evaporative condenser drain valves shall be redesigned to avoid pressure or pressure buildup in the evaporative condenser\n\nCommunicating Risk to the Community \n\nCommunity warning in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21749,
      "SummaryText": " the event of a significant ammonia release is a critical concern.  BWGP routinely conducts public tours, whereby public safety issues are discussed.   \n\nIn the event of a true emergency, we will use the CEMA as the media for informing the public.  The LEPC has a plan for warning people of an emergency through the use of police vehicles broadcasting warnings over the speaker systems.  Through the use of the CEMA notification system and our internal procedures, we feel confident that public notifications will be communicated in a timely expeditious manner."
    }
  ]
}