{
  "FacilityID": 21756,
  "FacilityName": "Bazor Ridge Gas Plant",
  "FacilityStr1": "595 Ceamon Pittman Road",
  "FacilityStr2": null,
  "FacilityCity": "Waynesboro",
  "FacilityState": "MS",
  "FacilityZipCode": "39367",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28153",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "31.541667",
  "FacilityLongDecDegs": "-88.64",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kahunaventures.com",
  "FacilityEmailAddress": "gdavis@kahunaventures.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kahuna Gas, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kahuna Gas",
  "OperatorStr1": "PO Box 119",
  "OperatorStr2": null,
  "OperatorCity": "Clara",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39324",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tom Boyd",
  "RMPTitle": "Facility Manager",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171565",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-08-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-08-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-05-30 00:00:00",
  "DeRegistrationEffectiveDate": "2016-11-28 00:00:00",
  "AnniversaryDate": "2005-08-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 31.54417,
  "FRS_Long": -88.63923,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30820,
      "AltID": "Gas Plant",
      "FacilityID": 21756,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31611,
          "ProcessID": 30820,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40319,
          "ProcessID": 30820,
          "ChemicalID": 63,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 63,
            "ChemicalName": "Hydrogen sulfide",
            "CASNumber": "7783-06-4",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 40320,
          "ProcessID": 30820,
          "ChemicalID": 155,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 30104,
              "ProcessChemicalID": 40320,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30105,
              "ProcessChemicalID": 40320,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30106,
              "ProcessChemicalID": 40320,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30107,
              "ProcessChemicalID": 40320,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30108,
              "ProcessChemicalID": 40320,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 30109,
              "ProcessChemicalID": 40320,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 40321,
          "ProcessID": 30820,
          "ChemicalID": 98,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540319,
          "ProcessID": 30820,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540320,
          "ProcessID": 30820,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540321,
          "ProcessID": 30820,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21756,
      "SummaryText": "BAZOR RIDGE TREATING FACILITY - RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nThe Bazor Ridge Treating Facility has a commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, trained personnel will respond to control and contain the release.\n\nThe Bazor Ridge Treating Facility, located approximately 10 miles south of Waynesboro in Wayne County, Mississippi, extracts natural gas liquids and natural gas condensate from natural gas and removes hydrogen sulfide from the natural gas. These natural gas liquids are comprised primarily of propane and butane, while the natural gas condensate is comprised primarily of pentane through decane hydrocarbons. The hydrogen sulfide removed from the gas is reinjected back into the formation. Some of the chemicals produced or used include methane, ethane, hydrogen sulfide, propane, and butane.\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThere is more than the EPA Threshold Quantity of hydrogen sulfide at the Bazor Ridge Treating Facility. The EPA Threshold Quantity for hydrogen sulfide (H2S) is set at 10,000 pounds. The threshold quantity is the level set by EPA for each toxic or flammable chemical, which if stored at the site requires compliance with the EPA's Risk Management Program regulations. The worst-case scenario associated with a release of hydrogen sulfide is a pipeline rupture of the acid gas reinjection pipeline containing acid gas, primarily H2S. This release would have off-site impacts, which vary depending on wind conditions.\n\nA more probable release scenario would be the release of hydrogen sulfide from a valve leak around the amine unit. While the hydrogen sulfide detectors would shut the system down upon det"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21756,
      "SummaryText": "ection of the hydrogen sulfide and process controls would eventually trigger a facility shutdown, there could be off-site impacts depending on the wind conditions.\n\nThere are several flammable substances stored at the site above the 10,000 pound threshold quantity for flammables. Examples of flammables at the site include propane and a mixed natural gas liquids stream (consisting primarily of propane, butanes and pentanes). The worst-case scenario associated with a release of flammable materials is a vapor cloud explosion (VCE) involving the full inventory of a 60,000 gallon storage tank containing natural gas liquids. \n\nA more probable release scenario would involve the release of natural gas liquids from a rupture in the line out of the product loading pumps. Based on pump output of 275 gallons of natural gas liquids per minute, we would release approximately 2750 gallons in 10 minutes, at which time our operators would detect and isolate the line. \n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nThe Bazor Ridge Treating Facility will have a very active accident prevention program in place, primarily based on the OSHA Process Safety Management regulations. A summary of some of the accident prevention programs that are or will be in place follows.\n\nProcess Safety Information\n\nThe Bazor Ridge Treating Facility keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents include material safety data sheets for all chemicals on-site, up-to-date process and instrumentation drawings, equipment data sheets on all vessels and equipment and process parameter safety limits. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\nProcess Hazard Analysis (PHA)\n\nThe Bazor Ridge Treating Facility "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21756,
      "SummaryText": "has a very comprehensive program to ensure that hazards associated with the various processes are identified and controlled. Each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The what-if/checklist analysis technique is used to perform these evaluations. The analyses are conducted using a team of people with operating, maintenance, engineering and safety experience. This team identifies and evaluates hazards of the process, as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. All approved recommendations from the PHA team findings are tracked until they are completed. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design and to ensure that new technology is used where appropriate, the Bazor Ridge Treating Facility will periodically update and revalidate the hazard analysis results. These periodic reviews will be conducted at least every 5 years.\n\n\nOperating Procedures\n\nThe Bazor Ridge Treating Facility will maintain written procedures that address various modes of process operations. These procedures will be used as reference by experienced operators, and provide a basis for consistent training of new operators. These procedures will be periodically reviewed and certified as current and accurate.\n\n\nTraining\n\nOur employees at the Bazor Ridge plant have extensive experience in the gas processing/treating industry. This level of experience provides a great level of expertise throughout the facility. Ongoing training is accomplished through routine safety meetings, scheduled training in new processes and refresher training on operating procedures. All operators participated in a formal two-week school in plant operations and control room techniques prior to plant startup. All operators a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21756,
      "SummaryText": "lso have carefully reviewed all process flow sheets and participated in writing the operating manual for the facility.\n\n\nContractors\n\nThe Bazor Ridge Treating Facility uses contractors to supplement its workforce during periods of increased maintenance or to assist with specialized projects. Contractors are advised about safety and health hazards, emergency response requirements and safe work practices prior to their beginning work. In addition, the company evaluates contractor safety programs and performance during the selection of a contractor. Gas plant personnel routinely monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\nMechanical Integrity\n\nThe Bazor Ridge Treating Facility will be using well-established practices and procedures to maintain our equipment in a safe operating condition. The basic aspects of this program include inspections, tests and corrections of identified deficiencies. Inspections and tests will be performed to help ensure that equipment functions as intended, and to verify that equipment operates within acceptable limits. If a deficiency is identified, employees will correct the deficiency before placing the equipment back in service or they will determine what actions are necessary to ensure safe operation of the equipment.\n\n\nSafe Work Practices\n\nThe Bazor Ridge Treating Facility will utilize safe work practices to help ensure worker and process safety. Examples of these include lockout/tagout to ensure isolation of energy sources for equipment that is being worked on, a permit and procedure for hot work and a permit and procedure for confined space entry. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\nManagement of Change\n\nThe Bazor Ridge Treating Facility will have a comprehensive system to manage changes to all covered processes. This system requires changes to item"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21756,
      "SummaryText": "s such as process equipment, chemicals, technology (including operating conditions), or procedures and other facility changes be properly reviewed and authorized before being implemented. Changes will be reviewed to ensure that adequate controls are in place to manage any new hazards and to verify that existing controls have not been compromised by the change. Operating and maintenance personnel will be provided any necessary training on the change.\n\n\nIncident Investigation\n\nThe Bazor Ridge Treating Facility will promptly investigate all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss or personal injury. The goal of each investigation will be to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.\n\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Bazor Ridge Treating Facility periodically will conduct an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits will be conducted at least every three years. The audit team will develop findings that are forwarded to gas plant management for resolution. The final resolution of each finding will be documented, and the two most recent audit reports will be retained.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Bazor Ridge Treating Facility have hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of specific regulated substances in the facility.\n\nThe Bazor Ridge Treating Facility has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of a release. The following types of safety features are used in the covered process\n\nRelease"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21756,
      "SummaryText": " Detection\n\n1. Hydrogen sulfide detection sensors throughout the facility.\n2. Video surveillance of compressors and loading rack.\n3. Personnel monitors to detect hydrogen sulfide.\n4. PLC monitoring of the process for temperatures, pressures and flowrates.\n\nRelease Containment/Control\n\n1. Process relief valves to prevent vessel overpressure.\n2. Valves (both manual and automatic) to permit isolation of the process.\n3. Automated shutdown systems for specific process parameters (such as high pressure or high level in a vessel).\n4. Curbing or diking to contain liquid releases.\n5. Stormwater retention pond to control releases.\n6. Flare system for controlling releases of hydrocarbons and hydrogen sulfide.\n\nRelease Mitigation\n\n1. Fire extinguishing systems. We have numerous fire extinguishers of several sizes throughout the facility. In gas plants such as Bazor Ridge Treating Facility, the control of fire is more dependent on restricting sources of fuel than on putting out the fire.\n2. Personal Protective equipment. There is an ample supply of self-contained breathing apparatus at the facility. \n\n\nACCIDENT HISTORY\n\nSince the Bazor Ridge facility is a new facility, the plant has not had an incident over the past five years which has impacted off-site people or structures.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Bazor Ridge Treating Facility maintains a written emergency response program, which is in place to protect worker and public safety. The program consists of procedures for responding to a hydrogen sulfide release and procedures covering the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs. \n\nIn addition, the Bazor Ridge Treating Facility has procedures tha"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 21756,
      "SummaryText": "t address maintenance, inspection and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency response program is updated when necessary, based on modifications made to plant processes or other plant facilities.\n\nThe overall emergency response program for the Bazor Ridge Treating Facility is coordinated with the local emergency response organizations and the emergency planning committee. This coordination provides a means to notify the public in case of an incident, if necessary, as well as facilitating quick response to an incident. \n\nCONCLUSION\n\nThe Bazor Ridge Treating Facility has a very strong prevention program in place. However, the facility continually looks for improvements, both to the process and to safety issues at the facility. We have a very strong commitment to the safety of our employees and to the community around our facilities."
    }
  ]
}