{
  "FacilityID": 21827,
  "FacilityName": "Holtzinger, C. M. Fruit Co Inc",
  "FacilityStr1": "101 Benitz Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Prosser",
  "FacilityState": "WA",
  "FacilityZipCode": "99350",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.220139",
  "FacilityLongDecDegs": "-119.731389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 95727327,
  "ParentCompanyName": "Holtzinger, C. M. Fruit Co Inc",
  "Company2Name": null,
  "CompanyDUNS": 8958563,
  "Company2DUNS": null,
  "OperatorName": "C.M. Holtzinger Fruit Co., Inc.",
  "OperatorStr1": "PO Box 169",
  "OperatorStr2": null,
  "OperatorCity": "Yakima",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98907",
  "OperatorZipCodeExt": null,
  "FTE": 180,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171832",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-01-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-09-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-09-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-09-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-09-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 46.221118,
  "FRS_Long": -119.729798,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 30953,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 21827,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 40489,
          "ProcessID": 30953,
          "ChemicalID": 57,
          "Quantity": 19000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31748,
          "ProcessID": 30953,
          "NAICSCode": "42248",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17170,
              "Process_NAICS_ID": 31748,
              "SafetyReviewDate": "2000-08-25 00:00:00",
              "PHA_Date": "2000-08-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Shut Off",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-08-31 00:00:00",
              "TrainingReviewDate": "2000-08-31 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-08-25 00:00:00",
              "EquipmentInspectionDate": "1999-09-10 00:00:00",
              "EquipmentTested": "Ammonia compressors, piping, condensers, evaporators, receivers, relief valves, control systems, other associated system components",
              "ChangeMgmtDate": "1999-09-10 00:00:00",
              "ChangeMgmtReviewDate": "2000-08-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-08-31 00:00:00",
              "HotWorkPermitReviewDate": "2000-08-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-08-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25025,
                  "PreventionProgram3ID": 17170,
                  "ProcessChemicalID": 40489
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21827,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-08-31 00:00:00",
    "ERTrainingDate": "2000-04-04 00:00:00",
    "CoordinatingAgencyName": "Benton County Emergency Management",
    "CoordinatingAgencyPhone": "5096282600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21827,
      "SummaryText": "C.M. HOLTZINGER FRUIT CO., INC.\nRMP EXECUTIVE SUMMARY\n\n\nCORPORATE SAFETY COMMITMENTS\n\nC.M. Holtzinger Fruit Co., Inc. is committed to providing its employees and the surrounding community with a safe and healthy environment.  The Risk Management and Process Safety Management Programs are an integral part of our strong commitment to sustaining our involvement in environmental protection and human safety at our facilities. \n\nDESCRIPTION OF FACILITY AND REGULATED SUBSTANCES\n\nThe Prosser, Washington processing facility stores, packs and ships fresh cherries, apples and pears. This facility employs approximately 180  people. Activities are conducted at this site during all months of the year. \n\nThe Prosser facility uses anhydrous ammonia controlled atmosphere (CA) in the refrigerating process where fruit is stored in bins and packed boxes that need to be quickly cooled and temperature maintained. The general site has two separate non-connected ammonia systems containing 19,000 lbs. and 16,300 lbs., respectively, for a total of 35,300.  The worst case scenario was developed for the 19,000 lb system . \n\nThe Prosser Washington site has another single non-connected facility used for the same purpose. This site is under the 10, 000 pound threshold and is not calculated in the worst case scenario or alternative worst case. The same safety procedures, however, are being applied. This site has 7,800 pounds.\n\nOFFSITE CONSEQUENCE ANALYSIS\n\nThe offsite consequence analysis conducted as part of the Risk Management Plan, includes consideration of two ammonia release scenarios identified as \"worst case release\" and \"alternative release.\"  The first scenario as defined by EPA states that \"¿for substances that are normally gases at ambient temperature and handled as a gas or liquid under pressure, the owner or operator shall assume that the ¿ maximum quantity in the largest vessel ¿ is released as a gas over 10 minutes\".  The alternative scenario is defined as \"more likely to occur than"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21827,
      "SummaryText": "the worst-case release scenario.\"  Anhydrous ammonia, as used at the facility, is a gas at ambient temperature and is stored as gas or liquid under pressure.\nThe worst case scenario was performed for the High Pressure Receiver, which is located inside and has the potential to contain the design volume of the ammonia refrigeration system.  The system design volume of 19,000 pounds of ammonia was assumed to be released from the high pressure receiver over a 10-minute period.  Other parameters included a wind speed of 1.5 meters per second, stability class of F, hole size of 4.98 inches, tank pressure of 90 psig, tank temperature of 59° F, highest temperature at the site for the last 1 year of 108°F, average relative humidity of 61%, and surface roughness category identified as outskirts of town.\n\nThe dense gas model SLAB was used for the analyses.  SLAB is a computer model developed by Lawrence Livermore Laboratory that simulates the atmospheric dispersion of denser than air releases.  The SLAB model can simulate an evaporating pool, a horizontal jet, a stack or vertical jet and an instantaneous volume release.  The modeling was performed using the horizontal jet option so that no vertical momentum was introduced.  This would be representative of a hole in the side of a vessel or pipe.  The results of the SLAB analyses for the worst-case scenario indicate off-site impacts.\n\nThe alternative release scenario was performed for a ¼\" hole at high pressure receiver conditions releasing liquid ammonia in a horizontal jet.  This release could represent a variety of release scenarios including the five described in the regulation (40 CFR Ch. I Part 68.28).  The release point is considered to be outside since there is piping at high-pressure receiver conditions oar located on the plant roof.  The release rate was considered to be constant over a one-hour period.  The one-hour was chosen because it is the basis of the 200-PPM end-point for ammonia.  Other parameters included av"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21827,
      "SummaryText": "erage meteorological conditions for the site, tank pressure of 80 psig, tank temperature of 53° F, wind speed of 7.1 mph, stability class of D (neutral), site temperature of 51°F, relative humidity of 61%, and surface roughness category identified as outskirts of town.  The dense gas model SLAB was also used for the analyses of the alternative release scenario, and off-site impacts were indicated.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nC.M. Holtzinger Fruit Co., Inc.'s  accident prevention/loss control systems and policies involve a unified approach that integrates technologies, procedures, and best-management practices.  The OSHA-PSM and the EPA-RMP plans work together to assure that potential on-site hazards and off-site consequences are identified and controlled to the best of our ability, and that the processes are meeting health and safety objectives.\n\nThe RMP Prevention Program is comprised of the 13 elements of OSHA's PSM program: Employee Participation, Process Safety Information, Process Hazard Analysis, Management of Change, Pre-Startup Safety Review, Operating Procedures, Hot Work Permits, Employee Training, Incident Investigation, Mechanical Integrity, Emergency Planning & Response, Contractor Safety, and Audits.  \n\nEmployee participation brought together people that knew and understood the system, from practical experience as well as their technical knowledge, to develop the Plan.  Process safety information is a collection of data that allows us to identify and understand the hazards posed by our inventory.  The Process Hazard Analysis (PHA) program was developed by representatives from our skilled work force, our management team, and outside engineering consultants.  This analysis identifies potential process failures that could result in an uncontrolled release of ammonia.\n\nA system of checks and balances has been established to safely manage changes that need to be made to the processes containing ammonia.  This system evaluates safety prior to the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21827,
      "SummaryText": "work being done, and provides a solid review of the system to ensure it will operate as designed.  Standard operating procedures are in place for each operating phase and are readily accessible to those workers who operate or maintain the process.  In addition, a policy and procedure are used to assure that proper safety precautions are taken for all personnel performing Hot Work.  The integrity of the refrigeration system equipment is maintained according to recognized and generally accepted good engineering practices adapted directly from the International Institute of Ammonia Refrigeration (IIAR) standards, and according to a well-documented preventive maintenance program.\n\nAn extensive training program is in place for those employees and contractors involved in working on or around the process and covers operating procedures, health and safety hazards, emergency operations, and safe work practices.  The facility also has a training program for all employees and contractors regarding the hazards of the chemical and safe work practices to be used.  Part of this training includes monthly safety meetings as well as drills on spill response and plant evacuation.  \n\nAny incidents related to the ammonia refrigeration systems are promptly investigated even though the rule only requires investigation of those incidents, which resulted in, or could reasonably have resulted in, a catastrophic release.  All incidents are analyzed, resolved, and findings shared with affected employees.  In order to assure compliance with all elements of the prevention program, an audit is conducted every three years including a report of the findings and documentation of any deficiencies corrected.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases at the Prosser, Washington Facility in the last five years from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, pro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21827,
      "SummaryText": "perty damage, or environmental damage.\n\n EMERGENCY RESPONSE PROGRAM\n\nThe facility has an emergency action plan that has been coordinated (reviewed) with the Prosser Fire Department and Benton County Emergency Services. Both are members of the Local Emergency Response Planning Committee.    \n\nThe plan applies to all Holtzinger  employees, visitors, and support service contractors performing tasks and activities as part of ongoing operations.  The purpose of the plan is to establish policies and procedures for protecting the health and safety of employees, contractors, and visitors, and to comply with all applicable federal and state regulations.  The training of employees and contractors includes providing a copy of the plan upon initial employment at Holtzinger facilities and reviewing it for their specific assignment, annual refresher training for current employees, and review for all whenever the plan is changed.  In addition, plant evacuation drills are conducted on a regular basis. \n\nThe plan is comprehensive enough to deal with all types of emergencies specific to the facility and defines the following:\n\n· How to conduct activities in a manner that protects the safety of employees, the public, and the environment\n \n· Preferred means for reporting fires, hazardous materials incidents, medical, and any other emergencies\n \n· Emergency escape procedures and emergency escape route assignments\n \n· Procedures to account for all employees including contractors and visitors\n \n· Names of agencies and persons to contact for further assistance, information, or explanation of the plan\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Prosser, Washington facility takes seriously its responsibility for the safety of its employees, neighbors, and community.  Central to this responsibility are our programs to prevent the release of chemicals to the environment.  We will continue to implement these precautions and programs, to act as a responsible neighbor, and to maintain the goodwill o"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21827,
      "SummaryText": "f the community."
    }
  ]
}