{
  "FacilityID": 21931,
  "FacilityName": "Base Metals Refinery",
  "FacilityStr1": "1730 East 1st Avenue South",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "MT",
  "FacilityZipCode": "59019",
  "Facility4DigitZipExt": "1209",
  "FacilityCountyFIPS": "30095",
  "LEPC": null,
  "FacilityLatDecDegs": "45.631667",
  "FacilityLongDecDegs": "-109.234722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.stillwatermining.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106572233,
  "ParentCompanyName": "Stillwater Mining Company",
  "Company2Name": null,
  "CompanyDUNS": 106572233,
  "Company2DUNS": null,
  "OperatorName": "Stillwater Mining Company",
  "OperatorStr1": "P.O. Box 1209",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59019",
  "OperatorZipCodeExt": "1209",
  "FTE": 45,
  "OtherEPAFacilityID": "59019SPLLW1209L",
  "EPAFacilityID": "100000172252",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-03-16 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-09-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-09-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-09-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-08-15 00:00:00",
  "DeRegistrationEffectiveDate": "2016-08-01 00:00:00",
  "AnniversaryDate": "2005-09-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 45.631203,
  "FRS_Long": -109.235729,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31138,
      "AltID": "Se/Te Removal Circuit",
      "FacilityID": 21931,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 40731,
          "ProcessID": 31138,
          "ChemicalID": 49,
          "Quantity": 9500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 31938,
          "ProcessID": 31138,
          "NAICSCode": "331419",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17302,
              "Process_NAICS_ID": 31938,
              "SafetyReviewDate": "2000-06-26 00:00:00",
              "PHA_Date": "2000-09-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-05-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "The covered process is a new process and this PHA was the initial PHA.",
              "OpProceduresReviewDate": "2000-06-22 00:00:00",
              "TrainingReviewDate": "2000-09-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Qualification card (mock walkthrough)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-09-19 00:00:00",
              "EquipmentInspectionDate": "2000-09-19 00:00:00",
              "EquipmentTested": "The circuit is a new process and a PSSR was conducted on the circuit prior to startup.",
              "ChangeMgmtDate": "2000-09-19 00:00:00",
              "ChangeMgmtReviewDate": "2000-09-19 00:00:00",
              "PreStartupReviewDate": "2000-09-19 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-09-19 00:00:00",
              "HotWorkPermitReviewDate": "2000-09-19 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-09-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25197,
                  "PreventionProgram3ID": 17302,
                  "ProcessChemicalID": 40731
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 21931,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-07-25 00:00:00",
    "ERTrainingDate": "2000-09-19 00:00:00",
    "CoordinatingAgencyName": "Stillwater Ct. Disaster & Emer. Ser",
    "CoordinatingAgencyPhone": "4066578246",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21931,
      "SummaryText": "Executive Summary\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nStillwater Mining Company (SMC) Base Metals Refinery (BMR) is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, hazard analysis' and employee training associated with the processes at our facility.  It is our policy to comply with all applicable federal, state, and local regulations as well as implement appropriate controls to prevent possible release of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.\n\nOur emergency response program includes procedures for notification of the local volunteer fire department; notification of any potentially affected neighbors; and notification of local, state and federal agencies.  Safety is an essential part of our operations, the safety devices built-in to the design of this facility, the safe work practice procedures that we use, and the extensive training of our personnel.\n\n2.\tThe Stationary Source and the Regulated Substance Handled\nSMC BMR primary activity involves the upgrade of platinum and palladium from a platinum group metals (PGM) matte.  The SMC BMR is headquartered in Columbus, Montana.\n\nThe following regulated substance is present at the SMC BMR: Sulfur Dioxide (anhydrous).  SMC BMR utilizes ton cylinders.\n\nThe maximum intended inventory of Sulfur Dioxide is 8,000 lbs\n\n3.\tThe Worst Case Release Scenario and Alternate Case Release Scenario, including administrative controls and mitigation measures to limit the endpoint distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have utilized EPA's RMP Guidance for Wastewater Treatment Plant Reference Tables or Equations."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21931,
      "SummaryText": "The following paragraphs provide details of the chosen scenarios.\n\nThe worst-case release scenario submitted for Program 3 toxic substance as a class involves a catastrophic release from a Sulfur Dioxide ton cylinder.  The scenario involves releasing the entire contents of the cylinder in a gaseous form over a ten-minute period.  This release would reach the toxic endpoint (0.0078 mg/l or 3ppm) and public receptors.  No mitigation factors were considered in calculating this scenario's endpoint.\n\nThe alternate case release scenario involves the opening of a vessels pressure safety relief valve bypass valve.  Vessel pressure indication controls the opening and closing of the valve and both the controls and valve orifice size were considered in calculating the release quantity and duration.  The scenario would release sulfur dioxide in a gaseous form over a 6 second interval.  This release would reach the toxic endpoint (0.0078 mg/l or 3 ppm) and public receptors.\n\n4.\tThe General Accidental Release Prevention Program and the chemical Prevention Steps.\nOur facility has taken all of the necessary steps to comply with the accidental release prevention requirements stipulated by the EPA under 40 CFR Part 68 as well as those of OSHA under the PSM standard 29 CFR 1910.119.  Our facility is also subject to EPCRA 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that are in place at our facility\n\nProcess Safety Information\nSMC BMR maintains a detailed compilation of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the covered process.\n\nProcess Hazard Analysis\nThe SMC BMR conducts comprehensive studies to assure that hazards associated with the covered process are identified and controlled.  The methodology used to carry out the hazard analysis on the covered process was a combination of the Hazard and Operability (HAZOP) and What-if/Checklist"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21931,
      "SummaryText": "techniques.  The studies are undertaken by a team of qualified personnel with expertise in engineering and operations.  The studies are lead by personnel with knowledge and expertise in the techniques utilized and are revalidated every five years.  Any findings of the Team are addressed in a timely and efficient manner.\n\nOperating Procedures\nFor the purpose of safely conducting activities within the covered process, SMC BMR maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is regularly reviewed and is readily available to operators working in the covered process.\n\nTraining \nSMC BMR has a comprehensive training program in place to assure that employees whose job tasks are affected by the covered process are competent in the operating procedures associated with the process.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nSMC BMR carries out highly documented maintenance checks on process equipment within the covered process to assure proper operations.  Process equipment examined include, pressure vessels, storage tanks, piping system and components, relief and vent systems, controls, and pumps.  Trained and qualified personnel carry out maintenance operations.  Any equipment deficiencies identified are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at SMC BMR to manage changes to process chemicals, technology, equipment, and procedures within the covered process.  Process operators, maintenance personnel and any employees whose job task is affected by the change are promptly made aware of and trained on the change.\n\nPre-startup Safety Reviews\nPre-startup safety reviews related to new covered processes and to modifications in established covered processes are conducted as a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21931,
      "SummaryText": "regular practice at SMC BMR.  These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup of the process prior to placing the equipment into service.\n\nCompliance Audits\nSMC BMR will conduct audits on a regular basis to determine whether the provisions set out under the RMP regulation are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result are undertaken in a safe and prompt manner.  Personnel with expertise in auditing are utilized to complete the audit.\n\nIncident Investigation\nIt is SMC BMR policy to investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent reoccurrence.  All incident investigation reports are retained for five years.\n\nEmployee Participation\nSMC BMR truly believes that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, SMC BMR employees have access to all information created as part of the facilities implementation of the RMP rule, including information pertaining to the process hazard analysis.\n\nHot Work Permit\nSMC BMR has a policy in place to safely conduct cutting, welding, or brazing activities in or adjacent to the covered process.\n\nContractors\nOn occasion, our facility hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  SMC BMR has a strict policy of informing the contractors of known potential hazards related to the contractors work in the covered area.  Contractors are also informed of all the proced"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21931,
      "SummaryText": "ures for emergency response.\n\n5.\tFive-year Accident History\nThe covered process is currently in the construction phase therefore there have been no accidental releases.\n\n6.\tEmergency Response Plan\nSMC BMR maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\n\nTo assure proper functioning, the emergency response equipment will be regularly inspected and serviced, and mock emergency drills will be conducted.  \n\nThe Stillwater County Disaster and Emergency Services is the local (county) emergency response committee with which our emergency response plan has been coordinated.\n\n7.\tPlanned Changes to Improve Safety\nAt this time, due to construction of the plant, no changes are planned although it is SMC BMR policy to continually strive to enhance safety and identify areas of improvement."
    }
  ]
}