{
  "FacilityID": 21970,
  "FacilityName": "BASF Corporation - Hannibal Plant",
  "FacilityStr1": "3150 Highway JJ",
  "FacilityStr2": "NA",
  "FacilityCity": "Palmyra",
  "FacilityState": "MO",
  "FacilityZipCode": "63461",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29127",
  "LEPC": "Marion / Ralls County LEPC",
  "FacilityLatDecDegs": "39.836111",
  "FacilityLongDecDegs": "-91.429167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 46374120,
  "ParentCompanyName": "BASF Corporation",
  "Company2Name": "NA",
  "CompanyDUNS": 71014385,
  "Company2DUNS": 0,
  "OperatorName": "Donald E. Warren",
  "OperatorStr1": "P. O. Box 817",
  "OperatorStr2": "NA",
  "OperatorCity": "Hannibal",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63401",
  "OperatorZipCodeExt": "0817",
  "RMPContact": "J. Brad Willett",
  "RMPTitle": "Environmental Dept. Manager",
  "FTE": 373,
  "OtherEPAFacilityID": "63461MRCNCSTATE",
  "EPAFacilityID": "100000083134",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "12700010001",
  "SafetyInspectionDate": "2000-05-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-10-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-10-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-09-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-09-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.83417,
  "FRS_Long": -91.43278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31188,
      "AltID": "Anhydrous ammonia storage",
      "FacilityID": 21970,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31988,
          "ProcessID": 31188,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40803,
          "ProcessID": 31188,
          "ChemicalID": 56,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540803,
          "ProcessID": 31188,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 31189,
      "AltID": "Interim storage - mercapt",
      "FacilityID": 21970,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31989,
          "ProcessID": 31189,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40804,
          "ProcessID": 31189,
          "ChemicalID": 105,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540804,
          "ProcessID": 31189,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 31190,
      "AltID": "OP Insecticide Mfg",
      "FacilityID": 21970,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 31990,
          "ProcessID": 31190,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 40805,
          "ProcessID": 31190,
          "ChemicalID": 105,
          "Quantity": 330000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 540805,
          "ProcessID": 31190,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 21970,
      "SummaryText": "At BASF Corporation's Hannibal Plant, we manufacture several agricultural products.  At this plant, we are very concerned with the protection of our employees and our environment. We are also concerned with protecting our families that live in nearby communities.  We have designed our facilities to safely manage the chemicals used and produced within our production operations. It is our policy to not only to comply with all applicable federal, state, and local rules and regulations but also to voluntarily go beyond these requirements to help ensure our continued successful and safe operations.  We have developed and implemented the following to help achieve our goals:\n \n* State of the art process equipment and controls incorporating safety devices and systems needed to properly handle, store or use materials\n* Well-defined and documented operating procedures and control systems\n* An extensive safety, health, and process safety management system\n*  Well-trained production employees coupled to a highly trained technical staff\n* An extensive preventive maintenance and equipment inspection program\n* Plant site access is restricted to authorized employees, management personnel, and authorized contractors\n\nIn addition to these preventive programs, it is the Plant's policy to maintain an up-to-date emergency response plan and trained personnel and response equipment to be prepared to respond to potential emergencies involving fire, releases of hazardous material, medical emergencies, and confined space rescue. The plant works closely with area community emergency response agencies providing them with information on plant operations and response programs in addition to conducting periodic training with members of the local emergency response agencies.\n\nBASF's Hannibal facility has two substances that exceed the RMP threshold quantities.  These compounds are anhydrous ammonia and ethyl mercaptan that are classified as toxic and flammable, respectively. These compounds are us"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 21970,
      "SummaryText": "ed as raw materials in the production of agricultural products at the Hannibal Plant.\n\nLiquid, anhydrous ammonia is received by tank truck (approximately 26,000 pounds per truck) and is stored in a single steel tank at ambient temperature and under its own vapor pressure. This tank is located within a concrete secondary containment system.  The tank is equipped with overpressure protection and is rated to withstand full vacuum. The total ammonia inventory is 41,000 pounds that  includes the amount in the storage tank and associated piping that handle anhydrous ammonia. \n\nThe anhydrous ammonia handling system consists of an unloading station with secondary containment system,  storage tank, two pumps and piping.  As for all operations at this facility, this system is governed by well-established operating procedures.\n\nEthyl mercaptan is typically received by railroad tank car (about 140,000 pounds per tank car). Up to eight tank cars may be in the receiving area on the plant site awaiting unloading into the dedicated ethyl mercaptan storage tank. The maximum total inventory for the eight tank cars is 1,100,000 pounds.  When needed, a tank car is moved to the unloading area using a trackmobile operated by trained, plant personnel.  The railcar is positioned inside a concrete secondary containment system in the unloading area and is then connected to the ethyl mercaptan storage tank to unload. Ethyl mercaptan may also be received by tank truck in quantities of approximately 5,000 gallons.  Trucks are also unloaded in concrete secondary containment systems provided for unloading.\n\nThe ethyl mercaptan storage tank is located inside a concrete secondary containment system. The mercaptan is pumped from the storage tank to the chemical processing equipment used to manufacture an agricultural product. The total inventory for the storage tank, chemical processing equipment and pipes is about 330,000 pounds. Transportation, unloading, and use of mercaptan are managed under pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 21970,
      "SummaryText": "nt operating procedures.  \n\nWorst case scenario - ammonia: For the worst case scenario, we assumed a total failure of the storage tank when filled to the greatest amount allowed which would release 39,000 pounds of ammonia. (Active mitigation systems were not considered according to EPA guidelines for worst cases.) Although the storage tank is designed to store approximately 48,000 pounds, plant administrative controls limit the amount to 39,000 pounds. For this scenario, it is assumed that the entire contents of the tank are released as a gas over ten minutes according the EPA requirements for a pressurized, liquified substance. The distance to the EPA-defined toxic endpoint (0.14 mg/liter) is 3.6 miles. The EPA's RMP*Comp(tm) version 1.06 was used to estimate the distance.\n\nAlternative scenario - ammonia: For the alternative scenario, it was assumed that while unloading a tank truck, the liquid ammonia unloading hose fails due to movement of the tank truck.  It was assumed that the truck was improperly set up for unloading.  Additionally, it was assumed that all systems designed to prevent ammonia release operated except the excess flow valve in the liquid line connected to the flexible hose.  It was estimated that 14,000 pounds of ammonia would be released.  The plant's ability to use the firewater system to knock down and dissolve ammonia vapors was not assumed as active mitigation for this scenario even though the system is designed for use in this type of incident.  The distance to the EPA toxic endpoint was estimated to be 0.8 miles using RMP*Comp (tm) version 1.06.\n\nWorst case scenario - ethyl mercaptan: For this scenario, it was assumed that all eight tank cars of ethyl mercaptan (which may be in inventory) are stored adjacent to each other and are involved in a common incident. In addition, it was assumed that this incident causes the simultaneous release of ethyl mercaptan from all tank cars.  It was further assumed that the total inventory (1,100.000 pou"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 21970,
      "SummaryText": "nds) is vaporized and undergoes a vapor cloud explosion. The distance to an EPA endpoint of 1 psi overpressure was estimated to be 0.7 miles using RMP*Comp (tm).\n\nAlternative scenario - ethyl mercaptan: For the alternative scenario, it was assumed that a fully loaded tank car is derailed and rolls over.  It was further assumed that manway on the railcar was improperly secured. The manway fails releasing the entire tank car load of ethyl mercaptan (140,000 pounds). It was assumed that ethyl mercaptan forms a pool that is ignited forming a pool fire. The distance to the EPA endpoint of 5 kw/square meter was estimated at 0.2 miles using version 1.06 of RMP*Comp(tm).\n\nThe Hannibal Plant has a well-established accident prevention program. The primary purpose of the program is to eliminate those events which have the potential to result in personal injury, property loss and environmental or community impact. The secondary purpose of the program is to ensure reliable and predictable operations. The objective of the program is to eliminate all unexpected events. The program consists of four fundamental elements: (1) written procedures; (2) training; (3) auditing; (4) process reviews or evaluation.\n\n(1) The written procedures include personal health and safety, work practices, equipment operation,  loss prevention, and related topics. The procedures are implemented using administrative, engineering and personal protective equipment controls. The procedures receive periodic review and are revised as necessary.\n\n(2) The training element includes job specific safety, emergency response and hazard awareness training. Training plans are specifically developed for various employee groups. The frequency of the training varies within a three-year cycle depending upon the employee group and the topic.\n\n(3) The auditing activities include both internal and external audits.  Internal audits are completed using a wide range of plant resources.  Plant personnel conduct routine general in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 21970,
      "SummaryText": "spections of plant facilities on a regular basis (e.g. daily/weekly/monthly).  Facility personnel conduct extended plant-wide audits at a minimum three-year frequency.   These audits include safety, housekeeping, transportation, ergonomics, emergency systems, industrial hygiene, process safety management and mechanical integrity inspections.  Corporate staff, state and federal agencies, insurance companies, etc. conduct external audits.\n\n(4) Process Hazard Analyses are completed for each manufacturing and related support facilities on a 5-year cycle in accordance with applicable OSHA Process Safety Management regulations.. Selected management of change activities also requires a hazard analysis. The analyses evaluate the impact of unexpected events to both in-plant and off-plant receptors.\n\nFive year accident history: The plant maintains records of all chemical releases. Our records document that we have had  no accidental releases of the RMP-listed substances meeting the RMP rule criteria for the past five years.\n\nThis plant also has a well-established emergency response plan. Its primary purpose is to guide plant personnel during emergency situations. The secondary purpose is to communicate to the surrounding communities and area response agencies how the facility intends to respond to potential emergency situations. The plan's objective is to provide a coordinated response to potential plant emergencies that could threaten employee health and safety, the local community, the environment or plant property.\n\nThe plant maintains experienced  personnel who are fully trained to respond to potential emergencies arising from fires, hazardous material releases, medical emergencies and confined space incidents. The various teams are equipped to respond to plant emergencies.  The plant recognizes the potential need to utilize community emergency response agencies during some emergency situations. Therefore, plant emergency response teams work closely with members of the Pa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 21970,
      "SummaryText": "lmyra, Hannibal, Quincy and Hannibal Rural Fire Departments sharing plant response information, conducting joint training exercises, providing emergency response support to  communities for incidents not related to plant activities, and in many areas participating in local voluntary response agencies.\n\nThe Hannibal Plant has an effective safety and environmental program as indicated by its excellent record of performance. The plant has implemented effective programs to minimize the potential for off-site releases. At this time, there are no specific changes planned for the safety program related to the RMP activities. The Plant's Central Safety Committee meets on a regular basis to evaluate performance and to modify and improve the safety and environmental program as needed."
    }
  ]
}