{
  "FacilityID": 22005,
  "FacilityName": "Air Products, L.P.",
  "FacilityStr1": "1423 Highway 225",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77506",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Pasadena  LEPC",
  "FacilityLatDecDegs": "29.716611",
  "FacilityLongDecDegs": "-95.194944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.airproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 65091969,
  "ParentCompanyName": "Air Products and Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 3001070,
  "Company2DUNS": null,
  "OperatorName": "Air Products, L.P.",
  "OperatorStr1": "1423 Highway 225",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77506",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "77506RPRDC1423H",
  "EPAFacilityID": "100000071343",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-11-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Air Products L.P.",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-10-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-09-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-09-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 29.716191,
  "FRS_Long": -95.194361,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31233,
      "AltID": "Hydrogen Production Unit",
      "FacilityID": 22005,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 40852,
          "ProcessID": 31233,
          "ChemicalID": 155,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 30576,
              "ProcessChemicalID": 40852,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 30577,
              "ProcessChemicalID": 40852,
              "ChemicalID": 149
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 32044,
          "ProcessID": 31233,
          "NAICSCode": "32512",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22005,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-06-23 00:00:00",
    "ERTrainingDate": "2000-09-27 00:00:00",
    "CoordinatingAgencyName": "Pasadena LEPC",
    "CoordinatingAgencyPhone": "7134755588",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22005,
      "SummaryText": "Federal RMP Executive Summary\n\nAir Products, L.P.\nPasadena, Texas Plant\n\n\nThe Air Products, L.P. plant in Pasadena, Texas contains one RMP covered process, a gaseous hydrogen manufacturing plant.\n\n1.  Accidental release prevention and emergency response policies:\n\nHydrogen, in the amount handled by the facility, exceeds the threshold quantity set by the EPA for a flammable gas.  It is our policy to adhere to all applicable federal, state, and local rules and regulations as well as our own environmental, health, and safety standards.  Air Products manages the safety of our facility by designing for safe operation, operating the plant safely, maintaining the plant, and by auditing our operations. \n\nOur accident prevention program is based on OSHA¿s Process Safety Management regulation and our emergency response program is based on OSHA¿s HAZWOPER regulation including an Advanced  Interior / Exterior Fire Brigade per NFPA 600.  The emergency response plan includes procedures for the request of local fire support through Channel Industries Mutual Aid so that appropriate measures can be taken by local emergency responders if necessary.\n\nAir Products is committed to continuous improvement in all aspects of safety and environmental performance.  Air Products is a member of the Chemical Manufacturer¿s Association and subscribes to the Responsible Care Program.  The Pasadena facility is actively involved with local organizations concerned with the safety of our community and the environment such as the East Harris County Manufacturer¿s Association, the Pasadena Local Emergency Planning Committee (LEPC), and the Pasadena Citizen¿s Advisory Council.\n\nThis document has been prepared in accordance with EPA¿s Risk Management Plan regulation (40 CFR, Part 68).  The substances and processes considered during the preparation of this RMP and the scenarios described were selected based on criteria established in the regulation.\n\n2.  The facility and the regulated substances handled:"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22005,
      "SummaryText": "Our facilities are located on Highway 225 in Pasadena, Texas.  Hydrogen is used by our customers in their manufacturing processes.  To produce gaseous hydrogen, natural gas is received by our plant via pipeline and used as our feedstock.  The feedstock is mixed with steam and sent to the reformer furnace.  In the reformer furnace, the feedstock and steam are heated in the presence of a catalyst, where a chemical reaction takes place that converts the mixture into hydrogen, carbon monoxide, and carbon dioxide.  The carbon monoxide and carbon dioxide are then separated from the hydrogen in adsorbers.  The pure hydrogen is then delivered to the customer via our pipeline.  \n\n3.  The worst case release scenario(s) and the alternative release scenario(s):\n\nThe WCS for an RMP listed flammable chemical at the Pasadena facility, as defined by the EPA, is a catastrophic failure of one of the pressure swing adsorption vessels, releasing (3,800 pounds) of gaseous hydrogen which is assumed to form a vapor cloud and ignite resulting in a vapor cloud explosion (VCE).  The maximum distance to the EPA-defined end point (1 psi overpressure) for this event reaches no receptors off-site.  Although we have active controls directed at preventing such releases, no credit for active or passive mitigation measures were taken into account in evaluating this WCS.\n\n4.  The general accidental release prevention program and specific prevention steps:\n\nThe Hydrogen plant is covered as a Program Level 1 as defined by the RMP regulation.  Our accident prevention program is based on OSHA¿s Process Safety Management regulation.  Air Products manages the safety of our facility by designing for safe operation, operating the plant safely, maintaining the plant safely, and by auditing our operations.\n\nOur facility is designed for safe operation through the use of emergency shutdown systems and alarms, water deluge systems, fail-safe valves, and dikes for the unlikely case of a liquid leak.  Systems and e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22005,
      "SummaryText": "quipment are designed  to applicable engineering standards and codes.  Safety reviews are conducted for all new installations and modifications to existing processes.  \n\nOur plant is operated safely by trained and certified operators who follow standard operating procedures with defined safe operating limits. Process safety meetings are held regularly for all operating and maintenance personnel including contractors.  Investigations are conducted for all incidents.\n\nWe maintain operational safety through preventive maintenance and equipment inspection programs.  We hold contractors to the same high safety training standards as our employees.  We implement task observation and accident prevention techniques.\n\nWe routinely audit our operations for compliance with federal, state, and local regulation.  We also have a program to audit the plant¿s performance against corporate environmental and safety standards.  \n\n5.  Five year accident history:\n\nThere have been no releases of flammable gases from the Air Products Plant in Pasadena in the past five years that have had an adverse impact on the community.  There have been no incidents at the facility that meet the EPA Risk Management Program reporting requirements.\n\n6.  The emergency response program:\n\nThe facility¿s emergency response program is based on the OSHA HAZWOPER standard and has  established an Advanced Interior / Exterior Fire Brigade per NFPA 600.  Our Emergency Response Team consists of Air Products employees and also employees of the Celanese Pasadena Plant which is immediately adjacent to the Air Products Plant and within the same fenced boundary.  The Emergency Response team conducts joint training and is prepared to respond to an incident at either of the plants.  We have approximately 30 trained emergency responders on the Emergency Response Team. This includes a fire brigade,  rescue team,  a haz-mat team, and several personnel certified by the Texas Department Of Health as EMS personnel.  In an emerge"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22005,
      "SummaryText": "ncy, an emergency response team member establishes a Unified Command with an operations person from the affected area and  assumes on-scene command of the incident.  On-site emergency resources include a rescue truck, and a 500 gallon foam trailer.  In addition to these resources, the facility is a member of Channel Industries Mutual Aid (CIMA) and coordinates programs with the Pasadena LEPC, the Pasadena Fire Dept. and CIMA members.    A plant wide joint drill was held in 1995 with the CIMA organization   The plant Emergency Response Team members participate with the CIMA organization drills twice a year at various plants in the area. The Pasadena Fire Dept. personnel visit the plant twice per year for joint training.\n\n7.  Planned changes to improve safety:\n\nCurrently, we have no plans to install new mitigation, control equipment nor to change technology.  \nThe Hydrogen facility was initially started up in 1996.  Process safety is evaluated regularly through conducting operational plant hazard reviews and studying incidents which have occurred within the chemical industry.  \n\nWe recently completed a project to eliminate onsite storage of ammonia to reduce the quantity maintained at our facility to less than 10,000 pounds.  This risk reduction project was a result of our on-going process safety evaluations."
    }
  ]
}