{
  "FacilityID": 2207,
  "FacilityName": "Provo City Corporation - Water Reclamation Plant",
  "FacilityStr1": "1685 South Eastbay Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Provo",
  "FacilityState": "UT",
  "FacilityZipCode": "84606",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49049",
  "LEPC": "Utah County LEPC",
  "FacilityLatDecDegs": "40.213333",
  "FacilityLongDecDegs": "-111.648611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ulgt.org/potw",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Provo City Corporation",
  "OperatorStr1": "PO Box 1849",
  "OperatorStr2": null,
  "OperatorCity": "Provo",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84603",
  "OperatorZipCodeExt": null,
  "RMPContact": "Merril Bingham",
  "RMPTitle": "Pubic Works Director",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000026964",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-04 00:00:00",
  "SafetyInspectionBy": "Consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-07-23 00:00:00",
  "DeRegistrationEffectiveDate": "2016-03-23 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.21333,
  "FRS_Long": -111.64861,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2423,
      "AltID": "Chlorination",
      "FacilityID": 2207,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2473,
          "ProcessID": 2423,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2578,
          "ProcessID": 2423,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502578,
          "ProcessID": 2423,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 2424,
      "AltID": "Sulfonation",
      "FacilityID": 2207,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2474,
          "ProcessID": 2424,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2579,
          "ProcessID": 2424,
          "ChemicalID": 49,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502579,
          "ProcessID": 2424,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2207,
      "SummaryText": "The main purpose of Provo City Water Reclamation Plant's (PWRP) Risk Management Plan  (RMP) is to prevent releases of chlorine and sulfur dioxide that could expose district employees and the public. PWRP's RMP program includes:\n1) Section 1 - an executive summary of PWRP's RMP;\n2) Section 2 - an assessment of the potential impacts of a major chlorine or sulfur dioxide release; \n3) Section 3 - a prevention program that details the intrinsic/extrinsic safeguards, control strategies and personnel procedures that are in place at the district; and \n4) Section 4 - an emergency response plan that describes the districts response in the event of a major chlorine or sulfur dioxide release.\n5) Section 5 - a copy of the completed RMP submittal form for submission to EPA.\nPWRP realizes that a successful RMP program helps minimizes the risk of human injury and prevents economic loss. An effective RMP program minimizes risk by promoting a safer and more efficient waste water treatment operation through better process control and preventive maintenance. Also, a well thought out Emergency Response Plan will help reduce the impact of a chlorine or sulfur dioxide release.\n\nThis RMP program meets the requirements of the Environmental Protection Agency 40 CFR part 68, which applies to facilities with certain threshold quantities (TQ) of hazardous chemicals, including chlorine ( TQ  1,500 lbs) and sulfur dioxide (TQ  1,000 lbs). PWRP uses chlorine to disinfect waste water and sulfur dioxide to help reduce the residual chlorine levels in treated water. PWRP maintains 6,000 lbs (3 one-ton cylinders) of chlorine and 4,000 lbs (2 one-ton cylinders) of sulfur dioxide on-site and, therefore, is required to have a RMP for these processes.\n\nIt is PWRP's goal to provide a safe and cost effective way for treating wastewater generated by residents and businesses. Unfortunately, present treatment operations at PWRP require the use of chlorine and sulfur dioxide. With respect for the potential hazar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2207,
      "SummaryText": "ds involved with using these chemicals PWRP has taken many steps to prevent their release.\n\nAccident History\nPWRP has been using chlorine to disinfect waste water since it began operations in 1959. Since that time there has not been one significant release of chlorine or sulfur dioxide. No PWRP employees have ever been injured by a chlorine or sulfur dioxide release. Furthermore, no off-site or public receptors, human or animal, have been injured by an air release of chlorine or sulfur dioxide. During the last 40 years of treating wastewater, PWRP has never had a significant chemical accident of any kind. \n\nPrevention Program\nDue to the highly automated and fault tolerant delivery system, the likelihood of even a minor release of chlorine or sulfur dioxide is very low. The entire delivery system, beginning at the one-ton cylinders and ending at the chlorine/sulfur dioxide injectors, is maintained under constant vacuum pressure. This system automatically and instantaneously shuts down the flow of chlorine/sulfur dioxide in the event of a fault in the system. The robust one-ton cylinders that chlorine and sulfur dioxide are stored in and dispensed from undergo rigorous integrity tests and are routinely inspected and reconditioned. These integrity tests and preventive maintenance are performed by the chemical distributor.\n\nNo only are PWRP's chlorination and sulfonation systems engineered to be very fault tolerant, but they are also operated in a safe manner. PWRP is very pro-active in accident prevention and preventive maintenance of their chlorine equipment and associated controls, including: \n routine upgrades, change-outs and rebuilding of disinfection delivery and storage equipment as recommended by equipment manufacturers, \n frequent mechanical integrity inspections on equipment and intrinsic and extrinsic safety controls for processes, and \n frequent inspections from outside contractors and safety advisors to insure that operator training and district operati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2207,
      "SummaryText": "ng procedures are efficiently established.\n\nEmergency Response\nIn the event of an emergency release of chlorine or sulfur dioxide, PWRP has highly trained operators both on-site and on call around the clock. These operators are certified by the state to safely operate the chlorination and sulfonation equipment. Moreover, these individuals receive frequent specific training for responding and managing chlorine/sulfur dioxide releases. PWRP operators are equipped and trained for chlorine/sulfur dioxide emergencies and coordinate emergency response activities with the Provo City Fire Department.\n\nPlanned Changes\nPWRP's chlorination and sulfonation systems are engineered to be very fault tolerant and are operated in a safe manner. However, PWRP understands that extreme and unforeseeable events could potentially push these systems beyond what they were designed to withstand. Therefore, as technology changes and different means of disinfection become practical solutions, PWRP will research and implement new equipment and processes to further reduce the hazards associated with the storage of chemicals that may harm district employees, the public or the environment.\n\nCertification Statement\nAs the District Manager of Provo City Water Reclamation Plant, I, the undersigned, certify that the following document is PWRP's Risk Management Program and describes our current operations and best efforts for preventing and planning for emergency releases of chlorine and sulfur dioxide. This program also meets the requirements of EPA's 40 CFR part 68.\n\n____________________________________\nMark Ogren, District Manager - PWRP"
    }
  ]
}