{
  "FacilityID": 22183,
  "FacilityName": "Shintech Louisiana, LLC",
  "FacilityStr1": "9750 LA-1 South",
  "FacilityStr2": null,
  "FacilityCity": "Addis",
  "FacilityState": "LA",
  "FacilityZipCode": "70710",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22121",
  "LEPC": "West Baton Rouge Parish LEPC",
  "FacilityLatDecDegs": "30.326028",
  "FacilityLongDecDegs": "-91.260333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "C-K Tech, Inc.",
  "Company2Name": "Shintech Incorporated",
  "CompanyDUNS": null,
  "Company2DUNS": 65095390,
  "OperatorName": "Shintech Louisiana, LLC",
  "OperatorStr1": "P.O. Box 358",
  "OperatorStr2": null,
  "OperatorCity": "Addis",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70710",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173509",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2639-V0",
  "SafetyInspectionDate": "2000-11-15 00:00:00",
  "SafetyInspectionBy": "Louisiana State Fire Marshal",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-12-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-12-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-11-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-11-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.325882,
  "FRS_Long": -91.261732,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31570,
      "AltID": "PVC Plant",
      "FacilityID": 22183,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 41301,
          "ProcessID": 31570,
          "ChemicalID": 101,
          "Quantity": 9500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 32389,
          "ProcessID": 31570,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17568,
              "Process_NAICS_ID": 32389,
              "SafetyReviewDate": "2000-07-05 00:00:00",
              "PHA_Date": "2000-07-05 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-08 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Level controls, automatic pressure & temperature controls",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Fire monitors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-11-16 00:00:00",
              "TrainingReviewDate": "2000-11-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": "Computer Based Training",
              "MaintenanceReviewDate": "2000-09-30 00:00:00",
              "EquipmentInspectionDate": "2000-11-16 00:00:00",
              "EquipmentTested": "PST 352 leak check",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-07-14 00:00:00",
              "PreStartupReviewDate": "2000-11-13 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-07-11 00:00:00",
              "HotWorkPermitReviewDate": "2000-07-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-07-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25569,
                  "PreventionProgram3ID": 17568,
                  "ProcessChemicalID": 41301
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22183,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-07-14 00:00:00",
    "ERTrainingDate": "2000-10-16 00:00:00",
    "CoordinatingAgencyName": "West Baton Rouge Parish LEPC",
    "CoordinatingAgencyPhone": "2253561577",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22183,
      "SummaryText": "SHINTECH LOUISIANA, INC.\nPVC MANUFACTURING FACILITY\n\nRisk Management Program Plan\n\n1.0 EXECUTIVE SUMMARY\n\nShintech Louisiana, Inc. (Shintech) will operate a newly constructed Polyvinyl Chloride (\"PVC\") Manufacturing Facility located in Addis, Louisiana.  This new facility, with an anticipated startup date early in December 2000, has been designed in a manner that will minimize the potential for accidental releases.  The Shintech PVC Manufacturing Facility is committed to operating this new facility in a manner that is safe for the plant workers, the public, and the environment.  C-K Tech, Inc. and Shintech Incorporated, Shintech's parent companies, have many years of experience and an excellent environmental and safety track record in the production of polyvinyl chloride.  It is Shintech's goal that in the conduct of its activities it will strive to protect and promote the health and safety of its employees, its neighbors, and others who may be affected by these activities, and to limit adverse effects on the physical environment in which its activities are carried out.  To assist in reaching this goal, Shintech has established systems to help ensure safe operation of the processes at this facility.  One part of these systems is a risk management program (RMP) that helps manage the risks at the Shintech Facility and that complies with the requirements of the Environmental Protection Agency's (EPA's) rule 40 CFR part 68, Accidental Release Prevention Requirements:  Risk Management Programs (the RMP rule), and the Louisiana Department of Environmental Quality regulation (LAC 33:III.Chapter.59).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at the Shintech Facility.  This document is intended to satisfy the RMP Plan executive summary requirement of the RMP rule and to provide the public with a description of the risk management program at the Shintech Facility.\n\n1.1 Accidental Release Preven"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22183,
      "SummaryText": "tion and Emergency Response Policies\n\nShintech is committed to minimizing potential risks to the general public, to the facility employees and to the environment.  A fundamental part of this commitment is the prevention of accidental releases of hazardous substances in and around the facility.  The Shintech Facility utilizes engineering controls, inspection programs, and detailed procedures as a means to prevent accidental releases.  In the event of a release, the facility has well trained emergency response teams to contain, mitigate, monitor, and stop the release.  The facility has fully staffed and trained emergency response teams for fire fighting and emergency rescue.  In addition to handling the release, the facility is also participating in established communication systems to alert the community in the event of a significant release. Through the coordination with the local emergency planning commission (LEPC), the facility has the ability to provide emergency notification to the local community through cable override systems, radio broadcasts, and/or through an automated telephone notification system.\n\nThe Shintech Safety/Environmental Supervisor has responsibility for the development, implementation of the risk management program for facility, and implementation of the facility process safety management (PSM) and accident prevention program.  However, the specific responsibilities for certain aspects of that program will be delegated to other personnel who will report either directly, or through other management personnel, to the Safety/Environmental Supervisor. Similarly, responsibility for the RMP hazard assessment and emergency response plan has been delegated to the Safety/Environmental Supervisor.  Furthermore, it is the facility's policy that safe operation is part of everyone's job; therefore, many other site personnel will also be involved in RMP activities on an ongoing basis.\n\n1.2 Facility Regulated Substances\n\nThe Shintech Facility is a polyvinyl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22183,
      "SummaryText": "chloride manufacturing site located near Addis, Louisiana.  The facility will use vinyl chloride monomer as raw material.  This substance (vinyl chloride) is flammable substance that EPA has specifically listed in the RMP rule and will be present in the facility's process above the EPA established threshold quantity of 10,000 pounds.\n\n1.3 Offsite Consequence Analysis\n\nStringent safeguards will be maintained to avoid accidental chemical releases.  However, no facility can provide 100 percent assurance that releases will not occur.  Hence, an offsite consequence analysis was performed to estimate the potential for an accidental release of a regulated substance that could affect the public or the environment.  This offsite consequence analysis consisted of evaluating both worst-case scenarios and alternative release scenarios.  Shintech does not expect a worst-case release scenario to ever occur.  An alternative release scenario represents a release that could reasonably occur during the lifetime of a facility like the Shintech Facility.\n\nThe following paragraphs briefly describe the scenarios analyzed and are the scenarios that have been included in the facility's risk management plan.  Please recognize that none of these events have occurred at our facility.  Also, emergency mitigation systems are in place in order to help reduce the consequences of the events if they should occur.  In all cases, if such events occurred, the emergency response plan would be used to respond to the event, notify local authorities, and take appropriate actions to protect both employees and the surrounding community.\n\nWorst-Case Release Scenarios\n\nThe projected worst-case scenario at the facility is a vapor cloud explosion (VCE) involving the release of the full inventory of the largest storage vessel containing vinyl chloride monomer (VCM) with the greatest distance to the endpoint.  The analysis assumes that the maximum possible inventory of 8,400,000 pounds is released, completely va"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22183,
      "SummaryText": "porizes, and ignites, resulting in a VCE.  This would result in an impact zone having approximately 1.22 miles from the point of release.  Although the PVC Plant has numerous controls to prevent such releases and to manage their consequences, no credit for mitigation measures was taken into account in evaluating this worst-case scenario as specified by EPA. Shintech has designed the VCM storage and handling facilities to minimize the potential of accidental release.\n\nAlternative Release Scenarios\n\nThe more realistic accidental release scenario involves the release of VCM from a polymerizer relief valve resulting in VCE.  This release scenario would release 1,000 pounds of the flammable material in the time required to isolate the release.  This result would result in a maximum predicted impact zone of 0.03 miles from the point of release, which is well within the proposed property boundary.  Since the accidental does not produce an offsite impact, no adverse impact to the public or to the environment is expected from this release.\n\n1.4 Accidental Release Prevention Program\n\nBecause the facility is also subject to the Occupational Safety and Health Administration (OSHA) process safety management (PSM) standard, and because the OSHA PSM requirements are very similar to the EPA RMP requirements, this summary addresses each of the OSHA PSM elements. The PSM program at this facility has been extended by the facility, where necessary, to satisfy EPA's Program Level 3 accident prevention program requirements.\n\nEmployee Participation\n\nShintech will encourage employees to participate in all facets of process safety management and accident prevention.  Specific ways that employees can be involved in the accident prevention program will be documented in an employee participation plan that will be maintained at the facility and will address each accident prevention program element.\n\nProcess Safety Information\n\nThe Shintech Facility will keep a variety of technical documents use"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22183,
      "SummaryText": "d to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  Specific departments within the facility are assigned responsibility for maintaining up-to-date process safety information.  \n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by documents that specifically address known concerns and hazards associated.  In addition, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the operation manuals.  Shintech will ensure that the process is maintained within these limits by using process controls and monitoring instruments, operating procedures, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\nShintech will also maintain numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis\n\nThe Shintech Facility has a comprehensive PHA program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, the covered process is systematically examined to identify hazards that may result in catastrophic releases of VCM and ensure that adequate controls are in place to manage those hazards."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22183,
      "SummaryText": "The facility primarily uses the \"What If\" analysis technique to perform these evaluations.  These analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as recommends accident prevention and/or mitigation measures when the team believes such measures are necessary.\n\nTo help ensure that the process controls and/or process hazards do not deviate significantly from the original design safety features, the facility will periodically update and revalidate its process hazard analyses. These periodic reviews are to be conducted at least every five years and will continue to be conducted at this frequency.  The results and recommendations from these updates will be documented and retained.\n \nOperating Procedures\n\nThe Shintech Facility maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  Procedures will be maintained current by revising them as necessary to reflect changes made to the process.  In addition, the facility's operating procedures provide guidance on how to respond to events that result in exceeding safe operating limits for specific process or equipment parameters.  The written operating procedures are readily available to operators and for other personnel to use as necessary to safely perform their job tasks.\n\nTraining\n\nTo complement the written procedures for process operations, the Shintech Facility has implemented a training program for all employees involved in operating a process.  All operations employees receive basic training in the facility operations.  In addition, all operators will periodically re"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22183,
      "SummaryText": "ceive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training will be conducted every 3 years.  Operators will be given the opportunity to take part in more frequent refresher training if desired.  This training is documented for each operator, including the means used to verify that the operator understood the training.\n\nContractors\n\nThe Shintech Facility will use contractors to supplement its work force throughout the year as needed.  Because some contractors work on or near process equipment, Shintech's contractors will maintain procedures to ensure that contractors perform their work in a safe manner, possess the appropriate knowledge and skills needed, are trained of the hazards in the workplace, and are aware of the procedures to take in the event of an emergency.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, (4) safe work practices, and (5) a work permit process prior to their beginning work. In addition, Shintech will consider contractor safety programs and performance during the selection of a contractor.  Shintech management personnel will periodically monitor contractor performance to insure that contractors are fulfilling their safety obligations.\n\nPre-startup Safety Reviews\n\nShintech personnel will conduct a pre-startup safety review for any facility modification that requires a change in the process safety information (not required for replacement in kind).  The purpose of the review is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  A review involves field ve"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 22183,
      "SummaryText": "rification of the construction and serves a quality assurance function.\n\nMechanical Integrity\n\nShintech personnel will establish practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program will include:  (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that will maintain the mechanical integrity of the process equipment.\n\nShintech maintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner.  Written procedures will help to ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests will be performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits.  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance. The Shintech Facility will incorporate quality assurance measures into equipment purchases and repairs.  This will help to ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\n\nThe Shintech Facility has practices in place to help ensure worker and process safety.  Examples of these include (1) contr"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 22183,
      "SummaryText": "ol of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control welding and other spark-producing activities, and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nManagement of Change\n\nThe Shintech Facility has a comprehensive system to manage changes to processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process technology information, and equipment information, as well as procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training on the change.\n\nIncident Investigation\n\nShintech personnel will promptly investigate all incidents that result in, or reasonably could result in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  Incident investigation reports will be retained so that the reports can be reviewed during future PHAs and PHA revalidations.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 22183,
      "SummaryText": "functioning properly, the Shintech Facility will periodically conduct audits to confirm the procedures and practices required by the accident prevention program are being implemented. Compliance audits will be conducted at least every 3 years.  The final resolution of each finding will be documented, and recent audit reports are retained.\n\nChemical-Specific Prevention Steps\n\nThe process at the Shintech Facility will have hazards that must be managed to ensure continued safe operation.  The accident prevention program summarized previously will be applied to the facility once in operation. Collectively, these prevention program activities help prevent potential accident scenarios involving the release of VCM caused by equipment failures or human errors.\n\nIn addition to the accident prevention program activities, the Shintech Facility has many safety features to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of a release.  The following types of safety features are used in various processes:\n\nRelease Detection\n\n· Area ambient air monitoring system\n\nRelease Containment/Control\n\n· Process relief valves to prevent overpressure damage to equipment;\n· Scrubbers to neutralize chemical releases;\n· Manual and automatic valves to permit isolation of vessels;\n· Automated shutdown systems for specific process parameters (e.g., high level, high temperature);\n· Dikes to contain liquid releases;\n· Release mitigation systems (water spray systems);\n· Fire suppression and extinguishing systems;\n· Trained emergency response personnel;\n\n1.5 Five-year Accident History\n\nThe Shintech Facility is a new facility in which operation has not yet begun; therefore, there are not incidents to be reported with the five-year accident history.\n\n1.6 Emergency Response Program Information\n\nThe Shintech Facility maintains a written Emergency Response Plan (ERP), which aims to protect employees, public health, and the environment.  The purpose of the ERP"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 22183,
      "SummaryText": "is to minimize potential adverse impacts on the facility and surrounding areas in the event of an emergency situation.  The plan consists of procedures for responding to such emergencies as fires, explosions, hazardous gas or liquid releases, natural disasters, and terrorist threats.  The plan addresses all aspects of emergency response including coordination of clean-up activities with mutual aid organizations, timely notification of authorities, maintenance of proper documentation, and guidelines for compliance with applicable government regulations. Furthermore, the Shintech Facility has procedures that address proper use, maintenance, inspection, and testing of emergency response equipment. All employees will receive safety and process control training to instruct them in proper emergency response procedures.  The overall ERP for the PVC Plant is coordinated with the West Baton Rouge Parish LEPC and the Iberville Parish LEPC.\n\nIn order to keep the plan up to date, the emergency response procedures will be reviewed annually.  Necessary revisions will be made and distributed to the plan holders by the safety department.  Affected personnel will be trained in regards to the changes in the ERP.\n\n1.7 Planned Changes to Improve Safety\n\nThe Shintech Facility plans to constantly strive to improve the safety of its operations through periodic safety reviews, the incident investigation program, and a program soliciting safety suggestions from the workers."
    }
  ]
}