{
  "FacilityID": 22257,
  "FacilityName": "UCB Films, Inc.",
  "FacilityStr1": "6000 SE 2nd Street",
  "FacilityStr2": null,
  "FacilityCity": "Tecumseh",
  "FacilityState": "KS",
  "FacilityZipCode": "66542",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20177",
  "LEPC": "Shawnee County LEPC",
  "FacilityLatDecDegs": "39.051972",
  "FacilityLongDecDegs": "-95.568333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 69247948,
  "ParentCompanyName": "UCB, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 43546522,
  "Company2DUNS": null,
  "OperatorName": "UCB Films, Inc.",
  "OperatorStr1": "6000 SE 2nd Street",
  "OperatorStr2": null,
  "OperatorCity": "Tecumseh",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66542",
  "OperatorZipCodeExt": null,
  "FTE": 231,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000100106",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1770035",
  "SafetyInspectionDate": "1999-05-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2000-12-20 00:00:00",
  "ErrorReportDate": "2000-12-20 00:00:00",
  "ReceiptDate": "2000-12-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2000-12-12 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.05336,
  "FRS_Long": -95.557551,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31715,
      "AltID": null,
      "FacilityID": 22257,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 41499,
          "ProcessID": 31715,
          "ChemicalID": 8,
          "Quantity": 340000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 32534,
          "ProcessID": 31715,
          "NAICSCode": "322221",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 12218,
              "Process_NAICS_ID": 32534,
              "SafetyReviewDate": "2000-08-15 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2000-08-15 00:00:00",
              "ChangeCompletionDate": "2000-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "2000-08-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-08-15 00:00:00",
              "EquipmentInspectionDate": "2000-08-15 00:00:00",
              "EquipmentTested": "All",
              "ComplianceAuditDate": "2000-08-15 00:00:00",
              "AuditCompletionDate": "2000-12-30 00:00:00",
              "IncidentInvestigationDate": "2000-12-05 00:00:00",
              "InvestigationChangeDate": "2000-12-30 00:00:00",
              "MostRecentChangeDate": "1997-08-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 12807,
                  "PreventionProgram2ID": 12218,
                  "ProcessChemicalID": 41499
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22257,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-08-01 00:00:00",
    "ERTrainingDate": "2000-11-30 00:00:00",
    "CoordinatingAgencyName": "Shawnee County LEPC",
    "CoordinatingAgencyPhone": "7852338200",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22257,
      "SummaryText": "RISK MANAGEMENT PLAN - EXECUTIVE SUMMARY\n\nUCB operates a cellophane manufacturing facility in Tecumseh, KS. The facility is located at 6000 SE 2nd St. Overall, the facility employs 220 full-time employees.\n\n1.\tThe Accidental Release Prevention and Emergency Response Policies at the Stationary Source (68.155(a))\nUCB is committed to operating the Tecumseh Plant in a manner that is safe for its workers, the public, and the environment. It is our policy to adhere to all applicable Federal, State and local rules and regulations, industry standards and best practices.  As part of this commitment, UCB has established a system to help ensure safe operation of the processes at this facility which includes the prevention of accidental releases of hazardous substances.  One component of this system is a risk management program (RMP) that helps manage the risks at the plant and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirement Risk Management Programs (the RMP rule). This document is intended to satisfy the RMP Plan requirement of the RMP rule and to provide the public with a description of the risk management program at the Tecumseh Plant.\n\nThe risk management program at the Tecumseh Plant consists of the following three elements:\n \n· A hazard assessment to help understand (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule (regulated substances).\n \n· A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes).\n\n· An emergency response program to help respond to accidental releases of regulated substances from covered processes\n\nInformation further describing these elements is provided in this RMP Plan.\n\nAlthough the RMP at the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22257,
      "SummaryText": "Tecumseh Plant helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety and environmental program at the plant.  The Tecumseh Plant has a comprehensive safety and environmental program in place, establishing many levels of safeguards against release of a hazardous substance as well as injuries and damage from such a release.\n\nUCB limits the use of hazardous substances.  Before using a hazardous substance at the Tecumseh Plant, less hazardous alternatives are considered. When a hazardous substance is used at the plant, UCB considers the potential for this substance to adversely affect plant workers, the public, and the environment and takes steps to prevent any such effects.\n\nUCB strives to prevent releases of the hazardous substances used at the facility.  UCB implements reasonable controls to prevent foreseeable releases of hazardous substances.  When a hazardous substance is used at the plant, the equipment is carefully designed, installed, operated, and maintained to reduce the likelihood of an accidental release.  Industry and government standards are closely adhered to in the design, construction, and operation of the equipment.  Each project is thoroughly reviewed before approval.  In addition, UCB requires the documentation of standard operating procedures and the training of employees with regard to these procedures as part of the MOC procedure for all new or modifications to existing process.  UCB's mechanical integrity program provides an ongoing process to verify the mechanical integrity of the equipment, piping and instruments to prevent the release of hazardous substances.\n\nUCB's goal is to minimize impacts from an accidental release. In the event of an accidental release, the Tecumseh Plant controls and contains the release in a manner that will be safe for workers and will prevent injury to the public and the environment.  UCB utilizes emergency response plans as required by federal"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22257,
      "SummaryText": "regulation.  UCB trains its workers to respond defensively to an accidental release, reducing the consequences of a release if it occurs.  In addition, UCB is in the process of co-ordination with the local fire department and with the local emergency planning committee (LEPC) to help prevent injuries and/or environmental damage if a release does occur.\n\n\n2.\tThe Stationary Source and Regulated Substances Handled (68.155(b))\nThe Tecumseh Plant handles one regulated substance in sufficient quantity to be covered by the RMP rule, as shown in the following list of RMP-covered Program Level 2 process(es) at the plant.\n\n                                                                          Largest Vessel\nRegulated Substance          Process                   Inventory, lb.            RMP Threshold, lb.\nCarbon Disulfide               CS2 System                   112,000                           20,000\n\nCarbon Disulfide is used as a raw material for Cellophane. The specific hazards of Carbon Disulfide are as follows:\n· a flammable liquid, a toxic liquid (only on \"toxic\" list under RMP)\n· irritating to the eyes, ears, nose, and throat\n· a suspected reproduction hazard\n· adversely affects the heart and central nervous system\n\n\n3.\tThe Worst-case Release Scenario(s) and the Alternative Case Release Scenario(s), Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario (68.155(c))\nThe Tecumseh Plant performed an off-site consequence analysis to estimate the potential for accidental release of a regulated substance to affect the public or the environment.  The off-site consequence analysis evaluates a \"worst-case release scenario \" and an \"alternative case release scenario\".  The plant does not expect a worst-case release scenario to ever occur. \n\nALOHA software was used for calculating the chemical release rates and evaluating the distance to the toxic endpoint for the worst-case and alternative case scenarios.  The meteorolog"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22257,
      "SummaryText": "ical data used for the modeling was the EPA default for the worst-case scenario and EPA-suggested values for the alternative case scenario. The EPA-recommended Landview III Program, available from the U.S. Census, was utilized to estimate the number of people living within worst-case and alternative case distances from the location of the storage tank and the public and environmental receptors located within these distances.\n\nThe following information summarizes the off-site consequence analysis performed by the Tecumseh Plant:\n\n3.1.\tProgram 2 Process(es) - Toxic Substance(s)\nThe \"worst-case release scenario\" for Carbon Disulfide is based on a full release of the largest tank (10,800 gallons or 112,000 pounds).  It was determined that the distance to the toxic endpoint is 0.49 miles.  The U.S. Census indicates that 44 people live within this distance from the location of the tank.  Several public receptors are also located within this distance including residences, commercial areas, and recreation areas.  No environmental receptors are located within this distance.\n\nAs required by the EPA, this worst-case analysis discounted the presence of all active mitigation systems, including the water mote beneath the carbon disulfide tanks.  Under an actual worst-case release, the water would float on top of the denser carbon disulfide, providing a blanket that would capture the vast majority of chemical vapors.\n\nThe \"alternative case release scenario\" for Carbon Disulfide is a liquid release of the full contents of the transfer hose during delivery.  To be conservative, it was assumed that the liquid spill would occur outside the diked area onto an impervious surface.  The total liquid spill was calculated at 43 pounds.  Vapors would be emitted from the resulting pool at a rate of 1.3 pounds per minute, for 34 minutes (until the liquid pool is evaporated).  Based on this data, it was determined that the distance to the toxic endpoint is approximately 0.03 miles.  No people,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22257,
      "SummaryText": "public receptors, or environmental receptors are located within this distance.\n\n3.2.\tProgram 2 Process(es) - Flammable Substance(s)\nThere are no RMP-applicable flammable substances at the facility.\n\n\n4.\tThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps (68.155(d))\nSince 1997, the Tecumseh Plant has used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1999, the plant formalized this prevention program for the cellophane manufacturing and storage process.\n\nIn 1996, the EPA RMP rule established another level of prevention requirements:\n\nThe following sections briefly describe the elements of the Tecumseh Plant's Program 2 prevention program that addresses EPA's RMP rule prevention program requirements.\n\n4.1.\tProgram 2 Prevention Program\nThe Tecumseh Plant's Program 2 prevention program consists of the following elements:\n\n4.1.1.\tSafety Information\nThe Tecumseh Plant maintains a variety of technical documents that are used to help ensure safe operation of the plant processes. These documents address (1) physical properties of hazardous substances handled at the plant, (2) operating parameters of the equipment used at the plant, and (3) design basis and configuration of the equipment at the plant.  The plant ensures that this process safety information is available to all employees, the LEPC, the Tecumseh Fire Department, the St. Francis Hospital, and the Shawnee County Sheriff's Office.\n\nMaterial safety data sheets (MSDSs) document the physical properties of the hazardous materials handled at the plant, including regulated substances in covered processes. The information available for each hazardous substance typically includes:\n\n· Toxicity information and permissible exposure limits \n· Physical data (e.g., boiling point, melting point, flash point) \n· Reactivity and corrosively data \n· Thermal and chemical stability data\n· Hazards of mixing substances in the process\n\nMSDSs for hazard"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22257,
      "SummaryText": "ous substances handled in each process are available at 9 Location in the Plant so that the operators have ready reference to this information.  In addition, MSDSs for products stored in amounts exceeding applicable thresholds are provided to the LEPC and the fire department for use in helping formulate emergency response plans.\n\nThe engineering design documents include the operating parameters and the design basis and configuration of the equipment in each covered process.  The available information includes:\n\n· Operating parameters\n· Block flow or simplified process flow diagrams\n· Process chemistry\n· Maximum intended inventories\n· Safe upper and lower limits for parameters such as temperature, pressure, or flow\n· Consequences of deviations from established operating limits\n· Design basis and configuration of equipment\n· Piping and instrumentation diagrams, including materials of construction\n· Electrical classification\n· Safety systems\n· Applicable design codes and standards\n· Design basis for relief and ventilation systems\n\nWhen important information was not available from the design documents, it was developed through special projects or, in the case of operating parameters, during process hazard analyses of the process.  Many of the operating parameters are included in the operating procedures to help with the safe operation of the process.  These documents are used to (1) train employees, (2) perform process hazards analyses, and (3) help maintain the equipment.\n\n4.1.2.\tHazard Review\nThe Tecumseh Plant performs and updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering and process operating experience and a leader with process hazard analysis experience is assembled to analyze the hazards of the process.  The plant primarily uses the \"what-if checklist\" (HAZOP) technique to perform this ana"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22257,
      "SummaryText": "lysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n4.1.3.\tOperating Procedures\nTecumseh Plant process engineers, operators, and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n\n· Steps for safely conducting activities \n· Applicable process safety information, such as safe operating limits and consequences of process deviations\n· Procedures for safe work practices such as Lock, Tag and Try; Hot Work; Confined Space Entry; and Line Breaking\n· Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs\n\nPlant personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations.\n\n4.1.4.\tTraining\nThe Tecumseh Plant is in the process of training its workers to safely and effectively perform their assigned tasks.  The training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and observed skill demonstration will be used to verify that an employee understands the training material before the employee can resume work in the process.  The oper"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 22257,
      "SummaryText": "ators are consulted annually at safety meetings to evaluate the effectiveness and frequency of the training.  Recommendations from the operators are reviewed, and changes to the training program are implemented as appropriate.\n\nThe Tecumseh Plant established a program to help ensure that contractor activities at the plant are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that the plant only hires contractors who can safely perform the desired job tasks.  The plant explains to the contract supervisors the hazards of the process on which they and their employees will work, the plant's safe work practices, and the plant's emergency response procedures.  The plant requires that the contractor supervisors train each of their employees who will work at the plant before that worker begins work at the plant site.  The plant periodically reviews contractors' training documents and work performance to help ensure that safe practices are followed.\n\n4.1.5.\tMaintenance\nThe Tecumseh Plant maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration, and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plant's processes.  The mechanical integrity program includes:\n\n· Specifications for inspection and testing of process equipment \n· Specifications for replacement parts and equipment \n· Procedures for inspecting, testing, and maintaining process equipment \n· Training of maintenance personnel \n· Documentation of maintenance activities\n\n4.1.6.\tCompliance Audit\nThe Tecumseh Plant audits covered processes to be certain that the prevention program is effectively addressing the safety issues of operati"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 22257,
      "SummaryText": "ons at the plant.  The plant assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n4.1.7.\tIncident Investigation\nThe Tecumseh Plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future.  The plant trains employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within forty-eight (48) hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  UCB has a formal program including training for incident investigations and incident report generation. \n\n\n5.\tThe Five -Year Accident History (68.155(e))\nThe Tecumseh Plant has completed a five year accident review beginning in 1994 that indicates no off-site releases of toxic compounds.  \n\n\n6.\tThe Emergency Response Programs (68.155(f))\nThe Tecumseh Plant has established a written emergency response program to help safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for the following: \n\n· Informing the local fire department and the public about accidental releases that could reasonably result in off-site consequences\n· Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the plant\n· Controlling and containing accidental releases of hazardous Substances, including the use of emergency response equipment\n· Inspecting a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 22257,
      "SummaryText": "nd maintaining emergency response equipment\n· Reviewing and updating the emergency response plan\n\nThe Tecumseh Plant contracts an emergency response team trained in these emergency responses procedures.  All plant personnel are trained in evacuation procedures.  The written emergency response plan complies with the following federal contingency plan regulations:\n\n· EPA 40 CFR 302.6 - Notification Requirements\n· EPA 40 CFR 355.30 - Facility Coordinator and Emergency Response Plan\n· EPA 40 CFR 355.40 - Emergency Planning and Release Notifications\n· EPA 40 CFR 68 - Risk Management Programs for Chemical Accidental Release Prevention\n\nThe emergency response plan has been communicated to local emergency response officials through the local fire department and LEPC.  The plant maintains a regular dialogue with the local fire chief and LEPC, and the plant provides appropriate information to the fire chief and LEPC.  The Tecumseh Plant has a contract Emergency Response Team (ERT) available 24 hours per day to respond to plant chemical emergencies. \n\n\n7.\tPlanned Changes to Improve Safety (68.155(g))\nThe Tecumseh Plant constantly strives to improve the safety of the processes at the facility through both the incident investigation program and a program soliciting safety suggestions from the workers.  The following changes to improve process safety are planned or have recently been completed: \n\n· CS2 storage facility\n· CS2 recovery improvements\n· CS2 feed to xanthation process\n\n\n8.\tCertification (68.185)\nGeneral Certification:  To the best of my knowledge, information, and belief formed after reasonable inquiry, the information submitted in this RMP Plan is true, accurate, and complete.\n\nSignature:\tMohamed Fahmy                                  Date Signed:\tDecember 5, 2000\n\nTitle:\tPlant Manager-Cello\n\n*  The Certification with original signature is presented in the attached cover letter."
    }
  ]
}