{
  "FacilityID": 22264,
  "FacilityName": "Costco Wholesale - College Park",
  "FacilityStr1": "4250 S. Fulton Parkway",
  "FacilityStr2": null,
  "FacilityCity": "College Park",
  "FacilityState": "GA",
  "FacilityZipCode": "30349",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13121",
  "LEPC": "Fulton County LEPC",
  "FacilityLatDecDegs": "33.621611",
  "FacilityLongDecDegs": "-84.534694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": "www.costco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Costco Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808696844,
  "Company2DUNS": 0,
  "OperatorName": "Costco Wholesale",
  "OperatorStr1": "4250 S. Fulton Parkway",
  "OperatorStr2": null,
  "OperatorCity": "College Park",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30349",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173714",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2000-12-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-12-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-12-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-12-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.62161,
  "FRS_Long": -84.53469,
  "FRS_Description": "PLANT ENTRANCE (FREIGHT)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 31750,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 22264,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 41537,
          "ProcessID": 31750,
          "ChemicalID": 56,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 32569,
          "ProcessID": 31750,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17694,
              "Process_NAICS_ID": 32569,
              "SafetyReviewDate": "2000-10-01 00:00:00",
              "PHA_Date": "2000-11-02 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-11-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Emergency shut down switch",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Refrigeration computer monitoring system",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Revision of maintenance and emergency response procedures",
              "OpProceduresReviewDate": "2000-11-01 00:00:00",
              "TrainingReviewDate": "2000-10-09 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-11-01 00:00:00",
              "EquipmentInspectionDate": "2000-11-13 00:00:00",
              "EquipmentTested": "pressure test of piping, vessels prior to receiving initial ammonia charge",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2000-10-09 00:00:00",
              "PreStartupReviewDate": "2000-11-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-10-09 00:00:00",
              "HotWorkPermitReviewDate": "2000-10-09 00:00:00",
              "ContractorSafetyReviewDate": "2000-10-09 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25753,
                  "PreventionProgram3ID": 17694,
                  "ProcessChemicalID": 41537
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22264,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fulton Co. Emerg. Management Agency",
    "CoordinatingAgencyPhone": "4047305600",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22264,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Costco Wholesale facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations.\n\nCostco Wholesale has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of Costco Wholesale to evacuate and to allow the fire department/HazMat Team to respond to the emergency.  The refrigeration contractor will be available for guidance and assistance.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nConstruction of the ammonia refrigeration system at Costco Wholesale was completed in November 2000.  The facility is new and operations are scheduled to commence once the refrigeration system is fully functional.  The facility serves as a distribution point for chilled goods that are shipped to Costco Wholesale retail outlets.  The facility is located at 4250 S. Fulton Parkway in College Park, Georgia about 3 miles west of the junction of the Interstate 85 and Interstate 285 freeways.  The immediate area is primarily undeveloped with some ligh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22264,
      "SummaryText": "t commercial areas.  The ammonia system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe ammonia refrigeration system uses approximately 21,500 pounds of ammonia for cross dock operations, warehouse cold storage, and freezer storage.  The majority of the system is located in the machine room including vessels, compressors, and associated piping.  The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the thermosyphon  receiver to the high pressure receiver.  The thermosyphon receiver maintains a liquid level that is used for cooling of the compressor oil.  Excess liquid is drained to the high pressure receiver, which supplies liquid to the intermediate temperature and high temperature recirculator vessels.  The intermediate temperature recirculator feeds the low temperature recirculator.  As the ammonia enters each recirculator vessel, it is expanded through a hand expansion valve, reducing the pressure (and hence the temperature) in order to maintain a predetermined internal (high, medium, low) pressure.  Each recirculator supplies overfed pumped liquid ammonia to a distinct set of evaporators.  The high temperature recirculator  serves sixteen (16) cross dock evaporators.  The medium temperature recirculator serves eight (8) cooler evaporators, and the low temperature recirculator serves four (4) freezer evaporators.  Fans in each evaporator are used to blow air across the coils which partially vaporizes the liquid ammonia in the coils as heat from the room is transferred to the ammonia.\n\nThe resulting two-phased (liquid/vapor) ammonia from each set of evaporators is returned to its respective recirculator vessel in which constant pressures (temperatures) are maintained based on the suction pressure of the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22264,
      "SummaryText": "corresponding compressors.  The vapor from each recirculator vessel is then drawn to seven (7) compressors where the pressure and temperature of the gas is increased.  All seven compressors work in combination to compress the vapor pulled from the three recirculators.  Compressor discharge (high pressure ammonia vapor, or hot gas) is routed to one (1) condenser where it is condensed to a high pressure liquid (by discharging latent heat to the atmosphere) and drained back to the thermosyphon receiver.  Hot gas is also used  for defrost of the freezer and cooler evaporators.  An auto purger periodically purges the system of non-condensibles collected in the condensers.  Dual pressure relief valve assemblies are installed on each vessel to relieve high pressure ammonia to a water diffusion tank through a common header in case of a high pressure event.\n\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of ammonia that can be stored in a vessel - 18,000 pounds in 10 minutes.  (The capacity of the High Pressure Receiver is approximately 18,000 pounds of ammonia.)  The most pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  Reference tables in the EPA-approved Risk Management Program Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in rural conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n*  Alternative Release Result Summary\n\n     Scenario Description: A release of ammonia from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of ammonia due to the pressure of the tank is 126 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  Reference tables in the Risk Management Program Guidance for Ammonia Refrigeration we"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22264,
      "SummaryText": "re used to determine the maximum distance to the toxic endpoint of 200 ppm in rural conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Costco Wholesale ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Costco Wholesale facility operates in accordance with OSHA's Process Safety Management regulation.  Refrigeration contractors, experts in the ammonia refrigeration industry, are contracted at the facility to maintain the system and perform any repairs.\n\nThe Costco Wholesale facility including each ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in the cold storage areas, and automatic shut down systems that prevent equipment damage and ammonia releases.  In addition, the majority of the ammonia inventory is maintained inside the machine room and just outside of the machine room (condensers).  All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to a water diffusion tank.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\"\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThis facility including the ammonia refrigeration system is new as of November 2000.  There have been no ammonia-related accidents a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22264,
      "SummaryText": "t the facility.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nCostco Wholesale has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\nIn case of an ammonia release emergency, Costco Wholesale plans to evacuate all employees stationed in the cold storage warehouse and alert the local emergency responders (fire department).  The emergency response efforts will also be coordinated with the managers at the dry building at the facility, as both depots are located on the same property.  Costco Wholesale plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis provided mitigation measures to improve safety at the Costco Wholesale facility located at 4250 S. Fulton Parkway in College Park, Georgia.  Many of the recommendations are complete and implemented as of the system startup date.  All recommendations are scheduled to be complete by November 1, 2001.\n\n\nR01    All employees must have the following information: 1) general awareness of ammonia at the facility, 2) how to report an a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22264,
      "SummaryText": "mmonia release, 3) where to go when they are told to evacuate.\n\nR02    Consider installing a visual alarm on the outside of the engine room to be activated during an ammonia detection.\n\nR03    Include a periodic test and calibration of the ammonia detectors in the facility's maintenance program.\n\nR04    Ensure that neither extraneous equipment nor flammable materials are stored in the ammonia engine room.\n\nR05    Ensure that all pressure relief valves in the system are replaced or recertified on a 5 year schedule.  Also, replace any relief valve that engages to vent pressure.\n\nR06    Ensure that eye wash / safety shower stations are located in and outside the ammonia engine room.\n\nR07    Coordinate emergency response procedures and policies with the local fire department (or other responders) and the refrigeration contractor on a periodic and ongoing basis.\n\nR08    Investigate where the floor drains in the engine room are routed.  Ensure that emergency evacuation assembly areas are not located near manholes or vents from that draining system (storm drain, sewer).\n\nR09    Exercise important hand valves on an annual basis.  Include the activity in the annual maintenance schedules.\n\nR10    Perform an annual test of the mechanical high level cut out float switches on each of the recirculator vessels.  Document the test in the maintenance program.\n\nR11    Ensure that an oil draining procedure is documented and followed, including refrigeration contractors.\n\nR12    Require a Costco Wholesale employee to perform and document a daily walkthrough of the engine room on a log sheet.\n\nR13    Ensure that all the evaporator coils are cleaned and maintained periodically.\n\nR14    Establish a maintenance program for all ammonia equipment that includes manufacturer recommendations and/or industry standards.\n\nR15    Ensure that the Condensers are periodically maintained including a water treatment service and cleaning out the water reservoir.\n\nR16    Consider implementing a procedure "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22264,
      "SummaryText": "to ensure that a (contracted) ammonia operator checks in with a Costco supervisor prior to performing work on the roof (or in another isolated location).\n\nR17    Ensure that a water source (i.e. portable water bottle, hose, eye wash station) is located on the roof near the Condensers.\n\nR18    Perform a periodic pH check of the water in the diffusion tank (a higher pH indicates an ammonia leak).  Ensure that the water is kept free from bacterial growth.\n\nR19    Ensure that all piping is labeled as to the contents and the flow direction.\n\nR20    Install wind socks (or other wind direction indicators) in locations that can be seen from all potential emergency exits (i.e. engine room roof, receiving roof, shipping roof).\n\nR21    Install ammonia safety placards on all doors to the ammonia engine room.\n\nR22    Ensure that (at least) annual evacuation drills are held at the facility."
    }
  ]
}