{
  "FacilityID": 2238,
  "FacilityName": "Lone Butte Wastewater Treatment Plant",
  "FacilityStr1": "I-10 and Maricopa Road",
  "FacilityStr2": "PO Box 4008, MS 912",
  "FacilityCity": "Chandler",
  "FacilityState": "AZ",
  "FacilityZipCode": "85244",
  "Facility4DigitZipExt": "4008",
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.257972",
  "FacilityLongDecDegs": "-112.017417",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Chandler",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Chandler",
  "OperatorStr1": "I-10 and Maricopa Road",
  "OperatorStr2": "PO Box 4008, MS 912",
  "OperatorCity": "Chandler",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85244",
  "OperatorZipCodeExt": "4008",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028114",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-07-30 00:00:00",
  "DeRegistrationEffectiveDate": "2002-07-17 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.260368,
  "FRS_Long": -112.016065,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2456,
      "AltID": null,
      "FacilityID": 2238,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 2614,
          "ProcessID": 2456,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2506,
          "ProcessID": 2456,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1658,
              "Process_NAICS_ID": 2506,
              "SafetyReviewDate": "1999-05-05 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Hazardous Materials Management Plan",
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-05 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-15 00:00:00",
              "TrainingReviewDate": "1999-04-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-23 00:00:00",
              "EquipmentInspectionDate": "1999-03-23 00:00:00",
              "EquipmentTested": "Chlorinator and supply piping",
              "ComplianceAuditDate": "1999-05-20 00:00:00",
              "AuditCompletionDate": "1999-05-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1678,
                  "PreventionProgram2ID": 1658,
                  "ProcessChemicalID": 2614
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2238,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-16 00:00:00",
    "ERTrainingDate": "1999-03-11 00:00:00",
    "CoordinatingAgencyName": "Chandler & Gila River Fire Depts",
    "CoordinatingAgencyPhone": "4807862712",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2238,
      "SummaryText": "Site Safety Analysis\n\nDue to the remote nature of the chlorine treatment facility in relation to the remotely sited wastewater treatment facility, in conjunction with established engineering controls, training, personal protective equipment, policies and procedures and consultation with the Arizona Industrial Commission Compliance Office, Lone Butte Wastewater Treatment Facility is not subject to the requirements of the Process Safety Management Program, 29 CFR 1910.119.  Because of this analysis, Program Level 2 was chosen for this RMP.\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nThe Lone Butte Wastewater Treatment Plant is committed to employee, public and environmental safety. The accidental release prevention program provides five layers of safety and environmental protection: employee training, mechnical integrity, hazard reviews, process controls, montoring systems, and emergency response. The Chandler Fire Department provides automatic mutual aid to the Gila River Fire Department for emergency response expertise to the site.  A complete Hazardous Materials Management Plan (HMMP) is submitted to the Chandler Fire Department and the Gila River Fire Departments annually for compliance. The HMMP is reviewed by the both Fire Departments, an HMMP complinance inspection is completed by the Gila River Fire Department.  \n\n2. Regulated Substances Handled\n\nThe Lone Butte Wastewater Facility's primary activities encompass TREATMENT OF PUBLIC WASTEWATER UTILITY SYSTEM. There is one regulated substance present at the facility. \nThe maximum inventory of Chlorine at the facility is 12,000 lb.\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo evaluate the worst case and alternative scenarios, RMP*Comp (TM) was used. The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2238,
      "SummaryText": "elated to the hazard review are addressed in a timely manner.\n\n4.3 Operating Procedures\n\nFor the purposes of safely conducting activities within covered processes, the Lone Butte Wastewater Treatment Facility maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n4.4 Training\n\nThe Lone Butte Wastewater Treatment Facility has a comprehensive training program in place to ensure employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least annually and more frequently as needed.\n\n4.5 Maintenance\n\nThe Lone Butte Wastewater Treatment Facility carries out maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; storage tanks, piping systems, relief and vent Systems, controls and pumps, and montoring systems. Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n4.6 Incident Investigation\n\nThe Lone Butte Wastewater Treatment Facility promptly investigates any incident that has resulted in, or could result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\n4.7 Compliance Audits\n\nThe Lone Butte Wastewater Treatment Facility will conduct audits on a regular basis to determine wheth"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2238,
      "SummaryText": "er the provisions set out under the RMP rule are being implemented. These audits will be carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n5. Five-year Accident History\n\nThe Lone Butte Wastewater Treatment Facility has had an excellent record of preventing accidental releases over the last 5 years. Due to stringent release prevention policies, there has been no accidental release during this period.\n\n6. Emergency Response Plan\n\nThe Lone Butte Wastewater Treatment Facility carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nThe plan is promptly updated to reflect any pertinent changes taking place within the facility processes that would require a modified emergency response.\n\n7. Planned Changes to Improve Safety\n\nThe City of Chandler plans to remove all Chlorine gas from the site and replace the process Sodium Hypochlorite within the next five years.  This is the major step the facility will take to improve safety."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2238,
      "SummaryText": "submitted for Program 2 toxic substances as a class involves a catastrophic release from a Chlorine cylinder.  The scenario involves the release of 2000 lb. of Chlorine in a gaseous form over 10 minutes. At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 3 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L.\n\nThe alternative release scenario for Chlorine involves a release from one-ton cylinder at the loading area.  If a Chlorine leak did occur, which is highly unlikely, it would be during loading and unloading of the cylinders at the site.  The scenario involves the release of 65 lb. of Chlorine in a gaseous form over 60 minutes.  If a leak occurs procedures are in place to immediately move the leaking Chlorine cylinder into the enclosed area.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of Chlorine is 0.4 miles.\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in 1983 in accordance with Uniform Building Code and Uniform Fire Code.  The facility is also subject to EPCRA Section 302 notification requirements. The following sections briefly describe the elements of the release prevention program in place at the facility.\n\n4.1 Safety Information\n\nThe Lone Butte Wastewater Treatment Facility maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n4.2 Hazard Review\n\nThe facility conducts hazard reviews to ensure that hazards associated with the processes are identified and controlled efficiently.  The studies are undertaken by a team of qualified personnel with expertise in process operations and are revalidated every of three years. Any findings r"
    }
  ]
}