{
  "FacilityID": 22459,
  "FacilityName": "Capitol Station 65",
  "FacilityStr1": "424 N. 7th STREET",
  "FacilityStr2": null,
  "FacilityCity": "SACRAMENTO",
  "FacilityState": "CA",
  "FacilityZipCode": "95814",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.596306",
  "FacilityLongDecDegs": "-121.490056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Capitol Station 65, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Steve Goodwin",
  "OperatorStr1": "424 N. 7th STREET",
  "OperatorStr2": null,
  "OperatorCity": "SACRAMENTO",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95814",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "CAL000218570",
  "EPAFacilityID": "100000023173",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "48781",
  "SafetyInspectionDate": "2000-11-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-01-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-01-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2003-03-01 00:00:00",
  "AnniversaryDate": "2004-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.59606,
  "FRS_Long": -121.49106,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32043,
      "AltID": null,
      "FacilityID": 22459,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 41982,
          "ProcessID": 32043,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 32882,
          "ProcessID": 32043,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 17879,
              "Process_NAICS_ID": 32882,
              "SafetyReviewDate": "1999-04-21 00:00:00",
              "PHA_Date": "1996-12-27 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-09-23 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-28 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-28 00:00:00",
              "EquipmentInspectionDate": "1999-04-21 00:00:00",
              "EquipmentTested": "All ammonia system equipments",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1996-12-27 00:00:00",
              "PreStartupReviewDate": "1999-04-25 00:00:00",
              "ComplianceAuditDate": "1999-06-17 00:00:00",
              "AuditCompletionDate": "1999-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-28 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-28 00:00:00",
              "ContractorSafetyEvalDate": "1988-04-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "All recommendations pertaining to the ammonia refrigeration systems from the HazOp study were ranked in order of risk ranking provided in the HazOp study. Sierra Cold Storage management reviewed these recommendations and made commitments to implement them within the time schedule stated.",
              "_chemicals": [
                {
                  "PrimaryKey": 26103,
                  "PreventionProgram3ID": 17879,
                  "ProcessChemicalID": 41982
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22459,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-21 00:00:00",
    "ERTrainingDate": "1999-04-28 00:00:00",
    "CoordinatingAgencyName": "Fire Department(HazMat Specialist)",
    "CoordinatingAgencyPhone": "9162645266",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22459,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies\nAmmonia is one of the most prevalent extremely hazardous substances and is one of the ten hazardous chemicals most commonly involved in a release. To prevent and mitigate an ammonia release and to improve facility safety, and benefit the community and the environment, Capitol Station 65 has developed policies and programs to prevent accidental release.  They include management commitment to safety, risk management plans, standard operating procedures, safety programs, preventative maintenance programs, contractor safety, and training. The most common causes of an ammonia release are related to Operations and Maintenance failures, Equipment Failures and/or Process Failures; consequently, Capitol Station 65 has emphasized preventative maintenance, scheduling of replacement of parts, such as valves and gaskets, and training of maintenance employees in safe operations.       \n\nAll employees have been trained on relevant response procedures.  There are written procedures for the use, inspection, maintenance and testing of emergency response equipment.  The plan also includes evacuation routes, protective actions for uninvolved employees, a method of accounting for employees, and a list of personal protective equipment for response and mitigation equipment. The Emergency Action Plan also includes a procedure for informing the public and emergency response agencies in case of a release.  Capitol Station 65 is committed to employee safety, public safety and the environment and complies with safety and environmental compliance regulations.  \n\nGeneral Description of the Stationary Source and Regulated Substance\nThe Capitol Station 65 is located at 424 North 7th Street, Sacramento, CA 95814. \nThe facility was acquired on May 22, 2000.  Prior to the purchase, the Limited Liability Corporation conducted due diligence to ensure the previous owners had complied with all safety and environmental standa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22459,
      "SummaryText": "rds including OSHA's Process Safety Management, the California Accidental Release Prevention Program and the Clean Air Act.  \n\nAmmonia is used as a refrigerant at the Warehouse facility. The Refrigeration process requires 36,000 lb. ammonia in the system. Anhydrous ammonia is contained within refrigeration piping and equipment associated with flash freezing and cold storage.\n         \nThe regulated substance handled at this distribution facility is anhydrous ammonia. There is approximately 38,000 lbs. of ammonia on site.  This amount exceeds the Threshold Planning Quantity (TPQ) of 10000 lbs. \n\nDescription of Stationary Source    \nCapitol Station 65 is located at 424 N. 7th Street in Sacramento, in an industrial area just north of the Southern Pacific railroad yard.  Capitol Station 65 is a public refrigerated warehouse storing a variety of miscellaneous food items held mainly for locally owned businesses. The warehouse facility operates year-round, normally Monday-Friday except during the harvest season when the hours are extended to 18 hours per day, seven days per week.  \n\nDescription of the Process\nAnhydrous ammonia is used at the Capitol Station 65 warehouse to charge the central refrigeration system.  The refrigerant is used for cooling of food products stored in the warehouse.  The anhydrous ammonia system generally consists of evaporator coils, fans, and accumulators inside each of the warehouse rooms, interconnecting piping, and suction traps, liquid transfer system, compressors, condensers, intercoolers, receivers, and auxiliary systems in and near the engine room.  The system was built in 1945, and the bunker evaporator system and the liquid transfer system automatic controls were installed in 1957.\n\nWorst-Case Release Scenario and Alternate Release Scenario\nThe physical data, meteorological conditions, and required release duration of ten minutes were manually input into the Areal Locations of Hazardous Atmospheres (ALOHA) computer program, version 5.2.1.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22459,
      "SummaryText": "A direct source model was run for both a heavy gas and a gaussion dispersion analysis in order to determine the most conservative (greatest) release distance into the community.  The analysis includes a source strength profile and a dispersion footprint pattern.\n\nWorst-Case Scenario - The worst case scenario selected at the Hazard and Operability Study for Capitol Station 65, is a release of liquid ammonia from the main receiver in the engine room.  This receiver has a maximum capacity of 711 gallons of liquid ammonia.  In addition, the release would also include a 0.73 gallon release from a two-foot section of three inch pipe. Therefore, the total release of anhydrous ammonia for the Worst Case scenario is 711.7 gallons of liquid anhydrous ammonia. The distance to the endpoint of 200 ppm ERPG-2 Type for the worst-case scenario is 0.99 miles. The release would extend beyond the property boundary.\n\nPublic receptors within distance to endpoint include schools, Recreation areas, major commercial, office, or industrial areas, a Day Care center, post office and Amtrak.  Environmental receptors within distance to endpoint include the American River Parkway, Sacramento River Parkway , and Ninos Parkway.\n\nAlternative Scenario -Alternate release scenario selected involves a 0.5 inch diameter liquid ammonia line being severed in a cold storage room due to a forklift accident.  The resulting release of liquid ammonia from the line and associated accumulator was determined to be 368 pounds.  The duration of the release, determined through computer dispersion modeling, was for five minutes. The distance to the endpoint at 200 ppm (ERPG-2) is 0.21 miles. This release would extend beyond the facility boundary.\n\nPublic receptors within distance to endpoint include schools, major commercial, office, or industrial areas, a Day Care center, Police garage, County court house, post office, train depot, and a County administration building.  Environmental receptors within distance to end"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22459,
      "SummaryText": "point  include the American River Parkway, Sacramento River Parkway , and Ninos Parkway\n\nCapitol Station 65 has developed mitigation measures used to limit the distance to endpoint in the scenarios.   All employees have been trained on relevant response procedures.  There are written procedures for the use, inspection, maintenance and testing of emergency response equipment.  The plan also includes evacuation routes, protective actions for uninvolved employees, a method of accounting for employees, and a list of personal protective equipment for response and mitigation equipment.\n\nThe General Accidental Release Prevention Program and the Specific Prevention Steps\nCapitol Station 65 meets the criteria of a small facility due to the limited number of employees.  Capitol Station 65 has developed a prevention program that includes safety information, a Hazard and Operability Study, operating procedures, training, maintenance, compliance audits and incident investigations. The Plant Manager has overall responsibility for the Accident Release Prevention Program.  Independent Safety and Environmental consultants conduct safety and environmental audits on a monthly basis.  Program elements for Risk Management and Process Safety are audited on an annual basis.  The most recent PSM audit was conducted on September 27, 2000.  Senior management has received training on RMP and PSM requirements and program elements. All maintenance employees have been trained and certified in ammonia refrigeration systems.  The company's accidental release prevention program uses recommended guidelines of the International Institute of Ammonia, applicable state codes and federal regulations.  \n\nFive-year Accident History\nThere have been no accidents involving Ammonia during the last 5 years at this facility. Capitol Station 65 has developed a system to track accidents/incidents and prevent reoccurrence based on the International Institute for Ammonia Refrigeration guidelines for Process Safety M"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22459,
      "SummaryText": "anagement.\n\nThe Emergency Response Program\nThe Emergency Response Plan has been developed and implemented for the purpose of protecting public health and the environment.  The written plan is available for review in the administrative offices of Capitol Station 65.  The plan complies with local, state and federal regulations and includes evacuation routes and protective actions for employees not directly involved in emergency response, reporting procedures in case of an accidental release, documentation of proper first-aid and emergency medical treatment and procedures, and measures for emergency response.  Other elements include procedures for the use of emergency response equipment and for its inspection, testing and maintenance, employee training, and procedures to update changes and inform employees of changes or modifications. \nThis emergency response program was established in accordance with California Health and Safety Code (H&SC Division 20, Chapter 6.95, Sections 25531 - 25543.2), 29 CFR 1910.38(a) and 29 CFR 1910.119 and includes procedures for handling small releases. An independent auditor verified all written procedures on September 27, 2000.    \n\nPlanned changes to improve safety\nA Lockout/Tagout audit was conducted on September 6, 2000 by an outside consultant.  A Process Safety Management audit was conducted on September 27, 2000. These independent audits were conducted to ensure that all elements of the safety and environmental programs have been met as required, and documented.  Recommendations to improve the safety and environmental programs included training of new management in Risk Management and Process Safety Management Program requirements; improved labeling of piping and instrumentation; and program development to improve employee participation; and methods to facilitate identifying valves and other appurtenances with numbered tags.   Recommendations from the Process Hazard Analysis, Seismic Analysis, Lockout/Tagout, Process Safety Audit a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22459,
      "SummaryText": "nd other independent audits are tracked on Prevention and Mitigation forms on computer.  The status is reviewed monthly by a safety consultant and reported to the General Manager."
    }
  ]
}