{
  "FacilityID": 22473,
  "FacilityName": "Arcadia Water Treatment System",
  "FacilityStr1": "1228 South Bundy Drive",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90025",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.043667",
  "FacilityLongDecDegs": "-118.466472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Santa Monica",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Santa Monica",
  "OperatorStr1": "1228 South Bundy Drive",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90025",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Harvey",
  "RMPTitle": "Water Prod & Treat Superintendent",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084918",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-01-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-01-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-01-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-09-11 00:00:00",
  "DeRegistrationEffectiveDate": "2012-09-11 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.04386,
  "FRS_Long": -118.46701,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32064,
      "AltID": "Chlorination",
      "FacilityID": 22473,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 32903,
          "ProcessID": 32064,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 42008,
          "ProcessID": 32064,
          "ChemicalID": 62,
          "Quantity": 5500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 542008,
          "ProcessID": 32064,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22473,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nCity of Santa Monica has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nCity of Santa Monica maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Arcadia Water Treatment System is located at 1228 South Bundy Drive.  The facility is situated approximately 2 miles southwest of the University of California, Los Angeles (UCLA), and approximately 2 miles northwest of the Santa Monica Municipal Airport.  The intersection of the San Diego Freeway (Interstate 405) and Santa Monica Freeway (Interstate 10) is approximately three miles southeast  of the facility.  The immediate area is primarily residential.  Wilshire Boulevard is lined with commercial business and office buildings north of the facility.  Saltair Avenue and Texas Avenue define the eastern and southern borders, respectively, and are residential areas.\n\nThe Arcadia Water Treatment System utilizes a chlorine gas injection process to disinfect existing groundwater supplies.  The system consists of two one-ton chlorine containers, two vacuum regulators, two moisture trap/chlorine filters, five v-notch chlorinators, and five chlori"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22473,
      "SummaryText": "ne injectors.  The vacuum operated system utilizes the vacuum created at the injector to maintain a vacuum in the entire system.  The subsequent vacuum on the v-notch chlorinator regulates the volume of gas received from the vacuum regulator.  The vacuum regulators and heaters are mounted directly to the gas outlet valve on the one-ton containers.  The vacuum regulators require a minimum vacuum pressure to operate, therefore a break in a vacuum line will automatically shut down the system.  All chlorine equipment is located  in the chlorination building.  After leaving the injectors, the chlorine is in solution and is not of concern.\n\nThe Arcadia Water Treatment System stores a maximum of 2 one ton chlorine containers and ten 150-pound chlorine cylinders (5,500 lbs) in the chlorine storage room.\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\n Scenario Description: Release of the maximum quantity of chlorine that can be stored in a vessel - 2,000 pounds in 10 minutes.  Although, the one-ton containers are stored enclosed in a building at the Arcadia Water Treatment System, the containers are unloaded from the delivery truck outside before storing inside the building during a delivery of chlorine.  This creates the potential for operator error or equipment failure that would result in an unmitigated release, therefore, passive mitigation measures were not used.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  Exhibit 4-4 from the EPA's RMP Guidance for Wastewater Treatment Plants was used to determine the distance for the toxic point of 3 ppm in urban conditions.  This release reaches off-site and may affect population receptors.  No Environmental receptors were affected by the potential release scenario.\n\nAlternative Release Result Summary\n\n Scenario Description: A release of chlorine gas from 5/16 inch diameter leak.  The release rate of chlorine due to the pressure of the tank is 14.6 pounds "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22473,
      "SummaryText": "per minute.  However, passive mitigation measures were incorporated since the chlorine system is located inside an enclosed building at the Arcadia Water Treatment System.  Consequently, the release rate after the passive measure was calculated to be 8.0 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  Exhibit 4-12 from the EPA's RMP Guidance for Wastewater Treatment Plants was used to determine the distance for the toxic point of 3 ppm in urban conditions.  This release reaches off-site and may affect population receptors.  No Environmental receptors were affected by the potential release scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nCity of Santa Monica has a Process Safety Management program in place to manage the handling of chlorine.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices outlined by the Chlorine Institute.  In the event that the primary engineering or administration controls at the facility fail and result in a release of chlorine, there are two mechanisms in the plant to minimize the impact: 1) chlorine sensors / detectors and 2) alarms.  The chlorine sensors that trigger visual alarm are located in the chlorine storage room.  Once a chlorine concentration of 1 ppm is detected by the sensors, the chlorine alarm system will notify operators of the chlorine leak through the Supervisory Control and Data Acquisition (SCADA) system.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe accident history researched back five years to June 1994 shows that the City of Santa Monica's facility has not had an accidental release or \"near miss\" of chlorine.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Santa Monica has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP docu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22473,
      "SummaryText": "ment.  This Plan was designed to meet the following objectives: \n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe City of Santa Monica maintains a safety committee whose members include the emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. \n\nThe Plan also includes the Emergency training for all City of Santa Monica employees. The City of Santa Monica performs periodic emergency evacuation drills to ensure that all employees are familiar with the evacuation routes and assembly areas. \n\nThe Emergency Response Plan is reviewed and updated by the City of Santa Monica Water Reclamation Plant responsible person, Mr. Robert Harvey at least once a year.  This Plan will be review and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nThe City of Santa Monica has coordinated emergency response efforts with the local Fire Department Station #37.  In the case of a chlorine-related emergency, its is the policy of City of Santa Monica to evacuate the employees and to allow the fire department to respond to the emergency. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) revalidation provided the mitigation measures outlined below to improve safety at the City of Santa Monica Arcadia Water Treatment System.  The PHA was comprised of one session that included a discussion of any changes to the chlorine system since the  HAZOP in 1995, a detailed review of the recommended action items generated during the that HAZOP, a discussion of additional safety protections in the system, and the review of chlorine checklists.  The changes are scheduled to be completed by October 1, 1999.\n\nREV01 Investigate the Hazardous "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22473,
      "SummaryText": "Waste Operations and Emergency Response (HAZWOPER) training requirement.\n\nREV02 Prepare written maintenance procedures for the operators to check the 5 year hydrostatic test record tag on the chlorine tanks."
    }
  ]
}