{
  "FacilityID": 2258,
  "FacilityName": "Rhone-Poulenc Ag Company - Mt. Pleasant Plant",
  "FacilityStr1": "786 Arrow Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Pleasant",
  "FacilityState": "TN",
  "FacilityZipCode": "38474",
  "Facility4DigitZipExt": "0352",
  "FacilityCountyFIPS": "47119",
  "LEPC": "Maury County LEPC",
  "FacilityLatDecDegs": "35.509722",
  "FacilityLongDecDegs": "-87.186667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "Bhendry@rp-agro.com",
  "FacilityDUNS": 124278359,
  "ParentCompanyName": "Rhone-Poulenc Ag Company",
  "Company2Name": "Rhone-Poulenc Inc",
  "CompanyDUNS": 1350265,
  "Company2DUNS": 0,
  "OperatorName": "Rhone-Poulenc Ag Company",
  "OperatorStr1": "P.O. Box 352",
  "OperatorStr2": "786 Arrow Lake Road",
  "OperatorCity": "Mt. Pleasant",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38474",
  "OperatorZipCodeExt": "0352",
  "FTE": 46,
  "OtherEPAFacilityID": "TND056491863",
  "EPAFacilityID": "100000027393",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-06-19 00:00:00",
  "DeRegistrationEffectiveDate": "2012-06-19 00:00:00",
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.52023,
  "FRS_Long": -87.20417,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 2476,
      "AltID": "Chloridate(EPDC)",
      "FacilityID": 2258,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 2636,
          "ProcessID": 2476,
          "ChemicalID": 70,
          "Quantity": 115668.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2527,
          "ProcessID": 2476,
          "NAICSCode": "32532",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 2528,
          "ProcessID": 2476,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 704,
              "Process_NAICS_ID": 2528,
              "SafetyReviewDate": "1997-04-15 00:00:00",
              "PHA_Date": "1997-05-14 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Password protection on computer control system",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-06 00:00:00",
              "TrainingReviewDate": "1999-01-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-08 00:00:00",
              "EquipmentInspectionDate": "1999-03-12 00:00:00",
              "EquipmentTested": "Pressure Relief Valves",
              "ChangeMgmtDate": "1999-05-25 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-04 00:00:00",
              "PreStartupReviewDate": "1999-05-27 00:00:00",
              "ComplianceAuditDate": "1998-08-11 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": "1999-03-18 00:00:00",
              "InvestigationChangeDate": "1999-06-01 00:00:00",
              "ParticipationPlansReviewDate": "1998-08-05 00:00:00",
              "HotWorkPermitReviewDate": "1996-04-18 00:00:00",
              "ContractorSafetyReviewDate": "1996-04-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "Reaction of Phosphorus Oxychloride(POCL3) with Ethanol(EtOH) which results in the formation of Ethyl phosphoro di-chloridate(Chloridate) along with HCL which is neutralized with Caustic(NaOH) to form an aqueous waste.",
              "_chemicals": [
                {
                  "PrimaryKey": 796,
                  "PreventionProgram3ID": 704,
                  "ProcessChemicalID": 2636
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2258,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-03-23 00:00:00",
    "ERTrainingDate": "1998-11-17 00:00:00",
    "CoordinatingAgencyName": "Maury County LEPC",
    "CoordinatingAgencyPhone": "9313813690",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2258,
      "SummaryText": "Accidental release prevention and emergency response policies:\n\nSince the Mt. Pleasant Plant was already covered under OSHA's Process Safety Management Standard, a number of practices are in place that address the requirements of RMP. These include:\n\nA Process Hazards Analysis conducted every five years to identify potential risks and take steps to    mitigate the risks. \n\nA Mechanical Integrity Program that includes routine inspection of safety critical equipment, an equipment file containing histories of process equipment which helps to establish an inspection frequency, and documentation of the design standard standards for process equipment to insure its reliability and suitability for the materials in our processes.\n\nPre Start-Up Safety Reviews conducted prior to the start-up of any processes following an extended shutdown, installation of new equipment, or start-up following an accident or incident.\n\nA Management of Change procedure which requires any changes to equipment(other than \"in kind\"), standard operating procedure, critical operating parameters, or staffing/job duties to undergo a thorough review by the appropriate staff personnel for comment and input, and a final approval by plant management prior to a change being implemented.\n\nSafety systems which include remote monitoring for loading and unloading of hazardous materials, remote shutoffs which can be utilized to stop the transfer of hazardous materials in the event of a leak of other mishap, HCL detectors that provide early warning in case a leak of reactive material occurs so approriate response measures can be taken.\n\nStandard operating procedures that specify the steps to be taken at each step of the process including normal start-up and shutdown, emergency shutdown, start-up after an emergency shutdown, and normal operation.\n\nCritical operating parameters that specify the limits at which the processes can be operated. These include pressures, temperatures, flow rates, and tank levels. An alarm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2258,
      "SummaryText": " system alerts the operator when any of these limits are being approached and steps are detailed as to what actions to take at the various alert levels including shutdown of the process. In addition, a number of interlocks have been built into the processes to automatically shutdown the process or prevent additional operating steps from being taken until the system is in a acceptable condition.\n\nIn addition to the requirements specified under PSM, this facility operates under the guidelines of Rhone-Poulenc's Process Hazards Management Program which is more stringent than the PSM.\n\nRhone-Poulenc management at the corporate and plant level are commited to the safe operation of its processes and takes the position that, \"NOTHING CAN TAKE PRECIDENCE OVER SAFETY.\"\n\nThe Mt. Pleasant Plant and the regulated substances handled:\n\nThe Mt. Pleasant Plant is situated on approximately 18 acres which is part of approximately 1,500 acres of woodland that is owned by Rhone-Poulenc. The plant employees 46 full-time employees plus additional contractors on a regular basis and for special projects.\n  \nThe plant produces an active ingredient, Ethoprop(Ethoprophos), which is formulated into a number of commercial insecticides including those under the MOCAP label. This material is used to control insects in a number of crops including bananas, tobacco, potatoes, ginseng, and small grains. Ethoprop has been produced at the Mt. Pleasant Plant, first by Mobil Chemical and subsequently by Rhone-Poulenc for 30 years. The maximum amount of Ethoprop stored on site is approximately 200,000 gallons or 1,800,000 pounds\n\nThe intermediate used to make Ethoprop is Chloridate(Ethyl Phosphorodichloridate) which  results from the reaction of Ethanol with Phosphorus Oxychloride(POCL3), which is the regulated material at Mt. Pleasant. POCL3 is received at the plant in tank trucks and transferred to a 10,000 gallon glass lined storage tank for use in the process. Administrative controls at the site limit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2258,
      "SummaryText": " the amount of POCL3 stored to 81% of the capacity of the storage tank. \n\nWorst Case and Alternate Case Scenarios:\n\nWorst Case - The worst case scenario(WCS) for the Mt. Pleasant Plant involves the instantaneous release of 115,668 pounds of POCL3 into the dike surrounding the storage tank. Using the OCA Table, this release would result in a vulnerable zone with a four mile radius from the plant. The information available from the 1990 census indicates that approximately 4,600 people reside within this area. In addition, other receptors noted include schools, nursing homes, doctors offices, and a number of churches.\n\nAlternate Case - The Alternate Case Scenario(ACS) was determined to be a 1/8\" hole in a process line used to transfer POCL3. The duration of the leak would be 30 minutes with a result of 401 pounds of POCL3 being released. Again using the OCA Table, a zone of <0.06 miles was arrived at. This release could leave the plant on the West boundary and affect traffic on Arrow Lake Road which is a County Road maintained by the Maury County Road Department.  The only receptors from such a mishap would be the Main Office located directly West of the plant on Arrow Lake Road and any incidental traffic on the road at the time.  Otherwise, there are no off-site receptors within range of the release. The ACS was selected based on a review of process incidents in the plant over the past eight years. The majority of these incidents involved leaks of one sort or the other, and since most of our process piping is teflon lined with a 1/8\" weep hole, this particular scenario was considered to be the most likely to occur. There is no passive mitigation for this event even though a series of HCL detectors throughout the process would detect a leak in its early stages so that immediate reponse could be taken.\n\nGeneral accidental release prevention program and chemical-specific prevention steps:\n\nThe Mt. Pleasant Plant has already established a number of accident prevention pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2258,
      "SummaryText": "grams since it is covered under OSHA's Process Safety Management Standard and Rhone-Poulenc's Process Hazards Management Program. These include many of the same elements that are required for covered faclitites by RMP, such as Contractor Training and Selection, Operator Training and Certification, Standard Operating Procedures including Critical Operating Parameters, Management of Change, Employee Involvement, Emergency Response, Process Safety File including interaction matrices for chemical-chemical and chemical-material of construction, and Mechanical Integrity whichs assures that the process equipment is designed, built and operated to recognized standards.\n\nThis facility also relies heavily on the Pre Start-Up Safety Review prior to any change or start-up following an extended shutdown, and the Process Hazards Analysis to identify potential hazards and make improvements to mitigate the potential hazard. \n\nThis faclity has completed over 11 years and one million exposure hours without a lost time accident and over 9 years without a significant environmental incident.\n   \nFive year accident history:\n\nThere have been no accidents during the past five years at this facility that meet the reporting criteria of RMP. \n   \nEmergency Response Program:\n\nThe Mt. Pleasant Plant has a long standing written Emergency Response Plan that includes steps to be taken by plant personnel in a variety of emergency situations. Assignments are listed for each employee and contractors and visitors that may be on site at the time of an emergency. Included as part of the plan are the various outside agencies that could assist plant personnel in the event of a fire or other emergency.\n\nPlant representatives have participated in emergence drills with the local response agencies and government to better prepare for mishaps that might occur at the site or one involving  transportation of a hazardous material to or from the site. The last such exercise was conducted on November 11, 1998 and i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2258,
      "SummaryText": "nvolved a railcar of POCL3.\n\nThe Mt. Pleasant Plant has a fire brigade that receives training according to OSHA and NFPA guidelines. This training includes annual instruction in fire fighting, spill containment, confined space rescue and decontamination. We routinely include members of the local fire department in our annual brigade training. Emegency response drills including critiques are routinely conducted at the site for brigade members and other plant personnel.  Public notification at this point consists of contacting Maury County 911 to activate the response system including notification of residents that might be affected, traffic control into the scene of the incident, emergency medical services, and coordination of other responders including fire departments, Civil Defense, and volunteer groups.\n\nPlanned changes to improve safety:\n\nThe Mt. Pleasant Plant is constantly seeking ways to improve not only the efficiency but also the safety of its processes. This includes extensive training anytime there is a change in the process or process equipment. We are currently in the process of installing a permanent loading station for filling tank trucks with Ethoprop. This was brought about by the likelihood that we will be asked to conduct this type of activity to a greater degree than we have in the past when the vast majority of bulk shipments were done via rail car."
    }
  ]
}