{
  "FacilityID": 22777,
  "FacilityName": "EASTMAN CHEMICAL COMPANY - COLUMBUS, GA.",
  "FacilityStr1": "6906 Dixie Street",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "GA",
  "FacilityZipCode": "31907",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13215",
  "LEPC": "None",
  "FacilityLatDecDegs": "32.508333",
  "FacilityLongDecDegs": "-84.873611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.EASTMAN.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 808898381,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Eastman Chemical Company",
  "OperatorStr1": "6906 Dixie Street",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31907",
  "OperatorZipCodeExt": null,
  "FTE": 51,
  "OtherEPAFacilityID": "31907THGLD6906D",
  "EPAFacilityID": "100000042599",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-11-30 00:00:00",
  "SafetyInspectionBy": "US DOT/FRA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-02-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-02-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-02-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2001-02-20 00:00:00",
  "AnniversaryDate": "2006-02-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.51235,
  "FRS_Long": -84.86947,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32571,
      "AltID": null,
      "FacilityID": 22777,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 42815,
          "ProcessID": 32571,
          "ChemicalID": 29,
          "Quantity": 190000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33411,
          "ProcessID": 32571,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18267,
              "Process_NAICS_ID": 33411,
              "SafetyReviewDate": "1996-10-29 00:00:00",
              "PHA_Date": "1996-10-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Foam suppression equipment",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-18 00:00:00",
              "TrainingReviewDate": "1999-02-05 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-18 00:00:00",
              "EquipmentInspectionDate": "1999-01-22 00:00:00",
              "EquipmentTested": "Railcar unloading pump",
              "ChangeMgmtDate": "1998-11-02 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-03 00:00:00",
              "PreStartupReviewDate": "1998-11-30 00:00:00",
              "ComplianceAuditDate": "1996-09-13 00:00:00",
              "AuditCompletionDate": "1997-09-01 00:00:00",
              "IncidentInvestigationDate": "1998-09-23 00:00:00",
              "InvestigationChangeDate": "1998-09-23 00:00:00",
              "ParticipationPlansReviewDate": "1998-12-21 00:00:00",
              "HotWorkPermitReviewDate": "1998-07-31 00:00:00",
              "ContractorSafetyReviewDate": "1998-06-03 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-25 00:00:00",
              "CBI_Flag": 0,
              "Description": "Vinyl acetate system",
              "_chemicals": [
                {
                  "PrimaryKey": 26744,
                  "PreventionProgram3ID": 18267,
                  "ProcessChemicalID": 42815
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22777,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-02-01 00:00:00",
    "ERTrainingDate": "1998-12-07 00:00:00",
    "CoordinatingAgencyName": "Columbus Fire Department",
    "CoordinatingAgencyPhone": "7065967000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "CAA Title V"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22777,
      "SummaryText": "Accidental Release Prevention Program and Emergency Response Policy\n\nIt is the policy of Eastman Chemical Company (Eastman) Columbus, Georgia facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program.  The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to Eastman employees, the public and the environment.  This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.\n\nEastman's management is committed to providing the resources necessary to implement this policy.  Further, Eastman recognizes that it has a duty to protect its employees and neighbors from the effects of all dangerous chemicals.  While chemicals are a fundamental component of the coatings that Eastman manufactures, each chemical is given due consideration with regard to techniques for safe handling and processing.  Therefore, even though a particular compound may not be listed within the regulations, it is handled according to any hazardous properties that it possesses.\n\nFacility Description\n\nEastman Chemical Company - Columbus is located in Columbus, Georgia and operates primarily as a manufacturer of synthetic resins.  The main product is resin, including polyesters, powder coating, solution acrylics,curatives, and latex.  All processes are conducted in a batch mode.  Support operations include wastewater treatment, storage tanks and administrative offices.\n\nOne chemical, vinyl acetate, is utilized at the facility in sufficient quantities to be subject to the requirements of 40 CFR Part 68, RMP.  Vinyl acetate is a raw material (monomer) used for resin formulations.  \n\nWorst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22777,
      "SummaryText": "-Case and Alternative-Release Scenarios\n\nRMP regulations require that each facility identify worst-case and alternative case release scenarios.  EPA has defined a worst-case release as the instantaneous release of the entire contents of the largest vessel or connected piping that contains a regulated substance.  Railcars transport approximately 25,000 gallons or 190,000 lbs of vinyl acetate onsite to the railcar unloading area.  Vinyl acetate is pumped from the railcar into a 30,000 gallon atmospheric storage tank capable of storing an estimated 233,000 lbs of vinyl acetate.  The storage tank is located in a dike with a capacity of 49,173 gallons, which would contain a spill from the storage tank.  The railcar unloading area is not diked and USEPA guidance suggests that an instantaneous release of the enitre contents of the railcar should be considered as constituting the worst case.\n\nThe release rate is then evaluated using modeling techniques and/or reference tables to define the distance to a specified endpoint (concentration or overpressure).  The distance to the endpoint is affected by several factors including molecular weight, volatility, heat of combustion, and physical setting (urban or rural).\n\nThe alternative release scenario must be one that is more likely to occur than the worst-case scenario and that reaches an endpoint offsite, unless no such scenario exists.  The alternative release scenario is also evaluated to define the distance to the specified endpoint.  Under 40 CFR 68 Subpart B 68.22(e), the RMP rule identifies surface roughness as a parameter to be used in the hazard assessment to determine the physical setting of the site, urban or rural.  Urban means there are many obstacles in the immediate area; obstacles include buildings or trees.  Rural means there are no buildings in the immediate area and the terrain is generally flat and unobstructed.  Due to the presence of buildings and terrain with significant features in the immediate vicinity o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22777,
      "SummaryText": "f the Columbus, Goergia facility, an urban dispersion environment was assumed.\n\nA computerized dispersion model was used in determining the distance to the vinyl acetate endpoint that is defined by the regulation.  The OCA Guidance contains assumptions that make both the release rate and distance to endpoint calculations for a toxic liquid release highly conservative.  More refined calculation methods are available, such as Kawamura and Mackay method.  However, some dispersion models include the release rate model in their calculations.  Thus, it is important to determine the dispersion model before selecting the release rate model.  The combination of facility location and chemical at Eastman restricts the availlable models.  Vinyl acetate behaves as a dense gas.  Common models available for dense gases include SLAB, DEGADIS, and ALOHA.  The Eastman facility is able to consider an urban environment.  As such, ALOHA is selected as the refined model.  Additionally, ALOHA includes a release model.  Thus, ALOHA is used for both the release rate calculation and the dispersion modeling calculation.\n\nThe worst-case release scenario for vinyl acetate included an instantaneous release of the contents (190,000 lbs) of a railcar in the unloading area.  Other assumptions included that the incident would occur at maximum air temperature (102 F) and humidity (70 percent); the ground roughness is characterized as urban; the windspeed is 1.5 meters/sec and an atmospheric stability classification of F (stable).  The ALOHA model provided an estimated distance to the endpoint of 1.7 miles.\n\nThe selected alternative-release scenario for the vinyl acetate storage tank is a release that results from an overfill of the tank (7,945 lbs).  Other assumptions included that the incident would occur at ambient air temperature (65 F) and humidity (70 percent); the ground roughness characterized as urban; the windspeed is 3.0 meters/sec and an atmospheric stability classification of D.  The ALOH"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22777,
      "SummaryText": "A model provided an estimated distance to the endpoint of 0.09 miles.\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe Columbus facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\n\n     - 40 CFR Part 68, Accidental Release Prevention\n\n     - 40 CFR Part 112, Spill Prevention, Control and Countermeasure\n\n     - 40 CFR Part 264, Hazardous Waste Contingency Plan\n\n     - 20 CFR Part 119, Process Safety Management\n\nThe following sections briefly describe the elements of our release prevention program that are in place at our stationary source.\n\nEmployee Participation - Eastman personnel participate and are responsible for conducting and implementing the findings from Process Hazard Analysis (PHA).  Employees are also members of the facility emergency response team.\n\nProcess Safety Information - Eastman maintains a detailed record of written safety information that describes the chemicals hazards, operating pararmeters and equipment designs associated with all processes.\n\nProcess Hazard Analysis - Eastman conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses are HAZOP and What-If.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures - Eastman maintains written operating procedures to safely operate all covered processes.  These procedures address various modes of operation such as initial startup, normal operations, "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22777,
      "SummaryText": "temporary operations, emergency operations, emergency shutdown, normal shutdown and startup after a turnaround.  The information is regulary reviewed and is readily accessible to operators involved with the processes.\n\nTraining - Eastman has a comprehensive training program in place to ensure that employees operating processes are competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every three years and as needed whenever changes are made to the procedure.\n\nMechanical Integrity - Eastman carries out documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Any equipment deficiencies identified are corrected in a safe and timely manner.\n\nManagement of Change - Written procedures are in place at Eastman to manage changes in process chemicals, technologies, equipment and procedures.  Process operators, maintenance personnel or any other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training to deal with the modification.\n\nPre-Startup Reviews - Pre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Eastman.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits - Eastman conducts audits on a regular basis to determine whether the provisions set out unde"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22777,
      "SummaryText": "r the RMP  and OSHA rules are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation - Eastman promptly investigates any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the root cause and any corrective actions to prevent releases from reoccurring.  All reports are retained for a minimum  of five years.\n\nContractors - Eastman hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Eastman has a policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all procedures for emergency response should an accidental release of a regulated substance occur.\n\nFive-Year Accident History\n\nEastman has not had a release of vinyl acetate from the Columbus, Georgia facility that has caused any of the following:\n\n     - On-site deaths, injuries, significant property damage, or\n\n     - Offsite deaths, injuries, property damage, environmental damage, evacuations or sheltering in place.\n\nEmergency Response Plan\n\nEastman carries a written emergency action plan to deal with any accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response  agencies, as well as post-incident decontamination of affected areas. \n\nEastman has personnel trained in emergency response at the facility 24 hours per day, seven days per week.  These personnel receive annual training on emergency procedures and response techniques.  This plan has been coordinated with the primary local emergency "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22777,
      "SummaryText": "agency listed below.\n\n     Columbus Fire Department\n     510 10th Street\n     Columbus, Ga.   \n     Telephone: (706) 653-3000\n\nPlanned Changes to Improve Safety\n\nEastman completes a thorough review of the vinyl acetate system each time a design change is implemented.  Eastman is committed to using these methods to identify and implement ways to improve the safety of these systems."
    }
  ]
}