{
  "FacilityID": 2286,
  "FacilityName": "Steamboat Geothermal Power Plants",
  "FacilityStr1": "1010 Power Plant Drive",
  "FacilityStr2": null,
  "FacilityCity": "Reno",
  "FacilityState": "NV",
  "FacilityZipCode": "89511",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32031",
  "LEPC": null,
  "FacilityLatDecDegs": "39.611472",
  "FacilityLongDecDegs": "-119.077306",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "WL",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "SB GEO, Inc.",
  "OperatorStr1": "1010 Power Plant Drive",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89511",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rebecca Wagner",
  "RMPTitle": "Compliance Manager",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028356",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.39856,
  "FRS_Long": -119.75417,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2506,
      "AltID": "SBII/III",
      "FacilityID": 2286,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2558,
          "ProcessID": 2506,
          "NAICSCode": "221119",
          "_desc": {
            "NAICS_CODE": "221119",
            "NAICS_DESCRIPTION": "Other Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2666,
          "ProcessID": 2506,
          "ChemicalID": 107,
          "Quantity": 660000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502666,
          "ProcessID": 2506,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 2507,
      "AltID": "SBI/IA",
      "FacilityID": 2286,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2559,
          "ProcessID": 2507,
          "NAICSCode": "221119",
          "_desc": {
            "NAICS_CODE": "221119",
            "NAICS_DESCRIPTION": "Other Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2667,
          "ProcessID": 2507,
          "ChemicalID": 115,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 2668,
          "ProcessID": 2507,
          "ChemicalID": 125,
          "Quantity": 85000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502667,
          "ProcessID": 2507,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502668,
          "ProcessID": 2507,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2286,
      "SummaryText": "EXECUTIVE SUMMARY\nSteamboat Geothermal Power Plants\n\n1.  Accidental release prevention and emergency response policies\n\nAt our geothermal power plants, we handle isobutane, isopentane and pentane which are considered hazardous flammables by the US EPA.  The same properties that make these regulated substances valuable as a working fluid for the power plants also make it necessary to observe certain safety precautions in handling these substances to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our personnel, and to reduce the threat to our community.  It is our policy to adhere to all applicable Federal, state and local rules and regulations.  Safety depends upon the manner in which we handle these regulated substances combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel. \n\nSince our operators do not respond to large chemical releases, we have implemented an emergency action plan which includes procedures for handling small releases of hazardous chemicals as required by OSHA under 29 CFR 1910.38.\n\n2.  The stationary source and regulated substances handled:\n\nThe purpose of our operation is to generate electricity by utilizing the geothermal resource as a source of energy.  Our facility is located nine miles south of Reno, Nevada and includes four power plants designated as SBI, SBIA, SBII and SBIII.  The SBI and SBIA power plants are co-located at the northwest corner of the site and use the regulated substances pentane and isopentane, respectively, as the working fluids. For the purpose of the Risk Management Plan, we have identified these plants as a single process.  The SBII and SBIII power plants are located in the northeast corner of the site and both use the regulated substance isobutane as the working fluid.  We have identified these plants as a single process. \n\n7 Geothermal Energy and Power Plants\nGeoth"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2286,
      "SummaryText": "ermal energy is renewable heat energy from the earth's core.  Geothermal reservoirs of hot water or steam are tapped with wells and their heat is converted to electricity.  At the Steamboat Power Plants, geothermal brine at a temperature of 3100-3150 F is pumped from production wells drilled into the geothermal reservoir.  The brine is kept under pressure to keep it from flashing to steam as it is piped through the plant to the heat exchangers where the heat is extracted from the brine and is used to heat a working fluid (isobutane, isopentane or pentane) to a vapor.  The used brine is injected back into the geothermal reservoir keeping the cycle closed.  The vapor is then piped through the blades of a turbine, spinning the turbine which is connected to a generator and produces electricity.  The hot vapor is piped through an air-cooled condenser, transforming it back to a fluid.  The fluid is cycled back to the heat exchangers in a closed-loop system and the process starts again.\n\n7 SBI & SBIA Overview\nThe SBI and SBIA Power Plants were developed by Ormat, Inc. in 1984 and 1987, respectively, and have been operated by SB GEO, Inc. since 1991.  They are currently under the ownership of Steamboat Envirosystems, LLC, an energy company based in Florida. Collectively, SBI and SBIA produce approximately 8 megawatts (gross) of electricity daily and sell the power to Sierra Pacific Power Company.\n\nSBI uses approximately 85,000 pounds of pentane and SBIA uses approximately 25,000 pounds of isopentane within their closed-loop systems.\n\n7 SBII & SBIII Overview\nThe SBII and SBIII Power Plants were developed by Steamboat Development Company (SDC) in 1992 and have been operated by SB GEO, Inc. since their inception.  SBII and SBIII remain under the ownership of SDC.  Collectively, SBII and SBIII produce approximately 40 megawatts (gross) of electricity daily and sell the power to Sierra Pacific Power Company under a 30-year power purchase agreement. \n\nTogether, the plants use abo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2286,
      "SummaryText": "ut 656,000 pounds of isobutane as the working fluid within their closed-looped systems.\n\n3.  The worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\n7 Worst-Case Release Scenario:\nOur worst-case release scenario analysis was based on the release of isobutane from an accumulator at the SBII power plant.  While the maximum capacity of a single accumulator is 35,460 gallons (166,166 lbs.), the technology of the process requires that the quantity be maintained at a significantly lower level.  To determine a likely accumulator level, we chose the quantity of isobutane in the vessel during an annual plant shut-down when the level is at its highest.  Using a conversion of level inches to volume in gallons (80 in. = 24,991.1 gal.), we concluded that the greatest quantity in a single accumulator is 120,000 lbs.   Due to the location of the facility, we concluded that the release would not extend to any public or environmental receptors.\n\nBy using RMP Comp, we determined the following:\n    Release Type:   Vapor Cloud Explosion\n    Quantity Released:  120,000 lbs.\n    Estimated Distance to 1 psi overpressure:  .4 miles\n \n7 Alternative Release Scenario:\nA secondary seal failure on the isobutane pump would cause a release of isobutane and a potential fire if sparks were generated from metal to metal contact.  \n\nBy using RMP Comp, we determined the following:\n    Release Type:   Vapor Cloud Fire (assuming there is a source of ignition)\n    Quantity Released:  22,450 lbs.\n    Endpoint Used:  Lower flammability limit\n    LFL Value:  1.8% volume\n    Distance to Endpoint:  .10 miles\n\nDue to the location of the facility, we concluded that the release would not extend to any public or environmental receptors.\n\n4.  The general accidental release prevention program and the specific prevention steps\nOur accidental release prevention program focuses primarily upon the proper training and act"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2286,
      "SummaryText": "ions of our operators.  The operator qualification program, monthly training, comprehensive operating procedures, and daily monitoring tasks ensure that the operator is aware of all potential hazards as well as the measures to mitigate them.\n\nIn addition to the proper training of operators, our accidental release prevention program relies upon the safeguards inherent to the power plants.  Such safeguards include gas sensors and alarms, relief valves, automatic shut-offs, interlocks and comprehensive operating procedures to name a few.\n\nIn the event of a fire, our plants are equipped with sprinkler systems, deluge systems, fire extinguishers, fire hydrants and fire monitors.\n\nPreventive maintenance is essential in maintaining the integrity of the equipment at our facility.  Our routine maintenance program helps to ensure that all equipment is running correctly and to industry standards.\n\n5.  Five-year accident history\nWe had no accidental releases of isobutane, isopentane or pentane in the last five years.\n\n6.  The emergency response program\nSince our operators do not respond to large chemical releases, we have implemented an emergency action plan (EAP) which includes procedures for handling small releases of hazardous chemicals as required by OSHA under 29 CFR 1910.38. Our emergency action plan includes the following: procedures for contacting emergency responders and management; a description of responsibilities of key personnel; procedures for plant and personnel security; procedures for evacuation of personnel; first aid procedures; and, procedures for post-incident reporting. \n\n7.  Planned changes to improve safety\nSince our plants have been operating safely for many years, we will continue to ensure the proper training of our operators as they are essential to plant safety.  We will also continue our routine maintenance program ensuring that all equipment is operating safely and efficiently."
    }
  ]
}