{
  "FacilityID": 22968,
  "FacilityName": "Jovista Cold Storage",
  "FacilityStr1": "369 Rd. 176",
  "FacilityStr2": null,
  "FacilityCity": "Delano",
  "FacilityState": "CA",
  "FacilityZipCode": "93216",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.797083",
  "FacilityLongDecDegs": "-119.180417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Stevco Inc./Lucich Farms",
  "Company2Name": null,
  "CompanyDUNS": 70650668,
  "Company2DUNS": 0,
  "OperatorName": "Stevco Inc.",
  "OperatorStr1": "P.O. Box 1266",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93216",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174704",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-12-07 00:00:00",
  "SafetyInspectionBy": "Tulare County Dept of Envr Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-03-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-03-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-03-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.79708,
  "FRS_Long": -119.18042,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32845,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 22968,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 43159,
          "ProcessID": 32845,
          "ChemicalID": 56,
          "Quantity": 20450.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33685,
          "ProcessID": 32845,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18469,
              "Process_NAICS_ID": 33685,
              "SafetyReviewDate": "2001-01-26 00:00:00",
              "PHA_Date": "2001-01-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-01-26 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-01-26 00:00:00",
              "TrainingReviewDate": "2001-02-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-05-01 00:00:00",
              "EquipmentInspectionDate": "2000-05-01 00:00:00",
              "EquipmentTested": "All ammonia equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-01-26 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-01-26 00:00:00",
              "HotWorkPermitReviewDate": "2001-01-26 00:00:00",
              "ContractorSafetyReviewDate": "2001-01-26 00:00:00",
              "ContractorSafetyEvalDate": "2001-01-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia refrigeration",
              "_chemicals": [
                {
                  "PrimaryKey": 27015,
                  "PreventionProgram3ID": 18469,
                  "ProcessChemicalID": 43159
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22968,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Dept of Envr. Health",
    "CoordinatingAgencyPhone": "5597336441",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 22968,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nLucich Farms utilizes anhydrous ammonia in the refrigeration system at their \n\nJovista Cold Storage facility northeast of Delano, California.  As it is Lucich \n\nFarms' policy to comply with all applicable governmental regulations, the cold \n\nstorage facility was designed and constructed in accordance with the applicable \n\nUniform Building and Uniform Mechanical Codes at the time of construction.  \n\nConformance with these code requirements ensures that the building and \n\nrefrigeration system meet specific design and installation requirements that \n\nreduce the risk of accidental releases.  \n\n\n\nPersonnel from Lucich Farms monitor the daily operation of the refrigeration \n\nsystem at the Jovista Cold Storage facility.  All major service, maintenance, and \n\nrepairs to the ammonia refrigeration system are contracted to a qualified licensed \n\nrefrigeration contractor specializing in ammonia refrigeration.  Utilizing an \n\nexperienced qualified contractor to perform major service, maintenance, and \n\nrepairs ensures that the equipment is in excellent operating condition. \n\n\n\nWhile it is Lucich Farms' objective to be a responsible citizen of the community in \n\nall of its business activities, the limited staff at the cold storage facility precludes \n\nemergency response operations.  As such, an emergency action plan has been \n\nprepared for the Jovista Cold Storage facility and a chain of command to respond \n\nto emergencies has been established.\n\n\n\nDescription of the Stationary Source and Regulated Substances \n\n\n\nLucich Farms owns and operates the Jovista Cold Storage facility located at 369 \n\nRoad 176.  Delano is the closest city to the Jovista Cold Storage facility.  The \n\nrural plant was originally constructed during 1978 utilizing all new equipment at \n\nthe time of construction.  In 1985, five additional cold storage rooms were added \n\nto the Jovista Cold Storage facility.  \n\n\n\nAnhydrous a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22968,
      "SummaryText": "mmonia is used as the refrigerant that provides cooling for the \n\nJovista Cold Storage facility.  The refrigeration system currently consists of a \n\nsuction accumulator with a liquid transfer system, four compressors, three \n\nevaporative condensers, two high pressure receivers, six pre-cooler rooms, nine \n\ncold storage rooms, and the associated hallway, staging and shipping areas.  \n\nRoof mounted accumulators are utilized to feed the flooded evaporators in the \n\npre-cooler rooms, cold storage rooms, and the hallway, staging and shipping \n\nareas.\n\n\n\nDuring normal operation, the anhydrous ammonia is distributed throughout the \n\nrefrigeration system.  However, during major maintenance activities, the \n\nrefrigeration system can be \"pumped down\" to evacuate the ammonia from the \n\nsystem and store it in the high pressure receivers.  The maximum quantity of \n\nammonia that can be stored in the largest high pressure receiver is 20,447 \n\npounds.\n\n\n\nWorst Case Release Scenario and Alternative Release Scenario\n\n\n\nOffsite consequence analyses are used as tools to assist in emergency response \n\nplanning.  The RMP regulations require the owner or operator of a stationary \n\nsource to analyze the offsite impacts due to an accidental release of a regulated \n\nsubstance.  The offsite consequence analysis for a Program 3 process must \n\nanalyze the worst case release scenario and an alternative release scenario.  \n\nSince ammonia-based refrigeration system at the Jovista Cold Storage facility is \n\nconsidered a Program 3 process, both release scenarios were evaluated in the \n\noffsite consequence analysis.\n\n\n\nThe offsite consequence analysis must include an estimate of the residential \n\npopulation within an area potentially affected by the accidental release scenario.  \n\nThis area is defined as a circle with a radius equivalent to the distance the \n\nrelease would travel with concentrations at or above the endpoint.  The circle \n\nalso defines the area in which potential environmental recepto"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22968,
      "SummaryText": "rs must be \n\nidentified.  For purposes of the offsite consequence analyses, the RMP \n\nregulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 \n\nppm).\n\n\n\nThe worst case release is defined by the U.S. EPA as the total release of the \n\ncontents of the single largest vessel or pipe within 10 minutes.  For liquefied \n\ngases stored under pressure, the entire contents of the vessel or pipe are \n\nassumed to be released as a vapor.  A total vapor release is highly unlikely.  \n\nHowever, this standardized worst case scenario was developed for emergency \n\nresponse agencies to use for planning purposes.\n\n\n\nAn alternative release scenario is a release that is more likely to occur than the \n\nworst case release scenario.  For Lucich Farms, the alternative release scenario \n\nwas selected based on the results of the Process Hazard Analysis (PHA) for the \n\nammonia-based refrigeration system.  A credible release event with a high \n\ndischarge rate would potentially have the greatest offsite impact.  A leak from a \n\nvalve packing was identified in the PHA as having a medium probability of \n\noccurrence with a discharge rate high enough to cause an offsite consequence, \n\nand therefore, was chosen as the alternative release scenario.    \n\n\n\nLucich Farms has analyzed the offsite consequences of the worst case and \n\nalternative release scenarios.  For the worst case release scenario, the release \n\nof 20,447 lbs. of ammonia over a 10 minute period, the plume would travel 1.7 \n\nmiles at concentrations at or above the endpoint.  Using 1990 Census data, the \n\npopulation potentially affected within the worst case release scenario circle is 81 \n\npersons.  Due to the rural location of this facility, the population potentially \n\naffected by this worst case release may be substantially overstated by the 1990 \n\nCensus data.  There were no environmental receptors within the worst case \n\nrelease scenario circle.\n\n\n\nIn the alternative release scenario, a packing leak from an isolatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22968,
      "SummaryText": "n valve located \n\noutdoors was modeled as a release of liquefied ammonia stored under pressure.  \n\nFor a release of 11 lb/min of anhydrous ammonia, the model calculated that the \n\nplume would travel less than 0.1 mile at concentrations at or above the endpoint.  \n\nNo residences are located within the 0.1 mile area around the Lucich Farms \n\nfacility.  As such, there would be no population impacts from the alternative \n\nrelease scenario.  There were also no environmental receptors within the \n\nalternative release scenario circle. \n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific \n\nPrevention Steps\n\n\n\nA PSM program, which meets the requirements of the general accidental release \n\nprevention program, has been developed at Lucich Farms to address the \n\nanhydrous ammonia system.  The PSM program includes the following chemical-\n\nspecific prevention steps:\n\n\n\n    Written process safety information, including information pertaining to the \n\nhazards of ammonia, the technology of the process, and the equipment in \n\nthe process has been compiled.\n\n\n\n    An initial Process Hazard Analysis (PHA) was performed and will be \n\nupdated and revalidated at least every five years.\n\n\n\n    Written operating procedures have been developed and implemented, and \n\nare reviewed at least annually.\n\n\n\n    Safe work practices, such as lockout/tagout, confined space entry, \n\nopening process equipment or piping, and control over entrance into the \n\nfacility are implemented as needed.\n\n\n\n    Each employee involved in operating the ammonia system has received \n\ninitial training and will receive refresher training at least every three years.\n\n\n\n    Written mechanical integrity procedures have been established and \n\nimplemented.\n\n\n\n    A Management of Change (MOC) program has been developed and \n\nimplemented to address all proposed changes to the ammonia system.\n\n\n\n    Pre-startup safety reviews will be performed when a modification is made \n\nto the ammonia system that is significant enough to re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22968,
      "SummaryText": "quire a change in \n\nthe process safety information.\n\n\n\n    Audits will be conducted at least every three years to evaluate compliance \n\nwith the CalARP regulations.\n\n\n\n    Incident investigation procedures have been established.\n\n\n\n    A written plan of action regarding the implementation of employee \n\nparticipation has been developed and implemented.\n\n\n\n    Hot work permits will be issued for all hot work operations conducted on or \n\nnear the ammonia system, as needed.\n\n\n\n    A Contractor Safety Policy has been developed and implemented.\n\n\n\nTo ensure that the general accidental release prevention program and the \n\nchemical-specific prevention steps are implemented, Lucich Farms has assigned \n\noverall responsibility for the RMP elements to the Purchasing Manager.  The \n\nPurchasing Manager has the overall responsibility for the development, \n\nimplementation, and integration of the RMP elements.\n\n\n\nFive-Year Accident History\n\n\n\nLucich Farms has not had any accidental releases from the ammonia-based \n\nrefrigeration system that have resulted in deaths, injuries, or significant property \n\ndamage on site, or known offsite deaths, injuries, evacuations, sheltering in \n\nplace, property damage, or environmental damage in the last five years.\n\n\n\nEmergency Response Program\n\n\n\nLucich Farms has established an emergency action plan and a chain of \n\ncommand to respond to emergencies and to notify emergency responders when \n\nthere is a need for a response.  However, an emergency response program does \n\nnot need to be developed for the facility since Lucich Farms employees will not \n\nrespond to accidental releases of ammonia, the facility is included in the \n\ncommunity emergency response plan, and appropriate mechanisms are in place \n\nto notify emergency responders.\n\n\n\nPlanned Changes To Improve Safety\n\n\n\nLucich Farms does not currently have any additional changes planned for the \n\nammonia refrigeration system to improve safety.  \n\n\n\n"
    }
  ]
}