{
  "FacilityID": 22972,
  "FacilityName": "Westvaco Texas, L.P.",
  "FacilityStr1": "HWY. 105 South",
  "FacilityStr2": null,
  "FacilityCity": "Evadale",
  "FacilityState": "TX",
  "FacilityZipCode": "77615",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48241",
  "LEPC": "Billy T. Smith",
  "FacilityLatDecDegs": "30.340694",
  "FacilityLongDecDegs": "-94.066333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.westvaco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 123675469,
  "ParentCompanyName": "Westvaco Corporation",
  "Company2Name": "Westvaco Virginia Inc.",
  "CompanyDUNS": 1316397,
  "Company2DUNS": 134597111,
  "OperatorName": "Rodney G. Strong",
  "OperatorStr1": "P. O. Box 816",
  "OperatorStr2": null,
  "OperatorCity": "Silsbee",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77656",
  "OperatorZipCodeExt": null,
  "FTE": 991,
  "OtherEPAFacilityID": "77656plppppbox",
  "EPAFacilityID": "100000074876",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "IMS0-01265",
  "SafetyInspectionDate": "2001-02-08 00:00:00",
  "SafetyInspectionBy": "TWCC",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-03-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-03-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-03-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.3387,
  "FRS_Long": -94.06635,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32849,
      "AltID": "CLO2 Generation",
      "FacilityID": 22972,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43163,
          "ProcessID": 32849,
          "ChemicalID": 71,
          "Quantity": 78000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33689,
          "ProcessID": 32849,
          "NAICSCode": "32213",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18470,
              "Process_NAICS_ID": 33689,
              "SafetyReviewDate": "2000-02-23 00:00:00",
              "PHA_Date": "2000-02-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-10-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-11-09 00:00:00",
              "TrainingReviewDate": "2001-01-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Learning & training objectives",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-02-23 00:00:00",
              "EquipmentInspectionDate": "2000-12-01 00:00:00",
              "EquipmentTested": "ALL",
              "ChangeMgmtDate": "2000-03-13 00:00:00",
              "ChangeMgmtReviewDate": "2001-02-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-03-26 00:00:00",
              "AuditCompletionDate": "2000-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-02-01 00:00:00",
              "HotWorkPermitReviewDate": "2000-10-20 00:00:00",
              "ContractorSafetyReviewDate": "2003-02-16 00:00:00",
              "ContractorSafetyEvalDate": "2001-02-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27016,
                  "PreventionProgram3ID": 18470,
                  "ProcessChemicalID": 43163
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 22972,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-02-13 00:00:00",
    "ERTrainingDate": "2001-02-21 00:00:00",
    "CoordinatingAgencyName": "Jasper County L.E.P.C.",
    "CoordinatingAgencyPhone": "4094234200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 22972,
      "SummaryText": "g investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\nj.\tEmployee Participation.  Westvaco developed a written employee participation program for covered processes to help ensure that the safety concerns of Westvaco workers are addressed.  Westvaco encourages active participation of personnel in the prevention program activities of all processes at the facility.  Employees are consulted on and informed about all aspects of the RMP rule prevention program, including PHAs and operating procedures.\n\nk.\tHot Work Permits.  Westvaco established a hot work permit program to control spark- or flame- producing activities that could result in fires or explosions in covered processes at the Westvaco facility.  Westvaco reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit Form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the Hot Work Permit Form.  The Operating Supervisor/Construction Coordinator/Team Leader reviews the completed form and work area then signs form before work can begin.  Training in the use of the Hot Work Permit Form is included in the Westvaco safe work practices orientation.\n\nl.\tContractors.  Westvaco established a program to help ensure that the contractor activities at the Westvaco facility are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that Westvaco only hires contractors who can safely perform the desired job tasks.  Westvaco explains to the contract supervisors the hazards of the process on which they and their employees will work, Westvaco safe work practices, and Westvaco emergency response procedures.  Westvaco requires that the contractor supervisors train each of their employees wh"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 22972,
      "SummaryText": "o will work at Westvaco before that worker begins work at the Westvaco site.  Westvaco periodically reviews contractors' training documents and work performance to help ensure that safe practices are followed.\n\n\n1.4.2\tChemical-specific Prevention Steps\n\nIn addition to the required prevention programs elements, Westvaco has implemented safety features specific to the hazardous substances used at Westvaco.  The following paragraphs describe some of these safety features.\n\n\nChlorine Dioxide.  Chlorine dioxide is produced at the Westvaco facility and stored as a dilute aqueous solution.  Chlorine dioxide is produced in the chlorine dioxide generator and piped to an absorber column, where it is mixed with chilled water and a dilute chlorine dioxide solution is generated.  Storing this substance as a dilute solution helps to reduce the consequences of a release.\n \n\n\n1.5\tFive-Year Accident History\n\nWestvaco has not had any incidents for the new Chlorine Dioxide Generation Process since it's start up on 03/06/2000.\n\n1.6\tEmergency Response Programs\n\nWestvaco has established a written emergency response program to help safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n\n· informing the local fire department and the public about accidental releases that could    \n  reasonably result in offsite consequences\n\n· providing proper first aid and emergency medical treatment to treat accidental human exposure   \n  to hazardous substances at Westvaco\n\n· controlling and containing accidental releases of hazardous substances, including the use of \n  emergency response equipment\n\n· inspecting and maintaining emergency response equipment\n\n· reviewing and updating the emergency response plan\n\nWestvaco maintains an emergency response team trained in these emergency response procedures.  All Westvaco personnel are trained in evacuation procedures.  Westvaco periodically conducts emergency response drills, including annual drill"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 22972,
      "SummaryText": "s coordinated with the local fire department.\n\nThe written emergency response plan complies with other federal contingency plan regulations (e.g., the OSHA regulations 29 CFR 1910.38(a), 29CFR 1910.120(a)) and has been communicated to local emergency response officials through the local fire department.  Westvaco maintains a regular dialogue with the local emergency planning and response organizations.\n\n\n1.7\tPlanned Changes to Improve Safety\n\nWestvaco constantly strives to improve safety in all areas including covered processes.  Improvements in incident investigations and employee involvement with processes such as our behavior process (Hero:  Hazards Eliminated through Routine Observations) and continued aggression in our Standing Safety Committee.  The PSM Program will continue to improve due to full time coordinator and continual evaluation by a team of diversified talent."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 22972,
      "SummaryText": "ardous substance at Westvaco, less hazardous alternatives are considered.  When a hazardous substance is used at Westvaco, Westvaco considers the potential for this substance to adversely affect Westvaco employees, the public, and the environment and takes steps to prevent any such effects.\n\nWestvaco prevents releases of the hazardous substances used at the facility.  When a hazardous substance is used at Westvaco, the equipment is carefully designed, built and operated to reduce the likelihood of an accidental release.  Industry and government standards are closely adhered to in the design, construction, and operation of the equipment.\n\nWestvaco limits damage from a release, if such a release occurs.  Westvaco trains employees to respond to an accidental release, reducing the consequences of a release if it occurs.  In addition, Westvaco works with the local fire department and with the local emergency planning committee (LEPC) to help ensure that injuries and/or environmental damage will not occur if a release does occur.\nThe safety program at Westvaco consists of a number of elements, only some of which are required by the RMP rule.  This RMP Plan is primarily intended to describe those parts of the safety program at Westvaco that are required by the RMP rule.\n\n\n1.1\tAccidental Release Prevention and Emergency Response Policies\n\nWestvaco is committed to the safety of employees and the public, and the preservation of the environment through the prevention of accidental releases of hazardous substances.  Westvaco implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel, programs to help ensure safety in the design, installation, operations, and maintenance of processes at Westvaco, and programs to evaluate the hazards at Westvaco.\n\nIn the event of an accidental release, Westvaco controls and contains the release in a manner that will be safe for employees and will help prevent inj"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 22972,
      "SummaryText": "Risk Management Plan\n\n\n\n1. EXECUTIVE SUMMARY\n\nWestvaco is committed to operating in a manner that is safe for Westvaco employees, the public, and the environment.  As part of this commitment, Westvaco has established a system to help ensure safe operation of the processes at this facility.  One component of this system is a Risk Management Program (RMP) that helps manage risks at Westvaco, and also complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  This document is intended to satisfy the RMP Plan requirement of the RMP rule and to provide the public with a description of the risk management program at Westvaco.\n\nThe risk management program at Westvaco consists of three elements:\n\n1. A hazard assessment to help understand:\n   (a) the potential offsite consequences of hypothetical accidental releases\n   (b) accidents that have occurred during the last five years associated with the use of substances\n        regulated by the RMP rule (regulated substances) - see topics 1.3 and 1.5\n\n2. A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes) - see topic 1.4\n\n3. An emergency response program to help respond to accidental releases of regulated substances from covered processes - see topic 1.6\n\nInformation further describing these elements is provided in this RMP Plan.\n\nAlthough the risk management program at Westvaco helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at Westvaco.  In fact, Westvaco has a comprehensive safety program in place establishing many levels of safeguards against release of a hazardous substance and injuries or damage from a release of a hazardous substance.\n\nWestvaco limits the use of hazardous substances.  Before using a haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 22972,
      "SummaryText": "ury to the public or the environment.  Westvaco also provides response training to employees, designates an emergency response coordinator to oversee response activities, and coordinates efforts with local emergency planning and response organizations.  Response activities have also been discussed with the LEPC.\n\n\n1.2\tWestvaco and Regulated Substances\n\nWestvaco is an integrated pulp and paperboard mill primarily involved in the manufacture of bleached paperboard products.  As part of this manufacturing process, Westvaco handles Chlorine Dioxide in sufficient quantity to be covered by the RMP rule, as shown below.\n\nProcess                                Program Level                Regulated Substance              Process \n\nChlorine Dioxide Generation          3                         Chlorine Dioxide                    78000 lb.     \n\n\n\n1.3\tOffsite Consequence Analysis\n\nWestvaco performed an offsite consequence analysis to estimate the potential for an accidental release of a regulated substance to affect the public or the environment.  The offsite consequence analysis consists of evaluating a worst-case release scenario and alternative release scenario.  Westvaco does not expect a worst-case release scenario to ever occur.  The alternative release scenario was selected to help the local emergency planning committee improve the community emergency response plan.  An alternative release scenario represents a release that:\n\t(1)\tmight occur at a facility like Westvaco\n(2) would result in a conservative estimate of potential offsite consequences if the \n            release occurred\n\nThe main objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint dista"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 22972,
      "SummaryText": "nce, the effects would be less.\n\nWhen considering the release of a toxic substance, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the substance released could be incapacitated.\n\nThe RMP rule includes specific requirements for the worst-case and alternative release scenarios that must be reported by Westvaco.  These requirements are:\n\n· one worst-case release scenario for the class of toxic substances in Program 3\n  Processes (chlorine dioxide)\n\n· one alternative release scenario for the toxic substance in a Program 3 process\n  (chlorine dioxide)\n\nThe following information summarizes the offsite consequence analysis performed by Westvaco.\n\n 1.3.1\tProgram 3 Processes - Toxic Substances\n\nThe worst-case release for toxic substances is a loss of containment of both Chlorine Dioxide storage tanks, which evaporates and forms a vapor cloud.  The maximum distance to the toxic endpoint concentration is greater than 25 miles.  The U.S. Census indicates that 242,313 people live within the 25-mile radius from the storage vessel.  This 25-mile radius contains public receptors of all types defined by the EPA in the RMP regulation.  The receptors include schools, hospitals, industrial developments, and residential developments.  The primary environmental receptors within the 25 mile radius per USGS maps are Big Thicket National Preserve, E.O. Siecke State Forest, and Sabine Island State Wildlife Management Area.\n\n\nThe alternative release scenario for chlorine dioxide is shearing off a one-inch sample line on the discharge of a chlorine dioxide solution (1wt%) pump that transfers solution to/from the chlorine dioxide absorber to storage.   This scenario assumes that the solution is released through the hole for the 60 minutes before workers detect the release and isola"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 22972,
      "SummaryText": "te the line.  The released chlorine dioxide solution forms a pool and the chlorine dioxide evaporates from the pool, forming a vapor cloud.  The maximum distance to the toxic endpoint is 1.1 miles.  As many as 1,626 people offsite (U.S. Census data indicates approximately 811 local residents) could be impacted within this 1.1-mile radius.  Several public receptors are also located within this distance (e.g., the local school, part of the Pinefield subdivision, the Westvaco park baseball field, and several small businesses).  No environmental receptors are within this distance.\n\n\n1.4\tAccidental Release Prevention Program and Chemical - Specific Prevention Steps\n\nSince its inception in 1953, Westvaco has used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1992, Westvaco formalized this prevention program for the  Chlorine Dioxide Generation and Storage processes to comply with the 13 elements of the OSHA process safety management (PSM) prevention program.  In 1996, the EPA RMP rule established prevention program requirements:\n\nProgram 3 - essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment\n\nThe following sections briefly describe the elements of Westvaco's prevention program that address the EPA RMP rule prevention program requirements.\n\n 1.4.1\tProgram 3 Prevention Program\n\nThe Westvaco Program 3 prevention program, which applies to the Chlorine Dioxide Generation and Storage processes, consists of the following 12 elements:\n\na.\tProcess Safety Information.  Westvaco maintains a variety of technical documents that are used to help ensure safe operations of the Westvaco processes.  These documents address:\n(1)\tphysical properties of hazardous substances handled at Westvaco\n(2)\toperating parameters of the equipment at Westvaco\n(3)\tdesign basis and configuration of the equipment at Westvaco.\n\nWestvaco ensures that this process safety information is available to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 22972,
      "SummaryText": "all employees, the local emergency planning committee (LEPC), and the fire department.\n\nMaterial safety data sheets (MSDSs) document the physical properties of hazardous substances handled at Westvaco, including regulated substances in covered processes.  The information available for each hazardous substance typically includes:\n\n· toxicity information and permissible exposure limits\n\n· physical data (e.g., boiling point, melting point, flash point)\n\n· reactivity and corrosivity data\n\n· thermal and chemical stability data\n\n· hazards of mixing substances in the process\n\nMSDSs for hazardous substances handled in each process are available in the process control room so that the operators have ready reference to this information.  In addition, MSDSs are provided to the LEPC and the fire department for the use in helping formulate emergency response plans.\n\nThe engineering design documents include the operating parameters and the design basis and configuration of the equipment in each covered process.  The available information includes:\n\n· operating parameters\n\n· block flow or simplified process flow diagrams\n\n· process chemistry\n\n· maximum intended inventories\n\n· safe upper and lower limits for parameters such as temperature, pressure, or flow\n\n· consequences of deviations from established operating limits\n\n· design basis and configuration of equipment\n\n· piping and instrument diagrams, including materials of construction\n\n· electrical classification\n\n· safety systems\n\n· applicable design codes and standards\n\n· design basis for relief and ventilation systems\n\nWhen important information was not available for the design documents, it was developed through special projects or, in the case of operating parameters, during process hazard analysis of the process.  Many of the operating parameters are included in the operating procedures to help with the safe operation of the process.  These documents are used:\n (1)\tto train employees\n (2)\tto perform process hazards analyses"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 22972,
      "SummaryText": "processes and as a training guide.\n\nd.\tTraining.  Westvaco trains workers to safely and effectively perform their assigned tasks. Westvaco training program includes both initial and refresher training that covers:\n (1)\ta general overview of the process\n (2)\tthe properties and hazards of the substances in the process\n (3)\ta detailed review of the process operating procedures and safe work practices\n\t\n\tOral reviews and written tests are used to verify that an employee understands the training material before the employee can resume work in the process.\n\n\tThe operators are consulted annually at safety meetings to evaluate the effectiveness and frequency of the training.  Recommendations from the operators are reviewed, and changes to the training program are implemented as appropriate.\n\ne.\tMechanical Integrity.  Westvaco maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The Westvaco mechanical integrity program includes:\n(1)\tan inspection and testing program to help identify equipment deterioration and damage before the equipment fails\n (2)\ta quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in Westvaco process\n\t\nThe Westvaco mechanical integrity program includes:\n\n· specifications for inspection and testing of process equipment\n\n· specifications for replacement parts and equipment\n\n· procedures for inspecting, testing, and maintaining process equipment\n\n· procedures for safe work practices such as lockout/tagout, hot work, confined space entry, and     \n  line or equipment opening\n\n· training of maintenance personnel\n\n· documentation of maintenance activities\n\nf.\tManagement of Change.  The Westvaco management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe op"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 22972,
      "SummaryText": "(3)\tto help maintain the equipment.\n\nb.\tProcess Hazard Analysis.  Westvaco performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering and process operating experience and a leader with process hazard analyses experience is assembled to analyze the hazards of the process.  Westvaco primarily uses the hazard and operability (HAZOP) technique, supplemented with checklists, to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\nc.\tOperating Procedures.  Westvaco process engineers, operators, and supervisor's work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures:\n (1)\tare used to train employees\n (2) \tserve as reference guides for appropriate actions to take during both normal operations and process upsets\n\n\tOperating procedures include:\n\n· steps for safely conducting activities\n\n· applicable process safety information, such as safe operating limits and consequences of                                   \n  process  deviations\n\n· safety and health considerations, such as chemical hazards, personal protective equipment \n  requirements, and actions to take if exposure to a hazardous substance occurs\n\nWestvaco personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations.  The operating procedures are used both to help in operating the Westvaco"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 22972,
      "SummaryText": "erations.  Changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change program.  All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n\ng.\tPre-startup Review.  Westvaco performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely.  This review confirms that:\n\n· construction and equipment are in accordance with design specifications\n\n· adequate safety, operating, maintenance, and emergency procedures are in place\n\n· employee training has been completed\n\n· for a covered process, a PHA has been performed if the process is new or management of \n  change requirements have been completed if an existing process has been modified\n\nA pre-startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n\nh.\tCompliance Audit.  Westvaco audits covered processes to be certain that the prevention program is effectively addressing the safety issues of operations.  Westvaco assembles an audit team that includes personnel knowledgeable in the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\ni.\tIncident Investigation.  Westvaco investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  Westvaco trains employees to identify and report any incident requirin"
    }
  ]
}