{
  "FacilityID": 23026,
  "FacilityName": "OMNOVA Solutions Inc. - Calhoun Latex Plant",
  "FacilityStr1": "1601 Highway 41 S.W.",
  "FacilityStr2": null,
  "FacilityCity": "Calhoun",
  "FacilityState": "GA",
  "FacilityZipCode": "30701",
  "Facility4DigitZipExt": "3651",
  "FacilityCountyFIPS": "13129",
  "LEPC": "Gordon County LEPC",
  "FacilityLatDecDegs": "34.464583",
  "FacilityLongDecDegs": "-84.935028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G6",
  "LatLongDescription": "PG",
  "FacilityURL": "www.omnova.com",
  "FacilityEmailAddress": "marv.church@omnova.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "OMNOVA Solutions Inc.",
  "Company2Name": null,
  "CompanyDUNS": 88498618,
  "Company2DUNS": null,
  "OperatorName": "OMNOVA Solutions Inc.",
  "OperatorStr1": "175 Ghent Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairlawn",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44333",
  "OperatorZipCodeExt": "3300",
  "FTE": 74,
  "OtherEPAFacilityID": "30701THGDY1601H",
  "EPAFacilityID": "100000051463",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-03-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-03-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-07-19 00:00:00",
  "DeRegistrationEffectiveDate": "2016-06-06 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.464722,
  "FRS_Long": -84.935,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32899,
      "AltID": "Latex Manufacturing",
      "FacilityID": 23026,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43229,
          "ProcessID": 32899,
          "ChemicalID": 120,
          "Quantity": 240000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43230,
          "ProcessID": 32899,
          "ChemicalID": 57,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43231,
          "ProcessID": 32899,
          "ChemicalID": 155,
          "Quantity": 220000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 32248,
              "ProcessChemicalID": 43231,
              "ChemicalID": 120
            },
            {
              "FlamMixChemID": 32249,
              "ProcessChemicalID": 43231,
              "ChemicalID": 142
            },
            {
              "FlamMixChemID": 32250,
              "ProcessChemicalID": 43231,
              "ChemicalID": 145
            },
            {
              "FlamMixChemID": 32251,
              "ProcessChemicalID": 43231,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 32252,
              "ProcessChemicalID": 43231,
              "ChemicalID": 135
            },
            {
              "FlamMixChemID": 32253,
              "ProcessChemicalID": 43231,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 32254,
              "ProcessChemicalID": 43231,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 32255,
              "ProcessChemicalID": 43231,
              "ChemicalID": 121
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33738,
          "ProcessID": 32899,
          "NAICSCode": "32521",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18505,
              "Process_NAICS_ID": 33738,
              "SafetyReviewDate": "1998-12-31 00:00:00",
              "PHA_Date": "1998-11-21 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-09-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Remote Cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-10-28 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-16 00:00:00",
              "EquipmentInspectionDate": "1999-04-30 00:00:00",
              "EquipmentTested": "Ammonium Hydroxide Storage Tank (F-205)",
              "ChangeMgmtDate": "1999-04-22 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-08 00:00:00",
              "PreStartupReviewDate": "1999-05-04 00:00:00",
              "ComplianceAuditDate": "1997-10-17 00:00:00",
              "AuditCompletionDate": "1999-09-30 00:00:00",
              "IncidentInvestigationDate": "1999-05-28 00:00:00",
              "InvestigationChangeDate": "1999-06-11 00:00:00",
              "ParticipationPlansReviewDate": "1998-09-28 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-27 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-27 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27064,
                  "PreventionProgram3ID": 18505,
                  "ProcessChemicalID": 43229
                },
                {
                  "PrimaryKey": 27065,
                  "PreventionProgram3ID": 18505,
                  "ProcessChemicalID": 43230
                },
                {
                  "PrimaryKey": 27066,
                  "PreventionProgram3ID": 18505,
                  "ProcessChemicalID": 43231
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23026,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-16 00:00:00",
    "ERTrainingDate": "1998-07-07 00:00:00",
    "CoordinatingAgencyName": "Gordon County Emergency Mgmt Agency",
    "CoordinatingAgencyPhone": "7066022905",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 23026,
      "SummaryText": "than Worst Case Scenarios but are still very improbable due to engineering and administrative controls at the Calhoun facility.\n\n\nWORST CASE SCENARIOS:\n\nEPA regulations require facilities to develop one Worst Case Scenario to represent all toxic substances and one Worst Case Scenario to represent all flammable substances from a list of regulated materials.  Additional Worst Case Scenarios are required if different public receptors (off site residences, businesses or community buildings within a possible impact radius) could be affected by the release of another regulated material.  OMNOVA is not subject to this additional requirement.\n\nWhen examining the following Worst Case and Alternative Release Scenarios, it is important to keep in mind that OMNOVA has numerous preventative measures in place at its Calhoun facility to effectively prevent these situations.  These measures, most of which were not taken into consideration under the EPA regulations include leak detection systems, continuous monitoring and automated controls, automatic shutdowns, deluge water systems, secondary containment dikes, and employees specially trained in handling chemicals and emergency response methods.\n\nFlammable Materials\nThe regulated flammable substance used in the Worst Case Flammable Release Scenario at the Calhoun facility is 1,3-Butadiene.  The facility's Worst Case Flammable Release Scenario involves the instantaneous loss of the entire content of its largest butadiene storage vessel, complete vaporization of the material, and a vapor cloud explosion of the entire content under the worst possible atmospheric conditions.  The endpoint of a vapor cloud explosion is defined as the distance at which the overpressure from the blast reaches 1 PSIG. \n\nOMNOVA does not consider this worst case likely; in fact, it may be physically impossible due to the array of active mitigation systems in place to prevent such an occurrence.  These include deluge systems around the storage tank, flammable"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23026,
      "SummaryText": "ubstance if the accident resulted in: (1) death, injury according to the RMP definition, or significant property damage on site; or, (2) known deaths, injuries, property or environmental damage off site.\n\nThe Calhoun facility has had no accidents meeting the regulatory definition described above in the 21 years since the startup of the facility.\n\n\n HAZARD ASSESSMENT:\n\nAs part of the EPA regulations, and Process Safety Management requirements of the Occupational Safety and Health Administration (OSHA), the Calhoun facility is required to conduct hazard assessments of the regulated process.  EPA regulations specifically require offsite consequence analyses in the form of Worst Case Scenarios and Alternative Release Scenarios for certain regulated substances.\n\nOMNOVA is concerned that these Worst Case Scenarios required to be disclosed under the regulations may overstate the risk of a worst case release.  For example, the EPA published lookup tables do not take any local physical conditions into account.  The Georgia Environmental Protection Division (GEPD) has highly recommended the use of the EPA published lookup tables for completion of Worst Case Scenarios for facilities in Georgia, and OMNOVA has complied with this recommendation.  However, this recommendation does not allow for more accurate calculations for release scenarios based upon recognized risk analysis techniques, or models, which are allowed by the federal regulation.  Both the lookup tables and models can still result in highly improbable and in some cases physically impossible risk scenarios.  For example, neither lookup tables nor models allow consideration of existing active safety devices such as sprinkler systems that can reduce the severity of an accidental release.\n\nOMNOVA has also prepared Alternative Release Scenarios which it believes are more accurate predictions of potential accidental releases from the Calhoun facility.  Alternative Release Scenarios are by definition more likely to occur"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23026,
      "SummaryText": "vapor sensors for early detection and diking to reduce the pool surface area and evaporation rate.  Additionally, the atmospheric conditions used to develop the lookup tables are unlikely, if not impossible.  For example, the temperature used must equal the highest area temperature in the last 3 years, usually occurring in the afternoon, and the wind must be very low with very stable air, usually occurring shortly after midnight.\n\nToxic Materials\nOMNOVA's Calhoun facility has one regulated toxic material on site, 29% Ammonium Hydroxide Solution.  EPA regulations require one Worst Case Scenario to represent all regulated toxic materials.\n\nOMNOVA's Worst Case Toxic Scenario assumes the release of the entire content of an Ammonium Hydroxide storage tank to the containment dike underneath, with the additional assumption that the material stays in the containment area without any mitigation measures to limit the amount that is evaporated to the atmosphere.  Again, Calhoun does not think this worst case is likely and may not be possible due to the conservative assumptions required by the regulation.  An array of mitigation techniques is in place to reduce the severity of any potential release.\n\n\nALTERNATIVE RELEASE SCENARIOS:\n\nApplicable EPA regulations also require facilities to submit one alternative release scenario to represent all flammables and one to represent each toxic material. \n\nFlammable Alternative:\nOMNOVA's Alternative Release Scenario for flammables is the instantaneous release of 1,3-Butadiene as a result of a pipe component failure of a 3-inch diameter line approximately 694 feet long.\n\nToxic Alternative:\nThe Alternative Release Scenario for 29% Ammonium Hydroxide Solution involves the release of material from uncoupling a 3-inch diameter transfer hose during the unloading of material into the storage tank.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM:\n\nOMNOVA's Calhoun facility began a formal Process Safety Management Program in 1992 when OSHA promulgated 29"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 23026,
      "SummaryText": "This document was prepared as part of the Risk Management Program (RMP) of the Calhoun Latex Plant, Performance Chemicals Division of OMNOVA Solutions Inc.  The RMP conforms to the legal requirements established by the U.S. Environmental Protection Agency (EPA).  The purpose of the RMP plan is to:\n\nØ Describe existing safety systems at the Calhoun Plant designed to protect employees, community, environment, and process.\nØ Share information with the community about Calhoun Plant operations including steps taken to minimize risk from regulated substances.\nØ Comply with the applicable portions of 40 CFR Part 68 section 112(r).\n\nThe following executive summary presents an overview of the Calhoun Latex Plant's accident prevention and emergency response programs.\n\n\nOMNOVA's COMMITMENT TO SAFETY:\n\nOMNOVA and its Calhoun facility are and always have been committed to safe operations as a number one priority. All employees at the Calhoun Plant are given the training, tools, and empowerment to perform their part of the operation in a safe manner.  Strict operational controls are in place to ensure safety from the conceptual stage through product development, manufacturing, and delivery to customers.  The Calhoun facility has a staff of safety and environmental professionals, engineers, and security personnel to assure implementation of, and ongoing commitment to, the highest standards of safe process management.  This experience and professional competency has resulted in many years of safe operations consistently exceeding industry averages.\n\n\nDESCRIPTION OF REGULATED PROCESS:\n\nThe Calhoun Latex Plant produces Styrene/Butadiene and Styrene/Butadiene/Vinyl Pyridine latices for the textile and tire industries.  Our finished products are classified as non-hazardous and are in the form of a milky white liquid.\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nThe EPA regulations require regulated facilities to provide information about all accidents in the last 5 years involving an RMP regulated s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23026,
      "SummaryText": "CFR 1910.119.  Process Safety Management acting in concert with effective engineering design, Employee Safety Programs, EPA's RMP, and Emergency Response Programs make up the Calhoun facility's Accidental Release Prevention Program.\n\n\n EMERGENCY RESPONSE PLAN:\n\nOMNOVA's overall safety efforts at Calhoun consist of measures to prevent the release of hazardous material, as well as programs to mitigate the effects if a release should occur.  The Calhoun facility has a trained and equipped team of volunteer emergency responders capable of handling most foreseeable emergency situations.  Importantly, coordination with local safety forces is a key element of the emergency response planning process.  Specific plans are in place to respond to chemical emergencies within the facility.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nIntrinsic safety is a key element in the design of all process equipment at OMNOVA's Calhoun facility.  All covered process equipment design and modification is subject to formal Hazards Analysis Procedures.  During a hazard analysis, recommendations are made for the improvement of the process.  Since 1992 when the Process Safety Management regulation was promulgated, over 500 recommendations for process improvement have been implemented.  Application of new design principals to existing equipment is also an important element of continuous process safety improvement.  In addition, formal accident and incident investigation procedures are in place so that causes of even the smallest failures are identified and corrected."
    }
  ]
}