{
  "FacilityID": 23022,
  "FacilityName": "Complete Welders Supply",
  "FacilityStr1": "101 Camino Dorado",
  "FacilityStr2": null,
  "FacilityCity": "Napa",
  "FacilityState": "CA",
  "FacilityZipCode": "94558",
  "Facility4DigitZipExt": "6213",
  "FacilityCountyFIPS": "06055",
  "LEPC": null,
  "FacilityLatDecDegs": "38.230556",
  "FacilityLongDecDegs": "-122.256389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mike Kowaleski",
  "OperatorStr1": "101 Camino Dorado",
  "OperatorStr2": null,
  "OperatorCity": "Napa",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94558",
  "OperatorZipCodeExt": "6213",
  "RMPContact": "Benjamin Bisconer",
  "RMPTitle": "General Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174811",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Napa",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-03-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-03-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-03-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.23056,
  "FRS_Long": -122.25639,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32895,
      "AltID": "Compressed Gas",
      "FacilityID": 23022,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 33734,
          "ProcessID": 32895,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43225,
          "ProcessID": 32895,
          "ChemicalID": 49,
          "Quantity": 9000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543225,
          "ProcessID": 32895,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23022,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThis facility recognizes the hazards associated with the use of highly hazardous chemicals.  As a reflection of our policy to adhere to all applicable federal, state, and local laws and regulations, we submit this plan to address the hazards inherent with the use of these chemicals. Our program addresses safety precautions regarding the handling and operation of covered systems as well as proper operator training for those who maintain the systems.\n\nOur accidental release prevention program is clearly defined by the Process Safety Management (PSM) Program for this facility.  This prevention program follows industry-recommended standards for preventing unnecessary human exposures and reducing the threat to the health of our employees as well as to members of the community and the surrounding area.  Safety depends upon the manner in which we handle these chemicals, the safety devices inherent in the design of this facility and its processes, and the training that we provide our personnel.  This Plan is current and updated as required by law.\n\nOur emergency response plan is incorporated in the Hazardous Materials Management Plan for this plant.  The Plan includes procedures for notification of the local emergency responders and a specific protocol for evacuation due to a release.  The Plan assigns an Emergency Coordinator to implement the response.  This Plan is current and updated as required by law.\n\nIt is the policy of this facility to devote the time, energy, and capital toward maintaining prevention and response programs appropriate to the inherent dangers with the use of hazardous chemicals.\n\n1.2 THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Complete Welders Supply facility is located approximately 2 miles east of the Napa River and about 4 miles south of downtown Napa, California.  The plant is situated at about 70 feet above sea level northeast of the interse"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23022,
      "SummaryText": "ction of State Highways 29 and 12 (Jameson Canyon Road).  This business provides retail sale of various compressed gases for industrial, commercial, and medical uses.  The facility, founded and constructed in October 1990, is located in an area of commercial, light industrial, sparse residential, and agricultural lands. \n\nComplete Welders Supply uses one hazardous chemical in its operations that is a covered process under this program.  Sulfur dioxide cylinders are received, stored, and then transported offsite for sale to customers.  No filling operations are performed for this covered chemical gas at this facility.  The maximum quantity of sulfur dioxide at this facility is limited by the operating procedures to 9000 lbs.  The compressed gas is stored as a pressurized liquid in 150 lb. steel containers designed for such storage.\n\n1.3 THE WORST CASE AND ALTERNATIVE RELEASE SCENARIOS, INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\nThe worst-case and alternative release scenarios were modeled using ALOHA, a computer simulation program approved by the Napa County Hazardous Materials CUPA and the EPA as appropriate for these scenarios.  Simulations for releases provided estimates of the distance to the toxic endpoint for each case.  \n\nWorst-Case Release Scenarios\n\nThe worst-case scenarios are not the most likely scenarios but serve to demonstrate the potential effects of catastrophic events.  Due to system controls such as proper operating procedures and equipment with inherent safety features, these scenarios have a low likelihood of occurring.\n\nThe worst-case scenario assumes a complete release of liquefied chemical under pressure from the largest process vessel for a duration of ten minutes.  The model assumes a low wind speed of 1.5 m/s and a very stable atmosphere.  The distance to toxic endpoint was determined to be approximately 1.5 miles and involves the release of sulfur dioxide from a 150-lb. cylin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23022,
      "SummaryText": "der. The population within the area potentially affected is estimated to be 100 people.  Public receptors potentially impacted by this worst-case release scenario include residences, public recreation areas, and commercial/office/industrial areas.\n\nAlternative Case Release Scenarios\n\nThe alternative case release scenarios were modeled using typical site and weather conditions and variables appropriate to the particular release scenario.  The methodologies used in the worst-case scenarios (ALOHA) were also used for the alternative case release scenarios.  The alternative case release scenarios are those scenarios more likely to occur and that will reach an endpoint offsite, if one exists.  The scenario was selected from the Process Hazard Analysis as the most likely of all to occur, even though the likelihood was considered unlikely to occur in the lifetime of the facility.  The scenario, a cylinder valve rupture, was modeled for the chemical as required.\n\nTypical weather conditions for the area were used to simulate each release.  The distance to toxic endpoint for sulfur dioxide was found to be 1.0 mile.  This scenario demonstrates a potential exposure to the employees and the public that warrants serious consideration.  The release model indicates that evacuation and a response by the fire department will be likely if administrative controls fail and conditions occur as modeled.\n\nThe PHA determined that this scenario could occur as a result of seismic activity or action that would tip over a cylinder that did not have its protective cap in place.  Since it is policy and a standard operating procedure to always have the protective caps in place (this facility only stores the chemicals and does not perform filling or other operations, which would lead to removal of the protective caps), the likelihood of this type of occurrence is quite low.  System operators are well trained to handle these chemicals and transport the cylinders as per D.O.T. regulations regarding h"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23022,
      "SummaryText": "azardous chemicals.  The cylinders are generally restrained on pallets for transport or clustered to prevent tipping.  \n\n1.4 THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nThis facility complies with the California Accidental Release Prevention (CalARP) Program requirements for RMP Program 2 and Program 3 Prevention components.   The prevention program elements are detailed in the Process Safety Management (PSM) Program for the facility.  Key prevention steps taken by this facility to maintain safety include operator training, the use of qualified operators, written operating procedures, and a preventive maintenance program for system components.\n\nThe facility utilizes recognized chemical suppliers who use industry-standard compressed gas cylinders.  Cylinders are secured with steel rack components and safety chains to prevent valve damage from tipping and the protective caps are always in place.  The facility is fenced and traffic egress is controlled at the front gate.\n\n1.5 THE FIVE-YEAR ACCIDENT HISTORY\n\nAs per Section 2750.9, there have been no releases of sulfur dioxide at this facility in the last five years.\n\n1.6 THE EMERGENCY RESPONSE PROGRAM\n\nThe program for emergency response to the release of hazardous chemicals is an integral element of the Hazardous Materials Management Plan for this facility. \n\n1.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nThis facility recently completed review of its operating and maintenance procedures to ensure adequate safety measures are in place."
    }
  ]
}