{
  "FacilityID": 23064,
  "FacilityName": "Wharton Chemical Complex",
  "FacilityStr1": "U.S. Highway 59 at County Road 212",
  "FacilityStr2": null,
  "FacilityCity": "Hungerford",
  "FacilityState": "TX",
  "FacilityZipCode": "77448",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48481",
  "LEPC": "Wharton County LEPC",
  "FacilityLatDecDegs": "29.433944",
  "FacilityLongDecDegs": "-96.027278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "WL",
  "FacilityURL": "www.lamberti.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lamberti USA, Inc",
  "Company2Name": "Lamberti S.p.A.",
  "CompanyDUNS": 0,
  "Company2DUNS": 478732432,
  "OperatorName": "Lamberti USA, Inc.",
  "OperatorStr1": "U.S. Highway 59 at County Road 212",
  "OperatorStr2": null,
  "OperatorCity": "Hungerford",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77448",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": "77448MDRLLPOBOX",
  "EPAFacilityID": "100000111498",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "45463",
  "SafetyInspectionDate": "1999-02-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-03-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-10-24 00:00:00",
  "DeRegistrationEffectiveDate": "2001-06-20 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 29.3733,
  "FRS_Long": -96.0839,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32952,
      "AltID": null,
      "FacilityID": 23064,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 43302,
          "ProcessID": 32952,
          "ChemicalID": 1,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 33791,
          "ProcessID": 32952,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18540,
              "Process_NAICS_ID": 33791,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1999-06-08 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-08 00:00:00",
              "TrainingReviewDate": "1999-06-02 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer",
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-03 00:00:00",
              "EquipmentInspectionDate": "1999-06-08 00:00:00",
              "EquipmentTested": "Formaldehyde Tank",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-31 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-02-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-08 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-08 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-08 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-08 00:00:00",
              "CBI_Flag": 0,
              "Description": "Formaldehyde Storage Tank",
              "_chemicals": [
                {
                  "PrimaryKey": 27118,
                  "PreventionProgram3ID": 18540,
                  "ProcessChemicalID": 43302
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23064,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-02-28 00:00:00",
    "ERTrainingDate": "1998-07-01 00:00:00",
    "CoordinatingAgencyName": "Wharton County LEPC",
    "CoordinatingAgencyPhone": "4095321550",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23064,
      "SummaryText": "Federal Regulation 40 CFR Part 68 requires facilities having more than a threshold quantity of a regulated substance to develop and submit a Risk Management Plan.  Lamberti USA, Inc. owns and operates the Wharton Chemical Complex, a drilling fluids additives manufacturing facility.  This facility is subject to Part 68 based on storage of formaldehyde, which it uses as an ingredient in making drilling fluids additives.  Formaldehyde is stored and them pumped into a batch reactor vessel.  The batches made use much less than a regulated quantity of the substance.  A complete and detailed report, satisfying the requirements of Part 68, is kept on site and can be used by the public, employees, and local officials to understand and prevent the accidental release of formaldehyde.\nThe facility's plan encompasses numerous elements which will make the plan work efficiently towards achieving the purpose of Part 68.  Extensive effort was put forth to assess the hazards of having formaldehyde at the facility.  A worst case and alternative release analysis were performed in order to identify exactly what could happen and who and what might be impacted.  A precise prevention program is outlined which focuses on how accidents can occur and what can be done to stop them.  Lastly, a structured emergency response program was incorporated which sets precise responsibilities and duties in the case of a release.\nThe Wharton Chemical Complex is located in a rural part of Wharton County with very few residences or other public or environmental receptors around.  Worst Case and Alternative Case analyses were performed to determine the potential reach of accidents that might occur.  The worst case analysis assumed that the entire contents of the formaldehyde storage tank are released.  The occurrence of this event is highly unlikely due to routine inspection of the tank, proper maintenance, and the rare possibility of an event that could cause the rupture of the tank through a significant ex"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23064,
      "SummaryText": "ternal force.  The tank is enclosed in a dike which greatly limits the surface area of a spilled liquid.  Therefore the resulting release rate is relatively low compared to the quantity of liquid spilled.  Calculations based on the OCA Guidance indicated a distance to toxic endpoint of 1.0 miles.  In this radius there is an estimated 57 people, while the only other receptor is a public rodeo grounds and park, which is right on the edge of the one mile radius.  The alternate scenario assumed a piping failure which results in the release of the contents of the pipe as well as 4 minutes of pumped spillage.  This spill would occur in an enclosed space as defined in the OCA Guidance, thus mitigating the release.  It was very conservatively assumed that it would take four minutes to react and shut off the pump.  Other mitigation present but not accounted for include a dike and drainage system.  These measures would not really affect the release of a small quantity but do limit a larger release from having more extensive effects.  The combined quantities resulted in a distance to endpoint of .9 miles as determined by RMPComp.  At this distance there is an estimated population of 46 people who could be potentially affected, with no other receptors.  When you consider these analyses and the fact that the wind direction will largely determine which people in the radii would be impacted it is obvious that in the event of a spill very few people might actually be affected.\nLamberti USA, Inc. is dedicated to maintaining a facility where the risk of a release of any kind is minimal.  As a part of the development of this plan the facility's Process Safety Management plan (required by OSHA's 1910.119) was reviewed in detail.  This PSM was used heavily in developing a prevention program which satisfies the requirements of Part 68.  A Process Hazard Analysis was conducted by an experienced team to identify hazards that exist, consequences of possible accidents, and an analysis of cur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23064,
      "SummaryText": "rent controls for each situation.  This analysis found no shortcomings in the mitigative controls currently in place.  The operating procedures for the covered process were reviewed and found to be compliant with the requirements of this plan.  Management of Change procedures were developed and a plan was implemented to ensure appropriate procedures are followed, largely through the use of a form which was developed for this purpose.  The mechanical integrity of all process equipment was verified and will continue to be regularly examined.  Overall the facility actively uses a prevention plan which has proven effective as the facility has been operating for over 18 years without any incidents.\nThe facility has long had an emergency response plan for this facility, which was reviewed to confirm that it would adequately address the spillage of formaldehyde.  The facility's plan methodically addresses the responsibilities of all personnel in the event of an accident.  Minor spills at the facility will be handled by Lamberti USA, Inc. employees while larger accidents will require the response of a contractor.  The plan clearly identifies all necessary contacts that are to be made to ensure prompt response to protect workers and the public.  All employees at the Wharton Chemical Complex have been trained as to the facilities response plan and portions of the plan are reviewed regularly at monthly safety meetings.\nThe findings of the analysis documented here showed that public and environmental receptors could at worst be affected as much as 1 mile away from the facility.  While it is unfortunate that any possibility of harming any receptor exists, the rural setting of the facility keeps possible effects at a minimum.  With no previous accident it is apparent that the facility is operated with safety in mind.  Our clean record is also due to the fact that the processes operated here pose little danger, having low temperatures and pressures under very controlled conditions"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23064,
      "SummaryText": ".  It is Lamberti USA, Inc.'s desire and intent to use this plan with employees and the community to keep an accidental release from ever occurring at this facility."
    }
  ]
}