{
  "FacilityID": 23076,
  "FacilityName": "Union Carbide Corporation - UCAR Emulsion Systems",
  "FacilityStr1": "2326 Lonnecker Drive",
  "FacilityStr2": null,
  "FacilityCity": "Garland",
  "FacilityState": "TX",
  "FacilityZipCode": "75041",
  "Facility4DigitZipExt": "1203",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.891667",
  "FacilityLongDecDegs": "-96.672778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.unioncarbide.com",
  "FacilityEmailAddress": "glasscdm@ucarb.com",
  "FacilityDUNS": 61592309,
  "ParentCompanyName": "Union Carbide Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1289008,
  "Company2DUNS": 0,
  "OperatorName": "UCC UES Garland, Tx",
  "OperatorStr1": "2326 Lonnecker Drive",
  "OperatorStr2": null,
  "OperatorCity": "Garland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75041",
  "OperatorZipCodeExt": "1203",
  "RMPContact": "D Matt Glasscock",
  "RMPTitle": "HSE Manager",
  "FTE": 53,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144907",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-10-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Garland UES RMPlanner",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-03-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-03-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.88955,
  "FRS_Long": -96.67336,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 32968,
      "AltID": "UES Garland Facility",
      "FacilityID": 23076,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 33808,
          "ProcessID": 32968,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43318,
          "ProcessID": 32968,
          "ChemicalID": 25,
          "Quantity": 108160.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43319,
          "ProcessID": 32968,
          "ChemicalID": 29,
          "Quantity": 703800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543318,
          "ProcessID": 32968,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543319,
          "ProcessID": 32968,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23076,
      "SummaryText": "UNION CARBIDE CORPORATION\nUES GARLAND, TX PLANT\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nThe Union Carbide UCAR Emulsion Systems Garland Plant is committed to operating and maintaining all of our processes in a safe and responsible manner.  We have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include both Union Carbide's Responsible CareO requirements and governmental requirements, such as the Environmental Protection Agency's (EPA) Risk Management Program (RMP) rule and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.\n\n2. Description of the Facility and Regulated Substances\n\nThe Union Carbide UES Garland Plant is a manufacturing facility that produces synthetic latex  polymer products, which are sold to customers that convert them into finished products such as latex paint, caulk and adhesives.  The RMP rule requires that if a facility, such as the UES Garland Plant, has a specific amount (threshold) or more of any one of 140 toxic and flammable chemicals, the facility must follow the RMP rule requirements for that chemical.  The Union Carbide UES Garland Plant has the following RMP-regulated toxic substances at levels above threshold quantities: \n\n? Acrylonitrile (2-Propenenitrile)\n? Vinyl Acetate Monomer (Acetic acid ethenyl ester)\n\nThe Garland plant has no RMP-regulated flammable substances.\n\n3. Key Offsite Consequence Analysis Scenarios\n\nEPA?s RMP rule requires that we provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these hypothetical scenarios.  Unless otherwise specified, no credit was taken for administrative controls or mitigation measures in evaluating the off-si"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23076,
      "SummaryText": "te impact of the scenarios.  Chemical-specific steps to prevent these scenarios from occurring, and to mitigate their effects should they occur, are shown immediately after the scenario description.  The plant's general accident prevention program is described in Section 4.\n\n\n\n\nA)  Regulated Toxic Chemicals \n\nWorst-Case Release Scenario ?\n\nAcrylonitrile:  This scenario assumes storage tank failure, releasing 67,600 pounds of acrylonitrile as a liquid to the spill containment basin.  Written operating procedures and a high-level shutdown system limit the maximum filling capacity of this storage tank to 84 percent ( 56,784 pounds). According to EPA?s Offsite Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.  The following administrative control and passive mitigation are used in this analysis:\n\n? Inventory Restriction:  Written operating procedures and a high-level shutdown system limits the maximum filling capacity of this storage tank to 84 percent (56,784 pounds). \n? Secondary Containment:  The tank is located in above ground, concrete secondary containment. The containment consist of poured, steel reinforced concrete floor with pour, steel reinforced concrete walls. Cast in place were the walls meet the floor slab is a rubber water stop to prevent lateral leakage of a released compound. The containment is large enough to hold the contents of the acrylonitrile tank.\nIn addition, specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n? Tank Construction:  The tank is constructed of material that is not degraded by the stored material or the crushed rock located on the tank exterior.\n? Mounded Tanks:  The limestone covered tanks inhibit the spread of vapors and the pH of the limestone prevents any tendency for corrosion of the tank..\n? Hydrocarbon Detectors: This system is designed to continuously detect the presence of hydrocarbons from a storage tank and sound an "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23076,
      "SummaryText": "alarm, so appropriate action, such as actuation of the deluge system, can be taken.\n? Emergency Shutdown System:  A manual emergency shutdown system is designed to shut down the pumps associated with the tank, place transfer valves in fail safe position, actuate the deluge system, and actuate the plantwide alarm system.\n? Deluge System: A water spray system is designed to help suppress acrylonitrile vapors. It is actuated by the emergency shutdown system or manual pull.\n\nAlternative Release Scenarios ?\n\nVinyl Acetate:  This scenario assumes a drain valve is open on the transfer pump moving vinyl acetate to a process preparation tank. The ?\" drain valve releases 10,700 lb. of vinyl acetate over 25 minutes into a containment basin. This senerio leads to a 10,700 pound realease of vinyl acetate in 25 minutes, the time it would take to complete the entire transfer from the storage tank to the intermidiate mix tank.  According to the OCA Guidance Table, this release could impact off-site public receptors. The following passive and active mitigation measures are used in this analysis:\n? Emergency Shutdown System:  A manual emergency shutdown system is designed to shut down the pumps and put the transfer valves in a fail-safe position. This scenario assumes that the operator detects the release and actuates the emergency shutdown system within 25 minutes. \n? Secondary Containment:  The tank is located inside a concrete dike which is designed to contain any leaks from the tank and to limit evaporation.\n? Surveillance: Operators and maintenance employees monitor the work area while working on the pump. This senerio asumes the operator detects the release and actuates the Emergency Shutdown System within 25 minutes.\nOther specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n? Control Devices: Each drain valve is equipped and checked for a solid valve plug in case the primary valve leaks.\n\nAcrylonitrile:  This scenario"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23076,
      "SummaryText": " assumes a drain valve is open on the transfer pump moving acrlyonitrile to a process preparation tank. The ?\" drain valve releases 2,470 lb. of acrylonitrile over 6 minutes into a containment basin.  This senerio leads to a 2,400 pound realease of acrylonitrile in 6 minutes, the time it would take to complete the entire transfer from the storage tank to the intermidiate mix tank. According to the OCA Guidance Table, this release could impact off-site public receptors. The following passive and  active mitigation measures are used in this analysis:\n? Emergency Shutdown System:  A manual emergency shutdown system is designed to shut down the pumps and put the transfer valves in a fail-safe position. This scenario assumes that the operator detects the release and actuates the emergency shutdown system within 6 minutes.\n? Secondary Containment:  The tank is located inside a concrete dike which is designed to contain any leaks from the tank and to limit evaporation.\n? Surveillance: Operators and maintenance employees monitor the work area while working on the pump. This senerio asumes the operator detects the release and actuates the Emergency Shutdown System within 6 minutes.\nOther specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n? Control Devices: Each drain valve is equipped and checked for a solid valve plug in case the primary valve leaks.\n\n4. General Accidental Release Prevention Program \n\nOur general accident prevention program consists of compliance with the EPA RMP rule and OSHA's PSM standard and implementation of Union Carbide's Operational Safety Program and Episodic Risk Management System.  Key elements include:\n\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\n\nProcess Safety Information: Chemical hazard, process technology, and equipment information is documented, mai"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23076,
      "SummaryText": "ntained up-to-date, and available to operating personnel.\n\nProcess Hazard Analysis:  Process hazard analyses are conducted every five years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\nEpisodic Risk Management:  Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\n\nOperational Safety Standards:  Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in operational safety standards.\n\nOperating Procedures:  Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\n\nOperator Training/Certification Program:  The plant has a training and testing program which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\n\nTechnical Staff Training and Support:  Trained technical staff employees are available 24 hours a day to support operations.\n\nMaintenance Procedures:  The plant has specific procedures for maintaining process equipment so that it operates safely.\n\nMaintenance Training:  The plant trains persons who perform routine or complex maintenance tasks on process equipment.\n\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\n\nManagement of Change:  The plant has a management system to ensure that modified facilities and processes will be safe to operate.\n\nPre-startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\n\nIncident Investigation:  The plant has a prog"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 23076,
      "SummaryText": "ram to ensure that accidents and incidents are properly investigated to determine the cause(s) and to implement corrective action(s) that are needed to prevent the event from reoccurring.\n\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\nHot Work Permit:  The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.\n\nCompliance Audits:  Periodic Corporate and plant-led audits are conducted to ensure that process operations comply with governmental  and Union Carbide requirements.\n\nOperational Safety Program:  Union Carbide has a comprehensive program to ensure that all the elements listed above are implemented at every Union Carbide location.  This Program includes accountabilities for timely and proper implementation of the program elements.\n\nThese general prevention elements and the chemical-specific steps discussed in the previous section are parts of an overall management system to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n5. FIVE-YEAR ACCIDENT HISTORY\n\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical at the Union Carbide UES Garland Plant that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelter-in-place, property damage or environmental damage.\n\n6. EMERGENCY RESPONSE PROGRAM\n\nThe UES Garland plant maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 23076,
      "SummaryText": "ocedures for responding to  releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including:\n\n? Proper first-aid and medical treatment for exposures\n\n? Evacuation plans and accounting for personnel after an evacuation\n\n? Notification of local emergency response agencies and the public if a release occurs\n\n? Post-incident cleanup and decontamination requirements.\n\n? Inspecting, testing, maintaining, and using emergency response equipment.\n\nThe emergency response program is updated when necessary based on modifications made to facility processes. \n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nOn-going programs, such as process hazard analysis reevaluations, continually aim to improve process safety.  The following is a list of specific improvements that we are planning to implement at the Garland UES Plant to help prevent and/or better respond to accidental chemical releases:\n\n? A new Corporate program that uses semi-quantitative assessment techniques in process hazard analyses to ensure that controls used for prevention or mitigation of hazards provide adequate protection\n\n? A new Corporate program designed to ensure that process safety information is kept up-to-date.\n\n? A new fire and evacuation alarm system designed to ensure that personnel safety is kept up-to-date.\n\n? Foam enduction on area fire water monitors to help suppress vapors.\n\n? Union Carbide continues to implement a corporate-wide strategy to avoid computer hardware and software systems operating disruptions due to the year 2000 changeover.  The latest information on the company's Y2K efforts can be found on our Internet site -- www.unioncarbide.com. This information will be periodically updated through first quarter 2000."
    }
  ]
}