{
  "FacilityID": 23236,
  "FacilityName": "Secondary Wastewater Treatment Plant",
  "FacilityStr1": "7007 Jennings Road",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95358",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.521944",
  "FacilityLongDecDegs": "-121.093056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Modesto",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Modesto",
  "OperatorStr1": "7007 Jennings Road",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95358",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Moniz",
  "RMPTitle": "Operations Supervisor",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106002",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-04-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-04-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-04-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-08-14 00:00:00",
  "DeRegistrationEffectiveDate": "2017-03-12 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 37.52955,
  "FRS_Long": -121.06851,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33149,
      "AltID": null,
      "FacilityID": 23236,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 33990,
          "ProcessID": 33149,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43495,
          "ProcessID": 33149,
          "ChemicalID": 62,
          "Quantity": 52000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 43496,
          "ProcessID": 33149,
          "ChemicalID": 49,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543495,
          "ProcessID": 33149,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543496,
          "ProcessID": 33149,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23236,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nThe City of Modesto - Secondary Wastewater Treatment Plant (SWTP) handles chlorine and sulfur dioxide which are considered hazardous materials and are regulated substances under the California Accidental Release Program (CalARP) and are considered in this Risk Management Plan (RMP).  The properties of chlorine and sulfur dioxide make it necessary to observe safety precautions in handling chlorine and sulfur dioxide to prevent human exposure, and to reduce the threat to the facility?s workers and nearby members of the community.  It is the facility?s policy to adhere to all applicable Federal and State of California rules and regulations.  Safety depends upon the safe procedures used to handle chlorine and sulfur dioxide; the safety devices and systems designed and constructed into the facility; and the training of the pertinent personnel.\n\n2. Stationary Source and Regulated Substances Handled\n\nThe SWTP is a secondary treatment plant for wastewater from domestic and industrial sources.  The Primary Wastewater Treatment Plant design has conventional primary treatment which screens coarse materials, removes grit and floatable organic solids and provides primary clarification.  The primary effluent is pumped to the SWTP.\n\nConventional secondary treatment at the SWTP removes soluble organic material and additional suspended organic solids.  There is a solids handling system with dissolved flotation thickening of the waste activated sludge, anaerobic digestion of the organic sludges, dewatering of the digested sludge and final disposal.\n\nThe effluent leaving the SWTP contains biological organisms.  Some of these may be pathogenic (disease causing) organisms.  The effluent is disinfected to protect the public health by the use of a chlorine solution produced at the plant by mixing chlorine gas and water.  The Chlorine Contact Basin provides detention time for the chlorine to disinfect the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23236,
      "SummaryText": "treated wastewater.  Disinfection of the wastewater is performed prior to discharge to river disposal or prior to irrigation disposal.\n\nSome residual chlorine is present after disinfection and represents a toxic hazard.  The chlorine is neutralized to remove this threat by the addition of sulfur dioxide, i.e., dechlorination.  Dechlorination of the wastewater is performed prior to discharge to river disposal.   \n\n3a. Worst Case Release Scenario\n\nThe Worst Case release scenario for interconnected equipment must consider the largest quantity of a regulated substance handled on site in a single vessel at any time, taking into account administrative controls on the vessel?s contents and usage as per the CCR Title 19 Division 2 Chapter 4.5 Article 2 Section 2750.3 (b).\n\nThe bulk tank of sulfur dioxide is the largest vessel in the sulfur dioxide feed system.  The bulk tank is filled with, at most, 50,000 lb of liquid sulfur dioxide which is 80% of tank capacity.  The Worst Case release scenario for the bulk container of sulfur dioxide is to be the release of the 50,000 lb of sulfur dioxide at the rate of 5,000 lb/min for 10 minutes.  Dispersion modeling limitations dictated that the Worst Case release scenario be conservatively considered as the instantaneous evaporating pool release of the 50,000 lb of sulfur dioxide.\n\nThe distance to the end-point of 3 ppm for the Worst Case scenario for the sulfur dioxide one ton container will extend beyond the boundaries of the stationary source.\n\n3b. Alternative Release Scenario\n\nThe Alternative Release scenario for the one ton container of chlorine is complete failure and separation of a ? inch dia. fuse plug insert.  The loss from the one ton container will continue until the liquid contents left in the one ton container solidify due to the withdrawal of the Heat of Vaporization by the escaping chlorine vapor, and/or the level of liquid chlorine drops to just below the bottom of the hole left by the missing fuse plug insert.  This"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23236,
      "SummaryText": " amounts to a loss of 1,813 lb of liquid chlorine from the one ton container which flashes to vapor.\n\nThe distance to the end-point of 3 ppm for the Alternative Release scenario for the chlorine one ton container will extend beyond the boundaries of the stationary source.\n\nThe Alternative Release scenario for the bulk tank of sulfur dioxide is complete failure and separation of the one inch dia. line from the bulk tank.  The loss from the bulk tank will continue until the liquid contents left in the one ton container solidify due to the withdrawal of the Heat of Vaporization by the escaping sulfur dioxide vapor.  This amounts to a loss of 21,712 lb of liquid sulfur dioxide from the bulk tank which flashes to vapor.\n\nThe distance to the end-point of 3 ppm for the Alternative Release scenario for the sulfur dioxide bulk tank will extend beyond the boundaries of the stationary source.\n\n3c. Administrative Controls\n\nAdministrative control, to limit the distances for each reported scenario, exists to restrict to a minimum the amount of chlorine and sulfur dioxide lost if an accidental release were to occur; and preferably to not have a release occur.  This administrative control is inherent in the operational procedures for the chlorine process system and the sulfur dioxide process system, and the training provided to the operators of these chlorine and sulfur dioxide process systems.\n\n3d. Mitigation Measures\n\nMitigation measures to limit the distances for each reported scenario exist to restrict the amount of chlorine and sulfur dioxide released to a minimum, if a release were to occur; and preferably to not have a release occur.  The mitigation measures are based upon the design, inspection, testing, and maintenance of the chlorine and the sulfur dioxide process systems and their related equipment and components. \n\n4. General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe facility complies with all applicable federal and state codes an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23236,
      "SummaryText": "d regulations.  There are safety meetings and safety training.  The Process Safety Management (PSM) program implemented at the facility for the chlorine and sulfur dioxide process system and the related activities and equipment represents the facility?s main active commitments to an accidental release prevention program.\n\n 5. Five-Year Accident History\n\nThere has been no accidental release of chlorine or sulfur dioxide in the last five years.\n\n6. Emergency Response Program\n\nThe Emergency Response Program is based upon the alerting of personnel at the facility to evacuate the facility and await the arrival of responders from the City of Modesto - Fire Department at the evacuation assembly location if a release occurs that causes the evacuation to be initiated.  The Stanislaus County - Hazardous Materials Division can incorporate this response into the County Area Plan for the Regional Local Emergency Planning Committee.  \n\n7. Planned Changes To Improve Safety\n\nThere are commitments made under the Process Hazard Analysis element of the Process Safety Management (PSM) that were implemented.  Current applicable codes and regulations are reviewed as part of the PSM to determine if other commitments need to be made to achieve increased operational safety for the regulated chlorine and sulfur dioxide process systems.  These commitments will be prevention and mitigation measures for accidental releases of the regulated substances."
    }
  ]
}