{
  "FacilityID": 23253,
  "FacilityName": "Tolt Treatment Facility",
  "FacilityStr1": "39025 N.E. North Fork Road",
  "FacilityStr2": null,
  "FacilityCity": "Duvall",
  "FacilityState": "WA",
  "FacilityZipCode": "98019",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.705556",
  "FacilityLongDecDegs": "-121.823333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Azurix CDM Inc. (operator)",
  "Company2Name": "Seattle Public Utilities (owner)",
  "CompanyDUNS": 54628461,
  "Company2DUNS": 2392862,
  "OperatorName": "Azurix CDM",
  "OperatorStr1": "39025 N.E. North Fork Road",
  "OperatorStr2": null,
  "OperatorCity": "Duvall",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98019",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert G. MacLean",
  "RMPTitle": "Senior Project Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173368",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-09-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-04-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2000-11-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2000-11-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-11-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 47.70556,
  "FRS_Long": -121.82333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33163,
      "AltID": "Chlorination",
      "FacilityID": 23253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34002,
          "ProcessID": 33163,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43507,
          "ProcessID": 33163,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543507,
          "ProcessID": 33163,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23253,
      "SummaryText": "\nExecutive Summary\n\n\n\nThe Process Safety Management (PSM) standard and the Risk Management Program (RMP) rule are targeted at highly hazardous chemicals that have the potential to cause a catastrophic incident. This Washington Department of Labor and Industries (WISHA) standard and the Environmental Protection Agency (EPA) rule are required by the Clean Air Act Amendments and are outlined in Washington State Regulation WAC 296-67 and Federal Regulation 40 CFR Part 68, respectively.  This PSM/RMP is intended to aid Azurix CDM in our efforts to prevent or mitigate episodic chemical releases that could lead to a catastrophe in the workplace and possibly to the surrounding community. This Program will ensure full compliance with Regulations WAC 296-67 and 40 CFR Part 68 and should serve to enhance AzurixCDM's relationship with our neighbors in Duvall and Carnation.\n\n\n\nThe major objective of the PSM/RMP for highly hazardous chemicals is to prevent unwanted releases of hazardous chemicals especially into locations that could expose employees and others to serious hazards. An effective PSM/RMP plan requires a systematic approach to evaluating the whole process. Using this approach -- the process design, process technology, operational and maintenance activities and procedures, non-routine activities and procedures, emergency preparedness plans and procedures, training programs, and other elements that impact the unit processes -- were all considered in our evaluation.  The various lines of defense that were incorporated into AzurixCDM's design and operation of the new Tolt Treatment Facility (Tolt) to prevent or mitigate the release of hazardous chemicals were re-evaluated and enhanced to assure their effectiveness.  \n\n\n\nChemicals stored at the Tolt Treatment Facility that are targeted by the PSM and/or the RMP are chlorine, ozone and propane. \n\n\n\nChlorine     - stored in quantities above the WAC 296-67 threshold limit of 1,500 lbs.\n\n- stored in quantities above the 40 CFR Pa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23253,
      "SummaryText": "rt 68 threshold limit of 2,500 lbs.\n\n\n\nOzone    - stored in quantities below the WAC 296-67 threshold limit of 100 pounds.\n\n\n\nPropane     - used solely for comfort heating.\n\n\n\nTherefore, chlorine is the chemical addressed in this Process Safety Management & Risk Management Plan, as required by the WISHA Process Safety Management Regulation WAC 296-67 and the EPA Risk Management Plan Regulation 40 CFR Part 68.\n\n\n\nThe new Tolt Water Treatment Facility is located east of Duvall, WA.  The Tolt Water Treatment Facility will store up to 20 tons of chlorine gas in one-ton cylinders.  Cylinders will be stored in an enclosed building with a chlorine scrubber and gas containment provided by the building.  The facility is equipped with gas detectors that will activate the scrubber system in the event of a chlorine release.  The plant will be staffed 24 hours a day by one licensed Water Treatment Operator.  During normal business hours there may be other employees, contractors, and/or consultants engaged in work at the facility.  The chlorine storage area at the plant will be a secured zone and all access doors will be locked at all times unless authorized personnel are present.   AzurixCDM is committed to protecting employees, the public, and the environment from the release of chlorine gas.\n\n\n\n The worst-case release scenario, as specified by EPA, involved the release of the entire contents of a one-ton cylinder in a ten-minute period with no passive mitigation.  The alternative-case release scenario involved the potential rupture of a 5/16\" valve or transfer line. This scenario estimated the impacts of the release of approximately 610 pounds of chlorine over a 60-minute period.   Both scenarios were modeled using the latest version of RMP*COMP.  The distance to the endpoint for the worst-case release was found to be 1.3 miles.  The distance to the endpoint for the alternate-case release scenario was found to be 0.10 miles. \n\n\n\nAzurixCDM personnel will not be responding to Chlorine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23253,
      "SummaryText": " emergencies at the Tolt Treatment Facility. Instead, we have made arrangements per RPM and PSM regulations to have the local emergency response provider, Eastside Fire and Rescue, respond in the event of a Chlorine Emergency.  \n\n\n\nThere have been no reportable releases within the last five years as this is a new facility.  AzurixCDM has had chlorine safety programs in place for many years at other facilities.  AzurixCDM will maintain open relations and communications with Seattle Public Utilities and local fire departments responsible for serving the Tolt Facility.  AzurixCDM will conduct ongoing training for the Water Treatment Operators in all aspects of plant operation, including chlorine system operation and maintenance.\n\n\n\n"
    }
  ]
}