{
  "FacilityID": 23265,
  "FacilityName": "Brandon Shores Power Plant",
  "FacilityStr1": "1000 Brandon Shores Road",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": "1746",
  "FacilityCountyFIPS": "24003",
  "LEPC": "Anne Arundel LEPC",
  "FacilityLatDecDegs": "39.179167",
  "FacilityLongDecDegs": "-76.538333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.constellationenergy.com",
  "FacilityEmailAddress": "Yvonne.A.Dedrickson@constellation.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Constellation Energy Group",
  "Company2Name": null,
  "CompanyDUNS": 156171464,
  "Company2DUNS": 156171464,
  "OperatorName": "John Strauch",
  "OperatorStr1": "1000 Brandon Shores Road",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21226",
  "OperatorZipCodeExt": "1746",
  "FTE": 176,
  "OtherEPAFacilityID": "MDD985373356",
  "EPAFacilityID": "100000175204",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2400300468",
  "SafetyInspectionDate": "1996-03-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-04-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-04-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-04-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-04-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.180833,
  "FRS_Long": -76.538333,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33176,
      "AltID": "SCR Aqueous Ammonia",
      "FacilityID": 23265,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43520,
          "ProcessID": 33176,
          "ChemicalID": 57,
          "Quantity": 360000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34015,
          "ProcessID": 33176,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 33177,
      "AltID": "Cycle Chemistry Ammonia",
      "FacilityID": 23265,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43521,
          "ProcessID": 33177,
          "ChemicalID": 57,
          "Quantity": 37000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34016,
          "ProcessID": 33177,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23265,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-08-01 00:00:00",
    "ERTrainingDate": "2001-03-13 00:00:00",
    "CoordinatingAgencyName": "Orchard Beach Fire Hall- Station 11",
    "CoordinatingAgencyPhone": "4102228211",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23265,
      "SummaryText": "Executive Summary\nBrandon Shores Aqueous Ammonia RMP\n\nFacility Overview\n\nThe Brandon Shores Power Plant, owned and operated by Constellation Power Source Generation (CPSG), is located near Baltimore, Maryland in northern Anne Arundel County.  It is a fossil fueled electric generating facility consisting of two 650 megawatt coal fired units.  To comply with Maryland Clean Air mandates by 2001, pollution control technology called selective catalytic reduction (SCR) was installed to reduce NOx (nitrogen oxides) emissions by 90%. This state of the art technology will help Maryland significantly reduce NOx that contributes to the formation of unhealthy ground level ozone on hot sunny days.  Both the Environmental Protection Agency and Maryland Department of the Environment support this project, noting that reducing NOx will reduce smog and improve air quality in the Baltimore area, starting in 2001.\n\nSCR's use ammonia to react with the NOx in the combustion gas to form harmless nitrogen gas and water.  Safety of CPSG employees and the surrounding community is of utmost concern to CPSG.  In order to minimize the risk associated with the use of this chemical, CPSG will initially use 30% aqueous ammonia and will convert to urea technology by 2003.  Urea is a less hazardous solid that can react to form ammonia  on-site to reduce transportation risks and to minimize on-site quantities of ammonia.   Use of aqueous ammonia for the initial operating seasons, allows time for the various urea technologies to be developed and tested so CPSG can choose the safest, most reliable technology.  \n\nThe SCR aqueous ammonia system consists of three 18,000-gallon storage tanks surrounded by a dike wall.  \nThe aqueous ammonia is pumped from the storage tanks to a vaporizer.  The vaporizer uses steam to heat  the ammonia solution converting it into a vapor.   The ammonia vapor is mixed with air and injected into the SCR.  The ammonia vapor reacts with the NOx in the presence of the catalyst to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23265,
      "SummaryText": "form harmless nitrogen gas and water vapor.  \n\nSafety features include:\n· Diked/protected storage and unloading areas. \n· Remote controlled shut off valves at the storage tanks.\n· Level/pressure/temperature alarms.\n· Extra strong design \n· Surveillance camera for 24 hour observation.\n· Ammonia monitors around the perimeter.\n· Water cannons for vapor suppression.\n\nBrandon Shores has another 30% aqueous ammonia tank that supplies ammonia for pH control of  the boiler feedwater (cycle chemistry process).  This tank has a capacity of 5000 gallons.  It is surrounded by a dike that drains directly into a 70,000 gallon sump located under the storage tank.  \n\nRelease Scenarios\n\nThe EPA requires analysis of the worst case release scenario which assumes that the entire contents of one of the storage tanks instantaneously releases into the surrounding dike under worst case atmospheric conditions (Class F stability, 1.5 meters/sec wind speed, 25° C).  The maximum quantity released for SCR process would be 127,120 lbs.  Using the methods provided in EPA's Risk Management Program Guidance for Offsite Consequence Analysis (EPA 550-B-99-000), the release rate due to evaporation from the dike was estimated to be 74 lbs./min resulting in a distance to toxic endpoint of 0.2 miles.   The SCR ammonia tank dike area also drains into a covered sump that would further reduce this distance.  The toxic endpoint corresponds to the Emergency Response Planning Guideline Level 2 (ERPG-2) defined by the American Industrial Hygiene Association as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective  action.   The 0.2 mile radius is contained within the CPSG property boundary so there are no public receptors within this distance.\n\nThe distance to toxic endpoint for the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23265,
      "SummaryText": "cycle chemistry ammonia process worst cast release is 0.1 miles due to the containment dike and covered sump that the dike area drains into.   The maximum quantity released would be 37,200 lbs.  The spill would drain directly into the 70,000 gallon covered sump under the storage tank where it would be diluted with water.  \n\n EPA also requires analysis of an alternative release scenario which is a release that is more likely to happen.  The most likely alternative release scenario for both processes involves failure of the flexible hose connecting the delivery truck to the storage tank/piping during unloading.  The duration of this type of release is estimated to be less than 1 minute because the unloading operation can be rapidly terminated by either the truck driver or the  CPSG technician by pushing the truck's emergency stop.  Both the truck driver and CPSG technician are required to monitor the entire unloading process.  The quantity released is estimated to be 1018 lbs of aqueous ammonia yielding an evaporation rate of 20 lbs./min using EPA's methods.  The distance to toxic endpoint is less than 0.1 miles.  \n\nRelease Prevention Policies\n\nCPSG has a comprehensive accidental release prevention program based on the following key elements:\n· Hazard review - A detailed hazard analysis was performed identifying risks and recommendations for reducing the potential for and impact of releases.   All design recommendations have been incorporated.   \n· Designing a safe facility - All applicable codes and standards were incorporated into the design.  CPSG elected to use 30% aqueous ammonia which is inherently safer than anhydrous ammonia, a commonly used alternative.  On-site inventory was minimized and safety features were incorporated that go beyond industry standards including the remote controlled tank isolation valves, ammonia monitors, and surveillance camera.  \n·  Operating procedures - Standard operating procedures and safe work practices are strictly followed."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23265,
      "SummaryText": "· Training - All CPSG technicians are qualified on applicable operating and maintenance procedures, safe work practices, and emergency response procedures.  A qualified emergency response HAZMAT team is present on site at all times.  The drivers of the ammonia trucks are trained on the plant specific unloading and emergency response procedures.  \n· Preventive maintenance - A preventive maintenance and inspection program is being developed to ensure the ongoing mechanical integrity of the system.\n· Change management - Change management procedures have been developed to ensure proper materials of construction, safety evaluation, and updating of operating/maintenance procedures.  \n\nAccident History\n\nThe Brandon Shores facility has never experienced a reportable release or accident associated with the storage or use of 30% aqueous ammonia.  \n\nEmergency Response Program \n\nBrandon Shores has a detailed Emergency Preparedness and Response Plan that includes specific emergency response procedures, procedures for informing the public and local emergency response agencies, and first aid and emergency medical treatment information for ammonia exposure.  The emergency response procedures have been provided to the local emergency planning and response organizations.   \n\nAll plant personnel are trained on emergency response procedures.  A fully qualified HAZMAT response team is on-site at all times.  Emergency response drills are performed quarterly.\n\nPlanned Changes to improve safety \n\nOperational and maintenance recommendations from the process hazard analysis are being incorporated into the final operating procedures, training and preventive maintenance program.  Annual HAZMAT training will include specific training on the new ammonia system.   Local emergency response personnel will be brought on-site to familiarize them with the ammonia system.  CPSG and local emergency response agencies will conduct a joint ammonia response drill."
    }
  ]
}