{
  "FacilityID": 2333,
  "FacilityName": "New Earth Company",
  "FacilityStr1": "1350 SOUTH 6TH",
  "FacilityStr2": null,
  "FacilityCity": "Klamath Falls",
  "FacilityState": "OR",
  "FacilityZipCode": "97601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41035",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "42.152778",
  "FacilityLongDecDegs": "-121.740833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": "www.rmp@celltech.com",
  "FacilityDUNS": 793424482,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Daryl & Marta Kollman",
  "OperatorStr1": "1300 Main",
  "OperatorStr2": null,
  "OperatorCity": "Klamath Falls",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Diann Walker-Pope",
  "RMPTitle": "Safety  Coordinator",
  "FTE": 50,
  "OtherEPAFacilityID": "OR0001905603",
  "EPAFacilityID": "100000032038",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-20 00:00:00",
  "SafetyInspectionBy": "OSHA/consultation",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "production 6th street",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-04-13 00:00:00",
  "DeRegistrationEffectiveDate": "2011-04-08 00:00:00",
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.22118,
  "FRS_Long": -121.77639,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2567,
      "AltID": "Refrigeration",
      "FacilityID": 2333,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2619,
          "ProcessID": 2567,
          "NAICSCode": "31171",
          "_desc": {
            "NAICS_CODE": "31171",
            "NAICS_DESCRIPTION": "Seafood Product Preparation and Packaging"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2729,
          "ProcessID": 2567,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502729,
          "ProcessID": 2567,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2333,
      "SummaryText": "New Earth has 14,000 pounds of anhydrous ammonia, (total capacity) and 12,000 pounds actual product in the system, used solely as a refrigerant at 1350 South 6th Street. The system was built in 1995 under the supervision of PermaCold Engineering. This new system incorporated the latest in new technology and conformed to all safety standards.   Alarm sensors were installed that detect the smallest leak of 35ppm.  The building is evacuated and the refrigeration department is paged by the computer system.  A second alarm goes off if ppm reaches 250. The system then shuts down the plant.  If the ppm is 300 or above the refrigeration department calls Klamath Alarm, who then pages the company hazmat team. Our team is trained and certified as State Industrial Hazmat Technicians. The company team handles levels of 300 ppm to 800 ppm. Once the level goes above 800 ppm or off site,  the local State Hazmat Team is called for a joint operation.\n\nNew Earth trains on a quarterly basis and does an annual drill,  (5/11/99) all in conjunction with the local State Hazmat Team. Our trainer,  Monte Keady,  is a member of the State Team and a local firefighter.\n\nAll floor plans and any updates to our written response plan are shared with the  local State team. Tours are given as needed to the local State team to keep them familiar with the facilities. \n\nNew Earth has all the response equipment required for an A-level response. We have SCBA's, 4 level A suits, decontamination equipment, escape masks, laptop computers, radios, ladders, fans, tarps, hoses, heavy equipment if needed, and B-level suits.  Hazmat team members are trained on such equipment and receive annual physicals.\n\nThe maintenance department performs daily, weekly, monthly, quarterly, and annual inspection checks.  A computer program reminds the department of needed scheduled maintenance. Other repairs are made and recorded as needed.\n\nNew Earth has been under OR-OSHA Consultation for Process Safety Management, and is curr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2333,
      "SummaryText": "ently still under that consultation. Process Hazard Analysis have been conducted using the what if method. Recommendations have been made for such things as adminstrative controls, line breaking procedures, forklift restricted areas, more maintenance checks, and some other minor changes, none of which sparked a Management of Change procedure.\n\nTraining is given on an on-going basis for the refrigeration department. All employees who work in or around the ammonia receive ammonia training on an annual basis. The most recent one was April 15 and 16, 1999. \n\nQuarterly inspections are done of the facility by the Safety Committee.  Material Safety Data Sheet books are up to date and area where ammonia is used is in great shape. All valves and parts are labeled according to the Piping, &  Instrumentation Diagrahms that are posted in each room. All chemicals are labeled according to their contents. \n\nThere have been no accidents at this facility. The systems that are in place, the drills, safety practices, and training that New Earth goes through, make an accidental release very unlikely, baring natural disasters.\n\nThe Safety department just received the 1999 Governors Occupational Safety & Health Award for the safety program at New Earth.  The refrigeration supervsior is a part of the safety team.                                                                                                                                                                                                                                                                                                                                           \n\nIn our worse case scenerio, we have considered a gas release that empties our system in 10 minutes. Most of the vapors would  travel in the direction of the water ( Lake Ewuana) which is located behind our plant. This would help in that it greatly reduces the exposure to citizens. The release would be caused by a forklift hitting and breaking a one inch "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2333,
      "SummaryText": "liquid feed line into the intercooler. This would result in 12,000 pounds of anhydrous ammonia being released at 1200 pounds per minute. The precautions we have taken to insure that this does not happen are: We have only qualified maintenance forklift operators allowed to operate a forklift in the area, and everything in refrigeration is done on a buddy system. Our system has sensors and evacuation fans that come on at 35ppm. At the 6th street plant, the fans shut down at 250 ppm and contain the vapors inside the building. This helps contain the spill and prevent hazards from the community and the environment."
    }
  ]
}