{
  "FacilityID": 23420,
  "FacilityName": "West Oak Plant",
  "FacilityStr1": "1654 West Oak Drive",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "GA",
  "FacilityZipCode": "30062",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13067",
  "LEPC": null,
  "FacilityLatDecDegs": "33.991667",
  "FacilityLongDecDegs": "-84.528333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48713697,
  "ParentCompanyName": "Vinings Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33870585,
  "Company2DUNS": 0,
  "OperatorName": "Vinings Industries, Inc.",
  "OperatorStr1": "245 TownPark Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Kennesaw",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30144",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Gardner",
  "RMPTitle": "Plant Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "GAD033870585",
  "EPAFacilityID": "100000055708",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-10-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-04-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-07-26 00:00:00",
  "DeRegistrationEffectiveDate": "2002-06-28 00:00:00",
  "AnniversaryDate": "2006-04-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.99001,
  "FRS_Long": -84.52943,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33394,
      "AltID": "Waste Water Treatement",
      "FacilityID": 23420,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34234,
          "ProcessID": 33394,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        },
        {
          "Process_NAICS_ID": 34235,
          "ProcessID": 33394,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43752,
          "ProcessID": 33394,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543752,
          "ProcessID": 33394,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23420,
      "SummaryText": "Executive Summary - Vinings Industries, Inc.\nPlant: Marietta (West Oak), GA\n\nVinings Industries is a chemical manufacturing company based in Atlanta, GA. Specialty chemicals are produced for several diverse industries including paper manufacturing, pigment mining, textile sizing, paint manufacturing, water treatment and agricultural pest control. \n\nThe West Oak facility manufactures products for paper, pigment mining, water treatment and agricultural markets. Plant II, the portion of the plant covered by Risk Management, makes products that are sold to other chemical companies for use in paper manufacturing, pigment mining, agricultural pest control, and water treatment applications. The West Oak plant consists of two operating portions: one portion is covered by OSHA's PSM and EPA's RMP, the other is not. OSHA regulations (Process Safety Management) for several years have required that multiple Layers of Protection be included during design, before startup and to continue through operations and training of all employees. These Layers of Protection today are part of our Risk Management Programs.\n\nThe West Oak plant uses one material that is covered under Risk Management:  chlorine. EPA lists chlorine, as toxic. Chlorine is used at West Oak in the pretreatment of waste water prior to a permitted discharge to the Cobb County system.\n\nChlorine:\nYellow-green gas with a bleach-like odor\nThe vapor is heavier than air\nExposure can be irritating to the eyes and throat\nContact with the skin can cause dermatitis or blistering\nInhalation can cause the excessive production of mucus and liquid in the lungs\nProlonged exposure to high concentrations may be fatal\n\n\n\nAs part of Vinings' stewardship and safety programs procedures, detection equipment, and emergency response training are some of the ways that we support the prevention of this hazards exposure to our community.\n\nChlorine is added directly to waste water to destroy residual dithiocarbamates in the waste water treatment "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23420,
      "SummaryText": "system. It is used separately from raw materials in a building with sensors designed to detect any loss of material.\n\nOffsite Consequence Analysis: \nWorst Case Scenario - Toxic Chemical (ID#3) -  Analysis of our processes showed the Worst Case Scenario (Toxic) to be the sudden and complete release of one full cylinder (2,000 pounds) of chlorine hooked to a common header. Based on EPA's Offsite Guidance, we estimate chlorine would travel approximately 1.3 miles. This distance is based on the assumption of urban terrain. Within the larger affected area, a population of 5,000 would potentially be affected, including residences and commercial and industrial facilities.\n \n\nAlternative Scenarios:  While the alternative scenarios are still unlikely to occur, they are more likely to happen than are Worst Case Scenarios. In these scenarios, we can presume our Layers of Protection, our safety processes, our safety programs, our safety equipment and our people will be available and used. While these scenarios are more likely to happen than the Worse Case, and these are the scenarios that we use for Emergency Planning, our safety systems are designed to prevent them from happening.\n\n\nAlternative Case Scenario - Toxic (ID#6) - Analysis of our systems indicate that a more likely toxic scenario wold be the loss of one 2,000 pound cylinder of chlorine when the thermal relief plugs blow due to over pressurization from a fire. Using EPA's Offsite Guidance, we estimate chlorine would travel 0.3 miles before the concentration dispersed to a level considered by EPA to be non-hazardous. Within these areas, a population of 200 would potentially be affected, including residences and commercial and industrial facilities.\n\n\n\nAccident history: In the past five years, this facility has had no incidents with RMP regulated materials causing an offsite consequence. We have had one incident with onsite consequences that meet RMP reporting requirements. On August 26, 1996, heat from a welding opera"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23420,
      "SummaryText": "tion ignited what we believe was methylamine vapors in a process water tank, rupturing the vessel and injuring a contract employee. Following the incident, hot work procedures and the related training programs for both employees and contractors were reviewed and emphasized. We have experienced occasions when citizens have reported objectionable odors coming from the plant. We believe these odors to be from materials not regulated under RMP. Regardless, we have an obligation to determine the source(s) of these odors and to take actions to prevent a recurrence. The products involved in the incident and odor complainants are no longer used on this site.\n\nThe goal at Vinings is to produce quality products and to produce them safely. We have systems in place to prevent accidents, to safeguard our employees, our community and our environment. Following is a partial listing of our Layers of Protection that we employ in our everyday activities.\n\nDesign: All of our valve systems are designed to fail-safe. This means that in the event of the loss of electrical or air power, valves will return - open or closed as necessary - to the \"safe\" position. We have concrete dikes (secondary containment) to catch spilled materials.\n\nOn a regular schedule, we are required to complete a comprehensive review of the hazards and operability of our entire production system. If we find a valve, pipe, tank or pump that might fail and allow a release or an incident, we will correct it.  \n\nMaintenance: We have a documented maintenance program in place. Our operators will recheck equipment before operating it, after maintenance has been performed on it. Using a combination of safety and quality programs, all of our instruments are calibrated and our storage and transfer systems are tested on a regular basis.\n\nSafe Operations: Our employees are essential to the safe operation of our plant. Their training, their experience, their observations and their knowledge of how to respond to situations is th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23420,
      "SummaryText": "e basis of safe operations. These people apply their knowledge and training in their everyday actions. \n\n\nAuditing: The Vinings Quality System at West Oak is certified according to ISO 9002 guidelines. While directed at quality, the training and documentation requirements of ISO standards are quite similar to those for OSHA and EPA under Process Safety Management and Risk Management.\n\nIn addition to the audits required by all three of these guidelines, we are regularly visited, inspected and/or audited by regulatory agencies. \n\nEmergency Response: Our operators are trained to identify unusual occurrences. In the event of an incident on the plant site, our Emergency Response Plan tells us to take the following actions:\n    A public address system will notify all employees that an event has occurred. Monitors include automatic detectors and visual inspection by our operators.\n    Operators will shut down transfer systems as they evacuate the operating portions of our plant\n    All employees will shelter in place in an office area on the site\n    Designated employees will call for fire and emergency services via 911\n    We will summon our emergency response contractors\n    We will advise emergency responders of the known hazards and follow their guidance\n\nTraining and preparation: Certainly all of us want to do everything we can to protect the health and well being or our employees and our community. We have our Layers of Protection in the plant; we use training exercises to further protect our employees and to reduce the impact of any releases on our neighbors. \n"
    }
  ]
}