{
  "FacilityID": 23483,
  "FacilityName": "Altus Air Force Base",
  "FacilityStr1": "100 Inez Blvd, Suite 1",
  "FacilityStr2": null,
  "FacilityCity": "Altus AFB",
  "FacilityState": "OK",
  "FacilityZipCode": "73523",
  "Facility4DigitZipExt": "5047",
  "FacilityCountyFIPS": "40065",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "34.65",
  "FacilityLongDecDegs": "-99.291667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Col Michael C. Gould",
  "OperatorStr1": "100 Inez Blvd, Suite 1",
  "OperatorStr2": null,
  "OperatorCity": "Altus AFB",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73523",
  "OperatorZipCodeExt": "5047",
  "FTE": 5015,
  "OtherEPAFacilityID": "OK9571824045",
  "EPAFacilityID": "100000099476",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "99-117-0",
  "SafetyInspectionDate": "1999-04-26 00:00:00",
  "SafetyInspectionBy": "HQAETC Inspector General Team",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Chlorine Storage",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-05-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "1999-09-24 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.6604,
  "FRS_Long": -99.28445,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33473,
      "AltID": "Storage",
      "FacilityID": 23483,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 43850,
          "ProcessID": 33473,
          "ChemicalID": 62,
          "Quantity": 9300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34316,
          "ProcessID": 33473,
          "NAICSCode": "92811",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18801,
              "Process_NAICS_ID": 34316,
              "SafetyReviewDate": "1999-05-28 00:00:00",
              "PHA_Date": "1999-05-28 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-09-01 00:00:00",
              "TrainingReviewDate": "1999-04-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-03 00:00:00",
              "EquipmentInspectionDate": "1999-05-03 00:00:00",
              "EquipmentTested": "SCBA",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-09-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-04-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-27 00:00:00",
              "HotWorkPermitReviewDate": "1997-05-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-12 00:00:00",
              "ContractorSafetyEvalDate": "1999-02-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "Storage of Chlorine Cylinders",
              "_chemicals": [
                {
                  "PrimaryKey": 27422,
                  "PreventionProgram3ID": 18801,
                  "ProcessChemicalID": 43850
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23483,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-27 00:00:00",
    "ERTrainingDate": "1999-04-27 00:00:00",
    "CoordinatingAgencyName": "Altus AFB Fire Department",
    "CoordinatingAgencyPhone": "5804816333",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23483,
      "SummaryText": "INTRODUCTION: A Risk Management Plan has been initiated for the reduction of accidental releases of hazardous and flammable materials.  The Plan summarizes management, administrative, procedural, and technological controls that work together to minimize the risk to the community of accidental releases.  The Plan summary is organized to correspond with specific Environmental Protection Agency Risk Management Program definitions and requirements, including: Introduction; Facility and Processes Overview; Health, Environment, and Safety Practices; Hazard Assessment; Prevention Program; Five Year Accident History; Emergency Response Program; and Planned Changes to Improve Safety.  FACILITY AND PROCESSES OVERVIEW: Altus Air Force Base (AFB) is owned and operated by the United States Air Force, Air Education and Training Command.  Altus AFB occupies approximately 5,900 acres in southwestern Oklahoma.  It is located 140 miles southwest of Oklahoma City in the central part of Jackson County and within the town of Altus.  Altus AFB is home of the 97th Air Mobility Wing, whose primary mission is to conduct strategic airlift, aerial delivery, and aerial refueling training, in support of the C-5 Galaxy, C-141 Starlifters, C-17 Globemaster III, and KC-135 Stratotankers aircraft.  In order to complete their mission, the Altus AFB stores chlorine at the Compressed Gas Cylinder Storage.  Chlorine cylinders used for swimming pool water treatment are staged in Building 504 prior to use.  The chlorine storage room stores approximately 60 cylinders, each containing approximately 150-lb. of chlorine, for a total of 9,000 lbs., which exceeds the RMP threshold quantity of 2,500 lbs.  Under the Risk Management Program rule, the chlorine process is considered a Program Level 3.  HEALTH, ENVIRONMENT, AND SAFETY PRACTICES: Altus AFB has several response plans that address health, safety, and environmental policies.  Furthermore, the Risk Management Program will help to prevent and/or reduce th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23483,
      "SummaryText": "e risk of accidents.  These existing plans detail the specific responsibilities, actions, and procedures that must be undertaken by various organizations during work activities in order to protect the health and safety of personnel, the public, and the environment.  Examples of such documents include, but are not limited to: Disaster Preparedness Plan (32-1 Plan) [dated 15 March 1997], Spill Prevention and Response Plan [dated 1 September 1998], Tactical Guideline for Hazardous Material Incident Response [dated 15 February 1996],  and Air Force Manual 32-4004 - Emergency Response Operations.  HAZARD ASSESSMENT: The Hazard Assessment software used to analyze the magnitudes of the potential offsite consequences was EPA's RMP-Comp. This software is based on EPA's Offsite Consequence Analysis Guidance (OCAG) lookup tables. It determines the magnitude (in potential impact distance) of offsite consequences from the release of an RMP-regulated substance resulting from a vapor cloud explosion, vapor cloud fire, pool fire, Boiling Liquid, Expanding Vapor Explosion or toxic release. The Hazard Assessment was completed to determine the endpoint distance during worst-case and alternative accidental release scenarios for chlorine.  The worst-case scenario was considered to be a complete rupture of a single 150-lbs. cylinder and the alternative scenario was considered a valve break.  The release scenarios show vulnerability radii of approximately 0.8 miles and 0.1 miles for the worst-case and alternative conditions, respectively.  The worst-case scenario could effect public receptors located within family housing at Altus AFB and some residential areas offsite. The alternative scenario would not effect public receptors.  PREVENTION PROGRAM: As a general rule, Altus AFB is committed to performing work safely, ensuring the protection of employees, the public, and the environment.  The chlorine storage is subject to the Occupational Safety and Health Administration (OSHA) Process Sa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23483,
      "SummaryText": "fety Management (PSM) rule.  As a means to this end, Altus AFB has developed a Prevention Program for chlorine intended to minimize accidental releases of regulated substances and to provide prompt emergency response.  Representatives from Altus AFB Environmental, Fire Protection, and Bioenvironmental Engineering Flights, and the Compressed Gas Cylinder Storage Supply Chief have produced a comprehensive program to provide operational safety and coordinated emergency response.  FIVE-YEAR ACCIDENT HISTORY: Altus AFB has not had an accidental release of chlorine from the covered processes, which caused a fatality (on-site or off-site), damage, or environmental impacts.  EMERGENCY RESPONSE PROGRAM: The RMP regulations require that \"response actions have been coordinated with local emergency planning and response agencies\" (40 CFR 68.12(b)(3)).  Overall safety at Altus AFB is a function not only of programs to prevent accidental releases from occurring, but also of programs to mitigate the effects of accidental releases should they occur.  Altus AFB has an emergency response program that is designed to protect lives, the environment, and property in the area.  Altus AFB Fire Department personnel are stationed on-site 24 hours/day, 365 days/year.  Altus AFB has a good working relationship with local officials. The civil engineer readiness flight chief is the local Emergency Planning District Coordinator and EPCRA coordinator.  Notification of the surrounding communities/municipalities has been greatly simplified because the dispatch for local fire departments is also the dispatch for police and emergency management agency personnel. Altus AFB has mutual agreements for response to emergency releases of regulated substances between their Fire Department and the Regional Response Team, Oklahoma Response Team, and the city of Altus police, fire department, and hospital.  Altus AFB has several response plans containing many of the required elements of an emergency response pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23483,
      "SummaryText": "gram. However, to meet the requirements of the RMP rule for chlorine, these plans have been supplemented to contain substance-specific information.  PLANNED CHANGES TO IMPROVE SAFETY:  Safety and Emergency Preparedness is an integral part of any Altus AFB daily operations and activities. Exposure risks to employees and the public have been minimized through ongoing inspections and documented compliance with applicable regulatory requirements.  At this time, no further improvements have been identified.  However, Altus AFB is working to reduce the storage quantity of chlorine and convert to a \"just-in-time\" system. This will reduce the chance of accidental release and may reduce the storage of chlorine below the RMP threshold quantity."
    }
  ]
}