{
  "FacilityID": 23494,
  "FacilityName": "Kraft Foods North America, Inc.",
  "FacilityStr1": "22 County Route52",
  "FacilityStr2": null,
  "FacilityCity": "North Lawrence",
  "FacilityState": "NY",
  "FacilityZipCode": "12967",
  "Facility4DigitZipExt": "9726",
  "FacilityCountyFIPS": "36089",
  "LEPC": "St. Lawrence County LEPC",
  "FacilityLatDecDegs": "44.804722",
  "FacilityLongDecDegs": "-74.676389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 49246952,
  "ParentCompanyName": "Kraft Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 877147228,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "22 County Route52",
  "OperatorStr2": null,
  "OperatorCity": "North Lawrence",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12967",
  "OperatorZipCodeExt": "9726",
  "RMPContact": "Willie Miller",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000036294",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-05-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-05-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 44.80442,
  "FRS_Long": -74.67603,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33485,
      "AltID": null,
      "FacilityID": 23494,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34328,
          "ProcessID": 33485,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43862,
          "ProcessID": 33485,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543862,
          "ProcessID": 33485,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23494,
      "SummaryText": "EXECUTIVE SUMMARY:\n\n\n1.0     Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in North Lawrence, New York has an excellent record in preventing and minimizing releases of anhydrous ammonia ( hereafter, anhydrous ammonia will be referred to as ammonia ).  The North Lawrence has a thorough emergency training program for on-site emergency responders. \n\nThe emergency response procedures at this facility ensure emergency response coverage, 24 hours - 7 days per week. There are also adequate provisions for coordination with outside agencies, such as with the North Lawrence Voluntary Fire Department, the LEPC, and OP-Tech Environmental Services Inc. in the event of an emergency.\n\n\n2.0     Process Description and Regulated Substances\n\nAt this location Kraft Foods processes blended yogurt and cottage cheese.  The North American Industrial Classification System (NAICS) code for the primary process at this facility is ( 311513 and 311514 ).  This facility is also capable of packaging yogurt and cottage cheese products.  Several areas of the plant are refrigerated to preserve the food products.  Some of these areas include:  receiving, processing, cooling and product staging.  \n\nKraft Foods has one regulated substance under 40 CFR 68: ammonia, at this location.  Ammonia is used as a cooling agent in the refrigeration of the yogurt and cottage cheese products in the various locations listed above. \n\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia stored on-site is approximately 18,000 pounds.\n\n    Ammonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989. Its distinctive, pungent odor is very noticeable to most people, even in small quantities. Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it can be corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23494,
      "SummaryText": "oncentrations, can cause  burns. The potential risks to people exposed to an accidental ammonia release include irritation of respiratory tract, burning of skin and other tissue when contacted by ammonia vapor, and freezing of skin and other body tissue when contacted by liquid ammonia.\n\n\n3.0     Release Scenarios\n\nAlthough there are quality and safety systems in place at Kraft?s North Lawrence plant, a release from the ammonia refrigeration system could potentially affect employees on-site and the general public offsite.   USEPA requires companies to use models for \"worst-case\" and \"alternate\" release scenarios for each regulated chemical.  Given the safety precautions at the plant, both scenarios are unlikely to occur. If a release occurred, however, the alternative scenario would be more likely.  \n\nThe ammonia release scenario was modeled using SLAB (June 1990 version) to obtain the\ndistance to the ERPG-2 endpoint.   The Emergency Response Planning Guideline, Level 2,\nERPG-2, was developed by the American Industrial Hygiene Association.  It refers to the\nlevel of ammonia that individuals could be exposed to for up to one hour without being\nsubjected to irreversible or other serious health effects that could make it difficult for them\nto leave the affected area.\n\n\n4.0     General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThis facility has developed an OSHA PSM program for their ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention program which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program 3.  Thus, Kraft?s ammonia PSM has been reviewed and determined to be complete for the RMP document.\n\nThere are several aspects of the prevention program that are key:\n\n\n     1.     The plant is re-examining their PSM Program for ammonia safety compliance.  \n\n     2.     Process piping and instrumentation have been insta"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23494,
      "SummaryText": "lled in locations that are \n             away from high traffic areas. \n\n     3.     The North Lawrence plant is very active in promoting and establishing \n             good Health and Safety techniques.  The plant currently has seven Health \n             and Safety Teams and one PSM Team that is focused primarily on the PSM\n             Program elements.\n\n     4.    The plant maintains good training, certification and employee awareness of operating procedures \n\n\n5.0     Five-year Accident History\n\nThe review of this facility's accident history includes the following range of dates: June 22, 1994 - June 21, 1999.  According to 40 CFR Part 68.42(a), there have no accidental releases at this facility.   \n\n\n6.0     Emergency Response Program\n\nAs mentioned earlier, in Section 1.0, the North Lawrence Plant has developed an emergency response program that is comprised of three elements:  emergency communications, emergency evacuation procedures and an off-site plan.  Separate documents, or plans, were produced to define the policies and procedures of the North Lawrence Plant.  The plans were also written to identify to the plant employees what precautions and steps should be taken in the event of the release of a hazardous substance.  The combination of the three documents yields a comprehensive Emergency Response Program document.  The following paragraphs discuss briefly the contents of each of the three specified documents.\n\nThe emergency communications document is written to establish procedures to notify appropriate  ( the North Lawrence Fire Department, USEPA and Coast Guard, New York State Department of Environmental Conservation, and the Local Emergency Response Committee ).  The local agency, the North Lawrence Fire Department, shall be notified via 911.\n\nThe emergency evacuation procedures document is designed to provide an orderly, effective plan of action for protecting employees in emergency situations when an evacuation is necessary.\n\nThe off-site plan was "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23494,
      "SummaryText": "written to identify the hazardous chemicals on-site ( and the quantities ), the primary emergency responders site diagrams, support available at/from the facility and a hazard analysis ( off-site consequences and affected area, including receptors ).\n\n\n7.0     Planned Changes to Improve Safety\n\nBased on the \" what-if/checklist\" Process Hazard Analysis ( PHA ) completed for ammonia, a list of action items was developed and is being monitored to determine if implementation was accomplished.  In order to meet the items addressed in the PHA the North Lawrence plant developed a \" PHA Action Plan \" in 1996.  The plant is currently reviewing the previous PHA conducted in 1996.  Following the review a new \" PHA Action Plan \" will be developed and implemented throughout the plant.                                                             Below is a list of implemented changes that has  help improve the safety of our ammonia system.                 1.  1997 installed ammonia detection and exhaust ventilation in the compressor engine room.                        2.  1998 installed additional ammonia detectionion and ventilation through a plant system upgrade project.    3.  1998 installed some explosion venting wall panels in plants ammonia transfer room.                                4.  1998 contracted techinical ammonia training for plant maintenance personal.  ( ongoing )  \n5.  2001 finished installation  of Ammonia Safety Shut Down for plants compressor room."
    }
  ]
}