{
  "FacilityID": 23508,
  "FacilityName": "Farmland Industries Barnesville Ammonia Terminal",
  "FacilityStr1": "3 1/2 Miles North on Highway 9",
  "FacilityStr2": "PO Box 552",
  "FacilityCity": "Barnesville",
  "FacilityState": "MN",
  "FacilityZipCode": "56514",
  "Facility4DigitZipExt": "0552",
  "FacilityCountyFIPS": "27027",
  "LEPC": null,
  "FacilityLatDecDegs": "46.703611",
  "FacilityLongDecDegs": "-96.444722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.farmland.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 155846264,
  "ParentCompanyName": "Farmland Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7129547,
  "Company2DUNS": 0,
  "OperatorName": "Farmland Industries, Inc",
  "OperatorStr1": "3 1/2 Miles North on Highway 9",
  "OperatorStr2": "PO Box 552",
  "OperatorCity": "Barnesville",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56514",
  "OperatorZipCodeExt": "0552",
  "FTE": 3,
  "OtherEPAFacilityID": "MND985700533",
  "EPAFacilityID": "100000048174",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-02 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-05-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-12-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-12-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2006-03-31 00:00:00",
  "AnniversaryDate": "2004-12-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 46.6908,
  "FRS_Long": -96.3526,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility Sold",
  "_processes": [
    {
      "ProcessID": 33504,
      "AltID": "Ammonia Storage/Transfer",
      "FacilityID": 23508,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 43884,
          "ProcessID": 33504,
          "ChemicalID": 56,
          "Quantity": 68868682.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34347,
          "ProcessID": 33504,
          "NAICSCode": "42291",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18817,
              "Process_NAICS_ID": 34347,
              "SafetyReviewDate": "1999-03-24 00:00:00",
              "PHA_Date": "1998-04-08 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-04 00:00:00",
              "TrainingReviewDate": "1999-01-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Group Discussion",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-04 00:00:00",
              "EquipmentInspectionDate": "1998-09-15 00:00:00",
              "EquipmentTested": "Piping ( Ultrasonic thickness testing)",
              "ChangeMgmtDate": "1999-02-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-02-04 00:00:00",
              "PreStartupReviewDate": "1999-02-04 00:00:00",
              "ComplianceAuditDate": "1998-11-15 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-04 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-04 00:00:00",
              "ContractorSafetyReviewDate": "1999-02-04 00:00:00",
              "ContractorSafetyEvalDate": "1998-09-15 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27439,
                  "PreventionProgram3ID": 18817,
                  "ProcessChemicalID": 43884
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23508,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-05-20 00:00:00",
    "ERTrainingDate": "1999-06-09 00:00:00",
    "CoordinatingAgencyName": "Barnesville Fire Department",
    "CoordinatingAgencyPhone": "2183542250",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23508,
      "SummaryText": "RISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\nFARMLAND INDUSTRIES, INC.\nBARNESVILLE, MN TERMINAL\n\n\nFarmland?s Barnesville, MN., ammonia terminal is located on 56 acres in western Minnesota, about 20 miles from the North Dakota border.  The terminal functions as a storage and distribution facility for the fertilizer used by Farmland?s 600,000 producer-members to grow crops that provide high-quality, low-cost food for families around the world.\n\nFacility snapshot\n\nAnnual volume of 55,000 tons of ammonia is distributed through this Farmland facility, which has been supplying co-ops in northwestern Minnesota and eastern North Dakota for 23 years.  As a terminal, the facility provides a vital link in the chain of Farmland inputs.  Anhydrous ammonia, produced at Farmland?s nitrogen manufacturing facilities, is shipped to the Barnesville terminal where it is stored until needed by local co-ops for their patron?s fields.  By eliminating much of the shipping costs for the co-ops, the terminal helps contain the cost of fertilizer for Farmland member-owners and provides a convenient location for them to get their product.\n\nImpact on the community\n\nFarmland is a solid, reliable member of the Barnesville community.  Its employees are committed to customer service and the facility is available to service member-owners as needed throughout the year.  Farmland's Barnesville employees know their customers are also their neighbors and strive to \"always be there if someone needs us.\"\n\nEmployee snapshot\n\nFarmland has three full-time employees with more than 50 years of combined operating experience at its Barnesville ammonia terminal.  Although few in number, these employees have a large impact on the community in which they live.  The terminal superintendent holds a position on the Barnesville City Council and an operator has been a wrestling coach for area youth for eight years.  In addition, these employees are active with the Local Emergency Planning Committee.\n\nFarmland employees recogni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23508,
      "SummaryText": "ze that community involvement and volunteerism is the most effective way to improve the communities in which they live.\n\n\n\nPollution Prevention Policy\n\nFarmland Industries Inc., is committed to protecting the environment and preserving our natural resources for future generations.  We pledge to eliminate or reduce our use of toxic substances and minimize our use of energy and the generation of all wastes to the extent technically and economically feasible.  We strive to prevent the generation of pollution at the source, but, where that cannot be achieved, we are committed to environmentally sound methods of recycling, treatment and disposal.  By preventing pollution at the source, we strive to achieve cost savings, increase operational efficiencies, improve the quality of our products and services, maintain a safe and healthful workplace and improve the environment.\n\nRisk Management Program\n\nThis facility is subject to the Environmental Protection Agencies Risk Management Program Rule under the Clean Air Act Amendments of 1990.  The Risk Management Program Rule require facilities handling threshold amounts of certain substances to develop a  Risk Management Program and submit a Risk Management Plan.  The Program requirements include submission of the risk management plan, hazard assessments defining possible off-site impacts of certain regulated substance release scenarios, a five-year accident history, development of a process accidental release prevention program and an emergency response program.\n\nThe following is the Executive Summary of the Risk Management Program for Farmland Industries, Inc.;  Barnesville Ammonia Terminal at Barnesville, MN.\n\nStationary Source and Regulated Substances\n\nInitial construction and operation of the Barnesville Ammonia Terminal began in 1976.  Several changes, additions and improvements since that time have resulted in the current design of the facility.  The anhydrous ammonia distributed from this facility is used as agricultural "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23508,
      "SummaryText": "fertilizer.\n\nThe Barnesville Ammonia Terminal is a distribution facility for anhydrous ammonia consisting of a 30,000 ton atmospheric storage tank, with a secondary containment dike, a 90,000 gal pressurized ammonia storage vessel, a product heater, refrigeration compressors and assorted vessels and piping.  Propane is used to warm the refrigerated ammonia from the atmospheric storage tank.  Propane is stored in a pressurized 18,000 gallon tank.\n\nAnhydrous Ammonia and propane are the only substances, regulated by the EPA's RMP rule, that are used, or stored at the Barnesville facility. The process that includes these substances is subject to the RMP rule as a program 3 process\n\nAccidental release prevention and Emergency Response Policy\n\nIt is Farmland?s corporate policy to eliminate accidental releases of any substance, in particular hazardous and regulated materials.  The management and employees of this facility are committed to the prevention of any accidental releases.  Accidental release prevention is critical to the safe operation of this terminal, the safety of its employees and the community.\n\nTo achieve its accident and accidental release prevention goals, Farmland is committed to the following:\n\n? A knowledgeable, motivated and highly trained employee group\n? A well-designed facility that is maintained and operated in a superior manner\n? Implementation of a Comprehensive Process Safety Management and Prevention Program\n? Continual review and improvements that enhance safety and accident prevention\n? Excellence in safety programs and practices, and a superior safety and accident record\n? Planning, preparation and training for emergency response\n\nThe Barnesville terminal has had a written Emergency Response Plan, as required by the RMP and other EPA and Occupational Safety and Health Administration (OSHA) rules, in effect for many years, and is committed to implement the plan in response to any accidental release to minimize the impact to employees, the com"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23508,
      "SummaryText": "munity and the environment.  The response plan is coordinated with the Local Emergency Response committee and emergency response agencies.  Terminal personnel have interacted with these agencies for many years regarding the plan and activities at the terminal.\n\nEmployees are trained in the implementation of the plan and appropriate response activities that could be required in the event of an emergency.\n\nPrevention program\n\nThe Barnesville ammonia terminal is subject to the OSHA Process Safety Management (PSM) rule, 29CFR1910.119.  This rule has required this facility to establish an accident prevention program which is equivalent to that required for Program 3 processes under the EPA?s RMP rule.\n\nThe OSHA PSM/EPA Prevention Program consists of a set of facility management policies and procedures that promote and recognize process safety and the prevention of accidents in processes that handle, use, store or process hazardous materials.  The procedures provide accident prevention process controls to all aspects of terminal activities.\n\nThe Barnesville terminal adheres to the requirements of PSM and has written policies and procedures addressing all aspects of PSM and EPA Prevention Program requirements including routine training and testing of employees and drivers that operate any part of the process, alarms to indicate operating conditions outside the norm, an off-hours phone notification system for abnormal conditions, video monitoring of truck loading/unloading stations and automatic shutdown of ammonia transfer should control parameters fall outside normal conditions.  Additionally, the facility is equipped with terminal perimeter sensors to monitor potential emissions from the facility, continuously.  The facility has addressed the elements of accident prevention included in these programs throughout its years of operation.\n\nThe facility is diligent in adhering to and maintaining its Process Safety/Prevention Program.\n\nEmergency Response Program\n\nThe Barnesvil"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23508,
      "SummaryText": "le Ammonia Terminal has established an Emergency Response Program and has a written Emergency Response Plan as required by the Risk Management Program rule and other Environmental Protection Agency and OSHA rules.  This plan has been coordinated with the LEPC local representatives, and is available to all responding agencies.\n\nThis facility is an active participant in the Local Emergency Planning Committee and interacts with various local agencies in its emergency planning.  These include local fire departments, law enforcement agencies and hospitals.\n\nEmployees receive annual training on the facility emergency response plan and also receive additional safety training, both in general, and in the competencies relative to their required roles in the emergency response plan.\n\nFive-year accident history\n\nThe RMP rule requires inclusion of the facility?s five-year accident history for all accidental releases of regulated substances that resulted in deaths, injuries or significant property or environmental damage on or off site. \n\nFarmland?s Barnesville terminal has an excellent five-year accident record with no RMP reportable releases.\n\nHazard Assessment\n\nSynopsis of worst and alternative-case release scenarios:\n\nThe hazard assessment element of the RMP rule requires the evaluation of potential off site effects of \"worst-case\" and \"alternative-case\" release scenarios of regulated substances in a program 3 process.\n\nThe EPA has defined a worst-case scenario as the release of the largest quantity of a listed chemical from a vessel or process line failure, taking into account passive mitigation and administrative controls.  The impact of these potential releases must be quantified in accordance with release criteria dictated in the rule.  The projected impact distance is determined using EPA defined atmospheric conditions and is intended to provide a conservative estimate of the maximum possible area that might be affected.  According to the EPA, the worst-case scenario is"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 23508,
      "SummaryText": " intended to ensure that no potential risks to public health are overlooked, but the distance to an endpoint estimated under worst-case should not be considered a \"public danger zone.\" Possible causes or the extreme improbability that such releases may occur are not considered.\n\nThe alternative release scenario definition is a release that is more likely to occur than the worst-case release; however, as with the worst-case, the alternative release improbability is not taken into consideration.\n\nWorst Case Toxic Release - Anhydrous Ammonia\n\nAmmonia is a colorless gas with a strong pungent odor, and is one of the most widely used industrial chemicals.  It is prepared industrially from natural gas, steam and air.  Some of this ammonia is used for direct injection into croplands as a fertilizer.  A large amount of industrial ammonia is reacted with carbon dioxide to make urea fertilizer, or reacted to make ammonium nitrate fertilizer.  Ammonia is also frequently used as a refrigerant for the storage of perishable foods.\n\nAmmonia vapors can be irritating to the nose, throat, eyes and skin.  Direct liquid contact to the skin can cause severe burns.\n\nFarmland has considered potential worst-case releases from the refrigerated atmospheric storage tank which is passively mitigated by a secondary containment dike and the bullet tank, the two largest vessels onsite.\n\nFarmland?s hypothetical worst-case scenario involves an anhydrous ammonia release from the terminal?s 90,000-gallon bullet, administratively controlled to 85% of its volume.  The worst case release assumes, as required by the rule, that this entire quantity is released as a result of a catastrophic failure of the tank, in 10 minutes.  This unlikely event was modeled with a publicly available model (DEGADIS) which has been demonstrated to provide reasonable estimates of concentrations and distances associated with release event.  The impact of this release scenario is predicted to extend beyond the facility boundary"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 23508,
      "SummaryText": " and impact public receptors.\n\nThis scenario, we believe, is a hypothetical worst-case event dictated by the rule and extremely unlikely to occur for many reasons.  In addition to the stringent design controls for this type of pressurized vessel, facility maintenance and inspection programs address the integrity of process and storage vessels, including this one, and largely preclude such massive and unlikely failures.\n\nAlternate Case Toxic Release - Anhydrous Ammonia\n\nMore likely release events than the hypothetical worst-case, tend to concentrate in areas where the ammonia product is handled such as loading and other transport activities.  Generally, significantly lower quantities are involved, due to numerous shutdown safeguards present, as they are through out the terminal, and operator intervention which tend to mitigate and limit the consequences of failures.\n\nThe hypothetical ammonia alternative release scenario considered for this process is, a release of ammonia due to the failure of a railcar unloading hoses connected for unloading into the bullet tank.  The hoses are assumed to fail due to railcar movement and release ammonia for a few seconds before an excess flow valve stops the release.  The impact of such a release was modeled with the DEGADIS model which shows that, under typical ambient conditions, the impact of the release would extend off-site.\n \nPlanned Changes for Safety Improvements\n\nSafety improvements are a continual and ongoing process at the facility which is facilitated by the Prevention Program/Process Safety Management Program. A formal process hazard analysis revalidation is conducted at least every five years, but review is constant through management of change procedures, operator training, incident investigation and mechanical integrity programs.  As a result, changes relevant to safety occur continuously as needs are identified through these procedures and policies."
    }
  ]
}