{
  "FacilityID": 23539,
  "FacilityName": "Lamb-Weston, Inc. American Falls, Idaho Plant",
  "FacilityStr1": "2975 Lamb-Weston Road",
  "FacilityStr2": null,
  "FacilityCity": "American Falls",
  "FacilityState": "ID",
  "FacilityZipCode": "83211",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16077",
  "LEPC": "Power County LEPC",
  "FacilityLatDecDegs": "42.765556",
  "FacilityLongDecDegs": "-112.911667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 21404884,
  "ParentCompanyName": "ConAgra, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": null,
  "OperatorName": "Lamb-Weston, Inc.",
  "OperatorStr1": "P.O. box 489",
  "OperatorStr2": null,
  "OperatorCity": "American Falls",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83211",
  "OperatorZipCodeExt": null,
  "FTE": 430,
  "OtherEPAFacilityID": "83211LMBWSLAMBW",
  "EPAFacilityID": "100000028052",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "077-00017",
  "SafetyInspectionDate": "2000-11-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-05-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.765556,
  "FRS_Long": -112.913333,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33548,
      "AltID": null,
      "FacilityID": 23539,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43932,
          "ProcessID": 33548,
          "ChemicalID": 56,
          "Quantity": 78000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34392,
          "ProcessID": 33548,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18848,
              "Process_NAICS_ID": 34392,
              "SafetyReviewDate": "2001-02-26 00:00:00",
              "PHA_Date": "2001-09-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-02-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-02-13 00:00:00",
              "TrainingReviewDate": "2001-02-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "one on one",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-03-25 00:00:00",
              "EquipmentInspectionDate": "2001-02-17 00:00:00",
              "EquipmentTested": "System 2 Compressor Room",
              "ChangeMgmtDate": "2001-02-14 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": "2001-02-22 00:00:00",
              "ComplianceAuditDate": "2000-05-03 00:00:00",
              "AuditCompletionDate": "2002-09-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-08-14 00:00:00",
              "HotWorkPermitReviewDate": "2001-04-19 00:00:00",
              "ContractorSafetyReviewDate": "2001-02-28 00:00:00",
              "ContractorSafetyEvalDate": "2000-12-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27473,
                  "PreventionProgram3ID": 18848,
                  "ProcessChemicalID": 43932
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23539,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-05-02 00:00:00",
    "ERTrainingDate": "2001-02-12 00:00:00",
    "CoordinatingAgencyName": "Power County Sheriff",
    "CoordinatingAgencyPhone": "2082262319",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 23539,
      "SummaryText": "PA-regulated chemical.  Virtually all major food processors, including Lamb-Weston, utilize anhydrous ammonia in large refrigeration or freezing plants and the chemical has been used in this capacity since the 1850's.\n\nOFFSITE CONSEQUENCE ANALYSIS\n\nThe offsite consequence analysis conducted as part of the Risk Management Plan includes consideration of two ammonia release scenarios as worst case release and alternative release.  The first scenario as defined by EPA states that ...for substances that are normally gases at ambient temperature and handled as a gas or liquid under pressure, the owner or operator shall assume that the ... maximum quantity in the largest vessel ... is released as a gas over 10 minutes.  The alternative scenario is defined as more likely to occur than the worst-case release scenario.  Anhydrous ammonia as used by the American Falls, Idaho facility, is a gas at ambient temperature and is stored as gas or liquid under pressure.\n\nThe worst case scenario was performed for the Freeze Tunnel High Pressure Receiver System 2, which is located in its respective engine room inside the plant and has the potential to contain 45,900 pounds or 91.8% of the inventory of anhydrous ammonia used in the system.  The 45,900 pounds of ammonia was assumed to be released from the high pressure receiver over a 10-minute period.  Other parameters included a wind speed of 1.5 meters per second, stability class of F, hole size of 5.76-inches, tank pressure of 180 psi, tank temperature of 95° F, highest temperature at the site for the last 3 years of 101° F, average relative humidity of 57%, and surface roughness category identified as the outskirts of town.\n\nThe dense gas model SLAB was used for the analyses.  SLAB is a computer model developed by Lawrence Livermore Laboratory that simulates the atmospheric dispersion of denser that air releases.  The SLAB model can simulate an evaporating pool, a horizontal jet and an instantaneous volume release.  The model"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23539,
      "SummaryText": ", Incident Investigation, Mechanical Integrity, Emergency Planning & Response, Contractor Safety, and Audits.\n\nEmployee participation brought together people that knew and understood the system, from practical experience as well as their technical knowledge, to develop the Plan.  Process safety information is a collection of data that allows us to identify and understand the hazards posed by our inventory.  Representatives from our skilled work force and Lamb-Weston management, who understood the process being analyzed including engineering behind the covered process, conducted the process hazard analysis.  This analysis identifies potential process failures that could result in an unplanned release of ammonia.\n\nIn order to safely manage changes that need to be made to the processes containing ammonia, a system of checks and balances has been established.  This system will evaluate safety prior to the work being done, and provide a solid review of the system to assure that once started, it will run as designed.  Standard operating procedures are in place for each operating phase and are readily accessible to those workers who operate or maintain the process.  In addition, a policy and procedure are used to assure that proper safety precautions are taken for all personnel performing Hot Work.  The integrity of the refrigeration system equipment is maintained according to recognized and generally accepted good engineering practices and according to a well-documented preventative maintenance program.\n\nAn extensive training program is in place for those employees and contractors involved in working on or around the process and covers operating procedures, health and safety hazards, emergency operations, and safe work practices.  The facility also has a training program for all employees and contractors regarding the hazards of the chemical and safe work practices to be used.  Part of this training includes monthly safety meetings as well as drills on spill response and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23539,
      "SummaryText": "plant evacuation.\n\nAny incidents related to the ammonia refrigeration systems are promptly investigated even though the rule only requires investigation of those incidents, which resulted in, or could have reasonably resulted in, a catastrophic release.  All incidents are analyzed, resolved, and findings shared with affected employees.  In order to assure compliance with all elements of the prevention program, an audit is conducted every three years including a report of the findings and documentation of any deficiencies corrected.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases at the American Falls, Idaho facility in the last five years from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe American Falls, Idaho facility has an emergency response plan which has been coordinated (reviewed) with the Power County Local Emergency Response and Planning Committee.\n\nThe plan applies to all Lamb-Weston employees, visitors, and support service contractors performing tasks and activities as part of ongoing operations.  The purpose of the plan is to establish policies and procedures for protecting the health and safety of employees, contractors, and visitors, and to comply with all applicable federal and state regulations.\n\nTraining of employees and contractors includes providing a copy of the plan upon initial employment at Lamb-Weston and reviewing it for their specific assignment, annual refresher training for current employees, and review for all whenever the plan is changed.  In addition, plant evacuation drills are conducted on a regular basis.\n\nThe plan is comprehensive enough to deal with all types of emergencies specific to the Lamb-Weston, American Falls, Idaho facility and defines the following:\n\n·\tHow to conduct activities in a manner that protects the safety"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 23539,
      "SummaryText": "of employees, the public, and the environment\n\n·\tPreferred means of reporting fires, hazardous materials incidents, medical, and any other emergencies\n\n·\tEmergency escape procedures and emergency escape route assignments\n\n·\tProcedures to account for all employees including contractors and visitors\n\n·\tRescue and medical duties for those employees who are involved with the Emergency Response Team\n\n·\tNames of agencies and persons to contact for further assistance, information, or explanation of the Plan\n\nThe American Falls, Idaho facility has established an emergency response system based on the Incident command System (ICS) concept developed by the National Interagency Incident Management System (NIIMS).  This system is utilized by local, state, and national response agencies and provides for integration of external agency support during emergency incidents.  Regardless of the severity of the event, the ICS will be implemented.\n\nThree main hazardous situations may be encountered at the Lamb-Weston, American Falls, Idaho facility:  Fire, uncontrolled chemical release, and natural or man-made disasters.  A fire situation beyond the ability of plant personnel to manage, with the use of hand-held fire extinguishers, or by the automatic fire suppression system within the plant, will prompt activation of the American Falls Fire Department for assistance.  There are three integrated hazardous materials response teams (HMRT) on site for responding to any uncontrolled chemical release.  The magnitude of the release will determine the extent of the HMRT involvement, which may be activated along with local, regional, state, and national response agencies as needed.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe American falls, Idaho facility takes seriously its responsibility for the safety of its employees, neighbors, and community.  Central to this responsibility are our programs to prevent the release of chemicals to the environment.  We will continue to implement these precautions"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 23539,
      "SummaryText": "and programs, to act as a responsible neighbor, and to maintain the goodwill of the community."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 23539,
      "SummaryText": "CORPORATE SAFETY COMMITMENTS\n\nLamb-Weston, Inc. has potato-processing plants located in Washington, Oregon, Idaho, and Minnesota.  Lamb-Weston is committed to providing its employees and the surrounding community with a safe and healthy environment.  The Risk Management Program is an integral part of our strong commitment to sustainable development, which means development that meets the needs of the present without compromising the ability of future generations to meet their own needs.  Sustainable Development requires reductions in the generation of wastes and pollutants, protection of clean air and clean water, sustainable protection of the land, and the wise use of energy.  It requires employee commitment, strategic thinking, innovation, the involvement of our suppliers, new technology and enhanced production processes.\n\nDESCRIPTION OF FACILITY AND REGULATED SUBSTANCES\n\nThe American Falls, Idaho processing facility produces various potato products such as french fries, hash browns, and formed potato products.  This facility employs approximately 430 people.  The plant site consists of a main processing plant, raw potato storage buildings, boiler/refrigeration facility, water treatment facility, and refrigerated cold storage.  Activities are conducted at this site during all months of the year.\n\nThe potato processing cycle includes a wide array of steps.  The plant purchases the majority of its potatoes from local growers.  Since potatoes have a single growing season, they must be held under controlled storage conditions.  Prior to processing, the potatoes are separated by size and processing specifications.  The inspected, washed, peeled, and hand-trimmed potatoes are cut, blanched and fried.  The final products are frozen, packaged and prepared for shipping.\n\nThe freezing process where finished products are conveyed through the freezer to be quickly cooled and frozen is made possible by refrigeration systems containing 78,000 pounds of anhydrous ammonia, an E"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23539,
      "SummaryText": "ing was performed using the horizontal jet option so that no vertical momentum was introduced.  This would be representative of a hole in the side of a vessel or pipe.  The results of the SLAB analyses for the worst-case scenario indicate off-site impacts.\n\nThe alternative release scenario was performed for a ¼-inch hole at high pressure receiver conditions releasing liquid ammonia in a horizontal jet.  This release could represent a variety of release scenarios including the five described in the regulation (40 CFR Ch. I Part 68.28).  The release point is considered to be outside since there is piping at high pressure receiver conditions in the vicinity of the high pressure receiver.  The release rate was considered to be constant over a one-hour period.  The one-hour was chosen because it is the basis of the 200 ppm end-point for ammonia.  Other parameters included average meteorological conditions for the site, tank pressure of 165 psi, tank temperature of 90° F, wind speed of 9.0 mph, stability class of D (neutral), site temperature of 47° F, relative humidity of 57%, and surface roughness category identified as the outskirts of town.  The dense gas model SLAB was also used for the analyses of the alternative release scenario, and off-site impacts were indicated.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nLamb-Weston's accident prevention/loss control systems and policies involve a unified approach that integrates technologies, procedures, and best-management practices.  The OSHA-PSM and the EPA-RMP plans work together to assure that potential on-site hazards and off-site consequences are identified and controlled to the best of our ability, and the processes are meeting health and safety objectives.\n\nThe RMP Prevention Program is comprised of the 13 elements of OSHA's PSM program:  Employee Participation, Process Safety Information, Process Hazard Analysis, Management of Change, Pre-Start-Up Safety Review, Operating Procedures, Hot Work Permits, Employee Training"
    }
  ]
}