{
  "FacilityID": 23557,
  "FacilityName": "Harwood's Mill Water Treatment Plant",
  "FacilityStr1": "3626 Route 17",
  "FacilityStr2": null,
  "FacilityCity": "Grafton",
  "FacilityState": "VA",
  "FacilityZipCode": "23692",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51199",
  "LEPC": "Peninsula LEPC",
  "FacilityLatDecDegs": "37.134056",
  "FacilityLongDecDegs": "-76.459972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.newport-news.va.us/wwdepartment/index.htm",
  "FacilityEmailAddress": "www.newport-news.va.us/wwdept",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Newport News Waterworks",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Newport News Waterworks",
  "OperatorStr1": "2600 Washington Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Newport News",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23607",
  "OperatorZipCodeExt": null,
  "RMPContact": "Milton Cummings",
  "RMPTitle": "Safety and Training Coordinator",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080556",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-05-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-05-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-05-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-04-13 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-23 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 37.13387,
  "FRS_Long": -76.45857,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33579,
      "AltID": "Chlorine System",
      "FacilityID": 23557,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 34423,
          "ProcessID": 33579,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 43968,
          "ProcessID": 33579,
          "ChemicalID": 62,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 543968,
          "ProcessID": 33579,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23557,
      "SummaryText": "This Risk Management Plan (RMP) was prepared for the purpose of demonstrating compliance with the requirements of Section 112 (r) of the Clean Air Act pursuant to the United States Environmental Protection Agency (USEPA) regulations contained in Tiltle 40 of the Code of Federal Regulations Part 68 (40 CFR Part 68) Sections 68.1 - 68.220, Accidental Release Prevention Provisions.\n\n40 CFR Part 68 requires stationary sources with listed substances present in a quantity greater than the corresponding threshold quantity to develop and implement a Risk Management Program that includes a hazard assessment, a prevention program, a management system, and an emergency response program.  The Risk Management Program is to be described in an RMP that is registered with the USEPA, submitted to state and local agencies, and made available to the public.  At the Harwood's Mill facility, chlorine, which is a listed substance, is stored in a quantity greater than its threshold quantity of 2, 500 pounds (lbs).\n\nThis RMP was prepared in accordance with 40 CFR Part 68, Subpart G, 68.150 -  68.190.  In accordance with 40 CFR Part 68.10 (d) (2), since accidental releases of chlorine have the potential to result in an offsite impact and chlorine storage operations are subject to the Process Safety Managment (PSM) Standard, Program 3 requirements apply to this facility.\n\nThe Harwood's Mill facility uses chlorine in its water treatment process for disinfection and destruction of disease-producing organisms that may be present in the water.  Chlorine is stored at the Harwood's Mill facility as a liquid under pressure in one ton steel cylinders.  These cylinders are stored inside of a building.  The liquid chlorine is transferred from the cylinder to a chlorine evaporator.  Upon vaporization, the chlorine is then sent to the chlorinator which control the chlorine dosage to the specific applications.  The Harwood's Mill maximum intended inventory of chlorine is 40 cylinders.\n     \nThe Harwood's"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23557,
      "SummaryText": " Mill facility's accidental release prevention and emergency response procedures are based on the goal of storing and handling this substance in a manner that prevents exposure to employees and the nearby community.   It is the facility's policy to adhere to applicable state and federal regulations.\n\nIn accordance with 40 CFR 68.25 (a)(2), the Harwood's Mill facility is required to analyze and report in the RMP one worst-case release scenario that is estimated to create the greatest distance in any direction to a toxic endpoint for chlorine.  In accordance with 40 CFR 68.25 (b)(1) and 40 CFR 68.25 (c)(1), the basis for the worst-case release scenario is defined as the greatest amount held in a single veseel.  For the Harwood's Mill Facility, the single largest chlorine storage vessel is a one ton cylinder.  Since chlorine exists as a gas at ambient conditions, it is assumed that the entire contents of one cylinder, approximately 2, 000 lbs, would be released as a gas over a 10-minute period.   \n\nIn accordance with 40 CFR Part 68.28 (a), the Harwood's Mill facility is required to evaluate at least one alternative release scenario for chlorine.  The alternative release scenario selected is a 0.5-inch diameter puncture hole in the transfer piping between the one ton cylinder and the evaporator.  This type of leak would be expected to continue for 3-4 minutes before it is recognized and mitigated.  This type of release is estimated to result in a two phase release (liquid and gas) of approximately 634 lbs of chlorine.   \n\nThe Harwood's Mill facility, as part of its accidental release prevention program, rquires both current and newly hired operators and maintenance personnel to complete and pass the facility's Personnel Qualification Standards (PQS).   The PQS consists of training in the following subjects: operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The Harwood's Mill facility also conducts equipment ins"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23557,
      "SummaryText": "pection and maintenance activities as part of th accidental release prevention program.\n    \nThe Harwood's Mill facility has an existing emergency response plan that incorporates emergency response and coordination precedures for chlorine releases.  The local fire department and local emergency planning committee are included in this plan.\n\nThe Harwood's Mill facility conducted a process hazard analysis (PHA) in March 1999.  As a result of this PHA, the facility is evaluating the installation of an emergency chlorine scrubber."
    }
  ]
}