{
  "FacilityID": 23574,
  "FacilityName": "Equilon Enterprises LLC. Hartford Ill. Terminal",
  "FacilityStr1": "220 E Hawthorne Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Hartford",
  "FacilityState": "IL",
  "FacilityZipCode": "62048",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17119",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "38.968889",
  "FacilityLongDecDegs": "90.105556",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "S1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8069044,
  "ParentCompanyName": "Equilon Enterprises L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 4294737,
  "Company2DUNS": null,
  "OperatorName": "Equilon Enterprises L.L.C.",
  "OperatorStr1": "777 Walker",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175721",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-06-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-05-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-14 00:00:00",
  "AnniversaryDate": "2006-05-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.831738,
  "FRS_Long": -90.087196,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33606,
      "AltID": "Process Vessel Storage",
      "FacilityID": 23574,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 43999,
          "ProcessID": 33606,
          "ChemicalID": 98,
          "Quantity": 120508.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34453,
          "ProcessID": 33606,
          "NAICSCode": "42271",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18890,
              "Process_NAICS_ID": 34453,
              "SafetyReviewDate": "2001-01-09 00:00:00",
              "PHA_Date": "1998-06-29 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-22 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "fire monitors",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "operator surveillance",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "modification of mercaptan system",
              "OpProceduresReviewDate": "2001-02-01 00:00:00",
              "TrainingReviewDate": "1998-12-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-02-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-13 00:00:00",
              "EquipmentTested": "pump,piping,meter,relief system,vessel condition, deluge system",
              "ChangeMgmtDate": "2000-11-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-07 00:00:00",
              "PreStartupReviewDate": "1999-05-13 00:00:00",
              "ComplianceAuditDate": "1998-06-30 00:00:00",
              "AuditCompletionDate": "1999-01-22 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-20 00:00:00",
              "HotWorkPermitReviewDate": "2000-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2000-09-18 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27524,
                  "PreventionProgram3ID": 18890,
                  "ProcessChemicalID": 43999
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23574,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-05-01 00:00:00",
    "ERTrainingDate": "2000-08-29 00:00:00",
    "CoordinatingAgencyName": "Hartford Fire Department",
    "CoordinatingAgencyPhone": "6182544393",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 23574,
      "SummaryText": "hazards, such as lockout/tagout, confined space entry work, hot work, opening process equipment or piping, and control over entrance into the Terminal by maintenance, contract and other support personnel.  Covered contractors are also required to follow safe work practices while working at the Terminal. \n\n5.10\tManagement of Change\n\nThe Hartford Terminal has a comprehensive system to manage facility changes.  This system requires that changes to items such as process equipment, chemicals, or procedures be properly authorized and reviewed before being implemented.  Changes are reviewed to:  (1) confirm that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected equipment and process safety information, as well as procedures, are updated to incorporate these changes, as necessary.  In addition, operating and maintenance personnel are provided any necessary training resulting from the change.\n\n5.11\tIncident Investigations\n\nThe Terminal forms incident investigation teams with a variety of members, depending upon the incident, to investigate incidents that resulted in, or reasonably could have resulted in, a catastrophic release of propane from the Propane operation.  The goal of such investigations is to determine the facts and develop recommendations designed to prevent recurrence of the incident.  The investigation team's findings and recommendations are reported to terminal management for review and resolution.  Such recommendations are tracked until they are resolved.  PSM investigation reports are retained for five years.\n\n5.12\tPSM Compliance Audits\n\nThe Terminal has procedures to perform periodic PSM compliance audits of the Propane operation.  The audits are conducted by at least one person who is knowledgeable in the process.  A report of the findings of the audit is developed.  The terminal determines and documents how it will respond to each finding and how the finding ha"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23574,
      "SummaryText": "rning the Propane operation as necessary.  For example, this information may include (1) a process overview, (2) workplace safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices designed to control the entrance, presence and exit of contract employers and employees in the Propane operation area. In addition, the Terminal has a process designed to periodically evaluate the performance of such contract employers in fulfilling their obligations as specified in the PSM Standard while performing PSM-covered work on or adjacent to the Propane operation. \n\n5.7\tPre-Startup Safety Review\n\nThe Hartford Terminal has a process that requires that a pre-startup safety review (PSSR) be conducted whenever a PSM-covered modification to the Propane Operation requires a change in its process safety information.  Personnel with expertise in operations and engineering participate in the pre-start up safety reviews.  A PSSR checklist has been developed to facilitate the review. \n\n5.8\tMechanical Integrity\n\nA terminal specific mechanical integrity program has been developed and implemented for the Propane operation. The following items provide a summary of the elements of mechanical integrity:\n\n¨\tWritten mechanical integrity procedures,\n\n¨\tTraining program for employees involved in maintaining the integrity of process equipment,\n\n¨\tProcess equipment and inspection program,\n\n¨\tVerification that deficiencies in equipment are corrected in a timely manner,\n\n¨\tSuitable equipment fabrication,\n\n¨\tQuality assurance program to verify proper installation of equipment, quality of spare parts and other replacement materials.\n\nAlso, a list of equipment for the Propane operation is maintained.  Equipment that is determined to be critical to the safe and reliable operation of the process is placed on a preventative maintenance (PM) schedule.\n\n\n\n\n\n\n5.9\tSafe Work Practices\n\nThe Terminal requires employees to follow safe work practices to provide for the control of"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 23574,
      "SummaryText": "This document outlines a Risk Management Program (RMP), prepared in accordance with the requirements of Section 112 of the Clean Air Act (CAA) and associated regulations found at 40 CFR Part 68.  This RMP addresses the Propane Storage and Truck Loading operation of the Equilon Hartford, IL Terminal.  The Terminal operates as a distributor of gasoline, diesel fuel and propane products.  Of these processes, only the Propane storage and truck loading operation (hereafter referred to as the Propane operation) is subject to the RMP regulations set forth at 40 CFR Part 68, as applicable.\n\n\n2.0\tACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Equilon Hartford Terminal has implemented policies and procedures that are designed to help prevent potential RMP-covered accidental releases from the Propane operation. However, if an RMP-covered release does occur, terminal personnel have been trained on emergency response procedures that were designed to help control and contain the release.\n\n3.0\tDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Equilon Hartford Terminal is located at 220 Hawthorne Ave. in Hartford, Illinois. The facility was acquired from Clark Refining and Marketing Inc. in December 1999. The Terminal operates as a distributor of gasoline, diesel fuel and propane products.\n\nThe Propane operation is managed as a separate operation from the distribution of gasoline and diesel fuel and is located in a separate area within the facility plot area.  The Propane operation consists of four (4) propane storage vessels, piping, pumps, filters and a truck loading station.  Mercaptan is injected during the truck loading operation as an odorant.  The propane storage vessels store liquefied propane product in horizontal pressure vessels ¿ also referred to as ¿bullet tanks¿.  Of the six (6) employees employed at this terminal, three (3) are primarily involved in operating the Propane operation.\n\n4.0\tOFFSITE CONSEQUENCE RESULTS\n\nAs required by the EPA"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23574,
      "SummaryText": "RMP rule a hypothetical worst case scenario was identified.  It involves the hypothetical release and subsequent vapor cloud explosion (VCE) based on the full inventory of Tank T114 for calculation purposes.  The capacity of this tank is 120,508 pounds of liquefied propane.  No passive mitigation measures were taken into account in evaluating this scenario.  The maximum distance to the 1-psi endpoint for this WCS is 0.4 miles.\n\nThe alternative release scenario for propane at the terminal is the failure and subsequent ignition of propane from a 150 psig, pump at 1696 pounds per minute. No active or passive mitigation systems were taken into account in evaluating this scenario.  The distance to reach the endpoint of concern of 1 psi is 0.1 mile (528 feet).\n\n5.0\tGENERAL ACCIDENTAL RELEASE/CHEMICAL SPECIFIC PREVENTION PROGRAM STEPS\n\nThe following is a summary of the accident prevention program in place at the Terminal.  The Propane operation at the Terminal is regulated by the EPA Risk Management Program (RMP) rule and the OSHA Process Safety Management (PSM) Standard, as applicable.  This summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.  In addition, according to the requirements of the EPA RMP rule, due to public receptors within the Off-Site Consequence endpoint range of effect and the Propane operation's being subject to the OSHA PSM Standard, this RMP is a Program Level 3 submittal.\n\n\n\n5.1\tEmployee Participation\n\nThe Hartford Terminal provides for and encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation include reviewing and updating operating procedures and participating as a member of a process hazard analysis (PHA) team.  Employees have access to information created as part of the Terminal safety program.  Specific ways of employee involvement have been documented in an employee participa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23574,
      "SummaryText": "tion plan that is maintained at the Terminal and is accessible to all employees.\n\n5.2\tProcess Safety Information\n\nThe Hartford Terminal maintains a variety of technical documents concerning the Propane operation.  These documents cover a variety of subjects including chemical properties and associated hazards, limitations on processing conditions and specific chemical inventories, and equipment design parameters.  The propane operation has safe upper and lower limits identified in associated operating manuals.\n\nChemical-specific information, such as material safety data sheets, cover a variety of topics such as the potential exposure route, hazards associated with potential exposure, first aid and emergency response, and physical properties of the chemical..  For specific process areas, the Terminal has established operating limits for specific parameters (e.g., temperature, level, composition). Process controls, monitoring instruments, trained personnel, and safety systems such as alarms on critical variables and shutdown systems are used to maintain the safe operation of the Propane operation.  \n\t\nThe Terminal also maintains various technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as evaluating proposed Propane operation process. \n\n5.3\tProcess Hazard Analysis\n\nThe Hartford Terminal has a program designed to identify hazards associated with the operation that are created as a result of deviations from process design intent.  The objective of a process hazard analysis is to identify, evaluate and verify that safeguards are in place to mitigate and/or control the process hazards that can result in the catastrophic release of a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23574,
      "SummaryText": "highly hazardous chemical as defined by the OSHA PSM Standard.  A variety of PHA methodologies can be used to perform the PHAs. \n\nFindings and recommendations from the PHA are forwarded to Terminal management for review and resolution.  The review and follow-up process can be facilitated through an action plan, which documents the status of the PHA recommendations.  The action plan should include a listing of the recommendations, a time frame for addressing each recommendation.  The progress of this action plan is then monitored until all recommendations are completed and resolution is documented. \n\nThe Terminal updates and revalidate the Propane Operation's PHA every 5 years. The PHA revalidation process is similar to the process used to develop, track and document PHA findings and recommendations. \n\n5.4\tPropane Operation Operating Procedures\n\nOperating procedures have been developed to provide instructions for safely conducting activities involved for the Propane operation at the Terminal.  Operating phases are addressed in these procedures. The procedures are periodically reviewed and annually certified as current and accurate.  The procedures are also reviewed as necessary to reflect changes to the Propane operation made through the management of change process.\n\n\n\n5.5\tOperator Training\n\nVarious training is offered to Hartford Terminal employees.  The training is typically based on the employee's job assignment and training documentation is maintained.  The training topics include the following: \n\nBasic Operator Training\nPropane Operation Training\nMaintenance Training\nSH&E-relatedTraining (such as hazard communication, personal protective equipment, etc.)\nDOT Training\nEmergency Response Team Training\n\n5.6\tContractors\n\nFrom time-to-time contractors are retained to perform PSM-covered work on or adjacent to the Propane operation process.  The Terminal has procedures in place related to contractor selection.  Selected contractors are provided with information conce"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 23574,
      "SummaryText": "s been addressed.  The two most recent PSM compliance audits are maintained. \n\n5.13\tHot Work Permitting\n\nAnytime work involving ignition sources, also referred to as Hot Work, is to be performed at the terminal a Work Authorization Permit will be used. This permit is intended to be used along with the Equilon Transportation Health & Safety Manual and/or other applicable Equilon procedures. The Work Authorization Permit is designed to be used as a Job Safety Analysis to identify recognized hazards, and to foster communication about the safety aspects of the work that is being authorized.  The Work Authorization Permit must be used as part of Pre-Job planning and comply with applicable federal, state, local, and company requirements.  In addition, it assists in defining personnel roles and responsibilities.\n\nPrior to the start of work, the conditions of the permit shall be communicated to all facility personnel and contractor representatives who may be affected by the work planned.  Upon completion of the work, the completed permit will be returned to the Equilon representative for the debriefing and retention purposes.\n\n6.0\tFIVE YEAR ACCIDENT HISTORY\n\nA review of available accident/incident data for the Propane operation for the years of Equilon Transportation ownership shows no RMP-covered releases which meet the incident criteria set forth in 40 CFR Part 68.42.\n\n\n\n\n\n7.0\tEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe emergency response plan for the Terminal is documented in the Equilon Emergency Plans and Procedures.  The emergency response system is an organizational plan designed to help manage a major incident (e.g., fire, vapor release, earthquake, spills, etc.).  It is based on the Incident Command System (ICS).  This type of system allows Equilon facilities to mitigate an emergency situation by setting up effective communications, establishing a management plan, providing necessary resources and allowing coordination with any municipal/state/federal emergency res"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 23574,
      "SummaryText": "ponse agency that may respond to an emergency at the facility. \n\nIf a catastrophic release of propane that impacts the community occurs at the Terminal, the emergency response plan is designed to facilitate contact between the Equilon Incident Commander and the County Emergency Preparedness Coordinator.  The County Emergency Preparedness Coordinator will assess the nature of the emergency incident and determine if he/she will delegate the County Incident Commander responsibility to the Hartford Fire Department Fire Chief.  Additional coordination procedures are described in the Madison County LEPC Emergency Operating Plan."
    }
  ]
}