{
  "FacilityID": 23646,
  "FacilityName": "Wilmington Facility",
  "FacilityStr1": "2600 Hwy 421 North",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "NC",
  "FacilityZipCode": "28401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37129",
  "LEPC": "New Hanover County LEPC",
  "FacilityLatDecDegs": "34.270278",
  "FacilityLongDecDegs": "-77.952778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22694413,
  "ParentCompanyName": "Southern States Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Southern States Chemical Company",
  "OperatorStr1": "2600 Hwy 421 North",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28401",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": "NCD980727200",
  "EPAFacilityID": "100000053274",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "NC0022088",
  "SafetyInspectionDate": "2000-09-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2001-04-18 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.2857,
  "FRS_Long": -77.9677,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33737,
      "AltID": "Sulfuric Acid Mfg",
      "FacilityID": 23646,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 44153,
          "ProcessID": 33737,
          "ChemicalID": 69,
          "Quantity": 2000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 44154,
          "ProcessID": 33737,
          "ChemicalID": 58,
          "Quantity": 1200000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34584,
          "ProcessID": 33737,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 18985,
              "Process_NAICS_ID": 34584,
              "SafetyReviewDate": "2001-05-21 00:00:00",
              "PHA_Date": "1999-04-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-04-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-05-21 00:00:00",
              "TrainingReviewDate": "2000-12-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-05-21 00:00:00",
              "EquipmentInspectionDate": "2001-05-11 00:00:00",
              "EquipmentTested": "All vessels on #1 plant and pumps and pipe thicknesses",
              "ChangeMgmtDate": "2001-01-09 00:00:00",
              "ChangeMgmtReviewDate": "2001-05-21 00:00:00",
              "PreStartupReviewDate": "2000-10-31 00:00:00",
              "ComplianceAuditDate": "2000-12-07 00:00:00",
              "AuditCompletionDate": "2001-02-21 00:00:00",
              "IncidentInvestigationDate": "2001-05-19 00:00:00",
              "InvestigationChangeDate": "2001-05-21 00:00:00",
              "ParticipationPlansReviewDate": "2001-05-21 00:00:00",
              "HotWorkPermitReviewDate": "2001-05-21 00:00:00",
              "ContractorSafetyReviewDate": "2001-05-21 00:00:00",
              "ContractorSafetyEvalDate": "2001-01-18 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27626,
                  "PreventionProgram3ID": 18985,
                  "ProcessChemicalID": 44153
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23646,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-05 00:00:00",
    "ERTrainingDate": "1998-07-15 00:00:00",
    "CoordinatingAgencyName": "New Hanover County EMA",
    "CoordinatingAgencyPhone": "9103414300",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23646,
      "SummaryText": "SOUTHERN STATES CHEMICAL COMPANY\n\n\nWilmington Facility\nWilmington, North Carolina\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nAt Southern States Chemical Company, we are committed to being associated with unmatched environmental performance as measured by our employees, customers, regulators, and the public.  Our management philosophy goals are achieved by the personal commitment of our employees and contractors, and by open communication with our employees, customers, neighbors, and with regulators.  The accidental release prevention and emergency response programs we have at our facilities are part of the high standards for which we strive.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by the law.\n\nAt the Wilmington facility, we produce commercial grade sulfuric acid from elemental sulfur.  We also manufacture mixed acid by blending oleum and nitric acid.  Oleum and nitric acid are the only toxic substances regulated under the Risk Management Program (RMP) that are present at the Wilmington Facility.  There are no regulated flammable substances at the facility.  The facility is classified as Program Level 3 under the regulation.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n \nWorst Case and Alternative Release Scenarios\n\nAs specified by the U. S. Enviro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23646,
      "SummaryText": "nmental Protection Agency (EPA) RMP Regulations, our worst case release scenario for toxic chemicals would be the loss of all of the oleum in our largest vessel within 10 minutes.  In the case of the Wilmington Facility, this would involve our 240 ton oleum tank.  Such a scenario is highly unlikely, however, using the EPA Offsite Consequence Analysis (OCA) methods, the distance that the resulting release could cause off-site impacts would be more than 25 miles.  Although we have numerous controls to prevent such releases (high level alarms, emergency shutdown, etc.) and to manage their consequences, no credit for any controls or mitigation measures was taken into account when evaluating this scenario.  \n\nAs specified by the EPA RMP Regulations, we have determined alternative release scenarios for each toxic substance that is stored or processed at the facility.  In the case of oleum, the alternative release scenario, characterized as a more likely scenario which would involve an offsite exposure to oleum vapors, is calculated to reach approximately 1.2 miles from the release point.  In the case of nitric acid, the alternative release scenario is calculated to reach approximately 1.1 miles from the release point.  These distance calculations are also based on the EPA OCA methods, which are known to overpredict the impact of any potential release from such scenarios.  We selected the alternative release scenario for oleum based on a ?\" nipple being knocked off the oleum feeder to the mixed acid tank.  The nitric acid alternative release scenario is based on a pump seal failure.  We have mitigation measures in place to greatly reduce the chance that such events could ever occur.  The PSM Mechanical Integrity program is in place ensuring that critical parts are periodically inspected for wear and corrosion.  Also, a leak of oleum or nitric acid would be noticed immediately during normal operating hours because personnel monitor the plant continuously and night-time pers"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23646,
      "SummaryText": "onnel inspect the plant once per hour.  The presence of these mitigation measures serves to either prevent these scenarios from occurring or minimize their impact if they do occur.  \n\nWe have discussed these potential oleum and nitric acid releases with our employees and with local emergency response officials in New Hanover County, thereby further reducing the possibility of any impact on the public. \n\n\nPrevention Program\n\nThe Wilmington Facility has been operating under the strict guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1998.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety have helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\nInstalling a system to route vent gases from all the oleum tanks through a wet scrubber in order to prevent the SO3 vapors from directly discharging to the atmosphere.  We periodically inspect the wet scrubber to ensure that the scrubber is operated efficiently at all times.\nInstalling magnetic driven pumps for oleum, thereby avoiding drive shafts and mechanical seals.\nProviding emergency shutdown buttons at various locations within the facility in order to shut down the processes during emergency situations.\nProviding an electrical interlock system between the sulfuric acid recirculation pump and the turbine and sulfur pump.  In the event of a failure of the sulfuric acid recirculation pump, the electrical interlock system will shutdown the turbine and the sulfur pump to minimize release of SO3 and SO2 gases to the atmosphere.\nProviding alarms at the mixed acid loading station.  We have also provided emergency shutdown button at the control room in order to shutdown"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23646,
      "SummaryText": " the mixed acid loading station. \nInstalling surveillance cameras in order to detect acid fumes from the mixed acid plant and the stacks.\n\nThese safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility since we acquired it in 1982.\n\n\nFive Year Accident History\n\nNo incident resulting in offsite impacts or onsite injuries from an oleum or a nitric acid release has occurred at the Wilmington Facility within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Wilmington Facility with the New Hanover County Fire Department and several other area volunteer fire departments.  Also involved in emergency response of the facility would be the Wilmington Hazardous Materials Agency, the New Hanover County Sheriff, and the New Hanover County Emergency Management Agency.  The Wilmington Facility Plant Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the facility is in place and that plan has been coordinated with local officials, along with evacuation procedures, regular drills, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Wilmington Facility.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\nThe Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23646,
      "SummaryText": "or procedures.\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\nThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\nInternal and third party compliance audits will ensure we maintain and increase our level of safety protection.\nAn ongoing dialogue with the New Hanover County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.\n\nWe encourage all interested citizens or community organizations to contact the New Hanover County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}