{
  "FacilityID": 23699,
  "FacilityName": "Turbine Engine Components Textron",
  "FacilityStr1": "23555 Euclid Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Euclid",
  "FacilityState": "OH",
  "FacilityZipCode": "44117",
  "Facility4DigitZipExt": "1703",
  "FacilityCountyFIPS": "39035",
  "LEPC": "Cuyahoga County LEPC",
  "FacilityLatDecDegs": "41.575",
  "FacilityLongDecDegs": "-81.520833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 157373390,
  "ParentCompanyName": "Textron, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1338979,
  "Company2DUNS": null,
  "OperatorName": "Turbine Engine Components - Textron",
  "OperatorStr1": "23555 Euclid Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Euclid",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44117",
  "OperatorZipCodeExt": "1703",
  "FTE": 160,
  "OtherEPAFacilityID": "44117RFLFR23555",
  "EPAFacilityID": "100000175972",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-11-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-06-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-06-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2003-08-19 00:00:00",
  "AnniversaryDate": "2006-06-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.57723,
  "FRS_Long": -81.51633,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 33821,
      "AltID": "HF Storage",
      "FacilityID": 23699,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 44271,
          "ProcessID": 33821,
          "ChemicalID": 55,
          "Quantity": 1350.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34671,
          "ProcessID": 33821,
          "NAICSCode": "336412",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23699,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-02 00:00:00",
    "ERTrainingDate": "2000-12-11 00:00:00",
    "CoordinatingAgencyName": "Euclid Fire Department",
    "CoordinatingAgencyPhone": "2167311212",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 23699,
      "SummaryText": "ents Textron believes there would be no offsite impact even if all three drums of 70% hydrofluoric acid were to be upset.  The distance to the calculated endpoint would be 0.2 miles, which is less than the distance to surrounding residential or commercial entities.  Further, this scenario would occur only both the containment pallets and the dike also fail.  The more likely scenario would be that the contents of the drum would go into the containment pallets, or at least be contained within the dike system, which further minimizes potential migration and impact to surrounding facilities and the public.  \n\nIn the past five years, there have been no recorded accidents at Turbine Engine Components Textron involving hydrofluoric acid."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 23699,
      "SummaryText": "Turbine Engine Components Textron - Cleveland Operations is one of many tenants at 23555 Euclid Avenue, leasing both office and manufacturing space from the building owner, Argo Tech Corporation.  Because of this unique situation, accident release prevention programs and emergency response procedures have been developed in collaboration with Argo Tech Corporation, and have been integrated with their overall program for emergency response.  Turbine Engine Components Textron occupies a portion of the Argo Tech building, which is in excess of 1,000,000 square feet under roof.\n\nTurbine Engine Components Textron manufactures metal turbine engine components for high performance engines.  The majority of the manufactured items are turbine blades of one size or another.  The blades are formed from a titanium alloy, and the process involves chemical cleaning, application of a forge coating, forging, and shaping, grinding, and polishing.  \n\nAs part of the cleaning process, Turbine Engine Components Textron uses a dilute hydrofluoric acid solution (<50%).   Hydrofluoric acid is diluted to a concentration less than 50% before it is used in the facility, but is stored in concentrations not to exceed 70%.  Up to three drums of 70% hydrofluoric acid are stored at any one time, for a total of approximately 165 gallons or approximately 1380 pounds.  This amount exceeds the minimum threshold of 1000 pounds, triggering the Risk Management Program.  Hydrofluoric acid is a colorless nonflammable liquid with a strong irritating odor.  \n\nThe storage area for the 70% hydrofluoric acid is in Raw Materials Storage Area 2.  The acid is stored in DOT approved plastic 55-gallons drums, all in one area.  The drums are within a diked area capable of containing approximately greater than 165 gallons, and are also on containment pallets designed to contain 1.5 times the contents of the 55 gallon drums in the event of a release>.  The area is open to the ceiling, which is approximatly 20 to 30 feet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23699,
      "SummaryText": "overhead, and generally open to surrounding manufacturing areas.  The closest access to outside is the loading dock area, which is approximately 150 feet from the storage area.  \n\nAll emergency response incidents are handled through the building owner, Argo Tech, and a team of tenant representative.  Turbine Engine Components Textron maintains an emergency evacuation plan, which would be initiated in the event the drums of 70% hydrofluoric acid were upset.  In general, the work areas (both Turbine Engine Components Textron and others within the Argo Tech building) would be evacuated immediately, and the Argo Tech emergency response team and/or Euclid Fire Department or Local Emergency Planning Committee response team would be alerted as to the nature of the emergency.  They would then proceed with entering the area in approved personal protective equipment to stop any release and/or conduct cleanup.  \n\nBased on the fact the Turbine Engine Components Textron occupies only a portion of the Argo Tech building, and the location of their space within the building, it is very unlikely that any release from the 70% hydrofluoric acid drums would escape the building in liquid form.  Vapor releases would also likely remain in the building for a significant amount of time.  The Argo Tech building is large, which minimizes the potential impact on surrounding communities.  The closest residential area is approximately 0.25 miles to the west-southwest, but the remaining surrounding areas are industrial, with a few commercial operations present.  \n\nThe worst-case release scenario would be if the three drums were to be upset and release their full contents to a bare concrete floor within one minute.  Wind speeds are estimated at 0.1 meters per second, which is an overestimation since all releases would be contained inside the building.  Because of the size of the facility, releases outside the building are not likely.  Based on the worst-case release scenario, Turbine Engine Compon"
    }
  ]
}