{
  "FacilityID": 23889,
  "FacilityName": "Costco Wholesale - Morris",
  "FacilityStr1": "3800 N. Division Street",
  "FacilityStr2": null,
  "FacilityCity": "Morris",
  "FacilityState": "IL",
  "FacilityZipCode": "60450",
  "Facility4DigitZipExt": "9463",
  "FacilityCountyFIPS": "17063",
  "LEPC": "Grundy County LEPC",
  "FacilityLatDecDegs": "41.394556",
  "FacilityLongDecDegs": "-88.424694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.costco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Costco Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808696844,
  "Company2DUNS": 0,
  "OperatorName": "Costco Wholesale",
  "OperatorStr1": "3800 N. Division Street",
  "OperatorStr2": null,
  "OperatorCity": "Morris",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60450",
  "OperatorZipCodeExt": "9463",
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176365",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-08-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-08-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-07-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-07-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.34,
  "FRS_Long": -88.42159,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34101,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 23889,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 44686,
          "ProcessID": 34101,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 34957,
          "ProcessID": 34101,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19255,
              "Process_NAICS_ID": 34957,
              "SafetyReviewDate": "2001-03-06 00:00:00",
              "PHA_Date": "2001-07-11 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "operator error",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "implementation of emergency, maintenance, and general safety procedures",
              "OpProceduresReviewDate": "2001-07-09 00:00:00",
              "TrainingReviewDate": "2001-05-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-07-09 00:00:00",
              "EquipmentInspectionDate": "2001-07-23 00:00:00",
              "EquipmentTested": "pre-startup testing on entire system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-04-18 00:00:00",
              "PreStartupReviewDate": "2001-07-23 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-04-18 00:00:00",
              "HotWorkPermitReviewDate": "2001-04-18 00:00:00",
              "ContractorSafetyReviewDate": "2001-05-15 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28051,
                  "PreventionProgram3ID": 19255,
                  "ProcessChemicalID": 44686
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23889,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Morris Fire Department",
    "CoordinatingAgencyPhone": "8159422121",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23889,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Costco Wholesale facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations.\n\nCostco Wholesale has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of Costco Wholesale to evacuate and to allow the fire department/HazMat Team to respond to the emergency.  The refrigeration contractor will be available for guidance and assistance.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nConstruction of the ammonia refrigeration system at Costco Wholesale was completed in July 2001.  The facility is new and operations are scheduled to commence once the refrigeration system is fully functional.  The facility serves as a distribution point for chilled goods that are shipped to Costco Wholesale retail outlets.  The facility is located at 3800 N. Division Street (State Route 47) in Morris, Illinois, just north of the intersection of the Interstate 80 freeway and Illinois State Route 47.  Morris is located approximately 55 miles sou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23889,
      "SummaryText": "thwest of Chicago.  The immediate area is primarily rural with some developed land (the town of Morris) south of Interstate 80.  The ammonia system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe ammonia refrigeration system uses approximately 20,000 pounds (3,600 gallons) of ammonia for cross dock operations, warehouse cold storage, and freezer storage.  Refrigeration process equipment at the facility operates continuously.  Compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for three cold storage areas: Cross Dock (35F), Cooler Storage (28F), and Freezer Storage (-10F).  The majority of the system is located in the machine room including vessels, compressors, and associated piping.  The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the high pressure receiver to the high temperature pump accumulator.  The high pressure receiver also supplies liquid ammonia to the compressors for oil cooling.  As the ammonia enters the high temperature pump accumulator, it is expanded through a hand expansion valve, reducing the pressure (and hence the temperature) in order to maintain a predetermined internal pressure.  The high temperature pump accumulator feeds a similar vessel that maintains an intermediate pressure, the medium temperature pump accumulator.  The pressure is further reduced between the medium temperature accumulator and the low temperature pump accumulator.  Each accumulator vessel supplies pumped liquid ammonia to a distinct set of evaporators.  The high temperature accumulator serves twenty-six (26) cross dock/cold storage evaporators.  The medium temperature accumulator typically serves eight (8) 28F cooler "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23889,
      "SummaryText": "evaporators (that can also be supplied by the high temperature accumulator as needed), and the low temperature accumulator serves four (4) -10F freezer evaporators.  Fans in each evaporator are used to blow air across and through the coils which partially vaporizes the liquid ammonia as heat from the room is transferred to the ammonia.\n\nThe resulting two-phased (liquid/vapor) ammonia from each set of evaporators is returned to each accumulator respectively in which constant pressures (temperatures) are maintained based on the suction pressure of the corresponding compressors.  The vapor from the accumulators is then drawn to eight (8) compressors where the pressure and temperature of the gas is increased.  All eight compressors work in combination to compress the vapor pulled from the three accumulator vessels.  Compressor discharge (high pressure ammonia vapor, or hot gas) is routed to two (2) condensers where it is condensed to a high pressure liquid and drained back to the high pressure receiver.  Hot gas is also used  for defrost of the freezer and meat evaporators.  An auto purger periodically purges the system of non-condensibles collected in the condensers.  Dual pressure relief valve assemblies are installed on each vessel to relieve high pressure ammonia to a water diffusion tank through a common header in case of a high pressure event.\n\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of ammonia that can be stored in a vessel - 20,000 pounds in 10 minutes.  (The capacity of the High Pressure Receiver is approximately 25,000 pounds of ammonia.)  The release rate to the outside atmosphere was limited by the enclosure of the building that houses the high pressure receiver to yield a rate of 1100 pounds per minute.  The most pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  Reference tables in the EPA-approved Risk Management Program"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23889,
      "SummaryText": " Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in rural conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n*  Alternative Release Result Summary\n\n     Scenario Description: A release of ammonia from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of ammonia due to the pressure of the tank is 126 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  Reference tables in the Risk Management Program Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in rural conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Costco Wholesale ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Costco Wholesale facility operates in accordance with OSHA's Process Safety Management regulation.  Refrigeration contractors, experts in the ammonia refrigeration industry, are contracted at the facility to maintain the system and perform any repairs.\n\nThe Costco Wholesale facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in the cold storage areas, and automatic shut down systems that prevent equipment damage and ammonia releases.  In addition, the majority of the ammonia inventory is maintained inside the machine r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23889,
      "SummaryText": "oom and just outside of the machine room (condensers).  All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to a water diffusion tank.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\"\n\nFIVE YEAR ACCIDENT HISTORY\n\nThis facility including the ammonia refrigeration system is new as of July 2001.  There have been no ammonia-related accidents at the facility.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nCostco Wholesale has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations, as well as to incorporate any changes at the facility.\n\nIn case of an ammonia release emergency, Costco Wholesale plans to evacuate all employees stationed in the cold storage warehouse and alert the local emergency responders (fire department).  The emergency response efforts will also be coordinated with the managers at the dry building at the facility, as both depots are located on the same property.  Costco Wh"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 23889,
      "SummaryText": "olesale plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) provided mitigation measures to improve safety at the Costco Wholesale facility located at 3800 N. Division Street in Morris, Illinois.  Many of the recommendations are complete and implemented as of the system startup date.  All recommendations are scheduled to be complete by July 1, 2002.\n\n\nR01    Ensure that every employee at the facility has the following information: 1) general awareness of ammonia at the facility, 2) how to report an ammonia release, 3) where to go when they are told to evacuate.\n\nR02    Coordinate emergency response efforts with the local emergency responders (i.e. fire department) on a periodic and ongoing basis.\n\nR03    Determine what actions are taken during an ammonia leak by the ammonia detection system including whether an off-site alarm company is called.\n\nR04    Include a periodic test and calibration of the ammonia detectors (based on the manufacturer's recommendations) in the facility's maintenance program.\n\nR05    Consider installing a visual alarm outside the engine room that is activated by an ammonia detection in the engine room.\n\nR06    Determine whether liquid drains exist in the engine room floor.  If yes, also determine where they terminate.\n\nR07    Ensure that extraneous materials, especially flammables, are not stored in the engine room.\n\nR08    Ensure that relief valves are replaced or recertified on a 5 year schedule.  Also, replace any relief valve that engages to vent pressure.\n\nR09    Ensure that a visual inspection is included in the maintenance program for all vessels.  Paint all vessels as needed.\n\nR10    Consider equipping the ammonia detectors in the engine room with a UPS (Un-interruptible Power Supply).\n\nR11    Ensure that safety shower/eye wash stations are located in and outside the engine room.\n\nR12    Ensure that a water sourc"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 23889,
      "SummaryText": "e (i.e. portable water bottle, hose, eye wash station) is located on the roof near the Condensers.\n\nR13    Confirm that a mechanical high level float switch exists on each pump accumulator vessel that shuts down the compressors.\n\nR14    Ensure that an annual test is performed on the mechanical high level shut down float switches on each pump accumulator vessel.\n\nR15    Consider implementing a daily log sheet for the engine room to be completed by a Costco employee.\n\nR16    Ensure that an oil draining procedure is documented and followed, including refrigeration contractors.\n\nR17    Ensure that all evaporator coils are periodically maintained by cleaning the pans and coils.\n\nR18    Establish a maintenance program for all ammonia equipment that includes manufacturer recommendations and/or industry standards.\n\nR19    Ensure that the Condensers are periodically maintained including a water treatment service and cleaning out the water reservoir.\n\nR20    Consider implementing a procedure for the contracted ammonia technician to check in with Costco management upon arrival at the facility.\n\nR21    Consider implementing a procedure for the contracted ammonia technician to check in with Costco management prior to performing non-routine work on the roof (or in another isolated location).\n\nR22    Ensure that the valves in the Emergency Refrigerant Control Box are labeled as to the corresponding upstream vessel."
    }
  ]
}