{
  "FacilityID": 23989,
  "FacilityName": "Sinton Dairy Food's Comp. L.L.C.",
  "FacilityStr1": "3801 N. Sinton Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Colorado Springs",
  "FacilityState": "CO",
  "FacilityZipCode": "80907",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08041",
  "LEPC": "Colorado Springs LEPC",
  "FacilityLatDecDegs": "38.886111",
  "FacilityLongDecDegs": "104.833333",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 160899324,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sinton Dairy Food's Comp. L.L.C.",
  "OperatorStr1": "3801 N. Sinton Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Colorado Springs",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80907",
  "OperatorZipCodeExt": null,
  "FTE": 170,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176481",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-06-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-08-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-08-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-08-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-08-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.88556,
  "FRS_Long": -104.83375,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34240,
      "AltID": "Refrigeration System",
      "FacilityID": 23989,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 44848,
          "ProcessID": 34240,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35098,
          "ProcessID": 34240,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19375,
              "Process_NAICS_ID": 35098,
              "SafetyReviewDate": "2001-07-01 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-03-03 00:00:00",
              "TrainingReviewDate": "2000-12-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-03-03 00:00:00",
              "EquipmentInspectionDate": "2001-08-13 00:00:00",
              "EquipmentTested": "King unit evaporator/ AC-508",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-08-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-07-11 00:00:00",
              "HotWorkPermitReviewDate": "2001-07-11 00:00:00",
              "ContractorSafetyReviewDate": "2001-07-11 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Refrigeration system",
              "_chemicals": [
                {
                  "PrimaryKey": 28187,
                  "PreventionProgram3ID": 19375,
                  "ProcessChemicalID": 44848
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 23989,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Colorado Springs Fire Department",
    "CoordinatingAgencyPhone": "7193857210",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 23989,
      "SummaryText": "SINTON DAIRY FOODS COMPANY, L.L.C.\n\nRISK MANAGEMENT PROGRAM PLAN\nExecutive Summary\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response policies at Sinton Dairy Foods Company Colorado Springs, Colorado facility are engrained in the fundamentals of the process safety prevention program.\n\nIn our Colorado Springs facility, we presently handle one chemical, ammonia, which is considered hazardous by the Environmental Protection Agency (EPA).  The same properties that make this chemical valuable as a refrigerant also make it necessary to observe specific safety precautions.  These safety precautions are exercised in the operation and maintenance of the refrigeration system to control human environmental exposure in an effort to reduce the overall threat to our workers as well as the surrounding communities.\n\nIt is Sinton Dairy Foods policy to adhere to all applicable federal, state and local rules and regulations.  However, the safe handling of hazardous chemicals is paramount at Sinton Dairy Foods.  We adhere to standards and recommended practices governing the safe handling of hazardous chemicals to ensure that we have obtained a reasonable level of risk reduction.  Investigation of inherently safer refrigeration technologies and fail-safe design applications are a few of the continuous improvements occurring at Sinton Dairy Foods.  Safety depends upon our management, the manner in which we handle ammonia, the safety devices inherent to our refrigeration systems, our operating procedures and philosophies, and the training of our employees.\n\nWe believe that accountability for safety reaches throughout all levels of management at Sinton Dairy Foods.  Senior management's commitment and dedication to continued safe-operating practices is clearly evident in our organization structure and employee empowerment.\n\nWe have made extensive improvements to safety and health programs like our prevention program (pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 23989,
      "SummaryText": "cess safety management), emergency preparedness and response, and training.\n\nAdditionally, we believe employee involvement is the cornerstone to continued safe operations.  We call it employee ownership and its success is portrayed through lower injury rates, fewer incidents, and improved efficiencies at the plant.\n\nThe Emergency Preparedness and Response Plan outlines procedures for warned and unwarned emergencies that may occur at the plant.  Warned emergencies include adverse weather such as heavy snowstorms, or conditions that are reasonably predictable.  Unwarned emergencies usually consist of on-site emergencies such as a spill, fire/explosion, or a chemical release.  \n\nFacility description and regulated substances handled\n\nSinton Dairy Foods is a large domestic producer of dairy products.  The Sinton Dairy Foods Colorado Springs plant site covers approximately 8.5 acres within the Colorado Springs City limits.  It is located at 3801 North Sinton Road in Colorado Springs, El Paso County.\n\nThere are approximately 170 employees at the plant site, which are represented by the Teamsters Local 537 union organization. \n\nWe presently handle only one chemical that is considered hazardous by the EPA.  This substance is present in quantities greater than the threshold quantity identified by the RMP regulation and therefore is included in our risk management program.\n\n? Ammonia (anhydrous)- Ammonia is used as a refrigerant at the plant.  It is received into the plant by truck, however deliveries of ammonia are infrequent.  One of the primary refrigeration vessels is the High Pressure Accumulator vessel. This vessel has a maximum inventory of 11,762 pounds that is controlled through administrative procedures.  The refrigeration system at the facility has a operating capacity of approximately 20,000 pounds (3,636 gallons) of anhydrous ammonia.\n\nOffsite Consequence Analysis (worst-case & alternate-cases)\n\nThe RMP rule requirements for identification and selection of a worst"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 23989,
      "SummaryText": "-case hazard scenario are prescriptive.  These requirements negate most safety systems designed to mitigate an incidental release.   Based on EPA defined Offsite Consequence Analysis (OCA) Guidance, Sinton Dairy Foods has one worst-case hazard scenario for the toxic material handled onsite.  This scenario is estimated to create the greatest distance in any direction to an EPA defined concentration (endpoint) resulting from an accidental release.\n\nSinton Dairy Foods worst-case toxic scenario involves anhydrous ammonia.  Ammonia is used as a refrigerant at the plant and is stored under pressure in a vessel located outside.  This vessel, the High Pressure Accumulator, may have a maximum of 11,762 pounds of liquid ammonia at any one time.  The scenario uses the EPA's theoretical assumption that the vessel catastrophically fails and liquid ammonia is released to the atmosphere.  It completely negates any mitigation attempts and assumes that all 11,762 pounds of ammonia can be spilled onto the ground and evaporated within 10 minutes to form a toxic vapor cloud that drifts offsite into the surrounding community.\n\nUsing the EPA's Offsite Consequence Analysis Guidance Document, dated October 1998, to determine the greatest downwind distance, it was determined that an ammonia vapor cloud may extend 1.3 miles from the plant.  This calculation was based on the EPA recommended guide for ammonia.\n\nThe EPA rule also requires that alternate or more likely accident scenarios involving regulated chemical be identified.  Other more likely ammonia incidents were assessed at Sinton Dairy Foods using parameters prescribed in the RMP regulation.  The analysis of the alternate scenarios included mitigation affects from both passive and active safety systems.\n\nSinton Dairy Foods conducted an iterative assessment of several alternate or more likely scenarios.  From the various scenarios assessed, Sinton Dairy Foods selected the following:\n\n? An inadvertent hose failure at a valve connection "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 23989,
      "SummaryText": "that results in complete separation from the connection point was selected as the alternate case for ammonia.  This failure assumes that 1,800 pounds of ammonia is released within a 10-minute period.  Evaporation of the liquid ammonia could result in the formation of a vapor cloud extending 0.11 miles (581 feet) from the site.\n\nAccidental release program & chemical-specific prevention steps\n\nAfter significant expansion of our facility's refrigeration capacity, ammonia inventories were increased at or above the threshold quantities established by the Occupational Safety and Health Administration (OSHA).  This required the development of a Process Safety Management (PSM) program.\n\nThis prevention program was designed around mechanical integrity and training aspects.  The primary objective of the program was to ensure complete containment of ammonia through safe operation and maintenance of the refrigeration system.\n\nSinton Dairy Foods has completed 100% of its initial process hazard analyses (PHAs) of the ammonia refrigeration system.  A PHA was conducted in June 1999. Process hazard analysis of the ammonia system expansion is pending completion of applicable process safety information and is scheduled for later this year. \n\nThe PSM Coordinator is responsible for communicating the PHA recommendations to all affected employees.  The Safety & Health Department entered the recommendations into Sinton Dairy Foods PHA Recommendation Tracking database.  Monthly progress reports are continuously sent to management based on updates received from the departments responsible for addressing the recommendations.  \n\nFive year accident history\n\nSinton Dairy Foods has a very comprehensive Incident Reporting and Investigation procedural process.  This process is defined and explained in the plant PSM procedures.  Basically, an incident occurs when a deviation from expected performance is experienced.\n\nAppointed teams knowledgeable in operations or equipment being investigated conduct"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 23989,
      "SummaryText": " formal investigations of incidents.  Root cause and corrective actions are determined and formal reports are written.  Progress regarding corrective action on all investigated incidents is tracked through completion.\n\nA number of different systems have been used in the recent past to track recommendations arising from Accident/Incident Investigations.  The system we are presently using consists of maintaining a list of all recommendations that are part of the formal Accident/Incident Reports. \n\nSinton Dairy Foods has not had an accidental release of EPA regulated chemicals within the past five years that resulted in an onsite injury or adversely affected the community.\n\nEmergency response Program\n\nOur plant emergency preparedness and response plan has been designed to address likely incidents arising from our ammonia refrigeration systems.  Emergency preparedness is a vital part of the prevention program at Sinton Dairy Foods.  While we strive to adhere to the latest mechanical integrity and inherently safer technologies we continue to plan for the unplanned ammonia release.\n\nEmergency response efforts within the plant are conducted by the Colorado Springs Fire Department.  However, our maintenance staff is trained to quickly assess any hazardous release of ammonia and act as a communications resource to make notifications and provide pertinent information during an incident\n\n\nPlanned improvements to reduce risk\n\nThe location of the outside high-pressure ammonia receiver is in close proximity to motorized traffic.  This has been assessed as a potential release point if accidentally struck by vehicular traffic.  Modifications are underway to erect barricades to protect the receiver and its associated piping."
    }
  ]
}