{
  "FacilityID": 24087,
  "FacilityName": "Salsbury Chemicals, Inc.",
  "FacilityStr1": "1205 11th. Street",
  "FacilityStr2": null,
  "FacilityCity": "Charles City",
  "FacilityState": "IA",
  "FacilityZipCode": "50616",
  "Facility4DigitZipExt": "3466",
  "FacilityCountyFIPS": "19067",
  "LEPC": "N. Cent. Reg. Emer. Plan. Dist",
  "FacilityLatDecDegs": "43.054444",
  "FacilityLongDecDegs": "-92.693056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 782974257,
  "ParentCompanyName": "Cambrex Corporation",
  "Company2Name": null,
  "CompanyDUNS": 150596716,
  "Company2DUNS": 0,
  "OperatorName": "Salsbury Chemicals, Inc.",
  "OperatorStr1": "1205 11th. Street",
  "OperatorStr2": null,
  "OperatorCity": "Charles City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50616",
  "OperatorZipCodeExt": "3466",
  "FTE": 190,
  "OtherEPAFacilityID": "IAD98459181",
  "EPAFacilityID": "100000176579",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "applied for",
  "SafetyInspectionDate": "2001-02-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-09-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-09-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-04-05 00:00:00",
  "DeRegistrationEffectiveDate": "2012-11-09 00:00:00",
  "AnniversaryDate": "2006-09-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 43.05453,
  "FRS_Long": -92.69339,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34423,
      "AltID": "Allylamine",
      "FacilityID": 24087,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 45128,
          "ProcessID": 34423,
          "ChemicalID": 23,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35282,
          "ProcessID": 34423,
          "NAICSCode": "32541",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19470,
              "Process_NAICS_ID": 35282,
              "SafetyReviewDate": "2001-05-31 00:00:00",
              "PHA_Date": "1999-08-31 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Forklift impacts drums",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Fire department has mobile foam vapor suppression equipment that can be used to deal with confined spills",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-09-06 00:00:00",
              "TrainingReviewDate": "1999-03-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer-based and SOCMA 40-hr course",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-04-18 00:00:00",
              "EquipmentInspectionDate": "2000-07-25 00:00:00",
              "EquipmentTested": "Reactor R-3601 Annual Inspection",
              "ChangeMgmtDate": "2001-08-02 00:00:00",
              "ChangeMgmtReviewDate": "2000-06-13 00:00:00",
              "PreStartupReviewDate": "2001-09-06 00:00:00",
              "ComplianceAuditDate": "1998-05-20 00:00:00",
              "AuditCompletionDate": "2001-02-27 00:00:00",
              "IncidentInvestigationDate": "2001-03-02 00:00:00",
              "InvestigationChangeDate": "2001-03-02 00:00:00",
              "ParticipationPlansReviewDate": "2001-04-27 00:00:00",
              "HotWorkPermitReviewDate": "1995-08-09 00:00:00",
              "ContractorSafetyReviewDate": "2001-04-17 00:00:00",
              "ContractorSafetyEvalDate": "2001-04-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "Allylamine process - PAA-HCL product",
              "_chemicals": [
                {
                  "PrimaryKey": 28379,
                  "PreventionProgram3ID": 19470,
                  "ProcessChemicalID": 45128
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 35283,
          "ProcessID": 34423,
          "NAICSCode": "325192",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 35284,
          "ProcessID": 34423,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24087,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2000-05-03 00:00:00",
    "ERTrainingDate": "2001-02-04 00:00:00",
    "CoordinatingAgencyName": "Charles City Fire Department",
    "CoordinatingAgencyPhone": "6412576313",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24087,
      "SummaryText": "RMP Executive Summary\n\nSalsbury Chemicals, Inc. (Salsbury), a subsidiary of Cambrex Corporation, manufactures chemicals for use in animal feed additives, human pharmaceuticals and fine chemicals. The company also develops and manufactures active pharmaceutical ingredients, fine chemicals and pharmaceutical intermediates for a wide range of applications. Salsbury maintains administrative offices, research & development and manufacturing facilities in Charles City, Iowa and markets products globally.\n\nDr. Joseph Salsbury, a veterinarian, founded Dr. Salsbury's Laboratories in 1929.  Salsbury remained family-owned until Solvay and Cie, a Belgium company, purchased it in 1979.  The name was changed to Solvay Animal Health, Inc. (SAH) in 1987.  In 1991, Cambrex Corporation acquired the chemical production assets from SAH.  The division was renamed Salsbury Chemicals, Inc. and remains a wholly owned subsidiary of Cambrex Corporation.\n\nSalsbury is committed to operating in a manner that is safe for employees, the public, and the environment.  As a part of this commitment, Salsbury has established a system to help ensure the safe operation of the Charles City Plant.  One part of this system is a risk management program (RMP) that helps manage risks at the Charles City Plant and that complies with the requirements of the Environmental Protection Agency's  (EPA's) rule 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at the Charles City Plant.  This document is intended to satisfy the requirements of the RMP rule and to provide the public with a description of the risk management program and activities at the Charles City Plant.\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nSalsbury is committed to the safety of its employees and the public, and to the preservation of the environment, thro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24087,
      "SummaryText": "ugh the prevention of accidental releases of hazardous substances.  Salsbury implements reasonable controls to prevent foreseeable releases of hazardous substances.  In the event of a significant accidental release, Salsbury evacuates workers and contacts the local fire and police departments to control and contain the release and to prevent and/or reduce the consequences of the release.\n \nSalbury's commitment is manifested further in our use of sound operating and maintenance practices, use of safety-conscious designs as well as extensive employee training.  In addition, we perform periodic safety audits and investigate all incidents and integrate lessons learned into our operations to further minimize risks to employees, the environment, and the community.\n\nSalsbury operates its plant in an environment that promotes safety, shows respect for employees, encourages individual development and supports teamwork to achieve common goals. We know that the ongoing health and safety of our employees and environmental compliance is critical to our success.  Thus, Salsbury manages our business in a manner conscious of current and future environmental needs so that we are an asset to our community through our business practices and local involvement.\n\nWe continuously improve our practices in light of advances in technology and new understandings in safety, health, and environmental science.  We make consistent measurable progress in implementing this commitment throughout our operations.  Salsbury is a member of the American Chemistry Council and the Synthetic Organic Chemical Manufacturers Association and adheres to the Responsible Care program, which is a requirement for membership in these industry organizations.\n\nResponsible Care is a cornerstone of Salsbury's environmental, health, and safety (ES&H) management systems.  It is a chemical industry initiative through which companies commit to a continuous effort to improve their responsible management of chemicals.  The pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24087,
      "SummaryText": "gram began in Canada in the late 1980's and has since spread around the globe.  It has rapidly become the single most important performance improvement program within the chemical industry.\n\nIn adopting Responsible Care, Salsbury has agreed to conduct its business according to the following principles:\n\n* To recognize and respond to community concerns about chemicals and our operations\n\n* To develop and produce chemicals that can be manufactured, transported, and disposed of safely\n\n* To make health, safety, and environmental considerations a priority in our planning for all existing and new products and processes\n\n* To report promptly to officials, employees, and customers and the public, information on chemical-related health or environmental hazards and to recommend proactive measures\n\n* To counsel customers on the use, transportation, and disposal of chemical products\n\n* To operate our plants and facilities in a manner that protects the environment, health, and safety or our employees and the public\n\n* To extend our knowledge by conducting or supporting research on the health, safety, and environmental effects of our products, processes, and waste material\n\n* To work with others to resolve problems created by past handling and disposal of hazardous substances\n\n* To participate with the government and others in creating responsible laws, regulations, and standards to safeguard the community, workplace, and environment\n\n* To promote the principles of Responsible Care by sharing experiences and offering assistance to others who produce, handle, use, transport, or dispose of chemicals\n\nWhile these principles give shape to Responsible Care, they require supporting action.  All Responsible Care signatories agree to enact six codes of management practices.  Salsbury is proud of its record of accomplishment in this regard by having implemented all six codes.\n\nCommunity Awareness and Emergency Response (CAER) Code\nSalsbury is an active participant on the regional LEPC an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24087,
      "SummaryText": "d maintains an open dialogue with local first responders.  The Company also routinely hosts site visits for first responders as well as community tours.\n \nProcess Safety Code\nSalsbury has invested in process safety by implementing management practices that address the identification and evaluation of hazards, the prevention of chemical accidents, and the management of risks to employees, the community, and the environment.  These management practices involve extensive employee training, process hazard analysis, written operating and maintenance procedures, safe work practices, management of change, incident investigation, and periodic audits.\n\nEmployee Health and Safety Code\nOur overall injury rates are consistently well below the average rates for similar-sized companies in the chemical industry.  Salsbury's average OSHA Incident Rate for the past five years is 1.25.\n\nPollution Prevention Code\nSalsbury maintains a system to establish specific process and facility-wide waste reduction and pollution prevention goals and to track our progress in meeting these goals.  Our successes achieved through employee-driven teams include significant increases in the amount of recycled by-products, reductions in the amount of waste requiring off-site disposal, and reduced air emissions.\n\nDistribution Code\nWe maintain a common carrier and distribution facility qualification and selection program to minimize risks from the handling and shipping of our products.  During the Responsible Care Management Systems Verification (MSV), Salsbury was recognized by the American Chemistry Council for our carrier qualification efforts.\n\nProduct Stewardship Code\nSalsbury places strong emphasis on proper handling of our products throughout the organization.  We continue to place our Sales and Marketing organizations as the focal point for customer contact on safety information, allowing them to focus internal resources to best assist customers.\n\n1.2 Salsbury Chemicals Plant and Regulated Substanc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24087,
      "SummaryText": "es\n\nSalsbury's plant is located on a 45-acre site on the southwestern edge of  town.  In order to manufacture a range of  bulk active pharmaceutical ingredients, Salsbury stores and handles one RMP-regulated substance in an RMP-covered process.  Polyallylamine hydrochloride was first manufactured at Salsbury in July 1997.  However, anticipated product demands have caused us to employ this process at greater production rates, which requires that we store the RMP-regulated substance, allylamine, on site in an amount that exceeds EPA's RMP threshold quantity of 10,000 lbs.  We store about 43,000 lbs. of allylamine, a toxic and flammable substance, in a 7,500 gal. bulk storage tank at atmospheric pressure. We also have an associated drum storage area containing a maximum of 25,000 lbs stored in about 80 separate 55-gallon drums.  The bulk storage tank, drum storage area, and associated process equipment has a maximum intended inventory of 100,000 lbs and is regulated as a single EPA RMP Program 3 process.\n\n1.3  Offsite Consequence Analysis\n\nIn accordance with the guidance provided by the USEPA for determining the worst-case scenario for our RMP-regulated substance, allylamine, Salsbury must assume that the entire contents of the largest storage vessel will be released.  While this is considered as extremely unlikely, even by the USEPA, the rule does not allow facilities to take credit for active mitigation systems and safe work practices that could prevent or limit the entire contents from being released.  The worst-case scenario is intended to ensure that no potential risks to the public are overlooked.\n\nAs a result, the mathematical models used to analyze the worst-case release scenario as defined by the RMP rule will tend to overestimate the distance and the area that would be impacted by an accidental release.  It should be noted, however, that the distance to the endpoint estimated under worst-case conditions should not be considered a \"public danger zone.\"\n\nIn add"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 24087,
      "SummaryText": "ition to the worst-case scenario, USEPA also requires the identification and analysis of one alternative release scenario for each RMP-covered chemical- in our case, allylamine.  Salsbury has appropriately used information from its process hazard analyses and our experience to select an alternative release scenario for allylamine.\n\nSalsbury continues to use specific systems (e.g., monitoring, detection, control, pressure relief, alarms, and active mitigation) in the design and operation of its processes that will likely limit a release or prevent a failure from occurring.\n\nThe worst-case scenario for the allylamine process is failure of the 7,500-gal storage tank, resulting in a liquid release to a diked, containment area. Administrative controls limit the amount of allylamine in the storage tank at any time to 90% of the maximum tank volume.  The released pool of liquid would evaporate and the resulting vapor cloud could eventually drift off site resulting in potential public exposure.  Since the plant is located in a rural populated area, several types of distant public and environmental receptors could be affected.\n\nThe alternative release scenario to aid local emergency planners is the failure of the 2-inch allylamine unloading hose from the tank truck to the storage tank.  This scenario assumes that allylamine is released for 5 minutes before workers isolate the hose and stop the leak.  The allylamine spills onto a curbed, concrete area, which drains into a nearby containment basin.  The allylamine pool evaporates and the resulting vapor cloud could eventually drift off site resulting in potential public exposure.  Since the plant is located in a rural populated area, nearby public receptors could be affected.\n\nSalsbury has provided funding to the Charles City Fire Department for mobile foam vapor suppression equipment, which could be used to mitigate vapor clouds resulting from allylamine spills.  However, no credit was given for this mitigation feature in thi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 24087,
      "SummaryText": "s alternative release scenario analysis.\n\n1.4  Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nSalsbury Chemicals maintains a number of programs to help prevent accidental releases and to ensure safe operation:\n\nProcess Safety Information - Salsbury maintains up-to-date, easily accessible versions of a variety of important chemical process information concerning chemical hazards, process technology, and process equipment so that our employees can effectively perform their jobs in a safe manner.\n\nProcess Hazard Analysis - Salsbury performs team-based hazard analyses on the allylamine process using industry best-practice methods.  A management safety committee evaluates the results and resolves and implements safety improvements on a timely basis.  Salsbury updates its hazard analysis when significant process changes warrant, but no less often than every five years.\n\nOperating Procedures - We maintain written operating procedures for our employees to use and we annually certify the procedures to be accurate and up-to-date.\n\nTraining - Salsbury has thorough initial and refresher training programs and we document that our employees understand the training they receive.\n\nMechanical Integrity - Salsbury has a formal system to maintain the ongoing integrity of our process equipment.  Our well-trained maintenance personnel, using best practice procedures and high quality tools and materials, perform regular inspections, tests, and preventive maintenance activities.  We document the results of these inspections and watch closely for and correct equipment deficiencies that could affect safe operation.\n\nManagement of Change - Salsbury follows a written procedure to evaluate proposed changes to our process to mange our risks and to ensure that new hazards are not introduced.\n\nPre-startup Safety Review - Following significant changes prior to startup, we perform safety reviews to ensure that all equipment is ready, procedures have been modified as n"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 24087,
      "SummaryText": "eeded, appropriate training has been done, and process hazards have been evaluated and managed.\n\nCompliance Audits - Salsbury performs audits of its process safety management system at least every 3 years and we certify that we have evaluated compliance and corrected any deficiencies.\n\nIncident Investigation - In the event of an allylamine release or a \"near-miss\", we thoroughly investigate the incident, determine root causes, and implement improvements to preclude recurrence.\n\nEmployee Participation - Salsbury knows that safety starts with its employees - the first line of defense against accidental releases.  We consult with our employees and determine the appropriate involvement of workers in all accident prevention activities.\n\nHot Work Permit - Salsbury follows procedures to ensure that spark-producing work in areas containing allylamine do not result in fires or explosions.\n\nContractors - Salsbury maintains an effective contractors safety program that evaluates the safety program and performance of potential contractor firms, provides necessary site safety information to help ensure that their work can be completed safety when on site, and periodically evaluates the contractor's safety/job performance.\n\nIn addition to the safety management system described above, Salsbury employs several chemical-specific prevention and mitigation technologies to reduce the risk of allylamine releases:\n\n* Equipment constructed to appropriate codes and standards\n* Fire prevention sprinkler system\n* Storage tank dike and unloading area containment area and sump\n* Remotely-operated shutoff valves to quickly isolate leaking piping and equipment\n* Operators  equipped with appropriate personal protective equipment to ensure quick emergency response\n\nSalsbury accident prevention program and chemical-specific steps outlined above also adhere to OSHA's process safety management standard and ACC's Responsible Care program.\n\n1.5  Five-Year Accident History\n\nSalsbury Chemicals maintains a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 24087,
      "SummaryText": "n effective incident investigation program to identify the root causes of incidents and near-misses and to determine corrective actions to preclude the incidents from recurring.  No releases of allylamine have occurred from the Charles City Plant in the past five years that have resulted in any deaths, injuries, or significant property damage on site, or known deaths injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.\n\n1.6 Emergency Response Program\n\nSalsbury Chemicals coordinates emergency response procedures with the Charles City Fire Department and with the North Central Regional Emergency Planning District.  Salsbury plant employees receive significant training to respond to minor spill events that do not have a potential for significant effects (e.g., small leaks).  In the event of a larger release, workers evacuate the area and contact the fire department and other local and regional emergency response officials.\n\n1.7  Planned Changes to Improve Safety\n\nSalsbury Chemicals constantly strives to improve the safety of its plant and processes through several formal and informal means.  A Salsbury management safety committee receives ideas for improvement via the following:  process hazard analyses, management of change reviews, pre-startup safety reviews, incident investigations,  and periodic safety audits.  We also maintain a program soliciting safety suggestions from workers.  Suggestions for improving safety are reviewed by the safety management committee, acted on expeditiously in a consensus fashion, and tracked to completion.\n\nThe following changes to improve safety are planned or have recently been completed:\n\n* A remote isolation valve on the nitrogen supply used for allylamine transfers to allow faster emergency response in case of an unloading line release\n* A reverse flow valve in the allylamine transfer line to prevent backflow from the tank in the event of a transfer hose/line leak\n* A high level alarm inter"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 24087,
      "SummaryText": "locked to automatically isolate the allylamine storage tank filling line to help avoid overfilling the storage tank\n* Allylamine transfer lines have expansion pressure relief valves piped back to the storage tank to help avoid overpressuring the transfer line\n* The allylamine storage tank is blanketed with nitrogen and the tank vapor emissions are treated in a safe scrubber system"
    }
  ]
}