{
  "FacilityID": 2416,
  "FacilityName": "ARMALY SPONGE CO.",
  "FacilityStr1": "1900 EASY ST.",
  "FacilityStr2": null,
  "FacilityCity": "WALLED LAKE",
  "FacilityState": "MI",
  "FacilityZipCode": "48390",
  "Facility4DigitZipExt": "0611",
  "FacilityCountyFIPS": "26125",
  "LEPC": "Oakland County LEPC",
  "FacilityLatDecDegs": "42.431778",
  "FacilityLongDecDegs": "-83.689472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 59904748,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ARMALY SPONGE dba ARMALY BRANDS",
  "OperatorStr1": "PO BOX 611",
  "OperatorStr2": null,
  "OperatorCity": "WALLED LAKE",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48390",
  "OperatorZipCodeExt": "0611",
  "RMPContact": "GILBERT C. ARMALY",
  "RMPTitle": "VICE PRESIDENT",
  "FTE": 30,
  "OtherEPAFacilityID": "48088RMLYS1900E",
  "EPAFacilityID": "100000030851",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "307-92",
  "SafetyInspectionDate": "1997-12-23 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.54346,
  "FRS_Long": -83.46191,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2710,
      "AltID": "STORAGE",
      "FacilityID": 2416,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2770,
          "ProcessID": 2710,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2897,
          "ProcessID": 2710,
          "ChemicalID": 44,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502897,
          "ProcessID": 2710,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2416,
      "SummaryText": "                                     EXECUTIVE SUMMARY\n\n\n\n\n\nFACILITY APPROACH:\n    In the nineteen years the company has used chemicals; testing, research and opinions have changed from one extreme to another over the hazards or non-hazards of certain chemicals. The approach our company has taken to chemical process safety no matter what the current status of a chemical might be, is for the health and safety of the employee in the workplace. The chemical safety/management policies in our facility are the result of a team approach. These policies are designed to investigate, evaluate, review, inform and educate both in the chemicals being used and the process they are used in.\nFACILITY / REGULATED SUBSTANCE:\n    Armaly Brands operates from a 68,000 square foot facility. The primary activity of the facility is the manufacturing of sponges for household, automotive and commercial cleaning.\nThe sponge is a foamed polyurethane material that uses the regulated substance Toluene Diisocyanate. Toluene Diisocyanate ( commonly known as TDI) is used as the reacting agent in the foaming process. This material is stored on site in a bulk storage/processing tank located in a portion of the facility known as the chemical room. The chemical room is a 2400 square foot room that contains all the chemicals used in the foaming process. The storage/processing tank for TDI has a holding capacity of 6000 gallons. TDI is delivered to the facility in 4500 gallon tankwagons, which are unloaded into the bulk storage/processing tank. The maximum amount of TDI on site is when a tankwagon is unloaded. At that time 5000 to 5500 gallons of TDI will be on site.  In the process, TDI is metered through a pump directly into the foam mixing chamber,  where it mixes with other polyurethane components to produce the finished product.\nWORST-CASE RELEASE SCENARIO:\n    Our worst-case release scenario is based on OCA Guidelines. This would be the failure of the bulk storage/processing tank which would release the con"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2416,
      "SummaryText": "tents of the tank. While this scenario is unlikely, we use the consequences of this scenario as the basis of our emergency response program. To mitigate any potential for harm and to ensure safety, the bulk storage/process tank is surrounded by a retaining wall (dike) that can hold the entire contents of the tank in the event of a failure. Additionally, the diked area is curtained to prevent any fumes from escaping the containment area. In the event of this scenario,  it would be better for the contents to completely escape from the tank. This lessens the risk of exposure to the emergency response team. The need to enter the containment area by the response team is unnecessary. A suction hose would be placed into the containment area where the TDI would be pumped into an awaiting tankwagon. Once the are inside the dike has been drained, a neutralizing agent can be sprayed into the area from outside the curtain. Once the area has been neutralized, the remaining clean-up can be done without risk.\nRELEASE PREVENTION / FIVE YEAR ACCIDENT HISTORY:\n    Part of the companys chemical safety process program utilizes OSHAs PMS (process safety management) practices, along with industry specific guidelines. The incorporation of OSHAs PMS rule helps guide our focus toward prevention while the industry guidelines keep us informed of the latest technologies in processes using TDI. The results of the companies efforts have been evident. We have had no accidental releases of TDI within the past five years.\nEMERGENCY RESPONSE PROGRAM:\n    The company participates with the Local Emergency Planning Commission and the community Fire and Police departments. In the event of an emergency where the public or property would be at risk, these agencies would be notified immediately. In the event of a worst-case scenario, a company specializing in hazardous clean-up would be notified first, and the local agencies notified afterward, because our worst-case scenario has no impact on any public  or e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2416,
      "SummaryText": "nvironmental receptor.\nSAFETY IMPROVEMENT:\n    Chemical safety management is an ongoing process. To eliminate the potential for an accident and continue to operate in a safe environment requires the efforts and commitment of everyone involved with the process. This requires the continual drive for an accident free and healthy work environment."
    }
  ]
}