{
  "FacilityID": 24375,
  "FacilityName": "Bayer Corporation Institute Plant",
  "FacilityStr1": "Route 25",
  "FacilityStr2": null,
  "FacilityCity": "Institute",
  "FacilityState": "WV",
  "FacilityZipCode": "25112",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54039",
  "LEPC": "Kanawha Putnam Emerg Plan Comm",
  "FacilityLatDecDegs": "38.382222",
  "FacilityLongDecDegs": "-81.778333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bayerus.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 867402489,
  "ParentCompanyName": "Bayer Corporation",
  "Company2Name": null,
  "CompanyDUNS": 64960248,
  "Company2DUNS": null,
  "OperatorName": "Glenn W. Kraynie",
  "OperatorStr1": "501 Second Avenue",
  "OperatorStr2": null,
  "OperatorCity": "South Charleston",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25303",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": "25112CWSTVROUTE",
  "EPAFacilityID": "100000121334",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-01-24 00:00:00",
  "SafetyInspectionBy": "West Virginia DEP - Division of Air Quality",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Bayer Corporation Institute Plant RMPlan",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-10-24 00:00:00",
  "ErrorReportDate": "2001-10-24 00:00:00",
  "ReceiptDate": "2001-10-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-10-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-04-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.383113,
  "FRS_Long": -81.777205,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 34840,
      "AltID": "Flex Polyols",
      "FacilityID": 24375,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 45608,
          "ProcessID": 34840,
          "ChemicalID": 12,
          "Quantity": 31520.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 35702,
          "ProcessID": 34840,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19655,
              "Process_NAICS_ID": 35702,
              "SafetyReviewDate": "1998-02-26 00:00:00",
              "PHA_Date": "2004-04-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-31 00:00:00",
              "TrainingReviewDate": "1998-10-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-31 00:00:00",
              "EquipmentInspectionDate": "1999-06-09 00:00:00",
              "EquipmentTested": "B Reactor agitator seal pot pressure sensing device",
              "ChangeMgmtDate": "1999-06-14 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-05 00:00:00",
              "PreStartupReviewDate": "1999-06-14 00:00:00",
              "ComplianceAuditDate": "1998-12-11 00:00:00",
              "AuditCompletionDate": "1998-12-31 00:00:00",
              "IncidentInvestigationDate": "1998-05-21 00:00:00",
              "InvestigationChangeDate": "1998-07-31 00:00:00",
              "ParticipationPlansReviewDate": "1997-07-02 00:00:00",
              "HotWorkPermitReviewDate": "1997-08-28 00:00:00",
              "ContractorSafetyReviewDate": "1998-02-26 00:00:00",
              "ContractorSafetyEvalDate": "1996-10-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28615,
                  "PreventionProgram3ID": 19655,
                  "ProcessChemicalID": 45608
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24375,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-28 00:00:00",
    "ERTrainingDate": "1998-12-01 00:00:00",
    "CoordinatingAgencyName": "Kanawha Putnam EPC",
    "CoordinatingAgencyPhone": "3047441838",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act, TSCA,"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 11,
      "FacilityID": 24375,
      "SummaryText": "nts.\nQuality Assurance:  The plant has a system to ensure that purchased equipment and materials meet established engineering standards and specifications. \nManagement of Change:  The plant has a management system to ensure that modified facilities and processes are safe for operation. Design and pre-startup safety reviews are conducted for facility or process changes before the changes are implemented.   \nPre-Startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\nIncident Investigation:  The plant has a program to ensure accidents, incidents, and near miss events are properly investigated to determine the Root Cause(s) and Contributing Cause(s), and to implement corrective action(s) that are needed to prevent recurrence.\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\nPermits:  The plant uses a variety of work permits to control those activities that represent work outside of regular plant operations.  These include Lockout/Tagout, Hot Work, Line Breaking and Confined Space Entry permits.  Employees are involved in designing, implementing and following the permits.  \n· Lockout/Tagout - Isolation of equipment to be serviced from energy sources.  This prevents chemical releases and injuries to workers from unexpected energization, start-up, or release of stored energy.\n· Hot Work - Protects employees and property by preventing fires and explosions.  It ensures, among other things, that no flammable materials are present when an open spark or flame may be present for maintenance activities. The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n· Line Breaking - Requires isolation and draining of lines to be opened.  It details required personal protective equipment based on the chemical contained in the line.\n· Confined Space Ent"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 24375,
      "SummaryText": "ry - System using engineering and administrative controls, along with personal protective equipment, to protect the health and safety of personnel working within confined spaces, such as tanks.\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.  Contractors must meet rigorous safety performance requirements before being allowed to work on process equipment.  Contractor employees and regular plant employees must follow all of the same plant safety procedures and requirements. \nCompliance Audits:  Periodic corporate-led and plant-led audits are conducted to ensure that process operations comply with governmental, Bayer Corporation, and Aventis (formerly Rhône-Poulenc) requirements.\nEmergency Procedures:  Plant and process specific emergency response procedures and  training to ensure proper response and notification in the event of a release.\n\n\nOperational Excellence Standards: Rigorous corporate standards that we follow to ensure that we operate our facilities in a safe and environmentally sound manner.  Our compliance to these standards is routinely audited by corporate experts.  We have Operational Excellence Standards (formerly called Manufacturing Excellence Standards) that define management systems in the following areas: Environmental, Health and Safety; Technical; Operations; Maintenance; Transportation and Storage; Quality; and Purchasing/Third Parties.  Operational Excellence (formerly called Manufacturing Excellence) is Bayer Corporation's comprehensive program to ensure that all the elements listed above are implemented and maintained at the Bayer Corporation South Charleston and Institute Plants.   The Operational Excellence program includes accountabilities for timely and proper implementation of the program elements.\n\nThese general prevention elements and the chemical specific steps discussed in the previous section are parts of an overall man"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 24375,
      "SummaryText": "agement system to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\nV. Five-Year Accident History\n\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical at the Bayer Corporation Institute Plant that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelter-in-place, property damage, or environmental damage. \n\nVI. Emergency Response Program\n\nThe Bayer Corporation Institute Plant is a tenant facility within the Aventis (formerly Rhône-Poulenc) Institute Plant.  Bayer Corporation has a contract with Aventis to obtain emergency response services from the Aventis Institute Plant Emergency Response Team and the Aventis  Emergency Operations Center (EOC).  The Institute Plant maintains a highly trained emergency response team to provide safe and appropriate response to any type of plant emergency and hazardous materials incident.  It also participates in local fire and industrial mutual aid systems through the Kanawha Putnam Emergency Planning Committee (KPEPC).    \n\nThe Institute Plant maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response including:\n· Proper first-aid and medical treatment for exposures \n· Evacuation plans and accounting for personnel after an evacuation\n· Notification of local emergency response agencies and the public if a release occurs\n· Post-incident cleanup and decontamination requirements, and\n· Inspecting, testing, maintaining, and using emergenc"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 24375,
      "SummaryText": "y response equipment.\nThe emergency response program is updated when necessary based on modifications made to facility processes.\n\nThe Institute Plant maintains a trained emergency squad to handle fires, explosions, toxic vapor releases, spills, and medical emergencies.   The plant emergency squad trains and drills with local emergency responders to enhance their skills and tactics for responding to an accidental chemical release.   Critiques are held on drills and actual events.  In addition to the plant emergency squad, Aventis staffs a Hazardous Accident Leak Team (HALT) and a HAZMAT (Hazardous Materials) Van in the Kanawha Valley that responds to accidental releases within the Institute Plant and from transportation equipment throughout the continental United States.  \n\nThe emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Detailed emergency response plans are developed and coordinated with the Kanawha Putnam Emergency Planning Committee and the community.\n\n\nVII. Planned Changes to Improve Safety\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n· A new Corporate program designed to ensure that process safety information is maintained evergreen.\n· Continue use and implementation of the Apollo Root Cause Analysis problem solving technique to investigate incidents, to identify causes of process problems, and to develop  effective solutions to prevent their recurrence.\n· Continue to implement the storage tank and piping repainting program to protect against corrosion, weathering and rust.\n· Upgrade containment dikes around the Propylene Oxide Carbon Filtration Bed. \n· Add redundant relays, controls and switches to some existing unit instrumentation.\n· Additional piping supports in areas identified by process hazard analyses and by the pip"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 24375,
      "SummaryText": "ing vibration analysis program.\n· Upgrade and replace process safety valves and relief valves to improve process safety capability. \n· Upgrade to emergency response computer database to improve ability to calculate release quantities and to increase reference data to improve emergency response capability"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 24375,
      "SummaryText": "d Manual Shut Off Valve:  Both valves isolate propylene oxide flow from the plant propylene oxide distribution system.\nThis scenario assumes that the leak is detected and stopped over a 70-minute period.  This scenario assumes that the carbon bed vessel has been isolated from the propylene oxide header by valving. \n\nThis alternative release scenario does not allow credit to be taken for the following safety and prevention systems which are in place to prevent this scenario from occurring, and to mitigate its effects should it occur: \n· Inventory Restriction:  The storage tank is filled to a maximum of 90% of capacity.  This inventory restriction limits the amount and effect of release.\n· Redundant Tank Level Devices:  A system to monitor tank levels which includes two independent devices to measure and monitor tank levels.\n· Remote Actuation Valves:  Remotely operated isolation valves on tank and pipelines.\n· Fail-safe Valves:  All control valves are designed and installed to fail in the specific safe position, either fail-open or fail-closed.\n· Emergency Shutdown System: This computer-controlled system automatically shuts down or isolates a process under certain conditions and provides an audible alarm.\n· Deluge System:  A water spray system that knocks down propylene oxide vapor that is activated as needed.\n· Combustible Gas Detectors:  Detects vapor and provides audible alarms.   \n· Interlocks: Prevents improper process sequences and ensures all reactors operate within the established safe operating envelope defined by the Operational Safety Standards.\n· High Pressure Alarm and Shutdown:  Alerts operator that the system is experiencing high pressure which could be indicative of a reaction occurring in the piping network or back pressure into the system from a connecting process and shuts system down.\n\n\nB)  Regulated Flammable Substances\n\nBayer Corporation does not handle, process, or store threshold quantities of any RMP-regulated flammable chemicals at the Insti"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 24375,
      "SummaryText": "tute Plant.  \n\n\n\nIV. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nGeneral Program\n\nThe Bayer Corporation South Charleston and Institute West Virginia general accident prevention program consists of compliance with the EPA RMP rule and the OSHA PSM standard, and implementation of Bayer Corporation's Operational Excellence Standards (formerly Manufacturing Excellence Standards), Bayer Corporation's Operational Safety Standards Program, and  Dow's (formerly Union Carbide's) Episodic Risk Management System.\n\nThe key elements of these systems include the following:\n\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\nProcess Safety Information: Chemical hazard, process technology, and equipment information is  documented, maintained up-to-date, and available to operating personnel.\nCritical Operating Parameter (COPs):  Never exceed limits and normal operating windows on process variables such as temperature, flowrate, and pressure.\nProcess Hazard Analysis: A rigorous practice of reviewing new processes or changes to existing processes at the design stage to identify and mitigate potential safety, health, and environmental issues before the process is installed and operated.  Scheduled process hazard/risk reviews are conducted to revalidate initial process hazard reviews on a periodic basis.  Process hazard analyses are conducted every five years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\nEpisodic Risk Management System:  Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\nOperational Safety Standards: A company sponsored operational safety program"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 24375,
      "SummaryText": "that meets OSHA Process Safety requirements.  Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in the operational safety standards.\nOperating Procedures:  Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.  All operating procedures are based on process hazard/risk reviews.\nOperator Training/Certification Program:  The plant has a training and testing program which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\nComputerized Process Simulation:  Computerized process simulation programs are used for training and troubleshooting.  \nTechnical Staff Training and Support:  Trained technical staff employees are available 24 hours a day to support operations.\nMaintenance Procedures: The plant has specific procedures for maintaining process equipment so that it operates safely.  Plant and unit specific procedures for servicing operating equipment are in place, including preventative maintenance and reliability programs.\nMaintenance Training:  The plant trains and tests mechanics and craftsmen who perform routine or complex maintenance tasks on process equipment and inspections on operating equipment to ensure they have the required knowledge and skills.\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and inspected to ensure safe operation of process equipment, following recognized standards and/or government requirements.  This program includes testing, inspection and maintenance of critical equipment, including pressure relief devices, hoses, piping, instruments, and shutdown systems.\nMaterial Analysis: Analysis of key chemical raw materials to ensure they meet specifications prior to charging into the process reactor.   Bayer Corporation obtains a Certificate of Analysis from the supplier for all raw material  shipme"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 24375,
      "SummaryText": "BAYER COPORATION\nINSTITUTE PLANT\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n\n\nIntroduction:\n\nHISTORY\n\nBest known for its flagship product, Bayer Aspirin, Bayer Corporation is a research-based company which produces a broad range of health care, life sciences and chemical products that help diagnose and treat diseases, purify water, preserve local landmarks, protect crops, advance automobile safety and durability and improve people's lives.  Headquartered in Pittsburgh, Bayer\nCorporation had sales of $10.1 billion in 2000 and is one of Fortune magazine's Most\nAdmired Companies. The company employs 23,200 people. Bayer Corporation is investing $9 billion in capital expenditures and research and development from 2000 through the year 2004. 2000 capital investment and R&D expenditures were projected to total $1.6 billion. It is a member of the worldwide Bayer Group, a $29 billion international health care, polymers and chemicals group based in Leverkusen, Germany. The Bayer Group (BAYG.DE) stock is a component of the DAX, and is listed on multiple foreign exchanges.\n\nIn April 2000, Bayer Corporation acquired the global Polyols Business of Lyondell Chemical Company, including the facilities in South Charleston and Institute, WV.  Bayer Corporation did not purchase the assets at the Lyondell North Charleston Distribution Terminal.  In 1998, Lyondell Chemical Company acquired the assets of ARCO Chemical Company (ACC), including the facilities in South Charleston and Institute, West Virginia.  In 1989, ARCO Chemical Company purchased the Polyols Manufacturing facilities from Union Carbide Corporation, which included the facilities in South Charleston and Institute, West Virginia.  In December 1999, Aventis was launched through the merger of Hoechst AG and Rhône-Poulenc S.A.   In 2001, Dow purchased Union Carbide Corporation.  The Bayer Corporation South Charleston and Institute facilities are located within the existing Dow (formerly Union Carbide Corporation) South Charlesto"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24375,
      "SummaryText": "n plant, and within the Aventis (formerly Rhône-Poulenc) plant in Institute. Also included in this acquisition were urethanes research and development facilities located within the Dow (formerly Union Carbide) South Charleston Technical Center.\n\nIn South Charleston and Institute, West Virginia, Bayer Corporation Bayer Corporation directly employs about 110 people and provides employment for about 120 people under contract from Dow (formerly Union Carbide) and Aventis (formerly Rhône-Poulenc).\n\n\n\nPRODUCTS\n\nBayer Corporation produces Polyols products that form the basis for polyurethanes, coatings, adhesives, sealants, and elastomers of all kinds.  Products made from these materials fill the supermarket shelves and go into automobiles, housing, clothing and other necessities that improve the quality of life by making products safer, healthier and more convenient.\n\nThe products made at our South Charleston and Institute facilities belong to a family of chemicals called polyether polyols, and are derived from a chemical called propylene oxide, which is supplied by a Lyondell plant on the Gulf Coast.  Polyols are used primarily in polyurethane foams for products ranging from bedding and furniture, to automotive applications such as seat cushions and energy absorbing instrument panels and side panels.  Nearly two-thirds of all the auto seats in the U.S. today are made using the Bayer Corporation polyols products from the Kanawha Valley. Other polyols products we make here are used by our customers for applications as diverse as roof coatings, varnishes, roller blade wheels, and bowling balls.  All of the products are shipped to customers in other states or are exported to Europe, Asia, and South America.\n\nAnother product from our South Charleston and Institute West Virginia facilities is technology. The scientists and technicians at our South Charleston Technical Center work closely together with our manufacturing organization here to develop new or improved polyols produ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24375,
      "SummaryText": "cts and process technologies. These new technologies can then be used by other Bayer Corporation polyols manufacturing sites around the world.\n\n\nRESPONSIBLE CARE®\n\nBayer Corporation is fully committed to the principles of Responsible Care, which is an initiative of the American Chemistry Council (ACC to improve industry performance in the areas of environment, health and safety, to improve the industry's safe management of chemicals, and to respond to public concerns. The American Chemistry Council (ACC) was formerly called the Chemical Manufacturers Association (CMA).  Since 1990, emissions of hazardous chemicals to the air from the Bayer Corporation South Charleston and Institute West Virginia facilities have been reduced by over 90% through improving processes and eliminating inefficient operations.  We have also made continuous improvements in our safety performance every year and rank among the industry leaders in this important aspect.  It is a policy of Bayer Corporation to establish goals for continuous improvement in the areas of health, safety, and the environment based on sound science, risk assessment and benefit analysis, against which we will measure, audit and communicate our performance.\n\nAnother initiative for continuous improvement is called Operational Excellence. Operational Excellence was formerly called Manufacturing Excellence under Lyondell Chemical Company and ARCO Chemical Company. Operational Excellence, based on the Manufacturing Excellence Program launched in 1991 by ARCO Chemical Company, is a program of corporate standards and management systems which incorporates all of the Responsible Care®  Codes of Management Practices, best practices in the chemical industry, and Bayer Corporation's own rigorous management systems. Operational Excellence, incorporates a system of Operational Excellence Standards based on the Manufacturing Excellence Standards which ensure superior performance and continuous improvement in the following five key ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24375,
      "SummaryText": "eas: safety and health, environmental, product quality, manufacturing reliability, and efficiency. The Operational Excellence System consists of 43 performance standards in the key manufacturing functional areas (e.g. HES, Operations, Maintenance, Engineering, Supply Chain), and a system of Bayer Corporation Facility Audits and Third Party Audits to evaluate compliance with the performance standards. The Third Party Audit System evaluates the regulatory compliance, reliability, and liability associated with the following types of third parties:  Waste Sites, Terminals, Tollers, Key Suppliers, and Transporters.  A rigorous auditing process evaluates how well our facility is meeting the high standards of Operational Excellence.  Audit teams composed of experts, from various Bayer Corporation facilities and the corporate auditing department, examine performance, site conditions, and documentation to make sure the Operational Excellence Standards are met.\n\n\nI. Accidental Release Prevention and Emergency Response Policies\n\nThe Bayer Corporation Institute Plant is a tenant facility within the Aventis (formerly Rhône-Poulenc) Institute Plant.  Bayer Corporation has a contract with Aventis (formerly Rhône-Poulenc) to obtain emergency response services from the Aventis Institute Plant Emergency Response Team.  \n\nThe Bayer Corporation Institute Plant, is committed to operating and maintaining all of our processes in a safe and responsible manner.  We have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include Bayer Corporation's Operational Excellence requirements (formerly called Manufacturing Excellence), Institute Plant's Responsible Care® requirements, and governmental requirements, such as the Environmental Protection Agency's (EPA) Risk Management Program (RMP) rule (40 CFR Part 68) and the Occupa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24375,
      "SummaryText": "tional Safety and Health Administration's (OSHA) Process Safety Management (PSM) Standard (29 CFR Part 1910.119).  This document is intended to satisfy the RMP Plan requirements of the RMP rule and to provide the public with a description of the risk management program at the facility.\n\nII. STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Bayer Corporation Institute Plant is a manufacturing facility that produces a family of chemicals called polyether polyols.  The polyols we make are used by our customers to manufacture polyurethane foams for such applications as furniture cushions, mattresses and for automotive applications such as seat cushions and energy absorbing instrument panels and side panels. Other customer applications include various coatings, adhesives, sealants, and elastomers. \n\nThe RMP rule requires that if a facility, such as the Institute Plant, has a specific amount (threshold) or more of any one of 140 toxic and flammable chemicals, the facility must follow the RMP rule requirements.  \n\nThe Lyondell Institute Plant handles an RMP-regulated toxic substance in sufficient quantity to be covered by the RMP rule, is covered by the OSHA PSM standard, and falls under RMP Program Level 3. \n\nBayer Corporation handles and stores threshold quantities of the following RMP-regulated toxic substance at the Institute Plant:\n\t\n· Propylene Oxide\n\n\nBayer Corporation does not handle, process, or store threshold quantities of any RMP-regulated flammable chemicals at the Institute Plant.  \n\n\nIII. Offsite Consequence Analysis Scenarios\n\nThe Risk Management Program rule requires that covered stationary sources handling regulated substances conduct off-site consequence analyses (OCA) to evaluate the potential off-site impact of a worst-case scenario (WCS) and an alternative release scenario (ARS) for each regulated toxic chemical on site.  RMP also requires covered sources to evaluate one worst-case scenario and one alternative release scenario for a single chemical repr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 24375,
      "SummaryText": "esenting the class of flammables.  \n\nAll of these scenarios are developed using guidelines established in the RMP rule.  In developing worst-case scenarios, companies must presume the release of the entire quantity of the largest container of a regulated chemical over a 10-minute period.  Only passive mitigation systems, such as those that do not require energy or action by an employee to initiate can be considered.  U.S. EPA acknowledges that these worst-case scenarios are unlikely to occur, so the RMP rule also requires that companies develop alternative release scenarios based on more credible release assumptions. \n\nAlternative release scenarios differ from worst-case scenarios in several important ways.  They may be based on actual incident history or on events which are more likely to occur, and allow the use of both active and passive mitigation to reduce the potential impact of a release on the community outside the facility.\n\nEPA's Off-Site Consequence Analysis (OCA) Guidance Tables were used for evaluating the consequences of the WCS and ARS for both regulated flammable and toxic materials.  Use of these tables resulted in the determination of a release endpoint distance. The EPA-recommended LANDVIEW program was used to estimate the number of people potentially affected in each scenario.  The West Virginia Kanawha/Putnam County Emergency Services Maps and CD-ROM Program were utilized to identify the public and environmental receptors located within the scenario endpoint distance.\n\nAccording to the RMP rule, the release endpoint distance is intended to provide an estimate of the maximum possible area that might be affected for each scenario.  It is intended to ensure that potential risks to the public health are recognized.  For toxic releases, the endpoint is the distance beyond which chemical concentrations are low enough that an average individual could be exposed for up to one hour without suffering irreversible or debilitating health effects.   For flam"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 24375,
      "SummaryText": "mable releases, the endpoint distance is that distance beyond which the community would be subject to a pressure wave of less than 1 psi resulting from the formation of an exploding vapor cloud.  Below this value little or no impact to the community is expected.\n\nThe RMP rule requires that we provide information about the worst case and alternative case scenarios in our facility Risk Management Plans.  The following are brief summaries of these hypothetical scenarios.  Unless otherwise specified, no credit was taken for administrative controls or mitigation measures in the worst case scenarios. However, chemical-specific steps that would likely be taken to prevent or mitigate the effects of each scenario are listed immediately following the scenario description. The alternative release scenario descriptions include those mitigation measures that were considered, and any measures for which credit was not taken are listed.  More information on the facility's general accident prevention program is described in Section IV.\n\n\n\n\n\nA)  Regulated Toxic Substances\n\n1. Worst Case Scenario\n\n1.1  Worst Case Scenario - propylene oxide \n\nThe worst case scenario for propylene oxide assumes a catastrophic failure of a storage tank, releasing 31,520 pounds of propylene oxide as a liquid leading to a vapor cloud release.  According to EPA's Off-Site Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.\n\nNo passive mitigation measures were used in this analysis.\n\nThis worst case scenario does not allow credit to be taken for the following safety and prevention systems which are in place to prevent this scenario from occurring, and to mitigate its effects should it occur: \n· Inventory Restriction:  The storage tank is filled to a maximum of 90% of capacity.  This inventory restriction limits the amount and effect of release.\n· Redundant Tank Level Devices:  A system to monitor tank levels which includes two independent devices to measure and mon"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 24375,
      "SummaryText": "itor tank levels.\n· Remote Actuation Valves:  Remotely operated isolation valves on tank and pipelines.\n· Fail-safe Valves:  All control valves are designed and installed to fail in the specific safe position, either fail-open or fail-closed.\n· Emergency Shutdown System: This computer-controlled system automatically shuts down or isolates a process under certain conditions and provides an audible alarm.\n· Deluge System:  A water spray system that knocks down propylene oxide vapor that is activated as needed.\n· Combustible Gas Detectors:  Detects vapor and provides audible alarms.   \n· Interlocks: Prevents improper process sequences and ensures all reactors operate within the established safe operating envelope defined by the Operational Safety Standards.\n· Surveillance: Operating employees routinely monitor the process and make routine unit walk-throughs to make sure equipment and systems are operating properly.\n\n\n\n2. Alternative Release Scenario\n\n2.1 Alternative Release Scenario - propylene oxide\n\nThe alternative release scenario for propylene oxide assumes a gasket failure on the bottom outlet of the propylene oxide carbon filtration bed, releasing 4,900 pounds of propylene oxide, during a 70-minute period, as a liquid, leading to a vapor cloud release.  This scenario assumes a 25% gasket failure with a gasket hole size of 1/16th inch on a 3-inch outlet, and a loss of the entire liquid propylene oxide contents contained in the carbon bed vessel.  According to EPA's Off-Site Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.\n\nNo passive mitigation measures were used in this analysis.\n\nThe following active mitigation measures were used in this analysis:\n· Surveillance: Operating employees routinely monitor the process and make routine unit walk-throughs to make sure equipment and systems are operating properly.\n· Remote Actuated Valves on Header:  Isolates leak and minimizes the amount of material released.\n· Automatic an"
    }
  ]
}