{
  "FacilityID": 24557,
  "FacilityName": "Mohawk View Water Treatment Plant",
  "FacilityStr1": "100 Onderdonk Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Latham",
  "FacilityState": "NY",
  "FacilityZipCode": "12110",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36001",
  "LEPC": null,
  "FacilityLatDecDegs": "42.787222",
  "FacilityLongDecDegs": "73.782222",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": "www.colonie.org",
  "FacilityEmailAddress": "lwd@colonie.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Town of Colonie Division of Latham Water",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Colonie Div. Latham Water",
  "OperatorStr1": "347 Old Niskayuna Road",
  "OperatorStr2": null,
  "OperatorCity": "Latham",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12110",
  "OperatorZipCodeExt": "2290",
  "RMPContact": "Robert J. Maswick",
  "RMPTitle": "Chief WaterTreatment Plant Operator",
  "FTE": 16,
  "OtherEPAFacilityID": "NYD000330266",
  "EPAFacilityID": "100000177122",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-10-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-11-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-11-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-11-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.66083,
  "FRS_Long": -73.79771,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35128,
      "AltID": null,
      "FacilityID": 24557,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 35995,
          "ProcessID": 35128,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 45930,
          "ProcessID": 35128,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 545930,
          "ProcessID": 35128,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24557,
      "SummaryText": "The Mohawk View Water Treatment Plant (MVWTP), located at 100 Onderdonk Avenue in Latham, New York, processes potable water as part of the Latham Water District (Division of Latham Water).  The Latham Water District serves over 76,000 residential customers as well as numerous industrial and commercial uses.  Three different raw water sources (the Mohawk River, the Stony Creek Reservoir, and five wells located on Onderdonk Avenue) are pumped to the MVWTP where chemical and physical treatment occurs. The MWVTP is permitted to take 6 million gallons per day (MGD) from the Reservoir, up to 20 MGD from the Mohawk River, and 7 MGD from the wells.\n\nChemical treatment consists of oxidation, coagulation, chlorination and pH adjustment. Physical treatment consists of aeration, flocculation, settling and filtration. Finished water is pumped to the distribution system and is stored in eleven storage vessels located throughout the Town.  The chlorine used in the chlorine disinfection system is stored and used in one-ton (2,000 pound) containers. The MVWTP has the capacity to store up to ten one-ton containers (20,000 pounds) on-site (stored and/or in use). Four containers are in service in the Scale Room while the others are in storage in the adjacent container storage area. Thus, the maximum amount of chlorine on-site at the MVWTP exceeds the Accidental Release Prevention rules, codified in 40 Code of Federal Regulations Part 68, threshold quantity of 2,500 pounds.  In accordance with 29 CFR 1910.120, since the maximum amount of chlorine on-site exceeds 1,000 pounds, MVWTP is subject to the requirements of Process Safety Management (PSM).   It should be noted that, during the last five years, the facility has not experienced an accidental release of chlorine.  It should also be noted that no incidents of an accidental release of chlorine have occurred since the chlorine system was installed at the facility in 1967.\n\nIn accordance with USEPA's Risk Management Program Guidance fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24557,
      "SummaryText": "r Wastewater Treatment Plant Facilities, (USEPA WWTP Guidance) and the requirements of 40 CFR 68.25, the worst case release scenario was identified as the release of the contents of one chlorine container over a period of 10 minutes.  Although the chlorine is stored as a gas liquefied under pressure, it was assumed the contents of the cylinder are released as a gas.   Exhibit 4-3 of the USEPA WWTP Guidance provides the distances to the toxic endpoint of 0.0087 mg/l for chlorine, for various vessel sizes and worst case release rates.   According to this exhibit, the worst case release scenario at the MVWTP results in a distance of 1.3 miles to the toxic endpoint of 0.0087 mg/l.  Utilizing USEPA's Landview III Environmental Mapping Software, it is estimated that a residential population of 4,200 is within this area of concern.  Residential homes, a school and recreation areas were identified to be within the area of cocern (AOC) for the worst case release scenario.  Since the worst case release scenario results in offsite impacts and the facility is subject to PSM requirements, the facility is identified as a Program 3 facility and is subject to the applicable Program 3 Prevention Program requirements. \n\nBased on a review of the process hazard analysis for the chlorine system and the five-year accident history for the facility, MVWTP identified the alternative release scenario to be damage to the regulator inlet valve of a one-ton chlorine container.  This damage is likely to result from the rolling of the cylinder horizontally, which allows liquid chlorine to accumulate in the eduction tubes connected to the container valves.  Since the containers are not immediately connected and placed into service, a portion of the accumulated liquid chlorine will be allowed to vaporize.  Once the container is placed into service, the remaining accumulated liquid chlorine may be introduced into the chlorine disinfection system, thereby damaging the container regulator valve.  Equa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24557,
      "SummaryText": "tion 8 of the USEPA WWTP Guidance was used to estimate the release rate of 1,382 lb/min for this alternative release scenario.  Using equations provided in the USEPA WWTP Guidance Document, this release rate results in a distance of 0.6 miles to the toxic endpoint for chlorine.  Utilizing USEPA's Landview III,  it is estimated that a residential population of 780 is within this area of concern.  Residential homes, a school, and recreation areas were identified to be within the area of concern for the alternative release scenario.\n\nThe facility is currently subject to the PSM requirements for the chlorine stored and used at the facility.  In accordance with PSM requirements, MVWTP conducted a process hazard analysis (PHA) for the chlorine system, for the purpose of identifying potential hazards associated with the chlorine system.  As a result of this PHA, MVWTP implemented process changes that were identified to reduce the risk of an accidental release of chlorine.  MVWTP also employs the use of process controls, also for the purpose of reducing the risk of an accidental release of chlorine.  These process controls include: chlorine leak detectors, chorine residual monitors (automatic and manual determinations), loss of weight scales, pressure/vacuum gauges and storage of cylinders only horizontally.  \n\nMVWTP is committed to continuing to miminize the risk of accidental chlorine releases and conducts annual reviews of the chlorine system operating procedures and completes routine equipment inspections of the chlorine system process equipment 4-5 times per shift, as well as annual inspections of the process equipment by outside contractors.  In 1997, the MVWTP switched the chlorine feed system from a pressure feed to a vacuum feed.  This modification eliminated the possibility of piping carrying gas under pressure, thus reducing the risk of an accidental release of chlorine.\n\nThe MVWTP is included in the community emergency response plan and employees of MVWTP receiv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24557,
      "SummaryText": "e training in the facility's own emergency response procedures for an accidental release of chlorine.  Employees are trained in procedures to ensure the chlorine system is shutdown as appropriate to limit and isolate an accidental release of chlorine, activate ventilation and summon the appropriate emergency response agencies, and evacuate the affected facility areas in a safe and orderly manner."
    }
  ]
}