{
  "FacilityID": 24618,
  "FacilityName": "Central Products DBA Intertape Polymer Group",
  "FacilityStr1": "2000 South Beltline",
  "FacilityStr2": null,
  "FacilityCity": "Columbia",
  "FacilityState": "SC",
  "FacilityZipCode": "29201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45079",
  "LEPC": "Richland County LEPC",
  "FacilityLatDecDegs": "33.961167",
  "FacilityLongDecDegs": "-80.981556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "NW",
  "FacilityURL": null,
  "FacilityEmailAddress": "RCarnell@intertapeipg.com",
  "FacilityDUNS": 3344843,
  "ParentCompanyName": "Central Products DBA Intertape Polymer Group, Inc",
  "Company2Name": null,
  "CompanyDUNS": 242963726,
  "Company2DUNS": 242963726,
  "OperatorName": "Central Products DBA Intertape Poly",
  "OperatorStr1": "2000 South Beltline",
  "OperatorStr2": null,
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29201",
  "OperatorZipCodeExt": null,
  "FTE": 390,
  "OtherEPAFacilityID": "SCD003344843",
  "EPAFacilityID": "100000119301",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1900-0033",
  "SafetyInspectionDate": "2001-10-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-11-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-11-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-03-07 00:00:00",
  "DeRegistrationEffectiveDate": "2006-09-15 00:00:00",
  "AnniversaryDate": "2006-11-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.958666,
  "FRS_Long": -80.980912,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35217,
      "AltID": "Coated and Laminated Pape",
      "FacilityID": 24618,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46051,
          "ProcessID": 35217,
          "ChemicalID": 77,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36084,
          "ProcessID": 35217,
          "NAICSCode": "322222",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 13557,
              "Process_NAICS_ID": 36084,
              "SafetyReviewDate": "2001-11-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2001-10-01 00:00:00",
              "ChangeCompletionDate": "2001-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Increased capacity of diked area",
              "OpProceduresReviewDate": "2001-11-01 00:00:00",
              "TrainingReviewDate": "2001-06-27 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-10-01 00:00:00",
              "EquipmentInspectionDate": "2001-10-01 00:00:00",
              "EquipmentTested": "Electrical equipment for TDI pump and TDI Mixer Controls",
              "ComplianceAuditDate": "2001-07-01 00:00:00",
              "AuditCompletionDate": "2001-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2001-07-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 14210,
                  "PreventionProgram2ID": 13557,
                  "ProcessChemicalID": 46051
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24618,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-11-01 00:00:00",
    "ERTrainingDate": "2001-02-01 00:00:00",
    "CoordinatingAgencyName": "Richland County LEPC",
    "CoordinatingAgencyPhone": "8032543063",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24618,
      "SummaryText": "Intertape Polymer Group, Incorporated\nRisk Management Plan\nSection 112(r) of the Clean Air Act\n\nExecutive Summary\nIntroduction\nIntertape Polymer Group (IPG), Incorporated located in Richland County, Columbia, South Carolina handles Toluene diisocyante mixed isomers (TDI) during its manufacturing of pressure sensitive adhesive tapes.  IPG must comply with the Chemical Accident Prevention Rule issued by the Environmental Protection Agency (EPA) under the Clean Air Act.  It is IPG's policy to adhere to all applicable State and Federal regulations regarding the handling of TDI.  TDI is the only chemical on-site that is handled by IPG that is regulated by the EPA's Risk Management Plan (RMP).\nIPG is committed to the safety of its employees and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Successful implementation of our risk management system will help ensure that emergencies are unlikely and reduce the likelihood that emergency response procedures will be needed.\n\nDescription of the Facility and Processes using TDI\nThe primary purpose of this facility is to manufacture adhesive tape which is then sold for distribution.  TDI is one of the reactants needed to produce the substrate used in the construction of specialty adhesive tape products.  TDI is received into the plant via 55 gallon drums weighing approximately 450 pounds each.  IPG stores approximately 8,000-30,000 pounds of TDI at any given time.  During the mixing process, approximately 217 gallons of TDI or 2204 pounds, are mixed in a large vessel with other reactants and heated to 225 degrees Fahrenheit to produce a component used in the construction of certain products.   TDI is covered under the RMP rule because of the maximum stored onsite will occasionally exceed the threshold quantity of 10,000 pounds.\n\nOffsite Consequence Analysis of Worst Case and Alternative Release Scenario\nAn offsite consequence analysis (OCA) was perform"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24618,
      "SummaryText": "ed to estimate the potential for an accidental release to affect the public or the environment.  The OCA consists of evaluating the worst case release scenarios (WRSs) and alternative release scenarios (ARSs).  IPG does not expect the WRS to ever occur.  An ARS represents a release that might occur during the lifetime of a facility like IPG.  ARSs help IPG to work with the local emergency planning committee (LEPC) to improve the community emergency response plan.  The main objective of performing the OCA is to determine the distance at which certain effects might occur to the public because of a WRS or an ARS (called the endpoint distance.)  \n\n\tWorst case Release Scenario:\n\tThe WRS is defined as a catastrophic failure of the AC mixture tank containing all 217 gallons (2204 pounds) of TDI before TDI has had time to react with the other reactants.  The AC Mixer has the potential to store the greatest quantity of TDI whose failure produces the greatest distance to endpoint.  During hot weather the TDI could reach elevated ambient temperatures.  Because a release at a higher temperature would result in the greatest endpoint, the highest temperature recorded in Columbia within the last three years of 109 degrees Fahrenheit was used for modeling purposes.  It was also assumed that the entire contents of the vessel were released as a liquid into a dike measuring approximately 150 cubic feet.  The EPA approved RMP Comp model predicts a distance of 0.4 miles from the release area to the TDI toxic endpoint concentration of 0.98 ppm (0.007 mg/L).  The model calculated release rate of 0.0176 pounds/minute and release duration of 125,000 minutes, however the RMP Submit does not allow in Section 2.6 and 2.7 an input value of a number less than 0.1 or greater than 9999.9, respectively.  Therefore the minimum at maximum values for these sections were input into these sections.  Due to the close proximity of a neighboring facility and the distance to endpoint, a TDI WCS could potent"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24618,
      "SummaryText": "ially affect employees at the adjacent plant.  No environmental receptors would be affected.\n\t\nAlternative Release Scenario\nIPG has modeled an ARS of a rupture of two 55 gallon drums with an approximate weight of 900 pounds due to puncture from a forklift.  It was assumed that the release was immediate and that all of the contents spilled unto the concrete floor.  The resulting pool would cover an area of approximately 200 square feet. The average temperature for the Columbia area according to the weather Bureau is 75 degrees Fahrenheit.  EPA approved Model; Aloha 5.2.3 predicts a distance of less than 10 meters from the pool to the TDI toxic endpoint concentration of 0.98 ppm or 0.007 mg/L.  The model calculated release rate of 0.00922 pounds/minute and release duration of 60 minutes, however the RMP Submit does not allow in Section 2.6 an input value of a number less than 0.1, and therefore the minimum value of 0.1for was used.  \n\nRelease Prevention Program\nIPG has implemented programs and procedures that comply with EPA's Level 2 Accidental Release Prevention Program Rule.  The IPG facility qualifies for Level 2 coverage because (1) the WRS for TDI could impact persons across the property boundary of the nearest public receptor, and (2) TDI is not a substance covered by OSHA's process safety management standard (PSM).  IPG's accidental release prevention program was designed and developed to systematically achieve the following:\n1.\tCreate and maintain document control of safety information related to regulated substances, processes and equipment.\n2.\tPerform hazard reviews to identify, evaluate, and control process hazards associated with the regulated substances, processes and equipment procedures\n3.\tDevelop, implement and maintain operating procedures for activities within or near processes that use regulated substances\n4.\tDevelop, implement and maintain training for personnel who handle regulated substances or operate covered processes and equipment associated"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24618,
      "SummaryText": "with regulated substances so that they safely perform their duties\n5.\tMonitor and control preventive maintenance and maintenance activities that can affect the mechanical integrity of equipment used in covered process\n6.\tMonitor through compliance audits that RMP procedures and practices at the plant are in conformance with the plants Risk Management Plan and to identify any corrective actions that maybe needed to ensure continues improvement\n7.\tImplement and continuously improve procedures to ensure that process incidents, particularly those with the potential to be catastrophic, are thoroughly investigated and that relevant findings are communicated company wide in order to prevent reoccurrence\n\nHazard Review of Processes\nThe TDI process at IPG has hazards that are carefully managed to ensure continued safe operation.  The prevention program outlined above is applied to the TDI processes.  Collectively these prevention plan activities help prevent potential accidental releases that could be caused by equipment failures, human errors and by management system failures.  In addition to the accidental release prevention program, IPG has safety features on its units to help contain or control a release, quickly detect a release and to reduce the consequence of a release.  The following are some of the safety features:\n1.\tDike around the process to contain all TDI that could potentially be released\n2.\tManual shutdown systems\n3.\tTDI processes are in enclosed buildings\n4.\tEquipment preventive maintenance schedule\n5.\tFire suppression and extinguishing systems\n6.\tTrained emergency response contractor\n7.\tPersonal protective equipment\n\nFive Year Accident History\nThe IPG facility has had no releases of TDI in the last 5 years.\n\nEmergency Response Program\nTo insure the safety of its employees and the environment it is IPG's policy that all reasonable steps be taken using its Emergency Response Plan.  IPG's emergency response program is based on the requirements in OSHA's emerge"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24618,
      "SummaryText": "ncy action and fire prevention plan regulation, OSHA's Hazardous Waste Operations and Emergency Response, the National Fire Protection Association Standard for Professional Competence of Responders to Hazardous Materials Incidents and EPA's emergency response program requirements in its RMP rule.  Our program consists of procedures for responding to a release of TDI.  The procedures at IPG require that any release of TDI be responded to by a trained authorized contractor.  Although IPG does have qualified, HAZWOPER trained personnel who are capable of responding, IPG will support an emergency response contractor in responding to a TDI release incident.  All employees trained to handle TDI have received hazardous material training.  The procedures also address all aspects of emergency response including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and company wide communications.  \nThe overall emergency response program at IPG is coordinated with the LEPC.  This coordination includes participation in periodic meetings and periodic emergency drills involving the LEPC, local fire department and Haz-Mat teams, and emergency response contractor.  IPG has round the clock communications capability with appropriate LEPC officials and emergency response organizations such as the fire department and contractors.\nCorrective and Preventive Action Requests\nIt is IPG's Environmental Health and Safety Policy to continuously improve the safety of its facility by systematically performing safety hazard reviews and following established incident investigation programs designed to identify corrective and preventive actions needed to minimize risk."
    }
  ]
}