{
  "FacilityID": 24631,
  "FacilityName": "Texas LNG, Ltd",
  "FacilityStr1": "12114 Longstrret Road",
  "FacilityStr2": null,
  "FacilityCity": "Willis",
  "FacilityState": "TX",
  "FacilityZipCode": "77378",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48339",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "30.445278",
  "FacilityLongDecDegs": "-95.522222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.altlngusa.com",
  "FacilityEmailAddress": "sbartlett@altlngusa.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Golden Spread Energy",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Texas LNG, Ltd",
  "OperatorStr1": "12114 Longstrret Road",
  "OperatorStr2": null,
  "OperatorCity": "Willis",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77378",
  "OperatorZipCodeExt": null,
  "RMPContact": "Derek Anderson",
  "RMPTitle": "Plant Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177248",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "None Currently recommissioning",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-11-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-11-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-11-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-11-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.44528,
  "FRS_Long": -95.52222,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35235,
      "AltID": "Natural Gas Liquefaction",
      "FacilityID": 24631,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 36102,
          "ProcessID": 35235,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 46069,
          "ProcessID": 35235,
          "ChemicalID": 93,
          "Quantity": 3120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 46070,
          "ProcessID": 35235,
          "ChemicalID": 155,
          "Quantity": 10238.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 33995,
              "ProcessChemicalID": 46070,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 33996,
              "ProcessChemicalID": 46070,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 33997,
              "ProcessChemicalID": 46070,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 33998,
              "ProcessChemicalID": 46070,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 33999,
              "ProcessChemicalID": 46070,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 546069,
          "ProcessID": 35235,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 546070,
          "ProcessID": 35235,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24631,
      "SummaryText": "The Accidental Release Prevention and Emergency Response Policies at the Facility:\n\nThe facility complies with NFPA requirements for LNG facility.  It is the facility's policy to adhere to all applicable federal, state, and local laws and regulations.  The facility's system is designed, installed, maintained, and operated to utilize current technology, safety, and control devices to ensure effective and safe operation, emergency shutdown, and fire prevention and fire fighting, etc.  The facility has developed its own emergency action plan, and has trained the personnel.  It is also the parent company's policy to strongly commit to safe operation to ensure the safety of the employees, public, and the environment.\n\n\nThe Facility and the Regulated Substances Handled:\n\nTexas LNG, Ltd. is a natural gas liquefaction plant located at 12114 Longstreet Road, Willis, Texas 77378.  Under different owners and different names, the facility operation started in October 1994 and ended in October 1998.  The current owner ALT decided to re-commission the plant.  The operation will start in November 2001.\n\nThe facility uses pipeline natural gas as feedstock and liquefies it by refrigeration.  The product is Liquefied Natural Gas (LNG), or called liquefied methane, which is stored in the LNG storage tank in the northeast of the facility.  The product contains at least 97% of methane (CH4).\n\nAs ruled in EPA's Risk Management Program (40CFR68), the facility does not have any regulated toxic substance.  There are two flammable substances on site exceeding the thresholds quantity.  They are:  methane (maximum of total quantity 3,120,000 lbs exceeding the threshold quantity of 10,000 lbs), and the mixed refrigerant containing more than 1% each of methane, ethane, propane, butane and pentane (maximum of total quantity of the mixture 10,238 lbs exceeding 10,000 lbs which is the threshold quantity of each substance and therefore that of the mixture).  Therefore the facility is covered by EPA'"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24631,
      "SummaryText": "s RMP requirement.\n\nThe facility also has one substance on site that is an Extremely Hazardous Substance (EHS) as listed in EPA's 40CFR355.  The substance is 93% sulfuric acid, and the maximum total quantity is 15,200 lbs exceeding 500 lbs.  This is the reason that the facility is covered by EPCRA 302.\n\n\nThe Worst-Case Release Scenario and the Alternative Release Scenario:\n\nBy using EPA's 40CFR68 and OCA Guidance, it is determined that the worst-case release scenario is failure of the storage tank (the largest vessels at the facility, net capacity of 880,000 gallons) when it has the maximum inventory, i.e. 840,000 gallons or 3,120,000 lbs of LNG), resulting in an assumed vapor cloud explosion involving the quantity of 53,790 lbs which evaporates in 10 minutes from the liquid pool in the spill containment dike which limits the exposed surface area of the pool to 26,245 square feet and thus reduces the evaporate/release rate to 5,379 lbs./minute.  The resulting distance to the endpoint of 1 psi overpressure (TNT equivalency method) is 0.31 miles and extends offsite.  The facility is located in a rural area and surrounded by ranch land. Within the circle with a radius of 0.31 miles there is one residence with four people, but no other public receptors.  There is not any environmental receptor within this circle.  It should be noted that no explosion of unconfined methane vapor cloud has ever happened, nor is it considered a credible accident.\n\nBased on LNG industry experience and by using EPA's 40CFR68 and OCA Guidance, it is determined that the alternative release scenario is a sudden loading hose uncoupling and LNG spilling from the trailer tank, resulting in a liquid pool in the spill containment sump with the capacity of 53,844 gallons, more than containing the total quantity from a LNG trailer tank (about 11,000 gallons).  The liquid evaporates to form a vapor cloud which ignites to form a vapor cloud fire burning back to the pool to a reduced size of pool fire.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24631,
      "SummaryText": "The liquid in the pool is enough to cover the bottom of the sump and the initial depth of the pool is 0.5 foot, more than 1 cm.  Emergency shutdown system is expected to turn off the loading line on the LNG storage tank side therefore limit the quantity of leakage from the storage tank.  A smaller leakage will lead to a smaller vapor cloud which disperses faster to below Lower Flammable Limit (LFL).  The evaporating/release rate is calculated by using the liquid pool surface area of 14.5 X 14.5 square feet and wind speed of 3.0 meter/second. The result is 74 lbs./minute.  By using the tables in OCA Guidance the distance to the endpoint of LFL is estimated as 0.06 miles. There is not any public or environmental receptor within the circle centered at the sump and with the radius of this distance.\n\n\nThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\nThe facility complies with the Risk Management Program level 3 regulated in 40CFR68 by EPA as well as OSHA's Process Safety Management (PSM).  It also complies with all the applicable state and local codes and regulations. It is designed, installed, and maintained in accordance with NFPA and state law. The facility has and adheres to its detailed operating procedures including safety checks during operation and other written procedures on safety, employee training, maintenance, etc.  The facility emphasizes on release and fire prevention.\n\n\nThe Five-Year Accident History:\n\nThere has not been any accident occurred at the facility in the past five years, either during its operation or after it was shut down, that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.\n\n\nThe Emergency Response Program:\n\nThe facility has emergency response procedures although it does not have an emergency response program as defined by EPA's Risk Management Program because employee responding action to major release is not required.  All the emergency response proce"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24631,
      "SummaryText": "dures were reviewed/updated in November 2001.  The personnel have been trained to follow the procedures when an emergency situation occurs.  The most recent emergency response training for the facility's employees was done in November 2001.  It is the facility's policy to immediately call the Montgomery County Fire Department in case of flammable gas release or fire.  The Fire Department is familiar with the process and is experienced in fighting hydrocarbon-fuel fires.  The local Fire Department and/or EMS will be contacted as needed.\n\n\nPlanned Changes to Improve Safety:\n\nDuring the recent re-commissioning, the facility's compliances with all the applicable laws, codes, rules and regulations have been                                                                                                                                                                                                                             "
    }
  ]
}