{
  "FacilityID": 24696,
  "FacilityName": "Nestle Confections & Snacks",
  "FacilityStr1": "3401 Mount Prospect Road",
  "FacilityStr2": null,
  "FacilityCity": "Franklin Park",
  "FacilityState": "IL",
  "FacilityZipCode": "60131",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.938333",
  "FacilityLongDecDegs": "-87.92",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "NW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nestle USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nestle USA, Inc.",
  "OperatorStr1": "800 North Brand Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Glendale",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91203",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Tim Farmer",
  "RMPTitle": "Safety & Security Manager",
  "FTE": 800,
  "OtherEPAFacilityID": "60131PLNTR3401M",
  "EPAFacilityID": "100000177337",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "031096AAB",
  "SafetyInspectionDate": "2001-10-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Franklin Park Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-12-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-12-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-12-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2006-12-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.9388,
  "FRS_Long": -87.90914,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP+2 CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35337,
      "AltID": "Ammonia System",
      "FacilityID": 24696,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 36205,
          "ProcessID": 35337,
          "NAICSCode": "31133",
          "_desc": {
            "NAICS_CODE": "31133",
            "NAICS_DESCRIPTION": "Confectionery Manufacturing from Purchased Chocolate"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 46202,
          "ProcessID": 35337,
          "ChemicalID": 56,
          "Quantity": 12641.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 546202,
          "ProcessID": 35337,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24696,
      "SummaryText": "A. Describe the Accident Release Prevention and Emergency Policies\n\nNestle's most important asset is its people.  Our employees are the source of our competitive advantage and the key to a successful and productive organization.  We recognize the importance of a safe work environment and make every reasonable effort to provide employees with a safe and healthy workplace.  We also expect each employee to work safely.\n\nThe Nestle USA Safety Manual has been developed by a cross-company team of employees to provide a guide to safe behavior.   By committing to these guidelines we all contribute to our vision to be the premier diversified food company in the U.S.\n\nAmmonia safety is a key item in the plant safety program.  Nestle takes many precautions to prevent or minimize accidental releases of ammonia.  These precautions include safety controls (alarms and automatic shutdown devices) which are designed to identify and prevent potentially unsafe conditions like pressure increases that could cause a system failure, a preventive maintenance program designed to maintain the on-going integrity of the system, a training program designed to ensure that the system is operated by qualified personnel, and emergency response procedures which enable trained personnel to respond quickly to system upsets.\n\nThe Safety & Security Manager is responsible for the management of the ammonia safety program.\n\n\nB.   Stationary Source and Regulated Substances Handled\n\nNestle's Franklin Park Plant produces chocolate confections for sale to the public.  The facility operates an ammonia refrigeration system to cool these confections.  Due to changes in the refrigeration system, the maximum ammonia inventory at the plant is expected to increase to 12,641 pounds.  Ammonia is the only regulated substance handled at the Franklin Park Plant.\n\n\nC.   Summary of Worst-Case and Alternative Release Scenarios\n\nThe worst-case toxic release scenario at the Franklin Park Plant involves the release of 12,641 po"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24696,
      "SummaryText": "unds of ammonia to the atmosphere over a 31-minute period due to the failure of a high-pressure ammonia receiver. The release rate  assumes that the enclosed engine room would limit the amount of ammonia released to the atmosphere. Under worst-case release conditions, the resulting vapor cloud could have off-site impacts.\n\nThe alternative toxic release scenario at the Franklin Park Plant involves the release of 2,773 pounds of ammonia to the atmosphere over a 31-minute period due to a cracked sight glass on a high-pressure ammonia receiver. The release rate  assumes that the enclosed engine room would limit the amount of ammonia released to the atmosphere. Under alternative release conditions, the resulting vapor cloud could have off-site impacts.\n\nThe worst-case and alternative toxic release scenarios are unlikely for the following reasons:\n\n- The weather conditions that were used for the worst-case release scenario do not occur, while those used for the alternative case are uncommon;\n- Industry standards are followed for the design and manufacture of the equipment in the ammonia refrigeration system;\n- The high pressure ammonia receiver is located in an enclosed engine room, well protected from vehicular traffic;\n- Pressure safety valves on the high pressure receiver should limit any pressure increases inside the receiver;\n- Ammonia detectors should readily detect releases from the high pressure receiver;\n- Ammonia is not corrosive in this service; \n -The facility has a Preventive Maintenance Program in place to maintain the on-going integrity of the ammonia refrigeration equipment;\n- The facility has a Training Program designed to ensure that the systems are operated by qualified personnel; and, \n- The facility's Emergency Response Procedures enable trained personnel to respond quickly to isolate any potential releases.\n\n\nD.   Description of the Accidental Release Prevention Program\n\nThe facility has a program level 3 accident release prevention program for the a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24696,
      "SummaryText": "mmonia system that complies with OSHA's Process Safety Management Standard and EPA's Risk Management Program Regulation.  The ammonia prevention program consists of the following elements:\n\n- Employee Participation Program\n- Process Safety Information\n- Process Hazard Analysis\n- Operating Procedures\n- Training Program\n- Contractor Safety Program\n- Pre-Startup Safety Review Procedures\n- Mechanical Integrity Program\n- Hot Work Permit Procedures\n- Management of Change Procedures\n- Incident Investigation Procedures\n- Compliance Audit Procedures\n\n\nE.   Five-Year Accident History\n\nThere have not been any ammonia-related incidents at the Franklin Park Plant during the previous five years that resulted in significant on-site or offsite consequences.\n\n\nF.   Description of the Emergency Response Program\n\nAn emergency response program has been implemented at the Franklin Park Plant.  This program contains procedures describing how the facility will respond to fires, ammonia leaks and other emergencies, including evacuation procedures.  \n\nThe emergency response program includes the following elements:\n\n- Notification Procedures\n- Evacuation Plan\n- Emergency Shutdown Procedures\n- Specific Action Plans for Emergencies (Including Ammonia Leak Procedures)\n- Emergency Medical Procedures\n\nThe program has been coordinated with the Franklin Park Fire Department.\n\n\nG.   Planned Changes to Improve Safety\n\nA process hazard analysis was conducted to analyze the ammonia refrigeration system in 2001.  Recommendations identified during this analysis will be addressed and implemented as appropriate."
    }
  ]
}