{
  "FacilityID": 24717,
  "FacilityName": "Wright Brand Foods, Ltd.",
  "FacilityStr1": "700 Wheeler St",
  "FacilityStr2": null,
  "FacilityCity": "Vernon",
  "FacilityState": "TX",
  "FacilityZipCode": "76384",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48487",
  "LEPC": "Wilbarger County LEPC",
  "FacilityLatDecDegs": "34.161722",
  "FacilityLongDecDegs": "-99.289972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "SE",
  "FacilityURL": "wrightbrand.com",
  "FacilityEmailAddress": "skinney@wrightbrand.com",
  "FacilityDUNS": 8027609,
  "ParentCompanyName": "Wright Brand Foods, Ltd.",
  "Company2Name": "Tyson Foods, Inc.",
  "CompanyDUNS": 8027609,
  "Company2DUNS": 6903702,
  "OperatorName": "Wright Brand Foods, Ltd.",
  "OperatorStr1": "PO Box 1779",
  "OperatorStr2": null,
  "OperatorCity": "Vernon",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76385",
  "OperatorZipCodeExt": "1779",
  "RMPContact": "Daniel R. Doose",
  "RMPTitle": "Safety/Environmental Supervisor",
  "FTE": 700,
  "OtherEPAFacilityID": "TXD981595713",
  "EPAFacilityID": "100000155342",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2001-12-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2001-12-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2001-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.1619,
  "FRS_Long": -99.29244,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35371,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 24717,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 36244,
          "ProcessID": 35371,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 46245,
          "ProcessID": 35371,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 546245,
          "ProcessID": 35371,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24717,
      "SummaryText": "Wright Brand Foods, Inc.\nRMP for Ammonia\nExecutive Summary\n\n\n\na.  Accidental Release Prevention and Emergency Response Policies\nWright Brand Foods, Inc. (called \"Wright\") is covered by OSHA's Process Safety Management for the same regulated substance - ammonia - that pertains to this Risk Management Plan.  Wright's PSM includes the following components:\n? Process Safety Information\n? Process Hazard Analysis\n? Operating Procedures\n? Training\n? Mechanical Integrity\n? Management of Change\n? Pre-Startup Review\n? Compliance Audits\n? Incident Investigation\n? Employee Participation\n? Hot Work Permit\n? Contractors\nWright's PSM program undergoes a compliance audit every three years (the last was 1-31-97), and an annual audit and review of the Standard Operating Procedures, and has been updated several times since original implementation.  Wright's PSM program serves as the basis for Wright's accidental release prevention and emergency response policies under this RMP.   \nSee below, sections d and f,  for some specific information on Wright's Accidental Release Prevention Program and Wright's Emergency Response Program.\n\nb.  Description of Source and Regulated Substance\nWright is a meat processor that uses ammonia refrigeration for its plant, which is approximately 180,000 sq.ft. in size.  The sole purpose of the ammonia refrigeration system is process cooling.  It is a two-stage microprocessor-controlled system, with a    -30 deg. booster stage that operates the blast freezer, a +5 deg. high stage that is used for product chilling, and a +20 deg. stage that is used for production room temperature control.\nThe system is a typical ammonia refrigeration system designed and built by competent and reliable ammonia refrigeration contractors, and all applicable codes and standards were followed in its design and construction.  \nThe major equipment used in the ammonia refrigeration process are.\n4 - screw compressors (1 booster and 3 high stage)\n6 - reciprocating compressors (used on"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24717,
      "SummaryText": "ly for backup)\n47 - air units for process cooling\n1 - make-up air unit \n4 - plate and frame heat exchangers, used for secondary cooling of brine and glycol\n4 - evaporative condensers \n18 - ammonia vessels and interconnecting pipe\n2 - ammonia pumps\n21 - ammonia detectors, one in every room of the facility that utilizes ammonia refrigeration\nThe refrigeration system holds 26,000 lbs. of ammonia in total.  The main ammonia tank is located outside.\nAmmonia is a gas but is liquefied by pressure.  It is colorless but has a pungent, penetrating odor.  Ammonia may explode if its fumes (in sufficient concentration) contact an ignition source.  Ammonia is also highly reactive in contact with non-ferrous metals or strong acids and oxidizers.  On contact with skin or by inhalation, ammonia can be very dangerous, causing severe problems to eyes, the respiratory tract, and skin.  Some symptoms include irritable burning, tearing of eyes, runny nose, coughing, chest pain, and severe difficulty in breathing.  Death may result.  Exposure of eye to high concentrations may produce blindness, cataracts, and glaucoma.  Exposure of skin can cause burning and blisters.\nNote:  More information is available on the MSDS for ammonia.\n\nc.  Description of Scenarios\n(1)  Worst-Case Scenario:\nThe worst-case scenario envisions a puncture to the main ammonia tank in which 10,000 lbs. is released over 10 minutes.  Assuming atmospheric conditions with a wind speed of 1.5 meters per second, wind from the North, and a stability class of F in an urban setting, the end-point is a distance of .6 mile from Wright's ammonia tank (according to the calculations of the EPA's RMP*Compute software).  After drawing a semicircle that extended .6 miles from the source on a map of the City of Vernon, Wright personnel checked with the City of Vernon' Office of the City Manager for demographic data.  The Office of the City Manager has undertaken a block-by-block demographic study of the City of Vernon based on the late"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24717,
      "SummaryText": "st official census of 1990 for the purpose of redistricting the City Commission.  Using this study, Wright personnel determined that approximately 990 people reside in the area that would be affected under this worst-case scenario.  One school - Shive Elementary - as well as several businesses and US Highway 287 also fall within this area.\n\n(2)  Alternate Release Scenario:\nA much more likely scenario concerning Wright's ammonia system is a leak on a pump seal.  The EPA's Model Risk Management Plan for Ammonia states for a seal leak, assume a 1/4\" opening.  A 1/4\" opening at 33 psi = 61 lbs. per minute.  Assuming the leak occurred for 10 minutes we calculated for this scenario a total of 610 lbs. of ammonia with a wind speed of 3 meters per second and a stability class of F in an urban setting with wind from the North.  Distance to the endpoint in this case is .1 mile (according to the EPA's RMP*Compute software), and the estimated residential population in this area is 28, as per the City of Vernon study cited above.  No major public receptors are within the affected area.\n\nd.  Accidental Release Prevention Program and Ammonia-Specific Prevention Steps\nUnder Wright's PSM program, as described in section a, above, re-analysis of the ammonia system's hazards occur regularly, and Wright maintains a thorough employee training program for PSM that includes, among other things, classroom instruction and written examinations, and at least annual training for refrigeration personnel.  Wright also has a complete Contractor Program for PSM that includes training.  Besides training, Wright's accidental release program largely consists of preventative maintenance (\"PM\") which has a dedicated schedule set up in an advanced maintenance management computer system that automatically notifies Maintenance Dept. personnel when specific PM is due.  Wright's PM functions for the ammonia system include mechanical integrity audits of equipment and vessels, vibration analysis, and equipmen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24717,
      "SummaryText": "t rebuilds, among other things.\nWright also maintains the following process controls on its ammonia system:\n? relief valves\n? check valves\n? manual shutoffs\n? automatic shutoffs\n? interlocks\n? alarms\n? keyed bypass\n? backup pump\n? grounding equipment\n? purge system.\nWright also maintains ammonia detectors and warning devices throughout its plant.\n \ne.  Five-Year Accident History\nThere have been no accidents involving ammonia at Wright's facilities within the last five years.\n\nf.  Emergency Response Program\nWright has an emergency response team of approximately 25-30 members trained at either the Incident Commander level or Technician level.  Their training consists of a minimum of 24 hours of initial training as well as a minimum of 8 hours of annual refresher training.  The emergency response team also maintains an inventory of emergency equipment including, among other things, protective clothing and self-contained breathing apparatus.  Wright's emergency response plan is re-evaluated at least at every annual retraining.  Wright's emergency response plan includes information on contacts such as the EPA, TNRCC, and LEPC (Fire Chief).  All Wright employees receive instructions on plant evacuation procedures when hired and practice plant evacuation approximately every 6 months.  All employees receive training on the hazards associated with ammonia during orientation and are informed of Wright's PSM program for ammonia.\nWright met with the LEPC on May 6, 1999 to publicize its RMP as set out in this submission.  In attendance were 6 Wright employees and 12 non-Wright employees, including the head of the LEPC (the Fire Chief of the City of Vernon), and other officials from the City, the County, the School District, law enforcement, the news media, and other industry.  As a result of the meeting, Wright's Emergency Response Plan has been improved by setting out specific lines of communication between Wright, the LEPC, and local agencies in case of an emergency.\n\ng.  Plan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24717,
      "SummaryText": "ned Changes to Improve Safety\n(1)  Wright will work with the LEPC to prepare public evacuation plans.\n(2)  Wright will increase condenser size which will reduce head pressure and reduce equipment wear. \n(3)  Wright will improve the monitoring of its equipment by using a vibration analyzer on a more frequent basis.\n(4)  Wright will try to replace worn-out equipment with improved models."
    }
  ]
}