{
  "FacilityID": 24730,
  "FacilityName": "PSNH Merrimack Generating Station",
  "FacilityStr1": "97 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Bow",
  "FacilityState": "NH",
  "FacilityZipCode": "03304",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33013",
  "LEPC": "Bow Fire Department",
  "FacilityLatDecDegs": "43.140556",
  "FacilityLongDecDegs": "-71.468056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.nu.com",
  "FacilityEmailAddress": "NUCommunications@nu.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Northeast Utilities",
  "Company2Name": null,
  "CompanyDUNS": 6953418,
  "Company2DUNS": null,
  "OperatorName": "Public Service of New Hampshire",
  "OperatorStr1": "Commercial Street",
  "OperatorStr2": "P.O. Box 330",
  "OperatorCity": "Manchester",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03105",
  "OperatorZipCodeExt": null,
  "FTE": 96,
  "OtherEPAFacilityID": "03304PBLCS97RIV",
  "EPAFacilityID": "100000079309",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-05-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2001-12-18 00:00:00",
  "ErrorReportDate": "2001-12-18 00:00:00",
  "ReceiptDate": "2001-12-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2001-12-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 43.140833,
  "FRS_Long": -71.467778,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35385,
      "AltID": "MK2 SCR DeNOx",
      "FacilityID": 24730,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46259,
          "ProcessID": 35385,
          "ChemicalID": 56,
          "Quantity": 490000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36258,
          "ProcessID": 35385,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 19991,
              "Process_NAICS_ID": 36258,
              "SafetyReviewDate": "2001-05-02 00:00:00",
              "PHA_Date": "2002-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "water hydrants and fog nozzles are available",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "operator rounds each shift",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Added rail car storage as process #3",
              "OpProceduresReviewDate": "2001-02-06 00:00:00",
              "TrainingReviewDate": "2001-12-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-08-31 00:00:00",
              "EquipmentInspectionDate": "2001-04-25 00:00:00",
              "EquipmentTested": "MK1SCR ammonia vaporizer skid",
              "ChangeMgmtDate": "2001-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2001-05-01 00:00:00",
              "PreStartupReviewDate": "2001-04-25 00:00:00",
              "ComplianceAuditDate": "2001-09-20 00:00:00",
              "AuditCompletionDate": "2001-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-11-13 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-13 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2001-03-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 29031,
                  "PreventionProgram3ID": 19991,
                  "ProcessChemicalID": 46259
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 35386,
      "AltID": "MK1 SCR DeNOx",
      "FacilityID": 24730,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46260,
          "ProcessID": 35386,
          "ChemicalID": 56,
          "Quantity": 280000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36259,
          "ProcessID": 35386,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 35387,
      "AltID": "Rail car storage",
      "FacilityID": 24730,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46261,
          "ProcessID": 35387,
          "ChemicalID": 56,
          "Quantity": 1440000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36260,
          "ProcessID": 35387,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24730,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-09-28 00:00:00",
    "ERTrainingDate": "2001-12-04 00:00:00",
    "CoordinatingAgencyName": "Bow Fire Department",
    "CoordinatingAgencyPhone": "6032284320",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24730,
      "SummaryText": "EXECUTIVE SUMMARY\nRISK MANAGEMENT PLAN (RMP) for\nPSNH MERRIMACK STATION\nDecember 3, 2001\n\nThis is a revised RMP that includes recommendations resulting from audits conducted by the Environmental Protection Agency and NH Department of Environmental Services in 2001.  The major changes were the addition of a third process to cover rail cars awaiting offloading, consideration of flood hazard on the facility and an update to the planned changes to improve safety.\n\nNORTHEAST UTILITIES ENVIRONMENTAL POLICY\nAs a leading regional provider of energy products and services, Northeast Utilities is committed to protecting the environment.  In Conducting our business we will:\n\n1. Maintain compliance with both the letter and spirit of environmental protection laws and our own procedures;\n2. Ensure accountability, openness and responsiveness to our customers, employees, shareholders and the public, by establishing specific objectives and measurable targets that promote continuous improvement and by reporting our environmental performance:\n3. Demonstrate leadership by pursuing economically, socially and environmentally sustainable initiatives that protect the environment and are consistent with our corporate vision; and\n4. Practicing stewardship by managing our operations with genuine care and working to reduce or eliminate significant environmental impacts and prevent pollution resulting from our activities.\n\nNortheast Utilities expects all employees to understand and comply with this policy and will promote the tenants of this policy with our suppliers, vendors and contractors.\n\nManagement is responsible for implementing this policy.  The Executive Environmental, Health and Safety Committee is responsible for oversight of this policy.\n\nMichael G. Morris\nChairman, President and Chief Executive Officer\n\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nMerrimack Station has incorporated the program elements from the OSHA Process Safety Management Regulation 29CFR 19"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24730,
      "SummaryText": "10.119 into the routine operation of our facility as the foundation of an accidental release prevention program.  The station also has an SPCC Plan based on the requirements in 40CFR 112.  The Emergency Response Plan follows the OSHA HAZWOPER Regulations and includes applicable provisions from 40CFR 1910.120 and notifications as required under the Emergency Planning and Community Right to Know Act (EPCRA).  Tier II Reports are filed with the Local Emergency Planning Committee (LEPC).\n\n\nB. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nMerrimack Station is a fossil fueled electric power generating facility owned and operated by Public Service Company of New Hampshire, a wholly owned subsidiary of Northeast Utilities of Berlin, CT.\n\nThe purpose of this facility is to generate electric power for sale via transmission and distribution lines to customers.  There are four separate units with a net claimed capacity of 478 megawatts.  Units 1 & 2 use coal fired cyclone boilers to produce steam that powers turbine driven generators capable of 113.5 and 320 megawatts respectively. Undesirable oxides of nitrogen (NOx) form during the combustion process.\n\nThe application of Selective Catalytic NOx Reduction Technology reduces nitrogen oxide air emissions from the station in excess of 80%.  The process uses anhydrous ammonia, a regulated substance, as the reagent.  This Risk Management Plan covers the storage, handling and use of anhydrous ammonia at Merrimack Station.\n\nSelective Catalytic Reduction Technology (SCR) was installed to remove the NOx as part of the PSNH plan to comply with the 1990 Clean Air Act Amendments.  In the process, liquid ammonia is drawn from the storage tanks and converted to vapor which is mixed with air and injected into the flue gas upstream of the catalyst bed.  The ammonia vapor combines with the NOx in the presence of the catalyst to form inert nitrogen gas and water vapor which exit the stack.\n\nThree processes are covered under this Risk"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24730,
      "SummaryText": "Management Plan:\n\n1.  MK1 SCR DeNOx\n2.  MK2 SCR DeNOx\n3.  Rail cars awaiting offloading\n\nProcesses #1 and #2 are each made up of separate storage tanks, vaporizers and gaseous ammonia metering and injection systems.  The storage tanks are inter-connected through piping from the off loading station.  Only one rail car can be offloaded at a time.  Ammonia is stored in ASME pressure vessels as a liquid under pressure at atmospheric temperature in quantities  greater than 10,000 pounds which is the threshold quantity listed in 40CFR Part 68.130.\n\nProcess #3 represents all ammonia rail cars on site awaiting offloading.  Anhydrous ammonia delivery to the site is primarily by rail car.  The cars are parked on a separate rail spur.  None of the cars are connected by piping or hose to each other or to either Process #1 or Process #2.\n\nAccess to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.  Locomotive operators are DOT trained and all employees are trained in the hazards of anhydrous ammonia.  Merrimack Station works closely with the Bow Fire Department (BFD) as the representative of the Local Emergency Planning Committee (LEPC) which participates in the Capital Area Mutual Aid.  Emergency response drills are conducted with the BFD.\n\n\nC. WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO, INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\n· All modeling was done using the ALOHA software distributed by the National Safety Council,  NOAA and EPA.  The release was modeled as a dense gas as recommended for anhydrous ammonia stored as a liquid under pressure.  Population estimates were developed using Landview III software provided by the EPA, NOAA, USGS and Bureau of Census which includes the 1990 Census Data.  The year 2000 Census Data was unavailable at the time of this reporting.\n· The toxic endpoint for anhydrous ammonia as stated in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24730,
      "SummaryText": "40CFR Part 68 is 200 ppm.  This represents a concentration of ammonia below which a majority of the population can be exposed to for one hour without serious or permanent health effects.\n· Worst-Case Scenario - This scenario is defined by the regulation 40 CFR 68.25 as the rupture of the largest single storage tank in a process when filled to the greatest amount allowed. It is assumed that the entire tank contents are released in 10 minutes.  The probability that such a failure would occur is low.  Administrative controls limit the maximum filling capacity of anhydrous ammonia storage tanks to 90.6% volume at 60 F based on standards set by ANSI K61.1.\n· A worst case release would result in the toxic endpoint occurring well beyond the plant property and would impact a population surrounding the facility including the towns of Bow, Suncook, Hooksett and the City of Concord.  The Merrimack River, Bear Brook State Park and Interstate 93 would also be impacted.\n· An alternative release scenario involving a hose rupture during offloading of a rail car was also evaluated.\n· The distance to the endpoint for the alternative scenario is an area mostly over company property and the Merrimack River.\n\n\nD. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS. \n\nThe ammonia storage and handling facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The ammonia systems were designed \nand constructed in accordance with ANSI K61.1 Safety Requirements for the Storage and Handling of Anhydrous Ammonia and the ASME Pressure Vessel Code to ensure design integrity.\n\nOur accident prevention program is based on the OSHA Process Safety Management Plan which is a 13 point program for preventing or minimizing the consequences of catastrophic releases.  The Plan includes: routine maintenance and inspections, written operating procedures, training of employees in the hazards and handling of anhydrous am"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24730,
      "SummaryText": "monia and the operation and maintenance of subsystems, and facility audits.  Annual refresher training is provided to all employees.\n\nThe equipment is visually inspected daily and trouble reports are submitted when action is required.  Preventative maintenance is conducted on all safety related equipment and critical components based on the manufacturers recommendations or experience.  Pressure vessels are inspected according to the ASME and NACE guidelines.\n\nAny changes to the covered processes follow a management of change procedure that requires conducting a process hazard analysis on the proposed change and implementing the study group recommendations prior to operating the system.\n \n\nE. FIVE-YEAR ACCIDENT HISTORY\n\nMerrimack Station went into commercial operation in 1960.  The first use of anhydrous ammonia on site was in 1991.  There have been no reportable releases of ammonia or related impacts from the use of anhydrous ammonia to the health and safety of employees or the surrounding community.\n\n\nF. THE EMERGENCY RESPONSE PROGRAM\n\nA written Emergency Response Plan (ERP) is readily accessible and provides guidance to employees in the event of any emergency at the station.  Any person on the site discovering an emergency condition is instructed to notify the shift supervisor on duty who becomes the internal incident commander.  The shift supervisor will then initiate the on-site emergency response system.  The nature of the emergency will determine the course of the response.  Our first contact for immediate outside assistance is to the Bow Fire Department who is the LEPC.\n\nThe ERP includes guidelines and procedures to respond to specific release scenarios developed  during the consequence assessment conducted in accordance with 40 CFR 68.165. The details of the ERP are periodically reviewed with the Bow Fire Department and they are invited to participate in our annual training program.  An initial joint training exercise was conducted on May 21, 1995 with the C"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 24730,
      "SummaryText": "apitol Area Mutual Aid before the MK2 DeNOx system became operational.\n\nEarly warning systems include ammonia gas monitors that are located around the ammonia storage tanks, the offloading station and inside the equipment buildings.  Both visible and audible alarms will set off locally and in the main control room providing an indication of the specific monitor that was triggered.  Operators conduct rounds at least once each shift that include observations of the ammonia storage and handling systems.\n\nA team of employees are trained as Hazardous Waste Operator/ Emergency Response Technicians at the 24 hour Technician level. Water sources (hydrants) are also available to assist in suppressing a gaseous release.\n\nG. PLANNED CHANGES TO IMPROVE SAFETY\n\nNU and Merrimack Station are committed to providing a safe work environment.  The following items will be initiated as part of the ongoing program to ensure safety:\n\n· Provide annual refresher training to Hazardous Waste Operator/ Emergency Response Technicians to maintain their status at the 24 hour technician level.\n \n· Perform non-destructive examination (NDE) on one of the ammonia storage tanks each year over the next 5 years.  The frequency of subsequent testing will be based on the results of these initial tests.\n \n· Following inspection, new isolation, excess flow and pressure relief valves will be installed  before returning the tank to service.\n \n· Implement the recommendations from the Process Hazard Analysis Revalidation conducted on the MK2 SCR DeNOx (Process # 1)"
    }
  ]
}