{
  "FacilityID": 24831,
  "FacilityName": "Tulsa Truck Terminal",
  "FacilityStr1": "4727 W. 21st Street",
  "FacilityStr2": null,
  "FacilityCity": "Tulsa",
  "FacilityState": "OK",
  "FacilityZipCode": "74107",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "36.133889",
  "FacilityLongDecDegs": "-96.0475",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Koch Hydrocarbon, LP",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": null,
  "OperatorName": "Koch Hydrocarbon, LP",
  "OperatorStr1": "4111 E. 37th Street North",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67220",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164671",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-22 00:00:00",
  "SafetyInspectionBy": "Internal Inspection",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-01-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-01-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-02-01 00:00:00",
  "DeRegistrationEffectiveDate": "2017-01-18 00:00:00",
  "AnniversaryDate": "2004-12-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.13349,
  "FRS_Long": -96.04548,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35533,
      "AltID": "Terminal & Storage",
      "FacilityID": 24831,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46558,
          "ProcessID": 35533,
          "ChemicalID": 98,
          "Quantity": 4100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36412,
          "ProcessID": 35533,
          "NAICSCode": "551114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20078,
              "Process_NAICS_ID": 36412,
              "SafetyReviewDate": "1997-11-21 00:00:00",
              "PHA_Date": "1998-09-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-02-11 00:00:00",
              "TrainingReviewDate": "1998-02-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Third-Party Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-04 00:00:00",
              "EquipmentInspectionDate": "1999-04-30 00:00:00",
              "EquipmentTested": "Mercaptan System",
              "ChangeMgmtDate": "1998-11-03 00:00:00",
              "ChangeMgmtReviewDate": "1999-03-01 00:00:00",
              "PreStartupReviewDate": "1998-06-26 00:00:00",
              "ComplianceAuditDate": "1998-04-15 00:00:00",
              "AuditCompletionDate": "1999-10-01 00:00:00",
              "IncidentInvestigationDate": "1999-05-07 00:00:00",
              "InvestigationChangeDate": "1999-06-07 00:00:00",
              "ParticipationPlansReviewDate": "1999-02-04 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-04 00:00:00",
              "ContractorSafetyReviewDate": "1995-07-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-02-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 29264,
                  "PreventionProgram3ID": 20078,
                  "ProcessChemicalID": 46558
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24831,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-17 00:00:00",
    "ERTrainingDate": "1999-06-02 00:00:00",
    "CoordinatingAgencyName": "Tulsa Fire & Police Depts.",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 24831,
      "SummaryText": "KOCH HYDROCARBON, LP\n\nTulsa Truck Terminal\nTulsa, Oklahoma\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nAt Koch Hydrocarbon, LP (Koch Hydrocarbon), we are committed to being associated with unmatched environmental performance as measured by our employees, customers, regulators, and the public.  Our management philosophy goals are achieved by the personal commitments of our employees and contractors, and by open communication with our employees, customers, neighbors, and with regulators.  The accidental release prevention and emergency response programs we have at our facilities are part of the high standards we strive for at Koch Hydrocarbon.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by law.\n\nThe Tulsa Truck Terminal is one of many propane terminal and storage facilities operated by Koch Hydrocarbon.  Propane is the only flammable substance regulated under the Risk Management Program (RMP) that is present at the Tulsa Truck Terminal in amounts greater than threshold quantity.  There are no RMP-regulated toxic substances at this facility.  The facility is classified as Program Level 3 under the regulation.  At the facility, we receive propane via pipeline.  The received propane is dehydrated and stored in pressure vessels.  From these pressure vessels, propane is loaded into tanker trucks for distribution.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release sh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 24831,
      "SummaryText": "ould occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n\nWorst Case and Alternative Release Scenarios\n\nAs specified by the U. S. Environmental Protection Agency (EPA) RMP Regulations, our worst case release scenario for flammables would be the loss of all of the propane in our largest vessel causing a vapor cloud explosion.  In the case of the Tulsa Truck Terminal, this would involve our 90,000-gallon propane storage tank.  Such a scenario is highly unlikely, however, at an overpressure of 1 psi, which is EPA's threshold for measurable impacts from a vapor cloud explosion, public receptors would be affected if this event were to occur.  Although we have numerous controls to prevent such releases (high level alarms, emergency shutdown, etc.) and to manage their consequences, no credit for any controls or mitigation measures was taken into account when evaluating this scenario.  \n\nThe alternative release scenario, characterized as a more likely scenario that would involve offsite consequences, is based on our propane storage bullet being overfilled when propane is being delivered by pipeline into the facility.  If such an incident occurred, the relief valve on top of the bullet would be activated during the filling process.  This valve ensures that the entire bullet does not rupture and only a minor controllable release results.  We have several active mitigation measures in place to greatly reduce the chance that such an event could ever occur.  We measure the level of liquid propane in the bullet on a continuous basis from our central control room in Wichita.  If this level becomes too high, the motor operated valve on the inlet pipe to the bullet is automatically closed.  Level alarms on our propane bullets will sound an alarm at our central control room in Wichita for appropriate corrective action.  We also provided excess flow valves on the inlet lines to all our propane bullets in order to prevent excessive filling ra"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24831,
      "SummaryText": "tes.  The presence of these active mitigation measures serves to either prevent this scenario from occurring or minimize its impact if it does occur.\n\nWe have discussed these potential propane releases with our employees and with local emergency response officials in Tulsa County, thereby further reducing the possibility of any impact on the public.\n\n\nPrevention Program\n\nThe Tulsa Truck Terminal has been operating under the strict guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1992.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety have helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n·We provided emergency shutdown devices at four locations within the facility in order to shutdown the entire facility during emergency situations.\n·We provided emergency shutdown capabilities at our central control room at Wichita in order to shutdown the entire facility during emergency situations.\n·We provided level alarms on our storage tanks and bullets in order to prevent overfilling.\n·We installed a hydrocarbon gas detection system consisting of 8 gas detectors located throughout the facility.  The hydrocarbon gas detection system will sound an alarm at low gas concentrations and will trigger emergency shutdown system at high gas concentrations.\n·We installed a fire detection system consisting of four fire-eyes which will trigger emergency shutdown system when activated.\n·We provided excess flow valves on the inlet lines and outlet lines for each storage tank to shut-off the tank during large release situations.\n·We provided reverse check valves on each storage tank which can be activated by hitting the emergenc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24831,
      "SummaryText": "y shutdown button or by the gas or fire detectors.\n·We installed an automated trailer volume and weight monitoring system at the truck loading bays in order to prevent overfilling of the trucks.\n\nThese safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility.\n\n\nFive-Year Accident History\n\nNo incident resulting in offsite impacts or onsite injuries from a propane release has occurred at the Tulsa Truck Terminal within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Tulsa Terminal with the Berryhill Volunteer Fire Department and the Tulsa County Sheriff Department.  Also involved in emergency response for the facility would be the Tulsa City Fire Department and Police Department, Tulsa County LEPC, and as appropriate, the Tulsa Ambulance Service, St. John's Hospital, St. Francis Hospital, Hillcrest Hospital, and the Oklahoma State Highway Patrol.  The Tulsa Truck Terminal Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the terminal is in place and that plan has been coordinated with local officials, along with evacuation procedures, regular drilling, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n\n \nPlanned Changes to Improve Safety\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Tulsa Truck Terminal.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\n·The Management of Change provisions ensure that we consider the potentia"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24831,
      "SummaryText": "l safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n·The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n·The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n·Internal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n·An ongoing dialogue with the Tulsa County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.\n\nWe encourage all interested citizens or community organizations to contact the Tulsa County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}