{
  "FacilityID": 24834,
  "FacilityName": "DEFS NGL Services, LP-Westfield Transfer Facility",
  "FacilityStr1": "30 Summit Lock Road",
  "FacilityStr2": null,
  "FacilityCity": "Westfield",
  "FacilityState": "MA",
  "FacilityZipCode": "01085",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25013",
  "LEPC": "Hampden LEPC",
  "FacilityLatDecDegs": "42.178444",
  "FacilityLongDecDegs": "-72.74375",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3641565,
  "ParentCompanyName": "Duke Energy Field Services, LP",
  "Company2Name": null,
  "CompanyDUNS": 7118276,
  "Company2DUNS": null,
  "OperatorName": "Duke Energy Field Services, LP",
  "OperatorStr1": "370 17th Street",
  "OperatorStr2": "Suite 900",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": "5609",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174116",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-12-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Level 3 C3 Storage Facility - 08/23/2001",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-01-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-01-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-01-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-07-24 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-01 00:00:00",
  "AnniversaryDate": "2006-08-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 42.17815,
  "FRS_Long": -72.74351,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 35536,
      "AltID": "Propane Storage",
      "FacilityID": 24834,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 46568,
          "ProcessID": 35536,
          "ChemicalID": 98,
          "Quantity": 222000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 36415,
          "ProcessID": 35536,
          "NAICSCode": "42271",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20081,
              "Process_NAICS_ID": 36415,
              "SafetyReviewDate": "2000-12-19 00:00:00",
              "PHA_Date": "2001-02-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-01-17 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Pump, monitor fire nozzles, fire extinguishers & fire hydrants",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-05-15 00:00:00",
              "TrainingReviewDate": "2001-01-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-12-19 00:00:00",
              "EquipmentInspectionDate": "2001-01-26 00:00:00",
              "EquipmentTested": "Storage tanks, facility piping & equipment, transfer hoses",
              "ChangeMgmtDate": "2001-12-17 00:00:00",
              "ChangeMgmtReviewDate": "2001-12-24 00:00:00",
              "PreStartupReviewDate": "2000-12-20 00:00:00",
              "ComplianceAuditDate": "2004-02-15 00:00:00",
              "AuditCompletionDate": "2004-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-02-06 00:00:00",
              "HotWorkPermitReviewDate": "2001-02-15 00:00:00",
              "ContractorSafetyReviewDate": "2001-02-15 00:00:00",
              "ContractorSafetyEvalDate": "2001-02-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 29273,
                  "PreventionProgram3ID": 20081,
                  "ProcessChemicalID": 46568
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 24834,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-12-04 00:00:00",
    "ERTrainingDate": "2000-12-05 00:00:00",
    "CoordinatingAgencyName": "Westfield Fire Department",
    "CoordinatingAgencyPhone": "4135626299",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 24834,
      "SummaryText": ".  Estimated Distance to 1 psi overpressure: .5 miles (.8 kilometers).\n\nThe alternative release scenario involves a release from the  6¿ rail tower header piping resulting in a vapor cloud explosion and fire.  In this scenario 1,995 pounds of propane is released per minute and the release duration is ten (10) minutes.  This release is also controlled by active mitigation measures that include monitor fire nozzles, emergency shutdown valves, and manual valves.  With a wind speed of  3 meters/second (6.7 miles/hour) a stability class of:  D and an air temperature of 77 degrees F or 25 degrees Celsius.  Estimated distance to 1 psi overpressure 0.1 miles.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\nThe Westfield Transfer Facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1995 Edition and NFPA-70, 1993 Edition.  The following sections briefly describe the release prevention program that is in place at our stationary source.\n\nSafety Information:\n\nA detailed record of written safety information is maintained at the Westfield Transfer Facility that describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.\n\nHazard Review:\n\nA ¿what-if¿ methodology is used to carry out hazard reviews at our facility.  The reviews focus on operating procedures, equipment functions, and handling practices to identify possible hazards.  Any\nfinding related to the hazard reviews are addressed in a safe and timely manner. Hazard Reviews are conducted using a team of people who have operating and maintenance experience as well as engineering and safety expertise.  The team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes sugg"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 24834,
      "SummaryText": "estions for additional prevention and/or mitigation measures when the team believes such measures are necessary.  To help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.   The team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained\n\nOperating Procedures:\n\nFor the purposes of conducting activities safely within our propane distribution facility, personnel at the Westfield Transfer Facility maintain written operating procedures.  These procedures address various modes of operation, such as emergency shutdown system/ startup procedures, pre-operational visual inspection procedures, rail car unloading procedures, transport-loading procedures, and transport-unloading procedures.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.   Operating Procedures are readily available to operators and for other personnel to use as necessary to safely perform their job tasks.\n\nTraining:\n\nDEFS NGL Services - Westfield Transfer Facility has a comprehensive training program in place to ensure that employees are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work indepe"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 24834,
      "SummaryText": "RMP ¿ Level III Propane Storage Facility\nDuke Energy Field Services, LP\nDEFS NGL Services, LP - Westfield Transfer Facility ¿ Westfield, MA\nEXECUTIVE SUMMARY\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nDEFS NGL Services, LP - Westfield Transfer Facility is strongly committed to employee, public, and environmental safety.   This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our process.  Our emergency response program is based upon the NFPA 58 Requirements for LP-Gas Storage and NPGA's LP-Gas Safety Handbook/ Guidelines for Developing Plant Emergency Procedures/ How to Control LP-Gas Leaks and Fires.  In addition, if a release were to occur, we have coordinated a response plan with the Westfield Fire Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substance Handled:\n\nThe Westfield Transfer Facility located in Westfield, MA. was designed to repackage and distribute propane to wholesale customers for use as a fuel. Propane arrives at our facility via rail car and tractor-trailer transports is stored in two (2) 60,000-gallon storage tanks.  The facility was also designed and equipped to load transports for product resale.  Access to this site is restricted to authorized facility employees and management personnel as well as authorized contractors. \n\n3.  The Flammable Worst Case Release Scenario and the Alternative Release Scenario:\n\nThe worst case release scenario submitted for the Westfield facility was a catastrophic release from a 60,000-gallon storage tank.  The scenario involves the release of 222,000lbs. of propane.  The release quantity has been calculated with a wind speed of 1.5 meters/second (3.4 miles/hour), stability class: F and an air temperature of 77 degrees F (25 degrees C)"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 24834,
      "SummaryText": "ndently and have passed a written proficiency test.  Refresher training is provided annually.  \n\nMaintenance:\n\nWestfield Transfer Facility carries out documented maintenance checks on process equipment to ensure proper functioning.   Maintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Equipment manufacturer's written procedures help ensure that work is performed in a consistent manner and provide a basis for training.\n\nCompliance Audits:\n\nThe Westfield Transfer Facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\n\nDEFS NGL Services Westfield Transfer Facility promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of propane.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\n5.  Five-year Accident History:\n\nThe Westfield Transfer Facility has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.  Emergency Response Plan:\n\nWestfield Transfer Facility has a written emergency response plan to deal with accidental releases of propane.  The plan includes all aspects of emergency response including evacuations and notification of local emergency response agencies.  Our facility's emergency response plan is based upon the NPGA's LP-Gas Handboo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 24834,
      "SummaryText": "k/ Guidelines for Developing Plant Emergency Response Procedures/ How to Control LP-Gas Leaks and Fires.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted from the implementation of the various elements of our \naccidental release prevention program.  Continued operator training, employee CTEP certification, and operational reviews are some of the major steps we want to take to improve safety at our facility.  These changes shall be implemented on an ongoing basis."
    }
  ]
}