{
  "FacilityID": 2485,
  "FacilityName": "City of Pocatello POTW",
  "FacilityStr1": "10733 N. Rio Vista Road",
  "FacilityStr2": null,
  "FacilityCity": "Pocatello",
  "FacilityState": "ID",
  "FacilityZipCode": "83201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16005",
  "LEPC": "Bannock County LEPC",
  "FacilityLatDecDegs": "42.914944",
  "FacilityLongDecDegs": "-112.515556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": "hokabren@ci.pocatello.id.us",
  "FacilityDUNS": 853804,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brent Hokanson",
  "OperatorStr1": "P.O. Box 4169",
  "OperatorStr2": null,
  "OperatorCity": "Pocatello",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83205",
  "OperatorZipCodeExt": "4169",
  "RMPContact": "Brent Hokanson",
  "RMPTitle": "WPC Superintendent",
  "FTE": 24,
  "OtherEPAFacilityID": "000007897440",
  "EPAFacilityID": "100000030664",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-01 00:00:00",
  "SafetyInspectionBy": "ID Industrial Commission",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-05-18 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-23 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.91528,
  "FRS_Long": -112.51694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2782,
      "AltID": "Sewage Treatment Facility",
      "FacilityID": 2485,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2843,
          "ProcessID": 2782,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 2975,
          "ProcessID": 2782,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 2976,
          "ProcessID": 2782,
          "ChemicalID": 49,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502975,
          "ProcessID": 2782,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 502976,
          "ProcessID": 2782,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2485,
      "SummaryText": "EXECUTIVE SUMMARY\n\nPocatello's Wastewater Treatment Plant is located west of the city at 10733 Rio Vista Road.  The\nplant treats all wastewater generated by the City of Pocatello and the City of Chubbuck. Treatment \nconsists of primary and secondary treatment with disinfection using a final\nchlorination/dechlorination process prior to being discharged to the Portneuf River.  Because the\nCity of Pocatello exceeds the threshold quantity for the chemicals Chlorine and Sulfur Dioxide it\nmust comply with the mandated EPA Risk Management Plan (RMP). \n\nThe two major elements in the RMP for Pocatello are the Off Site Consequence Analysis' for\nchlorine and sulfur dioxide and a Prevention Program. The City of Pocatello's Waste Water\nTreatment Plant is also required to do Offsite Consequence Analysis for  a worst case release\nscenario and alternative release scenario. Pocatello's Prevention Plan includes information about\nsafety, process hazards, operating procedures, training programs, maintenance programs, compliance\naudits, and accident investigation. \n\nThe RMP offsite consequence analysis for both the worst case release scenario and alternative\nrelease scenario were performed for accidental release of the toxic gases chlorine and sulfur dioxide \nusing the EPA software program, RMP*Comp.\n\nFor Chlorine:\nThe worst-case scenario analysis requires considering the release chlorine from the largest single\nvessel.  The largest single vessel of chlorine is a one ton cylinder. The analysis considers  a release\nrate of 200 pounds per minute, with a release time of 10 minutes. The topography is urban\nsurroundings. However, the building is not used as a mitigation measure because the chlorine is\ndelivered outside. The estimated distance to toxic endpoint is 1.3 miles.\n\nThe alternative scenario analysis considers the release chlorine a 1/4 inch hole from a pigtail\nconnection breaking.  This analysis uses a release rate of 9 pounds per minute, with a release time\nof 222 minutes (Risk Man"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2485,
      "SummaryText": "agement Program Guidance for Wastewater Treatment Plants, Chapter 4,\nExhibit 4-15). The topography is urban surroundings. The chlorine cylinders are stored inside a\nbuilding.  However, the building is not used as a mitigation measure because the chlorine is\ndelivered outside. The estimated distance to toxic endpoint is 0.1 miles.\n\nFor Sulfur Dioxide:\nThe worst-case scenario analysis requires considering the release of sulfur dioxide from the largest \nsingle vessel.  The largest single vessel of sulfur dioxide is a one ton cylinder. The analysis considers\na release rate of 200 pounds per minute, with a release time of 10 minutes. The topography is urban\nsurroundings.  The building is not used as a mitigation measure because sulfur dioxide is delivered\noutside of the building. The estimated distance to toxic endpoint is 1.3 miles.\n\nThe alternative scenario analysis considers the release of sulfur dioxide from a 1/4 inch hole from\na pigtail connection breaking.  The analysis considers a release rate of 4 pounds per minute, with a\nrelease time of 500 minutes (Risk Management Program Guidance for Wastewater Treatment Plants,\nChapter 4, Exhibit 4-19). The topography is urban surroundings. The sulfur dioxide cylinders are\nstored inside a building. The building is not used as a mitigation measure because the chlorine is\ndelivered outside.  The estimated distance to toxic endpoint is <0.1 miles.\n\nEstimating Offsite Receptors: \n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases of chlorine or sulfur dioxide in the past five years.  The\nobjective of this plan is to continue this history and prevent any accidental releases,  and to respond\neffectively and timely in the unlikely event there is a release.  Pocatello's RMP includes an incident\nreport form will be used in the unlikely event there is an accidental release.\n\nMANAGEMENT SYSTEM\n\nThe roles and responsibilities of the staff that oversees the risk management program elements will\nhelp to ensure effective "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2485,
      "SummaryText": "communication about process changes between divisions; clarify the roles\nand responsibilities related to process safety issues; avoid problems and conflicts among various\npeople responsible for implementing elements of the program; avoid confusion and allow team\nwork; and ensure that the program elements are integrated into an ongoing approach to identifying\nhazards and managing risks.\n\nPREVENTION PROGRAM (PROGRAM 2)\n\nPocatello's Prevention Plan has integrated the seven basic elements - safety information, process\nhazard analysis, operating procedures, training programs, maintenance programs, compliance audits,\nand accident investigations into a risk management system.  Safety information was used to perform\na process hazard analysis and the results of the analysis were used to revise and update operating and\nmaintenance procedures. Training programs to ensure employees to understand and manage risks\nhave been revised and continued training is provided.\n\nPROCESS SAFETY INFORMATION\n\nChlorine and sulfur dioxide have been used for many years in the chlorination and dechlorination\nprocess at Pocatello's Wastewater Treatment Plant.  As references for chlorine and sulfur dioxide\nhandling Pocatello uses The Chlorine Manual (The Chlorine Institute, 1986, 5th edition), Chlorine\nAnd Its Properties, (Capital Controls Company, Inc., 1990, Pub. No. 381-5), Sulfur Dioxide And Its\nProperties (Capital Controls Company, Inc. 1989, Pub. No.482-2), Material Safety Data Sheets\n(MSDS) BOC GASES, 1996;. and The City of Pocatello Operating Procedures for Chlorine and\nSulfur Dioxide Cylinder Handling and Storage, 1999. \n\nOPERATING PROCEDURES     \n\nOperating procedures and instructions are important for training personnel and insuring safe\noperations of the chlorine and sulfur dioxide systems.  The standard operating procedures (SOPs)\nfor operating the chlorine and sulfur dioxide systems and associate equipment are located in the\noperations office, maintenance office and  operators lab whic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2485,
      "SummaryText": "h are accessible to all plant personnel. \nThe SOPs cover everything from receiving the ton cylinders through valving the chlorine and sulfur\ndioxide to the various discharge points.  They include the start-up and shut down of all the related\nchlorine and sulfur dioxide handling equipment.  These SOPs are updated when ever there are any\nchanges made to any part of the chlorine system.\n\nNew employees are give general training in the hazards of chlorine and sulfur dioxide as part of their\nplant employee orientation.  New operators are required to review and understand the chlorine and\nsulfur dioxide related standard operating procedures and given on the job training (OJT) on all\nchlorine and sulfur dioxide related tasks they are required to perform as part of their operational\nduties.  The maintenance employees also receive OJT on the chlorine and sulfur dioxide systems\nbefore they are allowed to independently work on the chlorine or sulfur dioxide systems.\n\nYearly refresher training is given on the nature and hazards of chlorine and sulfur dioxide. \nDocumentation of this training is kept in the plant safety training records.\n     \nMAINTENANCE\n\nWritten procedures for inspection and testing are incorporated into a preventive maintenance (PM)\nprogram and have been in effect since construction completion in 1992. The PM is conducted in\naccordance with the manufactures recommended procedures and sound engineering practices.  The\nPM program is operated by a computer system that generates the needed information when a piece\nof equipment is in need of inspection or service.  \n\nTechnical manuals for the chlorination/dechlorination processes consist of three volumes which are\ncurrent and located in the maintenance library.\n\nInitial training on the chlorination/dechlorination systems were conducted by construction contractor\nand equipment manufactures at completion of construction.  Safety training requirements for\nmaintenance personnel are the same as for operations personnel. "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2485,
      "SummaryText": "\n\nINCIDENT INVESTIGATION\n\nThe intent of the incident investigation is to learn from past experiences and avoid future similar\nincidents.  The incidents employees are expected to recognize and initiate the investigation process\nare the types of events that result or could have reasonably resulted in a major chlorine or sulfur\ndioxide release.  This is what we may refer to as a \"near miss,\" meaning that serious consequences\ndid not occur, but could have.\n\nCOMPLIANCE AUDIT\n\nThe wastewater treatment plant  is required under EPA regulations to conduct a self-audit and\ndocument compliance on a signed document every three years.  The certification will verify that the\nprocedures and practices are adequate and are being followed.  A report of the findings of the audit\nwill be developed.\n\nThe Wastewater Superintendent or designee will determine and document a response to each\ndeficiency identified in the compliance audit.  Any deficiency noted in the audit will be corrected\nand documented as such.\n\nThe wastewater treatment plant will keep the two most recent compliance audit reports on file for\ninternal purposes and EPA inspection.\n\n\nEMERGENCY RESPONSE PLAN\n\nAny time a chlorine or sulfur dioxide emergency is apparent or suspected, the operator in charge will\ninitiate the procedure to assess the severity of the emergency. The procedure requires a minimum\nof two individuals to be present when an emergency is apparent or suspected.  A minimum of \"Level\nB\" respiratory protective equipment will be required.  The reason for a two party assessment is due\nto staffing levels. \n\nOnce the level of emergency has been assessed, the operator in charge will then make a\ndetermination as to what Action Response Procedure will be followed based on the information\nprovided by the assessment.  The operator in charge will immediately begin a record of the event. \n\nSmall leaks that are contained within the chemical building area may be repaired or alleviated\nthrough immediate action of trained pl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2485,
      "SummaryText": "ant personnel.  Large releases that may effect public and/or\nprivate receptors or risk personal injury to plant personnel will be responded to by the Regional\nHAZMAT Team."
    }
  ]
}