{
  "FacilityID": 25312,
  "FacilityName": "Huntsman Corporation",
  "FacilityStr1": "118 Huntsman Way",
  "FacilityStr2": null,
  "FacilityCity": "Longview",
  "FacilityState": "TX",
  "FacilityZipCode": "75602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48183",
  "LEPC": "Gregg County LEPC",
  "FacilityLatDecDegs": "32.438056",
  "FacilityLongDecDegs": "-94.69",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 834697377,
  "ParentCompanyName": "Huntsman Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hunstman Corporation",
  "OperatorStr1": "118 Huntsman Way",
  "OperatorStr2": null,
  "OperatorCity": "Longview",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75602",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Dennis Leahey",
  "RMPTitle": "Environmental Health & Safety Mgr.",
  "FTE": 160,
  "OtherEPAFacilityID": "TX0000999755",
  "EPAFacilityID": "100000178087",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Longview, Texas",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-03-21 00:00:00",
  "ErrorReportDate": "2002-03-21 00:00:00",
  "ReceiptDate": "2002-03-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-03-14 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-03-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.43806,
  "FRS_Long": -94.69,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36141,
      "AltID": "Propylene Tank",
      "FacilityID": 25312,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37030,
          "ProcessID": 36141,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47342,
          "ProcessID": 36141,
          "ChemicalID": 129,
          "Quantity": 310000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547342,
          "ProcessID": 36141,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25312,
      "SummaryText": "\nThe accidental release prevention and emergency response policies at our facility:\n\nHuntsman Corporation in Longview, TX (Huntsman) is committed to maintaining a safe work environment for our employees, contractors, visitors, and surrounding public.  Due to the necessity of a timely response associated with a propylene release, Huntsman has committed the resources necessary to respond offensively at the Longview,TX facility.  Huntsman has trained operators that are able to assess and mitigate a propylene release in minutes.  In addition, our facility regularly meets with outside responders, local fire departments, and local emergency planning committees in order to establish emergency response procedures necessary to protect our surrounding public and the environment.\n\nOur facility and the regulated substances handled:\n\nThe Huntsman facility produces polypropylene and is a Program 3 covered process due to the onsite storage and use of propylene, which is used at the facility to manufacture polypropylene.\n\nThe worst-case release scenario and the alternative release scenario:\n\nOne worst-case release scenario was modeled for the propylene covered process using USEPA's offsite consequence analysis guidance document, (OCAG) dated April 1999.  USEPA requires that the entire contents of the largest vessel be used for the worst-case release scenario, which is a 90,000-gallon propylene storage tank.  This scenario is highly unlikely and has never occurred at our facility. Administrative controls reduce the quantity released to 80% of the tank capacity and this was taken into consideration when modeling this scenario.  The worst-case release scenario for propylene potentially has an offsite impact.\n\nOne alternative release scenario was modeled for the propylene covered process using the same guidance document as stated above.  Per USEPA guidance, the alternative release scenario is intended to be a more reasonable or likely event than the worst-case release scenario, however"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25312,
      "SummaryText": ", it is still very conservative in nature.  The alternative release scenario modeled was a complete 1/8-inch gasket failure in the 10-inch line on the suction side of the propylene storage tank outlet.  The event modeled has never occurred at our facility.  This event was chosen based on the impact distance compared to other postulated scenarios that would have a much smaller impact distance or none at all.  There were no passive or active mitigation measures taken into consideration in the alternative release analysis. \n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nThis facility is covered by both USEPA's Risk Management Program rule, as well as, OSHA's Process Safety Management Rule for the propylene covered process.  The facility maintains a  program consisting of a written management system that complies with both USEPA's and OSHA's requirements.  The backbone of the program is the Management of Change Procedure.  This procedure enables the facility to initiate and complete process changes associated with the propylene system while maintaining the Process Safety and Risk Management Program requirements at the facility.  \n\nBoth the worst-case and alternative release scenarios were modeled based on equipment failure, therefore the mechanical integrity element of the program is key in preventing releases from the propylene process.  This facility has an active preventative maintenance, testing and inspection program of the propylene system.  The mechanical integrity program provides ongoing assurance that the propylene system is maintained in safe operating condition.\n\nThe five year accident history:\n\nThis facility has not experienced a release of propylene over the last five years.\n \nThe emergency response program:\n\nOur employees are trained and equipped to offensively respond to releases of propylene.  The operators routinely undergo training and participate in drills with the local fire department.  The plant has coo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25312,
      "SummaryText": "rdinated emergency response procedures with emergency response agencies in the community.  In case of a release that could result on an offsite impact, the Gregg County Sheriff's Office would be immediately notified, who in turn notifies the City of Longview and Harrison County Sheriff's Office.  These agencies would notify the public.\n\nPlanned changes to improve safety:\n\nThis facility strives to continuously improve safety through the analysis of and treatment of potential hazards, thorough investigation of accidents and near misses and active participation in trade associations and safety organizations."
    }
  ]
}