{
  "FacilityID": 25368,
  "FacilityName": "Iowa Turkey Products, Inc.",
  "FacilityStr1": "715 West Tilden Street",
  "FacilityStr2": null,
  "FacilityCity": "Postville",
  "FacilityState": "IA",
  "FacilityZipCode": "52162",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19005",
  "LEPC": "Allamakee County LEPC",
  "FacilityLatDecDegs": "43.085833",
  "FacilityLongDecDegs": "-91.583056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "itp@acegroup.cc",
  "FacilityDUNS": 62767694,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Iowa Turkey Products, Inc.",
  "OperatorStr1": "P.O. Box 339",
  "OperatorStr2": null,
  "OperatorCity": "Postville",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52162",
  "OperatorZipCodeExt": null,
  "RMPContact": "Randy Ellis",
  "RMPTitle": "Maintenance Manager",
  "FTE": 410,
  "OtherEPAFacilityID": "IAR000003533",
  "EPAFacilityID": "100000178194",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-05-31 00:00:00",
  "SafetyInspectionBy": "Insurance company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Submitted Mar 2002",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-03-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-03-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-03-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "2003-12-20 00:00:00",
  "AnniversaryDate": "2007-03-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 43.08583,
  "FRS_Long": -91.58306,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 36202,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 25368,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37092,
          "ProcessID": 36202,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47409,
          "ProcessID": 36202,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547409,
          "ProcessID": 36202,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25368,
      "SummaryText": "The Iowa Turkey Products facility located in Postville, Iowa is a turkey (poultry) processing facility that  handles ammonia, which is considered toxic by EPA. The primary purpose of this facility is to process live turkeys into food products for distribution to retailers.\n\nAmmonia is used at the facility to refrigerate areas to maintain a safe storage and processing of food products.  Ammonia is a valuable chemical used in the facility refrigeration system, providing the means to remove heat from the products being handled, a process typically used by food processors throughout the United States and around the world.   The main supply of ammonia is stored in steel tanks located at various areas within the facility.  Ammonia is contained in equipment in the facility and is compressed, condensed and evaporated to remove heat from areas within the facility.\n\nSince ammonia is classified by EPA as toxic chemical, it is necessary to observe certain safety precautions in handling them to prevent unnecessary human exposure, to reduce the health threat to our own workers, and reduce the threat to nearby members of the community.  It is our policy to adhere to all know Federal and state rules and regulations.  Safety depends upon the manner in which we handle ammonia combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel.\n\nAn accidental release prevention program is in place at the facility to maintain the integrity of the ammonia refrigeration system and minimize the potential for an ammonia release. Equipment was designed and installed following the codes and standard in effect at the time of the construction.  Equipment up grades have been scheduled as warranted to maintain the equipment.   It is the intent of this food processing facility to comply with EPA?s Accidental Release Prevention Rule and with all known applicable state codes and regulations. \n\nAll of our a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25368,
      "SummaryText": "mmonia refrigeration operators are trained using an on the job training program and experienced operators.  The operations of the ammonia refrigeration system has been under the control of a stable work force.  The key operators at the facility  have worked at this location for at least 15 years.  Also, select operators are sent to off site refrigeration system training school(s).  This program consists of having an effective preventative maintenance program, including using the services of an independent refrigeration contractor to assist in the operation and maintenance of the facility, and employee training to insure adequate response to equipment integrity.  The facility has a plan to replace  Safety Relief Valves on a routine basis. \n\nOur emergency response program is based upon federal guidelines as they apply to this facility.  The emergency response plan includes procedures for notification of the local fire authority, local emergency response agencies, and notification of any potentially affected neighbors. The facility emergency response plan is based on all known applicable regulations and requirements.  The emergency response plan has been discussed with the Postville Fire Department and other agencies involved with a response.  Representatives of the Postville Fire Department visited this plant on an annual basis.  Other facility inspections occur routinely by other agencies such as USDA, insurance companies, OSHA, and our own internal quality control teams.  \n\nThe facility has a trained team of emergency responders that are available to minimize any ammonia release.  These staff are trained to respond to a release and isolation of problem areas within the ammonia refrigeration system.  \n\nThere have been no reportable accidents in the past 5 years related to the ammonia system.  Furthermore, there have been no reportable releases at this facility in its history extending back to the mid 1960s, over 35 years of process operation.  \n\nIn regards to the wor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25368,
      "SummaryText": "st case release scenario as defined by EPA, the worst case release for ammonia from the high pressure receiver could travel 1.1 miles.  An alternative, more likely, release scenario could travel slightly less than 0.1 miles.  \n\nIn all cases, of a potential release, the extent of downwind areas affected is dependent on the amount of chemical released, weather conditions, wind speed and direction, etc.."
    }
  ]
}