{
  "FacilityID": 25530,
  "FacilityName": "Tulsa Facility",
  "FacilityStr1": "5201 West 21st. Street",
  "FacilityStr2": null,
  "FacilityCity": "Tulsa",
  "FacilityState": "OK",
  "FacilityZipCode": "74107",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "36.1375",
  "FacilityLongDecDegs": "-96.054167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 623332939,
  "ParentCompanyName": "Peak Sulfur, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Peak Sulfur, Inc.",
  "OperatorStr1": "5201 West 21st. Street",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74107",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": "OKD980507974",
  "EPAFacilityID": "100000050053",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OK0056526",
  "SafetyInspectionDate": "1999-05-25 00:00:00",
  "SafetyInspectionBy": "Internal Inspection",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-04-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-04-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-04-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-03-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.13353,
  "FRS_Long": -96.05319,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36414,
      "AltID": "Sulfuric Acid Mfg",
      "FacilityID": 25530,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 47661,
          "ProcessID": 36414,
          "ChemicalID": 69,
          "Quantity": 960000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37304,
          "ProcessID": 36414,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20444,
              "Process_NAICS_ID": 37304,
              "SafetyReviewDate": "1999-11-23 00:00:00",
              "PHA_Date": "2000-02-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-11-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "PH Monitor on waste water - stack gas monitor",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-11-23 00:00:00",
              "TrainingReviewDate": "1999-05-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Third Party Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-11-23 00:00:00",
              "EquipmentInspectionDate": "1999-12-15 00:00:00",
              "EquipmentTested": "Oleum dilution system",
              "ChangeMgmtDate": "2000-02-20 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-04 00:00:00",
              "PreStartupReviewDate": "2000-01-15 00:00:00",
              "ComplianceAuditDate": "2000-05-10 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-05-27 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-02-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-01-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 29805,
                  "PreventionProgram3ID": 20444,
                  "ProcessChemicalID": 47661
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 25530,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-12-04 00:00:00",
    "ERTrainingDate": "1999-12-15 00:00:00",
    "CoordinatingAgencyName": "Tulsa County LEPC",
    "CoordinatingAgencyPhone": "9185969422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25530,
      "SummaryText": "ELECTRONIC CHEMICALS, INC.\nTulsa, Oklahoma\n\n\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nUnder the Koch Environmental Excellence Program (KEEP) at Koch Industries, Inc., we are committed to being associated with unmatched environmental performance as measured by our employees, customers, regulators, and the public.  Our KEEP management philosophy goals are achieved by the personal commitment of our employees and contractors, and by open communication with our employees, customers, neighbors, and with regulators.  The accidental release prevention and emergency response programs we have at our facilities are part of the high standards we strive for through KEEP.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by the law.\n\nAt the Electronic Chemicals, Inc. (ECI) Tulsa facility, we receive sulfuric acid by railcar and truck.  We manufacture oleum and, from oleum, ultra pure sulfuric acid.  The ultra pure sulfuric acid and oleum are loaded in tractor-trailers for distribution.  Sulfuric acid is periodically loaded on railcars for distribution.  Oleum is the only toxic substance regulated under the Risk Management Program (RMP) that is present at the ECI Tulsa facility.  There are no RMP-regulated flammable substances at the facility.  The facility is classified as Program Level 3 under the regulation.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our sulfuric acid manufacturing operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accide"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25530,
      "SummaryText": "ntal release should occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n\nWorst Case and Alternative Release Scenarios\n\nAs specified by the EPA RMP Regulations, our worst case release scenario for toxic chemicals would be the loss of all of the 30% oleum in our 100-ton oleum tank.  Such a scenario is highly unlikely, however, using the EPA Offsite Consequence Analysis (OCA) methods, the distance that the resulting release could cause off-site impacts would be 20 miles.  Although we have numerous controls to prevent such releases (high level alarms, emergency shutdown and others) and to manage their consequences, no credit for any controls or mitigation measures was taken into account when evaluating this scenario.  The alternative release scenario, characterized as a more likely scenario that would involve an offsite impact, is calculated to reach approximately 4.5 miles from the release point.  This distance calculation is also based on the EPA OCA methods, which are known to overpredict any potential release from such a scenario.  Once again no credit for any controls or mitigation measures was taken into account when evaluating this alternative release scenario.  We selected the alternative scenario based on a release of oleum from the Oleum Still due to rupture of the sight glass.  We have mitigation measures in place to greatly reduce the chance that such an event could ever occur.  They include routine inspection and maintenance of the Oleum Still, thereby greatly reducing the possibility of such failure.  The presence of mitigation measures serves to either prevent this scenario from occurring or minimize its impact if it does occur.  We have discussed these potential oleum releases with our employees and with local emergency response officials in Tulsa County, thereby further reducing the possibility of any impact on the public.\n\n\nPrevention Program\n\nThe ECI Tulsa facility has been operating under the strict guideli"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25530,
      "SummaryText": "nes of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1998.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety have helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n·We have installed pH alarms to detect low pH wastewater in order to detect leakage of oleum.\n\n·We have installed level indicators and high level alarms on all of our storage tanks and vessels.\n\n·We have installed a SO2 monitor on our stacks in order to limit the SO2 concentration in the stack gases to 250 parts per million (ppm).  When the SO2 concentration exceeds 220 ppm, an alarm will sound which will enable the operator to take necessary corrective actions such as decreasing the amount of sulfur dioxide routed through the scrubbers.\n\n·Our operators visually inspect equipment and take readings every hour.  Our facility is manned continuously on 24-hour basis.\n\n·We have provided safety interlocks on the sulfuric acid pump that will shutdown the pump when the pump discharge pressure is low.\n\nThese safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility since we acquired it in1997.\n\n\nFive-Year Accident History\n\nNo incident caused by a covered RMP process has occurred at the ECI Tulsa facility within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the ECI Tulsa facility with the Berry Hill Fire Department and the Tulsa County Sherif"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25530,
      "SummaryText": "f.  Also involved in emergency response at the facility would be the Tulsa Area Local Emergency Planning Committee. ECI Tulsa facility Plant Management is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the facility is in place and that plan has been coordinated with local officials, along with evacuation procedures, regular drills, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the ECI Tulsa facility.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\n·The Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n·The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n·The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n·Internal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n·An ongoing dialogue with the Tulsa County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.\n\nWe encourage all interested citizens or community organizations to contact the Tulsa C"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25530,
      "SummaryText": "ounty Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}