{
  "FacilityID": 25537,
  "FacilityName": "Boise Cascade Wallula Mill",
  "FacilityStr1": "31831 W Highway 12",
  "FacilityStr2": null,
  "FacilityCity": "Wallula",
  "FacilityState": "WA",
  "FacilityZipCode": "99363",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53071",
  "LEPC": "Walla Walla County LEPC",
  "FacilityLatDecDegs": "46.1",
  "FacilityLongDecDegs": "-118.933056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9073099,
  "ParentCompanyName": "Boise Cascade Corporation",
  "Company2Name": null,
  "CompanyDUNS": 9073099,
  "Company2DUNS": 0,
  "OperatorName": "Boise Cascade Corporation",
  "OperatorStr1": "P.O. Box 50",
  "OperatorStr2": null,
  "OperatorCity": "Boise",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83728",
  "OperatorZipCodeExt": "0001",
  "RMPContact": "Raymond Lam",
  "RMPTitle": "Environmental Manager",
  "FTE": 480,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000098789",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "000369-7",
  "SafetyInspectionDate": "2001-04-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-04-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-04-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-04-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-05-18 00:00:00",
  "DeRegistrationEffectiveDate": "2018-05-08 00:00:00",
  "AnniversaryDate": "2007-04-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 46.05722,
  "FRS_Long": -118.92167,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36421,
      "AltID": "Bleach Plant",
      "FacilityID": 25537,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37311,
          "ProcessID": 36421,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        },
        {
          "Process_NAICS_ID": 37312,
          "ProcessID": 36421,
          "NAICSCode": "32212",
          "_desc": {
            "NAICS_CODE": "32212",
            "NAICS_DESCRIPTION": "Paper Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47668,
          "ProcessID": 36421,
          "ChemicalID": 71,
          "Quantity": 54200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547668,
          "ProcessID": 36421,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 36422,
      "AltID": null,
      "FacilityID": 25537,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37313,
          "ProcessID": 36422,
          "NAICSCode": "32212",
          "_desc": {
            "NAICS_CODE": "32212",
            "NAICS_DESCRIPTION": "Paper Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47669,
          "ProcessID": 36422,
          "ChemicalID": 71,
          "Quantity": 13553.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547669,
          "ProcessID": 36422,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25537,
      "SummaryText": "1.0 Introduction\n\nPer the requirements of Section 112(r) of the Clean Air Act Amendments  of 1990 as codified in Title 40 of the Code of Federal Regulations(CFR) Part 68, this Risk Management Plan (RMP) is submitted to the United States Environmental Protection Agency (U.S. EPA) in a timely manner for Boise Cascade Corporation's (Boise Cascade's) pulp and paper mill in Wallula, Washington.  The Wallula mill handles one or more regulated substances listed in Appendix A of Part 68.\n \n2.0 Stationary Source and Regulated Substances Handled.\n\nBoise Cascade owns and operates a pulp and paper mill located in Wallula Washington, which is an existing major stationary source per the requirements of Title V Clean Air Act Amendments of 1990. The regulated substances handled by this facility is chlorine dioxide, which is considered hazardous by the United States Environmental Protection Agency (U.S. EPA).\n\nThe Wallula mill uses Kraft and neutral sulfite semi-chemical (NSSC) pulping processes to produce pulp and paper from wood chips. Chlorine Dioxide is regulated under the Risk Management Program, and used at the mill to bleach the Kraft pulp.  Paper, the final product of the mill, is made from both bleached and unbleached pulp.\n\nChlorine Dioxide is generated at the mill using the R-8 generation process. Chlorine Dioxide is stored in an aqueous solution in two 272,000 gallon storage tanks. The maximum amount of chlorine dioxide that is stored in the tanks is 52,220 pounds.\n\nBoise Cascade also stores the following listed chemicals on-site, in quantities below the RMP thresholds for each process: aqueous ammonia, propane, hydrochloric acid, acetylene, and chlorine for process water treatment.\n\n3.0 Accidental Release Prevention\n\nBoise Cascade takes a systematic , proactive approach to preventing accidental releases of hazardous chemicals.  The Wallula mill's management systems, which cover the chlorine dioxide process, address each of the following key features of successful preven"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25537,
      "SummaryText": "tion programs.\n\n1. RMP Management System\n\nA management system was established to identify responsibility for the development, implementation, and maintenance of the Risk Management Program.  The RMP is required to be updated every five years, or any time a covered process modification involves Process Hazard Analysis.\n\nThe Risk Management Program development, implementation, and maintenance is the responsibility of the following team members:\n\nKevin Scott, RMP Manager, Environmental Department\nKen Arnold, Hazmat Assessment Coordinator, Power and Recovery\nKris Lagers, Emergency Response Coordinator, Power and Recovery Department\nAmy Cruz, Communications Coordinator, Public Affairs Department\nKen Arnold, Prevention Program Coordinator, Power and Recovery Department\n\nThe RMP Manager has the responsibility for the administration of the program.\n\n2. Process/Chemical Safety Information\n\nA comprehensive chemical data base has been assembled to include regulatory reporting, action thresholds, health hazard and chemical exposure limitations, and list the physical properties of regulated substance.  This information was compiled from numerous sources for easy access by a reader seeking data on these substances.\n\nProcess safety information was carefully assembled for the chlorine dioxide processes. Process specifications on each process are collected in one area for easy reference.  Detailed specifications on such items as maximum intended inventory, safe upper and lower temperatures, and codes and standards used to design, build and operate the processes are on file at the mill.\n\n3. Process Hazard Analysis\n\nA hazard analysis was conducted for each of the covered processes.  The hazard analysis team was made up of representatives from plant management, maintenance experts, process and project engineers, and process operating personnel.  The hazard review utilized the Hazard and Operability Study(HAZOP) approach, which was supplemented by the completion of design checklists.\n\n4"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25537,
      "SummaryText": ". Operating Procedures\n\nA rigorous detailed Standard Operating Procedures (SOP) program has been developed, and is stringently reviewed and adhered to by all employees at the Wallula Mill. The SOP provides system descriptions, specifications, and operating procedures for the chlorine dioxide operating system.  The SOP covers start- up; shutdown; abnormal, and emergency operation; maintenance; and troubleshooting procedures.\n\n5. Operator Training Program\n\nBoise utilizes experienced personnel to train employees to safely and effectively perform their assigned tasks.  The Wallula training program for the covered processes includes both initial and refresher training courses, a general overview of the process, the properties and hazards of the substances in the process, and a thorough review of the standard process operating procedures and safe work practices.  Oral reviews and written tests are given to ascertain if the employee understands the materials.\n\n\n6. Mechanical Integrity Program\n\nAn experienced and well-trained maintenance staff maintain the mechanical integrity of the process equipment to minimize and prevent equipment failures that could endanger workers, the public, and/or the environment.  The mechanical integrity program covers inspections and testing to identify equipment deterioration or damage before equipment failure.  The elements of this program include:\na) Specifications for inspection and testing of process equipment.\nb) Specifications for replacement parts and equipment.\nc) Procedures for inspecting, testing, and maintaining process equipment.\nd) Procedures for safe work practices such as lockout/tagout, hot work permits and confined space entry.\ne) Maintenance personnel training procedures\nf) Documentation of maintenance activities\n\n\n7. Management of Change\n\nThe Wallula mill's management of change program requires approval by the management team for all proposed changes to chemicals, equipment, and procedures for the chlorine dioxide process to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25537,
      "SummaryText": " ensure that the change does not affect safe operations. Process changes that are determined to be replacement in kind are allowed without completing a full management of change procedure.  All other changes must be confirmed through the full management of change procedure to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, and affected employees are notified of the changes.\n\n\n\n8. Pre-startup Review\n\nBoise Cascade performs a safety review of a new or modified process at the Wallula facility before it is activated for operation to ensure the process is safe to operate.  To ensure that the appropriate issues have been addressed, a pre-startup review checklist is complete to document the review.\n\n9. Internal Compliance Audits\n\nInternal compliance audits are conducted every three years to verify compliance with the programs and procedures contained in the Accident Prevention Program.  Boise Cascade assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process.  This team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The audit results are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n10.   Incident Investigations\n\nAll incidents are investigated at the Wallula mill that could have resulted in an injury to personnel, the public , or the environment to ensure that similar situations can be prevented.  Boise Cascade trains employees to recognize unsafe situations and report the incident for follow-up investigation.  An investigation team is assembled and an investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations resolved, and appropriate process changes or enhancements are implemented.\n\n11.  Employee "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25537,
      "SummaryText": "Participation\n\nBoise Cascade has developed a written program for the covered processes to ensure that safety concerns of employees are addressed.  The facility personnel are encouraged to actively participate in the prevention program activities for all the processes. Employees are consulted and informed about all aspects of t e RMP rule prevention program including process hazard analysis and operating procedures.\n12 Hot Work Permits\nBoise Cascade has established  a hot work program to manage spark or flame-producing activities that could result in fires or explosions at the mill. A hot work activity requires a hot work permit to be filled and properly signed by the appropriate  personnel before work commences. Training in the hot work permit procedures is included in the Wallula mill's safety training requirements.\n\n12.  Contractors\nBoise Cascade has established a contractor safety training program that ensures that all contract work is performed in a safe manner.  The Wallula facility provides safety training for all contractor personnel on the hazards of the process, emergency response procedures, safe work practices, and personnel protection.  The contractor and their employees are required to have this training before beginning work at the facility.  All the contractor training is documented by the safety department.\n\n4.0 WORSE CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nThe RMP rule requires that Boise Cascade provide an off-site consequence analysis for the worse-case release scenarios and alternate release scenarios for the facility.  The only covered processes at the Wallula mill are the Program 3 covered chlorine dioxide generation and storage.  Therefore, Boise Cascade must submit a single worse-case release scenario for the RMP covered substance at the mill, and an alternate release scenario for the covered process.\n\nThe worse-case scenario for the Wallula mill  is a release from the chlorine dioxide generation and  storage process.  This would involve a 30"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 25537,
      "SummaryText": " minute spill from the rupture of an 8-inch diameter pipe used to transfer chlorine dioxide from one of the two storage tanks to the bleach tanks.  The amount of aqueous chlorine dioxide released under this scenario is 500 gallons per minute, at a chlorine dioxide concentration of 11.5 grams per liter (g/L).  The total amount of chlorine dioxide released is 9.5 to 11.5 g/L.  The release rate from the liquid pool was modeled using the Kawamura-Mackay evaporation model, modified to account for the changing concentration of chlorine dioxide in the remaining liquid.  The release was than modeled using the DEGADIS dispersion model for dense gas releases.  The maximum distance to the toxic end point concentration (2.8 mg/m3) is 1.61 miles.  Approximately 19 people live within this distance of the mill, as estimated using the U.S. Census Bureau's LANDVIEW3 software.  Additionally, the Columbia River is located within this distance of the release.\n\n5. Five-Year Accident History\n\nBoise Cascade keeps records of all significant accidental chemical releases that occur at the Wallula mill.  This history indicates a good record of accidental release prevention over the last five years.  No releases of Chlorine Dioxide have occurred from Boise Cascade that have resulted in the consequences of interest (i.e. deaths, injuries, or significant damages on site; or known deaths, injuries, evacuations, sheltering-in -place, property damage, or environmental damage off site). The Wallula Mill continues to stress the importance of safety and achieving no reportable incidents within it's next five-year accident history.\n5.0 Emergency Response Program\n\n\n6.0 Emergency Response Program\n\nIn addition to the prevention program, Boise Cascade maintains a written integrated emergency response plan to safely respond to accidental releases of hazardous substances.  The plan identifies personnel roles at the mill for handling the emergency, provides emergency recognition and prevention information, in"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 25537,
      "SummaryText": "cludes procedures for evacuation area shutdowns, includes important community response information, and provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency response plan by covering the following procedures:\n\na. Informing the local fire department and the public concerning accidental releases that could reasonably result in off-site consequences.\nb. Provide proper first aid and emergency medical treatment to accidental human exposure to hazardous substances.\nc. Controlling and containing accidental releases of hazardous substances.\nd. Inspecting and maintaining emergency response equipment.\ne. Reviewing and updating the emergency response plan.\n\nThe Wallula mill maintains an emergency response team trained to the 24-hr Technician Level to initiate these emergency procedures if an incident should occur.  All the facility personnel are trained in evacuation procedures.  Drills are conducted in emergency response procedures, including coordinated drills with the local fire department.  The plan has been communicated to the local emergency response officials and the local fire department.\n\n7.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nBoise Cascade strives to continue improving the safety of the Wallula mill's processes through employee accountability and responsibility by working safely, following procedures, encouraging employee safety suggestions, and follow-up investigations on safety related incidents.\n\n\n\n\n\n\n\n\n\n\n\n8.0 CERTIFICATIONS\n\nFor all covered processes, the undersigned certifies that, to the best of my knowledge, information and belief, formed after reasonable inquiry, the other information submitted in this Risk Management Plan is true, accurate and complete.\n\nSignature:____________________________________\nTitle:________________________________________\nDate:________________________________________\n\n9.0 \nRMP DATA ELEMENTS\n\nThe following pages present additional information about our risk m"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 25537,
      "SummaryText": "anagement program that EPA's RMP rule has asked us to provide.\nThis information is categorized as follows:\n\n* Registration\n* Offsite consequence analysis\n* Five-Year accident history\n* Program 3 prevention program\n* Emergency response Program\n10.0 \nSection 1: Registration\n\nFacility Information\n\nFacility Name: Boise Cascade Wallula Mill\nAddress :Highway 12\nCity: Wallula\nState: Washington\nZip Code:99363\nZip Extension:0500\nCounty: Walla Walla\nLatitude (Degrees) 46\nLatitude (Minutes)  6\nLatitude (Seconds) 0\nLongitude (Degrees) 118\nLongitude (minutes) 55\nLongitude (Seconds) 59\n\nEPA Facility ID:WAD009052432\nFacility DUNS: 009073099\nParent Company #1 Name: Boise Cascade Corporation\nParent Company DUNS: 009073099\nNumber of full-time Employees:479\nEmployees claimed as CBI? No\n\nOwner/Operator Information\nName: Boise Cascade Corporation\nAddress: P.O. Box 50 \nCity : Boise\nState: Idaho\nZip code 83728\nZip Extension:0001\nPhone (208)-384-6161\nCountry: United States\n\nContact Information\nResponsible Person for RMP Information: Kevin Scott\nTitle of Responsible person for RMP Information: Environmental Manager\nEmergency Contact Name: Raymond Lam\nEmergency Contact Title: Environmental Engineer\nEmergency Contact Phone: 509-545-3318\n24 hour phone 509-547-2411\nPublic contact phone: 509-527-3223\nWWW Homepage Address: www.bc.com\nLEPC-509-527-3223\n\nRMP Information:\nCovered by OSHA PSM? YES\nCovered by EPCRA 302? Yes\nCAA Title V Permit? Yes\nAir Operating Permit ID: 000369-7\nOSHA Star or Merit Ranking? No\n\nLast Safety Inspection 5/28/1999\nPerformed by OSHA? NO\nPerformed by state OSHA? No\nPerformed by EPA? No\nPerformed by State EPA? No\nPerformed by Fire Dept? No\nNever Performed ? No\nPerformed by other? Yes\nOther Description: WA.Dept.  of Ecology\nRMP required predictive Filing ? No\n\nCovered Processes\nDescription\nProgram Level\nCBI\n\n\nChlorine Dioxide Process                       3                                    No\n\nSection 1: Registration\n\nCovered Processes\n\nProcess Name: Chlorine Dioxide Process\nProcess Descrip"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 25537,
      "SummaryText": "tion: Aqueous Chlorine Dioxide is generated on-site and stored in two 272,000 gallon storage tanks for use in the mill's pulp bleaching process.\n\nCBI Indicator code: No\n\nProcess NAICS\n\nNAICS\n32211\nProcess Chemicals    \n\n\n\nChemical\nCAS No.\nQuantity (lbs.)    \nCBI\nChlorine dioxide (Chlorine oxide (ClO2))\n10049-04-4    \n54,200    \nNo\n\n                \n        \n\n\n\nSection 2: Toxic Worse Case\n\n\nScenario:                 Transient Spill:15,000 gallons\nSubstance:                Chlorine dioxide\nWeight of Chemical:            100\nPhysical state:             Gas\nModel Used:            Multi-component K-M Evaporation; DEGADIS\nScenario Release Type:        Pipe Leak\nQuantity Released:            1,440 lbs.\nRelease Rate:            43 lbs./min\nRelease Duration:            30 min\nWindspeed:            2 m/s\nAtmospheric Stability Class:        D\nTopography:             Rural\nDistance to Endpoint:            1.61 miles\nResidential Population:        21\n\nPublic Receptors Within Distance to Endpoint\n\nSchools:                No\nResidences :            Yes\nHospitals :             No\nPrisons/Correction Facilities:         No\nRecreation Area:             Yes\nCommercial/Industrial Areas :        No\nOther Public Receptors:\n\nEnvironmental Receptors Within Distance to Endpoint:\n\nNational/State Parks, Forest, Monuments:     No\nWildlife Sanctuaries, Preserves, Refuges:     Yes\nFederal Wilderness Area:         No\nOther Environmental Receptors\n\nPassive Mitigation Considered:\nDikes:                No\nEnclosures:            No\nBarns :                No\nDrains:                No\nSumps:                No\nOther Passive Mitigation\n\nActive Mitigation Considered:\nSprinkler Systems:             No\nDeluge Systems:             No\nWater Curtain:             No\nNeutralization :             No\nExcess flow Valve:             No\nFlares:                 No\nScrubbers:                 No\nEmergency Shutdown:         Yes\nOther Active Mitigation:         No\nCBI Indicator code\n \n\nSection 4: Toxics Alternative Release\n\n??\n\n\nSection 5:Five Year Accident History\n\n\n\nNone\n\nSection 6:Emergency Response Plan\n\n\nEmergency Response Plan:\nIncluded in Community ERP:                      Yes\nFacility ERP:                         Yes\nDoes Facility ERP include:\n    Actions to Respond to Accidental Release of Regulated Substances: Yes\nProcedures to inform Responsible Agencies:                 Yes\nInformation on Emergency Healt"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 25537,
      "SummaryText": "h Care:                 Yes\nLast Review Update of Facility's ERP:                 5/20/1998\nLast ER Training for Employees:                     3/27/1999\n\nLocal Agency with Which Facility ERP or Response Activities are Coordinated:\nName of Agency:                         Walla Walla Dept of Emergency Management\nPhone Number:                         509-527-3223\n\nSubject to:\nOSHA Regulations at 29 CFR 1910.38:                 Yes\nOSHA Regulations at 29 CFR 1910.120 :                 Yes\nClean Water Act Regulations at 40 CFR 112:             Yes\nRCRA Regulations at 40 CFR 264, 265, 279.52:              Yes\nOPA 90 Regulations at 40 CFR 112.33 CFR 154, 49 CFR 194, 30 CFR 254:     Yes\nState EPCRA Rules or Laws:                     Yes\nOther\n\n\n\n\n\nSection 7: Prevention Program Level 3\n\nData Set:                             Chlorine Dioxide\nProcess Name:                        Chlorine Dioxide Process\nNAICS:                             32211\nLast Review/Revision of Safety Information:            4/27/01\n\n\nProcess Hazard Analysis (PHA):\nLast PHA/Update: 5 8/1995\n\nPHA Technique Used:            \nWhat-if:                             No\nChecklist:                             No\nWhat-if/Checklist (combined):                     No    \nHAZOP:                             No\nFailure Mode and Effects Analysis:                 No\nFault Tree Analysis:                         No\nOther:                             No\n\nMajor Hazards Identified:\n\nToxic Release:                         Yes\nFire:                            Yes\nExplosion :                        Yes\nRunaway Reaction:                     No\nPolymerization:                         No\nOverpressurization:                    Yes\nCorrosion:                         Yes\nOverfilling:                        Yes\nContamination:                        Yes\nEquipment Failure:                    Yes\nLoss of Cooling, Heating, Electricity, Instrument Air:     Yes\nEarthquake:                         No\nFloods:                             No\nTornado:                         No\nHurricanes:                        No\nOther:\n\nProcess Controls in Use:\nNone:                            No\nVents:                            Yes\nRelief Valves:                        Yes\nCheck Valves:                        No\nScrubbers:                         Yes\nFlares:                            No\nManual shutoffs:                        Yes \nAutomatic shutoffs:                        Yes\nInterlocks:                            Yes\nAlarms and Procedures:                     No\nKeyed Bypass:                        No\nEmergency Air Supply:                    No\nEmergency Power:                        Yes\nBackup Pump:                        No\nGrounding Equipment:                    No\nInhibitor Addition :                        No\nRupture Disks:                        Yes\nExcess Flow Device:                        No\nQuench System:                        No\nPurge System:                        No\nOther:\n\nMitigat"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 25537,
      "SummaryText": "ion Systems:\n\nNone:                      No\nSprinkler System:                 No\nDikes:                     No\nFire Walls:                     No\nBlast Walls:                 No\nDeluge System:                 No \nWater Curtain:                  No\nEnclosure:                     Yes\nNeutralization:                 No\nOther: Berms\n\nMonitoring/Detection:\n\nNone:                    No\nProcess Area Detectors:             Yes\nPerimeter Monitors:                 Yes\nOther:\n\nChanges Since Last PHA Update\nNone:                    No\nReduction in Chemical Inventory:        Yes\nIncrease in Chemical Inventory :            No\nChange in Process Parameters:            Yes\nInstallation of Process Controls:             No\nInstallation of Process Detection Systems:         No\nInstallation of Perimeter Monitoring Systems:     No\nInstallation of Mitigation Systems:        No\nNone Recommended:                No\nOther:\nLast Review/Revision of operating procedures:     8/1/1998\n\nTraining\nLast Review /Revision of Training Program :    3/5/1998\nType of training provided:\nClassroom:                 Yes        \nOn the Job:                Yes\nOther:\n\nType of Competency Test Used\nWritten Test:                Yes\nOral Test:                    Yes\nDemonstration:                Yes\nObservation:                Yes\nOther:\n\nMaintenance\nLast Review/Revision of Maintenance Procedures:     3/5/1998\nLast Equipment Inspection/ Test:            4/5/1999\nEquipment Inspected/Tested :            North and South ClO2 Bleach Plant Pumps; ClO2 Solution\nTransfer Pump\nNorth and South Saltcake filter Feed Pumps\nGenerator Recirculation Pump, Dump Tank Pump\nMethanol Truck and Railcar Pump\n\nManagement of Change (MOC)\nLast Change Triggering MOC Procedures :        2/3/1999\nLast Review/Revision of MOC Procedures:         9/27/1996\nLast Pre-Startup Review:             12/4/1996\n\nCompliance Audits\nLast Compliance Audit:             5/13/1999\nExpected Completion Date of Resulting Change:     1/1/2000\n\nIncident Investigation\nLast incident investigation :                1/15/1999\nExpected Completion Date of Resulting Changes:         10/20/1999\nLast Review/Revision of Employee Participation Plans:         3/14/1996\nLast Review/Revision of Hot Work Permit Procedures:         12/31/1997\nLast Review/Revision of Contractor Safety Procedures:         3/5/1998\nLast Evaluation of Contractor Safety Performance          8 /16/1998\nCBI: No\n\n"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 25537,
      "SummaryText": "\nProcess Chemicals:\n\nChemical\nCAS NO\nChlorine Dioxide (Chlorine Oxide (ClO2))    \n10049-04-4\n\n\n                        \n\nSection 8: Certification\n\n\nCertification statement for Program Level 2 and 3 Processes:\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n\n\n____________________                    _____________________\nSignature                                Print Name\n\n\n_____________________                    _____________________\nTitle                                    Date\n\n        \n\n\n\n\n\n\n\n\n\nUpdated June 15,2001"
    }
  ]
}