{
  "FacilityID": 25590,
  "FacilityName": "Agro Distribution LLC - St. Thomas",
  "FacilityStr1": "8248 Highway 81 South",
  "FacilityStr2": null,
  "FacilityCity": "St.  Thomas",
  "FacilityState": "ND",
  "FacilityZipCode": "58276",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38067",
  "LEPC": "Pembina County LEPC",
  "FacilityLatDecDegs": "48.608889",
  "FacilityLongDecDegs": "97.445278",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Agriliance LLC",
  "Company2Name": null,
  "CompanyDUNS": 152719498,
  "Company2DUNS": 0,
  "OperatorName": "Agro Distribution LLC",
  "OperatorStr1": "PO Box 279",
  "OperatorStr2": null,
  "OperatorCity": "St. Thomas",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58276",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144505",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-06-22 00:00:00",
  "SafetyInspectionBy": "State occupational safety  agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-04-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-04-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-06-06 00:00:00",
  "DeRegistrationEffectiveDate": "2018-05-29 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 48.60867,
  "FRS_Long": -97.44825,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36489,
      "AltID": "80 ton railcar",
      "FacilityID": 25590,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 47746,
          "ProcessID": 36489,
          "ChemicalID": 56,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37385,
          "ProcessID": 36489,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 14170,
              "Process_NAICS_ID": 37385,
              "SafetyReviewDate": "1998-12-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1998-09-22 00:00:00",
              "ChangeCompletionDate": "1999-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "vandalism and vehicular accident",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-11-30 00:00:00",
              "TrainingReviewDate": "1997-11-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-11-30 00:00:00",
              "EquipmentInspectionDate": "1998-10-10 00:00:00",
              "EquipmentTested": "Hoses,  Valves",
              "ComplianceAuditDate": "1998-09-22 00:00:00",
              "AuditCompletionDate": "1998-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1998-11-30 00:00:00",
              "CBI_Flag": 0,
              "Description": "There is only one Program 2 process at this facility subject to the RMP rule, which is the storage and handling of anhydrous ammonia. The anhydrous ammonia is delivered by truck or by rail and is stored in one (1) 30,000 gallon tank and two (2) 6,000 gallon storage tanks. The prevention program consists of seven (7) elements (safety information, hazard review, operating procedures, training, maintenance, compliance audit and incident investigation).",
              "_chemicals": [
                {
                  "PrimaryKey": 14845,
                  "PreventionProgram2ID": 14170,
                  "ProcessChemicalID": 47746
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 36490,
      "AltID": "30,000 gal NH3  tank",
      "FacilityID": 25590,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 47747,
          "ProcessID": 36490,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37386,
          "ProcessID": 36490,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 36491,
      "AltID": "6,000 gal NH3 tank",
      "FacilityID": 25590,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 47748,
          "ProcessID": 36491,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37387,
          "ProcessID": 36491,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 36492,
      "AltID": "6,000 gal NH3 tank",
      "FacilityID": 25590,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 47749,
          "ProcessID": 36492,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37388,
          "ProcessID": 36492,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 25590,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fire Dept",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25590,
      "SummaryText": "Agro Distribution LLC - St. Thomas\nFacility Manager: Tom Johnson\nFacility Telephone:  (701) 257-6415\n\nAccidental Release Prevention and Emergency Response Protocols:  The owners, management and employees of the St. Thomas facility are committed to providing a safe workplace free of accidental releases of anhydrous ammonia.  Health, safety and environmental compliance are a fundamental part of every employee's job.  It is facility protocol to adhere to applicable Federal, State and local laws and to implement appropriate controls to prevent accidental releases of anhydrous ammonia.  If an accidental release were to occur, the facility would respond in accordance with its Emergency Action Plan and is prepared to work with the local fire department, the Local Emergency Planning Committee and other authorities to control and mitigate the release and minimize the impact of the release to employees, the environment and the general public.\n\nStationary Source and Regulated Substances Handled:  The primary activity at this facility (the stationary source) is the storage and handling of fertilizers for direct retail sale to farmers.  Anhydrous ammonia is received, stored and distributed for direct application as crop production nutrients. The facility maintains approximately twenty-two (22) 1,000 gallon and twenty-one (21) 1,500 gallon nurse tanks for customer use. The maximum quantity of anhydrous ammonia stored in the nurse tanks is approximately 250,000 pounds. The maximum quantity of anhydrous ammonia stored in the stationary tanks at the facility is approximately 196,000 pounds stored in one (1) 30,000 gallon and two (2) 6,000 gallon storage tanks.  The maximum fill level of the tanks is 85% of the total tank capacity, which is controlled by a liquid level gauge.  Anhydrous ammonia can be delivered by transport truck or by rail. The maximum quantity of anhydrous ammonia stored in one railcar is approximately 160,000 pounds. Therefore, the maximum quantity of anhydrous am"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25590,
      "SummaryText": "monia stored at this facility would be approximately 606,000 to 610,000 pounds. This would occur when all of the nurse tanks and the three (3) on-site stationary tanks are at the maximum fill level of 85% and there is one fully loaded railcar.    \n\nWorst-Case Release Scenario and Alternative Release Scenario:  The worst-case release scenario would be the release of the total contents of one 80 ton railcar.  The maximum quantity of anhydrous ammonia released would be approximately 160,000 pounds released in a gaseous form over ten (10) minutes.  The resulting distance to the toxic endpoint concentration extends offsite and public receptors are within the distance to the endpoint.  The distance to the toxic endpoint concentration (0.14 mg/L) is 1.2 miles.  There was one (1) administrative control considered in this scenario; which is, the storage tank is not filled more than 85% full.  There were no passive mitigation measures considered in this scenario.\n\nThe alternative release scenario involves a release of anhydrous ammonia from a break/rupture in a three (3) inch hose during transfer of ammonia from a railcar to the storage tank.  The quantity of anhydrous ammonia released in a gaseous form would be approximately 27,000 pounds, which is based on a release rate of approximately 13,500 pounds per minute over a two (2) minute time period.  The resulting distance to the toxic endpoint concentration extends offsite and public receptors are within the distance to the endpoint.  The distance to the toxic endpoint concentration (0.14 mg/L) is 0.78 miles.  There were no passive mitigation measures considered in this scenario.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  This facility complies with EPA's accidental release prevention requirements and applicable State and local codes and regulations.  The following sections briefly describe the elements of the facility's release prevention program.  \n\n1) Safety Information:  The fa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25590,
      "SummaryText": "cility was designed and constructed in accordance with applicable Federal and State regulations.  All plans and procedures maintained at the facility are periodically reviewed by facility management for safety updates and changes.  Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the anhydrous ammonia equipment are maintained at the facility. \n\n2) Hazard Review:  Facility management conducts reviews of the hazards associated with the handling and storage of anhydrous ammonia.  The reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases.  The results of the reviews are documented and problems identified are addressed in a timely manner.  \n\n3) Operating Procedures:  The facility maintains written operating procedures for the handling and storage of anhydrous ammonia.  The procedures generally follow the provisions of the Occupation Safety and Health Administration (OSHA) standard, 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\" and the American National Standards Institute (ANSI) standard, \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\".  The written procedures are reviewed by facility management on a regular basis and revised as necessary. \n\n4) Training:  All employees at the facility that handle anhydrous ammonia participate in a training program.  Initial training for new employees consists of classroom type instruction (e.g., reading safety information, operating procedures and response measures followed by a written test) and on-the-job supervision.  Refresher training for all employees is conducted at least once every three (3) years.  The training program is reviewed by facility management on a regular basis and revised as necessary. \n\n5) Maintenance:  The facility maintains written equipment"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 25590,
      "SummaryText": " inspection and maintenance procedures.  Storage and transfer/process equipment inspections are performed by qualified personnel on an approximate annual basis and are documented.  Equipment maintenance procedures follow either instructions furnished by the equipment vendors, Federal or State regulations (i.e., the provisions of the OSHA standard, 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\") or industry codes (i.e., the provisions of the ANSI standard, \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\").  The written procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n6) Compliance Audits:  As required by the RMP rule, compliance audits will be performed at least once every three (3) years.  The audit will be documented and conducted by a person knowledgeable in the safe handling and storage of anhydrous ammonia.  Corrective actions required as a result of each compliance audit will be performed promptly and documented.    \n\n7) Incident Investigation:  Facility management will investigate each incident that results in, or could have reasonably resulted in a catastrophic release of anhydrous ammonia.  The investigation will be performed to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring.  Investigation reports will be retained for five years.\n\nFive-Year Accident History:  There have been no accidental releases of anhydrous ammonia in the past five (5) years that caused deaths, injuries, or significant property damage at the facility; nor, to our knowledge, resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program:  In the event of an emergency, it is facility protocol to notify the local fire department and other emergency responders and request that they respond to the emergency.  Facility employees will not respond to accidental r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 25590,
      "SummaryText": "eleases of anhydrous ammonia except for those that are small or incidental, can be controlled at the time of the release by employees in the immediate release area (e.g., shutting a valve) and do not appear to pose an immediate safety or health hazard.  This protocol has been discussed with the local fire department and the other emergency responders and the facility has appropriate mechanisms in place to notify the emergency responders when there is a need for a response.  The facility is also included in the written community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA).\n \nPlanned Changes to Improve Safety:  There are no specific anhydrous ammonia safety changes planned at this time.  However, safety improvement is an on-going process at this facility.  Periodic evaluations are performed to assess the safety of equipment and procedures."
    }
  ]
}