{
  "FacilityID": 2564,
  "FacilityName": "City of Kent Water Treatment Plant",
  "FacilityStr1": "5860 Hodgeman Lane",
  "FacilityStr2": null,
  "FacilityCity": "Kent",
  "FacilityState": "OH",
  "FacilityZipCode": "44240",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39133",
  "LEPC": "Portage County LEPC",
  "FacilityLatDecDegs": "41.149722",
  "FacilityLongDecDegs": "-81.318889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "kentwater@aol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Kent, Ohio",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City Manager, City of Kent",
  "OperatorStr1": "Municipal Building",
  "OperatorStr2": "319 South Water Street",
  "OperatorCity": "Kent",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44240",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Merleno",
  "RMPTitle": "Water Plant Manager",
  "FTE": 10,
  "OtherEPAFacilityID": "000002578346",
  "EPAFacilityID": "100000021264",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-04-14 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-04-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.14854,
  "FRS_Long": -81.31917,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2864,
      "AltID": "Chlorine Gas",
      "FacilityID": 2564,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2925,
          "ProcessID": 2864,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3060,
          "ProcessID": 2864,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503060,
          "ProcessID": 2864,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2564,
      "SummaryText": "KENT WATER TREATMENT PLANT\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\nThe City of Kent Water Treatment Plant (Kent WTP) is a 6-million gallons per day (mgd) facility located southeast of the intersection of U.S. 59 and U.S. 261, just east of Kent, Ohio.  The Kent WTP uses a groundwater supply as its source water.  Treatment processes include softening, coagulation, sedimentation, filtration, corrosion control, fluoride adjustment, and disinfection.  Chlorine gas is used for disinfection at the Kent WTP.  Chlorine gas is the only regulated substance addressed by the Risk Management Plan (RMP) that is used and/or stored at the plant.\n\nChlorine is purchased in 1-ton cylinders and stored in the chlorine cylinder storage area located at the southeast corner of the building.  Space is available for the storage of five 1-ton cylinders at this location.  However, during normal operating procedures the maximum number of full cylinders at this location is three.  Two cylinders are located within the plant's chlorine room and are used as the source of the chlorine feed.  Chlorine gas is fed from the cylinders by a 3/4-inch line to two gas chlorinators where it is converted to solution.  The chlorine solution is then sent to two rotometers where it is diluted and sent to feed points within the plant.  \n\nKent WTP personnel have an existing program in place for preventing the accidental release of chlorine.  A 12-step written procedure for changing chlorine cylinders is maintained on file and is currently used by employees when changing cylinders.  Employees are required to review the procedures on an annual  basis.  A list of chlorine maintenance procedures is maintained on file and used by employees for the periodic checking, cleaning, and maintaining of all chlorine feed system components.  Safety information and Material Safety Data Sheets (MSDS's) for chlorine and a schematic of the chlorine feed system are also maintained on file and easily accessible by plant personnel. \n\nAn "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2564,
      "SummaryText": "Emergency Contingency Plan for the City of Kent Water Division exists which documents the emergency response policies for the plant.  Included in the plan are detailed instructions for procedures in response to the accidental release of chlorine.  Plant employees are not to respond directly to the release but are to dial 911 to notify the Kent Fire Department.  Other instructions related to the accidental release of chlorine include the following:\n\n7 start-up and shut-down procedures for the plant;\n7 plant exit and escape routes;\n7 location of equipment and supplies; and\n7 chain-of-command with 24-hour telephone numbers. \n\nAs a requirement of the RMP, different scenarios for the release of chlorine gas from the Kent WTP to the environment were performed.  The release scenarios were modeled using the Environmental Protection Agency's (EPA's) RMP*Comp model, and included both worst-case and alternative release scenarios.\n\nThe worst-case scenario assumes that the largest single container will release its entire contents to the environment over a ten-minute period.  For the Kent WTP, the largest container is a one-ton cylinder that is located in the plant's chlorine room.  Criteria used within the RMP*Comp model included a release rate of 110.0 pounds per minute (lbs/min), a wind speed of 1.5 meters per second (m/sec), an atmospheric stability class of F, and urban topography.  The enclosed storage of chlorine in the chlorine room is considered a passive mitigation measure that reduces the potential exposure to the environment by approximately 30 percent.  The projected area impacted by the worst-case scenario, based on the EPA model, is presented on Figure 1.  The affected area is a circle of 0.9-mile radius that includes commercial, residential, and institutional areas within the Cities of Kent and Brady Lake.  The affected area's population, based on 1990 Census population density information, is approximately 3,700.  \n\nAlthough the worst-case release scenario is a r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2564,
      "SummaryText": "equirement of the RMP, there is an extremely low probability that such an event would occur.  A more realistic scenario that would be encountered at the Kent WTP is a leak from the chlorine feed line, which is addressed by an alternative release scenario.  \n\nThe alternative release scenario assumes that a leak or break would occur at the 3/8-inch regulator connection between the chlorine tank and chlorine feed line.  The alternative release scenario assumed that a leak would be released to the environment over a ten-minute period (the release duration did not affected the size of the affected area).  Criteria used within the RMP*Comp model included a release rate of 20.9 lbs/min, a wind speed of 3.0 m/sec, an atmospheric stability class of D, and urban topography.  As with the worst-case release scenario, the location of the chlorine feed equipment in the chlorine room is considered a passive mitigation measure that reduces the potential exposure to the environment by about 30 percent.  The projected area impacted by the alternative release scenario, based on the EPA model,  is presented on Figure 2.  The affected area is a circle of 0.1-mile radius that only affects the Kent WTP staff and does not reach the public off-site. \n\nThe Kent WTP has had no accidents during the last 5 years.  In fact, the plant has not had an accidental chemical release since the current chlorine feed system went on-line in 1976.  This success is due to the quality of the staff and the plant's existing accident release prevention program, which includes inspection and maintenance procedures for the chlorine feed system components.\n\nThe RMP specifies that WTPs must have a prevention program in place for each process.  For the Kent WTP, chlorine gas is the only regulated substance and the chlorine feed system is the only regulated process.  Since the worst-case release scenario modeling results indicated that the public is within the potential effected area of a chemical release, the possibl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2564,
      "SummaryText": "e prevention programs available to the Kent WTP included Program 2 (default program) and Program 3 (consistent with Occupational Safety and Health Association [OSHA] program).  Although the Kent WTP could have sought coverage under the less stringent Program 2, plant personnel chose to meet Program 3 to be consistent with OSHA's Process Safety Management (PSM) standards.\n\nProgram 3/OSHA PSM standards require implementation of a prevention program will several tasks.  The Kent WTP has existing programs for several of these tasks including review of safety information, operating procedures, training programs, and equipment inspections.  As part of the RMP requirements for Program 3, the plant has developed written procedures for process hazard analysis, maintenance, management of change, employee participation plans, written competency testing for safe handling procedures, and hot work permits.  It is anticipated that these additional management and safety procedures will help ensure that the Kent WTP will continue to maintain its perfect record of no chemical release accidents."
    }
  ]
}