{
  "FacilityID": 25662,
  "FacilityName": "Airgas South, Jacksonville",
  "FacilityStr1": "5837 West Fifth Street",
  "FacilityStr2": null,
  "FacilityCity": "Jacksonville",
  "FacilityState": "FL",
  "FacilityZipCode": "32254",
  "Facility4DigitZipExt": "1509",
  "FacilityCountyFIPS": "12031",
  "LEPC": null,
  "FacilityLatDecDegs": "30.241111",
  "FacilityLongDecDegs": "-81.548056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.airgas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3297942,
  "ParentCompanyName": "Airgas, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 24492860,
  "Company2DUNS": 0,
  "OperatorName": "Airgas South, Inc.",
  "OperatorStr1": "5837 West Fifth Street",
  "OperatorStr2": null,
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32254",
  "OperatorZipCodeExt": "1509",
  "RMPContact": "Ed Henderson",
  "RMPTitle": "Site Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "FDL072544463",
  "EPAFacilityID": "100000006245",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-03-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Ethylene Storage and Transfill",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-05-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-05-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-05-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-05-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 30.34308,
  "FRS_Long": -81.74624,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 36611,
      "AltID": "Ethylene storage and cyli",
      "FacilityID": 25662,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 37508,
          "ProcessID": 36611,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 47905,
          "ProcessID": 36611,
          "ChemicalID": 95,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 95,
            "ChemicalName": "Ethylene  [Ethene]",
            "CASNumber": "74-85-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 547905,
          "ProcessID": 36611,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25662,
      "SummaryText": "Airgas South, Inc.\nJacksonville Ethylene Storage and Fill Plant\n\n1. Accidental release prevention and emergency response policies:\n\nAt this facility ethylene is stored and transfilled into portable cylinders. Ethylene, in the amounts handled at this facility, is considered hazardous by the EPA. It is our policy to adhere to all applicable Federal and state rules and regulations. Airgas manages the safety of the regulated process by means of operating procedures, equipment testing and inspections, safety devices (e.g. alarms, shut-offs, relief devices) inherent in the design of the facility, and other controls and systems designed to prevent accidental releases of hazardous chemicals. Safe work practices and training of personnel supplement the inherent safe design of the plant.\n\nOur emergency response program is based upon OSHA's HAZWOPER regulations. The plan includes procedures for the notification of the local fire authority and Hazardous Materials unit so that appropriate measures can be taken by the local emergency responders to control accidental releases.\n\nThis document has been prepared in accordance with the EPA's Risk Management Plan regulation (40 CFR 68). The substances and processes considered during the preparation of this RMP, and the scenarios described were selected based on criteria established in the regulation.\n\n2. The stationary source and regulated substances handled:\n\nThe primary function of this facility is the storage of Ethylene and its transfer into portable cylinders. The ethylene is used by Airgas' customers for a variety of applications such as a fuel for heating and metal processing. The ethylene is delivered into storage and portable cylinders are filled individually by weight on a scale. There is no chemical reaction involved. The process is strictly the transfer of a liquefied gas from a large storage container into smaller individual portable cylinders. The capacities of the cylinders range from approximately 4 lbs to 38 lbs. Durin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25662,
      "SummaryText": "g the process, no products or wastes are either created or consumed.\n\nThe regulated substance handled at this facility is teh pure, single product Ethylene, a liquefied petroleum gas, which is flammable. The maximum amount of this substance at the facility is 14,000 lbs.\n\n3. The Worst-Case Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distance for each reported scenario:\n\nThe Worst-Case Scenario (WCS), as defined by the EPA, associated with the ethylene process is the catastrophic failure of the storage tubes, resulting in a vapor cloud explosion. The entire ethylene tube trailer inventory of 14,000 lbs is assumed to be released instantaneously into the atmosphere at the tube trailer location and ignited, resulting in a vapor cloud explosion. The maximum distance to the EPA defined flammable endpoint of a 1 psi overpressure is 0.196 miles (1035 ft). Although active controls are directed at preventing such releases and controlling consequences, no credit for active mitigation measures were taken into account in evaluating the WCS.\n\nThe Alternative Case Scenario (ACS) for the ethylene is a vapor cloud explosion resulting from the failure of the transfer hose from the ethylene trailer to the stanchion, resulting in a release of 3080 lbs of ethylene at a rate of 308 lbs per minute for 10 minutes, based on the tube trailer pressure of 1500 psig and a 1/2\" transfer hose. The maximum distance to the EPA defined flammable endpoint of 1 psi overpressure is 0.09 miles (475 ft).\n\n4. The general accidental release prevention program and specific prevention steps.\n\nThe facility developed prevention program elements are based on the Federal EPA's Accidental Release Prevention Program, and OSHA's Process Safety Management (PSM) regulation. This facility has been designed and constructed to comply with applicable state and industry codes.\n\n5. Five-year accident history:\n\nThere have been no accidents or accident"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25662,
      "SummaryText": "al releases of ethylene that resulted in any deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\n6. The emergency response program:\n\nAt this site employees are trained to recognize emergencies and initiate emergency response from outside agencies. Employees will not be involved in emergency response activities. Emergency response actions have been coordinated with the Jacksonville City Fire Department. Periodic contact with this agency is maintained to review the effectiveness of the facility's emergency procedures. The last inspection by the Jacksonville City Fore Department was on 3/22/02.\n\n7. Planned changes to improve safety:\n\nThe facility evaluates recommendations from PHAs and incident investigations, some of which may result in modifications to the plant design and operating procedures."
    }
  ]
}