{
  "FacilityID": 2584,
  "FacilityName": "GRACE DAVISON - LAKE CHARLES",
  "FacilityStr1": "1800 DAVISON ROAD",
  "FacilityStr2": null,
  "FacilityCity": "SULPHUR",
  "FacilityState": "LA",
  "FacilityZipCode": "70665",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.155556",
  "FacilityLongDecDegs": "-93.341667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8080434,
  "ParentCompanyName": "W. R. GRACE & CO. - CONN .",
  "Company2Name": null,
  "CompanyDUNS": 1367846,
  "Company2DUNS": null,
  "OperatorName": "W. R. GRACE & CO. - CONN.",
  "OperatorStr1": "P. O. BOX 3247",
  "OperatorStr2": null,
  "OperatorCity": "LAKE CHARLES",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70602",
  "OperatorZipCodeExt": "3247",
  "FTE": 330,
  "OtherEPAFacilityID": "70663WRGRCDAVIS",
  "EPAFacilityID": "100000031324",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0520-00001-V1",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-09-11 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-16 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.156194,
  "FRS_Long": -93.339443,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2888,
      "AltID": null,
      "FacilityID": 2584,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3084,
          "ProcessID": 2888,
          "ChemicalID": 57,
          "Quantity": 865000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 2949,
          "ProcessID": 2888,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 889,
              "Process_NAICS_ID": 2949,
              "SafetyReviewDate": "1997-09-29 00:00:00",
              "PHA_Date": "1999-06-03 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-02 00:00:00",
              "TrainingReviewDate": "1998-12-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-04-10 00:00:00",
              "EquipmentInspectionDate": "1996-04-11 00:00:00",
              "EquipmentTested": "Ammonia Storage Tank 1028E",
              "ChangeMgmtDate": "1998-09-18 00:00:00",
              "ChangeMgmtReviewDate": "1997-06-02 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-14 00:00:00",
              "AuditCompletionDate": "1999-12-30 00:00:00",
              "IncidentInvestigationDate": "1990-06-10 00:00:00",
              "InvestigationChangeDate": "1990-08-14 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-14 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-03 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-31 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1010,
                  "PreventionProgram3ID": 889,
                  "ProcessChemicalID": 3084
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2584,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-14 00:00:00",
    "ERTrainingDate": "1999-03-24 00:00:00",
    "CoordinatingAgencyName": "CALCASIEU PARISH LEPC",
    "CoordinatingAgencyPhone": "3184373500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2584,
      "SummaryText": "EXECUTIVE SUMMARY\nW. R. GRACE, LAKE CHARLES\n\nLDEQ Facility Number 17903\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe W. R. Grace facility has a long standing commitment to community and worker safety.  This commitment is evidenced by time and resources spent in training, safe design, operation and maintenance of all plant processes.  Commitment to designing, operating, and maintaining a safe process is policy, as well as the training and know-how to respond appropriately should a release occur.\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe W. R. Grace, Lake Charles facility is an inorganic chemical plant that manufactures synthetic fluid cracking and hydrotreating catalysts products.  These product lines have evolved since the plant was built in 1953 to meet the needs of crude oil refining.  The facility processes only one chemical (aqua ammonia-conc. 20% or greater) in quantities high enough to be regulated by the 112(r) rule.  This chemical is used in the plant to wash catalyst and control NOx emissions.  The maximum amount of aqua ammonia that can be stored on the plant site is 865,000 pounds.\n\nHAZARD ASSESSMENT RESULTS\n\nThe Worse Case Scenario (WCS) associated with a toxic substance in a Program 3 process at the facility is a catastrophic failure of a storage tank containing aqua ammonia.  This tank failure would spill 19,800 gallons of 27% aqua ammonia into a diked area.  Due to the accident prevention program in place, such a failure is extremely unlikely.  Credit for administrative and passive mitigation was taken while evaluating this scenario.  The administrative mitigation is control of storage tank inventory to a maximum of only 19,800 gallons, instead of the maximum tank capacity of 33,000 gallons.  The passive mitigation is a dike around all the storage tanks, which creates a containment area capable of holding in excess of 19,800 gallons.  The release of ammonia from the WCS is 78.55 lbs/min for 10 minutes, with a 3.4 mph"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2584,
      "SummaryText": "wind, temperature of 770 F, and class F stability in rural terrain.  Using the EPA Offsite Consequence Analysis Guidance document, the maximum distance to the toxic endpoint of 0.14 mg/l is 0.99 miles for the WCS.\n\nThe Alternate Release Scenario (ARS) for aqua ammonia (27%) is a rupture of the largest size distribution pipe (11/2 inch) at the pump discharge from the aqua ammonia storage tanks. The pump maximum capacity is 200 gallons per minute.  While this ARS may not be the most common, it was chosen to demonstrate that any other ARS would have less of an offsite impact. The liquid ammonia solution from the ARS forms a 1 cm deep liquid pool and ammonia is released at 393.8 lbs/min for 10 minutes.  Wind speed is 6.7 mph at 770 F with stability Class D in a rural or open terrain.  Using the EPA Offsite Consequence Analysis Guidance document, the maximum distance to the toxic end point of 0.14 mg/l is 0.62 miles for the ARS.\n\nFIVE YEAR ACCIDENT HISTORY\n\nOver the past 5 years there have been no releases of aqua ammonia that have caused enough adverse consequences to meet the criteria for historical reporting.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\n\nBecause the aqua ammonia process at the facility is regulated by the EPA RMP rule as a Program 3 process, the process is also subject to OSHA PSM.  Thus, under both EPA and OSHA, the aqua ammonia process is subject to an accident prevention program. The following is a summary of the Program 3 elements contained in the general accident prevention program in place at the Lake Charles facility.  \n\nEMPLOYEE PARTICIPATION:\n\nThe W. R. Grace facility encourages employees to  participate in all of the programs in the prevention program.  Employee participation is evident in accident investigation, Process Hazard Analysis (PHA), training programs, operating procedure review, and process safety information.  This open participation for employees is documented in the facility's written accident prevention or Process Saf"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2584,
      "SummaryText": "ety Management (PSM) program.\n\nPROCESS SAFETY INFORMATION:\n\nThe W. R. Grace facility creates and maintains documents related to maintaining a safe operation of the aqua ammonia process.  These documents contain information that addresses chemical properties, chemical hazards, limits for key process parameters, tank inventories, equipment design basis, materials of construction, design pressure, and temperature rating.  Other information on aqua ammonia, including exposure hazards and emergency response guidelines, is found on the Material Safety Data Sheets.  This information on aqua ammonia is maintained current to provide a basis for establishing inspections and maintenance activities, as well as being utilized during PHA's.\n\nPROCESS HAZARD ANALYSIS (PHA):\n\nThe W. R. Grace facility has a comprehensive program for reviewing the aqua ammonia process.  The program is a systematic examination of the process, which will identify hazards and ensure that adequate controls are in place to manage those hazards.\n\nA team of individuals representing safety, environmental, operations, maintenance, and engineering are assembled to conduct the analysis.  The team utilizes the what if and HAZOP techniques to evaluate the hazards and risks, and makes recommendations concerning specific findings.  The findings from PHA's are assigned to team members for final resolution.  The final resolution of each finding is documented and retained.  A PHA is done on the ammonia system at least every 5 years, or whenever the system is significantly altered or changed.\n\nOPERATING PROCEDURES:\n\nThe W. R. Grace facility maintains written procedures that address various modes of operation of the aqua ammonia process.  These modes include normal startup; normal operation; temporary operation; emergency shutdown; normal shutdown; and initial startup of the process with new or modified equipment.  These procedures are periodically reviewed and annually certified as current and accurate.\n\nTRAINING:"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2584,
      "SummaryText": "All employees operating and maintaining the aqua ammonia process are trained on a regular basis on the operating procedures and other aspects of the process.  New operators are classroom trained and then work with experienced operators to receive on the job training.  After new operators have demonstrated the necessary skills to safely operate the process they are allowed to operate independently.\n\nCONTRACTORS:\n\nThe W. R. Grace facility uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the facility has procedures in place to ensure that contractors receive training.  This training is accomplished by providing contractors with a process overview; information about safety and health hazards; emergency response plan requirements; and safe work practices prior to their beginning work.  In addition, the facility evaluates contractor safety programs and performance during the selection of a contractor.  Facility personnel periodically monitor contractor performance to ensure that contractors are following the necessary procedures.\n\nPRE-STARTUP SAFETY REVIEWS:\n\nAny time there is a significant change to the aqua ammonia process itself or the process safety information associated with the aqua ammonia process a pre-startup review is conducted.  This review will assure that the process and its personnel are prepared to startup.  Items reviewed include confirmation that construction is in accordance to design; operating procedures are developed; PHAs completed; management of change followed; and training conducted.  The final segment of the pre-startup review is a walk-through inspection of the process.\n\nMECHANICAL INTEGRITY:\n\nThe W. R. Grace facility has practices and procedures to maintain the integrity of the aqua ammonia process equipment to minimize the potential for an ammonia release to the environment.  The basic program includes maintenance train"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 2584,
      "SummaryText": "releases of ammonia gas.  The procedures include aspects of emergency response such as proper first aid, command structure, alarm system, evacuation plans, personnel accounting, notification of appropriate agencies, requests for assistance, and post incident activities.  Plant personnel are trained and drilled on the emergency program so they know their individual responsibilities during an emergency.\n\nThe overall emergency response program for W. R. Grace is coordinated with the Calcasieu Local Emergency Planning Committee, and the local hospital, police, and fire departments.  In addition, W. R. Grace is a member of the Mutual Aid Association of Southwest Louisiana, which shares equipment and personnel for emergency response; the Community Awareness Emergency Response Group (CAER), which assists in emergency training programs such as drills and provided many of the emergency alerting systems in the area; and the Lake Area Industry Alliance (LAIA), which communicates with area residents and businesses about mutual interests.  This parish-wide emergency response system was successfully drilled in 1998.\n\nThe W. R. Grace facility has 40 emergency responders with  9 to 10 team members on each shift.  The teams train on a regular basis and training includes response to ammonia releases.  The team uses equipment appropriate for ammonia emergencies including respiratory equipment and full body protective suits.  The facility is equipped with a unit and plant wide alarms, a radio system to other facilities, and an in-plant radio system with emergency channels.\n\nIn summary W. R. Grace has a fully integrated emergency response program capable of responding to emergency releases of ammonia."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2584,
      "SummaryText": "ing; written maintenance procedures; periodic inspections and tests of equipment; and correction of deficiencies found.  Equipment found to be deficient must be repaired before placing the equipment back in service.\n\nTo achieve quality assurance in equipment maintenance for the aqua ammonia process a quality assurance program is incorporated into the purchase, repair, and warehousing of spare parts.\n\nSAFE WORK PRACTICES-HOT WORK PERMIT:\n\nW. R. Grace has incorporated many safe work practices in the daily execution of business.  Examples include the lockout/tagout procedures, the confined space entry procedures, and the hot work permit procedures.  The hot work permit is used to control welding, cutting, brazing, and burning work in the aqua ammonia process area.  The hot work permit assures that a supervisor has checked the aqua ammonia process area for combustibles prior to hot work.\n\nMANAGEMENT OF CHANGE:\n\nThe W. R. Grace facility has a management of change procedure for the aqua ammonia process.  The procedure manages chemical, equipment, and procedural changes to the process to assure that any proposed change will not result in an undetected, unsafe condition. The proper level of authority ensures the change is safe and that a review of the change's effect on health, safety, and the environment is completed.  Training of all affected personnel is accomplished prior to the change occurring.\n\nINCIDENT INVESTIGATION:\n\nThe W. R. Grace facility has policy and procedures in place that call for a prompt investigation of all underlying causes that may have resulted in an aqua ammonia spill.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident, or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to facility management for resolution.  Corrective actions taken in response to the investigation team's find"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 2584,
      "SummaryText": "ings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs.\n\nCOMPLIANCE AUDITS:\n\nCompliance audits are performed on the aqua ammonia process risk management plan to determine how well the policies and procedures satisfy the requirements of the Risk Management Plan rule.  The audits are conducted at least every three years.  The audit findings are documented and forwarded to management for review.  All corrective actions required are tracked until completion.  Documentation of the audit procedures and the last two audits are maintained as part of the compliance audit program.\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe process at the W. R. Grace facility has many hazards that must be managed to ensure continued safe operation.  The prevention program summarized previously is applied to the aqua ammonia process.  This prevention program helps prevent potential ammonia releases, which could be caused by equipment failure and human errors.\n\nIn addition to the prevention program, the W. R. Grace facility has safety features on the aqua ammonia process which help control the process and mitigate the consequences of a release.\n\nProcess Controls\n\n1) Scrubbers to neutralize ammonia\n2) Automatic shutoff valves\n3) Manual shutoff valves\n\nRelease Mitigation\n\n1) Water deluge system\n2) Trained emergency response personnel\n3) Administrative controls on tank inventory\n4) Dikes\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe W. R. Grace facility maintains a written emergency response program for the purpose of protecting workers, public, and the environment should a chemical emergency occur.  The program includes procedures for responding to spills of aqua ammonia liquid and"
    }
  ]
}