{
  "FacilityID": 25938,
  "FacilityName": "JCC 88 - Parr",
  "FacilityStr1": "832 N 900 W",
  "FacilityStr2": null,
  "FacilityCity": "Rensselaer",
  "FacilityState": "IN",
  "FacilityZipCode": "47978",
  "Facility4DigitZipExt": "8614",
  "FacilityCountyFIPS": "18073",
  "LEPC": "Jasper County LEPC",
  "FacilityLatDecDegs": "41.024444",
  "FacilityLongDecDegs": "-87.219167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "not applicable",
  "FacilityEmailAddress": "not applicaable",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Jasper County Co-op",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jasper County Co-op",
  "OperatorStr1": "832 N 900 W",
  "OperatorStr2": null,
  "OperatorCity": "Rensselaer",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47978",
  "OperatorZipCodeExt": "8614",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000069855",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-06-15 00:00:00",
  "SafetyInspectionBy": "Indiana State Chemist",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-12-10 00:00:00",
  "DeRegistrationEffectiveDate": "2014-11-07 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.0246,
  "FRS_Long": -87.2191,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37033,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 25938,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 48439,
          "ProcessID": 37033,
          "ChemicalID": 56,
          "Quantity": 250000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 37936,
          "ProcessID": 37033,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 14412,
              "Process_NAICS_ID": 37936,
              "SafetyReviewDate": "2002-02-10 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2002-02-10 00:00:00",
              "ChangeCompletionDate": "2002-02-11 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-02-10 00:00:00",
              "TrainingReviewDate": "2002-02-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Competency",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-02-20 00:00:00",
              "EquipmentInspectionDate": "2002-02-20 00:00:00",
              "EquipmentTested": "PLumbing & Riser",
              "ComplianceAuditDate": "1998-08-25 00:00:00",
              "AuditCompletionDate": "1999-06-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2002-02-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "ANHYDROUS AMMONIA  Prevention Program Review: This facility implements a Prevention Program to minimize the risk of release, incident, or accident through the following activities: 1. Safety information is reviewed periodically, no less than annually. The Company employs a Safety Coordinator, who is shared with other like businesses; the Coordinator oversees training, safety, and conducts periodic site and equipment audits. Site Inspections are also carried out by the local fire department, and our loss control provider periodically inspects the site for compliance and safety. 2. The major hazards identified with the process include toxic release, stress corrosion , overfilling, equipment failure, earthquake, and tornado. Process controls, such as relief valves, check valves, manual shutoffs, alarms and procedures, and excess flow devices are utilized to minimize the potential for release.  3. Mitigation systems available include a deluge or water curtain provided by the responding fire department in the event of a release which would \"knock down\" the vapor cloud and neutralize the ammonia. 4. Employees are trained on an initial and ongoing basis. Employee Training is provided as well as periodic refresher training available from our Safety Coordinator, industry seminars, and vendor programs. Competency is measured through written and oral testing, demonstration (hands-on), and observation.  5. Maintenance programs are in place. Items are replaced if they fail, present a risk to the user, are required by law or standard, are out-of-date,  or if a system or process is changed or upgraded. OSHA 1910.111 standards are used to identify those needs. The Indiana State Chemist also makes periodic unannounced visits to our facility to inspect equipment, tanks, and safety training (they do not always leave documentation). In addition, employees utilizing the equipment on a nearly daily basis informally inspect the equipment for leaks, cracks, soundness, etc.",
              "_chemicals": [
                {
                  "PrimaryKey": 15087,
                  "PreventionProgram2ID": 14412,
                  "ProcessChemicalID": 48439
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 25938,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-08-01 00:00:00",
    "ERTrainingDate": "2002-02-26 00:00:00",
    "CoordinatingAgencyName": "Rensselaer Fire Chief",
    "CoordinatingAgencyPhone": "2198665221",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Indiana State Chemist"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 25938,
      "SummaryText": "JCC 88 - Rensselaer, In\n\nCertification Statement for the Risk Management Plan, Program 2, Anhydrous Ammonia\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable evaluation and by actual knowledge of the facility and process, the information submitted is true, accurate, and complete.\n\nBill Wenglarz\n\nLocation Manager        \nupdated May 19, 2002\n\nExecutive Summary - Anhydrous Ammonia\n\nDescription of our Facility and the Regulated Substances Handled:\n\nThis facility is a wholesale farm supply distribution center. We store and distribute a wide variety of pesticides and fertilizers including anhydrous ammonia. Anhydrous ammonia is received by truck and rail, is handled and stored on-site. We sell anhydrous ammonia to grower customers in either 1,000 gallon or 1450 gallon nurse tanks. The customer applies the ammonia into the soil as a source of nitrogen fertilizer for growing agricultural crops. We also occasionally fill anhydrous ammonia transport trailers which deliver ammonia to other JACO LLC locations.\n\nThis facility maintains approximately 43- 1,000-gallon nurse tanks and 7-1450-gallon nurse tanks for customer delivery.  Anhydrous ammonia is stored in 1 stationary storage tank [1 @ 18,000 gallons] on site. 1 X 100 ton anhydrous ammonia rail car filled to 80% capacity can also be unloaded into the stationary storage tank.  When the rail car is coupled to the 18,000 gallon storage tank filled to 85% capacity, the maximum worse case release would be 244,000 pounds. \n\nWorst Case Scenario:\n\nOur worst case scenario is the loss of the total contents of the 18,000 gallon storage tank coupled to the rail tank car during unloading activities when filled to the greatest amount allowed (85% of capacity), released as a gas over 10 minutes, resulting in total vaporization. The maximum quantity released would be 244,000 pounds. According to DEGADIS modeling, this release (distance from point of dispersion to 200 ppm) would have off-site impact. \n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 25938,
      "SummaryText": "\nAlternative Release Scenario:\n\nThe most common alternative release scenario from our facility would not reach an end point off-site. The alternative release scenario modeled for the purpose of this plan is a 2-minute release from a stationary storage tank representing a valve and hose failure requiring a manual shut down.  The total amount of anhydrous ammonia released in this scenario would be 12,000 pounds. This release scenario (distance from point of dispersion to 200 ppm) would have off-site impact.  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\nThe anhydrous ammonia system is designed, installed, and maintained in accordance with ASTM standards and ASME codes. This facility generally complies with the ANSI K 61.1 standards (1989), OSHA (29 CFR 1910.111), EPA's Accidental Release Prevention Rule, and all applicable federal, state, and local codes and regulations.\n\nOur ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shutoffs, and emergency shutoff valves. The load-out risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediately stop the flow of ammonia if a line or a hose fails. All main storage tank valves and riser valves are locked when not in use.\n\nOur ammonia system is inspected on a regular basis with maintenance and preventive maintenance scheduled and documented. Liquid and vapor valves, hoses, excess flow valves, gauges, and relief valves are replaced when necessary and according to the guidelines in the ANSI standards.\n\nTraining is provided to all employees at least annually, whenever there is a change in the process, or whenever competency with the regulations is questioned. The training consists of classroom lecture, current videos, testing and certification, and on the job training.\n\nFive-year Accident History:\n\nThere have been no accidents involving anhydrous ammonia th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 25938,
      "SummaryText": "at caused deaths, injuries, property or environmental damage, including evacuations on or off-site.\n\nEmergency Response Program:\n\nThis facility has an emergency action plan, in accordance with OSHA standard 1910.38. We have  coordinated response actions with the Rensselaer Fire Department, including pre-emergency planning and emergency training. We have discussed this program with the Jasper County Local Emergency Planning Committee, and our  facility is included in the county emergency plan. In the event of a release of regulated substances, our employees have been instructed on the  procedures for notification of the local fire authority (Rensselaer Fire Department), emergency personnel,  and notification of any potentially affected neighbors. \n\n\n7. Planned changes to improve safety.\n\nThis facility was constructed in 1978. Safety improvement is an ongoing process at our facility. Periodic evaluations are performed to assess the maintenance of safe conditions. This facility is  in compliance with the OSHA 29 CFR 1910.111 standard. The Indiana State Chemist also requires us to have the facility in full compliance with the new state regulations by February 1, 2003. Any updates or improvements  required by this change will be implemented as soon as possible..In the event of an emergency involving our ammonia system, it is our policy to notify the local community fire department and request that they respond to the emergency. In preparation for this, we have coordinated with all of the local response agencies by providing information and facility tours to ensure that they are familiar with and properly prepared for an incident at our facility. This will help to ensure that our community has the strategy for responding to and mitigating the threat posed by an ammonia release. This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our LEPC."
    }
  ]
}