{
  "FacilityID": 2598,
  "FacilityName": "Ashby Equity Association",
  "FacilityStr1": "County Road 82",
  "FacilityStr2": null,
  "FacilityCity": "Ashby",
  "FacilityState": "MN",
  "FacilityZipCode": "56309",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27051",
  "LEPC": null,
  "FacilityLatDecDegs": "46.09",
  "FacilityLongDecDegs": "-95.811417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ashby Equity  Association",
  "OperatorStr1": "100 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Ashby",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56309",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Kloos",
  "RMPTitle": "General Manager",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000031814",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-15 00:00:00",
  "SafetyInspectionBy": "Insurance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 46.09887,
  "FRS_Long": -95.8174,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2904,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 2598,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 2968,
          "ProcessID": 2904,
          "NAICSCode": "115112",
          "_desc": {
            "NAICS_CODE": "115112",
            "NAICS_DESCRIPTION": "Soil Preparation, Planting, and Cultivating"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3100,
          "ProcessID": 2904,
          "ChemicalID": 56,
          "Quantity": 113727.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503100,
          "ProcessID": 2904,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2598,
      "SummaryText": "     Executive Summary -Ashby Equity Association (Ammonia)\n                           Ashby, MN \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at Ashby Equity Association are strongly committed to employee, public, and environmental\nsafety.  This commitment is an inherent part of our comprehensive accidental release prevention\nprogram that covers areas such as design, installation, operating procedures, maintenance, and\nemployee training associated with the processes at our facility.  It is our policy to implement\nappropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a\nrelease does occur, our trained emergency response personnel are at hand to control and mitigate the\neffects of the release.    We are also coordinated with the Ashby Fire Department which provides\nadditional emergency response expertise.\n\n  2. The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities includes support services  for crop production.  We have Anhydrous\nAmmonia  stored in a 26,000 gallon tank at our facility located in Ashby (Figure 1).  The maximum\namount stored is 22,100 gallons (113,726.6 lbs.) at the maximum fill capacity of 85%.\n\n  3. The Worst Case Release Scenario and the Alternative Release Scenarios\nTo perform the required offsite consequence analysis for our facility, we utilized RMP PRO for the\nworst case and alternate case scenarios. The following paragraphs provide details of the chosen\nscenarios.\n\nThe worst case release scenario involves a catastrophic release of the entire contents of the\nanhydrous ammonia storage tank (113,726.6 lbs.) in gaseous form over 10 minutes.   At Class F\natmospheric stability, 1.5 m/s windspeed  and an urban topography, the maximum distance of 4.8 \nmiles is obtained corresponding to a toxic endpoint of 0.14 mg/L (Figure 2).\n\nThe alternative release scenario involves a release from a anhydrous ammonia product lin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2598,
      "SummaryText": "e. The\nscenario involves the release of 7995.83 pounds. of ammonia in a gaseous form over 30 minutes. \nUnder neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L of\nAmmonia is 0.31 miles (Figure 3).\n\n\n  4. The General Accidental Release Prevention Program\nOur facility has taken all the necessary steps to comply with the accidental release prevention\nrequirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe\nthe elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\nAshby Equity Association maintains a detailed record of safety information that describes the\nchemical hazards, operating parameters and equipment designs associated with all processes\n(Appendix E).\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled efficiently.  Any findings related to the hazard analysis are addressed in a\ntimely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Ashby Equity\nAssociation  maintains written operating procedures.  These procedures address various modes of\noperation and the information is regularly reviewed and is readily accessible to operators involved\nin the processes (Appendix B).\n\nTraining\nAshby Equity Association has a comprehensive training program in place to ensure that employees\nwho are operating processes are competent in the operating procedures associated with these\nprocesses (Appendix C).\n\nMechanical Integrity\nAshby Equity Association maintains highly documented maintenance checks on process equipment\nto ensure proper operations.  Process equipment examined by these checks includes among others;\npressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown\nsystems, controls and pumps.  Maintenance operations are carried out by qualified personnel "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2598,
      "SummaryText": "with\nprevious training in maintenance practices.  Any equipment deficiencies identified by the\nmaintenance checks are corrected in a safe and timely manner (Appendix D).\n\nManagement of Change\nWritten procedures are in place at Ashby Equity Association to manage changes in process\nchemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any\nother employee whose job tasks are affected by a modification in process conditions are promptly\nmade aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nAshby Equity Association  routinely conducts pre-startup safety reviews related to new processes\nand to modifications in established processes. These reviews are conducted to confirm that\nconstruction, equipment, operating and maintenance procedures are suitable for safe startup prior\nto placing equipment into operation.\n\nCompliance Audits\nAshby Equity Association has compliance audits conducted on a regular basis to determine whether\nthe provisions set out under the RMP rule are being implemented.  If the compliance audit discover\nnon-compliances  in the system, they are promptly corrected.\n\nEmployee Participation\nAshby Equity Association truly believes that process safety management and accident prevention\nis a team effort.  Company employees are strongly encouraged to express their views concerning\naccident prevention issues and to recommend improvements.  In addition, our employees have access\nto all information created as part of the facility's implementation of the RMP rule, particularly\ninformation resulting from process hazard analyses.\n\n  5. Five-year Accident History\nAshby Equity Association has had an excellent record of preventing accidental releases over the last\n5 years.  Due to our stringent release prevention policies, there has been no accidental release during\nthis period.\n\n  6. Emergency Response Plan\nAshby Equity Association carries a written emergency response plan to deal with accidental rele"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2598,
      "SummaryText": "ases\nof hazardous materials.  The plan addresses  all aspects of emergency response including first aid\nand medical treatment, evacuations, and notification of local emergency response agencies and the\npublic (Appendix A).\n\n  \n"
    }
  ]
}