{
  "FacilityID": 26052,
  "FacilityName": "CS Integrated Retail Services -  Bouldercrest",
  "FacilityStr1": "3475 International Park Drive",
  "FacilityStr2": null,
  "FacilityCity": "Atlanta",
  "FacilityState": "GA",
  "FacilityZipCode": "30316",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13089",
  "LEPC": "Georgia State DNR",
  "FacilityLatDecDegs": "33.682278",
  "FacilityLongDecDegs": "-84.321667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "CSICold.com",
  "FacilityEmailAddress": "CSICold.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "CS Integrated LLC",
  "Company2Name": "Prologis",
  "CompanyDUNS": 73627341,
  "Company2DUNS": 878064807,
  "OperatorName": "CS Integrated LLC",
  "OperatorStr1": "701 Martinsville Rd",
  "OperatorStr2": null,
  "OperatorCity": "Liberty Coener",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07938",
  "OperatorZipCodeExt": null,
  "FTE": 235,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028695",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-03-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 33.68544,
  "FRS_Long": -84.32153,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37208,
      "AltID": "Ammonia Refrigeration #1",
      "FacilityID": 26052,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 48765,
          "ProcessID": 37208,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38115,
          "ProcessID": 37208,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20816,
              "Process_NAICS_ID": 38115,
              "SafetyReviewDate": "2002-02-03 00:00:00",
              "PHA_Date": "2001-07-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-08-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-11-28 00:00:00",
              "TrainingReviewDate": "2001-11-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Factory Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-11-29 00:00:00",
              "EquipmentInspectionDate": "2002-06-03 00:00:00",
              "EquipmentTested": "Refrigeration System Components",
              "ChangeMgmtDate": "2001-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2001-11-29 00:00:00",
              "PreStartupReviewDate": "2001-09-15 00:00:00",
              "ComplianceAuditDate": "2000-01-27 00:00:00",
              "AuditCompletionDate": "2000-01-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-11-29 00:00:00",
              "HotWorkPermitReviewDate": "2001-11-29 00:00:00",
              "ContractorSafetyReviewDate": "2002-02-03 00:00:00",
              "ContractorSafetyEvalDate": "2001-11-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30445,
                  "PreventionProgram3ID": 20816,
                  "ProcessChemicalID": 48765
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26052,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-02-06 00:00:00",
    "ERTrainingDate": "2002-02-06 00:00:00",
    "CoordinatingAgencyName": "Georgia State DNR",
    "CoordinatingAgencyPhone": "8002414113",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26052,
      "SummaryText": "Executive Summary\n\n\nCS INTEGRATED LLC\n\nAtlanta - Bouldercrest\n\nEXECUTIVE SUMMARY OF\nTHE EPA RISK MANAGEMENT PLAN\n\n\nCS Integrated Management has elected to implement the requirements of the Risk Management Plan at all locations in order to operate each facility in accordance with regulations and support of best industry standards.  The ultimate objective is to minimize the risk of an accidental ammonia release.  The facility management has developed an Emergency Response Plan along with training to ensure a fast and efficient response in the event of an accidental hazardous material release, fire or other emergency situation.\n\nIn order to prevent a potential accidental ammonia release at any CS Integrated facilities, the Company has an ongoing review process for design and operating procedures.  This assists in ensuring the refrigeration systems comply with OSHA, EPA and other local, state and federal regulatory agency safety standards, as well as its own internal standards.\n\nCS Integrated has a rigorous emergency response training program that follows the guidelines of federal, state and local regulatory agencies.  The management believes that cooperative emergency response training must include company employees, local emergency responders and regulatory agency people in order to provide a safe workplace and a safe environment.  In an emergency, all personnel are trained to cooperate with fellow employees and other support personnel as directed by the Emergency Response Incident Commander.\n\nCS Integrated Bouldercrest is a refrigerated warehousing facility.  The large majority of products stored are refrigerated foods for human consumption and inherently pose no known environmental or safety risks.  Ammonia, a regulated substance, is the commonly used refrigerant in industrial refrigeration systems that maintain low storage temperature and can be safely managed by trained operators.  The ammonia refrigeration process functions within a closed piping network servi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26052,
      "SummaryText": "ng the facility operations.  The refrigeration system in this facility contains approximately 18000 pounds of ammonia inventory for this process.\n\nIn accordance with the EPA's requirements, various accidental release scenarios are performed in order to develop a radius of potential impact around the facility.  The primary purpose of this is to assist the local Emergency Planning Commission with additional information if an accidental release was to occur.  The release model used was the EPA supplied RMP *Comp, CS Integrated also uses ALOHA for internal training on release modeling. \n\nIn the worst case scenario, a pipe at the high pressure receiver liquid outlet is broken allowing the entire liquid ammonia charge of that receiver to be released in ten minutes.\n\n-2-\n\nBased on the RMP *Comp models, this scenario could have a potential offsite area of concern extending to a radius of .9  mile.\n\nIn an alternate scenario, a relief valve opens from some process upset and allows a ten minute release of ammonia gas from the high pressure receiver. Based on the RMP * Comp model, this scenario could present a potential offsite area of concern extending to a radius of .1 miles.\n\nThese release scenario plans are maintained at the site and are used for training and provide information for Responders and for the LOCAL EMERGENCY PLANNING COMMITTEE.\n\nCS Integrated is committed to a safe management and operation of the closed Ammonia Refrigeration System.  Maintenance employees are trained to observe operational procedures designed to be as fail-safe as possible to prevent accidental release of ammonia at any time.  Should any accidental release occur, all maintenance employees are certified Emergency Hazardous Material Responders and are required to observe safe emergency response procedures.  \nThey are trained to work in conjunction with the local Emergency Planning Commission to minimize the impact of any accidental release.\n\nAs part of CS Integrated's safety program, we have adop"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26052,
      "SummaryText": "ted the OSHA Process Safety Management Plan as an integral part of our base safety manual.  The OSHA PSM Program has been implemented and covers the entire scope of safe operation procedures of the ammonia refrigeration system from start-up and normal operations to potential emergency response operations and subsequent clean-up and restoration of systems.  Normal operations rely on the following:\n\nØ The Maintenance Management Procedures are used to perform preventive maintenance and to maintain records of all maintenance work performed.  This helps to ensure that the closed ammonia system continues to work safely, reliably and efficiently in the originally intended manner.  \n\nØ Any set specifications of systems temperature, pressure, level or power interruption, that are exceeded or violated will normally trigger an alarm and safety shutdown.  Maintenance technicians are notified of a deviation from normal operation specifications through indicator or alarm systems.\n\nØ In the event of deviations, technicians are trained to analyze the situation, follow personal safety procedures at all times, determine that everything is under control and correct problems and/or deviations.\n\nØ If a problem cannot be corrected immediately, the equipment needing repair service will be safely locked out of service until such time as repairs have been completed.\n\n-3-\n\nØ If a problem cannot be safely handled by the Maintenance Personnel, procedures are in place to obtain the required resources to correct the situation.\n\nDuring the past five years there have been no accidental releases at this facility.\n\n\nEMERGENCY RESPONSE OPERATIONS READINESS INCLUDES THE FOLLOWING PROGRAMS:\n\nØ Written procedures for emergency operations include emergency evacuation procedures, emergency shutdown instructions, emergency response training expectations, emergency response unit coordination plans, regulatory agency notification and other pertinent information.\n\nØ The emergency Response Plan is for managing"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26052,
      "SummaryText": "emergency responses.  It identifies response teams, assigns specific emergency tasks to each team, provides emergency contact information and sets up procedures for recovery of information systems.  It also provides forms for logging emergency operations from beginning to end of these operations and forms to facilitate a systematic incident investigation and corrective measures to prevent recurrence of a similar incident.\n\nØ The emergency Response Training program includes all maintenance employees and local emergency responders.  This establishes an effective and informed emergency response team that is familiar with systems and potential hazards in each CS Integrated facility.\n\nIt is the intent of CS Integrated to not only meet any regulatory requirement, but also take a pro-active approach into implementing these requirements as part of a working safety plan.  CS Integrated is in a constant review process of its operations and industry standards to provide a safe working environment for our employees, customers and neighbors.\n\nAlthough this facility is below the threshold requirement for filing purposes, CS Integrated has elected to complete these forms as part of its internal safety policy.  In order to insure consistent safety practices for all sites, CS Integrated establishes OSHA Process Safety Management, EPA Risk Management and Industry Standards as integral parts of its safety programs.  Therefore new acquisitions are in standard safety practices."
    }
  ]
}