{
  "FacilityID": 26055,
  "FacilityName": "Dreisbach Enterprises - Watsonville facility",
  "FacilityStr1": "1276 Highway 1",
  "FacilityStr2": null,
  "FacilityCity": "Moss Landing",
  "FacilityState": "CA",
  "FacilityZipCode": "95039",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.864306",
  "FacilityLongDecDegs": "-121.770917",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.dreisbach.com",
  "FacilityEmailAddress": "info@dreisbach.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Dreisbach Enterprises",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dreisbach Enterprises",
  "OperatorStr1": "2530 East Eleventh Street",
  "OperatorStr2": "P.O. Box 7590",
  "OperatorCity": "Oakland",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94601",
  "OperatorZipCodeExt": "1425",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075143",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.856918,
  "FRS_Long": -121.777,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37211,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 26055,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 48768,
          "ProcessID": 37211,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38118,
          "ProcessID": 37211,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20818,
              "Process_NAICS_ID": 38118,
              "SafetyReviewDate": "2002-02-11 00:00:00",
              "PHA_Date": "2002-01-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "ownership change",
              "OpProceduresReviewDate": "2002-03-12 00:00:00",
              "TrainingReviewDate": "2002-06-14 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-04-12 00:00:00",
              "EquipmentInspectionDate": "2001-02-01 00:00:00",
              "EquipmentTested": "overhauled compressors C1 - C6",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-01-11 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-09-05 00:00:00",
              "AuditCompletionDate": "2002-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-03-31 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2002-03-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30447,
                  "PreventionProgram3ID": 20818,
                  "ProcessChemicalID": 48768
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26055,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Watsonville Fire Department",
    "CoordinatingAgencyPhone": "8317286060",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 26055,
      "SummaryText": "heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  Typical operating conditions range from vacuum (approximately 6 Hg) on the low pressure side of the system to 150-160 psig on the high side.\n\nAmmonia is used as the refrigerant in the refrigeration process.\n\nThe total ammonia inventory is 19,500 pounds.  \n\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\n\nThe worst case release for this facility was that of the maximum quantity of ammonia that can be stored in a vessel.  The largest vessel is the blast freezer low pressure receiver, which is located inside the engine room. This vessel can hold 15,120 pounds of ammonia.  Utilizing the mitigation factor of 55% since the vessel is located inside a building, the release rate is 832 pounds/minute over a 10 minute duration.  The high pressure receiver, on the other hand is smaller, but located outside.  The release rate from the high pressure receiver is 979 pounds/minute. The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  The facility is located in a rural setting.  The downwind distance to 200 ppm was determined using Exhibit 4-4 from the EPA Risk Management Program Guidance for Ammonia Refrigeration, November 1998.  The release reaches off-site and may affect population and environmental receptors.  \n\nAlternative Release Result Summary\n\nThe alternative release scenario was that of a 0.25 inch diameter leak of high pressure gas ammonia for one hour.  This scenario was chosen because the facility has high pressure gas lines external to the facility and a 0.25 inch leak could be caused by a flange seal leak or a valve packing leak.  The quantity of ammonia released in one hour at this rate (134 lbs/minute) is 8,040 pounds.  The meteorological conditions used were 3 meters/second wind speed, and D stability. The facility is l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26055,
      "SummaryText": "ocated in a rural setting.  The downwind distance to 200 ppm was determined using Exhibit 4-5 from the EPA Risk Management Program Guidance for Ammonia Refrigeration, November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n¿  IIAR Bulletin 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\n¿  IIAR Bulletin 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System\n¿  IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\n¿  IIAR Publication R-1, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\n\nIn addition, the Dreisbach - Watsonville facility has implemented a Process Safety Management program for compliance with the Cal-OSHA 5189 regulation since April 1994.\n\nEngineering Measures\nThe ammonia refrigeration system employed by the Dreisbach - Watsonville facility is equipped with a computer which monitors and  controls the system.  The computer system is connected to controls and status indicators throughout the refrigeration system intended to minimize potential ammonia related accidents and to allow operators to monitor system operations.  This monitoring system is comprised of liquid level controls, pressure and temperature controls and indicators, as well as other system safeguards and methods for allowing the computer (or facility operators) to effectively monitor and control refrigeration operations.\n\nFIVE YEAR ACCIDENT HISTORY\n\nBetween January 1995 and January 2002, there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no i"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26055,
      "SummaryText": "dual relief valve manifold.\n\nR15  As long as Dock Evaporators are not in use, consider removing liquid ammonia from liquid line between accumulator and coils.  Lock and tag as out of service.\n\nR16  Consider the feasibility of adding a second level setting on ammonia detector to give the energy management system the capability to automatically de-energize the engine room.\n\nR17  On an annual basis, trip the high level float switches to ensure that they shut off compressors and the low level switches to ensure they shut off pump.  Include in Mechanical Integrity program.\n\nR18  Develop a written oil draining procedure to be followed.  Train all maintenance operators and document training.  \n\nR19  Periodically verify level probes are functioning properly by calibrating against site glasses.  Include in Mechanical Integrity program.\n\nR20  Develop written operating procedures for routing excess liquid from -25F Pump Receiver.\n\nR21  Ensure pumps are maintained as per manufacturer's recommended maintenance schedule.  Include in Mechanical Integrity program.  \n\nR22  Ensure that all evaporator coils are periodically maintained by cleaning the pans and coils per IIAR Bulletin 110 Guidelines.  Include in Mechanical Integrity program.\n\nR23  Prepare operating procedures for water defrost of Blast Freezer Coils.  Include in Operating Procedures program.\n\nR24  Follow compressor manufacturer's recommended maintenance program.  Include in Mechanical Integrity program.\n\nR25  Consider conducting annual oil testing of compressors.\n\nR26  Include at least an annual test to verify compressor shut down safeties are functioning properly.    Include in Mechanical Integrity program\n\nR27  Include condenser maintenance, such as cleaning the pan, eliminators, and spray nozzles, in written program and ensure it is in compliance with IIAR Bulletin 110 Guidelines.  Include in Mechanical Integrity program.\n\nR28  Implement policy to have maintenance inform someone on the ground before and after perform"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 26055,
      "SummaryText": "ing work on roof.\n\nR29  Consider a valve numbering system that will be consistent across all Dreisbach facilities. \n\nR30  Develop written ammonia fill procedures.  Include in Operating Procedures program.\n\nR31  Periodically test and calibrate ammonia detectors as recommended by detector manufacturer or at a minimum, every six months.  Include in Mechanical Integrity program.\n\nR32  Post emergency telephone numbers, names and job titles near telephones.\n\nR33  Label King Valve and other key emergency valves\n\nR34  Consider adding ammonia warning signs on exterior side of all engine room doors."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26055,
      "SummaryText": "an ammonia leak, 4) where to go when they are told to evacuate.  Document the training.\n\nR02  Communicate with tenant so they are aware of the following: 1) ammonia piping is located through their space, 2) what to do if they smell ammonia, and 3) that they are responsible for having their own emergency response and evacuation plan.\n\nR03  Maintain records to document relief valve replacement so a 5-year replacement schedule is established.  Include in Mechanical Integrity program.\n\nR04  Conduct annual visual inspections of vessels, paint and repair any signs of corrosion as necessary.  Include in Mechanical Integrity program.\n\nR05  Develop written start up procedures following a power outage.\n\nR06  Recommend contacting Monterey County Fire Department to familiarize them with the facility layout and Dreisbach's emergency response policy (Dreisbach Watsonville is a non-responding facility).\n\nR07  Consider the feasibility of installing an eyewash/shower station outside engine room door.\n\nR08  Conduct monthly testing of eye wash stations/showers and other emergency equipment.    Include in Mechanical Integrity program.\n\nR09  Develop safe practices by having eye protection, gloves, protective clothing, etc. available for use by maintenance. \n\nR10  Consider implementing a policy to carry an eye wash bottle when performing maintenance on ammonia equipment located some distance from eye wash station.\n\nR11  Establish a policy that requires two people and a planning meeting when preparing to conduct a non-routine maintenance or operation procedure.\n\nR12  Implement a policy to not store any excess materials inside engine room, such as pallets, extra oil, or other flammable materials.  \n\nR13  Annually inspect vessel insulation to ensure the integrity of the vapor seal.  Repair any damaged insulation.  Include in Mechanical Integrity program.\n\nR14  During the next 5-year relief valve replacement interval, consider replacing the single relief valve on the Dock Accumulator with a"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 26055,
      "SummaryText": "The Dreisbach - Watsonville facility abides by the emergency response procedures and policies detailed in the Response Plan for On-Site Emergency Operations manual.  This Plan was designed to meet the following objectives:\n\n1.)  To save lives.\n2.)  To minimize and avoid injuries.\n3.)  To protect the environment.\n4.)  To minimize property damage.\n\nDreisbach - Watsonville facility maintains an emergency response committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe ammonia refrigeration system at the Dreisbach - Watsonville facility provides cooling for several cold storage and dock areas.  Different temperatures are maintained by running two suction pressures with different sets of compressors.  The majority of the refrigeration system is located in the compressor room. Evaporator valves and piping are mounted in their respective cold storage/process zones and the condensers and high pressure receiver are located outside.\n\nThe refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for process equipment and cold storage rooms.  Changes in pressure are directly related to changes in temperature.  For example, lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing ambient"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26055,
      "SummaryText": "njuries resulting from an ammonia release.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Dreisbach - Watsonville facility has a Response Plan for On-Site Emergency Operations. This Plan outlines the policies and procedures in place to respond to potential ammonia alarms or releases.  Dreisbach - Watsonville facility's policy is to contact 9-1-1 in the event of an ammonia release.  The facility has several trained personnel to assist in an orderly evacuation as well as to diagnose the alarm condition.  There are three Operations Level trained employees at the facility. These employees have completed the OSHA 8 Hour Operation Level Training program and participate in 8 hour annual refresher training classes.  The facility has a close relationship with the Watsonville Fire Department who are extremely aware of the physical properties and hazards associated with ammonia.\n\nThe Response Plan for On-Site Emergency Operations includes the facility emergency coordinators, the staff alerting list, emergency notification list, and the hazardous materials agency notification and procedures.  This Plan then proceeds to detail the procedures for employees and management in the event of a fire, evacuation, compressor room shut down, earthquake, blackout, and ammonia release/clean-up.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA), including a Hazard and Operability (HAZOP) study, and a Facility Inspection, provided mitigation measures to improve safety at Dreisbach - Watsonville facility.  Many of the recommendations are complete and implemented with all recommendations scheduled to be complete by June 2003.  A seismic assessment will also be conducted in the near future to ensure seismic adequacy of the refrigeration equipment.\n\nR01  Conduct an ammonia awareness training program that includes informing all employees of the following: 1) the presence of and the hazards associated with ammonia at the facility, 2) how to recognize the odor, 3) what to do if they observe"
    }
  ]
}