{
  "FacilityID": 26066,
  "FacilityName": "Fourth Creek Wastewater Treatment Plant",
  "FacilityStr1": "1500 Lyons Bend Road",
  "FacilityStr2": null,
  "FacilityCity": "Knoxville",
  "FacilityState": "TN",
  "FacilityZipCode": "37919",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47093",
  "LEPC": "Knox County LEPC",
  "FacilityLatDecDegs": "35.916944",
  "FacilityLongDecDegs": "-83.9875",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kub.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Knoxville Utilties Board",
  "Company2Name": null,
  "CompanyDUNS": 626000324,
  "Company2DUNS": 626000324,
  "OperatorName": "D. Wayne Loveday",
  "OperatorStr1": "PO Box 59017",
  "OperatorStr2": null,
  "OperatorCity": "Knoxville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37950",
  "OperatorZipCodeExt": "9017",
  "FTE": 1,
  "OtherEPAFacilityID": "TN0023574",
  "EPAFacilityID": "100000084963",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-02-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-06-24 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 35.91598,
  "FRS_Long": -83.99058,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37241,
      "AltID": "Wastewater Treatment",
      "FacilityID": 26066,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 48799,
          "ProcessID": 37241,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38148,
          "ProcessID": 37241,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20831,
              "Process_NAICS_ID": 38148,
              "SafetyReviewDate": "2002-05-16 00:00:00",
              "PHA_Date": "2002-05-17 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "sabotage or vandalism",
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-05-26 00:00:00",
              "TrainingReviewDate": "2002-05-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-05-26 00:00:00",
              "EquipmentInspectionDate": "2002-05-24 00:00:00",
              "EquipmentTested": "Chlorine scrubber system",
              "ChangeMgmtDate": "2001-10-17 00:00:00",
              "ChangeMgmtReviewDate": "2002-05-26 00:00:00",
              "PreStartupReviewDate": "2001-10-30 00:00:00",
              "ComplianceAuditDate": "2002-05-16 00:00:00",
              "AuditCompletionDate": "2002-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-05-26 00:00:00",
              "HotWorkPermitReviewDate": "2002-05-26 00:00:00",
              "ContractorSafetyReviewDate": "2002-05-26 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Plant Description:\nFourth Creek WWTP is located adjacent to Lakeshore Mental Health Hospital, off Lyons Bend Road in Knoxville Tennessee. The plant is an ?activated? secondary wastewater plant.  The plant serves the Ten Mile Creek Pump station, which includes wastewater flow generated from West Knox Utility District and first Utility District.\n\nPrevention Program Overview:\nKUB?s accidental release prevention program is based upon OSHA?s Process Safety Management Standard, 29 CFR 1910.119 and addresses the following 10 elements tailored to our facility's operations. In accordance with the Process Safety Management provisions incorporated into the Risk Management Program, KUB promotes prevention programs in each of the major areas below: \n\nManagement System\nThe major hazards (e.g., equipment failure, human error, natural phenomena, or a combination of such factors which could lead to a significant accidental release) are identified through the process hazard analysis. The consequences of a failure to control each identified hazard are included in the Process Hazard Analysis documentation for each covered facility.\n\nProcess Hazard Analysis\nThe process hazard analysis is the foundation for the remaining elements of the prevention program. KUB?s program uses a team approach and an integrated management system to evaluate the hazards present at the facility and find the best ways to control these hazards. There are various safety and mitigating systems, emergency alarms, and evacuation plans which are utilized to eliminate or reduce the consequences of an off site release.\n\nActive Mitigation Systems/Control Measures\nThe chlorine scrubber system is a once-through, three-stage absorption system designed to contain and safely evacuate a major chlorine leak while maintaining toxic vapor emissions below the Uniform Fire Code requirement of 1/2 the IDLH (immediately dangerous to life and health) value at all times.  To accomplish this, the scrubber removes >99.99% of the toxic vapor in the air while maintaining a negative pressure in the chlorine storage room.  The scrubber system consists of  3 horizontal cross-flow packed bed sections. The caustic storage tank is an integral part of the system and is located below the scrubber adsorber sections. The recirculation pump pulls caustic solution from the storage tank and circulates it through the 3 stages, allowing the vapor-laden gases to be absorbed into the caustic in order to discharge vapor-free air through the stack.  Another safeguard in the system is the use of a chlorine vapor detector, exhaust fans and emergency alarms.\n\nProcess Safety Information\nKUB?s prevention program enables KUB employees involved in Plant Operations to identify and understand the hazards posed by those processes involving the use of chlorine. The process safety information includes material safety data sheets (MSDS), information pertaining to the hazards of chlorine used in plant processes, process flow diagrams, information pertaining to the technology of processes (i.e., process chemistry, process parameters), and information pertaining to the equipment in processes (i.e., equipment specifications and design, piping and instrumentation drawings).\n\nStandard Operating Procedures (SOPs)\nKUB has developed SOPs to document the safe and proper way to operate and maintain processes and equipment, and to handle, use and/or store chlorine at each covered facility.  Procedures are based upon the process hazard analysis (hazard evaluation) information, past operating experience, manufacturers' recommendations, and applicable and appropriate codes and standards. Process modification and facility complexity is considered whenever SOPs are developed, reviewed and/or modified.\n\nEmployee Training\nKUB water and wastewater plant personnel  receive HAZWOPER training at the Hazardous Material Technician competency level.  Personnel are trained in all aspects of KUB?s emergency response plan, to include: potential emergencies, personnel roles and responsibilities, evacuation routes and procedures, and the location of emergency response equipment. Trained personnel receive annual refresher training, including emergency response drills and exercises.  Documentation of all training is maintained by KUB?s Learning Center.\n\nMechanical Integrity\nKUB?s preventive maintenance program determines and targets the specific equipment that is identified through the process hazard analysis (hazard evaluation) or through operating experience as needed.  The procedures for preventive equipment maintenance, inspection, and testing are documented in the Process Safety Management Program for each of KUB?s facilities that use chlorine.\n\nPre-startup Safety Review\nKUB conducts pre-start up safety review to ensure that new or modified equipment is ready to be operated properly and safely, prior to the equipment being placed into service. KUB ensures that safety, operating, maintenance and emergency procedures are in place by overseeing development of safety and emergency procedures and developing detailed operating and maintenance plans.  KUB personnel are adequately trained and qualified for mechanical management and utilize a computerized work order system.\n\nManagement of Change\nKUB ensures that any alteration of equipment, procedures,, or processes are thoroughly analyzed to identify hazards, the consequences of failures, and impacts of the change on existing equipment, procedures, substances, and processes prior to implementation of the change.\n\nCompliance Audits\nKUB periodically conducts an audit or comprehensive assessment of the management systems and programs at each facility.  This includes a review of the documentation and implementation of the risk management requirements. According to RMP requirements, KUB conducts a complete compliance audit at each covered facility every three years to ensure that the process safety management elements are in place, updated, and being implemented properly.\n\nIncident Investigation\nThe final component of KUB?s prevention program consists of investigations to discover the underlying (root) causes of accidents or near miss incidents in order to take steps to prevent accidental releases from recurring. Incident investigation is initiated by the Plant Operations Department, with assistance from the Safety Section of the Human Resources Department and personnel from the Technical Services Department. All investigation reports for actual significant accidental releases are kept on file for a period of five (5) years.",
              "_chemicals": [
                {
                  "PrimaryKey": 30461,
                  "PreventionProgram3ID": 20831,
                  "ProcessChemicalID": 48799
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26066,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-05-16 00:00:00",
    "ERTrainingDate": "2000-11-08 00:00:00",
    "CoordinatingAgencyName": "Knoxville/Knox Co LEPC",
    "CoordinatingAgencyPhone": "8652152297",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26066,
      "SummaryText": "INTRODUCTION\nIn accordance with provisions of Title 40 Code of Federal Regulations, Part 68 of the Clean Air Act Amendments, the Knoxville Utilities Board?s (KUB?s) Risk Management Plan (RMP) is an integrated approach to identify and manage the hazards posed by an accidental chlorine release. KUB?S RMP is a unified program that integrates technologies, procedures and best management practices.  All applicable regulations, as required by EPA?s Chemical Accident Prevention ? 40 CFR Part 68, are addressed in this Plan. The prevention program is based on the following key elements:\n\n?High level training for operators,\n?Effective preventive maintenance program,\n?Use of state of the art process and safety equipment,\n?Use of accurate and effective operating procedures, written with participation from the operators,\n?Performance of a hazard review of equipment and procedures, and\n?Implementation of an auditing and inspection program.\n\nFACILITY INFORMATION & REGULATED SUBSTANCES\nFacility ID# 1000-0008-4963\nThe Fourth Creek Wastewater Treatment Plant is an ?activated? secondary wastewater treatment plant with a dry weather design flow of 10.8 MGD.  The maximum chlorine storage capacity at this facility is 16,000 pounds.\n\nOFF-SITE CONSEQUENCE ANALYSIS\nEach hazard assessment consisted of worst-case and alternative scenarios in order to evaluate the potential impacts of accidental releases of chlorine on the public health and environment. \n\nWorst Case Release Scenario \nFourth Creek uses chlorine in one (1) ton cylinders; therefore the worst-case scenario plant was based on the assumption that approximately 2000 pounds of chlorine would be released. All  calculations for air dispersion modeling was performed with RMP Comp Version 1.06 and results were mapped by using Landviewer 2000.  The worst-case scenario was evaluated at a release duration of 10 minutes and at a release rate of 110 pounds/minute.  Air dispersion modeling resulted in a distance to endpoint of 0.9 miles. Maps w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26066,
      "SummaryText": "ith overlays depicting this scenario are included in the Offsite Consequence Analysis section of the plan.\n\nAlternative Release Scenario \nKUB?s process hazard analysis (PHA) indicated a chlorine release would most likely occur due to a failure in the chlorination system piping, therefore modeling for each alternative scenario was based on this assumption. The chlorine scrubber located at this plant was taken into consideration as active mitigation when conducting the alternative scenario. All calculations for the air dispersion modeling were performed with RMP Comp Version 1.06 and results were mapped by using Landviewer 2000. The alternative release scenario was evaluated at release duration of 10 minutes and at a release rate of 1630 pounds/minute. Modeling resulted in a distance to endpoint of 0.5 miles. Maps with overlays depicting this scenario are included in the Offsite Consequence Analysis section of the plan.\n\nFIVE YEAR ACCIDENT HISTORY\nIn addition to the off-site consequence analysis, a five (5) year accident history was compiled for Fourth Creek.  In the past five years there have been no accidents related to chlorine releases.\n\nPREVENTION PROGRAM\nKUB?s accidental release prevention program is based upon OSHA?s Process Safety Management Standard, 29 CFR 1910.119 and addresses the following 10 elements tailored to our facility's operations. The Plan, in its entirety, can be reviewed in Plant Operations and in Technical Services. In accordance with the Process Safety Management provisions incorporated into the Risk Management Program, KUB promotes prevention programs in each of the major areas listed below: \n\n?Management System\n?Employee Training\n?Prestartup Safety Review\n?Management of Change\n?Process Hazard Analysis\n?Process Safety Information\n?Standard Operating Procedures \n?Compliance Audits\n?Incident Investigation\n\nACTIVE MITIGATION SYSTEMS\nThe chlorine scrubber system is a once-through, three-stage absorption system designed to contain and safely evac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26066,
      "SummaryText": "uate a major chlorine leak while maintaining toxic vapor emissions below the Uniform Fire Code requirement of 1/2 the IDLH (immediately dangerous to life and health) value at all times.  To accomplish this, the scrubber removes >99.99% of the toxic vapor in the air while maintaining a negative pressure in the chlorine storage room.  The scrubber system consists of  three horizontal cross-flow packed bed sections. The caustic storage tank is an integral part of the system and is located below the scrubber adsorber sections. The recirculation pump pulls caustic solution from the storage tank and circulates it through the 3 stages, allowing the vapor-laden gases to be absorbed into the caustic and discharging vapor-free air through the stack.  Other safeguards in the system to prevent an accidental release are the use of a chlorine vapor detector, exhaust fans and emergency alarms.\n\nEMERGENCY RESPONSE PROGRAM\nKUB?s Emergency Response Program is based upon the Chlorine Institute?s ?Pamphlet 64 - Emergency Response Plans for Chlorine Facilities? and is designed to address the specific emergency needs associated with a chlorine leak. Even though Fourth Creek Plant has mitigation systems to minimize the likelihood of a release, KUB has a comprehensive emergency response plan that is complete, up-to-date and supplemented with emergency response training and drills for employees. \n\nKUB?s Plan has been submitted to and reviewed by the City of Knoxville Local Emergency Response Committee (LEPC). In the event of an off-site release, the Plan prepares KUB and the Community for a response to and mitigation of accidental chlorine releases in order to limit the severity of such releases and their impact on both public health and environment.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nKUB has recently implemented a work management system called the Mincom Information Management System (MIMS).  Use of this system will help assure that all chlorine feed systems, including emergency monitoring"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26066,
      "SummaryText": " systems, are properly maintained.  Preventive maintenance work orders will be generated automatically and routed to the designated crew.  In addition MIMS will easily track and record the use of all KUB equipment (trucks, lab equipment, chlorine cylinder repair kits, emergency response equipment) and schedule service appointments periodically to ensure that employees are using the most reliable equipment for each task. \n\nThe visual workplace (5S) is one of the fundamental techniques KUB has adopted in a an effort to adopt a continuous improvement philosophy. Visual workplace 5 -S provides a method by which employees improve workplace safety, reduce waste, simplify work processes, improve equipment maintenance and troubleshooting, and ensure continuous improvement.  Using the 5-S methodology,  the employees transform their work areas by use of easy to access visual systems based on these 5-S concepts:\n\n-Sort (Organization) \n?Simplify (Orderliness) \n?Shine (Cleanliness) \n?Standardize \n?Sustain (Self Discipline) \n\nOne of the most innovative safety approaches in KUB?s 2-year safety plan is the appointment of a KUB-wide Safety Team that will utilize the Dupont ?STOP? program. The members of the Safety Team will work with department managers, supervisors and employees to standardize departmental safety programs, coordinate resources, and communicate safety goals and initiatives."
    }
  ]
}