{
  "FacilityID": 26101,
  "FacilityName": "Farmers Cooperative Company - Dumont North",
  "FacilityStr1": "215 Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Dumont",
  "FacilityState": "IA",
  "FacilityZipCode": "50625",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19023",
  "LEPC": "Butler County",
  "FacilityLatDecDegs": "42.747222",
  "FacilityLongDecDegs": "-92.971389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Farmers Cooperative Compnay",
  "OperatorStr1": "P.O. Box 35",
  "OperatorStr2": null,
  "OperatorCity": "Farnhamville",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50538",
  "OperatorZipCodeExt": "0035",
  "RMPContact": "Gary Imhoff",
  "RMPTitle": "Safety & Compliance Coordinator",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000096317",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-09-13 00:00:00",
  "SafetyInspectionBy": "IA Dept. of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-06-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-03-30 00:00:00",
  "DeRegistrationEffectiveDate": "2004-03-01 00:00:00",
  "AnniversaryDate": "2007-06-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.94314,
  "FRS_Long": -93.10314,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37306,
      "AltID": "Ammonia storage",
      "FacilityID": 26101,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38214,
          "ProcessID": 37306,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 48947,
          "ProcessID": 37306,
          "ChemicalID": 56,
          "Quantity": 77000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 548947,
          "ProcessID": 37306,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26101,
      "SummaryText": "Farmers Cooperative Company\n\n\nRisk Management Plan - Executive Summary\n\n\n1. Farmers Cooperative Co. (FC) accidental release prevention policy involves, but is not limited to technologies, procedures, and management practices. All applicable procedures of the ANSI  K-61.1 - 1989 \"Safe Requirements for the Storage and Handling of Anhydrous Ammonia\", as adopted by the Iowa Department of Agriculture and Land Stewardship (IDALS), are adhered to. The FC emergency response policy involves the preparation of response plans which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.\n\n2. The FC facility at Dumont -  North is in the business of selling anhydrous ammonia to farm customers as a form of nitrogen fertilizer. The facility has 1  anhydrous ammonia storage tank(s) with the maximum capacity of 76,500  lbs. of anhydrous ammonia. This facility does not store any nurse tank trailers on site as they are stored across the highway at Dumont - South location. All ammonia weights were figured at 5.0 lbs. per gallon. Ammonia at 77 degrees F. weighs 5.03 lbs. per gallon. RMP Comp (TM) uses 77 degrees F. for the temperature for both the worst-case and alternative case scenario calculations. All tanks were figured at 85% fill capacity. The location includes anhydrous ammonia storage tanks, nurse tank filling risers, electrical panels, lighting, and anhydrous ammonia safety equipment. The facility is manned year round during normal business hours.\n\n3. The off-site consequence analysis includes two anhydrous ammonia release scenarios, identified as \"worse case release\" and \"alternative scenario\". The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes due to an unspecified failure. The alternative scenario is defined as more likely to occur than t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26101,
      "SummaryText": "he worst-case release scenario.\n\nThe worst-case release scenario at FC - Dumont North involves a failure on the largest anhydrous ammonia storage tank with the capacity of 76,500 lbs. of anhydrous ammonia. The off-site consequence analysis for this scenario was performed by using pre-defined EPA guidelines in RMP-Comp version 1.07 software.\n\nEPA mandated meteorological conditions were determined by using RMP-Comp version 1.07 for both the worst-case release scenario and the alternative release scenario. \n\nWhen atmospheric dispersion modeling for the worst-case release scenario was performed using RMP-Comp assumptions, a distance to toxic endpoint of 3.20 miles. An estimate of residential population potentially affected of 1,100 was obtained by using1990 population census figures.\n\nThe alternative scenario involves the rupture of a 2 (two) inch I.D. anhydrous transport transfer hose for a time period of 2 minutes. Two minutes release time assumes human intervention and excess flow valves stop the release.\n\nWhen atmospheric dispersion modeling for alternative scenario releases was performed using RMP-Comp assumptions, a distance to toxic endpoint of 0.30 miles. An estimate of residential population potentially affected of 600 was obtained by using 1990 census figures.\n\n4. FC's accidental release prevention plan is based on the following key elements:\n\n?Annual training of all personnel required to handle ammonia and what to do in an emergency\n\n?Facilities constructed & maintained according to ANSI  K 61.1 - 1989 standards adopted by IDALS in Iowa\n\n?Use of usual anhydrous ammonia safety equipment\n\n?Use of effective operating procedures according to Agricom's anhydrous ammonia safety procedures handbook and training videos\n\n?Annual inspections by IDALS of storage tanks, piping for leaks, nurse tanks, applicators, transfer risers, riser hoses, safety equipment, pressure relief valve records, etc.\n\n?FC site inspections by safety committee members at least twice a year\n\n5. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26101,
      "SummaryText": "No accidental releases of anhydrous ammonia have occurred at this facility in the past five years.\n\n6. This facility has an emergency response program, which has been coordinated with the Dumont Fire Department, which is a member of Butler Count LEPC in Iowa. This program includes response decision tree and a notification plan. Emergency operations and response procedures are reviewed annually, with a site visit of the facility by the Dumont Fire Department.\n\n7. Changes to improve safety at this facility are completed as required by rule change and/or methods to increase safety and/or efficiency of operations."
    }
  ]
}