{
  "FacilityID": 26211,
  "FacilityName": "Missouri American Water Company Meramec Plant",
  "FacilityStr1": "4194 Meramec Bottom Road",
  "FacilityStr2": null,
  "FacilityCity": "St. Louis",
  "FacilityState": "MO",
  "FacilityZipCode": "63129",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29189",
  "LEPC": "St. Louis County LEPC",
  "FacilityLatDecDegs": "38.462667",
  "FacilityLongDecDegs": "-90.3645",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Missouri American Water Company",
  "Company2Name": null,
  "CompanyDUNS": 6918726,
  "Company2DUNS": 0,
  "OperatorName": "Missouri American Water Company",
  "OperatorStr1": "535 N. New Ballas Road",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63141",
  "OperatorZipCodeExt": "6875",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000098912",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-07-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-07-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-03-16 00:00:00",
  "DeRegistrationEffectiveDate": "2010-02-19 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 38.46294,
  "FRS_Long": -90.36345,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37463,
      "AltID": null,
      "FacilityID": 26211,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 49125,
          "ProcessID": 37463,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38371,
          "ProcessID": 37463,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 20927,
              "Process_NAICS_ID": 38371,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1999-05-25 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "liquid expansion chambers",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-06-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-07 00:00:00",
              "EquipmentTested": "leak detection equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The prevention program applies to the entire chlorine process.",
              "_chemicals": [
                {
                  "PrimaryKey": 30645,
                  "PreventionProgram3ID": 20927,
                  "ProcessChemicalID": 49125
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26211,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-06-07 00:00:00",
    "CoordinatingAgencyName": "St. Louis County LEPC",
    "CoordinatingAgencyPhone": "3146285400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26211,
      "SummaryText": "SAFETY POLICIES\nMissouri American Water Company has delivered quality drinking water to its customers for nearly 100 years.  The Missouri American Water Company Meramec Water Treatment Plant, located on the Meramec River near I-55, serves customers in South St. Louis County and portions of northern Jefferson County, and has the capacity to produce 48 million gallons of drinking water per day.  Chlorine, a disinfectant used in the water treatment process, is covered under OSHA's Process Safety Management (PSM) and EPA's Risk Management Program (RMP) regulations.  Missouri American Water Company complies with these regulations, as well as others, to ensure that the risks involved in the handling, use and storage of chlorine are minimized.  It is Missouri American Water Company's policy to conduct our business in accordance with applicable environmental, safety and health laws and regulations.  Management fully supports efforts to safely manage process risks to prevent incidents and to protect the workplace, the community and the environment.  In conducting our business, we continue to seek and implement cost effective methods to reduce the environmental, health and safety impact of our operations.  We promote continuous improvement through business planning, ongoing training, and constant oversight of operations.  We take safety seriously and have comprehensive accident prevention and emergency planning and response programs in place.\nCHLORINE SYSTEM\nChlorine is used to purify drinking water.  It is an important chemical that disinfects against disease producing organisms, and is used in the treatment of 98% of U.S. drinking water.  Missouri American Water Company has safely used chlorine as part of our water treatment process since the early 1900's.  We continue to operate well within the guidelines set by EPA and other regulatory authorities.  Due to the hazards of chlorine, however, it is necessary to observe certain safety precautions in order to prevent unnecessa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26211,
      "SummaryText": "ry human and environmental exposure.\nWORST-CASE RELEASE SCENARIO\nThe worst-case release scenario at the Missouri American Water Company Meramec Water Treatment Plant is the failure of a 2,000-pound container of chlorine.  The vapor cloud formed as a result of the release would reach offsite endpoints and nearby public receptors.  This worst-case scenario is highly unlikely as it assumes a complete failure of the vessel, the failure of all safety systems, no emergency response and worst-case weather conditions.\nALTERNATIVE RELEASE SCENARIO\nAn alternative release scenario would involve a leak from the piping during the hook-up of a 2,000-pound container of chlorine.  The vapors formed as a result of this release would reach an area just past our property boundary, where one residence is located.\nACCIDENTAL RELEASE PREVENTION PROGRAM\nMissouri American Water Company has a comprehensive prevention program in place which ensures safe operation of the system and prevention of accidental releases.  The chlorine system at the water treatment plant is designed for safety.  We follow Chlorine Institute Standards and use only equipment and materials certified for chlorine service.  Much of the chlorine system operates under vacuum, which helps prevent leaks.  A process hazard analysis is performed and reviewed regularly to identify, evaluate and control the risks associated with the chlorine system.\nProcedures and systems are in place to operate safely.  Comprehensive operating procedures provide clear instructions for safe operation of the chlorine system.  Process safety information is available to all employees and includes information related to chlorine hazards, process technology and process equipment.  Operators are formally trained to operate the chlorine process safely, and receive classroom as well as on-the-job instruction.  Procedures are followed to ensure proper management of changes to the system and a safety review is performed prior to startup of new or modifie"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26211,
      "SummaryText": "d equipment.  The facility is staffed 24 hours per day and the process is continuously monitored using state-of-the-art computerized instrumentation and operator oversight.  Enviornmental and safety audits are conducted regularly, and corrective action follow-up is performed.\nA preventative and corrective maintenance program ensures the mechanical integrity of the chlorine system, and includes procedures for equipment inspection, testing and repair.  Employees receive specialized training to perform chlorine system maintenance.  A contractor safety program is in place to ensure contractors are qualified and trained to safely work on the chlorine process.  Employees and contractors must also adhere to established safe work practices and permit requirements whenever work is performed on or near the process.\nFIVE-YEAR ACCIDENT HISTORY\nThe Missouri American Water Company Meramec Water Treatment Plant has had no releases within the past five years that have caused onsite or offsite injuries, deaths, or property or environmental damage.  For over ten years we've had a process in place to document all releases, regardless of quantity, and have not experienced a chlorine release with offsite impact.\nEMERGENCY RESPONSE PROGRAM\nOur emergency response program is designed to protect employee and public health and the environment.  Our emergency action plan consists of detailed emergency response procedures, and is updated on a yearly basis.  We have trained employees for emergency response according to OSHA's Hazardous Waste Operations and Emergency Response standard.  This specialized training ensures our employees are well prepared to respond to potential emergencies.  Missouri American Water Company works closely with the Local Emergency Planning Committee (LEPC), local fire and police departments, St. Louis County Hazardous Materials Emergency Response Team and other community responders.   We conduct regular drills with community emergency responders in order to practice a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26211,
      "SummaryText": "nd improve our emergency response plans.  In the event of a real emergency, local authorities have plans in place to communicate with the public regarding response and protection actions.\nPLANNED CHANGES TO IMPROVE SAFETY\nThe chlorine system at Missouri American Water Company's Meramec Water Treatment Plant is periodically modified to improve safety.  Modifications will be made to the chlorine room to ensure the room is as air-tight as possible, and vapors are contained in the event of a release.  This action will prevent or lessen any impact to the community and allow time to implement the proper emergency response activities in the event of a release.  In addition, ton container valve actuators will be installed to automatically shut off the system in the event of a leak.  Work is scheduled to be completed in 1999."
    }
  ]
}