{
  "FacilityID": 26224,
  "FacilityName": "Fulton Marshall LP- Francesville, IN (North)",
  "FacilityStr1": "N. Bill St. 2 mi. N of Francesville",
  "FacilityStr2": null,
  "FacilityCity": "Francesville",
  "FacilityState": "IN",
  "FacilityZipCode": "47956",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18131",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "41.013333",
  "FacilityLongDecDegs": "-86.883611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Fulton Marshall LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fulton Marshall LP",
  "OperatorStr1": "1496 Meridian Road",
  "OperatorStr2": null,
  "OperatorCity": "Rochester",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46975",
  "OperatorZipCodeExt": null,
  "RMPContact": "Darrell Culp",
  "RMPTitle": "Location Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000069533",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-29 00:00:00",
  "SafetyInspectionBy": "OISC-Ken Neuhoff",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 41.01333,
  "FRS_Long": -86.88361,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37494,
      "AltID": "A-12,000 gallon NH3",
      "FacilityID": 26224,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38402,
          "ProcessID": 37494,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 49157,
          "ProcessID": 37494,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 549157,
          "ProcessID": 37494,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 37495,
      "AltID": "B-12,000 gallon NH3",
      "FacilityID": 26224,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 38403,
          "ProcessID": 37495,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 49158,
          "ProcessID": 37495,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 549158,
          "ProcessID": 37495,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26224,
      "SummaryText": "Fulton Marshall LP - Francesville, IN (MAIN)\n\n\nDarrel Culp\nLocation Manager      \nExecutive Summary - Anhydrous Ammonia\n\n\nAccidental Release Prevention and Emergency Response Policies:\n\nThe anhydrous ammonia system is designed, installed, and maintained in accordance with ASTM standards and ASME codes. This facility complies with the ANSI K 61.1 standards (1989), OSHA (29 CFR 1910.111), EPA's Accidental Release Prevention Rule, and all applicable federal, state, and local codes and regulations.\n\nFulton-Marshall LP strives to do everything feasible to ensure that all business activities are completed with as little risk as possible.  Our employees receive training in the areas of operations and safety to minimize the potential of a release due to human error.\n\nDescription of our Facility and the Regulated Substances Handled:\n\nThis facility is a wholesale farm supply distribution center. We store and distribute a wide variety of fertilizers including anhydrous ammonia. Anhydrous ammonia is received by truck, is handled and stored on-site, and is a substance regulated by the EPA requiring us to comply with the Risk Management Program. We sell anhydrous ammonia to grower customers in either 1,000 gallon or 1,450 gallon nurse tanks. The customer applies the ammonia into the soil as a source of nitrogen fertilizer for growing agricultural crops. \n\nAnhydrous ammonia is stored in 2 stationary storage tanks [2 @ 12,000 gallons] on site.  The maximum storage capacity of the stationary storage tanks is 112,000 pounds of anhydrous ammonia. Therefore, the total facility anhydrous ammonia storage capacity is 112,000 pounds.  The largest single storage vessel at our facility contains 56,000 pounds.\n\n\nWorst Case Scenario:\n\nOur worst case scenario is the loss of the total contents of the 12,000 gallon storage tank, when filled to the greatest amount allowed (85% of capacity), released as a gas over 10 minutes, resulting in total vaporization. The maximum quantity released would be 5"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26224,
      "SummaryText": "6,000 pounds. According to DEGADIS modeling, this release (distance from point of dispersion to 200 ppm) would have off-site impact. \n\nAlternative Release Scenario:\n\nThe most common alternative release scenario from our facility would not reach an end point off-site. The alternative release scenario modeled for the purpose of this plan is a 2-minute release from a stationary storage tank representing a valve and hose failure requiring a manual shut down.  The total amount of anhydrous ammonia released in this scenario would be 12,000 pounds. This release scenario (distance from point of dispersion to 200 ppm) would have off-site impact.  \n\nOur ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shutoffs, and emergency shutoff valves. The load-out risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediately stop the flow of ammonia if a line or a hose fails. All main storage tank valves and riser valves are locked when not in use.\n\nOur ammonia system is inspected on a regular basis with maintenance and preventive maintenance scheduled and documented. Liquid and vapor valves, hoses, excess flow valves, gauges, and relief valves are replaced when necessary and according to the guidelines in the ANSI standards.\n\nTraining is provided to all employees at least annually, whenever there is a change in the process, or whenever competency with the regulations is questioned. The training consists of classroom lecture, current videos, testing and certification, and on the job training.\n\n\nFive-year Accident History:\n\nThere have been no accidents involving anhydrous ammonia that caused deaths, injuries, property or environmental damage, including evacuations on or off-site.\n\n\nEmergency Response Program:\n\nOur Emergency Response Plan is on file with the required agencies and will be updated as changes take place.  Local emergency response personnel a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26224,
      "SummaryText": "re trained in proper response to a release of anhydrous ammonia. In the event of an emergency involving our ammonia system, it is our policy to notify the local community fire department and request that they respond to the emergency. In preparation for this, we have coordinated with all of the local response agencies by providing information and facility tours to ensure that they are familiar with and properly prepared for an incident at our facility. This will help to ensure that our community has the strategy for responding to and mitigating the threat posed by an ammonia release. This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our LEPC.\n\nPlanned Changes to Improve Safety:\n\nWe are required to meet new Indiana State Chemist requirements for the storage and handling of anhydrous ammonia by February 1, 2003 . We will continue to provide our employees with ongoing annual training to ensure that they are current with safe ammonia transfer and handling procedures. We will also provide regular inspection and maintenance on all of the ammonia equipment"
    }
  ]
}