{
  "FacilityID": 26311,
  "FacilityName": "Denver Milk Plant",
  "FacilityStr1": "4301 Forest Street",
  "FacilityStr2": null,
  "FacilityCity": "Denver",
  "FacilityState": "CO",
  "FacilityZipCode": "80216",
  "Facility4DigitZipExt": "4540",
  "FacilityCountyFIPS": "08031",
  "LEPC": "Denver LEPC",
  "FacilityLatDecDegs": "39.777167",
  "FacilityLongDecDegs": "-104.926528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9092586,
  "ParentCompanyName": "Safeway, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9137209,
  "Company2DUNS": 0,
  "OperatorName": "Safeway, Inc.",
  "OperatorStr1": "5918 Stoneridge Mall Road",
  "OperatorStr2": null,
  "OperatorCity": "Pleasanton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94588",
  "OperatorZipCodeExt": "3229",
  "FTE": 92,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000179558",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-07-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-07-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-07-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 39.77717,
  "FRS_Long": -104.92653,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37661,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 26311,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 49326,
          "ProcessID": 37661,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38571,
          "ProcessID": 37661,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21059,
              "Process_NAICS_ID": 38571,
              "SafetyReviewDate": "2002-02-26 00:00:00",
              "PHA_Date": "2002-04-03 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-05-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-04-18 00:00:00",
              "TrainingReviewDate": "2002-02-26 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-02-26 00:00:00",
              "EquipmentInspectionDate": "2002-04-26 00:00:00",
              "EquipmentTested": "Compressors, Piping, Oil drain line",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-02-26 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-02-26 00:00:00",
              "HotWorkPermitReviewDate": "2002-02-26 00:00:00",
              "ContractorSafetyReviewDate": "2002-02-26 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Fluid Milk Manufacturing",
              "_chemicals": [
                {
                  "PrimaryKey": 30780,
                  "PreventionProgram3ID": 21059,
                  "ProcessChemicalID": 49326
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26311,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Denver Fire Department",
    "CoordinatingAgencyPhone": "3032864927",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26311,
      "SummaryText": "A.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe management and staff of the Denver Milk Plant are committed to operating their facility with the highest regard for the safety of the public, Denver Milk Plant personnel, and the environment.  To ensure the safety of the public, Denver Milk Plant personnel, and the environment, the plant has implemented a management system that integrates the elements of OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119 and EPA's Risk Management Program (RMP) rule, 40 CFR part 68.  The policies and procedures integrated under the Denver Milk Plant's management system specifically address prevention of the release of anhydrous ammonia, and emergency response to an accidental release of ammonia.\n\n\nB.  STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Denver Milk Plant operates a fluid milk processing plant.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the facility.  Ammonia is handled in a closed-loop process that consists of the following general stages: liquid storage; expansion; evaporation; compression; and condensation.\n\nThe ammonia refrigeration system is the only process at the Denver Milk Plant which is subject to the EPA RMP rule ( and the OSHA PSM standard).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the High Pressure Receiver to the +17 F Pump Trap where the pressure is dropped to 30 psig.  From the High Pressure Receiver, liquid ammonia is also transferred to the Blowmold Chillers.  The +17 F Pump Trap transfers liquid ammonia to the evaporators and the Ice builder.  Ammonia vapor from the Ice Builder and evaporators, and ammonia liquid from the Blowmold Chiller, returns to the Pump Trap.  \n\nThe vapor from the +17 F Pump Trap is routed to the six Compressors.  Compressor discharge (high pressure ammoni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26311,
      "SummaryText": "a vapor, or hot gas) is sent to the Condenser where it is condensed to a high pressure liquid and returned to the High Pressure Receiver.  An Auto Purger purges the system of non-condensibles collected in the Condenser.  The system also has an emergency refrigerant control box located outside of the machine room where pressure can be manually relieved from one vessel to another. \n\n\nC.  HAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\nThe worst case release scenario is a release of the total quantity of ammonia in the largest vessel in the ammonia refrigeration system, taking into account administrative controls that limit the maximum quantity in the vessel.  If a vessel is located inside a building, the EPA allows a passive mitigation factor of 55% to be used in calculating the release rate to the outside atmosphere when the release is enclosed by a building.\n\nThe High Pressure Receiver results in the highest release rate, and will therefore be used for the worst case release scenario.  The vessel is located inside the building, so passive mitigation was considered.  The maximum ammonia release of 5,420 lbs. in 10 minutes is limited by the vessel size.  \nSince the vessel is located in the engine room, the mitigated release rate is 298 lbs./minute.\n\nFor analyzing the worst case release scenario, EPA requires the use of the most pessimistic meteorological conditions that will allow for the maximum downwind exposure.  Low wind speeds (1.5 m/s) and stable atmospheric conditions (F stability) will allow the gas cloud to travel as far as possible by limiting cloud dispersion.  The results are conservative.\n\nEPA's \"Risk Management Program Guidance for Ammonia Refrigeration,\" November 1998, Exhibit 4-4 was used to find the downwind distance for the worst case release to 200 ppm in an rural setting.  The RMP*Comp? Model developed by the National Oceanic and Atmospheric Administration and EPA was used to prepare the data in this guidance document.  This guidance "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26311,
      "SummaryText": "document provides data for ammonia refrigeration systems and will ensure consistency throughout the industry.\n\nThis release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.  \n\nNote: Item 2-6 is required to be reported to 1 significant-figure and is the mitigated release rate, where as item 2-5 is the total quantity and is reported to 2 significant figures.\n\n\nAlternative Release Result Summary\n\nA release of ammonia resulting from a 0.25 inch diameter hole in a pipe for one hour.  The release rate of ammonia due to the pressure of the tank is 134 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed and D stability.  Reference tables in the Risk Management Program Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in rural conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\nNote: Item 3-6 is required to be reported to 1 significant figure.\n\n\nD.  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nMuch of the safety of the system at the Denver Milk Plant facility is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with the OSHA's Process Safety Management (PSM), and Federal EPA's Risk Management Program (RMP), Program 3 requirements.\n\nThe ammonia refrigeration system at the Denver Milk Plant facility was designed and constructed in accordance with the 1965 Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors and pressure relief valves to protect vessels' integrity. \n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26311,
      "SummaryText": " change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\"\n\n\nE.  FIVE YEAR ACCIDENT HISTORY\n\nOver the past five years (Feb 1997 - Feb 2002), the Denver Milk Plant has not had any reportable ammonia releases that resulted in deaths, injuries, property damage, environmental damage, or offsite evacuations.\n\n\nF.  EMERGENCY RESPONSE PROGRAM\n\nThe Denver Milk Plant facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility.  Emergency response activities are coordinated with the Denver Fire Department and the local fire houses.  If necessary, the facility will call 9-1-1 to alert the local Police and Fire Departments.\n\nOther responders will be called as needed, including the Denver Fire Department.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center will be called.\n\nThe Denver Milk Plant will be responsible for evacuating and ensuring the safety of its employees in case of an emergency evacuation.  Other training received by employees includes:what to do in case of emergency, and where to go when an evacuation is called. \n\nThe following summarizes the notification procedures at the facility:\n\n1.  First call 911 on an internal/land line phone for the Denver Fire Department and Police Departments.  The Denver Fire Department can be reached directly at 303-286-4927.\n\n2.  EP"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26311,
      "SummaryText": "A Region 8 24 hour Emergency Response can be contacted at 1-800-227-8914.\n\n3.  If additional help is required for an ammonia spill or leak, the facilities can call Chemtrec - Manufacturing Chemists Association 1-800-424-9300.\n\n4.  If an ammonia release exceeds 100 pounds (Federal Reportable Quantity CERCLA), call the National Response Center 1-800-424-8802 and the Denver Office of Emergency Management at 720-865-7600 for a release of any amount.\n\n5.  If serious injuries or harmful exposures to workers occurs, call the nearest OSHA Field Office in Denver at 1-800-755-7090 (or 303-844-5285), or the OSHA Region 8 Office in Denver at 303-844-1600.\n\n6.  If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per day at 800-342-9293.\n\n7.  If an ammonia release is significant enough to potentially cause odor complaints from neighboring facilities, contact the City of Denver.\n\n8.  If an ammonia release spills into the sewer system, contact the City of Denver, Environmental Protection Division at 720-865-5452.\n\n\nG.  PLANNED CHANGES TO IMPROVE SAFETY\n\nThe initial Process Hazard Analysis is scheduled to take place on April 3rd, 2002.  The analysis, which will include a Hazard and Operability (HAZOP) study and a Facility \"What If\" Walkthrough, will provide mitigation measures to improve safety at the Denver Milk Plant located at 4301 Forest Street, in Denver, Colorado.  In addition, the facility is currently updating the standard operating procedures for the ammonia refrigeration system and in the process of enhancing the maintenance program to incorporate guidelines included in the IIAR Bulletin 110."
    }
  ]
}