{
  "FacilityID": 26459,
  "FacilityName": "Garner B Chlorine Storage Station",
  "FacilityStr1": "3670 Placentia Ln.",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "CA",
  "FacilityZipCode": "92501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": null,
  "FacilityLatDecDegs": "34.017167",
  "FacilityLongDecDegs": "-117.354972",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "www.ci.riverside.ca.us",
  "FacilityEmailAddress": "OLu@riversideca.gov",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Riverside Public Utilities Department",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Riverside, Public Utilities",
  "OperatorStr1": "2911 Adams Street",
  "OperatorStr2": null,
  "OperatorCity": "Riverside",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92504",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000179781",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-04-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-08-18 00:00:00",
  "DeRegistrationEffectiveDate": "2005-05-01 00:00:00",
  "AnniversaryDate": "2007-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.01476,
  "FRS_Long": -117.35478,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37889,
      "AltID": "Chlorine Storage",
      "FacilityID": 26459,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 49628,
          "ProcessID": 37889,
          "ChemicalID": 62,
          "Quantity": 1800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38805,
          "ProcessID": 37889,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21192,
              "Process_NAICS_ID": 38805,
              "SafetyReviewDate": "2001-01-01 00:00:00",
              "PHA_Date": "2001-07-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-03-16 00:00:00",
              "TrainingReviewDate": "2001-03-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Participation",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-03-16 00:00:00",
              "EquipmentInspectionDate": "2001-03-16 00:00:00",
              "EquipmentTested": "Chlorine Storage Racks",
              "ChangeMgmtDate": "2001-03-16 00:00:00",
              "ChangeMgmtReviewDate": "2001-03-16 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-04-04 00:00:00",
              "AuditCompletionDate": "2001-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-03-16 00:00:00",
              "HotWorkPermitReviewDate": "2001-03-16 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2001-03-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30969,
                  "PreventionProgram3ID": 21192,
                  "ProcessChemicalID": 49628
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26459,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-04-01 00:00:00",
    "ERTrainingDate": "2001-04-01 00:00:00",
    "CoordinatingAgencyName": "City of Riverside Fire Dept.",
    "CoordinatingAgencyPhone": "9097808620",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26459,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting drinking water.  The addition of chlorine or chlorine compounds to water is called chlorination.  Chlorination is considered to be the most important process for preventing the spread of waterborne diseases in drinking water.  The City of Riverside Public Utilities Department also uses chlorine for drinking water disinfection purposes to protect public health per state and federal water quality standards. Storing and handling large quantities of chlorine can create hazardous situations.  The City of Riverside takes safety obligations in storing and using chlorine as seriously as it takes in providing safe drinking water.  The City of Riverside has an excellent safety record in storing and handling chlorine.  The City of Riverside chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program.  These Programs require a summary in the Risk Management Plan (RMP) of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions, which will be taken by the facility in an event of an emergency.  The following information is specifically required in the RMP Executive Summary: \n\n* Accidental release prevention and emergency response policies.\n* General facility and regulated substances information.\n* Offsite consequence analysis results.\n* Summary of the accidental release prevention program and chemical-specific prevention steps.\n* Five-year accident history summary.\n* Emergency response program summary.\n* Planned changes to improve safety.\n\nThe above information for the Garner B Chlorine Storage Station is provided below.\n\nAccidental Release Prevention and Emergency Response Policies:\nThe City of Riverside accidental release prevention policy involves a unified approach that integrates pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26459,
      "SummaryText": "oven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedures of the State of California and EPA's Prevention Program are adhered to, including key elements such as training, systems management, and emergency action procedures.\n\nThe City of Riverside emergency response policy involves the preparation of emergency response plans for hazardous materials, which are tailored, to each facility and to the emergency response services available in the community, and is in compliance with the EPA and CalARP Program Emergency Response Program Requirements.  The City of Riverside has prepared an Emergency Response Plan for handling chlorine to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The emergency response plan has been coordinated with local response agencies (City of Riverside Fire Department).  The Garner B Chlorine Storage Station has an excellent record in preventing accidents from occurring.\n\nGeneral Facility and Regulated Substance Information:\nThe Garner B Chlorine Storage Station is located at 3670 Placentia Lane, Riverside, California.\nAt present a maximum of sixteen 150-pound cylinders are stored at the facility.  However, The City of Riverside proposes to store a maximum of 25 chlorine cylinders at the Garner B Chlorine Storage Station.  The nearest public receptor (see Section 2 for a definition of the public receptor), a soccer field is located very close (within 50 feet) to the chlorine storage station.\n\nGarner B Chlorine Storage Station is only a chlorine storage station; chlorine is not withdrawn from the cylinders nor chlorination is performed at the station.\nA chlorine leak detector is provided to detect chlorine leaks in the chlorine storage room. The chlorine detector enunciates a chlorine leak alarm in the Control Room located at 2911 Adams Street, City of Riverside Public Ut"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26459,
      "SummaryText": "ilities Department, Water Production and Operations Office when a Cl2 concentration of 1 PPM is detected inside the chlorine storage room.\n\nUpon detection of chlorine concentration higher than 1 PPM, the exhaust fan (provided inside the chlorine storage room) will be turned-on and chlorine will be exhausted from the chlorine storage room.  In addition, a chlorine leak alarm will be enunciated in the Control Room.\n\nOffsite Consequence Analysis Results:\nThe offsite consequence analysis includes consideration of two release scenarios, identified as worst-case release scenario and alternative release scenario.  The first scenario is defined by EPA, which states that the owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10-minutes, due to an unspecified failure. The alternative scenario is defined as more likely to occur than the worst-case release scenario.\n\nRMP and CalARP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario that is estimated to create the greatest distance in any direction to a toxic endpoint resulting from an accidental release of regulated toxic substances from covered processes.  The worst-case release scenario selected for the Garner B Chlorine Storage Station was the release of the total contents of one 150-pound chlorine cylinder within 10 minutes.\n\nEPA and CalARP regulations require that the models used for dispersion analysis should appropriately account for the density of the released gas.  The RMP*Comp software used for the consequence analysis accounted for the dense gas behavior of chlorine releases.\n\nRMP and CalARP rules require that a scenario, which results in offsite toxic endpoint distance and is more likely to occur than the worst-case scenario, should be selected as the alternative release scenario, unless no such scenario exists.  Unlike the worst-case scenario, the alternative release scenario may co"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26459,
      "SummaryText": "nsider active mitigation such as automatic shutoff valves, excess flow valves, and containment with scrubbers.  Active mitigation is defined as requiring mechanical, electrical, or human input.\n\nSince chlorine is the only regulated toxic substance used at the facility, only one alternative scenario was selected for the offsite consequence analysis.\n\nThe alternative release scenario selected for the Garner B Chlorine Storage Station involved the release of chlorine through a leak in the container body such as a hole.  This scenario can occur if the cylinder is dropped and cracked during transportation.\n\nThe operators present in the control room would be warned of the leak by the chlorine detector installed at the Garner B Chlorine Storage Station.  It is assumed that the emergency response personnel would respond within 15-minutes and seal the leak.\n\nIt should be noted that the occurrence of this scenario is highly unlikely because the cylinders are constructed in a way that damage from a short drop or impact from being struck would not result in any cracks in the cylinder body.  Only under a large force would the cylinder crack and leak.\nThe chlorine release rate was estimated at 3.0 lb./min (W&T, 2001).\n\nFinally, no chlorine release that could have caused safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the Garner B Chlorine Storage Station during the last five years.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe City of Riverside has prepared a federal and California Process Safety Management Program.  The City of Riverside accidental release prevention program is based on the following key elements:\n\n* A management system.\n* Detailed process safety information that is readily available to staff, emergency responders, and contractors.\n* A preventive maintenance program.\n* Performance of process hazard analysis of equipment and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26459,
      "SummaryText": "procedures with operation and maintenance staff participation and review.\n* Use of industry recommended process and safety equipment.\n* Use of effective operating procedures.\n* Training of the operators and maintenance staff.\n* Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine containers, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and alarms, and a chlorine scrubber.\n\nProcess and Chemical Safety Information:\nChemical data have been assembled to include health hazard, chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine background information and MSDS sheets.\n\nProcess Hazard Analysis:\nA detailed process hazard analysis (PHA) was conducted on December 8, 2000 for the chlorination system equipment and procedures.  A number of equipment and procedural changes were recommended as part of the PHA.  These recommendations have already been implemented.  The PHA for the chlorination system will be updated within a five-year period or whenever there is major change in the process.\nA seismic walkthrough was also performed; no new recommendations have been made based on this seismic walkthrough.\n\nOperating Procedures:\nThe City of Riverside maintains written operating procedures that provide clear instructions for the chlorine process. The operating procedures include ton-containers connection/disconnection, start-up, normal operation, and shutdown procedures.  Operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine equipment, and reconfiguration of the facilities.\n\nTraining:\nThe City of Riverside employees presently involved in operating or maintaining the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26459,
      "SummaryText": "chlorine process are trained in an overview of the process and applicable operating and maintenance procedures.  The City of Riverside ensures that each employee newly assigned to the chlorine process, is trained and tested to be competent in the operating procedures listed pertaining to their duties.  Each employee (presently involved in operating the chlorine process) has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including emergency response.\n\nRefresher training is provided annually to each employee operating the chlorine process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the City of Riverside ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\n\nContractors\nThe City of Riverside has procedures in place that ensures that the contractors are properly informed of the hazards, access limitations to the process area, and emergency response procedures, and prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the emergency response plan.\n\nPre-Startup Safety Review and Mechanical Integrity Program\nThe City of Riverside ensures that a pre-startup safety review is completed for any new covered-by-the-rules process, or for significant modifications to an existing covered process that requires a change in the process safety information.  The City of Riverside maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The City of Riverside mechanical integrity program includes the following:\n\n* Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 26459,
      "SummaryText": "pment vendors, industry codes, and prior operating experience.\n* Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\n* Training of maintenance personnel in preventive maintenance program procedures; safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\n\nHot Work Permits and Management of Change\nThe City of Riverside requires employees and contractors to employ safe work practices when performing hot work in, on, or around the covered process.  The City of Riverside uses a permitting program to ensure hot work is conducted safely on or near a process involving chlorine.\n\nThe City of Riverside provides a system to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions. This system allows the City of Riverside staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\n\nInternal Compliance Audits\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  The City of Riverside will assemble an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\nThe City of Riverside investigates all incidents that could reasonably have re"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 26459,
      "SummaryText": "sulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\n\nFive-year Accident History Summary\nNo chlorine releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the Garner B Chlorine Storage Station during the last five years.\n\nEmergency Response Program Summary\nThe City of Riverside is a first responder, its employees respond to chlorine accidental releases.  Depending on the severity of the accidental release, external resources such as the City of Riverside Fire Department may be solicited to aid in handling a chlorine release.\n\nAs part of the emergency response program, the City of Riverside has developed and implemented an emergency response plan for the purpose of protecting public health and the environment.  The following elements are included:\n\n(a)An emergency response plan, maintained at the Garner B Chlorine Storage Station and at the Control Room containing:\n* Organizational structure (chain-of-command) and responsibilities of various City of Riverside personnel.\n* Procedures for planning and coordination with off-site emergency response organizations.\n* Details of the training programs for all employees involved with the chlorination process, contractor training, and medical surveillance of the City of Riverside personnel who respond to chlorine releases.\n* Details of emergency recognition and prevention at the Garner B Chlorine Storage Station.\n* Procedures for informing the public and local eme"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 26459,
      "SummaryText": "rgency response agencies about accidental releases.\n* Documentation of proper first aid and emergency medical treatment necessary to treat accidental human exposures and the detailed information on emergency health care.\n* Procedures and measures for emergency response after an accidental release.\n(b)Procedures for the use of emergency response equipment and for its inspection, testing, and maintenance.\n(c)Training in relevant procedures for all employees involved with the chlorination process.\n(d)Procedures to review and update, as appropriate, the emergency response plan to reflect changes and ensure that employees are informed of changes.\n\nPlanned Changes to Improve Safety\nBased on the 2001 PHA, 13 changes to further improve chlorine safety were identified, including the update of the P&IDs for the chlorination system.  All 13 recommendations have been implemented."
    }
  ]
}