{
  "FacilityID": 26455,
  "FacilityName": "Grand Terrace Chlorination Station",
  "FacilityStr1": "Grand Terrace Road",
  "FacilityStr2": "South of Newport Street",
  "FacilityCity": "Grand Terrace",
  "FacilityState": "CA",
  "FacilityZipCode": "92324",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": null,
  "FacilityLatDecDegs": "34.040694",
  "FacilityLongDecDegs": "-117.324639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "www.ci.riverside.ca.us",
  "FacilityEmailAddress": "OLu@riversideca.gov",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Riverside Public Utilities Department",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Riverside, Public Utilities",
  "OperatorStr1": "2911 Adams Street",
  "OperatorStr2": null,
  "OperatorCity": "Riverside",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92504",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000179754",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-04-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-08-18 00:00:00",
  "DeRegistrationEffectiveDate": "2007-10-07 00:00:00",
  "AnniversaryDate": "2007-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.04188,
  "FRS_Long": -117.31301,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37885,
      "AltID": "Chlorination System",
      "FacilityID": 26455,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 49624,
          "ProcessID": 37885,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38801,
          "ProcessID": 37885,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 21190,
              "Process_NAICS_ID": 38801,
              "SafetyReviewDate": "2001-01-01 00:00:00",
              "PHA_Date": "2000-12-08 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-03-16 00:00:00",
              "TrainingReviewDate": "2001-03-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Participation",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-03-16 00:00:00",
              "EquipmentInspectionDate": "2001-03-16 00:00:00",
              "EquipmentTested": "SCBA's, chlorinators",
              "ChangeMgmtDate": "2001-03-16 00:00:00",
              "ChangeMgmtReviewDate": "2001-03-16 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-04-04 00:00:00",
              "AuditCompletionDate": "2001-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-03-16 00:00:00",
              "HotWorkPermitReviewDate": "2001-03-16 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2001-03-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30967,
                  "PreventionProgram3ID": 21190,
                  "ProcessChemicalID": 49624
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26455,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-04-01 00:00:00",
    "ERTrainingDate": "2001-04-01 00:00:00",
    "CoordinatingAgencyName": "San Bernardino County Fire Dept.",
    "CoordinatingAgencyPhone": "9093873080",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26455,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting drinking water.  The addition of chlorine or chlorine compounds to water is called chlorination.  Chlorination is considered to be the most important process for preventing the spread of waterborne diseases in drinking water.  The City of Riverside Public Utilities Department also uses chlorine for drinking water disinfection purposes to protect public health per state and federal water quality standards. Storing and handling large quantities of chlorine can create hazardous situations.  The City of Riverside takes safety obligations in storing and using chlorine as seriously as it takes in providing safe drinking water.  The City of Riverside has an excellent safety record in storing and handling chlorine.  The City of Riverside chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program.  These Programs require a summary in the Risk Management Plan (RMP) of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions, which will be taken by the facility in an event of an emergency.  The following information is specifically required in the RMP Executive Summary:\n\n* Accidental release prevention and emergency response policies.\n* General facility and regulated substances information.\n* Offsite consequence analysis results.\n* Summary of the accidental release prevention program and chemical-specific prevention steps.\n* Five-year accident history summary.\n* Emergency response program summary.\n* Planned changes to improve safety.\n\nThe above information for the Grand Terrace Chlorination Station is provided below.\n\nAccidental Release Prevention and Emergency Response Policies:\nThe City of Riverside accidental release prevention policy involves a unified approach that integrates prov"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26455,
      "SummaryText": "en technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedures of the State of California and EPA's Prevention Program are adhered to, including key elements such as training, systems management, and emergency action procedures.\n\nThe City of Riverside emergency response policy involves the preparation of emergency response plans for hazardous materials, which are tailored, to each facility and to the emergency response services available in the community, and is in compliance with the EPA and CalARP Program Emergency Response Program Requirements.  The City of Riverside has prepared an Emergency Response Plan for handling chlorine to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The emergency response plan has been coordinated with local response agencies (San Bernardino County Fire Department).  The Grand Terrace Chlorination Station has an excellent record in preventing accidents from occurring.\n\nGeneral Facility and Regulated Substance Information:\nThe Grand Terrace Chlorination Station is located at 24370 Grand Terrace, San Bernardino, California.  The station serves to chlorinate about 10,000 gallons of water per minute (gpm) in the winter and about 32,000 gpm in the summer in a transmission (30 inch to 60 inch) pipeline, which carries water from Waterman Avenue Well tracts to Lincoln/Evens reservoir.  The treated water is then piped into the distribution network, which serves parts of the City of Riverside with potable water.\n\nAt present, one chlorine ton container is stored at the facility.  However, the City of Riverside proposes to store a maximum of four chlorine ton containers at the Grand Terrace Chlorination Station.  A maximum of two chlorine containers will be connected to the chlorination process at the Grand Terrace Chlorination Station; the additional two containers will be used as st"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26455,
      "SummaryText": "and-by containers.\n\nIn normal operation, chlorine is withdrawn from a one-ton chlorine container to supply gaseous chlorine to the chlorinator (Model Wallace & Tiernan Series V-2000).  It is proposed to connect a second ton container to the header system, which will serve as a backup supply.  This backup supply will be automatically actuated when the primary container will be empty.  Chlorine gas is withdrawn from the ton container through a vacuum-regulating valve (Model W & T series ANM 4145), which is installed on the container angle valve through a yoke and a heater.  The heater is installed mainly to prevent freezing of chlorine during cold weather or high chlorine usage.  The heater also vaporizes any liquid chlorine, which may be withdrawn from the chlorine container.  Chlorine gas is pulled under vacuum from the vacuum regulating valve through plastic tubing and the chlorine header line to the chlorinator provided at the chlorination station.  In case of rupture of the plastic tubing connecting the container to the header line, air would be drawn in the line rather than chlorine being released, and the vacuum regulator would shut down the chlorine supply at the container angle valve, operating as a shutoff valve.  A pressure relief valve is provided in the vacuum-regulating valve that opens and vents chlorine through a plastic tubing inside the building when vacuum is broken and the pressure in the line reaches 26 inches of water.  From the chlorinator, the gas is pulled by vacuum to an ejector located within the Grand Terrace Chlorination Building.  In the ejector, chlorine gas is dissolved into mixing water to form a concentrated solution.  This solution is then mixed with the drinking water supply in the pipeline and result in an average of 0.5 ppm chlorine residual.\n\nA chlorine leak detector with two probes is provided to detect chlorine leaks in the chlorine storage and chlorination room.  The detector activates an alarm system which includes: (1) a fla"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26455,
      "SummaryText": "shing red light over the entry door to the building; (2) an audible alarm over the entry door to the building; and (3) an alarm at the Control Room located at 2911 Adams Street, City of Riverside Public Utilities Department, Water Production and Operation Office.  Upon detection of chlorine concentration of 1 to 3-ppmv inside the chlorine storage and chlorination room, the chlorine detector enunciates a chlorine leak alarm in the Control Room.\n\nUpon detection of chlorine concentration higher than 3-ppmv, the following process will be initiated: (1) the normal ventilation will be shutoff to contain the chlorine gas within the room; (2) local visual and audible alarms will be actuated; (3) remote alarms at the Control Room and the chlorine scrubber control panel will be activated; and (4) the selected duty caustic recirculation pump will be started.  If the selected duty caustic circulation pump fails to start, the standby recirculation pump starts automatically and an alarm will be annunciated at the control panel.\n\nAs mentioned above, the existing chlorination station stores and handles less than RMP threshold quantity of 2,500 pounds.  However, it is proposed to start storing and handling chlorine in quantities more than the RMP threshold quantity of 2,500 pounds from August 5, 2002.  The chlorination operation will be run continuously, 24 hours per day.  Thus, the Grand Terrace Chlorination Station will have one RMP covered process on August 5, 2002.  Since the facility is subject to California Occupational Safety and Health Administration Process Safety Management Plan requirements, the Grand Terrace Chlorination Station chlorine process will be classified as a Risk Management Program Level 3 Process.\n\nThe Grand Terrace Chlorination Station is normally unmanned and water treatment operators visit the facility daily and respond to any trouble alarms, which may occur.\n\nOffsite Consequence Analysis Results:\nThe offsite consequence analysis includes consideration of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26455,
      "SummaryText": "two release scenarios, identified as \"worst-case release scenario\" and \"alternative release scenario.\"  The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10-minutes,\" due to an unspecified failure. The alternative scenario is defined as \"more likely to occur than the worst-case release scenario.\"\n\nRMP and CalARP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario that is estimated to create the greatest distance in any direction to a toxic endpoint resulting from an accidental release of regulated toxic substances from covered processes.  Only passive or administrative controls are allowed for this scenario to reduce offsite impacts.  The release of one-ton (2,000 pounds) of chlorine over 10-minutes represents the worst-case release quantity for the single covered process at the Grand Terrace Chlorination Station.  The release rate will thus be 200 lb./min.\n\nEPA and CalARP regulations require that the models used for dispersion analysis should appropriately account for the density of the released gas.  The RMP*Comp software used for the consequence analysis accounted for the dense gas behavior of chlorine releases.\n\nRMP and CalARP rules require that a scenario, which results in offsite toxic endpoint distance and is more likely to occur than the worst-case scenario, should be selected as the alternative release scenario, unless no such scenario exists.  Unlike the worst-case scenario, the alternative release scenario may consider \"active\" mitigation such as automatic shutoff valves, excess flow valves, and containment with scrubbers.  Active mitigation is defined as requiring mechanical, electrical, or human input.\n\nSince chlorine is the only regulated toxic substance used at the facility, only one alternative scenario was selected for the offsite consequence analysis.\n\nThe alternati"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 26455,
      "SummaryText": "ve release scenario selected for the Grand Terrace Chlorination Station involved the release of chlorine through a leak in the container body such as a hole.  This scenario can occur if the container is dropped and cracked during transportation or has something dropped onto it while in the building.\nThe operators present in the control room would be warned of the leak by the chlorine detector installed at the Grand Terrace Chlorination Station.  It is assumed that the emergency response personnel would respond within 60-minutes and seal the leak.\n\nIt should be noted that the occurrence of this scenario is highly unlikely because the containers are constructed in a way that damage from a short drop or impact from being struck would not result in any cracks in the container body.  Only under a large force would the container crack and leak.\n\nThe chlorine release rate was estimated at 3.0 lb./min (W&T, 2001).\n\nFinally, no chlorine release that could have caused safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the Grand Terrace Chlorination Station during the last five years.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe City of Riverside has prepared a federal and California Process Safety Management Program.  The City of Riverside accidental release prevention program is based on the following key elements:\n\n* A management system.\n* Detailed process safety information that is readily available to staff, emergency responders, and contractors.\n* A preventive maintenance program.\n* Performance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n* Use of industry recommended process and safety equipment.\n* Use of effective operating procedures.\n* Training of the operators and maintenance staff.\n* Implementation of an incident investigation, inspection, and auditing program using"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 26455,
      "SummaryText": "qualified staff.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine containers, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and alarms, and a chlorine scrubber.\n\nProcess and Chemical Safety Information:\nChemical data have been assembled to include health hazard, chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine background information and MSDS sheets.\n\nProcess Hazard Analysis :\nA detailed process hazard analysis (PHA) was conducted on December 8, 2000 for the chlorination system equipment and procedures.  A number of equipment and procedural changes were recommended as part of the PHA.  These recommendations have already been implemented.  The PHA for the chlorination system will be updated within a five-year period or whenever there is major change in the process.\nA seismic walkthrough was also performed; no new recommendations have been made based on this seismic walkthrough.\n\nOperating Procedures:\nThe City of Riverside maintains written operating procedures that provide clear instructions for the chlorine process. The operating procedures include ton-containers connection/disconnection, start-up, normal operation, and shutdown procedures.  Operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine equipment, and reconfiguration of the facilities.\nTraining \nThe City of Riverside employees presently involved in operating or maintaining the chlorine process are trained in an overview of the process and applicable operating and maintenance procedures.  The City of Riverside ensures that each employee newly assigned to the chlorine process, is trained and tested to be competent in the operating procedures listed pertaining to their duties.  Each e"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 26455,
      "SummaryText": "mployee (presently involved in operating the chlorine process) has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including emergency response.\nRefresher training is provided annually to each employee operating the chlorine process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the City of Riverside ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\nContractors\nThe City of Riverside has procedures in place that ensures that the contractors are properly informed of the hazards, access limitations to the process area, and emergency response procedures, and prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the emergency response plan.\n\nPre-Startup Safety Review and Mechanical Integrity Program\nThe City of Riverside ensures that a pre-startup safety review is completed for any new covered-by-the-rules process, or for significant modifications to an existing covered process that requires a change in the process safety information.  The City of Riverside maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The City of Riverside mechanical integrity program includes the following:\n* Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience.\n* Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\n* Training of maintenance personnel in preventive maintenance program procedures; safe work practices such as lockout/tagout, l"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 26455,
      "SummaryText": "ine or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\n\nHot Work Permits and Management of Change\nThe City of Riverside requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered process.  The City of Riverside uses a permitting program to ensure hot work is conducted safely on or near a process involving chlorine.\n\nThe City of Riverside provides a system to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions. This system allows the City of Riverside staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\n\nInternal Compliance Audits\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  The City of Riverside will assemble an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\nThe City of Riverside investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are r"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 26455,
      "SummaryText": "esolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\n\nFive-year Accident History Summary\nNo chlorine releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the Grand Terrace Chlorination Station during the last five years.\n\nEmergency Response Program Summary\nThe City of Riverside is a first responder, its employees respond to chlorine accidental releases.  Depending on the severity of the accidental release, external resources such as the County of San Bernardino Fire Department may be solicited to aid in handling a chlorine release.\nAs part of the emergency response program, the City of Riverside has developed and implemented an emergency response plan for the purpose of protecting public health and the environment.  The following elements are included:\n(a)An emergency response plan, maintained at the Grand Terrace Chlorination Station and at the Control Room containing:\n* Organizational structure (chain-of-command) and responsibilities of various City of Riverside personnel.\n* Procedures for planning and coordination with off-site emergency response organizations.\n* Details of the training programs for all employees involved with the chlorination process, contractor training, and medical surveillance of the City of Riverside personnel who respond to chlorine releases.\n* Details of emergency recognition and prevention at the Grand Terrace Chlorination Station.\n* Procedures for informing the public and local emergency response agencies about accidental releases.\n* Documentation of proper first aid and emergency medical treatment necessary to treat accidental human exposures and the detailed information on emergency health care.\n* Procedures and measures for emergency response after an accidental release.\n(b)Procedures"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 26455,
      "SummaryText": "for the use of emergency response equipment and for its inspection, testing, and maintenance.\n(c)Training in relevant procedures for all employees involved with the chlorination process.\n(d)Procedures to review and update, as appropriate, the emergency response plan to reflect changes and ensure that employees are informed of changes.\n\nPlanned Changes to Improve Safety\nBased on the 2001 PHA, 36 changes to further improve chlorine safety were identified, including the update of the P&IDs for the chlorination system.  All 36 recommendations have been implemented."
    }
  ]
}