{
  "FacilityID": 26453,
  "FacilityName": "Decatur Utilities Dry Creek Wastewater Plant",
  "FacilityStr1": "902 Wilson Street NW",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "AL",
  "FacilityZipCode": "35601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01103",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "34.628333",
  "FacilityLongDecDegs": "-86.998611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "LW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120323696,
  "ParentCompanyName": "City of Decatur",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Kem M. Carr",
  "OperatorStr1": "P.O. Box 2232",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35609",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": "NPDES #AL004859",
  "EPAFacilityID": "100000050794",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2002-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-08-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2002-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.2.5",
  "FRS_Lat": 34.62107,
  "FRS_Long": -86.99649,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 37883,
      "AltID": "Chlorine Process",
      "FacilityID": 26453,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 49622,
          "ProcessID": 37883,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 38799,
          "ProcessID": 37883,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 14738,
              "Process_NAICS_ID": 38799,
              "SafetyReviewDate": "2002-05-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute: Phamphlt #17 Cylinder and one ton container procedures for package chlorine. Phamphlet #6, Piping systems for dry chlorine. Wallace & Tiernan; Manual for  V-Notch Chlorinators.",
              "FR_Comments": "All piping, equipment, and appurtenances within process are designed and specified for chlorine use.",
              "HazardReviewDate": "2002-06-20 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-06-20 00:00:00",
              "TrainingReviewDate": "2002-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-05-01 00:00:00",
              "EquipmentInspectionDate": "2002-06-18 00:00:00",
              "EquipmentTested": "Chlorine process inspection. Pressure testing of piping.",
              "ComplianceAuditDate": "2002-06-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 15418,
                  "PreventionProgram2ID": 14738,
                  "ProcessChemicalID": 49622
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 26453,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-05-01 00:00:00",
    "ERTrainingDate": "2002-06-04 00:00:00",
    "CoordinatingAgencyName": "Morgan county Emergency Management",
    "CoordinatingAgencyPhone": "2563514620",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26453,
      "SummaryText": "Part 68.155 Executive Summary\n\nThe owner or operator shall provide in the RMP an executive summary that includes a brief description of the following elements:\n\n*     Accidential release prevention and emergency response policies at the stationary source.\n\n*     The stationary source and regulated substances handled.\n\n*     The worst case release scenario(s) and the alternative release scenario(s), Including administrative\n       controls and mitigation measures to limit the distance for each reported scenario.\n\n*     The general accidential release prevention program and chemical-specific prevention steps.\n\n*     The five-year accident history.\n\n*     The emergency response program. \n\n*     Planned changes to improve safety.\n\n\nPart 68.155 Section A\n\nAccidential Release Prevention and Emergency Response Policies:\n\nDecatur Utillities operates the Dry Creek Wastewater Treatment Plant where chlorine is used to disinfect the plant effluent water during the months of June, July, August and September. Chlorine is the only regulated substance subject to the CFR Part 68 at Dry Creek.\n\nThe company has in place, annual mandatory chlorine safety training for all empolyees who work at the plant.\n\nAdditionally, specific training is required in all aspects of the operation of the chlorine process for those who operate the process.  Training in maintenance and repair of the chlorine process equipment is conducted with all employees who are required to maintain and repair any part of the system.\n\nDecatur Utilities has developed a Chlorine Emergency Reponce Program to fulfill the requirements of OSHA Part 1910.38. The emergency response program is coordinated with the local and state emergency response plan.\n\n\nPart 68.155 Section B\n\nStationary Source and Regulated Substances Handled \n\nThe Dry Creek Treatment Plant has one stationary source capable of holding 12 one ton containers of chlorine gas. The combined piping and containers may hold a maximum of 24,028 pounds of chlorine gas."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26453,
      "SummaryText": "The covered process consist of piping, as per Chlorine institute pamphlet 6, Piping Systems for Dry Chlorine, and chlorine injection equipment specifically designed for the process.\n\n\nPart 68.155 Section C\n\nWorst Case and Alternative Case Scenarios\n\nDecatur Utilities has used release scenarios for both worst case and alternative case releases from, The Compliance Guidance and Model Risk Management Program for Water Treatment Plants, sponsored jointly by The American Water Works Association Research Foundation and The U.S. Environmental Protection Agency Office of Research and Development, and published By AWWA in 1998*. Additionally, the rate of release and endpoints cooresponding to the above scenarios were derived from EPA CEPP, RMP Series, Risk Management for Wastewater Treatment Plants.**\n\nWorst Case Scenario\n\nThis scenario was modeled as a direct release over a 10 minute period, as required by the regulations.  It involves catastrophic failure of a one ton cylinder due to impact, corrosion, or construction defect. The entire contents of a full container, 2,000 pounds, is released over a ten minute period at a rate of 200 pounds per minute.*  The toxic endpoint was modeled as 1.3 miles radius in all directions from the point of release.**  The affected population was estimated at 910.***\n\nAlternative Case Release Scenario\n\nThis scenario assumes release of chlorine gas through 20 feet of 1 inch schedule 80 pipe due to complete failure of the pipe. The scenario assumes that the pressure in the pipe is approximately 97.5 pounds per square  inch, which is the vapor pressure of chlorine at 77 degrees F. It also assumes that the rate of release is limited by the pipe dimensions  and not by any valve or opening upstream of the release. The release is from an infinite source (e.g., 6 or more containers). The release durition is 60 minutes at an average release rate of 72 lb/min. The total release is 4,320 pounds with a toxic endpoint of 0.8 miles. The population is est"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26453,
      "SummaryText": "imated at 560.\n\nPart 68.155 Section D\n\nPrevention Program Elements\n\nManagement System\n\nDecatur Utilities has documented a management system and has assigned overall responsibility for the development and implementation of the Risk Management Program to a qualified individual. The management system clearly delineates accountability and responsibility of specific elements of the program to the various RMP management group.\n\n\nProcess Safety Information\n\nCurrent process safety information is available to all operators of the covered process and maintenance employees in accordance with CFR 40 Part 68.48. Safety information includes current MSDS sheets, maximum intended inventory, safe upper and lower temperatures, pressures and flows, process equipment and material specifications, safe operating procedures and codes and standards used in the design and construction of the process.\n\n\nProcess Hazard Analysis\n\nA hazard analysis has been performed for the program II covered process. A checklist was used based on The Chlorine Institute's, The Chlorine Manual, pamphlet 1, 6th edition, January 1997. Causes of potential accidental release scenarios were investigated and safegaurds in place to prevent a release. The process hazard analysis was documented  and will be updated every five years.\n\n\nOperating Procedures\n\nProcess operating procedures were reviewed, documented, and refresher training conducted with all plant operators and maintenance employees. Operating procedures cover all phases of process operations including system start-up, temporary operations,  emergency shutdown, normal shutdown, and start-up following an emergency shutdown. Process limits were reviewed and documented. Emergency first aid care for chlorine exposures are outlined and included in training.\n\nTraining\n\nChlorine safety training and Red Cross first aid and CPR training is mandatory for all plant employees and is conducted annually. Other mandatory training is conducted every 3 years for all operators"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 26453,
      "SummaryText": "and maintenance employees and includes emergency first aid for chlorine exposures, process safe upper and lower limits, chlorine emergency responce plan, operating procedures, and safe loading/unloading of ton containers. Training for all maintenance employees is conducted every 3 years and covers process and chlorinator maintenance and repair, chlorine piping specifications, and management of change procedures. Documentation of employee attendance at all training sessions are maintained fo a period of not less than 5 years.\n\nMechanical Integrity\n\nAll process equipment, piping, ventilation system, monorail and hoist have a documented schedule of inspection and preventive and periodic maintenance. All maintenance inspection and testing on chlorine process equipment is conducted as per manufacturer's recommendations and is consistent with accepted engineering practices. Any deficencies identified during such maintenance and inspection are addressed in a safe and prompt manner. Chlorine is present on site only during the months in which chlorination is required by discharge permit (June-September).\n\n\nPart 68.58\n\nCompliance Audits\n\nCompliance audits are conducted every 3 years in accordance with this part. This audit is conducted by a team of at least 3 persons, one of whom is knowledgeable in the process. A report of the audit findings is generated following the audit and all deficiencies or recommendations are promptly adresses and the resolution is documented. The two most recent audits are maintained at the facility.\n\n\nPart 68.60\n\nIncident Investigation\n\nSpecific incident investigation reporting and documentation procedures have been implemented and are followed in accordance with this part in response to any incident involving a covered process that did or could have reasonably resulted in a catastrophic release of chlorine gas. The incident investigation is conducted as soon as possible but no later than 48 hours following the incident. Following the investigatio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 26453,
      "SummaryText": "n a summary report is generated and includes, at a minimum, the following information: date of incident, date the investigation began, description of the incident and any contributing factors, and any corrective action or recommendations resulting from the investigation.\n\n\nPart 68.155 Section E\n\nFive-year Accident History\n\nAn accidental release is defined in part 68.42 Section A as having resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. Decatur Utilities has had no accidental release within the past five years.\n\n\nPart 68.155 Section F\n\nEmergency Response Program\n\nDecatur Utilities has in place an emergency response plan that is coordinated with both state and local emergency response plans, (LEPC).  Additionally, a specific plan has been developed for chlorine emergencies that follow OSHA standard 1910.38.  The plan is reviewed and training is conducted with all plant operators and maintenance employees every 3 years.  The plan includes comprehensive procedures for onsite emergencies and is designed to coordinate with the state and local emergency response plan.\n\n\nPart 68.155 Section G\n\nPlaned Changes to Improve Safety"
    }
  ]
}