{
  "FacilityID": 2655,
  "FacilityName": "Acordis Cellulosic Fibers Inc.",
  "FacilityStr1": "U.S. Highway 43 North",
  "FacilityStr2": null,
  "FacilityCity": "Axis",
  "FacilityState": "AL",
  "FacilityZipCode": "36505",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.958889",
  "FacilityLongDecDegs": "-88.021111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8150617,
  "ParentCompanyName": "Akzo Nobel Finance United States Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Acordis Cellulosic Fibers Inc.",
  "OperatorStr1": "P.O. Box 141",
  "OperatorStr2": null,
  "OperatorCity": "Axis",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36505",
  "OperatorZipCodeExt": "0141",
  "RMPContact": "Dr. N.P. Burrows",
  "RMPTitle": "Director, Environment Services",
  "FTE": 400,
  "OtherEPAFacilityID": "36505CRTLUSHIG",
  "EPAFacilityID": "100000033493",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not yet issued",
  "SafetyInspectionDate": "1996-06-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-09-17 00:00:00",
  "DeRegistrationEffectiveDate": "2001-07-27 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.95889,
  "FRS_Long": -88.02111,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 2969,
      "AltID": null,
      "FacilityID": 2655,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3034,
          "ProcessID": 2969,
          "NAICSCode": "325221",
          "_desc": {
            "NAICS_CODE": "325221",
            "NAICS_DESCRIPTION": "Cellulosic Organic Fiber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3168,
          "ProcessID": 2969,
          "ChemicalID": 8,
          "Quantity": 820000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 8,
            "ChemicalName": "Carbon disulfide",
            "CASNumber": "75-15-0",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503168,
          "ProcessID": 2969,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2655,
      "SummaryText": "ACORDIS CELLULOSIC FIBERS INC\nAXIS, ALABAMA\n\nEPA Risk Management Plan\nExecutive Summary\n\nWho we are . . .\n\nAcordis Cellulosic Fibers Inc. (formerly Courtaulds Fibers Inc.), is part of the Acordis group formed by the amalgamation of the fibers businesses of Courtaulds plc of Great Britain and Akzo Nobel of the Netherlands.  \n     Acordis is located in Axis, Ala., on U.S. Highway 43 North 7 miles north of I-65. When fully operational (the Tencel plant is temporarily closed due to the Asian economic crisis), Acordis employs 580 people and puts about $125 million annually into the local economy.\n     Acordis recently completed a $30 million program to reduce air emissions by two-thirds from 1990 levels and continues to examine cost-effective means for future improvements.  In addition, Acordis spends $4.5 million annually on environmental protection programs.\n\n What we do . . .\n\nAcordis is the largest U.S. manufacturer of rayon. Valued for its absorbency, rayon is used for fashion apparel, drapery and upholstery fabrics, disposable wipes, feminine hygiene products and medical articles.  A by-product, Anhydrous Sodium Sulphate,  is used in the manufacture of household detergents, carpet fresheners and glass.\n     Acordis also produces Tencel, a new synthetic fiber that is used in upscale apparel, home furnishings, technical fabrics and non-woven materials.  The principal raw material for rayon and Tencel is cellulose, a renewable natural resource which comes from managed tree farms.  The manufacture of rayon uses sodium hydroxide, sulphuric acid and carbon disulfide, while Tencel's other raw material is amine oxide.\n\n Risk Management Planning\n      The U.S. Environmental Protection Agency (EPA) has established rules requiring companies handling certain chemicals to develop Risk Management Plans.  Acordis' plan has been developed following EPA requirements examining two types of accident - - the Worst Case Scenario and the  Alternate Release Scenario - - for the only chem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2655,
      "SummaryText": "ical we have that is covered by the rule - Carbon Disulfide (CS2).\n\n Worst Case Scenario\n     For a Worst Case Scenario, EPA guidelines require Acordis to assume its largest tank or pipeline containing the chemical was full when spilled to the ground and that the chemical evaporated and was carried away by a slow breeze.  Acordis' storage tanks are submerged in water in a large, reinforced concrete containment which is located above ground.  Therefore, failure of one or all tanks would not result in on- or off-site harm.  The worst case scenario we have chosen is the complete failure of the pipeline between the Acordis plant and Akzo Nobel which contains about 9 tons of carbon disulfide. The cloud from this would reach offsite public receptors. \n\n Alternate Release Scenario\n   The Alternate Release Scenario is an accident that has some possibility of happening, unlike the Worst Case Scenario which is extremely unlikely. \n   The Alternate Release Scenario would be a leak of carbon disulfide from a gasket in the pipeline between Akzo Nobel and Acordis. In this instance, the distance is 1/2 mile.  The release would be mitigated by an automatic leak detection and shut down system.  \n\n Release History\n     Acordis has had no releases as defined by the EPA over the past five years.  The following however, is a history of all other accidental releases reported to regulators. These were all liquids which do not evaporate rapidly and were cleaned up immediately with no environmental impact.\n\n                1994 1995 1996 1997 1998\nEPA            0       0       0       0       0\nAll               2       4       2       1       0\n\n Accident Prevention\n      Acordis has almost 100 years of experience in using carbon disulfide safely.  Acordis is covered by OSHA's Process Safety Management standard.  Acordis uses the \"Layers of Protection\" approach to prevent accidental releases.  This approach includes:  \n\nDesigning for Safety\n7 All carbon disulfide systems are reviewed to f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2655,
      "SummaryText": "ind and prevent possible accident routes.\n7 Automatic shutdowns are built into the system.\n7 Care is taken in design to avoid leaks and fires.\n7 Design and equipment changes are reviewed to ensure no hazards are introduced.\n \nMaintaining for Safety\n7 Special permits are required for all work on carbon disulfide systems.\n7 Maintenance procedures are written in detail.\n7 All safety systems are checked regularly.\n\n Operating for Safety\n7 The process is closely monitored by computer to minimize the chance of error.\n7 Operating instructions and troubleshooting guides are in place to help operators deal with all possibilities.\n7 Operators are trained to understand process hazards and operate the plant safely.\n7 We inspect the carbon disulfide pipeline twice during the 4-6 hours it is used on the days it is used. \n \nAuditing for Safety\n7 A detailed audit is completed every three years to ensure compliance with Process Safety Management rules set down by the Occupational Safety and Health Administration (OSHA).\n7 Frequent safety inspections are done to make sure people are working safely.\n7 All accidents and incidents are investigated for basic cause and to ensure preventive measures are in place.\n7 Plant modifications and new plant construction are reviewed prior to startup not only to ensure proper construction but that training and procedures are complete.\n\n Responding for Safety - Training and Preparation\n7 Emergency Response Teams trained to deal with fires and hazardous materials incidents, certified medical responders, trained nurses, and a fully equipped Emergency Response Vehicle are available on site around the clock.\n7 Internal drills are conducted regularly, including emergency plant shutdown procedures.\n7 Mutual Aid drills are conducted annually with other members of the LeMoyne Industrial Park where we are located.\n\n   Should an accident happen, the plant is equipped with fixed fire-fighting systems including sprinklers, monitors, fire extinguishers and hoses,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2655,
      "SummaryText": " as well as emergency shut-down systems.  If necessary, the community alert sirens will be activated and information will be provided via the Emergency Broadcast System.\n\nAcordis Cellulosic Fibers Inc.\nAxis Plant                                        \nU.S. Highway 43 North\nPost Office Box 141\nAxis, AL 36505\n\nContacts:\n\nDavid Christian\nVice President, Operations\n(334) 679-2221\n\nNick Burrows\nDirector, Environment Services\n(334) 679-2369"
    }
  ]
}