{
  "FacilityID": 26932,
  "FacilityName": "General Mills, Inc.",
  "FacilityStr1": "500 West Walnut Street",
  "FacilityStr2": null,
  "FacilityCity": "Johnson City",
  "FacilityState": "TN",
  "FacilityZipCode": "37604",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47179",
  "LEPC": "Washington County E M A",
  "FacilityLatDecDegs": "36.310833",
  "FacilityLongDecDegs": "-82.356667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3375144,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "General Mills, Inc.",
  "OperatorStr1": "500 West Walnut Street",
  "OperatorStr2": null,
  "OperatorCity": "Johnson City",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37604",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Vossberg",
  "RMPTitle": "Environmental Manager",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080734",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-04-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Revision 1 Submittal Dated October 23, 2002",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-11-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-11-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Commercial Software Vendor",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-10-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2003-03-01 00:00:00",
  "AnniversaryDate": "2007-10-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 36.3113,
  "FRS_Long": -82.35557,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38599,
      "AltID": "Chlorine",
      "FacilityID": 26932,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 39515,
          "ProcessID": 38599,
          "NAICSCode": "311211",
          "_desc": {
            "NAICS_CODE": "311211",
            "NAICS_DESCRIPTION": "Flour Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 50794,
          "ProcessID": 38599,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 550794,
          "ProcessID": 38599,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26932,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccident Release Prevention Program and Emergency Response Policy\n\nIt is the policy of the General Mills Operations, Inc. (GMOI), Johnson City, Tennessee, facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program. The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to GMOI employees, the public and the environment. This objective will be accomplished by designing, operating, and maintaining the process per Chlorine Institute industry standards,  providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.\n\nGMOI management is committed to providing the resources necessary to implement this policy.\n\nFacility Description\n\nThe GMOI facility utilizes flourmills to produce flour. The raw materials used in the processes are wheat and chlorine gas. Support operations include a grain elevator system, a quality assurance/control laboratory, and administrative offices.\n\nOne chemical is utilized at the facility, in sufficient quantities to be subject to the requirements of 40 CFR Part 68, RMP. The chemical is chlorine and is used to bleach or age the flour.\n\nWorst-Case and Alternative-Release Scenarios\n\nFor the worst case and alternative relase scenarios, the USEPA approved RMP*Comp program and guidance documents were used for assistance.\n\nReleasing the contents of one of the 2,000 pound chlorine containers, in a ten minute period, represents the worst-case scenario.  The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint.  The alternative scenario was chosen as a rupture of a 3/8\" flexible tubing on a ton container, initiating the maximum possible releas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26932,
      "SummaryText": "e rate from an open container. The resulting distance to the endpoint also extends offsite, and public receptors immediately adjacent to the facility are within the distance to the endpoint.\n\nDiscussion\n\nThe results included in this analysis indicate that the worst-case release for the chlorine process can extend offsite and reach public receptors.  However, it is important to emphasize that a worst-case release is extremely unlikely to occur because of the many safety features inherent in the design and operational systems for the plant.\n\nAlthough the alternative release scenario is based on credible assumptions, a release of this magnitude has never occurred at this facility.  The alternative scenario was selected from a number of possible scenarios, based on their potential to reach offsite.\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe Johnson City facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public, and to the environment. These regulations include:\n\n* 40 CFR Part 68, Accidental Release Prevention\n* 29 CFR Part 119, Process Safety Management\n\nThe key concepts in GMOI release prevention program are employee participation, appropriate design, operation, and maintenance of equipment, and appropriate training of all employees.\n\nEmployee participation in the release prevention program is encouraged and supported by GMOI management. Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the chlorine system. GMOI employees are also members of the facility emergency response team.\n\nGMOI policy is to construct all new equipment, systems, and facilities in accordance with the Chlorine Institute industry standards. This ensures the approp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26932,
      "SummaryText": "riate safety and release prevention systems are included from the beginning of each project and as a result of a management of change.\n\nGMOI is committed to providing appropriate training to all employees regarding safety procedures. New employees are provided comprehensive safety training during their initial orientation for the facility. In addition, GMOI conducts regularly scheduled safety training for all employees each year. Specific training is provided to mill, operating, and maintenance personnel for the Chlorine system.\n\nFive Year Accident History\n\nGMOI has not had a release of chlorine from the covered process that meets RMP reporting criteria in the past 5 years. \n\nEmergency Response Program\n\nGMOI has an emergency evacuation plan for the facility. GMOI has 24-hour security staff that monitors the Chlorine  alarm system and notifies the local HazMat team (911) in the event of an emergency.\n\nPlanned Changes to Improve Safety\n\nGMOI and American Ingredients Company, Inc. (chlorine supplier and service contractor)  completes a thorough review of the chlorine systems each time a design change is implemented. The system is also evaluated each time the PHA is revised. GMOI is committed to using these methods to identify and implement ways to improve the safety of these systems. AIC conducts quarterly and annual inspections of the chlorine process under contract."
    }
  ]
}