{
  "FacilityID": 26985,
  "FacilityName": "Bellvue Water Treatment Plant",
  "FacilityStr1": "4505 Filter Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Bellvue",
  "FacilityState": "CO",
  "FacilityZipCode": "80512",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08069",
  "LEPC": "Larimer County LEPC",
  "FacilityLatDecDegs": "40.654",
  "FacilityLongDecDegs": "-105.193",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "PP",
  "FacilityURL": "www.ci.greeley.co.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 82649583,
  "ParentCompanyName": "City of Greeley",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Greeley",
  "OperatorStr1": "1100 10th Street 3rd Floor",
  "OperatorStr2": null,
  "OperatorCity": "Greeley",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80631",
  "OperatorZipCodeExt": "3808",
  "RMPContact": "Andrew Degner",
  "RMPTitle": "Water Treatment Plant Superintenden",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000055753",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2002-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2002-11-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2002-11-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-11-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.654,
  "FRS_Long": -105.193,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 38659,
      "AltID": "22131",
      "FacilityID": 26985,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 39575,
          "ProcessID": 38659,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 50854,
          "ProcessID": 38659,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 550854,
          "ProcessID": 38659,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 26985,
      "SummaryText": "The City of Greeley Bellvue Water Treatment Plant (\"WTP\") accidental release prevention policy addresses the chlorine that the facility uses for drinking water disinfection purposes.  The policy combines advanced technology, standardized operating procedures, personnel training requirements, and a top-down management commitment to safe chlorine handling practices.\nThe Bellvue WTP is located northwest of Fort Collins, Colorado near the mouth of the Cache la Poudre River Canyon.  The plant provides high-quality drinking water to the City of Greeley, Colorado.  An inventory of six one ton chlorine containers is regularly maintained on-site in a dedicated chemical building.  The plant operates 24 hours per day, 365 days per year.  Resident operators address after-hours alarms and monitor overall facility security.\nThe plant performed the required off-site consequence analysis (\"OCA\") for the agency defined \"worst case\" and \"alternative\" release scenarios.  The plant utilized the OCA guidence for chlorine published by the United States Enviromental Protection Agency (\"EPA\") in the Risk Managment Program Guidence for Wastewater Treatment Plants (40 CFR Part 68).\nThe worst case scenario must assume the catastrophic release over ten minutes of the entire contents of a full one ton container of chlorine, certain specified atmospheric conditions and the failure of all active mitigation systems.  As permited by the guidence, the facility assumed that the chemical building would provide a degree of passive mitigation by slowing the release of chlorine gas to the atmosphere.  Applying the guidence, and assuming an unobstructed (\"rural\") landscape, the plant determined that the defined worst-case release scenario would have an off-site toxic endpoint of 2.2 miles.  (The toxic endpoint is identified as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing ordeveloping irreversible or other"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 26985,
      "SummaryText": " serious health effects or symptoms which could impair an individuals ability to take protective action.)\nThe facility is also supposed to identify an alternative release scenario that is more likely to occur than the worst-case scenario, but still result in an off-site toxic endpoint.  The plant utilized a scenario involving the rupture of a 5/16 inch tubing releasing chlorine gas at a rate of 15 pounds per minute.  Applying the guidence, the maximum duration was assumed to be 60 minutes, and the total chlorine release from this scenario would be 900 lbs. Applying the guidence, and assuming a rural landscape, the plant determined the alternative release scenario would have an off-site toxic endpoint of two tenths of a mile (0.2 miles).  Because the plant has a chlorine scrubber with a 2000 lb. capacity, the release to the enviroment is expected to be minimal and is not anticipated to migrate off-site.\nThe Bellvue WTP Accidental Release Prevention Program is based on the following elements:\n    Advanced process and safety equipment;\n    A chlorine gas detector alarm that triggers at concentrations greater than one part per million.  This alarm will automatically start the chlorine gas scrubber.  This scrubber is capable of neutralizing the entire contents of a one ton container.  ( The alarm consists of audible horns located throughout the plant and strobe lights on the exterior of the chemical building.  This alarm is also connected to a computerized auto-dialing system that alerts on call personnel.  Additionally, this alarm is connected to the SimplexGrinnel Fire Alarm System and will notify the Poudre Fire Authority );\n    Standardized operating procedures;\n    Training of operators and maintenance personnel in the chlorine process;\n    Preventive maintenance program for chlorine process equipment;\n    Annual hazard review of chlorine process equipment and procedures;\n    Auditing and inspection program;\n    Investigation program (which will investigate future i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 26985,
      "SummaryText": "ncidents that could reasonably result in a chlorine release); and\n    Personnel protective equipment, including self-contained breathing apparatus.\n\nNo accidental releases of chlorine have occurred at the Bellvue WTP in the past five years.\nThe Bellvue WTP Emergency Response Program utilizes local hazardous response personnel to respond to emergencies at the plant.  The program has been reviewed by the Larimer County Office of Emergency Management and coordinated with the Poudre Fire Authority.  These procedures will be reviewed on a annual basis.\n\nIn the summer of 2002 the Bellvue WTP will commence using a new chemical building.  This building will have state-of-the-art safety equipment, including container mounted vacuum regulators and a chlorine scrubber that is designed to safely confine and neutralize the contents of a full one ton container."
    }
  ]
}