{
  "FacilityID": 2709,
  "FacilityName": "North River Wastewater Treatment Plant",
  "FacilityStr1": "856 North River Road",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Crawford",
  "FacilityState": "VA",
  "FacilityZipCode": "22841",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51165",
  "LEPC": "Harrisonburg Joint LEPC",
  "FacilityLatDecDegs": "38.344444",
  "FacilityLongDecDegs": "-78.929167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Harrisonburg-Rockingham Regional Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Curtis Poe, Executive Director",
  "OperatorStr1": "PO Box 8",
  "OperatorStr2": null,
  "OperatorCity": "Mt. Crawford",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22841",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Hevener",
  "RMPTitle": "Environmental Manager",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000034465",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-02-17 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-06-07 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-30 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.33944,
  "FRS_Long": -78.93056,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3025,
      "AltID": "Disinfection",
      "FacilityID": 2709,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3090,
          "ProcessID": 3025,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3226,
          "ProcessID": 3025,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 3227,
          "ProcessID": 3025,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503226,
          "ProcessID": 3025,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503227,
          "ProcessID": 3025,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2709,
      "SummaryText": "A. The Harrisonburg-Rockigham Regional Sewer Authority's (HRRSA) accidental release prevention policy involves implementing all applicable program elements and procedures listed by the U.S. Environmental Protection Agency (EPA) under 40 CFR Part 68, Risk Mangement Planning.  This is in conjunction with the implementation of the applicable elements and procedures listed by the Occupational Safety and Health Administration (OSHA) under the Process Safety Management Program, Part 1910.119.  HRRSA has coordinated with the Local Emergency Planning Commision (LEPC) through sumbission of information on the substances used that are above threshold quantities (as per the Tier II form, SARA Title III) and site visits by personnel from the local fire department (Bridgewater Fire Department/Rockingham County Fire Department) to familiarize them with the facility.\n\nB.  HRRSA owns and operates the North River Wastewater Treatment Plant (NRWWTP) which is an advanced treatment plant designed to treat 16.0 million gallons of wastewater per day.  The three main stages of treatment used at the plant are:  primary clarification, secondary treatment using the activated sludge method and tertiary treatment using gravity flow filters.  Located at 856 North River Road, Mt. Crawford, VA   22841, the NRWWTP serves the City of Harrisonburg, the Towns of Bridgewater, Dayton and Mt. Crawford and some sections of Rockingham County.  The plant is staffed 24 hours/day, 365 days/year by operations personnel licensed and certified in wastewater treatment operations by the state of Virginia.  As part of the treatment process, chlorine is added to the water (after all other treatment steps have been completed) and allowed to remain in contact with it for thirty minutes for the purpose of disinfecton.  Sulfur dioxide is then added at the end of the thirty minute contact time to neutralize any residual chlorine in the water.  Both chemicals are added at quantities to meet the requirements as set forth b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2709,
      "SummaryText": "y the Virginia Department of Environmental Quality in the plant's discharge permit.  The chlorine and sulfur dioxide are received from the supplier in ton containers and are stored in a separate building on the plant site.  This building is divided into several rooms in which the chemicals, safety equipment and spare parts are stored.  \n\nC.  EPA requires that two scenarios be used in the off site consequence analysis of an accidental release of a toxic substance.  The purpose of the analysis is to determine the distance travelled by the toxic substance released before its concentration decreases to its \"toxic endpoint\" (selected by EPA).   The toxic endpoint is the maximum airborne level below which it is believed most individuals could be exposed to for up to one hour without experiencing or developing serious health effects or symptoms which could impair their ability to take protective action (American Industrial Hygiene Association).  The first scenario is a \"worst case release\" which as defined by EPA requires the owner or operator to assume that the maximum quantity of the toxic substance in the single largest vessel is released as a gas over a period of ten minutes.  The NRWWTP is a progam 3 facility so chlorine was used in this scenario to represent all toxic substances present.  The second scenario is an \"alternative release\" senario and is defined by the EPA as the more likely scenario to occur than the worst case.  Since the NRWWTP is a program 3 facility it is required to submit information on one alternative release scenario for each toxic substance held above threshold quantities, which would be chlorine and sulfur dioxide.\n\nThe atmospheric dispersion modelling for both types of scenarios was performed using EPA's RMP*Comp(TM) modelling program.  This program uses a conservative approach in the modelling, as such, the distance to the endpoint may be overestimated.\n\nThe worst case scenario at the NRWWTP (as defined by EPA) would involve the failure of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2709,
      "SummaryText": "he single largest vessel, in this case, a one 1-ton container of chlorine.  The analysis was conducted using condtions pre-defined by the EPA:  release of the entire amount of the chlorine as a gas in ten minutes, use of the toxic endpoint of 0.0087 mg/L (3ppm) and consideration of the population residing within the full circle with a radius corresponding to the toxic endpoint distance.  This endpoint was selected by the EPA from the American Industrial Hygiene Association's Emergency Response Planning Guideline - Level 2.  In addition, as the chlorine is housed in a separate building which is considered passive mitigation, a mitigation factor of 0.55 was used in the modelling.  In using the conditions set by the EPA, it should be noted that in a release not all of the compressed liquified chlorine would be released as a gas, the bulk of the chlorine would most likely form liquid drop aerosols forming a dense cloud of vapor and liquid droplets.  The population downwind of the release (in the release footprint) would be affected more so than the entire population contained in the circle.  Based on the worst case analysis modelling and the population survey, it was determined that approximately 100 people would be in the area (circle) that would be affected by an accidental release of chlorine under this scenario.\n\nThe modelling for the alternative case senarios at the NRWWTP for both chlorine and sulfur dioxide was based on the scenario of a rupture/break of a flexible connector (pigtail).  This senario was applied to both chemicals since the same type of equipment and procedures are used for both.  A toxic endpoint of 0.0087 (3 ppm) was used for chlorine and a toxic endpoint of 0.0078 mg/L (3 ppm) was used for sulfur dioxide.  These endpoints were selected by the EPA from the American Industrial Hygiene Association's Emergency Response Planning Guideline - Level 2. A mitigation factor of 0.55 was used in the modelling for each chemical since both are housed in a sep"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2709,
      "SummaryText": "arate building which is \n\n\nconsidered passive mitigation.  Leak detectors are also in use and could be considered active mitigation, but a mitigation factor for the detectors was not used in the modellings.  A release duration of sixty minutes was used for each chemical, although this may be conservative due to the fact that leak detectors are used and would alert personnel to a problem initiating a response rather quickly.  The modelling results indicate that the scenario for chlorine and the scenario for sulfur dioxide would not result in an offsite impact from either chemical.\n\n\nD. The accidental release prevention program at HRRSA consists of but is not limited to the following          \n     elements:\n\n          -Training of personnel in process operations, procedures and information on the chemicals.\n          -Process Hazard Analysis(PHA) to indentify and correct problems before they occur.\n          -Inspection and maintenance of equipment.\n          -Adequate inventory of spare parts for process equipment.\n          -Employee involvement in the PHA, review of operating procedures and incident investigations.\n          -Implementation of the OSHA Process Safety Management Program which paralells the Risk\n           Management Program in many areas.                \n          -Submission of Tier II information under SARA Title III to the LEPC and local fire department. \n          -On site visits by personnel from the local fire department.      \n          -Compliance audit every three years to ensure program requirements are being met.\n          -Management of Change procedures.\n          -Use of state of the art, proven process equipment.\n          -Incident investigation procedures.\n          -Annual review of operating procedures.\n\n    Chemical specific prevention steps include:\n\n          -Presence of chlorine and sulfur dioxide leak detectors.\n          -The plant is staffed 24 hours/day, 365 days/year.\n          -Availability of two \"B\" repair kits for t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2709,
      "SummaryText": "on containers.\n          -Wind direction indicated by the use of a wind sock located on top of the chlorine/sulfur dioxide  \n           building.\n          -Backup electrical power.\n          -Spare parts maintained for process equipment.\n          -Emergency backup phone and two-way radio equipment available.\n          -Presence of an observer in a neutral area during container connection operations.\n\n\ne. Five Year Accident History:  No accidental releases of chlorine or sulfur dioxide have occurred at the \n    NRWWTP in the past five years.\n\nf. Emergency Response:  In the event of an accidental release, the Authority's Emergency Action Plan   \n   would be activated, and those areas of the plant being affected by the leak would be evacuated. The\n   local fire department (Bridgewater Fire Department) would be called in to stop and correct the leak.  The \n   Authority is included in the LEPC's response plan.\n\ng. Planned Changes to Improve Safety:  The process training program is being revised."
    }
  ]
}