{
  "FacilityID": 2721,
  "FacilityName": "Alliant Foodservice- Cincinnati",
  "FacilityStr1": "5445 Spellmire Drive",
  "FacilityStr2": null,
  "FacilityCity": "Cincinnati",
  "FacilityState": "OH",
  "FacilityZipCode": "45246",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39017",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "39.302222",
  "FacilityLongDecDegs": "-84.412778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Alliant Foodservice",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alliant Foodservice",
  "OperatorStr1": "One Parkway North",
  "OperatorStr2": null,
  "OperatorCity": "Deerfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60015",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000033536",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-18 00:00:00",
  "SafetyInspectionBy": "Refrigeration Contractor",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-01-16 00:00:00",
  "DeRegistrationEffectiveDate": "2007-01-08 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.30183,
  "FRS_Long": -84.44393,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3038,
      "AltID": null,
      "FacilityID": 2721,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 3240,
          "ProcessID": 3038,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3103,
          "ProcessID": 3038,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 947,
              "Process_NAICS_ID": 3103,
              "SafetyReviewDate": "1998-07-01 00:00:00",
              "PHA_Date": "1998-08-11 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Machine Room Ammonia Detection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-07-22 00:00:00",
              "TrainingReviewDate": "1998-06-25 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-22 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Entire refrigeration system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-06-22 00:00:00",
              "PreStartupReviewDate": "1998-06-25 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-06-25 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-25 00:00:00",
              "ContractorSafetyReviewDate": "1998-06-25 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Alliant Foodservice, Cincinnati, is governed by, and in compliance with OSHA Standard 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals.\n\nThe following administrative and engineering controls are in place to mitigate, or reduce the potential of an accidental release of ammonia from this facility. \n*  Electronic ammonia detection installed in the compressor and vessel rooms. \n    --  At a 50 ppm set point the system engages the 24,000 cfm ventilation system.  \n    -- At a concentration level of 250 ppm, the system activates an audible alarm as well as a flashing light to alert personnel of a possible hazard in the machine room.\n*  High and Low Temp Accumulators are equipped with high level float switches which will shutdown compressors and close the liquid feed solenoid in the event of a high level in the vessel.\n*  Safety relief valves are installed on all pressure vessels, condensers and compressor oil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n*  Compressors are equipped with the following critical safety controls:\n   -- High Pressure Cut Out                   -- Low Pressure Cut Out\n   -- High Discharge Pressure Cut Out\n   -- High Oil Temperature Cut Out\nActivation of any of the above controls will shut down the respective compressor.\n*  Periodic Maintenance program is in place within the maintenance department to ensure the refrigeration system and it's components are maintained in optimum operational and mechanical condition.",
              "_chemicals": [
                {
                  "PrimaryKey": 1072,
                  "PreventionProgram3ID": 947,
                  "ProcessChemicalID": 3240
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 2721,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hamilton County LEPC",
    "CoordinatingAgencyPhone": "5138448020",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2721,
      "SummaryText": "\n                         ALLIANT FOODSERVICE, INC.\n\n                          RISK MANAGEMENT PROGRAM\n\n                                                      EXECUTIVE SUMMARY\n\n\n\n\n\n1.  General accidental release and prevention policy of Alliant Foodservice.\n\n\n\nIn this frozen food distribution center we utilize anhydrous ammonia as a refrigerant.  Anhydrous\n\nammonia is considered hazardous by the Environmental Protection Agency. The same properties\n\nthat make ammonia a valuable refrigerant also makes it necessary to observe certain safety\n\nprecautions during it's use to prevent exposure to our workers, the surrounding community and\n\nthe environment.  It is our policy at Alliant Foodservice to implement the requirements of the Risk\n\nManagement Program by managing and operating this facility in full compliance with all\n\napplicable federal and state regulations that we are governed by. The objective is to minimize the\n\nrisk of an accidental release of hazardous materials. Safety depends directly on our proper\n\nhandling of ammonia. Our plant personnel have been trained on the equipment operating\n\nprocedures and the various safety devices that are incorporated in our facility to prevent the\n\npossibility of accidental releases.\n\n\n\n2.  Stationary source and regulated substance handled.\n\n\n\nAlliant Foodservice, 5445 Spellmire Drive, Cincinnati, Ohio operates a refrigeration system\n\nutilizing anhydrous ammonia as the primary refrigerant. The refrigeration system is located on the\n\nnorth side of the facility in an enclosed two story section of the main building. \n\n\n\nMechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as a\n\nheat exchanging fluid to maintain a desired temperature in an enclosed environment. The\n\nrefrigeration cycle consists of evaporation, compression, condensation and expansion.\n\nEvaporation and condensation are designed to alter the quantity of energy associated with the\n\nrefrigerant. Compression and expansion are designe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2721,
      "SummaryText": "d to change the availability of the associated\n\nenergy. The refrigeration cycle is a closed loop process. The ammonia cycle utilizes fluid\n\ntemperature, pressure and latent heat of vaporization for cooling. The refrigeration system uses\n\nthis phenomenon to remove heat from a desired space, and then to discard that heat through\n\ncondensation, to an area where it is of no consequence.\n\n\n\nThe Alliant Foodservice facility uses ammonia refrigeration to maintain storage room\n\ntemperatures for various types of fresh and frozen food distributed to their customers. The\n\nrefrigeration system contains the following equipment: Four screw compressors, two evaporative\n\ncondensers, two controlled pressure receivers, two accumulators, four transfer drums, six loading\n\ndock evaporators, thirteen cooler evaporators, a floor warming heat exchanger and a system\n\npurger. The refrigeration system contains 10,500 pounds of aggregate ammonia.\n\n\n\nThere are approximately 100 employees at this facility which includes hourly and salary personnel. \n\nThis distribution facility receives and prepares shipment of frozen and refrigerated food products\n\nvia tractor trailers approximately 24 hours a day, six days a week.  \n\n\n\nThe potential hazards that could lead to an accidental release of the ammonia include, but are not\n\nlimited to, equipment failure, damage to piping, damage to equipment, human error, etc.\n\n \n\nAlthough ammonia is a colorless, tasteless liquid, it's dominant characteristic is it's pungent,\n\ndistinct odor.  Persons exposed to ammonia will not voluntarily stay in areas of even small\n\nconcentrations, although these levels would not normally result in any health risks. Risks from\n\naccidental exposure to ammonia in a vapor state are irritations to the eyes, nose and throat. The\n\nextent of irritation depends on the exposure amount and length of time exposed.  \n\nAmmonia is classified non-flammable by the Department of Transportation.  Ammonia will burn,\n\nbut only in a very narrow concentr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2721,
      "SummaryText": "ation level when accompanied with a constant ignition source.\n\n\n\n3. Worst case  and alternate case release scenarios including administrative and\n\nengineering controls to limit/ prevent accidental release.\n\n\n\nWorst case scenario depicts continuous source leak from the High Pressure Receiver (HPR)\n\nlocated inside the plant vessel room.  This vessels normal operating level is 1,400 pounds of liquid\n\nammonia,  approximately 50% of it's total capacity. Although the high pressure receiver is capable\n\nof holding 2,800 pounds, this far exceeds company policy  and engineering controls which limits\n\nthe liquid level to a maximum of 80% at any time.  Considering the \"catastrophic\" possibility does\n\nexist for this vessel to release it's entire contents, engineering controls incorporated into the\n\nsystem would normally prevent such a release.\n\n\n\n     Worst case release scenario criteria for the Alliant Foodservice facility:\n\n\n\n     Ammonia Quantity:                  1,400 pounds\n\n     Rate of Release:                   140 lbs / min. (10 min. release)\n\n     LOC (Level of Concern):            200 ppm  (EPA ERPG-2)  \n\n     Physical State:                    Gas \n\n           Type of Area:                     Urban\n\n     Wind Speed:                        1.5 m/sec\n\n     Distance to Endpoint                    .75 miles\n\n\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief\n\nvalve (SRV) due to an overpressurization condition on a vertical vessel located within the Alliant\n\nFoodservice facility vessel room. The indicated relief valve would be performing exactly as it is\n\ndesigned to do during an overpressurization condition. Valve would open to relieve the over-\n\npressure and vent into the atmosphere via the roof vent pipe.\n\n\n\n     Alternate case release scenario criteria for Alliant Foodservice facility:\n\n\n\n     Ammonia Quantity:                  100 pounds\n\n     Rate of Release:                         20 pounds/min. (11 min. release)\n\n  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2721,
      "SummaryText": "   Wind Speed:                        3.0 m/sec.\n\n     Distance to Endpoint:                   140 yards\n\n     \n\n     The following administrative and engineering controls are in place at Alliant\n\nFoodservice. These controls are designed to eliminate, or reduce the possibilities of an\n\naccidental release from the refrigeration system.\n\n     \n\n     *  Electronic ammonia detection in compressor, vessel and distribution areas.  Alarms tie\n\nin to ADT Security system.  Computer system activates a local audible alarm indicating an\n\nammonia leak in the monitored areas. ADT notifies designated emergency personnel of the\n\npotential problem detected by the system.\n\n     \n\n     *  High level switches are configured to high and low temp accumulators which shut down\n\ncompressor operation and close liquid make-up feed solenoid valves during a high level condition.\n\n\n\n     * All compressors are configured with critical safety controls (high pressure, low pressure,\n\nhigh oil temp cut-outs, etc.) to shut down the respective compressor in the event of an abnormal\n\noperating condition.\n\n \n\n     *  Safety Relief Valves are configured to all pressure vessels, condensers and compressor\n\noil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n\n\n\n     *  Periodic Maintenance Program is contracted through a reputable refrigeration company\n\nto ensure the refrigeration system and it's components are kept in optimum mechanical and\n\noperating status.\n\n\n\n4.  Five-year accident history.\n\n\n\nThe Alliant Foodservice, Inc. facility at Cincinnati has had zero accidental releases to report. \n\n\n\n5.   Emergency Response Program\n\n\n\nThe purpose of the Alliant Foodservice Emergency Action Plan is to:\n\n\n\n     1.   Minimize exposure to our employees and the surrounding community in the event of a\n\n     hazardous material release or spill.\n\n\n\n     2.  Assure the safe emergency evacuation of the plant in the instance that it is required.\n\n\n\n     3.  Provide for prompt"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 2721,
      "SummaryText": " medical attention to any employees who become seriously injured\n\n     or ill at work.\n\n\n\n     4.  Facility management has developed an Emergency Response Plan to ensure a fast and   \n\n           efficient response in the event of an accidental release of hazardous materials. \n\n\n\nOur Emergency Action Plan currently meets requirements as set forth in OSHA 29 CFR 1910.38,\n\nEmployee Emergency and Fire Prevention Plans.  \n\n \n\n"
    }
  ]
}