{
  "FacilityID": 27383,
  "FacilityName": "Boonville Water Treatment Plant",
  "FacilityStr1": "1200 Locust Street",
  "FacilityStr2": null,
  "FacilityCity": "Boonville",
  "FacilityState": "MO",
  "FacilityZipCode": "65233",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29053",
  "LEPC": "Cooper County LEPC",
  "FacilityLatDecDegs": "38.980556",
  "FacilityLongDecDegs": "-92.759722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.boonville-mo.org",
  "FacilityEmailAddress": "waterplant@boonville.mo.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Boonville",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Boonville",
  "OperatorStr1": "1.5 A 901 River Drive",
  "OperatorStr2": null,
  "OperatorCity": "Boonville",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65233",
  "OperatorZipCodeExt": null,
  "RMPContact": "M.L. Caulhon III",
  "RMPTitle": "Director of Public Works",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040626",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-01-20 00:00:00",
  "ErrorReportDate": "2003-01-20 00:00:00",
  "ReceiptDate": "2003-01-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-01-13 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2006-06-01 00:00:00",
  "DeRegistrationEffectiveDate": "2006-04-04 00:00:00",
  "AnniversaryDate": "2008-01-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 38.97528,
  "FRS_Long": -92.75589,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39403,
      "AltID": null,
      "FacilityID": 27383,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 40320,
          "ProcessID": 39403,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 51759,
          "ProcessID": 39403,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 551759,
          "ProcessID": 39403,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27383,
      "SummaryText": "Introduction\n\nThe City of Boonville operates a water treatment plant facility that serves the community of Boonville and Cooper County District No. 2.  The plant capacity is a  4.6 million gallons a day, and the source is the Missouri River.  This Risk Management Plan (RMP) covers the Section 112r of the Clean Air Act regulating the chlorine injection system maintained at the water treatment facility .\n\nThe Worst Case Release Scenario\n\nThe worst case release scenario for the chlorine injection system was calculated as the loss of a single one-ton cylinder in accordance with the definition provided in the Environmental Protection Agency guidance for RMP development.  Only passive control systems were taken into consideration, such as the containment provided by the building.  The conditions of the scenario, such as the release time and weather status are those mandated in the EPA Off-Site Consequence Analysis Guidance.  The area of potential impact was determined using the RMP*Comp, Version 1.6, modeling software developed by the EPA.\n\nThe results of the Off-site Consequence Analysis indicated a distance to the toxic endpoint of 2.2 miles from the facility.  Within the area inscribed by that radial distance, an estimated 8,500 people could be affected.  Receptors include residential population, a public park, schools, and the the Missouri River,  \n\nAlternate Release Scenario \n\nThe alternative release scenario is, by definition, a more likely release scenario than the worst case.  Engineered controls, such as the chlorine detection system and the valving safeguards are considered in this analysis.  The type of system failure selected for the alternative release was the loss of chlorine due to a break in the pressure piping.  The chlorine would leak from a one-inch line on the pressure piping from the tank to the regulator was selected.  The leak would continue until receipt of the chlorine detector warning and the subsequent operator response and shutoff the chlorine "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27383,
      "SummaryText": "injection system.  The system can be shut down with a single switch located outside the storage/feed room.   Approximately, five minutes was estimated for response time.  The estimated release rate due to the rupture was 181 lbs/min, or a total of approximately 900 pounds.  \n\nThe results of the Off-Site Consequence Analysis performed using RMP*Comp, Version 1.6, determined the distance to toxic endpoint to be 0.3 miles. Within the area inscribed by that radial distance, an estimated 500 people could be affected.  Receptors include a public park, a school, and the Missouri River.  \n\nProcess Hazard Assessment\n\nThe process hazard assessment was performed of the chlorine system beginning with cylinder unloading and ending with the chlorine in solution.  For this purpose, the system was divided into six sections, and each section, or portion of the total system, was reviewed methodically.  A combination checklist and modified ?What-if? type of analysis was used.  General issues regarding storage and use areas as well as practices and protocols associated with the management of the chlorine injection system were discussed. Compliance with code requirements, considerations of potential failure, maintenance and inspection concerns, and standard operating procedures were reviewed for each section of the system.  Concerns were summarized in a list of Action Items.  A copy of the PHA analysis forms are included in this plan.\nPrevention Program\n\nThe Plant has an operation, maintenance and inspection system designed to review each element of the chlorine injection system routinely.  There are Operations and Maintenance manuals for each piece of major equipment, and personnel receive significant on-the-job training with experienced personnel before being allowed to work on the system.\n\nAt the beginning of each of the shifts and several times during the work day, the cylinders and piping are checked visually.  As each cylinder is changed, the valves and piping are tested for leaks"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27383,
      "SummaryText": " using an ammonia spray.  There are standard operating procedures (SOPs) for startup, shutdown, normal operation, and emergency operation.  The SOPs are written and posted in the appropriate areas.  Personnel are trained routinely on safety concerns and general operation procedures as well as emergency procedures.\n\nThe system is equipped with chlorine detectors and automatic shutoff valves on each cylinder to insure safe operation and protection.  Continuous ventilation is provided when a worker is present in the room by means of an automatic system and/or a switch external to the room.  \n\nEmergency Response Plan\n\nPlant personnel are trained to respond to leaks at the facility.  Personal protective equipment and two chlorine patch kits are available for that purpose.  The local fire department is aware of the hazards posed by the chlorine maintained at the plant.  \n\nAccident History\nThe Plant has had no chlorine releases in the past five years.  The system is a new one with additional safety features."
    }
  ]
}