{
  "FacilityID": 27539,
  "FacilityName": "Seward Station",
  "FacilityStr1": "595 Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "New Florence",
  "FacilityState": "PA",
  "FacilityZipCode": "15944",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42063",
  "LEPC": "Indiana County LEPC",
  "FacilityLatDecDegs": "40.406111",
  "FacilityLongDecDegs": "-79.031111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 124845199,
  "ParentCompanyName": "Reliant Energy Mid-Atlantic Power Holdings, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Reliant Energy Mid-Atlantic, LLC",
  "OperatorStr1": "595 Plant Road",
  "OperatorStr2": null,
  "OperatorCity": "New Florence",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15944",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "PA000780742",
  "EPAFacilityID": "100000181484",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "32-00040",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-02-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-02-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-02-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-02-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 40.405644,
  "FRS_Long": -79.033262,
  "FRS_Description": null,
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39660,
      "AltID": "SCR ammonia injection",
      "FacilityID": 27539,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 52167,
          "ProcessID": 39660,
          "ChemicalID": 57,
          "Quantity": 111455.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40577,
          "ProcessID": 39660,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27539,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-03-01 00:00:00",
    "ERTrainingDate": "2002-06-01 00:00:00",
    "CoordinatingAgencyName": "Indiana County LEPC",
    "CoordinatingAgencyPhone": "7243499300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "PA special water pollution regulations at 25 PA Code, Chapter 101; PA spill prevention response plan at 35 PS Section 6021.901-904; PA contingency plan at 25 PA Code §288.171",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 27539,
      "SummaryText": "ronmental receptors in the impact area.\n\n\n4. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThere are many safety programs in place at the station to minimize the potential for the accidental releases of ammonia considered by this plan.  For example:\n\n¿ The ammonia storage tanks are registered pressure vessels that are built to exacting standards.\n\n¿ Ammonia tank trucks will only be unloaded during daylight hours on weekdays.\n\n¿ Excess flow valves will be mounted on all storage tank liquid lines.\n\n\n5. FIVE-YEAR ACCIDENT HISTORY ¿ No accidents as defined in 40 CFR Part 68 have occurred during the past five years at this site.\n\n\n6. THE EMERGENCY RESPONSE PROGRAM ¿ In the unlikely event that an accidental release of ammonia would occur, the station has prepared a detailed written emergency response plan.  This plan has been in place for many years, and yearly drills are held to test the plan under simulated conditions.\n\n\n7. PLANNED CHANGES TO IMPROVE SAFETY ¿ All station safety programs, including the emergency response program, are reviewed periodically for improvement opportunities."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 27539,
      "SummaryText": "INTRODUCTION\n\nReliant Energy, Inc. operates a coal-fired, electric power generating station that is located on the Conemaugh River in Seward, East Wheatfield Township, Indiana County, Pennsylvania.  \n\nThe existing power plant has three coal-fired boilers (Boilers 12, 14 and 15) that supply steam to two turbine generators for the production of electricity.  The station¿s total capacity is 211 megawatts (MW) from two units, designated Unit No. 4 and Unit No. 5.  Unit No. 4 (fed by Boilers 12 and 14) is rated at 64 MW and Unit No. 5 (fed by Boiler 15) is rated at 147 MW.  Seward Station controls particulate air releases from Boilers 12 and 14 using a cyclone and an electrostatic precipitator (ESP). Particulate air releases from Boiler 15 are controlled using two ESPs in series.  Urea is injected into the flue gas of Boiler 15 for NOx control, while limestone is injected to absorb the gaseous arsenic emissions and thus protect the NOx-removal catalyst.\n\nA new 800 MW power plant is being built at the facility that will include a circulating fluidized bed (CFB) boiler for combustion of waste coal.  Limestone is injected into the CFB to control sulfur dioxide (SO2) emissions.  Aqueous ammonia will be used in selective catalytic reduction (SCR) of nitrogen oxides (NOx).  Particulate emissions will be controlled by a fabric filter.\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nReliant Energy¿s policy is to comply with all applicable regulatory requirements, including those for accidental release prevention and emergency response.\n\n\n2. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\na. PRIMARY ACTIVITIES ¿ This facility is a coal-fired, electric-power generating station.\n\nb. USE OF REGULATED SUBSTANCES\n\nThe aqueous ammonia injection system at Seward Station is designed to remove NOx from boiler flue gas by SCR.  This will be accomplished by injecting a 30-percent ammonia solution into the flue gas before it is passed over"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27539,
      "SummaryText": "a catalyst.\n\nNo other toxic or flammable materials will be stored at the facility in quantities above the regulatory threshold.\n\nc. QUANTITIES HANDLED OR STORED \n\nThe aqueous ammonia system is comprised of two 15,000-gallon storage tanks, pumps, and piping, instrumentation and controls.  The storage tanks are in a concrete diked area for secondary containment.  Tanker truck unloading is also provided with secondary containment.   \n\n\n3. THE WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO\n\na. WORST CASTE RELEASE SCENARIO\n\nTwo 15,000-gallon tanks are used to store aqueous ammonia.  The WCS assumes that the entire contents of one ammonia tank is spilled into the common secondary containment area over time.  The WCS can include the effects of passive mitigation systems, and for Seward Station this is the use of secondary containment to minimize ammonia liquid spills.  The quantity released is calculated as:\n\n15,000 gallons * 7.4 lb/gal = 111,455 lb\n\nPer EPA guidance, because the horizontal surface area of the secondary containment system (900 ft2) is less than that of the worst-case liquid pool (no secondary containment, one-centimeter deep pool) the rate at which the material is released is calculated as:\n\n1.4 x LFA (0.026 lb/min/ft2) x 900 ft2  = 36 lb/minute\n\nb. DISTANCE TO ENDPOINT ¿ The offsite consequences of this accidental release were evaluated with a screening computer dispersion model (RMP*Comp, version 1.07).  Offsite consequence analysis of the worst-case scenario must include the following weather conditions: a wind speed of 1.5 m/s (3.4 mph), \"F\" atmospheric stability class, a temperature of 77°F, and relative humidity of 50%.  \n\nThe maximum calculated distances to the endpoint using the RMP*Comp model is 0.1 miles for the worst-case scenarios for aqueous ammonia.  This represents the maximum downwind distance that the catastrophic release (under worst-case weather conditions) could pose a hazard to the public.  There are no public or envi"
    }
  ]
}