{
  "FacilityID": 27642,
  "FacilityName": "Imperial Freezer Services, L.L.C.",
  "FacilityStr1": "111 Imperial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Sanford",
  "FacilityState": "NC",
  "FacilityZipCode": "27330",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37105",
  "LEPC": "Lee County Emergency Managemen",
  "FacilityLatDecDegs": "35.518889",
  "FacilityLongDecDegs": "-79.214556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 947242806,
  "ParentCompanyName": "NA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Imperial Freezer Services, L.L.C.",
  "OperatorStr1": "111 Imperial Drive",
  "OperatorStr2": null,
  "OperatorCity": "Sanford",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27330",
  "OperatorZipCodeExt": null,
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000010374",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-03 00:00:00",
  "SafetyInspectionBy": "A.I.B. And DOL Boiler Division",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-03-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-03-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-03-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-03-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 35.51465,
  "FRS_Long": -79.21489,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39799,
      "AltID": "High Pressure Receiver",
      "FacilityID": 27642,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 52314,
          "ProcessID": 39799,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40716,
          "ProcessID": 39799,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 22488,
              "Process_NAICS_ID": 40716,
              "SafetyReviewDate": "2003-01-28 00:00:00",
              "PHA_Date": "2001-03-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-12-11 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Every control group in the building has monitoring",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-06 00:00:00",
              "TrainingReviewDate": "1999-02-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-06 00:00:00",
              "EquipmentInspectionDate": "2002-12-03 00:00:00",
              "EquipmentTested": "Complete ammonia system inspection",
              "ChangeMgmtDate": "1996-12-11 00:00:00",
              "ChangeMgmtReviewDate": "2002-08-06 00:00:00",
              "PreStartupReviewDate": "2002-08-06 00:00:00",
              "ComplianceAuditDate": "2001-06-14 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-17 00:00:00",
              "HotWorkPermitReviewDate": "2002-08-06 00:00:00",
              "ContractorSafetyReviewDate": "2002-08-06 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The ammonia refrigeration system/process includes an 5,757 lb high-pressure receiver located inside the engine building.",
              "_chemicals": [
                {
                  "PrimaryKey": 33055,
                  "PreventionProgram3ID": 22488,
                  "ProcessChemicalID": 52314
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27642,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-08-21 00:00:00",
    "ERTrainingDate": "2002-10-01 00:00:00",
    "CoordinatingAgencyName": "Sanford Fire Department",
    "CoordinatingAgencyPhone": "9197758310",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27642,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.  Accidental Release Prevention and Emergency Response Policies\nWe at Imperial Freezer Services, L.L.C. (Imperial) in Sanford, Lee County, North Carolina are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur, we are completely coordinated with the Lee County Emergency Management and the Sanford Fire Department which provides highly trained emergency response personnel to control and mitigate the effects in the event of a release.\n\n2.  The Stationary Source and the Regulated Substances Handled\nOur facility's primary activity encompasses providing refrigerated storage facilities for frozen food manufacturers.  We have one (1) regulated substance present at our facility above the threshold quantity -- anhydrous ammonia.  Anhydrous ammonia, a listed toxic substance, is used in our ammonia refrigeration system.  The complete ammonia refrigeration system contains a total of approximately 20,000 pounds of ammonia when completely charged.  \n\nSince anhydrous ammonia has a threshold quantity of 10,000 pounds, the ammonia refrigeration system is considered a regulated process.  Furthermore, since our facility is subject to the Occupational Safety and Health Administration's (OSHA's) Process Safety Management program, the process will be subject to the Program 3 requirements of the RMP rule.\n\n3.  Worst Case Release Scenario for a Program 3 Process\nThe largest single storage vessel of ammonia is the high-pressure receiver, a vertical pressure vessel located inside the Machine Room.  Methodology given in the EPA RMP Offsite Consequence Analysis Guidance and the EPA/ Ch"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27642,
      "SummaryText": "emical Emergency Preparedness and Prevention Office Risk Management Program Guidance For Ammonia Refrigeration (40 CFR Part 68) were used by our facility to perform the worst case release scenario.  The following paragraphs provide details of the chosen worst case scenario.\n\nThe worst case release scenario submitted for Program 3 toxic substances as a class assumes the roof-mounted balance tank is damaged during a storm or hurricane and the 5-inch inlet or outlet pipe ruptures creating a gas/vapor release.  Since the balance tank is interconnected back to the high pressure tank, etc., there is the possibility that the entire normal charge may be lost. (The high-pressure receiver can store a maximum ammonia charge of 5,757 pounds at 80 percent full and 3,598 pounds at the normal operating level of 50 percent full.  It is standard policy that pressure vessels are filled to no more than 80 percent of capacity to allow for expansion of the contents.  This is an administrative control which limits the contents of the receiver to avoid overpressurization.)\n\nThe scenario involves the release of 12,955 pounds of ammonia.  This quantity is the maximum amount of ammonia in the balance tank, interconnected lines, and the amount allowed in the high pressure tank (limited by administrative controls).  It is assumed that the maximum quantity is released over a 10-minute period.  The release is not mitigated since it occurs outside on to roof. Using the worst case endpoint stated in the guidance of 0.14 mg/l (the toxic endpoint listed in the Emergency Response Planning Guideline 2, or ERPG-2), a maximum offsite consequence distance of 10,771 feet (2.04 miles) is obtained for the worst case release scenario.  \n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nImperial has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  Since our facility has only one Pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27642,
      "SummaryText": "gram 3 process, we are submitting a Risk Management Plan (RMP) which summarizes the analysis of one worst case and one alternative release scenario for the ammonia refrigeration system.  These analyses document that the nearest public receptor is within the distance to the toxic endpoint of 0.14 mg/l.  However, we have reviewed a five-year accident history and shown that no reportable incidents have occurred involving this process.  This document contains and summarizes the elements of the release prevention program that is in place at our stationary source and the response actions that are coordinated with our local emergency planning and response agencies.\n\n 5.  Five-year Accident History\nImperial has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases during this period.\n\n6.  Emergency Response Plan\nImperial maintains a written emergency response and evacuation plan to deal with accidental releases of ammonia.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Lee County Local Emergency Planning Committee and the Sanford Fire Department are the local emergency planning agencies with which our emergency plan has been coordinated and verified.\n\n7.  Planned Changes to Improve Safety\nImperial conducts a number of safety inspections annually and implements various procedures and programs based on the findings of the reviews.  These include semi-annual safety surveys conducted by all members of the San"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27642,
      "SummaryText": "ford Fire Department and daily maintenance inspections of the entire refrigeration system.  Additionally, the manufacturer of the system, the Stellar Group, conducts thorough annual inspections and testing of the refrigration system and components.  \n\nEach of the findings from the above inspections, as well as on-going feedback from our employees, is acted upon quickly to minimize potential workplace hazards and accidental releases to the environment.  The steps we take to improve safety at our facility are incorporated into our company improvement plan and placed on a schedule with an implementation timetable or completion date.  The implementation schedule of each project is ranked according to the safety and/or health benefits of the particular finding."
    }
  ]
}