{
  "FacilityID": 27699,
  "FacilityName": "Mesquite Generating Station",
  "FacilityStr1": "37625 West Elliot Road",
  "FacilityStr2": null,
  "FacilityCity": "Arlington",
  "FacilityState": "AZ",
  "FacilityZipCode": "85322",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.346111",
  "FacilityLongDecDegs": "-112.863333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.semprenergyresources.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Mesquite Power, LLC",
  "Company2Name": null,
  "CompanyDUNS": 14256379,
  "Company2DUNS": 14256379,
  "OperatorName": "Mesquite Power, LLC",
  "OperatorStr1": "PO Box 508",
  "OperatorStr2": null,
  "OperatorCity": "Tonopah",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85354",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000181723",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "V99-017",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-03-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-03-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-03-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-03-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 33.3451,
  "FRS_Long": -112.8638,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 39867,
      "AltID": "Ammonia Inject. System #1",
      "FacilityID": 27699,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 52405,
          "ProcessID": 39867,
          "ChemicalID": 56,
          "Quantity": 62000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40784,
          "ProcessID": 39867,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 22546,
              "Process_NAICS_ID": 40784,
              "SafetyReviewDate": "2003-03-04 00:00:00",
              "PHA_Date": "2003-01-06 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-03-04 00:00:00",
              "TrainingReviewDate": "2003-03-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Hands on",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-03-04 00:00:00",
              "EquipmentInspectionDate": "2003-03-04 00:00:00",
              "EquipmentTested": "Hoses, valves, vaporizers, pumps, sensors, alarms, misters",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-03-04 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-03-04 00:00:00",
              "HotWorkPermitReviewDate": "2003-03-04 00:00:00",
              "ContractorSafetyReviewDate": "2003-03-04 00:00:00",
              "ContractorSafetyEvalDate": "2003-03-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 33116,
                  "PreventionProgram3ID": 22546,
                  "ProcessChemicalID": 52405
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 39868,
      "AltID": "Ammonia Inject. Sustem #2",
      "FacilityID": 27699,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 52406,
          "ProcessID": 39868,
          "ChemicalID": 56,
          "Quantity": 62000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 40785,
          "ProcessID": 39868,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27699,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-03-04 00:00:00",
    "ERTrainingDate": "2003-01-31 00:00:00",
    "CoordinatingAgencyName": "Maricopa County LEPC",
    "CoordinatingAgencyPhone": "6022731411",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.119, 40 CFR 68, ICP Guidance - EPA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27699,
      "SummaryText": "Mesquite Generating Station\nRisk Management Plan\nExecutive Summary\nManagement System\nThe Mesquite Generating Station management system for implementation of the risk management program elements is described below  The Plant Engineer  has overall responsibility for the risk management program at the Mesquite Generating Station.\n  \nThe development and implementation of the risk management program tasks will be performed by the following plant staff:  the Plant Engineer, O & M Manager, and Business Manager, who report to the Plant Manager. The Shift Leads, who operate the Control Room, report to the O & M Manager.  Staff members will be responsible for accomplishing RMP program requirements as work activities assigned to their positions.  \n\nAnhydrous Ammonia ¿ Regulated Substance and Process Description\nThe prevention program for the Mesquite Generating Station covers the anhydrous ammonia storage and injection systems for the two identical Selective Catalytic Reduction (SCR) systems used in each of the two Power Blocks.  This RMP prevention program covers the following processes and regulated substance:\nProcesses 1 & 2: Ammonia storage and injection to the SCR system\nRegulated Substance: Anhydrous Ammonia\nProcess #1 is the system for Power Block #1, and Process #2 is the system for Power Block #2.  The ammonia systems procedures are contained in the Mesquite Generating Station Policies and Procedures Manual (PPM) 9.01, titled ¿Ammonia Storage and Transfer System¿.\n·\tProcess Chemistry:  The two identical SCR systems in Power Blocks #1 and #2 are designed to reduce oxides of nitrogen (NOx) in the combustion turbine exhaust gases.  Ammonia vapor is diluted and injected into the exhaust gas ducts upstream of the catalyst beds.  The exhaust gas mixes with the ammonia vapor and flows over the catalyst beds, where the NOx is reduced to nitrogen gas and water vapor:\n\n\t\tNOx  +  NH3  -->   N2  +  H2O   \n\n\t\tThe system uses anhydrous ammonia, which is delivered by tank truck to a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27699,
      "SummaryText": "bulk storage tank in each Power Block, where the ammonia is stored as a liquefied gas under pressure. When ammonia is needed in the SCR systems, liquid ammonia is taken from the bottom of a storage tank, evaporated in an electric heater, and returned to the tank headspace as vapor.  The vapor is fed into a 1000 CFM dilution air stream and injected into the duct as approximately 2.6% ammonia by volume. \n\n·\t·\tMaximum Planned Inventory: In each of the two Power Blocks, the gross tank volume is 14,000 gallons but a tank will only be filled to a maximum of 85% of capacity, or 12,000 gallons (61,500 lbs at 60 degrees F.), to allow for expansion. The liquid ammonia in 30 feet of 2 inch pipe from a storage tank to its vaporizer inlets, plus 15 to 20 feet of 2 inch fill pipe connected to a tank, is less than 1 pound. The quantity of ammonia in pipes connected to a tank is negligible compared to the tank contents.  The maximum planned inventory for anhydrous ammonia is 61,500 lbs in each Power Block, or 123,000 lbs for the plant.  The quantity of ammonia in the delivery trucks is not included because the tractors will not be disconnected from the tank trailers during delivery, keeping them under DOT jurisdiction.   A full load of ammonia in a delivery truck is 44,000 lbs.\n·\t\n·\tSafety Systems \nThe anhydrous ammonia system includes the safety and alarm systems described below. \nAmmonia leak detection sensors, consisting of one per truck unloading skid, one per unloading compressor, 4 per tank, and one per vaporizer, monitor the level of ammonia in the atmosphere.  If ammonia is detected above the Low PEL alarm level of 25 ppm, a flashing strobe light is activated at the main leak detection control panel located on the truck unloading skid, and a remote alarm is activated in the plant DCS system to alert control room personnel of a potential leak.   If ammonia is detected above the High PEL alarm level of 50 ppm, a flashing strobe light is activated at the main leak detection c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27699,
      "SummaryText": "ontrol panel, a remote alarm is activated in the plant DCS system to alert personnel of a potential leak.  An alarm pull station installed at each tank can be pulled manually when a leak occurs to alert the control room\n\nWater-mist ammonia vapor cloud suppression systems, consisting of 4 nozzles at each truck unloading skid, storage tank, and vaporizer skid, are activated by the high PEL alarm.\n\nEach storage tank is equipped with a pressure relief manifold, local and remote indications for level, temperature, and pressure, and a high level signal.  Excess flow valves are located on every tank pipe except pressure relief, temperature instrument and level instrument connections.\n\nAmmonia detectors are located in several key places in the storage area.  Complete information on the alarm system is provided in the the Mesquite Generating Station Ammonia Supply and Storage Equipment Manual #65162.65.0221\n\nManagement of Change\nThe Management of Change (MOC) program enables the plant staff to maintain control over changes in covered processes by requiring technical review and formal authorization of process changes.  The MOC program also ensures that changes affecting existing process procedures are addressed in revisions of written procedures, and that affected employees are properly trained in the changes.  \n\nWritten Procedures to Manage Changes  (40 CFR 68.75 (a))       \n\nThe process change procedure is labeled PPM 5.01, Process Change Request and includes the Design Change process.  Design Change Requests (DCRs) are used by System Sponsors and other Team Members to propose changes and modifications to the plant.   When a System Sponsor or other Team Member observes that a change in the plant is required as a result of a safety situation, a potential to improve plant efficiency, or a regulatory mandate, they prepare and submit a DCR. \n\nA review group assigned by the Plant Manager reviews the DCR for technical and economic merit.  The review group is typically composed"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27699,
      "SummaryText": "of one (1) or more technical Team Members and the Business Manager.  Upon completion of the review, the review group will make a recommendation to the Plant Manager.  The Plant Management will approve the DCR (if it is within the current year's budget), submit it to the Business Manager as a capital improvement project (budget approval is required), or disapprove the DCR. \n\n\nWhenever a design or operational change is proposed in a covered process, the person preparing the DCR shall be responsible for determining if any of the following will change:\n·\tProcess chemical reactions or chemical phase\n·\tQuantity or composition of covered chemicals, or raw materials, additives, or reactants that would affect covered chemicals\n·\tSafe operating limits for process temperatures, pressures, and flow rates\n·\tConsequences of deviation from safe operating limits\n·\tProcess operating procedures\n·\tEquipment electrical classification or materials of construction\n·\tAlarm or relief systems setpoints\n·\tEquipment design specifications\n·\tAny other equipment, operations, or procedures affecting a covered process\n\nIf any of these items will be changed by a proposed process change, DCR procedures shall be followed as outlined in the Design Change Request forms\n\n\n Initial Training   (40 CFR 68.71 (a) (1))    \n\nEach Mesquite Generating Station employee presently operating a process, and each employee before operating a newly assigned process, shall be trained in the process and operating procedures as specified in §68.69. The training shall cover the specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee¿s job tasks. \n\nThe Mesquite Generating Station Personal Qualification Standard for employees is labeled PPM 2.18, Personnel Qualification System.  The Personnel Qualification System is a qualification program in which each Team Member is signed off against specific areas of qualification.  This documents the Team Member's"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 27699,
      "SummaryText": "understanding and competence in administrative, procurement, safety and health, system operation, and maintenance responsibilities which are applicable to the Team Member's position in the staff organization. Each position at the plant has a specific Personnel Qualification System. \n\nRefresher Training  (40 CFR 68.71 (b))      \nRefresher training shall be provided at least every three years, and more often if necessary, to each the Mesquite Generating Station employee operating or maintaining a SCR ammonia injection system process to assure that the employee understands and follows the current process operating procedures.  The Plant Engineer, in consultation with the employees who operate and maintain the process, shall determine the appropriate frequency of refresher training.\n\nEmergency Response Program\n Emergency Response Plans\nThe Mesquite Generating Station Emergency Response Procedures which have been prepared for the site are designed to meet the requirements of 40 CFR 68.95 (a) and (b).  As such, the Emergency Response Procedures contained in the sites¿ Integrated Contingency Plan (ICP) for an anhydrous ammonia release will serve as the Risk Management Programs Emergency Response Document.\nOutside Agency Coordination\nSection (c) of 40 CFR 68.95 requires that the Emergency Response Procedures be coordinated with community emergency response agencies such as the Local Emergency Planning Committee (LEPC) and the State Emergency Response Commission (SERC).  The Mesquite Generating Station has established on-going contacts with these agencies, and provided applicable information as requested for the development and implementation of community emergency response plans.\n\nOffsite Consequence Analysis\nThe offsite consequence analysis for this facility is described below.\n\n1  Worse-Case Release Scenario\nThe worst case release is modeled for catastrophic failure of the north ammonia storage tank, causing a release of entire contents of the tank in 10 minutes.   The ta"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 27699,
      "SummaryText": "nk is not filled to more than 85% of capacity to allow headspace for thermal expansion.  The maximum internal temperature of  122 degrees F was modeled because higher internal temperature gave a longer distance to the 200 ppm endpoint, even though the mass of ammonia in an 85% full tank is greater at lower internal temperatures.  The model was run for rural conditions because the topography is relatively open between the tank and the largest potential offsite receptor population at the Palo Verde Nuclear Generating Station (PVNGS) directly north of the Mesquite Generating Station.  \n\nThe model predicts an ammonia concentration of 200 ppm at a maximum distance of 3.1 miles from the tank.\n\n\nAlternative Release Scenario\nThe alternative release scenario is a break in 2¿ fill line from the tanker trailer to the tank while loading, causing a release of liquid ammonia from 20 ft of hose and 20 ft of 2¿ pipe before the driver can shut off the flow.  This scenario was selected as the most likely release to occur in the system as constructed and operated at the Mesquite Generating Station.  The model was run for urban conditions due to proximity of plant buildings and structures.\n\n\nBased on a typical temperature of 90 degrees F., the model estimates a release of 0.29 lbs of ammonia and predicts an ammonia concentration of 200 ppm at a distance of 14 yards from the tank.  The endpoint concentration does not extend offsite. The footprint was not drawn because the near field patchiness makes dispersion predictions unreliable for short distances.\n \nFive-year Accident History\n\n Known Accidental Releases (40 CFR 68.42 (a))\n\nThe five-year accident history shall include all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nThere have been no accidental releases of ammonia that meet the criteria of the rule"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 27699,
      "SummaryText": ".\n \n\nData Required  (40 CFR 68.42 (b))  \n\nIn the event of an accidental release under the rule, the Mesquite Generating Station shall report the 1) date, time, and approximate duration of the release; 2) chemical(s) released; 3) estimated quantity released in pounds; 4) type of release event and its source; 5) weather conditions, if known; 6) on-site impacts; 7) known offsite impacts; 8) initiating event and contributing factors, if known; 9) whether offsite responders were notified, if known; and 10) operational or process changes that resulted from investigation of release.  Under §68.42 (b), numerical estimates may be provided to two significant digits."
    }
  ]
}