{
  "FacilityID": 27897,
  "FacilityName": "Reddy Ice #336-Nashville",
  "FacilityStr1": "7261 Centennial Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Nashville",
  "FacilityState": "TN",
  "FacilityZipCode": "37209",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47037",
  "LEPC": "Nashville/Davidson Cnty OEM",
  "FacilityLatDecDegs": "36.181944",
  "FacilityLongDecDegs": "-86.878889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Packaged Ice, Inc./Reddy Ice Corporation",
  "Company2Name": null,
  "CompanyDUNS": 194256293,
  "Company2DUNS": 194256293,
  "OperatorName": "Packaged Ice, Inc./Reddy Ice Corp.",
  "OperatorStr1": "3535 Travis Street",
  "OperatorStr2": "Suite 170",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75204",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000182152",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-12-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Nashville Initial Submittal (03/03)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-04-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-04-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-03-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-02-13 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-15 00:00:00",
  "AnniversaryDate": "2008-03-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 36.18194,
  "FRS_Long": -86.87889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40164,
      "AltID": "Ice Manufacturing",
      "FacilityID": 27897,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 52754,
          "ProcessID": 40164,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41086,
          "ProcessID": 40164,
          "NAICSCode": "312113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 22759,
              "Process_NAICS_ID": 41086,
              "SafetyReviewDate": "2002-12-17 00:00:00",
              "PHA_Date": "2002-12-16 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-06-16 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "ammonia detection system, exhaust purge fans, controls to shut down system, administrative controls.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Revision of SOPs and maintenance documentation",
              "OpProceduresReviewDate": "2002-12-17 00:00:00",
              "TrainingReviewDate": "2002-12-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Out of house schools, web-based training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-12-17 00:00:00",
              "EquipmentInspectionDate": "2003-03-20 00:00:00",
              "EquipmentTested": "Operational inspection of all equipment is done daily. Major equipment inspection and maintenance schedules are on monthly to 5-year intervals.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-12-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2002-09-26 00:00:00",
              "AuditCompletionDate": "2003-06-26 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-12-17 00:00:00",
              "HotWorkPermitReviewDate": "2002-12-17 00:00:00",
              "ContractorSafetyReviewDate": "2002-12-17 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Reddy Ice #336 facility located in Nashville, TN has developed a Combined Process Safety Management/Risk Management (PSM/RM) Program to address the accident prevention program requirements of both regulations.  The purpose of the PSM/RM Program is to make safe operations and accident prevention systematic throughout the facility.  The PSM/RM Prevention Program contains thirteen elements, tied together by a management system to ensure development, implementation and integration of the Program requirements. These thirteen elements consist of the following: Employee Participation, Process Safety Information, Process Hazard Analysis, Pre-Startup Review, Operating Procedures, Training, Management of Change, Mechanical Integrity, Hot Work Permits, Contractor Qualifications, Incident Investigation, Compliance Audits, and Trade Secrets.\n\nThe Reddy Ice-Nashville facility is committed to operating a safe and compliant facility for the protection of its employees, the general public, and the environment.  The facility has multiple safeguards pertinent to the ammonia process.  These include an ammonia detection and alarm system, exhaust purge fans, pressure safety relief valves that discharge to a water neutralization tank, controls that shut down the compressors if operating limits are violated, and the capability of shutting the entire system down if required.  Administrative controls are in place that limit the utilization of vessels to from 15% to 60% of their intended capacities.\n\nThe company has developed an emergency action plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and limited first responder duties by trained facility refrigeration personnel.",
              "_chemicals": [
                {
                  "PrimaryKey": 33368,
                  "PreventionProgram3ID": 22759,
                  "ProcessChemicalID": 52754
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 27897,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Metro Nashville Fire Dept",
    "CoordinatingAgencyPhone": "6158628600",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27897,
      "SummaryText": "PROCESS SUMMARY\nThe Reddy Ice #336-Nashville facility located in Nashville, Tennessee, manufactures ice for wholesale/retail distribution.  The facility maintains approximately 13,000 pounds of anhydrous ammonia as a refrigerant for ice making and cold storage.  Reddy Ice-Nashville is a state-of-the-art ice manufacturing facility, originally constructed in 1985, enlarged in 1994, and beginning the current expanded operations in June 2000.  \n\nThe facility refrigeration system is a standard closed loop design consisting of compressors, condensers, storage tanks, ice makers, and freezer vaults.  The system has numerous protective controls including motor overload, high and low temperature and pressure, low oil pressure, high and low liquid level cutouts, and pressure relief valves on all equipment.  Ammonia detectors and alarms are installed throughout the plant.  The compressors are normally run and shut down through the computer via Allen-Bradley PLC controls.\n\nAnhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant.  The sharp odor of ammonia provides its own warning agent.  Practically all accidents involving anhydrous ammonia can be avoided through the facility's program of proper training, knowledge of the equipment and procedures, and conducting preventive maintenance on all ammonia equipment.\n\nThe facility has multiple safeguards pertinent to the anhydrous ammonia process.  These include an ammonia detection and alarm system, exhaust purge fans, controls which shut down the compressors if operating limits are exceeded, and the capability of shutting the entire system down if required.  Administrative controls are in place that limit the utilization of vessels to from 15% (in the high-pressure receiver) to approximately 60% (in the two accumulators) of their intended capacities.\n\nThe company has developed an emergency action plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27897,
      "SummaryText": " of personnel, and first responder duties by trained refrigeration personnel in the event of a release.\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\nBased on the Reddy Ice-Nashville facility's ammonia inventory, location, and requirement to meet OSHA PSM standards, the facility is subject to the Accident Prevention Program 3 requirements.  The Accident Prevention Program is a way to make safe operations and accident prevention systematic throughout the facility.  Packaged Ice, Inc. Corporate Management and Reddy Ice-Nashville management are committed to operating a safe and compliant facility for the protection of its employees, the general public, and the environment.  A Combined Process Safety Management/Risk Management (PSM/RM) Program has been developed to meet the accidental release prevention requirements of EPA's Risk Management Program (40 CFR Part 68) and OSHA's Process Safety Management Standard (29 CFR 1910.119) under the Clean Air Act.  The Combined PSM/RM Program contains thirteen elements, establishing requirements for training, operating procedures, documentation, etc. These elements are tied together by a management system to ensure development, implementation and integration of the Program requirements.\n\nMANAGEMENT SYSTEM\nA management system has been developed to oversee the implementation of the PSM/RM Program elements.  The Plant Manager is identified as PSM/RM Coordinator, with overall responsibility for developing, implementing and integrating the Program requirements.  The Plant Engineer has responsibility for portions of the program closely tied to the refrigeration equipment and operation.  An established safety committee meets each month to present a safety meeting and address any safety issues brought up by employees during the month.\n\nHAZARD ASSESSMENT\nAs required by the Risk Management Program regulations, the Reddy Ice-Nashville facility has conducted offsite consequence analyses (OCAs) relative to the potential accidental release of ammonia.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27897,
      "SummaryText": "The OCAs describe the potential offsite exposure to surrounding areas from an accidental release.  A worst-case release scenario and alternative release scenarios were calculated using the EPA RMP*Comp modeling program.\n\nThe worst-case scenario consisted of a release from a liquid ammonia line inside the building that could potentially drain three vessels, releasing the largest mass of ammonia at any given time.  As a worst-case release, this scenario could release 6,000 pounds of ammonia from the system during a 10-minute period, potentially affecting a modeled radius of 1.0 mile and a population of 1,500 persons.  This impact is extremely unlikely, as: 1) the vessel and piping are inside the building where damage to the piping is unlikely, and 2) the RMP*Comp program is very conservative, resulting in a large maximum radius. \n\nSeveral alternative scenarios, or potentially more likely scenarios, for the facility system were explored, ranging from a release from a valve seal, or a minor break in indoor piping, to failure of an outdoor liquid line.  The selected scenario consists of a vapor release from the compressor discharge or condenser inlet line.  A 300 pound per minute release rate was assigned to account for the full output of all six compressors.  Based on the 300 pound per minute release rate, a radius of 0.3 mile and a population of 100 persons is calculated.\n\nFIVE-YEAR ACCIDENT HISTORY\nThe Reddy Ice-Nashville facility has not had any releases that would require reporting as part of a five-year accident history.\n\nEMERGENCY PLANNING AND RESPONSE\nThe Reddy Ice-Nashville facility operates under an Emergency Action Plan (EAP) that includes procedures for: notifying the public and local emergency responders; emergency evacuation/response procedures; use of emergency alarms and equipment; employee training in evacuation and response procedures; first aid for ammonia exposure; and periodic review and updating of the emergency action plan.\n\nAs required, the facili"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27897,
      "SummaryText": "ty has coordinated emergency response activities with the Davidson County LEPC and the Nashville Metro Fire Department and has appropriate mechanisms in place to notify emergency responders if needed.  The ammonia has been reported, and the plant is incorporated into the community emergency response plan developed under 42 USC."
    }
  ]
}