{
  "FacilityID": 27946,
  "FacilityName": "Royster - Clark  Windsor",
  "FacilityStr1": "37 W. Windsor Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Windsor",
  "FacilityState": "VA",
  "FacilityZipCode": "23487",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51093",
  "LEPC": "Isle of Wight LEPC",
  "FacilityLatDecDegs": "36.810111",
  "FacilityLongDecDegs": "-76.748333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Royster - Clark, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 785525494,
  "Company2DUNS": 0,
  "OperatorName": "Carl Harmon",
  "OperatorStr1": "37 W. Windsor Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Windsor",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23487",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carl Harmon",
  "RMPTitle": "Location Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000027491",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-04-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-04-17 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-07 00:00:00",
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 36.81152,
  "FRS_Long": -76.74884,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40232,
      "AltID": "Ammonia",
      "FacilityID": 27946,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41153,
          "ProcessID": 40232,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 52838,
          "ProcessID": 40232,
          "ChemicalID": 57,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 552838,
          "ProcessID": 40232,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27946,
      "SummaryText": "1.Accidental release prevention and emergency response policies:\n\nThe owners, management and employees of Royster-Clark, Inc., Windsor,VA., are committed to the prevention of any accidental release of ammonia from Aqua Ammonia.  If any accidental release should occur at the facility, personnel have been instructed and are prepared to work with the Isle Of Wright County Emergency personnel, the Windsor Volunteer Fire Department and other authorities to mitigate any release and minimize the impact of the release on people and the environment.\n\n2. The stationary source and regulated substance handled:\n\nThe primary activity at the Windsor facility of Royster-Clark, Inc., is the blending and storage  of fertilizer for sales to agricultural users (farmers).\n\nAqua Ammonia containing a maximum of 30% ammonia is received by tanker truck, stored, and used from the storage tanks in the production of mixed-grade liquid fertilizer for plant nutrients.\n\nThe maximum quantity of Aqua Ammonia stored at this facility would be 165,000 pounds in 1 - 22,000 gallon tank  which is located in a 1,202 square foot dike.  This would be 50,000 pounds of ammonia at the maximum of 30% ammonia content.\n\n3. The worst-case release scenario and the alternate release scenario:\n\na. The worst-case release scenario would be the release of the entire contents of Aqua Ammonia containing a maximum of 30% ammonia from  the 22,000 gallon storage tank in the diked area released as a liquid over a 3846 minute period.  The maximum amount released would be 165,000 pounds of Aqua Ammonia which would contain 50,000 pounds ammonia at 30% maximum ammonia content.  The distance to an end point of 200 ppm of ammonia, as determined by The Fertilizer Institute's Model - Degradis - and the passive mitigation of the 1,202 sq.ft. dike, is 0.09 miles.  The release would affect 20 residents and some commercial areas.  The possibility of this worst case release occurring is extremely unlikely as location personnel regularly i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27946,
      "SummaryText": "nspect and repair as necessary all storage tanks.\n\nb. The alternate release scenario, based on the most likely potential incident, is a release of Aqua Ammonia from a ruptured 3 inch transfer hose, during the unloading procedure, with the release discontinued in 1 minute.  The calculated quantity of Aqua Ammonia released would be 1500 pounds which is 450 pounds of ammonia. The distance to the end point of  200 ppm of ammonia as determined by The Fertilizer Institute's Model - Degradis - is 0.07 miles.    This is 370 feet and would  affect 20 residents and some commercial areas.  The possibility of this alternate release scenario occurring is unlikely as Windsor personnel periodically inspect, repair and replace equipment according to industry standard procedure.\n\n4. The General Accidental Release prevention program:\n\nThe Windsor facility has implemented the provisions of Aqua Ammonia supplier's recommendations for safe handling of Aqua Ammonia and appropriate OSHA regulations.  Additionally, periodic training in handling, storage and use of Aqua Ammonia is conducted with personnel at this location.\n\n5. The Five-Year Accident History:\n\nThis facility has had no accidental release of Aqua Ammonia in the past five years that have caused any deaths, injuries, or significant property damage on site, or has resulted in any off site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n6. The Emergency Response Program:\n\nThis facility has:\n\na. A written emergency response plan which is incorporated in the written community emergency response plan of Isle of Wight County.\n\nb. Provided state and local authorities with emergency planning and community right-to-know information as required under SARA Title III (EPCRA).  \nThis facilities emergency response program has been discussed with and reviewed by the Windsor Volunteer Fire Department.\n\n7. Planned changes to improve safety:\n\nSafety improvement is an on-going process at all the facil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27946,
      "SummaryText": "ities of Royster-Clark Inc. Periodic evaluations are performed to assess the effectiveness of safety practices and the proper maintenance of the facility.   There are no additional specific Aqua Ammonia safety recommendations for implementation at this facility at this time."
    }
  ]
}