{
  "FacilityID": 27989,
  "FacilityName": "MEROM GENERATING STATION",
  "FacilityStr1": "5500 WEST OLD 54",
  "FacilityStr2": null,
  "FacilityCity": "SULLIVAN",
  "FacilityState": "IN",
  "FacilityZipCode": "47882",
  "Facility4DigitZipExt": "0007",
  "FacilityCountyFIPS": "18153",
  "LEPC": "Sullivan County LEPC",
  "FacilityLatDecDegs": "39.066944",
  "FacilityLongDecDegs": "-87.507222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "hepn.com",
  "FacilityEmailAddress": "webmaster@hepn.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "HOOSIER ENERGY RURAL ELECTRIC COOPERATIVE INC",
  "Company2Name": null,
  "CompanyDUNS": 62802574,
  "Company2DUNS": 62802574,
  "OperatorName": "HOOSIER ENERGY REC INC.",
  "OperatorStr1": "5500 WEST OLD 54",
  "OperatorStr2": null,
  "OperatorCity": "SULLIVAN",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47882",
  "OperatorZipCodeExt": "0007",
  "RMPContact": null,
  "RMPTitle": "MANAGER, POWER PRODUCTION",
  "FTE": 220,
  "OtherEPAFacilityID": "47882MRMGNHWY54",
  "EPAFacilityID": "100000182296",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T153-6931-00005",
  "SafetyInspectionDate": "2001-07-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-04-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-04-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-04-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-04-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 39.06789,
  "FRS_Long": -87.51306,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40275,
      "AltID": "AMMONIA",
      "FacilityID": 27989,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 41197,
          "ProcessID": 40275,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 52881,
          "ProcessID": 40275,
          "ChemicalID": 56,
          "Quantity": 380000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 552881,
          "ProcessID": 40275,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 27989,
      "SummaryText": "Hoosier Energy ? Merom Generating Station, Sullivan, IN  47882\n\n\n1.  The Accidental Release Prevention and Emergency Response Policies at the Facility\nHoosier Energy is committed to providing a safe environment for its employees, contractors, visitors, neighbors and surroundings.  This includes the prevention of accidental releases of any substance as well as the regulated substance: anhydrous ammonia.  Hoosier Energy has several policies in place to provide guidance and training for maintaining a safe environment.  In the event of a release or emergency, Hoosier Energy has established a Standard Operating Procedure for emergency responses.  Hoosier Energy has dedicated bulletin #24 in the Manual of Administrative Bulletins to Corporate Safety and Health Policy.  The plant has an additional policy book, Merom Generating Station Plant Policies, which includes sections on safety and training.  Additional training and safety procedures have been established in response to bringing ammonia onto the plant site.  \n\n2.  Facility Information and the Regulated Substances Handled\nThe Merom Generating Station consists of two identical 515-MW coal-fired steam electric generating facilities.  Both units began commercial operation in the early 1980s.  This station is located approximately six miles west of Sullivan in Sullivan County, Indiana.\n\nEach unit has a turbine generator, with natural circulation arranged for balanced draft operation firing pulverized coal, and all auxiliary equipment to make a complete generating unit.  Emissions are controlled by: electrostatic precipitators (ESP) to reduce particulate, a flue gas desulfurization (FGD) system for SO2 reduction and a Selective Catalytic Reduction (SCR) system which utilizes ammonia as the reagent to react with the catalyst in reducing the NOx.  The ammonia used in the SCR process is the regulated substance for this program.  Hoosier Energy has two 45,000 gallon tanks on site.  The tanks will be filled to a maximum of 85%,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 27989,
      "SummaryText": " or 38,250 gallons each.  The highest quantity will be onsite during the summer months when the SCR process is in use.  Delivery of the ammonia will be by truck.  The SCR will be in use during the months between May and September.  Due to the nature of ammonia storage the tanks will contain some quantity at all times.  \n\n3a.  Worst-Case Release Scenario\nALOHA, a conservative air model provided by the EPA was used to determine the worst-case scenario.  The worst-case scenario is considered as the failure of the largest storage tank, 45,000 gallons or 220,569 pounds. When filled to the maximum allowed capacity of 85%, this equates to 38,250 gallons or 187,484 pounds.  Worst-case would result in the release of the total contents of anhydrous ammonia as a gas in a period of two minutes.  The design standards of the equipment and company procedures limit the maximum filling capacity to 85%.  The distance to endpoint of the dispersion based on the ALOHA model is 3.0 miles at 98?F with a wind speed of 1.5 m/s or 3.4 mph.  Offsite impact includes the estimated residential population to endpoint (3.0 miles) of 530 people.     Written operating procedures and a high level alarm prevent more than 38,250 gallons from being present in the 45,000 gallon tank.  EPA?s conservative ALOHA model that we used did not allow the consideration of passive mitigation measures.  Although ALOHA does not allow for passive mitigation, there are some systems in place that would make this situation less likely.  There is a dike, a berm, drains, and sumps.  The tank is located in a low-lying area.\n\n3b.  Alternative Release Scenario\nThe alternative release scenario that was considered is a rupture of the transfer hose when unloading the delivery truck.  (The truck is industry-standard at 9000 gallons.  Also according to industry-standards, it is filled to 83% capacity which is 7470 gallons.)   This could result in a total release from the truck of 36,674 pounds in a period of seven minutes.  The di"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 27989,
      "SummaryText": "stance to endpoint is 1.4 miles at a 98?F and wind speed of 1.5 m/s.  The estimated population to endpoint is 20 people.  ALOHA was used to determine this scenario, and the program does not allow for active or passive mitigation.  This particular scenario was chosen in the PHA analysis as the highest risk. Site safety personnel also identify this as one of the highest risks.  It is considered one of the highest risks since the connection is continually made and then disconnected.\n  \n4.  The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThis facility complies with several rules and regulations that apply to the storage, handling and use of anhydrous ammonia including OSHA PSM.  Hoosier Energy retained the services of a consultant to assist in the development of a Process Hazard Analysis (PHA).  The PHA was developed using the HAZOP method to identify hazards and to establish plans to prevent process problems.  Additional employee training has been conducted and will be continued to assure a safe environment.  With the addition of the ammonia to the plant site the plant personnel were trained specifically on procedures in dealing with ammonia handling, use and storage.  A higher level of training was provided to certain employees that will be in daily contact with the actual ammonia process.  \n\n5.  Five-Year Accident History\nMerom Generating Station has had no reportable accidents in the past five years.\n\n6.  The Emergency Response Program\nThe emergency response for an ammonia release will include notifying authorities through the 911 system.  In addition the Local Emergency Planning Commission (LEPC) will be notified directly by the plant system supervisor.  Site personnel have been trained to respond to the emergency in the event one would occur.  Plant supervisors will authorize the use of audible alarms for plant safety personnel to respond and for plant personnel to take necessary precautions for personal safety.  Public not"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 27989,
      "SummaryText": "ification may include the use of phones, possible door to door notification, and other systems as they become available.\n\n7.  Planned Changes to Improve Safety\nSafety improvements and training will be an ongoing process.  Process control equipment changes and technology upgrades will be evaluated on an as needed basis."
    }
  ]
}