{
  "FacilityID": 2801,
  "FacilityName": "Northeast Texas Municipal Water District Mims",
  "FacilityStr1": "Highway 155",
  "FacilityStr2": "Farm to Market 729",
  "FacilityCity": "Mims",
  "FacilityState": "TX",
  "FacilityZipCode": "75630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48315",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "32.865",
  "FacilityLongDecDegs": "-94.654722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "netmwd@aol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Walt Sears, Jr.",
  "OperatorStr1": "P.O. Box 955",
  "OperatorStr2": "Hwy 250 S",
  "OperatorCity": "Hughes Springs",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75656",
  "OperatorZipCodeExt": null,
  "RMPContact": "Pete Wright",
  "RMPTitle": "Utility Operations Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000034937",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.865,
  "FRS_Long": -94.65472,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3130,
      "AltID": null,
      "FacilityID": 2801,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3195,
          "ProcessID": 3130,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3339,
          "ProcessID": 3130,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503339,
          "ProcessID": 3130,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2801,
      "SummaryText": "NORTHEAST TEXAS MUNICIPAL WATER DISTRICT\nMIMS WATER TREATMENT PLANT\n\nINTRODUCTION\n\nChlorine is essential to the water treatment process.  Chlorine controls many forms of pathogenic microorganisms present in water that, if left untreated, could cause severe health problems.  In order to provide clean water safely, the Northeast Texas Municipal Water District (NETMWD) has prepared a Risk Management Program (RMP) in accordance with the United States Environmental Protection Agency (EPA) guidelines. The NETMWD Mims Water Treatment Plant has been operating since 1985 with no accidental release of chlorine that resulted in property damage, injury, or death. The purpose of the Risk Management Program (RMP) is to help maintain an accident free environment.  The RMP insures that all components of chlorine system operation including training, operating procedures and maintenance are addressed and reviewed for optimal safety practices.  Finally, an emergency response plan has been developed to make certain that all plant personnel know how to deal with an accidental release.  \n\nPREVENTION PROGRAM\n\nThe first step towards safety is to prevent an accident from occurring.  The NETMWD prevention program consists of safety information, hazard review, operating procedures, training, maintenance and incident investigations.  \n\nAll operators at the water treatment plant should be intimately familiar with the chlorine safety information.  Material safety and data sheets, equipment specifications, safe operating temperatures, pressures and flowrates should all be common knowledge to each operator.  The NETMWD includes this information in their RMP manual for easy access by plant operators.\n\nThe hazard review, put together by The Chlorine Institute, allows the plant to look at even the most remote ways an accident may occur and how management can implement changes to improve safety.  The NETMWD Utility Operations Manager has reviewed this checklist and is currently incorporating items to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2801,
      "SummaryText": "reduce potential hazards.  The planned date for all changes to be met is July 1, 1999.  After that, the checklist will be periodically reviewed, and all safety hazards revealed will be corrected promptly.  \n\nChlorine system operating procedures are included in this RMP and provide standard methods for working with the chlorine equipment.  These procedures include operations for startup, shutdown, emergency operations and a troubleshooting chart to quickly assist with any problems or malfunctions that may occur.  Detailed procedures for removing and connecting chlorine ton cylinders to the equipment have been included. These procedures allow for methodical change over of cylinders with multiple safety checks.\n\nTraining of each employee is critical to the chlorine process.  The Texas Natural Resources Conservation Commission licenses all NETMWD operators.  However, every water treatment plant has its own features and equipment with which the operators must be familiar.  For the Mims Water Treatment Plant, the optimal training includes on-the-job training.  The Utility Operations Manger certifies operators involved in chlorine handling after demostrations, written and oral exams, and a review of their performance according to the standard operating procedures.\n\nTo help ensure equipment integrity, several maintenance reports, records and procedures are included in the NETMWD RMP.  Maintenance manuals for each piece of equipment are kept here as well as daily work logs, equipment inspection reports, equipment data sheets, preventive maintenance records, lubrication schedule, and a spare parts inventory.  This allows operators to easily check on the upkeep of the chlorine equipment. \n\nIncident investigation reports are included if there is an event which, resulted in or could reasonably have resulted in a chlorine release.  This allows the water treatment plant to keep track of incidents as well as accidents.  The incident investigation report allows operators to learn fr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 2801,
      "SummaryText": "om others' mistakes to help avoid making the same mistake twice.       \n\nRELEASE SCENARIOS     \n\nThe worst-case release scenario model has been completed for this RMP.  For this model, there is a simulated release of 2,000 pounds of chlorine in a ten-minute period.  The model shows that the worst-case scenario could affect an area up to three miles from the plant.  A more realistic release scenario is also included.  This alternate-release model considers a more plausible scenario, with 300 pounds of chlorine being released over an hour.  The model shows that a release of this nature would affect an area within a half-mile of the plant site with only those in the immediate vicinity in severe danger of exposure.  The location of the Mims Water Treatment Plant is advantageous because of the sparse population in the immediate area.  Those nearby can be evacuated using a door to door method, with those in the most direct path of the chlorine being evacuated first. \n\nEMERGENCY RESPONSE PLAN\n\nThe emergency response plan is designed to deal with a chlorine release that requires help from outside sources.  Any release of chlorine that the operators cannot control or routinely clean up will activate the emergency response plan.  This plan includes contacting the plant managers, local emergency responders and state or national agencies to assist in evacuation, medical treatment and clean up.  The plan is designed to make sure all employees know what to do in an emergency situation. Operators are trained to use a self-contained breathing apparatus, which allows them to access the chlorine-affected areas to assist in the efforts if necessary.\n\nCONCLUSION\n\nThe Risk Management Program will benefit the Northeast Texas Municipal Water District and those who depend on their safe delivery of clean water.  Like many water treatment plants nationwide, with rigorous procedures, continual training and constant maintenance, chlorine accidents can be prevented.  However, if for some reason"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 2801,
      "SummaryText": " an accident does occur, the Mims Water Treatment Plant personnel will be familiar with the possibilities and the actions required to help prevent injuries or damage.  This RMP shall be updated and resubmitted every five years, or after a major change in the equipment or storage facilities for the regulated chemical (chlorine), or as required by EPA regulations."
    }
  ]
}