{
  "FacilityID": 28314,
  "FacilityName": "Roche Colorado Corp.",
  "FacilityStr1": "2075 North 55th Street",
  "FacilityStr2": null,
  "FacilityCity": "Boulder",
  "FacilityState": "CO",
  "FacilityZipCode": "80301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08013",
  "LEPC": "Boulder County LEPC",
  "FacilityLatDecDegs": "40.016944",
  "FacilityLongDecDegs": "-105.220278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.roche.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 76470525,
  "ParentCompanyName": "Roche Palo Alto, LLC",
  "Company2Name": "Roche Holdings LTD., Delaware",
  "CompanyDUNS": 63548663,
  "Company2DUNS": 189075674,
  "OperatorName": "Roche Colorado Corp.",
  "OperatorStr1": "2075 N. 55th St.",
  "OperatorStr2": null,
  "OperatorCity": "Boulder",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80301",
  "OperatorZipCodeExt": null,
  "FTE": 340,
  "OtherEPAFacilityID": "COD076470525",
  "EPAFacilityID": "100000176766",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "95OPBO150",
  "SafetyInspectionDate": "2002-05-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Roche Colorado is affected by RMP",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-05-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMPlanner",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-05-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-08-17 00:00:00",
  "DeRegistrationEffectiveDate": "2017-08-11 00:00:00",
  "AnniversaryDate": "2008-05-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 40.02025,
  "FRS_Long": -105.227461,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40698,
      "AltID": "Piperidine storage modifi",
      "FacilityID": 28314,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53431,
          "ProcessID": 40698,
          "ChemicalID": 34,
          "Quantity": 38000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41625,
          "ProcessID": 40698,
          "NAICSCode": "325412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23169,
              "Process_NAICS_ID": 41625,
              "SafetyReviewDate": "2002-09-30 00:00:00",
              "PHA_Date": "2002-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-03-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "tanker unloading pad spill pump",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "tank containment and spill pump",
              "OpProceduresReviewDate": "2002-09-30 00:00:00",
              "TrainingReviewDate": "2002-09-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-09-30 00:00:00",
              "EquipmentInspectionDate": "2003-04-01 00:00:00",
              "EquipmentTested": "OQ qualification test for spill pump retested on 4/1/2003.  OQ completed for 081 tank system on 12/18/2002.",
              "ChangeMgmtDate": "2002-09-30 00:00:00",
              "ChangeMgmtReviewDate": "2001-04-03 00:00:00",
              "PreStartupReviewDate": "2002-12-16 00:00:00",
              "ComplianceAuditDate": "1998-12-01 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": "2002-05-17 00:00:00",
              "InvestigationChangeDate": "2002-06-05 00:00:00",
              "ParticipationPlansReviewDate": "1999-12-15 00:00:00",
              "HotWorkPermitReviewDate": "2001-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2001-04-23 00:00:00",
              "ContractorSafetyEvalDate": "2001-07-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 33891,
                  "PreventionProgram3ID": 23169,
                  "ProcessChemicalID": 53431
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28314,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2001-09-12 00:00:00",
    "ERTrainingDate": "2002-11-30 00:00:00",
    "CoordinatingAgencyName": "LEPC (Larry Stern)",
    "CoordinatingAgencyPhone": "3034413637",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 28314,
      "SummaryText": "cy response authorities to address the potential for releases that could affect the public.  Roche Colorado Corporation employs physical and administrative controls to mitigate potential releases.  Roche Colorado Corporation implements extensive internal training to prevent releases as well as prepare for eventualities which may result from releases.  Roche Colorado Corporation is an active member of the Local Emergency Planning Committee (LEPC) and endeavors to prepare the LEPC for the possibility of responding to releases that could originate from Roche Colorado Corporation. \n\n2.0 PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\nRoche Colorado Corporation (RCC) uses piperidine in the production of pharmaceutical intermediates, and in performing research and development of new and/or improved pharmaceutical processes.  Specifically, piperidine is used in the production of anti-HIV/AIDs pharmaceuticals.  Pharmaceuticals are primarily produced via synthesis routes involving organic chemicals.  Roche Colorado Corporation has one regulated substance under 40 CFR 68 that exceeds the plan threshold: piperidine.  Piperidine is an organic chemical used in the synthesis of pharmaceuticals.\n\nThe piperidine threshold for triggering applicability of 40 CFR 68 is 15,000 pounds per process.  RCC implemented an RMP for piperidine per 40 CFR 68 in October 2001 and began using greater than threshold quantities of piperidine in November 2001.  This RMP is an update of the October 2001 submittal reflecting storage, containment and unloading enhancements installed.    The new main storge vessel containing piperidine has a worst case capacity of 38,000 pounds.\n\nPiperidine has associated hazards that can potentially affect on-site employees and the general public if there is a large spill.  The worst case scenario and alternative release scenarios are described below per 40 CFR 68.\n\nPiperidine is a chemical with a pungent odor that is readily detectable below concentrations of concern.  Th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28314,
      "SummaryText": "e odor is described in literature as amine-like, heavy, sweet, floral, animal odor, odor of pepper.  Due to the odor, exposed persons will not voluntarily stay in areas of even low concentrations.  Little data regarding exposure limits is available in the literature, however Roche Colorado Corporation has been advised by expert toxicologist's to consider the following concentrations for emergency response planning purposes:\n\t\n\t1 ppm: It is believed that nearly all individuals could be exposed up to this airborne concentration for up to one hour without experiencing other than mild, transient adverse health effects or without perceiving a clearly defined objectionable odor. \n\n\t10-100 ppm: It is believed that nearly all individuals could be exposed up to this airborne concentration range for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\n\n\t100-1000 ppm: It is believed that nearly all individuals could be exposed up to this airborne concentration range for up to one hour without experiencing or developing life threatening health effects.\n\nAnticipated health effects are acute irritation/toxicity including skin irritation, corrosive effect on human tissue, nausea.  Below is a description of the release scenarios for piperidine and their off-site consequences:\n\n2.1 WORST-CASE SCENARIO DESCRIPTION\n\nOne worst-case scenario has been developed for Roche Colorado Corporation.  RCC has two vessels potentially containing significant amounts of piperidine.  Vessel 1 has a maximum volume of 20,000 liters.  Vessel 2 has a maximum voulume of 12,000 liters.  Vessel 1 has full secondary containment.  The secondary containment surface area available for volatilization in the event of a spill is approximately 314 square feet.  Vessel 2's piperidine content is normally administratively managed at a 5% concentration of piperidine.  However, in the event that the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28314,
      "SummaryText": "administrative procedures fail, and the vessel experiences a catastrophic failure, the contents of the vessel will form an uncontained pool with a surface area larger than 314 square feet available for volatilization.  Therefore, RCC chose the catastrophic failure of vessel 2 as the worst case scenario.  The worst case release would be as a liquid spill to the ground.  Liquid piperidine is then subject to evaporation that may create a vapor cloud that would reach off-sire receptors per EPA distance-to-endpoint factors.\n\n2.2 ALTERNATIVE RELEASE SCENARIO DESCRIPTION\n\nThe alternative release scenario is a piperidine release from a delivery tank truck.  RCC has two options for unloading piperidine.  The first option is a new unloading pad adjacent to the new 20,000 liter storage tank.  The new storage pad is equiped with a spill pump that is sized with a large enough capacity to pump at rate equivalent to the highest spill rate from a tank truck spill.  The pump directs spill material to a catch tank and secondary containment system large enough to accomodate an entire tank truck.  The second option for unloading is a remote unloading pad with containment capacity for a 2000 gallon tank truck.  The containment pad surface area is approximately 416 square feet which is larger than the surface area of the containment for the primary unloading pad.  Therefore, a release of the contents of the second unloading pad was chosen as the alternate worst case release scenario because of the higher potential to affect offsite receptors.   The concrete pad qualifies as passive control.  Active mitigation of the release is human intervention.  The alternative release scenario distance-to-endpoint will reach off-site receptors. \n\n3.0 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nRoche Colorado Corporation has been in compliance with OSHA's Process Safety Management (PSM) program for a number of years.  The EPA has said that a process in complia"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28314,
      "SummaryText": "nce with OSHA PSM is also in compliance with RMP program level 3.  The process containing piperidine at Roche Colorado Corporation is RMP program level 3.  All elements of OSHA PSM have been implemented for the piperidine containing process.\n\nKey aspects of the PSM program include: process safety information reviews, process hazard analysis, operating procedure documentation and review, class room and on-hands training prior to system operation, mechanical integrity program, management of change program, pre-startup reviews, incident investigation, routine compliance audits, hot work permit program, contractor qualification, and employee participation in process safety reviews.\n\n4.0 FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving RMP regulated chemicals in the last five years that have affected offsite receptors or have resulted in significant loss of property or injury of personnel.\n\n5.0 EMERGENCY RESPONSE PROGRAM\n\nRoche Colorado Corporation has a comprehensive emergency response plan that addresses employee, contractor and public safety.  Moreover, Roche Colorado Corporation is committed to the protection of both its employees and the public.\n\n6.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nRoche Colorado Corporation has a proactive incident investigation program that acts as a continuous mechanism to evaluate and improve safety.  A Compliance Team consisting of environmental, safety and regulatory affairs representatives conduct weekly audits and follow up of all incident reports.  Incidents are tracked according to the program and a system is in place to coordinate close out of action items and improvement of all environmental and safety control systems.  The Compliance Team conducts monthly training of employees to communicate issues and improvements learned via the audits and incident reports. \n\n\nVer. 5/2003"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 28314,
      "SummaryText": "RMP Executive Summary\n\nThis Risk Management Plan is provided as an update to an RMP plan that was submitted on October 2, 2001.  This update is required because Roche Colorado Corporation has added a 20,000 liter storage tank (working volume of 16,000 liters) and a new unloading pad.  The new storage tank decreases the overall risks of handling piperidine because the storage tank has full secondary containment and level indication with distributive control read outs.  The new unloading pad also decreases handling risks because it is adjacent to the new storage tank which allows direct observation of the tank truck and the storage tank during material transfer.  Finally, the new storage pad further decreases handling risks because the new pad has an active spill mitigation pump that directs and tank truck spill directly to a catch tank.  The update is required per EPA regulations because a process hazard analysis (PHA) was required for the new storage tank.\n\n1.0 RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nRoche Colorado Corporation currently uses Environmental Protection Agency (EPA) Risk Management Program (RMP) regulated chemicals below threshold quantities with the exception of Piperidine. Roche Colorado Corporation has evaluated the requirements of the RMP rule and has reviewed present emergency management practices.  Roche Colorado Corporation has determined that current practices meet or exceed the requirements of RMP. \n\nRoche Colorado Corporation is a member of the American Chemistry Council's Responsible Care® program. Responsible Care® consists of a comprehensive management system designed to address risks associated with the handling of chemicals.  Moreover, Roche Colorado Corporation has an extensive process safety management program designed to satisfy all of Occupational Safety & Health Administration's (OSHA) Process Safety Management program requirements and the RMP.  Roche Colorado Corporation is dedicated to working with the community emergen"
    }
  ]
}