{
  "FacilityID": 28431,
  "FacilityName": "East & West Site  Water & Wastewater Facilities",
  "FacilityStr1": "1001 West River Drive",
  "FacilityStr2": null,
  "FacilityCity": "Margate",
  "FacilityState": "FL",
  "FacilityZipCode": "33063",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12011",
  "LEPC": "District 11Hollywood Florida",
  "FacilityLatDecDegs": "26.240556",
  "FacilityLongDecDegs": "-80.2175",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.laker.net/margatefl",
  "FacilityEmailAddress": "dees@laker.net",
  "FacilityDUNS": 10439768,
  "ParentCompanyName": "City of Margate",
  "Company2Name": null,
  "CompanyDUNS": 10439768,
  "Company2DUNS": 0,
  "OperatorName": "Department of Environ. & Engr. Ser.",
  "OperatorStr1": "1001 West River Drive",
  "OperatorStr2": null,
  "OperatorCity": "Margate",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33063",
  "OperatorZipCodeExt": null,
  "FTE": 82,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141768",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "City of Margate Water & Wastewater Facility RMP",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-06-23 00:00:00",
  "ErrorReportDate": "2003-06-23 00:00:00",
  "ReceiptDate": "1999-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2003-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2002-06-25 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 26.24052,
  "FRS_Long": -80.21007,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40844,
      "AltID": "Chlorine Gas East Plant",
      "FacilityID": 28431,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 53625,
          "ProcessID": 40844,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41774,
          "ProcessID": 40844,
          "NAICSCode": "325181",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23267,
              "Process_NAICS_ID": 41774,
              "SafetyReviewDate": "1998-09-01 00:00:00",
              "PHA_Date": "1995-01-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1995-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Buildings enclosed on 3 sides",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Replace piping & valves every 5 years",
              "OpProceduresReviewDate": "1998-09-01 00:00:00",
              "TrainingReviewDate": "1997-07-31 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-09-01 00:00:00",
              "EquipmentInspectionDate": "1998-09-01 00:00:00",
              "EquipmentTested": "Chlorine System",
              "ChangeMgmtDate": "1995-01-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-09-01 00:00:00",
              "PreStartupReviewDate": "1995-01-01 00:00:00",
              "ComplianceAuditDate": "1999-04-01 00:00:00",
              "AuditCompletionDate": "1999-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1995-01-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-09-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-09-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-09-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Margate DEES accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices, and is in compliance with all applicable EPA Prevention Program requirements.\n\nSpecific chlorine release prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, continuous up-date for training and certification of all personnel, replacement of all piping and valves every five years, and presence of chlorine detectors.  The September, 1998 PSM is referenced as a support document to the RMProgram 3 Prevention Program.",
              "_chemicals": [
                {
                  "PrimaryKey": 34030,
                  "PreventionProgram3ID": 23267,
                  "ProcessChemicalID": 53625
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 40845,
      "AltID": "Chlorine Gas - West Plant",
      "FacilityID": 28431,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 53626,
          "ProcessID": 40845,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41775,
          "ProcessID": 40845,
          "NAICSCode": "325181",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28431,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-09-01 00:00:00",
    "ERTrainingDate": "1997-07-01 00:00:00",
    "CoordinatingAgencyName": "Margate Fire and Rescue Department",
    "CoordinatingAgencyPhone": "9549717010",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28431,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Margate Department of Environmental & Engineering Services (DEES) accidental release prevention policy is a unified approach that integrates technologies, procedures, and management practices.  All applicable procedures required by the U.S. Environmental Protection Agency (EPA) Prevention Program are followed and implemented.  The DEES emergency response policy requires the preparation of response plans for the West Wastewater Treatment Facility, and the East Water and Wastewater Treatment Facility.  The Emergency Response Program is designed to work within the framework of the emergency response services provided by the City fire and police departments.  This response plan is in full compliance with the EPA Emergency Response Program requirements.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe stationary source is identified as the City of Margate East and West Water and Wastewater Treatment Facilities.  The treatment facilities are manned and operated 24 hours a day and seven days a week.  The water and wastewater treatment process involves the injection of chlorine gas for scale control and disinfection.  The existing chlorine demands at the East and West sites are 900 and 300 pounds per day respectively.  The future maximum demands at the East and West sites are 1200 and 600 pounds per day respectively.  The West site stores up to 8 tons of chlorine gas, and the East site stores up to 12 tons of chlorine gas.\n\nWORST-CASE RELEASE SCENARIO\n\nThe offsite consequence analysis includes consideration for two different chlorine release scenarios, identified as \"worst-case release\" and \"alternative scenario\".   EPA defines the worst-case release as the maximum quantity in the largest vessel is released as a gas over a ten-minute period due to an unspecified failure.  The alternative scenario is defined as more likely to occur than the worst-case scenario.\n\nThe model used to determine the impact o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28431,
      "SummaryText": "f each scenario is the Areal Locations of Hazardous Atmospheres (ALOHA) program.  A description of the model is presented in Appendix 5.  The distance traveled by the chlorine released before its concentration decreases to the \"toxic endpoint\" selected by EPA as 3 ppm, (the emergency response planning guideline level 2 (ERPG-2) has to be determined.  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\"  The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined, \"to estimate the population potentially affected.\" The guidelines and tables developed by the ALOHA model were used to determine the toxic endpoints and population potentially affected.\n\nThe worst-case scenario at the Margate East and West sites assumes the failure of a one ton cylinder.  It is assumed that the cylinder is struck and the liquid valve is sheared off.  The cylinder is full and releases liquid chlorine gas for a period of 10 minutes.  The release occurs at night with mostly clear skies and low winds.  The atmospheric dispersion modeling for the worst case scenario was performed using the EPA-mandated meteorological Stability Category F conditions and assumptions.  This produces a distance to the toxic endpoint of approximately 2.6 miles.  This will affect an estimated residential population of approximately 98,000.  Chlorine concentrations of 20 ppm, ERPG-3, (value used for emergency planning purposes) are estimated to be detected at a downstream distance of approximately 1.1 miles.  This will affect an estimated residential population of approximately 17,600.\n\nALTERNATIVE RELEASE SCENARIO\n\nThe alternative release scenario involve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28431,
      "SummaryText": "s the failure of a valve at the top of the 1-ton cylinder resulting in the release of chlorine gas through a 5/16-inch-diameter opening for duration of 60 minutes.  The maximum average sustained release rate is 10.5 lbs. per minute.  The average release rate is 5.3 lbs. per minute. The total amount of chlorine released is 317-lbs.  The release scenario assumed a wind speed of 3 m/s and an atmospheric stability class D.  This produces a distance to the toxic endpoint, (ERPG-2; 3 ppm), of approximately 0.48 miles.  This will affect an estimated residential population of approximately 3,350.  Chlorine concentrations of 20 ppm, ERPG-3, (value used for emergency planning purposes) are estimated to be detected at a downstream distance of approximately 0.17 miles.  This will affect an estimated residential population of approximately 425. \n\nAn actual release would have a shorter toxic endpoint and affect less population because of the factors described below, however the plume travel distances and population numbers (full circle) presented herein will be used for emergency planning.  The following facts should be taken into consideration. \n\n(1) Approximately 26% of the total compressed liquefied chlorine released to atmosphere flashes as vapor.  The remaining un-flashed liquid forms liquid-droplet aerosols.  This results in the formation of a very dense chlorine cloud consisting of vapor and liquid droplets, with dispersion characteristics significantly different than for a cloud consisting of chlorine gas.\n(2) The population within an elliptical plume extending downwind of the release point is potentially affected.  This plume area is approximately 6 % of the area of the full circle.\n\nThe City of Margate recently approved bonds for improvements to the water and wastewater treatment facilities.  The capital improvement program includes active mitigation measures that will discontinue the use of chlorine gas at the East and West Water and Wastewater Treatment Plant sites.  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28431,
      "SummaryText": "The City is planning to install on-site generation of sodium hypochlorite as an alternative to the existing chlorine gas systems within 3-years of the sale of bonds for the new capital improvements.\n\nDEES GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe general DEES accidental release prevention program is based on the following key elements:\n\nv High level of training of the plant operations and maintenance staff\nv Preventive maintenance program\nv Use of state-of-the-art process and safety equipment\nv Use of accurate and effective operating procedures, written with the participation of the operators\nv Conducting a hazard review of the equipment and procedures\nv Implementation of an auditing and inspection program\n\nSpecific chlorine release prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, continuous update of training and certifications, the replacement of all piping and valves every 5 years, and the presence of chlorine detectors.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases (or any kind of releases) of chlorine at the Margate Water and Wastewater Treatment Facilities with in the past five years.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe facilities have an emergency response program, which is coordinated with the City fire and rescue, and police departments.  The program includes an emergency response decision tree and notification plan.  Emergency response drills and drill evaluations are conducted every three months.  Emergency operation and response procedures are also reviewed at that time.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nOne (1) significant change to improve safety was identified in 1995, when a Process Safety Management Program was initially completed for these facilities.  The recommended action to replace the entire chlorine piping and fittings at the East and West sites "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28431,
      "SummaryText": "every five years has been evaluated and implemented as required.  The chlorine manifold piping and associated fittings were replaced at the West plant in January of 1997.  The chlorine manifold piping and associated fittings were replaced at the East plant(s) in February of 1997."
    }
  ]
}