{
  "FacilityID": 28465,
  "FacilityName": "Pretty Water Gas Processing Facility",
  "FacilityStr1": "2207 (4-27) Aspen Mountain Road",
  "FacilityStr2": null,
  "FacilityCity": "Rock Springs",
  "FacilityState": "WY",
  "FacilityZipCode": "82901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56037",
  "LEPC": "Sweetwater County LEPC",
  "FacilityLatDecDegs": "41.304917",
  "FacilityLongDecDegs": "109.084333",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "SW",
  "FacilityURL": "www.bcck.com",
  "FacilityEmailAddress": "bcckeng@nwol.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "BCCK Engineering, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 39601315,
  "Company2DUNS": null,
  "OperatorName": "BCCK Operations, Inc.",
  "OperatorStr1": "2500 N. Big Spring",
  "OperatorStr2": "Suite 280",
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79705",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "wyr000201814",
  "EPAFacilityID": "100000182919",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-07-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-06-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-06-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-04-08 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-30 00:00:00",
  "AnniversaryDate": "2008-06-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 41.304917,
  "FRS_Long": -109.084333,
  "FRS_Description": "SW CORNER OF LAND PARCEL",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "equipment was dismantled & sold with the site restored to its natural state",
  "_processes": [
    {
      "ProcessID": 40884,
      "AltID": "NRU Column",
      "FacilityID": 28465,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53670,
          "ProcessID": 40884,
          "ChemicalID": 93,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41814,
          "ProcessID": 40884,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 40885,
      "AltID": "NGL Storage Tank",
      "FacilityID": 28465,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53671,
          "ProcessID": 40885,
          "ChemicalID": 94,
          "Quantity": 21000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53672,
          "ProcessID": 40885,
          "ChemicalID": 98,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 53673,
          "ProcessID": 40885,
          "ChemicalID": 118,
          "Quantity": 27000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41815,
          "ProcessID": 40885,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 40886,
      "AltID": "Condensate Storage",
      "FacilityID": 28465,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53674,
          "ProcessID": 40886,
          "ChemicalID": 125,
          "Quantity": 96166.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41816,
          "ProcessID": 40886,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28465,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-05-01 00:00:00",
    "ERTrainingDate": "2003-05-01 00:00:00",
    "CoordinatingAgencyName": "Sweetwater Fire District #1",
    "CoordinatingAgencyPhone": "3073629390",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28465,
      "SummaryText": "RMP\nExecutive Summary\nPretty Water Gas Processing Facility\n\nFacility's Overall Approach to Chemical Safety\n\nThe Pretty Water Gas Processing Facility is subject to the requirements of 29 CFR OSHA 1910.38(a) and 29 CFR OSHA 1910.120.  The Pretty Water Facility Supervisor is responsible/accountable for implementation, evaluation, and maintaining the Emergency Response Plan in accordance with BCCK Operations, Inc.  Safety Standards, 29 CFR OSHA 1910.38(a), and 29 CFR OSHA 1910.120.\n\nEvery effort has been taken to minimize or eliminate all potentially hazardous situations.\n\nProcess Description and Regulated Substances Handled\n\nThe Pretty Water Gas Processing Facility is a gas processing plant that upgrades low BTU gas into salable products.  The facility is designed for a maximum  inlet gas flowrate of 12 MMSCFD.  The gas enters the plant at approximately 600 psig and is routed to an inlet slug catcher where free water is removed from the gas.  Next, the gas is routed to a condensate separator.  Condensate is separated from the gas stream here.  The condensate is stabilized and is then routed to the condensate storage tank.  The condensate is pumped onto trucks for transport to market.\n\nThe condensate free gas continues through the process and is processed for the removal of hydrogen sulfide (less than threshold levels) and carbon dioxide using a conventional amine system.  Once the hydrogen sulfide and carbon dioxide is processed to acceptable levels, the gas is routed to the inlet of the Nitech(Trademark) Nitrogen Rejection Unit (NRU) where the gas is dehydrated using molecular sieve beds and nitrogen and natural gas liquids (NGLs) are separated from the gas stream.  The NGLs are separated in the cold separator vessel and are routed to the NGL storage tanks.  The NGLs are loaded onto trucks for transport to market.  The NGL free gas is routed through a series of passes through the NRU Column and a brazed aluminum plate fin heat exchanger.  Using thermodynamic principal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28465,
      "SummaryText": "s, the nitrogen and methane are cryogenically separated.  The nitrogen is vented to atmosphere and the sales gas, primarily consisting of methane, is compressed and sent to a nearby pipeline for transporation to market.\n\nThere are no toxic substances handled by the Pretty Water Gas Processing Facility.  Flammable substances handled by the facility include methane, ethane, propane, butane and pentane.  The largest vessel containing methane is the NRU column.  The NGL Storage Tanks are the largest vessels handling ethane, propane, and butane.  The Condensate Storage tank contains the largest volume of pentane.\n\nWorst-Case Release Scenarios\n\nUsing RMP*Comp the Worst Case Release Scenarios for each flammable substance were calculated.  If an overpressure of the NRU Column occurred, approximately 8,000 pounds of methane could be released to the atmosphere.  The estimated distance to 1 psi overpressure according to RMP*Comp under this scenario is 0.2 miles.  There are no offsite impacts under this scenario.\n\nShould an overpressure of one of the two NGL Storage Tanks occur, ethane (21,000 pounds), propane (30,000 pounds) or butane (27,000 pounds) could be released.  The estimated distance to 1 psi overpressure according to RMP*Comp under this scenario is 0.2 miles.  Again, there are no offsite impacts under this scenario.\n\nShould an overpressure of the Condensate Storage Tank occur, approximately 96,000 pounds of pentane could be released.  According to RMP*Comp, the estimated distance to 1 psi overpressure is 0.4 miles for this scenario.  Again, no offsite impacts would be experienced under this scenario.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe Pretty Water Gas Processing Facility is subject to the requirements of 29 CFR OSHA 1910.38(a) and 29 CFR OSHA 1910.120.  Each operator is trained for what steps to take in the event of an accidental release.  Furthermore, the Pretty Water Gas Processing Facility has been designed t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28465,
      "SummaryText": "o minimize or eliminate hazardous situations for operating personnel.  The facility is equipped with proper alarming equipment and is controlled to prevent overpressuring of any equipment.\n\nFive-year Accident History\n\nThe Pretty Water Gas Processing Facility is a new facility and has not experienced any accidental releases. \n\nEmergency Response Program\n\nAn effective and viable Emergency Response Plan is intended to provide prior planning and guidance in responding to emergency incidents.  The primary considerations in its development are personnel and public safety, protection of company and public property, and protection of the environment.\n\nAlthough the plan addresses varied emergency situations that may occur, it recognizes that flexibility and the use of the organization's knowledge and experience is critical to safe resolution of emergency incidents.  Response actions outlined in the plan provide a framework that promotes quick, responsible actions and protects the safety of response personnel and the public.\n\nThe Pretty Water facility will conduct one (1) drill per year which will activate this plan.  Actual incidents may fulfill the requirements for an individual drill or exercise.  Additionally, any activation of this Plan will be documented and critiqued as necessary\n\nFacility operation personnel will extinguish incipient or first stage fires, control disaster or potential disaster situations, and perform or assist in rescue operations.  The responding fire department will be given primacy when they have received a call from a BCCK Operations, Inc. representative requesting assistance in controlling a fire on plant property.\n\nDuring an emergency fire situation, any contract labor foreman working on site should report to the BCCK Operations, Inc. Supervisor for directions on assisting in resolving the emergency.  The first priority of BCCK Operations, Inc. and any contract supervisor in a major fire situation is to ascertain the location and condition of hi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28465,
      "SummaryText": "s personnel.  If it is apparent that any personnel are missing or injured, a search and rescue should be initiated.  The safety of personnel and care for the injured will take precedence over other actions, but no rescue will be undertaken without first determining that it can be done safely.  After all personnel have been accounted for, they will be given instructions by the supervisors in charge.\n\nA fire that cannot be immediately extinguished, or a potentially large fire hazard should be communicated by two way radio to activate the Emergency Response Plan.\n\nThe radio system will be used to alert personnel and pinpoint the nature and area of the fire.  Radio priority is then given to personnel directly involved with the incident.\n\nInformation on the safety of either contract or company employees in the affected area should be relayed to the Plant Supervisor or his relief.  The Plant Operator will implement the isolation of affected areas and/or shutdown.\n\nDuring normal working hours, the plant is staffed with adequate personnel on site to man all positions and functions of the emergency response.\n\nDuring night shifts, weekends, and holidays, there is a minimal amount of manpower on site - normally only two (2) operators.  The following modifications to the standard procedures will be made for this case.  As always, primary consideration will be given to the safety of personnel and care for the injured.  If an incipient stage fire is in process and can be handled by the available personnel, it should be extinguished only after another BCCK Operations, Inc. employee or superintendent has been notified.  If the fire is not manageable, notifications should be made and the employees should evacuate the area as necessary.  Initiate an Emergency Shutdown if deemed necessary.\n\nPlanned Changes to Improve Safety\n\nAs this is the start-up of a new facility, there are currently no planned changes to improve safety at this point in the operation of the facility.  As experience"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28465,
      "SummaryText": "for this specific plantsite is gained through the operation of the facility, changes will be implemented as necessary to maintain proper safety of the employees and the environment."
    }
  ]
}