{
  "FacilityID": 28470,
  "FacilityName": "Melamine Chemicals, Inc.",
  "FacilityStr1": "39041 Hwy. 18, River Road",
  "FacilityStr2": null,
  "FacilityCity": "Donaldsonville",
  "FacilityState": "LA",
  "FacilityZipCode": "70346",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22005",
  "LEPC": "Ascension Parish LEPC",
  "FacilityLatDecDegs": "30.108333",
  "FacilityLongDecDegs": "-90.958333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.misschem.com",
  "FacilityEmailAddress": "petev@misschem.com",
  "FacilityDUNS": 55023238,
  "ParentCompanyName": "Triad Nitrogen, LLC",
  "Company2Name": "Mississippi Chemical Corp.",
  "CompanyDUNS": 32556586,
  "Company2DUNS": 8161432,
  "OperatorName": "Triad Nitrogen, LLC",
  "OperatorStr1": "39041 Hwy. 18, River Road",
  "OperatorStr2": "P.O. Box 310",
  "OperatorCity": "Donaldsonville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70346",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "70346MLMNC390",
  "EPAFacilityID": "100000065911",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0180-00005-V0",
  "SafetyInspectionDate": "1997-11-03 00:00:00",
  "SafetyInspectionBy": "EPA, LADEQ",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-06-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-06-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-12-02 00:00:00",
  "DeRegistrationEffectiveDate": "2010-11-24 00:00:00",
  "AnniversaryDate": "2008-06-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 30.096905,
  "FRS_Long": -90.953444,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility now merged into 100000126446. No longer a separate stationary source",
  "_processes": [
    {
      "ProcessID": 40895,
      "AltID": "Melamine Production,  M-1",
      "FacilityID": 28470,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53683,
          "ProcessID": 40895,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41825,
          "ProcessID": 40895,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23305,
              "Process_NAICS_ID": 41825,
              "SafetyReviewDate": "2003-05-29 00:00:00",
              "PHA_Date": "2003-05-29 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-06-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-05-28 00:00:00",
              "TrainingReviewDate": "2003-05-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-05-30 00:00:00",
              "EquipmentInspectionDate": "2003-06-01 00:00:00",
              "EquipmentTested": "Process Reboiler, Saturation Cooler, MEA Absorber, Ammonia Heater, Peabody Condenser, Vacuum Condenser, PRVs.",
              "ChangeMgmtDate": "2003-05-29 00:00:00",
              "ChangeMgmtReviewDate": "2003-05-28 00:00:00",
              "PreStartupReviewDate": "2003-06-01 00:00:00",
              "ComplianceAuditDate": "2001-04-15 00:00:00",
              "AuditCompletionDate": "2001-04-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-05-29 00:00:00",
              "HotWorkPermitReviewDate": "2003-05-29 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-05-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34073,
                  "PreventionProgram3ID": 23305,
                  "ProcessChemicalID": 53683
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28470,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-05-30 00:00:00",
    "ERTrainingDate": "2003-05-28 00:00:00",
    "CoordinatingAgencyName": "Ascension Parich OEP Office",
    "CoordinatingAgencyPhone": "2256218360",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28470,
      "SummaryText": "Executive Summary\n\nRMP EXECUTIVE SUMMARY ¿ LDEQ Number: 2604\n\nMelamine Chemicals, Inc. (MCI), a subsidiary of Triad Nitrogen, LLC , is committed to maintaining a world-class health, safety and environmental system.  The major focus is on excellence in operation and training of personnel to regulatory requirements.  Safety, health and environmental concerns are a major consideration for all business activities.  Personnel on site are required to comply with all applicable safety and environmental laws covering our facility.\n\nMCI and its employees have an enduring commitment to protecting health, safety and the environment.  In order to document that commitment, the Management Committee has authorized a Health, Safety and Environmental Statement of Policy.  This policy is summarized below:\n\nLaws, ruled and regulations in the area of health, safety and the environment impose responsibilities on the company and its employees.  An additional purpose of this policy is to set forth the principles, under which those responsibilities are to be fulfilled, thereby providing appropriate protection for employees, as well as the Company.\n\nEmployee Health and Safety\nWorkplace health and safety are of paramount concern.  The Company and its employees are expected to be aware of and adhere to laws, regulations, company policy and procedures designed to ensure safe and healthy workplace conditions and practices.\n\nContractors and Visitor Health and Safety\nAll contractors working in the Company facility or visitors to Company facilities are expected to be aware of and adhere to all company health, safety and environmental policies and procedures.  The Company may conduct, or require proof of, appropriate training.\n\nEnvironment\nIn all its activities, the Company will remain sensitive to environmental concerns and the need for sound regulations, company policy, and company procedures designed to ensure that the Company¿s activities are in compliance with all federal, state and local envi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28470,
      "SummaryText": "ronmental laws and regulations.\n\nMinimization of Risks and Releases to the Environment and Conservation of Natural Resources \nIt is the policy of the Company to minimize the environmental, health and safety risks to its employees and the communities in which it operates, to minimize releases to the environment, to conserve natural resources through efficient use and careful planning, to recycle materials whenever technically and economically feasible, and to dispose of wastes in a manner determined to be environmentally sound.\n\nCompliance with Laws\nThe activities of the Company and its employees are expected to be in full compliance with all applicable laws, rules and regulations relating to health, safety and the environment.\n\nAssistance to Government\nIt is the policy of the Company to participate with all levels of government in the development of equitable and effective health, safety and environmental laws, rules and regulations.\n\nEmployee Training\nIt is the Company¿s continuing policy to inform and educate each employee regarding health, safety and environmental laws and regulations applicable to his or her job.  Through such training, the employee is responsible for learning and maintaining knowledge of the health, safety and environmental duties of his or her job.\n\nInternal Reporting by Employees\nEmployees must be alert to the presence of unsafe conditions or violations of environmental law and shall report these to designated managers.  It is the policy of the Company that no retaliatory action will be taken against any employee for good faith reporting consistent with this policy.\n\nCompliance\ncompliance with this policy is an ongoing duty of each employee and compliance will be monitored.  Each employee is obligated to report immediately to designated managers any failure to comply with this policy.\n\nEmployees who violated this policy are subject to disciplinary action, up to and including discharge.\n\nFull compliance with the intent and purpose of this poli"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28470,
      "SummaryText": "cy requires that employees be diligent within the scope of their responsibilities.  Employees will be evaluated and compensation will be based, in part, on their effectiveness in implementation of this polity.\n\nDisclosure\nIt is the policy of the Company to make relevant disclosure, consistent with all laws, regulations and this policy, to its employees, and to the public, of incidents relating to its operations that cause environmental harm or pose health or safety hazards.\n\nCommitment of Resources\nThe Company will commit resources to implement this policy and to monitor and sustain a process to ensure that Triad management is kept informed of all health, safety and environmental matters.\n\nSelf-Evaluation\nTriad management, or its designee, shall conduct an annual self-evaluation to assess the Company'¿ status regarding implementation of this policy.\n\nMelamine Chemicals is engaged in the production of melamine crystal, a key component in melamine-formaldehyde resins.  The unit uses low pressure (<90 psi).  Urea is imported via pipeline as the raw material.  Ammonia is used and produced as a by-product in both processes.  The regulated substances used in the plant and the maximum quantities present are:\n\tAmmonia (Anhydrous):\t15,630 lbs in M-I  low pressure process.\n\n\nWorst Case Release Scenarios ¿ Ammonia\nA total failure or rupture of the ammonia storage drum in the M-I process could cause the release of the drum content and ammonia from connected vessels.  This release is calculated at 15,630 pounds of ammonia.  In this particular release, the endpoint of the release is 2.13 miles.\n\nAlternative Release Scenario ¿ Ammonia \nIn this scenario, the assumption was made that facility personnel would not be able to stop a release from the Ammonia Drum due to a small crack in the vessel.  Under normal operating conditions, the drum is never kept full, typically holding about 2000 pounds of ammonia.  Based upon this volume with a crack area of 0.25 inches, the total release en"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28470,
      "SummaryText": "dpoint would be 0.35 miles.\n\nAs previously discussed, MCI¿s commitment to safety and the environment takes priority.  MCI¿s safety and environmental record reflects this commitment.  The following is a summary of the multiple layers of safety and environmental protection that MCI has in place at our plant to protect our employees and the community:\n- Managing risks in something we do on a daily basis.\n-  We have worked for many years to reduce risks at our site and to be prepared for emergencies.\n-  Our employees are highly skilled and well trained.\n-  Our equipment is routinely (number of times per year) inspected and tested to make sure it is safe.\n-  We have computer monitors and controls throughout our plants to detect potential leaks or releases before they occur.\n-  Hazard reviews are done for all changes.  They involve ¿what if¿ scenarios where employee teams investigate every possible scenario of a new project and resolve it as part of the design phase of the project.\n- Emergency response, includes employee responders as well as off-site responders like LEPC, State Police and HAZMAT.\n-  We work closely with the police and fire departments, and we conduct routine drills.\n-  In the event of an emergency, we are prepared to respond.\n\nMCI has not had any accidental releases, as defined by the Risk Management Program regulations, for the last 5 years.  The release that MCI has had in the past 5 years are typically very small release in nature to the air and do not meet the criteria that is stipulated in the regulations.\n\nMCI has an extensive emergency response program both within the facility and within the community.  Within the facility there is a written Emergency Response Plan (ERP).  The ERP is designed as a guide to help in determining the magnitude of an incident, the steps needed to bring the incident under control and the requirements to ensure that all the federal, state, and local laws are complied with.  The ERP is a definitive plan that assigns respo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28470,
      "SummaryText": "nsibilities, defines several different methods of communication, assigns control centers and safe havens, designates evacuation procedures, and coordinates with outside assistance.  The plan has detailed action plans that specifically address incidents concerning chemical spills, fire, acts of nature, civil strife, area risks from outside the facility, personnel injury or fatality, and equipment failures.  The plan also designates the type and frequency of training that each person is required to have depending on their responsibilities.  Furthermore, the plan commits the management team to devote the necessary resources to prepare, implement and audit the ERP.\n\nAlthough the ERP is specifically written for the MCI facility the plan is also part of the parish wide emergency response plan organized with the local LEPC.  All these plans are reviewed with representatives of the LEPC, State Police, Sheriff Department, Fire Departments, regulatory agencies and industry.\n\nMCI is striving on a daily basis to try and make the facility as safe as possible for the employees, contractors and the community.  MCI literally has safety and or environmental training going on almost daily, every employee and contractor will attend several safety and/or environmental training meeting annually.  MCI and its employees have an enduring commitment to protecting health, safety and the environment and our success is accomplished by research, innovation and the use of good common sense."
    }
  ]
}