{
  "FacilityID": 28512,
  "FacilityName": "Clear Lake Plant",
  "FacilityStr1": "9502 Bayport Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Hoechst Celanese",
  "FacilityLatDecDegs": "29.6225",
  "FacilityLongDecDegs": "-95.063889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "BOC Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1368141,
  "Company2DUNS": null,
  "OperatorName": "BOC",
  "OperatorStr1": "9502 Bayport Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77507",
  "OperatorZipCodeExt": null,
  "FTE": 32,
  "OtherEPAFacilityID": "TXR000052175",
  "EPAFacilityID": "100000208385",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "4056",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Refrigeration - Propylene",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 29.625819,
  "FRS_Long": -95.061592,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 40987,
      "AltID": "Refrigeration-Propylene",
      "FacilityID": 28512,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 53791,
          "ProcessID": 40987,
          "ChemicalID": 129,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 41918,
          "ProcessID": 40987,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23378,
              "Process_NAICS_ID": 41918,
              "SafetyReviewDate": "2003-05-28 00:00:00",
              "PHA_Date": "2003-01-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "Yes",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-04-29 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-05-27 00:00:00",
              "TrainingReviewDate": "2003-05-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-05-28 00:00:00",
              "EquipmentInspectionDate": "2003-05-21 00:00:00",
              "EquipmentTested": "Slide Valve Postioner",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-05-28 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2003-05-28 00:00:00",
              "AuditCompletionDate": "2003-12-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-05-27 00:00:00",
              "HotWorkPermitReviewDate": "2003-05-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-05-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34162,
                  "PreventionProgram3ID": 23378,
                  "ProcessChemicalID": 53791
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28512,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-07-01 00:00:00",
    "ERTrainingDate": "2003-05-28 00:00:00",
    "CoordinatingAgencyName": "CIMA Channel Mutal Aid",
    "CoordinatingAgencyPhone": "2818379191",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28512,
      "SummaryText": "The BOC  Clear Lake facility, owned and operated by The BOC Group, Incorporated is located at 9502 Bayport B;vd.; Pasadena, TX 77507. The management and employees of the Clear Lake facility are committed to the prevention of any accidental releases of Propylene.  If an accidental release should occur, the facility is prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to the community and the environment.\n\nThe facilities primary operation is the manufatureing, purification, and distribution of Carbon Monoxide. A support process to this operation involves the use of propylene.  Propylene is use in a refrigeration system which cools part of the carbon monoxide production process.  Propylene is received from a bulk Propylene Supplier (Therchem) via a Bulk Trailer and stored in a 1200 gallon tank. The system contains a maximum of 12,000 pounds of  propylene.  The propylene is then used in a closed refrigeration system.\n\nThe worst-case scenario, based on the EPA's definition for a flammable gas release, would be the rupture of the 1,850 gal. (8,000 lb.) vessel.  The results would be a maximum release of 8,000 lbs of  propylene over a 10 minute period.\n\nThe endpoint of 1 psi overpressurization (EPRG-2 Level) was determined to be 0.2 miles using the RMP*Comp. (1.06) software. The weather conditions used were a wind speed of 1.5 meters/sec., Stability Class F, an air temperature of 77 degrees F and urban topographical terrain.\n\nThe impacted area would affect 0 residents and no special receptors based on the 2000 US Census data obtained from Land View V.  One major chemical industry is within the endpoint. No environmental receptors are affected.  No passive/active mitigation or administrative controls were considered in this assessment.\n\nThe alternative release, or more probable, scenario which was determined involved the release of 600 pounds from the 1850 gal. storage vessel. This release w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28512,
      "SummaryText": "ould result in the release of 600 lb of liquid propylene and modeling a ¿Vapor Cloud Fire¿. No passive or active mitigation measures were considered.\n\nThe release endpoint of the Lower Flamable Limit (LFL) or 4.0% was determined to be 0.10 miles using the RMP*Comp. (1.06) software. The Weather conditions used were a wind speed of 3.0 meters/sec., Stability Class D, and air temperature of 77 degrees F and urban topographical terrain.\n\nThe affected area would include no residents and a  major chemical plant based on actual observations. The business/industry would be the Celenase Chemical Facility.\n\nPassive and Active Mitigation systems in place that would reduce the likelihood of a release or the release itself. These include a fire deluge system, check valves, a preventive maintenance schedule, and safeties.\n\nThe facility has developed a comprehensive prevention program designed to prevent accidental releases of propylene.  The program utilizes state-of-the-art technology, sound engineering practices, administrative controls and active employee participation.  Employees serve on task groups and teams in developing and maintaining risk management program elements.  They are frequently consulted concerning the various aspects of the program and ways to continually improve the safety of the process.  \nWritten process safety information was developed for the propylene system to enable managers, supervisors, and employees to identify and understand the process hazards.  This information was utilized to develop a Process Hazard Analysis (PHA) which assists management and employees in making decisions for improving safety and reducing the consequences of releases of propylene. The PHA focuses attention on equipment, instrumentation, utilities, human actions, (routine and nonroutine), and external factors that might impact the process by identifying potential failure points or failure modes in the process. The new PHA was completed in April 29, 2001 and will be updated at l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28512,
      "SummaryText": "east every 5 years. \n\nDetailed 0perating procedures exist which describe tasks to be performed, dates to be recorded, operating conditions to be maintained, samples to be collected, and safety and health precautions to be taken.  The procedures were reviewed/approved to ensure they are technically accurate by employees, managers and personnel with the technical expertise/knowledge of the process.  The operating procedures were review on May 27, 2003 and are annually reviewed/revised as necessary to reflect current operations.\n\nEmployees are thoroughly trained, including maintenance and contractor employees.  The training meets and exceeds the requirements as outlined in OSHA¿s hazard communication standard 29 CFR 1910.1200.  Training includes operating procedures, safe work practices, emergency procedures (including alarms), special assignments, evacuation and emergency response; safety rules and procedures; routine and nonroutine work authorization; and other pertinent process safety information.  Each employee trained has a defined and documented program based on their job duties.  The training goals and objectives have been established and written in clear and measurable terms.  Hands-on training is provided to employees to enhance their senses beyond listening.  In addition, employees receive traditional classroom instruction including lectures, videos, programmed and on-the-job instruction.  Employees are encouraged to actively participate.  The employees  are periodically evaluated to ensure they posses the necessary skills and knowledge via written tests, observation and/or oral interviews. The training program was last reviewed on May 28, 2003.\n\nA contractor screening process has been established and is designed to ensure that contractors hired or used can accomplish their assigned tasks without compromising the safety and health of employees and the public.   The screening program involves obtaining information on the contractor's safety performance, includ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28512,
      "SummaryText": "ing injury and illness rates, and experience.  In addition, the contractor's safety performance, job skills, knowledge, and certifications (such as pressure vessel welders) are also verified. The contractors safety procedures were last review in May 2003.  \n\nPreStart-up Safety Reviews (PSSR) are used for new or modified processes to improve the design and construction of the process from a reliability and quality stand point.  The PSSR recommendations are resolved before final installations are complete. Other items completed prior to initial process startup include piping and instrument diagrams, operating procedures, and ensuring operating personnel are fully trained.  The initial startup and normal operating procedures are fully evaluated as part of the PSSR to assure a safe transfer into the normal operating mode for meeting the process parameters. The last PreStart-up Safety Review was conducted in 1995.\n\nAn on-going mechanical integrity program (maintenance) is used to ensure safe process operations. Equipment used to store, process, or handle propylene has been designed, constructed, installed, and maintained to minimize releases.  The mechanical integrity program includes the identification and categorization of equipment/instrumentation, inspection/tests and their frequencies, development of maintenance procedures and training of maintenance personnel, criteria for acceptable test results, documentation of test/inspection results, and documentation of manufacturer's recommendations to prevent failure of equipment and instrumentation. This program was review in May 2003.\n\nHazardous work or nonroutine work is controlled in a consistent manner.  The hazards identified is communicated to those performing the work and to operating personnel whose work could affect the safety of the process.  The Celenase/BOC Hazardous Work Program describes the steps that a supervisor, contractor representative or other authorized issuer needs to follow to manage hazardous work."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28512,
      "SummaryText": "The program references and coordinates applicable lockout/tagout procedures, line breaking, hot work authorization, elevated work/fall protection, controlling access to covered process areas, and excavation procedures. BOC's Confined Space Entry Program is a separate permitting system designed to manage it's employees/contractors in performing this type of work. This Program was review in July 2002 for both employees and contractors.\n \nManagement of Change (MOC) procedures have been developed for permanent changes to process chemicals, technology, equipment and facilities.  MOC procedures are designed to ensure that prior to any change occurring, that technically qualified personnel with knowledge and expertise of the chemical process, reviews and approves the proposed changes.  This would include both technical and mechanical changes.  Process changes include all modifications to equipment, procedures, raw materials and processing conditions other than replacement in kind.  A Process Change Authorization is required for all changes.  Management of Change procedures were review on May 2003.\n\nProcess incidents which result in or could reasonably have resulted in a release of propylene are investigated, including near misses, within 48 hours of the incident.  The purpose of the incident investigation is to identify the underlying causes of the incident and to implement corrective action to prevent similar incidents and avoid past mistakes.  Process incidents are investigated by a Team which include both management and employees and is multidisciplinary. An incident report is prepared following the investigation which includes the findings, conclusions, and recommendations. The Facility Manager is responsible for ensuring that all report recommendations are completed or resolved by those individuals responsible for follow-up. All resolutions are communicated to all affected employees.\n\nThe facility has an emergency preparedness/response plan.  The plan outlines"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28512,
      "SummaryText": "what actions employees are to take when there is a release of propylene.  The plan complies with OSHA standard 29 CFR 1910.38 and has been coordinated with local emergency response agencies.  The facilities Emergency Response plan was reviewed in May 2003 and tested every 3 months. \n\nThe facility receives a compliance audit in accordance with EPA's Risk Management Standard Part 68 at least once every three years.  The audit includes an evaluation of the design and effectiveness of the risk management system and a field inspection of the safety and health conditions, and practices to ensure compliance.  The Team uses an audit tool to document each audit step and ensure an effective audit is conducted.  A Protocol Policy has been developed to ensure that proper follow-up is accomplished.\n\nBOC will make available all information, including any Trade Secret information as it relates to compliance with this regulation.   \n        \nThe facility has an Emergency Response Plan which has been integrated with the local community Emergency Response Plan. All employees and contractors are trained in the plan prior to commencement of work.  The Emergency Plan is tested and critiqued twice a year to insure that it is current. Changes are made and reviewed if deficiencies are found. The site does have trained Emergency Responders at the technician level and BOC maintains trained technician level Emergency Responders on 24hr. call through out the US.\n\nSafety improvement is an on-going process at the facility.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no additional specific propylene safety recommendations for implementation at this time."
    }
  ]
}