{
  "FacilityID": 28613,
  "FacilityName": "Eliokem Inc.- Akron Plant",
  "FacilityStr1": "1380 Tech Way Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Akron",
  "FacilityState": "OH",
  "FacilityZipCode": "44306",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39153",
  "LEPC": "Summit County LEPC",
  "FacilityLatDecDegs": "41.048889",
  "FacilityLongDecDegs": "81.474722",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 98363026,
  "ParentCompanyName": "Eliokem Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jarry Persinger",
  "OperatorStr1": "1380 Tech Way Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Akron",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44306",
  "OperatorZipCodeExt": null,
  "FTE": 53,
  "OtherEPAFacilityID": "OHR000106880",
  "EPAFacilityID": "100000087719",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-07-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-12-26 00:00:00",
  "DeRegistrationEffectiveDate": "2016-12-19 00:00:00",
  "AnniversaryDate": "2008-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 41.05144,
  "FRS_Long": -81.47761,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41128,
      "AltID": null,
      "FacilityID": 28613,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 54115,
          "ProcessID": 41128,
          "ChemicalID": 25,
          "Quantity": 67000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 54116,
          "ProcessID": 41128,
          "ChemicalID": 120,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42063,
          "ProcessID": 41128,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23445,
              "Process_NAICS_ID": 42063,
              "SafetyReviewDate": "2003-06-27 00:00:00",
              "PHA_Date": "2003-01-13 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-01-13 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-06-27 00:00:00",
              "TrainingReviewDate": "2003-06-11 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-06-27 00:00:00",
              "EquipmentInspectionDate": "2003-06-11 00:00:00",
              "EquipmentTested": "unloading station and storage tank",
              "ChangeMgmtDate": "2003-06-23 00:00:00",
              "ChangeMgmtReviewDate": "2003-06-23 00:00:00",
              "PreStartupReviewDate": "2003-01-13 00:00:00",
              "ComplianceAuditDate": "2003-07-01 00:00:00",
              "AuditCompletionDate": "2003-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-01-20 00:00:00",
              "HotWorkPermitReviewDate": "2003-01-20 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34403,
                  "PreventionProgram3ID": 23445,
                  "ProcessChemicalID": 54115
                },
                {
                  "PrimaryKey": 34404,
                  "PreventionProgram3ID": 23445,
                  "ProcessChemicalID": 54116
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 41129,
      "AltID": "Storage of 1,3-Butadiene",
      "FacilityID": 28613,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 54117,
          "ProcessID": 41129,
          "ChemicalID": 120,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42064,
          "ProcessID": 41129,
          "NAICSCode": "325211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28613,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-06-10 00:00:00",
    "ERTrainingDate": "2003-06-27 00:00:00",
    "CoordinatingAgencyName": "Akron Fire Department",
    "CoordinatingAgencyPhone": "3303752552",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28613,
      "SummaryText": "Executive Summary\n\n\nIntroduction\n\nEliokem Inc. has a chemical plant in Akron, Ohio, which is known as the Akron Plant.  The Akron Plant has been successfully manufacturing latex via polymerization since the 1940?s.  Our primary products include wet latex and resins. \nSince Eliokem Inc. use substances that are regulated by the Environmental Protection Agency (EPA), we have developed  a Risk Management Plan (RMP).  Risk Management Plans are required when a Toxic or Flammable chemical is stored above the EPA threshold.  Under RMP, Eliokem Inc. created a scenario to estimate the potential impact on its community in the unlikely event of an accidental chemical release.  \n\nAccidental Release Prevention and Emergency Policies\n\nEliokem Inc.?s  Akron Plant is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas and processes at our plant such as, design, installation, operating procedures, maintenance, and employee training.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.   Unforeseeably, if such a release does occur, we are completely coordinated with the Akron Fire Department.  \n\nThe Stationary Source and the Regulated Substances Handled\n\nThe Akron Plant has 2 regulated substances present at our facility.  These substances include, 1,3-Butadiene and Acrylonitrile.  Both substances are used as raw materials for our latex products.\nThe maximum inventory of 1,3 Butadiene at our facility is 120,000 lbs.\nAnd the maximum inventory of Acrylonitrile at our facility is 67,000 lbs.\n\nThe Worst Case Release Scenario and Alternate Release Scenario\n\nWorst case and alternate scenarios have been established and demonstrate the nearby areas which will be affected.  The worst case release scenario submitted for flammable substances involves a catastrophic release of  1,3 Butadiene from its storage location.  This "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28613,
      "SummaryText": "scenario involves the release of 120,000 lbs. of 1,3 Butadiene.  Passive mitigation systems such as dikes have been considered when evaluating this scenario.  It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10% of the released quantity participating in a vapor cloud explosion.  Under the worst case weather conditions, the maximum distance of 0.39 miles is obtained corresponding to an endpoint of 1 psi overpressure. \nThe alternate release scenario submitted for flammable substances involves a release of  \n1,3 Butadiene from its storage location.  The release is assumed to result in a vapor cloud explosion.  The scenario involves the release of 30,240 lbs. of 1,3 Butadiene in 60 minutes.  Passive mitigation controls such as dikes are taken into account to calculate the scenario.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.11 miles.  Both endpoint distances are measured from the point of the release.\n\nThe worst case release scenario submitted for toxic substances involves a catastrophic release of  Acrylonitrile from its storage location.  This scenario involves the release of 67,000 lbs. of Acrylonitrile.  Passive mitigation systems such as dikes have been considered when evaluating this scenario.  It is assumed that the entire quantity is released as liquid and vapor, and will last for 4320 minutes.  Under the worst case weather conditions, the maximum distance of 0.40 miles is obtained corresponding to an endpoint of 1 psi overpressure. \nThe alternate release scenario submitted for toxic substances involves a release of  Acrylonitrile from its storage location via a pipe or flange leak.  The scenario involves the release of 67,000 lbs. of Acrylonitrile in 2024 minutes.  The maximum distance to the flammable endpoint of 1 psi overpressure is 0.20 miles.  Both endpoint distances are measured from the point of the release.  \n\nThe General Accidental Relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28613,
      "SummaryText": "se Prevention Program \n\nThe Akron Plant has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  The Akron Plant is also subject to EPCRA Section 302 notification requirements.  The following briefly describes the elements of the release prevention program that is in place at our stationary source. \n\nProcess Safety Information\nEliokem Inc.?s the Akron Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment design associated with all processes.  \n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular time period.  Any findings related to the hazard analysis, are addressed in a timely manner.\n\nOperating Procedures\nFor the purpose of safely conducting activities within our covered processes, the Akron Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\nTraining\nThe Akron Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity \nThe Akron Plant carries out highly documented maintenance checks on process equipment to ensure the proper operation.  Process equipmen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28613,
      "SummaryText": "t examined by these checks include among others, pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, control and pumps.  Maintenance operations are carried out by qualified personnel with previous training.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the Akron Plant to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in the process are promptly made aware of and offered training to deal with the change.\n\nPre Startup Reviews\nPre Startup safety reviews related to new processes and to modifications in present processes are conducted as a regular practice.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into service.\n\nCompliance Audits\nThe Akron Plant conducts audits on a regular basis to determine whether the previsions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe Akron Plant promptly investigates any incident that has resulted in, or could result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from re-occurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nOur facility truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28613,
      "SummaryText": "igned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nSignature:\nTitle:\nDate Signed:"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28613,
      "SummaryText": "revention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility?s implementation of the RMP rule, including information resulting from process hazard analyses.\n\nContractors \nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Akron Plant has a strict policy informing the contractors of known potential hazards related to the contractor?s work.  Contractors are also informed of all the procedures for emergency response.  \n\nFive year Accident History\n\nEliokem Inc.?s the Akron Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our strict release prevention policies, there have been no accidental releases during this period.\n\nEmergency Response Plan\n\nThe Akron Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notifications of local emergency response agencies and the public, as well as post incident duties.\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes.\nSummit County LEPC is the Local Emergency Planning Committee with which our emergency plan has been coordinated and verified.  \n\nPlanned Changes to Improve Safety\n\nSeveral developments and findings have resulted form the implementation of the various \nElements of our accidental release prevention program.___________________________\n____________________ are some of the major steps we want to take to improve safety at our facility.  These changes are expressed to be implemented by ___________________.\n\nCertification Statement\n\nThe unders"
    }
  ]
}