{
  "FacilityID": 28623,
  "FacilityName": "Clackamas Distribution Center - Freezer Warehouse",
  "FacilityStr1": "16800 South East Evelyn Street",
  "FacilityStr2": null,
  "FacilityCity": "Clackamas",
  "FacilityState": "OR",
  "FacilityZipCode": "97015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41005",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "45.401111",
  "FacilityLongDecDegs": "-122.564167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Safeway, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9137209,
  "Company2DUNS": null,
  "OperatorName": "Safeway, Inc.",
  "OperatorStr1": "5918 Stoneridge Mall Road",
  "OperatorStr2": null,
  "OperatorCity": "Pleasanton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94588",
  "OperatorZipCodeExt": "3229",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062219",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-06-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-07-24 00:00:00",
  "ErrorReportDate": "2003-07-24 00:00:00",
  "ReceiptDate": "2003-07-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-07-23 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 45.401295,
  "FRS_Long": -122.562714,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41140,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 28623,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54129,
          "ProcessID": 41140,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42075,
          "ProcessID": 41140,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23452,
              "Process_NAICS_ID": 42075,
              "SafetyReviewDate": "2003-02-20 00:00:00",
              "PHA_Date": "2003-05-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Implementation of procedures and policies to promote a safe and more efficient work environment",
              "OpProceduresReviewDate": "2003-07-21 00:00:00",
              "TrainingReviewDate": "2001-08-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-18 00:00:00",
              "EquipmentInspectionDate": "2003-06-17 00:00:00",
              "EquipmentTested": "Ammonia Refrigeration Plant",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2001-08-13 00:00:00",
              "PreStartupReviewDate": "2003-06-20 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-08-13 00:00:00",
              "HotWorkPermitReviewDate": "2001-08-13 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2001-08-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34412,
                  "PreventionProgram3ID": 23452,
                  "ProcessChemicalID": 54129
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28623,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Clackamas Fire Department",
    "CoordinatingAgencyPhone": "5033786377",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28623,
      "SummaryText": "A.ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe management and staff of the Clackamas Distribution Center - Freezer Warehouse are committed to operating their facility with the highest regard for the safety of the public, Clackamas Distribution Center - Freezer Warehouse personnel, and the environment.  To ensure the safety of the public, Clackamas Distribution Center - Freezer Warehouse personnel, and the environment, the plant has implemented a management system that integrates the elements of OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119 and EPA's Risk Management Program (RMP) rule, 40 CFR part 68.  The policies and procedures integrated under the Clackamas Distribution Center - Freezer Warehouse's management system specifically address prevention of the release of anhydrous ammonia, and emergency response to an accidental release of ammonia.\n\nB. STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Clackamas Distribution Center - Freezer Warehouse operates one refrigerated warehouse and freezer.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the facility.  Ammonia is handled in a closed-loop process that consists of the following general stages: liquid storage; expansion; evaporation; compression; and condensation.\n\nRefrigeration process equipment at the facility operates continuously.  Compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for dock operations and freezers.  \n\nThe ammonia refrigeration system is the only process at the Clackamas Distribution Center - Freezer Warehouse which is subject to the EPA RMP rule (and the OSHA PSM standard).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon Receiver to the 65 psig Controlled Pressure Recei"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28623,
      "SummaryText": "ver (CPR-2).  In addition, liquid ammonia is routed to the compressors for thermosyphon oil cooling.  The 65 psig Controlled Pressure Receiver sends liquid ammonia to the Dock Area Evaporators and the 25 psig Controlled Pressure Receiver (CPR-1).  At the Dock Evaporators, the liquid ammonia is partially vaporized as it absorbs heat from the product and room.  The resultant vapor/liquid mix is drawn back to the +15°F Suction Accumulator (ACC-2).\n\nThe 25 psig Controlled Pressure Receiver sends liquid ammonia to the Freezer Penthouse Evaporators.  At the Freezer Penthouse Evaporators, the liquid ammonia is partially vaporized as it absorbs heat from the product and room.  The resultant vapor/liquid mix is drawn back to the -25°F Suction Accumulator (ACC-1).\n\nAt the Suction Accumulators, the wet suction from the evaporators is separated.  The liquid falls to the bottom and the vapor is drawn from the top by the Compressors.  The Booster Compressors and High Stage Compressors draw from the -25°F Suction Accumulator and +15°F Suction Accumulator, respectively.   Liquid is returned to the respective Controlled Pressure Receiver via two Drum Traps associated with each accumulator (PD-1, 2, 3, & 4).\n\nThe Swing Compressor may operate as either a Two Stage or High Stage Compressor, depending on system demand.  The Booster Compressors discharge vapor to the +15°F Suction Accumulator and the High Stage Compressors discharge vapor to the Condensers.  High stage discharge from the Compressors is also used in i) the hot gas defrost cycle of the evaporators, ii) pressurizing the Drum Traps during the liquid transfer process, and iii) maintaining pressure in the Controlled Pressure Receivers.\n\nThe high stage discharge from the Compressors is condensed back into high pressure liquid at the Condensers.  Latent heat is rejected by spraying water and blowing air over coils filled with ammonia.  The resultant high pressure ammonia liquid is returned to the Thermosyphon Receiver to begin t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28623,
      "SummaryText": "he cycle again.\n\nThe system is also equipped with an Automatic Purger and a Glycol Heat Exchanger.  The Auto Purger removes non-condensables (i.e., air and water) from the system.  There are four purge points located at the Condenser, and one at the Thermosyphon Receiver.  The Glycol Heat Exchanger uses high stage discharge to reheat glycol chilled in the freezer underfloor heating system.\n\nThe relief valves are set at 250 psig on the high pressure vessels, the compressors, the heat exchanger, the purger, and the condensers and 150 psig on the low pressure vessels.  The relief valves vent to an Ammonia Dump Tank located outside the equipment room.\n\nC. HAZARD ASSESSMENT SUMMARY\n\n Worst Case Release Result Summary\n\nThe worst case release scenario is a release of the total quantity of ammonia in the largest vessel in the ammonia refrigeration system, taking into account administrative controls that limit the maximum quantity in the vessel.  If a vessel is located inside a building, the EPA allows a passive mitigation factor of 55% to be used in calculating the release rate to the outside atmosphere when the release is enclosed by a building.\n\nThe 65 psig Controlled Pressure Receiver has a capacity of 18,600 pounds, is located inside the engine room and is the largest vessel in this system.  The entire system charge of ammonia is 20,000 lbs.  Therefore, the total release quantity is 18,600 pounds.  This results in a release rate of 1,023 lbs to the outside atmosphere.\n\nFor analyzing the worst case release scenario, EPA requires the use of the most pessimistic meteorological conditions that will allow for the maximum downwind exposure.  Low wind speeds (1.5 m/s) and stable atmospheric conditions (F stability) will allow the gas cloud to travel as far as possible by limiting cloud dispersion.  The results are conservative.\n\nEPA's 'Risk Management Program Guidance for Ammonia Refrigeration,' May 2000, Exhibit 4-4 was used to find the downwind distance for the worst case re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28623,
      "SummaryText": "lease to 200 ppm in an urban setting.  The RMP*CompTM Model developed by the National Oceanic and Atmospheric Administration and EPA was used to prepare the data in this guidance document.  This guidance document provides data for ammonia refrigeration systems and will ensure consistency throughout the industry.\n\nThis release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.  \n\nNote: Item 2-6 is required to be reported to 1 significant-figure and is the mitigated release rate, where as item 2-5 is the total quantity released and is reported to 2 significant figures.\n\nAlternative Release Result Summary\n\nA release of ammonia resulting from a 0.25 inch diameter hole in a pipe for one hour.  The release rate of ammonia due to the pressure of the tank is 122 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed and D stability.  Reference tables in the Risk Management Program Guidance for Ammonia Refrigeration were used to determine the maximum distance to the toxic endpoint of 200 ppm in urban conditions.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\nNote: Item 3-5 is required to be reported to 2 significant figures and item 3-6 is required to be reported to 1 significant figure.\n\n D.  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Clackamas Distribution Center - Freezer Warehouse has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Oregon OSHA's Process Safety Management (PSM), and Federal EPA's Risk Management Program (RMP), Program 3 requirements.\n\nThe ammonia refrigeration system at the Clackamas Distribution Center - Freezer Warehouse was designed and constructed in accordance with the Uni"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28623,
      "SummaryText": "form Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors throughout the plant, pressure relief valves to protects vessels' integrity, and automatic shut down systems that prevent equipment damage and ammonia releases.  In the event of ammonia detection, audible and visual alarms are triggered throughout the facility. \n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition changes that occur within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.\n\nE. FIVE YEAR ACCIDENT HISTORY\n\nThe Clackamas Distribution Center - Freezer Warehouse began operation in July 2003.  Therefore, the facility has not had any ammonia releases that resulted in deaths, injuries, property damage, environmental damage, or offsite evacuations.\n\nF. EMERGENCY RESPONSE PROGRAM\n\nThe Clackamas Distribution Center - Freezer Warehouse facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility.  Emergency response activities are coordinated with the Clackamas Fire Department and the local fire houses.  If necessary, the facility will call 9-1-1 to alert the local Police and Fire Departments.\n\nOther responders will be called as needed, including the Clackamas Fire Department.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center will be called.\n\nThe Clackamas D"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28623,
      "SummaryText": "istribution Center - Freezer Warehouse will be responsible for evacuating and ensuring the safety of its employees in case of an emergency evacuation.  Evacuation drills are performed at least annually.  Other training received by employees includes: ammonia awareness, what to do in case of emergency, and where to go when an evacuation is called. \n\nThe following summarizes the notification procedures at the facility:\n\n1. First call Clackamas Fire Department at 911 from an internal/landline phone.  You can directly contact the Oregon Emergency Response Commission c/o State Fire Marshall at 503-378-6377.\n\n2 If an ammonia release exceeds 100 pounds (Federal Reportable Quantity CERCLA), call the National Response Center 800-424-8802, the State of Oregon Department of Environmental Quality at 800-452-0311, and the Clackamas County LEPC at 503-229-5263.\n\n3 If additional help is required for an ammonia spill or leak, the facility can call Chemtrec - Manufacturing Chemists Association 800-424-9300.\n\n4 If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per day at 800-342-9293.\n\n5 If an ammonia release spills into the sewer system, storm drain or any type of waterway, contact the Molalla Sewer Treatment Plant 503-829-5407.\n\n6 If there is an accident that involves a fatality or if three or more people are hospitalized for injuries, call the local Portland OSHA Office at 503-326-2251.\n\n7 In the event of any acute employee exposure, emergency medical assistance/ambulance shall be requested.  In the event of lesser exposure without immediate serious medical symptoms, the exposed individuals shall be transported to:\nKaiser Permanente, Sunnyside Medical Center\n10180 S.E. Sunnyside Rd.\nClackamas\n\n8. Safeway Contacts - The following individuals should be contacted if a release occurs: Rick Mueller, Corporate Environmental & Safety Compliance Manager at 925-467-3789, Mike Dysinger, Corporate Maintenance at 925-520-8536, and Steve Ramsey, Environmental Af"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28623,
      "SummaryText": "fairs /  Food Safety Manager at (503) 657-6286\n\nG. PLANNED CHANGES TO IMPROVE SAFETY\n\nThe initial Process Hazard Analysis (PHA), which was completed on March 4th & 5th, 2003,  included a Hazard and Operability (HAZOP) study as well as a Facility \"What If\" Walkthrough.  The PHA provided mitigation measures to improve safety at the Clackamas Distribution Center - Freezer Warehouse located at 16800 South Evelyn Street, in Clackamas, Oregon. \n\nThe following recommendations from the PHA are scheduled to be completed by March 2004:\n\nR01  Develop a policy for investigating the causes of any abnormal operations within the ammonia process prior to making any \"quick fixes\". \n\nR02  Conduct an ammonia awareness training program that includes informing all employees of the following: 1) the presence of and the hazards associated with ammonia at the facility, 2) how to recognize ammonia, 3) what to do if they observe an ammonia leak, and 4) where to go when they are told to evacuate.\n\nR03  Follow manufacturer's recommended maintenance schedule to test, and if necessary, calibrate ammonia detectors every six months.  Include in Mechanical Integrity program.\n\nR04  Implement a policy to not store any excess material inside engine room, such as pallets, extra oil, or other flammable materials.\n\nR05  Implement a maintenance program to replace/recertify relief valves every five years (as per industry standard).  Automatically replace any relief valves that unseat.  Include in Mechanical Integrity program.\n\nR06  Include a weekly visual inspection of the pressure relief valves for frost.  Include in Mechanical Integrity program.\n\nR07  Conduct annual visual inspection of vessels, paint and repair any signs of corrosion and insulation damage as necessary.  Include in Mechanical Integrity program.\n\nR08  Train maintenance employees in the proper procedure for isolating the thermosyphon receiver.  (Shut inlet valve and allow the vessel to evacuate all ammonia before working on it.)\n\nR09  Cons"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 28623,
      "SummaryText": "ider implementing a program to walk engine room and areas with evaporators at least once every day and complete a daily log sheet.  Include in Mechanical Integrity program.\n\nR10  Consider implementing a schedule to conduct periodic walkthroughs of the ammonia piping and valving on the roof.  Include in Mechanical Integrity program.\n\nR11  Consider locating the safety shower/eye wash station just outside the engine room.\n\nR12  Establish a policy that eye-protection (chemical goggles) must be worn when working on the ammonia system.\n\nR13  Develop an oil log  to record oil added to the system and an estimation of amount drained.\n\nR14  Consider adding a globe valve upstream of the spring loaded valve for safe oil draining.\n\nR15  Consider requiring all maintenance employees to watch the IIAR film on oil draining.\n\nR16  Consider adding a pressure gauge to each oil pot throughout the system.\n\nR17  Ensure that all evaporator coils are periodically maintained by cleaning the pans and coils per IIAR Bulletin 110 Guidelines (include criteria in maintenance program).  Include in Mechanical Integrity program.\n\nR18  Implement a policy for investigating the causes of any \"banging or slamming\" heard throughout the facility.\n\nR19  Establish a procedure to have two people involved when either preparing for a non-routine maintenance procedure and/or performing the procedure (such as opening ammonia piping or working on the roof).\n\nR20  Consider implementing a policy to carry an eye wash bottle when performing maintenance on ammonia equipment located away from eye wash stations (i.e. roof).\n\nR21  Have operator inform someone on the ground before and after performing walkthrough on the roof.\n\nR22  Conduct monthly testing of eye wash stations and showers.  Include in Mechanical Integrity Program.\n\nR23  Consider tying streamers to the penthouse evaporators for easy acknowledgment that the evaporator fans are on.\n\nR24  Consider performing an annual test to verify that compressor shut down s"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 28623,
      "SummaryText": "afeties are functioning properly, as per manufacturer's recommendations.  Include in Mechanical Integrity program.\n\nR25  Consider having maintenance employees check compressor oil on a daily basis.  Record in Daily Log and include in Mechanical Integrity program.\n\nR26  Include condenser maintenance, such as cleaning the pan, eliminators, and spray nozzles, in written program and ensure it is in compliance with IIAR Bulletin 110 Guidelines.  Include in Mechanical Integrity program.\n\nR27  Maintain lockout/tagout program when working on condensers, so condenser water is not restarted prematurely.\n\nR28 Implement a policy that all employees working in the engine room are required to use ear protection.\n\nR29  Consider purchasing portable lights for use during maintenance in poorly lighted areas.\n\nR30  Once the operating procedures have been written, have maintenance employees review them prior to start up.\n\nR31  Write operating procedures for the use of the Dock Evaporators as heaters, include in Operating Procedure section of the PSM.  \n\nR32  Include an operating procedure for pumping out the vessels and evaporators, include in Operating Procedure section of the PSM.\n\nR33  Label all valves within the Emergency Dump Station.  Include procedures for using the Emergency Dump Stations within the box.\n\nR34  Determine the locations of all manholes within the facility."
    }
  ]
}