{
  "FacilityID": 28679,
  "FacilityName": "GEM Microelectronics Materials, L.L.C.",
  "FacilityStr1": "6200 Mumford Road",
  "FacilityStr2": null,
  "FacilityCity": "Bryan",
  "FacilityState": "TX",
  "FacilityZipCode": "77807",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48041",
  "LEPC": "Brazos County LEPC",
  "FacilityLatDecDegs": "30.710278",
  "FacilityLongDecDegs": "90.423611",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "hser.honeywell.com",
  "FacilityEmailAddress": "ralph.day@honeywell.com",
  "FacilityDUNS": 45767493,
  "ParentCompanyName": "Honeywell International, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 948373204,
  "Company2DUNS": null,
  "OperatorName": "Honeywell International, Inc.",
  "OperatorStr1": "101 Columbia Road",
  "OperatorStr2": null,
  "OperatorCity": "Morristown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07962",
  "OperatorZipCodeExt": "1053",
  "FTE": 17,
  "OtherEPAFacilityID": "TXR000030981",
  "EPAFacilityID": "100000055307",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-20 00:00:00",
  "SafetyInspectionBy": "City of Bryan Industrial Discharge",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-07-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 30.71155,
  "FRS_Long": -96.42258,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41271,
      "AltID": "Inorganic Chemical",
      "FacilityID": 28679,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54358,
          "ProcessID": 41271,
          "ChemicalID": 55,
          "Quantity": 210000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 54359,
          "ProcessID": 41271,
          "ChemicalID": 56,
          "Quantity": 78000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 54360,
          "ProcessID": 41271,
          "ChemicalID": 53,
          "Quantity": 100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42207,
          "ProcessID": 41271,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23534,
              "Process_NAICS_ID": 42207,
              "SafetyReviewDate": "2003-04-01 00:00:00",
              "PHA_Date": "2003-04-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-04-01 00:00:00",
              "TrainingReviewDate": "2003-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Third-Party Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-03-27 00:00:00",
              "EquipmentInspectionDate": "2003-06-19 00:00:00",
              "EquipmentTested": "Deluge System",
              "ChangeMgmtDate": "2003-06-17 00:00:00",
              "ChangeMgmtReviewDate": "2003-03-27 00:00:00",
              "PreStartupReviewDate": "2003-06-25 00:00:00",
              "ComplianceAuditDate": "2003-05-01 00:00:00",
              "AuditCompletionDate": "2003-12-31 00:00:00",
              "IncidentInvestigationDate": "2003-06-06 00:00:00",
              "InvestigationChangeDate": "2003-06-06 00:00:00",
              "ParticipationPlansReviewDate": "2003-03-27 00:00:00",
              "HotWorkPermitReviewDate": "2003-03-27 00:00:00",
              "ContractorSafetyReviewDate": "2003-03-27 00:00:00",
              "ContractorSafetyEvalDate": "2003-03-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34609,
                  "PreventionProgram3ID": 23534,
                  "ProcessChemicalID": 54358
                },
                {
                  "PrimaryKey": 34610,
                  "PreventionProgram3ID": 23534,
                  "ProcessChemicalID": 54359
                },
                {
                  "PrimaryKey": 34611,
                  "PreventionProgram3ID": 23534,
                  "ProcessChemicalID": 54360
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28679,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-02-17 00:00:00",
    "ERTrainingDate": "2003-06-09 00:00:00",
    "CoordinatingAgencyName": "City of Bryan Fire Department",
    "CoordinatingAgencyPhone": "9798215969",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28679,
      "SummaryText": "GEM Microelectronics Materials, L.L.C.\nBryan, Texas\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nGEM Microelectronics, LLC (GEM)  is committed to design, manufacture and distribute its products and to handle and dispose of materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers, and the public from unacceptable risks.  GEM subscribes to the American Chemistry Counci's voluntary Responsible Care program and abides by the Responsible Care® Guiding Principles. \n\nSince 1988, the U.S. chemical industry, through the American Chemistry Council, has implemented Responsible Care, a voluntary program to achieve improvements in environmental, health and safety performance beyond levels required by the U.S. government. The program has resulted in significant reductions in releases to air, land and water, major improvements in workplace and community safety, and expanded programs to research and test chemicals for potential health and environmental impacts. Our industry creates products and services that make life better for people around the world ¿ both today and tomorrow. The benefits of our industry are accompanied by enduring commitments to Responsible Care® in the management of chemicals worldwide. We will make continuous progress toward the vision of no accidents, injuries or harm to the environment and will publicly report our global health, safety and environmental performance. We will lead our companies in ethical ways that increasingly benefit society, the economy and the environment while adhering to the following principles:\n\nTo seek and incorporate public input regarding our products and operations.\nTo provide chemicals that can be manufactured, transported, used and disposed of safely.\nTo make health, safety, the environment and resource conservation critical considerations for all new and existing products and processes.\nTo provide information on health or enviro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28679,
      "SummaryText": "nmental risks and pursue protective measures for employees, the public and other key stakeholders.\nTo work with customers, carriers, suppliers, distributors and contractors to foster the safe use, transport and disposal of chemicals.\nTo operate our facilities in a manner that protects the environment and the health and safety of our employees and the public.\nTo support education and research on the health, safety and environmental effects of our products and processes. \nTo work with others to resolve problems associated with past handling and disposal practices.\nTo lead in the development of responsible laws, regulations and standards that safeguard the community, workplace and environment.\nTo practice Responsible Care® by encouraging and assisting others to adhere to these principles and practices.  \n\nThe accidental release prevention and emergency response programs we have at our facilities are part of the high standards we strive for.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by law.\n\nThe GEM Microelectronics, LLC facility is located at 6200 Mumford Road in the City of Bryan Texas.  At the facility, we receive anhydrous hydrogen fluoride (HF), anhydrous ammonia, and hydrochloric acid via rail and truck.  The hydrogen fluoride and ammonia raw products are then purified through a number of processes and shipped out to customers via rail cars,  trucks, iso containers, or drums.  While the hydrochloric acid raw product is repackaged and shipped to customers. The facility supplies customers with purified hydrofluoric acid (49% to 70% concentration), hydrochloric acid (up to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28679,
      "SummaryText": "38% concentration), and ammonium fluoride(40%).  Ammonia, hydrochloric acid, and HF are the only toxic substances regulated under the Risk Management Program (RMP) present at the Bryan Plant in amounts greater than threshold quantities.  There are no flammable RMP substances present at the facility.  The facility is classified as Program Level 3 under the regulation.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n \n\nWorst Case and Alternative Release Scenarios\n\nAs specified by the U. S. Environmental Protection Agency (EPA) RMP Regulations, our worst case release scenario for toxic chemicals would be the loss of all of the HF in our largest vessel within 10 minutes.  In the case of the Bryan  Plant, this would involve our 12,050 gallon pressurized tank.  Such a scenario is highly unlikely.  Although we have active mitigation measures in place to prevent such releases (high level/pressure alarms, emergency shutdown, interlocks, deluge systems, and others) and to manage their consequences, the only control taken into account when modeling this scenario was that the release would occur inside a building.  \n\nAs required by EPA, an alternative release scenario which is more likely to occur than the worst case scenario must also be reported for each toxic chemical.  For the Bryan Texas plant  alternative release scenarios were developed for ammonia, hydrochloric acid, and HF, respectively.  Endpoint  distances were developed  based on the EPA OCA methods, which are known to overpredict the impact of any potential release from such a scenario. \n\nThe ammonia alternative release scenario is based on a release of ammonia during truck unloading due to an overfill of the ammonia storage vessel.  If"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28679,
      "SummaryText": "such an incident occurred and our active mitigation failed, two relief valves on top of the storage vessel would be activated during the filling process.  These valves ensure that the entire vessel does not rupture and only a minor controllable release results.  Excluding any active mitigation measures in the calculations, the 2-inch diameter valves could release the ammonia at a rate of approximately 0.7 tons per minute.  We have several mitigation measures in place to greatly reduce the chance that such an event could ever occur: \n\n·\tThe unloading operation is at a pressure (200 psig) that is lower than the established pressure of the relief valves (250 psig).  In other words, the compressor which fills the tank is incapable of delivering a pressure of 250 psig.\n·\tThe level of liquid ammonia is measured during the filling process and the compressor will automatically shut off should the level reach a high level setpoint. \n·\tThe unloading operation is monitored by GEM  personnel continuously so that any problems would be detected prior to an overfill of the vessel.\n·\tFire monitors are available to knock down any vapor that may be released.\n·\tIf a release of ammonia occurred and the fire water system was implemented, there is secondary containment that would ensure that the resulting wastewater is disposed of properly.\n\t\n\tThe hydrochloric acid alternative release scenario is based on a release of hydrochloric acid through through a 0.5 square inch hole or tear in the truck unloading hose.   Excluding any active mitigation measures in the calculations, the 0.5 square inch hole could release hydrochloric acid at a rate of approximately 1,090 pounds per minute.  We have several mitigation measures in place to greatly reduce the chance that such an event could ever occur including:\n\n\t Monitoring the transfer operation with trained personnel.\n\tMechanical integrity/pressure testing the transfer hose prior to each use.\n\tA secondary containment system.\n\n\n\tThe HF alternative"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28679,
      "SummaryText": "release scenario is based on a 0.5 square inch hole in piping inside the HF Barn.  If such an incident occurred, HF could be released from the building at a rate of 12.5 pounds per minute.  In calculating this distance, we took credit for the release occurring inside a building, however, we took no credit for any of our other mitigation measures.  We have several active mitigation measures in place to greatly reduce the chance that such an event could ever occur: \n\t\n·\tThe HF Barn vents to a scrubber system (2 scrubbers in series) which removes vapors at a 99.9% efficiency rate.\n·\tThe HF Barn is equipped with a vapor detection system.  If vapor is detected, a high concentration alarm is activated.\n·\tIf a higher concentration is detected by the vapor detection system, an emergency shutdown occurs and a deluge system is activated to absorb vapors in the building.\n\t\n\tThe presence of these active mitigation measures serves to both prevent these scenarios from occurring and minimize their impact if they do occur.  We have discussed these potential ammonia, hydrochloric acid, and HF releases with our employees and with local emergency response officials in the City of Bryan and Brazos County, and prepared response plans to further reduce the possibility of any impact on the public.\n\t\n\t\n\tPrevention Program\n\t\n\tThe Bryan  Plant operates under the strict guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program.  At the facility, we emphasize analysis of the potential hazards of our process, training of our employees, and on-going safety awareness.  Part of the PSM program also involves identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n·\tAll processes have a combination of interlocks and emergency shutdowns to ensure cessation of product movement within the plant if a problem were to arise.\n·\tAll process"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28679,
      "SummaryText": "areas have deluge systems which are automatically activated by chemical detection or, conversely, can be manually activated if necessary.\n·\tHF is unloaded inside a building which vents to a scrubber and has a deluge system with secondary containment.\n·\tThe HF acid and ammonia unloading and/or loading operations are covered by a canopy and are equipped with a deluge system and secondary containment.\n·\tFire water monitors cover 100% of the process area to ensure that fires are extinguished or vapor clouds can be knocked down.\n·\tScrubber systems have been installed in the HF, ammonia and hydrochloric acid processes to ensure at least 99% removal of any emissions.\n\t\n\tThese safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility since its inception.\n\t\n\tFive Year Accident History\n\t\n\tNo incident resulting in onsite or offsite impacts from the release of an RMP substance has occurred at the Bryan Plant within the last five years.   Although GEM takes pride in our record so far, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\t\n\t\n\tEmergency Response Program\n\t\n\tWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the GEM  Plant with the City of Bryan Fire Department, the College Station Fire Department, the Bryan Police Department, and the Brazos County Sheriff.  Also involved in emergency response for the facility would be the Texas Highway Patrol and St. Joseph Regional Health Center, if necessary.  The  Plant Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the facility is in place, and that plan has been coordinated with local officials, along with evacuation procedures, regular drilling, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28679,
      "SummaryText": "ment during emergency situations.\n\nManagement of Change\n\n·\tThe Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n·\tThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n·\tThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n·\tInternal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n·\tAn ongoing dialogue with the City of Bryan and Brazos County Emergency Management Directors will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.  \n\nWe encourage all interested citizens or community organizations to contact the City of Bryan and Brazos County Emergency Management Director for the latest information on emergency response for the county.  We plan to further integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}