{
  "FacilityID": 28704,
  "FacilityName": "Millard Refrigerated Services",
  "FacilityStr1": "3776 Taylorsville Hwy.",
  "FacilityStr2": null,
  "FacilityCity": "Statesville",
  "FacilityState": "NC",
  "FacilityZipCode": "28625",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37097",
  "LEPC": "Iredell County LEPC",
  "FacilityLatDecDegs": "35.815694",
  "FacilityLongDecDegs": "-80.965528",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "Millardref.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 41244153,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "John Hester, General Manager",
  "OperatorStr1": "3776 Taylorsville Hwy.",
  "OperatorStr2": null,
  "OperatorCity": "Statesville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28625",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183222",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-08-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-08-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-08-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 35.81521,
  "FRS_Long": -80.96338,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41312,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 28704,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54404,
          "ProcessID": 41312,
          "ChemicalID": 56,
          "Quantity": 50000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42248,
          "ProcessID": 41312,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23561,
              "Process_NAICS_ID": 42248,
              "SafetyReviewDate": "2003-07-01 00:00:00",
              "PHA_Date": "2003-07-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-07-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New Addition",
              "OpProceduresReviewDate": "2003-07-01 00:00:00",
              "TrainingReviewDate": "2003-07-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Self-study courses",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-01 00:00:00",
              "EquipmentInspectionDate": "2003-07-10 00:00:00",
              "EquipmentTested": "Ammonia evaperators, compressor, receivers, condseners, etc.",
              "ChangeMgmtDate": "2003-07-15 00:00:00",
              "ChangeMgmtReviewDate": "2003-07-01 00:00:00",
              "PreStartupReviewDate": "2003-07-15 00:00:00",
              "ComplianceAuditDate": "2003-07-18 00:00:00",
              "AuditCompletionDate": "2003-07-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-07-01 00:00:00",
              "HotWorkPermitReviewDate": "2002-07-02 00:00:00",
              "ContractorSafetyReviewDate": "2003-01-06 00:00:00",
              "ContractorSafetyEvalDate": "2002-11-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34641,
                  "PreventionProgram3ID": 23561,
                  "ProcessChemicalID": 54404
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28704,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-07-17 00:00:00",
    "ERTrainingDate": "2003-04-15 00:00:00",
    "CoordinatingAgencyName": "Iredell Emerency Management",
    "CoordinatingAgencyPhone": "7048785037",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28704,
      "SummaryText": "Executive Summary for\nMillard Refrigerated Services\nStatesville, NC\nAmmonia Refrigeration Facility\n\n1.\t Accidental Release Prevention and Emergency Response Policies\nWe at Millard Refrigerated Services are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Such releases are not foreseeable but our plans are fully coordinated with the highly trained emergency response personnel at Iredell County HAZMAT Team to control and mitigate the effects of any releases.\n\n2.\tThe Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities revolve around large-scale public storage of food products.  Anhydrous ammonia is the major regulated substance present at our facility. All of the ammonia inventory is used as a refrigerant.\n\nThe maximum inventory of ammonia at our facility is 60,000 lbs.\n\n3.\tThe Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nTo evaluate the worst case and alternative release scenarios for ammonia we have used the methodology given in the Model Risk Management Program and Plan for Ammonia Refrigeration by SAIC.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from the +20 deg F Accumulator.  The scenario involves the release of 18200 lbs. of Ammonia in a gaseous form over 10 minutes.  At Class F atmospheric stability and 1.5 m/s wind speed, the maximum distance of 1.70 miles is obtained corresponding to a tox"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28704,
      "SummaryText": "ic endpoint of 0.14 mg/L.\n\nThe alternative release scenario uses the canned scenario from the EPA's RMP Guidance Document for Ammonia Refrigeration, which is based upon a 1/4\" effective diameter oriface leading to an airborne release, representative of a pump seal leak or a gasket rupture .  The scenario involves the release of  1500 lbs. of Ammonia in a gaseous form over 10 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L of Ammonia is 0.10 miles.\n\nThe estimated residential population within the distance to the toxic endpoint is based upon the entire population of the census block group(s) in which the scenario is located, not the actual population within the radius.\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps.\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  In addition, our facility is subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nMillard Refrigerated Services maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all the processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the what-if methodology.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and will be revalidated at a regular interval of three years or sooner if required by the regulation.  Any findings related to the hazard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28704,
      "SummaryText": "analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Millard Refrigerated Services maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nMillard Refrigerated Services has a comprehensive training program in place to ensure that employees who are operating processes are completely competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nMillard Refrigerated Services carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance procedures are performed by qualified personnel with a strong background in maintenance practices.  Specialized training is provided to these personnel as needed.  Any equipment deficiencies identified during maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Millard Refrigerated Services to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and offered training to deal with the changes.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Millard Refrigerated Servic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28704,
      "SummaryText": "es.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\nCompliance Audits\nMillard Refrigerated Services conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nMillard Refrigerated Services promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nMillard Refrigerated Services believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information collected as part of the facility's compliance with the RMP Rule including information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Millard Refrigerated Services has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response to an accidental release of a regulated substance.\n\n5.\tFive-year Accident History\nMillard Refrigerated Services has an excellent record of preventing accidental"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28704,
      "SummaryText": "releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.\tEmergency Response Plan\nMillard Refrigerated Services has a written emergency response plan to deal with accidental releases of hazardous materials.  The policy of Millard Refrigerated Services is to participate in an emergency response rather than have an entire HAZMAT-trained team onsite.  This Millard facility will have at least one 24-hour HAZMAT-trained maintenance employee onsite.  The Millard Emergency Response Plan is coordinated with the local responding units, such as the fire department or HAZMAT team.  Millard has an Emergency Action Plan in place to properly prepare for emergency evacuations, to provide first aid and medical treatment and to contact federal, state and local officials in the event of a major release of ammonia.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe County of Iredell Office of Emergency Services is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n7.\tPlanned Changes to Improve Safety\nAll recommendations that were generated by the initial PHA and subsequent MOC's have been addressed.  Any new equipment installed in the future will incorporate new safety design and technology available at the time of installation.  If, based upon mechanical integrity inspections, improvements are necessary, they will be performed in a timely fashion."
    }
  ]
}