{
  "FacilityID": 28823,
  "FacilityName": "South Bay Power Plant",
  "FacilityStr1": "990 Bay Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Chula Vista",
  "FacilityState": "CA",
  "FacilityZipCode": "91911",
  "Facility4DigitZipExt": "1651",
  "FacilityCountyFIPS": "06073",
  "LEPC": "San Diego County DEH",
  "FacilityLatDecDegs": "32.613056",
  "FacilityLongDecDegs": "-117.096306",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P1",
  "LatLongDescription": "ST",
  "FacilityURL": "duke-energy.com",
  "FacilityEmailAddress": "sapizzo@duke-energy.com",
  "FacilityDUNS": 605550552,
  "ParentCompanyName": "Duke Energy South Bay LLC",
  "Company2Name": null,
  "CompanyDUNS": 60919705,
  "Company2DUNS": 0,
  "OperatorName": "Duke Energy South Bay LLC",
  "OperatorStr1": "990 Bay Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Chula Vista",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91911",
  "OperatorZipCodeExt": "1651",
  "RMPContact": "Susan Pizzo",
  "RMPTitle": "Environmental Scientist",
  "FTE": 77,
  "OtherEPAFacilityID": "CAT000619056",
  "EPAFacilityID": "100000151694",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not assigned",
  "SafetyInspectionDate": "2003-01-10 00:00:00",
  "SafetyInspectionBy": "San Diego County Dept. of Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-08-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-02-16 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-09 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 32.61472,
  "FRS_Long": -117.09611,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41445,
      "AltID": "Aqueous Ammonia Storage",
      "FacilityID": 28823,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42384,
          "ProcessID": 41445,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54571,
          "ProcessID": 41445,
          "ChemicalID": 57,
          "Quantity": 158350.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554571,
          "ProcessID": 41445,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28823,
      "SummaryText": "1.1  INTRODUCTION\n\n1.  In response to the County of San Diego Department of Environmental Health, Hazardous Materials Managment Division, this Risk Management Program document (RMP) has been developed for the South Bay Power Plant (SBPP) located in Chula Vista, California.  This document has been prepared to satisfy the following regulations:\n\n- California Office of Emergency Services, California Code of Regulations (CCR), Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention (CalARP) Program, October 10, 2002.\n\n- Code of Federal Regulations (CFR), Title 40, Part 68, Chemical Accident Prevention Provisions.\n\n2.  The purpose of this document is to facilitate the protection of public health, the environment, and facility employees by providing to the public and regulatory agencies information on regulated substances, a 5-year history of no accidents, potential offsite consequences of a hypothetical worst-case release, and coordination with local emergency response agencies.\n\n3.  The regulated substance of concern and focus of this document is aqueous ammonia (29.4 percent by weight).  The facility uses aqueous ammonia for selective catalytic reduction (SCR) of boiler flue gas nitrogen oxides (NOx) emissions to elemental nitrogen and water and is operated by Duke Energy South Bay LLC.\n\n4.  The EPA Risk Management Data Elements are contained in Chapter 2.0 of this RMP.  The format of Chapter 2.0 differs from the rest of this document because the chapter is generated by software issued by the EPA.\n\n5.  Information required in the RMP by the EPA Risk Management Program and the CalARP is summarized below in sections 1.2 through 1.5.\n\n1.2  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n1.  The SBPP has an existing Emergency Response Plan.  The plan provides emergency response organization, notification procedures, evacuation assembly locations, ammonia health hazards, and mitigation procedures that will respond to emergencies.  The obje"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28823,
      "SummaryText": "ctive of the Emergency Response Plan is to avoid, or at least, minimize, injuries to onsite and offsite persons, environmental damage, and property damage.\n\n2.  The Emergency Response Plan is reviewed annually and was updated in July 2002.  It is comprehensively reviewed in detail every five years.\n\n1.3  STATIONARY SOURCE AND REGULATED SUBSTANCE\n\n1.  The SBPP uses aqueous ammonia to reduce boiler NOx emissions to elemental nitrogen and water.  The NOx in the flue gas reacts with ammonia in the SCR catalyst.  The elemental nitrogen and water remain in the flue gas as it passes through the stack to the atmosphere.  The SCR reactors are designed to reduce NOx by approximately 90 percent when firing natural gas in the boiler, and by approximately 85 percent if No. 6 fuel oil is used in the boiler.  \n\n2.  Aqueous ammonia containing 29.4 percent by weight ammonia is a regulated substance under both CalARP and the federal program because the maximum quantity in a process or storage container (21,122 gallons = 158,350 pounds of solution or 46,555 pounds of ammonia) exceeds the state and federal threshold quantities of 500 and 20,000 pounds, respectively.\n\n3.  The current maximum quantity of stored aqueous ammonia is 316,700 pounds (21,122 gallons x 2 tanks, set by high level controls).  Room is available for a third identical tank, which did not need to be added when SCR systems were installed on the four generating units.\n\n1.4  HAZARD ASSESSMENT SUMMARY\n\n1.4.1  WORST-CASE RELEASE SUMMARY\n\n1.  Scenario Description: Instantaneous release of the maximum quantity of aqueous ammonia that can be stored in one storage tank (21,122 gallons).  The storage tank has a maximum capacity of 22,500 gallons, but the high level control limits the maximum capacity to 21,122 gallons.  The containment basin and secondary underground containment vault with floating roof serve as passive design features and mitigation measures.  The most conservative meteorological conditions were used: 1.5 m/s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28823,
      "SummaryText": " wind speed, F stability, maximum temperature of 96 degrees Fahrenheit and average relative humidity of 76 percent.\n\n2.  Distance to the toxic endpoint (1) is 1,033 feet.\n\n- The distance to the nearest point on the property boundary on the east side is 1,295 feet, beyond which are roads and public receptors (2).\n\n- This endpoint does reach beyond the property line on the west side, extending into San Diego Bay approximately 500 feet, but does not contain a public receptor.\n\n- Hence \"...the distance to a toxic or flammable endpoint for a worst-case release assessment conducted under Article 4 and Section 2750.3 is less than the distance to any public receptor, as defined in Section 2740.5...\" (2)\n\n- The sufficiently short distance to the toxic endpoint, combined with the accident-free 5-year history, qualifies the SBPP for Cal-ARP Program 1.\n\n1.4.2 Alternative Release Result Summary\n\n1.  Analysis of an alternative release is not necessary because SBPP qualifies for Cal-ARP Program 1.\n\n1.5  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n1.  The SCR and aqueous ammonia systems were designed and constructed in accordance with all applicable federal, state and local regulations including the Uniform Mechanical Code, Uniform Building Code, and the Uniform Fire Code.  These codes serve to reduce the risk within the facility by specifying acceptable design criteria for the aqueous ammonia systems and onsite buildings.  In addition, the facility was designed in accordance with industry standards and with generally accepted engineering practices.  Aqueous ammonia is used instead of anhydrous liquid ammonia to reduce the consequences of a potential release.\n\n2.  The facility has a monthly audit checklist for maintaining and operating the SCR equipment, and uses the \"Operation, Maintenance, and Safety Manual of the Babcock and Wilcox Selective Catalytic Reduction DENOx System and Aqueous Ammonia Storage and Delivery System\" as a basis.\n\n1.5.1 Five"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28823,
      "SummaryText": "-year Accident History\n\n1.  The accident history researched back to the initial SCR installation in 1996 shows that the facility has not had an accidental release or \"near miss\" of aqueous ammonia.\n\n1.5.2  Planned Changes to Improve Safety\n\n1.  A Process Hazard Analysis, Seismic Assessment, and Hazard Assessment (Offsite Consequence Analysis) have been conducted at the SBPP.  These activities produced the measures outlined below to improve safety at the facility.  The following recommendations have been implemented:\n\n- The tank truck operator is informed to shut down the tank truck pumps if the unloading overfills the storage tank and lifts the relief valves.\n\n- The in-service aqueous ammonia pumps are shut down if the tank truck ammonia recirculation line is valved to return to the wrong tank causing the tank relief valves to lift.\n\n- Preventive maintenance periodically exercises the three-way valves on the dual pressure relief valve assemblies.\n\n- Pressure relief valves are maintained by best management practices.\n\n- An additional eye wash/safety shower station was installed on the opposite side of the aqueous ammonia storage tanks from the existing location.\n\n- A sign is posted at the aqueous ammonia storage tank specifying the required personl protection equipment (PPE) for working on the system.\n\n- An Operator Guideline is available that addresses proper PPE for routine maintenance procedures.\n\n- Duke Energy South Bay LLC will continue to work with the Chula Vista Fire Department on additional training and emergency response efforts on an as needed basis.\n\n- Operators are trained annually regarding the emergency response procedure to address an alarm in the control room from the ambient ammonia detector.  An Operator Guideline is available that addresses the emergency response efforts.\n\n- Two points in the transfer line have tubing and valves installed  to allow olfactory detection of ammonia leaks in the secondary transfer piping between the storage facility a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28823,
      "SummaryText": "nd the vaporizers.\n\n- A plug was installed in the floor drain near the vaporizers.  The plug is open only during rain, after it is confirmed that the ammonia system is not leaking.\n\nFootnotes:\n(1)  The toxic endpoint of 0.14 mg/l is equivalent to a concentration of 200 parts per million by volume (ppmv), and the averaging time is 60 minutes, based on the same averaging time being used for Emergency Response Planning Guidelines.\n\n(2)  A public receptor is defined as \"...offsite residences, institutions (e.g. schools, hospitals), industrial, commercial, and office buildings, parks, or recreational areas inhabited or occupied by the public at any time without restriction by the stationary source where members of the public could be exposed to toxic concentrations, radiant heat, or overpressure, as a result of an accidental release.\""
    }
  ]
}