{
  "FacilityID": 28848,
  "FacilityName": "Omnium",
  "FacilityStr1": "1417 Lower Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "St.Joseph",
  "FacilityState": "MO",
  "FacilityZipCode": "64504",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29021",
  "LEPC": "Buchanan County/St.Joseph LEPC",
  "FacilityLatDecDegs": "39.720833",
  "FacilityLongDecDegs": "94.8825",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "LF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Agriliance, L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 102250078,
  "Company2DUNS": 102250078,
  "OperatorName": "Omnium",
  "OperatorStr1": "1417 Lower Lake Road",
  "OperatorStr2": null,
  "OperatorCity": "St.Joseph",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64504",
  "OperatorZipCodeExt": null,
  "FTE": 77,
  "OtherEPAFacilityID": "64504FRMLN1417L",
  "EPAFacilityID": "100000095568",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OP2001-122",
  "SafetyInspectionDate": "1999-07-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Thioherbicide Process",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-08-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-08-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 39.720556,
  "FRS_Long": -94.88222,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41475,
      "AltID": "Thioherbicide Process",
      "FacilityID": 28848,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54609,
          "ProcessID": 41475,
          "ChemicalID": 7,
          "Quantity": 169000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42414,
          "ProcessID": 41475,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23623,
              "Process_NAICS_ID": 42414,
              "SafetyReviewDate": "2003-08-11 00:00:00",
              "PHA_Date": "2003-08-05 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-08-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New Process",
              "OpProceduresReviewDate": "2003-08-11 00:00:00",
              "TrainingReviewDate": "2003-03-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-08-01 00:00:00",
              "EquipmentInspectionDate": "2003-08-12 00:00:00",
              "EquipmentTested": "Piping and tank welds",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-05-06 00:00:00",
              "PreStartupReviewDate": "2003-08-12 00:00:00",
              "ComplianceAuditDate": "2003-08-12 00:00:00",
              "AuditCompletionDate": "2003-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-03-04 00:00:00",
              "HotWorkPermitReviewDate": "2002-07-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34735,
                  "PreventionProgram3ID": 23623,
                  "ProcessChemicalID": 54609
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28848,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-12-12 00:00:00",
    "ERTrainingDate": "2002-09-02 00:00:00",
    "CoordinatingAgencyName": "Buchanan County LEPC",
    "CoordinatingAgencyPhone": "8162711574",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28848,
      "SummaryText": "Omnium\nSt.Joseph, Missouri\n\nThe Omnium Agricultural Chemicals Plant in St.Joseph, Missouri is one of three plants which comprise the Omnium agricultural chemical manufacturing division of Agriliance, LLC.   \nThe St.Joseph Omnium facility is located on approximately 56 acres in the southern industrial area of St.Joseph, MO.  Nearly 20 acres are developed with the remaining area leased to a local farmer for the purpose of growing crops.  The facility formulates and packages crop protection products used to grow crops that provide high-quality, low-cost food for families throughout the world.\nAccidental Release Prevention Policy\nThe management and employees of this facility are committed to the prevention of any accidental releases, especially hazardous materials.  Accidental release prevention is critical to the safe operation of this plant, the safety of its employees and safety of the community.\nTo achieve its accident and accidental release prevention goals, Omnium is committed the following:\n¿\tA knowledgeable, motivated and highly trained employee group\n¿\tA well-designed facility that is maintained and operated in a superior manner\n¿\tImprovements that enhance safety and accident prevention\n¿\tExcellence in safety programs and practices, and an outstanding safety and accident record\n¿\tPreparation and training for emergency response.\nEmergency Response Policy\nOmnium has a written Emergency Response Plan, as required by RMP and other EPA and OSHA rules, and is committed to respond to any accidental release to minimize the impact to employees, the community and the environment.  The response plan is coordinated with the LEPC and emergency response agencies.  Omnium personnel have interacted with these agencies for many years regarding the plan and activities at the facility.  In addition, employees are trained in the implementation of the plan and possible response activities that could be required in the event of an emergency.\nRegulated Substances Handled\nMethyl Merca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28848,
      "SummaryText": "ptan is the only toxic substance, regulated by EPA¿s RMP rule, that is stored and used at the Omnium facility.  \nThis gas is liquefied under pressure and stored in two tanks designed for this purpose.  \nThis liquefied gas under pressure (bp = 44°F (6.8°C) at atmospheric pressure) is colorless with a garlic like odor. If physical contact occurs, the skin or eyes may become irritated. Breathing of vapors may cause desensitization of the nose, depending on concentration and duration, increased respiration, convulsions, muscle paralysis and death.\nMethyl Mercaptan is highly flammable, having a flash point <-2°F (-17°C). Methyl Mercaptan reacts with carbon steel or iron in the absence of oxygen to form ferrous sulfide. Ferrous sulfide, when exposed to air, will oxidize and generate enough heat to ignite any Mercaptan vapors present as well as other flammable vapors. \n\nSynopsis of Worst-Case and Alternative Release Scenarios\nThe EPA has defined a worst-case scenario as the release of the largest quantity of a listed chemical from a vessel or process line failure without taking into account active mitigation controls.  The release distance is determined using EPA defined atmospheric conditions and is intended to provide an estimate of the maximum possible area that might be affected.  According to EPA, the worst-case scenario is intended to ensure that no potential risks to the public health are overlooked, but the distance to an endpoint estimated under worst-case should not be considered a ¿public danger zone.¿  Possible causes of the extreme improbability that such releases may occur are not considered.\nOmnium¿s hypothetical worst-case scenario regarding a toxic substance involves a 162,450 pound Methyl Mercaptan release from a delivery railcar.  The worst-case assumes, as required by RMP, that the entire contents of the vessel are released over a period of 10 minutes as a result of a catastrophic failure.  This worst-case scenario has off-site impacts.\nThe alternative"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28848,
      "SummaryText": "release scenario definition is a release that is more likely to occur than the worst-case release: however, as with the worst-case, the alternative release improbability is not taken into consideration.\nIn the facility¿s hypothetical alternative release scenario regarding a toxic substance, a 1,456 pound release of Methyl Mercaptan occurs due to a failed flange gasket on the transfer system from the Methyl Mercaptan storage tank to the batch tank in the process area.  In this scenario, it is assumed that the release occurs over a period of 4 minutes, at which time human intervention stops the release.  This alternative release scenario has off-site impacts.\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\nOmnium is subject to the OSHA Process Safety Management (PSM) rule, 29 CFR 1910.119.  Elements of the PSM rule are included in the Program 3 Prevention Program under EPA¿s RMP rule.\nThe OSHA PSM/EPA Prevention Program consists of a set of facility management policies and procedures that promote and recognize process safety and the prevention of accidents in plants that handle, use, store, or process hazardous chemicals.  The procedures provide accident prevention process controls to all aspects of facility operations.\nOmnium adheres to the requirements of PSM and has written policies and procedures addressing all aspects of PSM and EPA Prevention Program requirements.  The facility has addressed the elements of accident prevention included in the programs throughout its years of operation.\nDue to the variety of substances Omnium handles in the normal course of doing business, several separate spill prevention programs and operating procedures are in place as an effort to reduce the risk or consequence of an accidental release.  A section in the plant¿s Emergency Response Manual is devoted to general chemical spill prevention while a separate program is in effect for preventing spills of petroleum products.\nThe system which is designed an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28848,
      "SummaryText": "d built to safety handle Methyl Mercaptan is: constructed according to the following specifications, equipped with the following appurtenances, and operated using the following procedures.  The purpose of these systems and procedures, as well as others not listed, is to greatly reduce or eliminate the potential for Methyl Mercaptan releases to occur.  For the purposes of this summary, some of the more prominent are listed below.\n¿\tThe storage tank has been designed and tested for  pressures from 125 psi to full vacuum at -25°F to 120°F.  \n¿\t316L Stainless Steel is used as the material of construction for all storage and transfer components and is suitable for Methyl Mercaptan.\n¿\tConstruction in accordance to Section VIII, Division I of ASME Code Part UW (Regulation for Pressure Vessels Fabricated by Welding).  \n¿\tVessel Heads & Seams and pipe welds  are100% X-Ray for defects\n¿\tThe storage tank is supported on substantial metal supports.\n¿\tThe storage vessel and transfer piping into the process are protected from damage by moving vehicles.\n¿\tThe storage vessel is equipped with vapor return lines to the delivery railcar.\n¿\tThe storage vessel is equipped with an electronic liquid level monitoring system with remote indicator in the process control room.\n¿\tLoading and transfer lines are equipped with excess flow valves.\n¿\tA surrounding fence is constructed on the top of the storage vessel containment dike to restrict personnel access.\n¿\tThe flange gasket used at the connection between the plant transfer piping and the delivery railcar is discarded after each use and a new gasket used for each transfer.\n¿\tA safety showers and eye washes are readily available\n¿\tSCBA¿s with full face masks are readily available and are mandatory when connecting or disconnecting from delivery railcars.\n¿\tProcedures for all events involving the movement and use of Methyl Mercaptan are written and approved before Methyl Mercaptan is allowed on site.\n¿\tOperators are trained in proper operation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28848,
      "SummaryText": "of the Methyl Mercaptan transfer system between delivering railcars and the storage tank before participating in any way.\nFive Year Accident History\nThe RMP rule requires inclusion of the facility¿s five-year accident history for all accidental releases of regulated substances that resulted in deaths, injuries, or significant proper or environmental damage on of off site.\nThere have been no RMP reportable releases or accidents of regulated substances.\nEmergency Response Program\nOmnium¿s emergency response plan is designed to prevent individual injuries, damage to the environment, and damage to property, both on site and off site.  The plan is also to be used as a guide in coordinating activites with police and fire departments, hospitals, contractors, and state and local response teams.  As part of this summary, a general overview of Omnium¿s Emergency Response Plan (the Plan) follows.\nThe plan consists of 12 sections: table of contents, several lists of relevant telephone numbers, specific guidelines and procedures regarding fire, human rescue, spill or release, sever weather, evacuation, flood, and off-site assistance.  There are also separate sections covering emergency first aid, training requirements, facility maps, and management procedures.\nAll emergency response team members receive training in accordance with 29 CFR 1910.120.  There are also specific training requirements for the primary and alternative emergency coordinators.  Refresher training is provided for all ER team members on an annual basis."
    }
  ]
}