{
  "FacilityID": 28889,
  "FacilityName": "Mahoning Valley Sanitary District",
  "FacilityStr1": "1181 Ohltown-McDonald Road",
  "FacilityStr2": null,
  "FacilityCity": "Mineral Ridge",
  "FacilityState": "OH",
  "FacilityZipCode": "44440",
  "Facility4DigitZipExt": "0124",
  "FacilityCountyFIPS": "39155",
  "LEPC": "Trumbull County LEPC",
  "FacilityLatDecDegs": "41.154889",
  "FacilityLongDecDegs": "-80.776444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mahoning Valley Sanitary District",
  "OperatorStr1": "1181 Ohltown-McDonald Road",
  "OperatorStr2": null,
  "OperatorCity": "Mineral Ridge",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44440",
  "OperatorZipCodeExt": "0124",
  "RMPContact": "David G. Tabak, P.E.",
  "RMPTitle": "Chief Engineer",
  "FTE": 44,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028579",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-01-02 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Disinfection Process",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-08-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-08-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-08-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 41.15035,
  "FRS_Long": -80.77573,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41520,
      "AltID": null,
      "FacilityID": 28889,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42459,
          "ProcessID": 41520,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54675,
          "ProcessID": 41520,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 54676,
          "ProcessID": 41520,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554675,
          "ProcessID": 41520,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554676,
          "ProcessID": 41520,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28889,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n\n\nThe Mahoning Valley Sanitary District (MVSD) owns and operates a Water Treatment Plant \n\n(WTP) which produces potable water from the Meander Creek Reservoir. MVSD furnishes \n\npotable water to the Cities of Youngstown, Niles, and it acts as an agent for these cities in \n\nsupplying the Village of McDonald. These cities then supply water to the surrounding \n\nmetropolitan areas including Girard, Canfield, Mineral Ridge, and portions of eight townships.  \n\nMVSD presently serves 300,000 people and produces an average flow of 30 million gallons per \n\nday.\n\n\n\nAmmonia (anhydrous) and Chlorine are two of the various chemicals used in the treatment \n\nprocess to produce water that is safe to drink.  Ammonia reacts with free chlorine to form \n\nchloramines, which destroy pathogenic organisms. Chloramines also prevent the formation of the \n\nTotal Trihalomethanes (TTHMs), health concerns, which are formed when free Chlorine reacts \n\nwith organic material in the water.  Ammonia (Anhydrous) and Chlorine are both listed under 40 \n\nCode of Federal Regulations (CFR) Part 9 as a regulated toxic substance and their threshold \n\nquantities for accidental release prevention are 10,000 lbs and 2,500 lbs, respectively. Since the \n\nquantities of Ammonia  (anhydrous) (10,400 lbs) and Chlorine (48,000 lbs) stored at the WTP \n\nare greater than the threshold values, MVSD must comply with 40 CFR Part 68 which requires \n\nthe development and implementation of a risk management program. \n\n\n\nChlorine and Ammonia (anhydrous) are toxic when inhaled or ingested. MVSD is aware of the \n\ndire consequences that exposure to these chemicals, even in the smallest amount, can have on the \n\nenvironment, the public, and our employees.  MVSD is committed to handling Chlorine and \n\nAmmonia (anhydrous), and all other chemicals in the safest manner possible. The philosophy \n\nand objectives behind this commitment are:\n\n\n\n1. The safety and health of all District employees is a prime priority.\n\n\n\n2. T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28889,
      "SummaryText": "he only acceptable level of safety and health performance is one that prevents injury and \n\naccidents.\n\n\n\n3. Safety and health are an integral part of the daily business functions. \n\n\n\n4. Safety and health are a responsibility that must be shared equally and without exception \n\nby everyone in the organization, and; \n\n\n\n5. Management and those with supervisory responsibilities will be held accountable for the \n\nsafety and health of the personnel for whom they are responsible. All employees will be \n\nrequired to make their safety and the safety of their fellow workers a prime     priority.\n\n\n\nIn modeling the worst case toxic release scenario for Chlorine and Ammonia (anhydrous), EPA's \n\nOCA Guidance Reference Tables were used to determine the distance to the toxic endpoints \n\nwhich were 3.0 and 1.2 miles, respectively. The topography category selected was rural because \n\nthere are relatively few obstacles immediately surrounding the WTP and the actual topography is \n\nflat. No administrative controls are in place to limit the maximum quantity of chemical present, \n\nand the building was not considered as passive mitigation in the scenarios because both \n\nchemicals are handled outdoors. However, MVSD is committed to the safe storage, use, and \n\nhandling of Chlorine and Ammonia (anhydrous), especially during the transfer of these \n\nchemicals, to minimize the potential for accidental release to the environment.  The public \n\nreceptors impacted common to both chemicals were schools, residences, recreation areas, and \n\nmajor commercial, office, or industrial areas. Chlorine also impacts a nursing home. Ammonia \n\n(anhydrous) does not impact any environmental receptors, but Chlorine impacts a bald eagle \n\nnesting area.  \n\n  \n\nIn modeling the alternative case toxic release scenario for Chlorine and Ammonia (anhydrous), \n\nEPA's OCA Guidance Reference Tables were used to determine the distance to the toxic \n\nendpoint which were 0.3 and 0.2 miles respectively.  As in the worst case t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28889,
      "SummaryText": "oxic release scenario, \n\nthe topography category selected was rural. A conservative approach in modeling the alternative \n\ncase release scenario was chosen. The building was considered as passive mitigation in the \n\nscenarios, while the scrubbers were not considered. The building mitigation factor significantly \n\nreduces the release rate from the buildings. With scrubbers the amount of material released to the \n\nenvironment would be low. The only public receptors impacted by either chemical would be a \n\nwastewater treatment plant and no environmental receptors would be impacted.\n\n \n\nThe general accidental release prevention program consists of MVSD's and its employees \n\ncommitment to the safe handling, storage and use of Chlorine and Ammonia (anhydrous).  \n\n \n\nMVSD's WTP is included in Trumbull County's Emergency Response Plan, and MVSD's \n\nEmergency Action Plan contains the appropriate mechanism to notify emergency responders \n\nwhen there is a need for a response. \n\n\n\nThere were no accidents in the past five years, and no changes to the safety program are planned. \n\n \n\n"
    }
  ]
}