{
  "FacilityID": 28904,
  "FacilityName": "R. B. Sandrini",
  "FacilityStr1": "11009 Highway 43",
  "FacilityStr2": null,
  "FacilityCity": "Delano",
  "FacilityState": "CA",
  "FacilityZipCode": "93215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.756389",
  "FacilityLongDecDegs": "-119.343611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Richard Sandrini",
  "OperatorStr1": "10889 Casey Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169747",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-09-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-08-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2005-05-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 35.755056,
  "FRS_Long": -119.343047,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41554,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 28904,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 54723,
          "ProcessID": 41554,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42495,
          "ProcessID": 41554,
          "NAICSCode": "111332",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23680,
              "Process_NAICS_ID": 42495,
              "SafetyReviewDate": "2000-06-01 00:00:00",
              "PHA_Date": "2000-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2000-07-01 00:00:00",
              "TrainingReviewDate": "2000-07-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-07-01 00:00:00",
              "EquipmentInspectionDate": "2003-07-01 00:00:00",
              "EquipmentTested": "Compressor Startup Inspection",
              "ChangeMgmtDate": "2003-08-19 00:00:00",
              "ChangeMgmtReviewDate": "2000-07-01 00:00:00",
              "PreStartupReviewDate": "2003-08-19 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-07-01 00:00:00",
              "HotWorkPermitReviewDate": "2000-07-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2000-07-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 34821,
                  "PreventionProgram3ID": 23680,
                  "ProcessChemicalID": 54723
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 28904,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-06-01 00:00:00",
    "ERTrainingDate": "2000-06-01 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28904,
      "SummaryText": "Risk & Process Safety Management Program\n\nPreface - Executive Summary\n\nfor\n\nR. B. Sandrini\n11009 Highway 43\nDelano, California 93215\n(661) 725-2281\nFAX (661) 725-2287\n\nEPA Facility ID#: 1000 0016 9747\n\nAugust 14, 2003\n\nPrepared by:\n\nCalifornia Controlled Atmosphere\n39138 Road 56\nDinuba, CA  93618\n559-591-8874\nwww.calca.com\n \nTable of Contents for Preface - Executive Summary\n\n1. THE  R.B. SANDRINI, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\n2. DESCRIPTION OF AMMONIA SYSTEM\n3. AMMONIA RELEASE SCENARIOS\n3.1 WORST CASE SCENARIO\n3.2 ALTERNATIVE CASE SCENARIO\n4. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\n5. FIVE YEAR ACCIDENT HISTORY\n6. EMERGENCY ACTION PLAN\n7. PLANNED CHANGES TO IMPROVE SAFETY\n \nLiving Document Approach To Regulatory Compliance\n\nThis program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5 and the California Process Safety Management Program, CCR Title 8, Section 5189 as enforced by the local Certified Unified Program Agency and the Fed/EPA.  \n\nThis program is intended to be a living document.  As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible. To accomplish this elements have been organized in a way that is consistent with the corporate organization, how frequently different elements are accessed, and who needs to refer to the program.  The order of elements within this organization is not the same as they are listed in the regulations, and in some cases portions of elements may be found in more than one location.  Therefore, for the purposes of auditing and regulatory review the following table is provided to provide concordant information regarding the program and the required regulatory elements. \n\n1. THE  R.B. SANDRINI, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees, that R.B. Sandrini has prepared a unified Risk & Proc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28904,
      "SummaryText": "ess Safety Management Program.  The program is in compliance with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68), and California OSHA's Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials, and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system. \n\nOur program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety.  We have: (1) prepared a unified program based on the PSM plan to meet CalARP obligations as well; (2) reorganized the program so that it meshes more closely with general R.B. Sandrini business practices; and (3) reviewed plan documentation forms and responsibilities.  The unified Risk & Process Safety Management Plan sets forth rules, procedures and practices which will help our employees protect themselves and our neighbors.\n\n2. DESCRIPTION OF AMMONIA SYSTEM\nR. B. Sandrini operates a commercial cold storage for table grapes.  Our facility has two ammonia systems (North & South) with a combined charge of 32,000 lbs.  The systems are completely separate from one another but are closed enough in proximity that they are being considered as a single process.  The north system provides ref"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28904,
      "SummaryText": "rigerating capacity to two cold storage rooms equipped with forced air cooling and three cold storage rooms for palleted product.  The south system provides refrigerating capacity to one cold storage room equipped with forced air cooling, four cold storage rooms for palleted product, one hallway and a shipping area.\n\nThe systems operate as follows.  High pressure liquid from our main receiver is piped to each cold room, where it passes through an expansion valve into low temperature & pressure accumulator vessels.  From the accumulators, cold liquid ammonia is circulated through evaporator coils.  As heat is absorbed, the liquid ammonia vaporizes to form low temperature & pressure gas which is returned to the accumulator vessel.  The ammonia vapor is returned from the accumulator vessels through a suction return line to our engine room, where it passes through a compressor.  The high pressure discharge from the compressor is sent to a water cooled condenser where the high pressure gas ammonia is cooled, liquified and returned to our receiver. \n\nThe facility was built by professional refrigeration engineers in accordance with standard design, and installation of ammonia mechanical refrigerating systems.  It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to a water diffusion tank or the atmosphere if the pressure in the system exceeds their set point.  In addition, ammonia detectors are located in selected areas of the facility, and will shut down equipment if ammonia is detected.  Lastly, an emergency dump box contains switches and valves to turn off equipment and vent ammonia if necessary.\n\nThe ammonia system at our facility consists of vessels which are interconnected, or which ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 28904,
      "SummaryText": "e co-located such that a release of ammonia could impact the ability to operate vessels which are not directly connected.  Therefore, we are treating our facility as a single process.\n\n3. AMMONIA RELEASE SCENARIOS\n3.1 Worst Case Scenario\nOur worst case scenario is the failure of our north system high pressure receiver located outside the mechanical room which can contain 12,100 lbs of ammonia.  Following the instructions set forth in EPA's Risk Management Program Guidance for Ammonia Refrigeration (40 CFR Part 68), we considered the failure of one vessel.  We did not include any liquid ammonia in the piping connected to the failed vessel.  This vessel is located outside, and therefore the release would not be passively mitigated.  The ammonia would be released over a ten minute period.  Using the program RMP*Comp we estimate that the ammonia would travel 1.8 miles (rural conditions) before dispersing enough to no longer pose a hazard to the public.  A map showing the area that would be affected is attached.\n\nIn our opinion, it is extremely unlikely that the worst-case scenario will ever take place.  Our receiver meets industry standards for manufacture and quality control of pressure vessels; ammonia is not corrosive in this service; pressure safety relief valves limit the operating pressure in this vessel; and our operators are trained in the safe operation of our system.\n\n3.2 Alternative Case Scenario\nOur alternative release scenario is as follows.  We assumed that a Safety Relief Valve on the north system lifts, releasing ammonia vapor to the atmosphere.  The largest of the SRV's on the system are those protecting the high pressure receiver which have an ammonia release rate of 57.6 lbs/min.  We assumed the release would continue for 10 minutes until the overpressure condition was remedied. Under this scenario 576 lbs of ammonia would be released over a time period of 10 minutes.  The release would not be passively mitigated being outdoors.  Using RMP*Comp we e"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 28904,
      "SummaryText": "stimate that the ammonia would travel less than 0.2 miles (rural conditions) before dispersing enough to no longer pose a hazard to the public. A map showing the area that would be affected is attached.\n\n4. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration system at R. B. Sandrini is an integral part of the overall business. The system contains a total charge of approximately 32,000 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.\n\nThe ammonia refrigeration system/process is constantly being monitored by our refrigeration operator.  In addition, the system/process is checked frequently by our outside refrigeration contractor who also performs an annual pre-season preventative maintenance review of our system/process equipment.  Half of our system is controlled by a computer, which monitors many process variables, and allows remote control.  In the event of a system upset the computer actuates a dialing program that alerts key personnel and responders.  We have ammonia detectors which also trigger alerts. \n\nWe inform our employees of the dangers of an accidental release of ammonia through monthly safety meetings.  During these meetings we also discuss the preventative measures to take, such as evacuation, in order to not be affected by a release.\n\nOur ammonia refrigeration system was designed and built by professional refrigeration engineers in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.  It was also built in compliance with the Uniform Building Code and Uniform Mechanical Code applicable at the time of construction.\n\nOur ammonia refrigeration system is equipped with safety relief valves, which in the south system are piped to a water diffusion tank and in the north system are vented"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 28904,
      "SummaryText": "to the atmosphere.  These valves limit the operating pressures of the entire system, and prevent failures due to over-pressurization.  All ammonia released through the safety relief valves in the south system is trapped in the water, and is not emitted into the air.  All ammonia released through the safety relief valves in the north system is emitted into the air.\n\n5. FIVE YEAR ACCIDENT HISTORY\nR.B. Sandrini has not had any reportable accidents within the last five years.\n\n6. EMERGENCY ACTION PLAN\nThis facility's emergency response program is based on the Cal/OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, Emergency Action Plans.  Federally, Title 29 CFR 1910.38 and 1910.119), HAZWOPER (standard (in California CCR Title 8, Section 5192, Hazardous Waste Operations and Emergency Response, and Title 29 CFR 1910.120). \n\nStrategically, we will respond minimally to a release.  Under this plan we will call emergency personel and evacuate the facility.   All response activities would be done by the local fire department and the Kern County Fire Department Hazardous Materials Response Team.\n\nEvery year at the beginning of the season we review with our employees our evacuation procedures in the event of an emergency, including an ammonia release. \n\n7. PLANNED CHANGES TO IMPROVE SAFETY\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and public safety.  Nevertheless, R.B. Sandrini continually strives to improve in all areas, including safety.  Preparation of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\n\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with R.B. Sandrini business practices rather than the order presented in the law.  Thus, Safe O"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 28904,
      "SummaryText": "perating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.  \n\nThe Risk & Process Safety Management Program documentation forms and company policy forms pertaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Our operator assisted in the writing of Standard Operating Procedures, and they are presented in a format that is easy to use.  \n\nFor the future, R.B. Sandrini now thinks of the Risk & Process Safety Management Program as a living document.  It is an interactive framework that guides safe action for R.B. Sandrini employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program R.B. Sandrini will continue to profit while maintaining overall plant, worker and public safety."
    }
  ]
}