{
  "FacilityID": 28929,
  "FacilityName": "The Wine Group d.b.a Franzia, McFarland",
  "FacilityStr1": "31795 WHISLER ROAD",
  "FacilityStr2": null,
  "FacilityCity": "MCFARLAND",
  "FacilityState": "CA",
  "FacilityZipCode": "93250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.645889",
  "FacilityLongDecDegs": "-119.217778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Wine Group",
  "Company2Name": null,
  "CompanyDUNS": 64307671,
  "Company2DUNS": 0,
  "OperatorName": "The Wine Group",
  "OperatorStr1": "31795 WHISLER ROAD",
  "OperatorStr2": null,
  "OperatorCity": "MCFARLAND",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93250",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Merz",
  "RMPTitle": "Plant Manager/ Sr. Winemaker",
  "FTE": 19,
  "OtherEPAFacilityID": "CAL000195049",
  "EPAFacilityID": "100000130066",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-09-04 00:00:00",
  "SafetyInspectionBy": "KERN COUNTY FIRE DEPARTMENT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-09-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-09-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-01-29 00:00:00",
  "DeRegistrationEffectiveDate": "2020-12-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 35.64589,
  "FRS_Long": -119.21778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41580,
      "AltID": "refrigeration",
      "FacilityID": 28929,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42522,
          "ProcessID": 41580,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54756,
          "ProcessID": 41580,
          "ChemicalID": 56,
          "Quantity": 20538.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554756,
          "ProcessID": 41580,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 41581,
      "AltID": "ingredient-antioxident",
      "FacilityID": 28929,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 42523,
          "ProcessID": 41581,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 54757,
          "ProcessID": 41581,
          "ChemicalID": 49,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 554757,
          "ProcessID": 41581,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 28929,
      "SummaryText": "The Wine Group d.b.a. Franzia, McFarland's Risk Management Plan details the chain of command and the authority of the individual assigned to manage the RMP.\n\nThe accidental release prevention measures and emergency response policies are based on knowledge of the systems and training on how to prevent releases and control (minimize) releases should they occur. Accidental release prevention is accomplished by routine inspection of the integrity of the process systems, reporting of any detected odors immediately to management and to maintain daily operating logs on system temperatures and pressures.  Disaster training on the ammonia refrigeration system will be scheduled prior to our peak season (August thru November) for all maintenance and cellar employees so that any release will be minimized by understanding controls on and knowledge of the system.\n\nThe two regulated substances handled by Franzia, McFarland are anhydrous liquid ammonia and sulfur dioxide.  Anhydrous liquid ammonia is used in the plant refrigeration systems and is stored in two seperate ammonia receivers and the piping used to move the ammonia from compressor to heat exchanger and back to the receiver.  The sulfur dioxide is used as a wine/juice antioxidant and preservative.  It is delivered to the facility in portable, one ton cylinders.  Sulfur dioxide is added to wine/juice through the use of portable addition cylinders.\n\nIn the case of liquid anhydrous ammonia, a worst case and three (3) alternate accidental release scenarios were evaluated.  The worst case scenario modeled a catastrophic tank failure of our largest ammonia receiver.  Although the ammonia would actually pool under that condition, the worst case model reflects the release entirely as a gas loss over a 10-minute period.  The three (3) other alternative ammonia release scenarios reflect a tank failure leading to a liquid pool, a pressure relief valve failure (40 minutes) and a failure of a compressor seal (60 minutes).  Administrat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 28929,
      "SummaryText": "ive controls for the ammonia system outlined in the RMP include process safety logs, periodic visual and sensory inspections and disaster preparedness training.  Active mitigation procedures in the RMP include water sprinkling of the ammonia vapor cloud and written emergency shut down procedures.\n\nIn the case of sulfur dioxide, a worst case release and two (2) alternated scenarios were analyzed.  The worst case scenario modeled a catastrophic one ton cylinder failure and subsequent 10-minute release of the gas vapor.  The alternative scenarios include a tank rupture leading to a liquid pool formation and the failure of the tank pressure relief valve.  Administrative controls for sulfur dioxide in our RMP include visual and sensory inspection and disaster preparedness.  Additionally, the amount of sulfur dioxide used and stored at any one point in time has been substantially reduced from the previous facility owners.  Active mitigation of a sulfur dioxide vapor release would be controlled with the use of a water sprinkling system.\n\nFor both regulated substances, the worst case release scenarios reported were modeled using the EPA RMP Comp model:  all of the release scenarios were modeled using both the EPA approved DEGADIS model as well as the RMP Comp model.\n\nThe McFarland facility has had no accidents involving regulated substances in the last five (5) years.\n\nFranzia McFarland's emergency response program includes detailed procedures for responding to an injured employee, evacuation procedures and emergency notification control phone numbers.  Detailed first aid procedures for responding to ammonia and sulfur dioxide injuries are also included in the plan.  Other components of Franzia's emergency response plan include emergency utility shut off procedures,  training and maintenance of personal protective equipment and coordination with the local fire department hazardous materials response team.  Additionally, all full time employees are trained annually and fit t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 28929,
      "SummaryText": "ested on full-face respirators and self-contained breathing apparatus.  Emergency response safety equipment such as respirators, SCBA units and safety showers are checked monthly during documented safety walks.  Safety equipment such as oxygen meters and SCBA units are calibrated and certified in accordance with current regulations.\n\nIn early Spring, 2002 a Self-Audit was conducted a the facility.  In addition, changes have been made to improve safety at Franzia McFarland.  These include refrigeration system disaster training by RETA certified instructors on procedures to prevent or minimize accidental ammonia releases and improve the employees' understanding of ammonia refrigeration systems and sulfur dioxide usage/ equipment.  Franzia, McFarland will continue to work closely with the local emergency responders to help them understand the nature and location of potential hazards in the facility."
    }
  ]
}