{
  "FacilityID": 29096,
  "FacilityName": "RMCSD Wastewater Reclamation Facility",
  "FacilityStr1": "15160 Jackson Rd",
  "FacilityStr2": null,
  "FacilityCity": "Rancho Murieta",
  "FacilityState": "CA",
  "FacilityZipCode": "95683",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.485417",
  "FacilityLongDecDegs": "-121.083111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Rancho Murieta CSD",
  "OperatorStr1": "P O Box 1050",
  "OperatorStr2": null,
  "OperatorCity": "Rancho Murieta",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95683",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106985",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "Sacramento County HMD",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-11-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-11-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-10-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2025-02-26 00:00:00",
  "DeRegistrationEffectiveDate": "2024-12-31 00:00:00",
  "AnniversaryDate": "2008-10-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 38.485417,
  "FRS_Long": -121.083111,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 41985,
      "AltID": "Disinfection",
      "FacilityID": 29096,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55257,
          "ProcessID": 41985,
          "ChemicalID": 62,
          "Quantity": 8300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 42934,
          "ProcessID": 41985,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 23990,
              "Process_NAICS_ID": 42934,
              "SafetyReviewDate": "2001-08-09 00:00:00",
              "PHA_Date": "2001-08-09 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Chlorine delivery",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-07-01 00:00:00",
              "TrainingReviewDate": "2002-07-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-07-01 00:00:00",
              "EquipmentInspectionDate": "2002-01-08 00:00:00",
              "EquipmentTested": "Chlorine vacuum regulators and feeders",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-10-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-12-06 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-10-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1998-10-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35221,
                  "PreventionProgram3ID": 23990,
                  "ProcessChemicalID": 55257
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29096,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-02-01 00:00:00",
    "ERTrainingDate": "2002-06-01 00:00:00",
    "CoordinatingAgencyName": "Sac. County HMD",
    "CoordinatingAgencyPhone": "9163686160",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Cal/OSHA GISO Secs 3220, 5144, 5189, 5192, 5194",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29096,
      "SummaryText": "Rancho Murieta Community Services District has instituted a Risk Management Program for their wastewater treatment facility, RMCSD Water Reclamation Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) is being filed as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nRancho Murieta Community Services District provides water supply and distribution, and wastewater collection and reclamation services to the community of Rancho Murieta.  Its wastewater treatment facility, RMCSD Water Reclamation Plant, is located at 15160 Jackson Rd., Rancho Murieta, CA in Sacramento County, and uses chlorine, a RS, for disinfection in quantities greater than the Federal threshold quantity for this RS.  The facility is located in a semi-rural area across Highway 16 from the Rancho Murieta golf course.  There are 7 full-time employees at this site.  Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container scales inside the building.  The chlorine is used for odor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29096,
      "SummaryText": "control of the influent wastewater, to disinfect the reclaimed wastewater, and for other process uses.  Pressurized chlorine gas within a ton container is reduced to vacuum at a vacuum regulator valve mounted directly onto the ton container's gas valve.  From there, the chlorine under vacuum is metered through rate valves and rotameters in chlorinators located in a separate room, and drawn into water solution by the passage of pressurized water through an injector.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of Rancho Murieta Community Services District that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, Rancho Murieta Community Services District has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\nWORST CASE RELEASE SCENARIO\n\nA single \"worst case\" release scenario is required to be considered for each stationary source, resulting in the maximum distance to an endpoint for all toxic RS's contained on site above the threshold quantity.\nThe worst case release scenario for toxic chemicals is defined in the ARP regulations as the release of the contents of the largest single container of RS (in this case chlorine) over a period of 10 minutes. The scenario considered the release of the contents of the largest container of chlori"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29096,
      "SummaryText": "ne on site, in this case 2,000 lb.  This release scenario is not physically possible, due to the characteristics of chlorine.\n\nALTERNATIVE CASE RELEASE SCENARIO\n\nAn \"alternative case\" release scenario is required to be considered for each toxic RS handled in quantities greater than the threshold quantity at the site.\nThe \"alternative case\" scenario is described in the ARP regulations as a likely release resulting in offsite effects, considering administrative controls and mitigation measures in place, and is to be determined by the facility operators as part of the Process Hazard Analysis required to be performed during RMP development.  The \"alternative case\" considered for this facility is the release of 2 pounds of chlorine gas from a ton container due to an operator error duriing hookup, with the release secured by the operator after 1 minute.\n\nADMINISTRATIVE CONTROLS\n\nAdministrative controls in effect at Rancho Murieta Community Services District which were considered to mitigate the severity of the Worst Case and Alternative Case release scenarios include Rancho Murieta Community Services District's written policies and procedures for training of operators and maintenance personnel, written procedures for control of the inventory of chlorine at the facility, and policies regarding quality level of replacement materials and components for the chlorine system.\n\nMITIGATION MEASURES\n\nNo mitigation measures were considered to limit the severity of the Worst Case scenario.  No passive mitigation measures were considered to limit the severity of the Alternative Case scenario.  Active mitigation was considered for the Alternative Case, in the form of the timely response of an operator following written procedures.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by Rancho Murieta Community Services District are categorized as administrative (management) programs; procedures, training, and engineering controls;"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29096,
      "SummaryText": "and emergency response programs.\n\nRancho Murieta Community Services District has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 covering its disinfection process.  This constitutes the general accidental release prevention program for Rancho Murieta Community Services District's operations. The program and document management procedures included in the PSM Program will be used as the management system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, creation of numerous facility-specific operation procedures with check boxes for completion of critical steps.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nRancho Murieta Community Services District's Emergency Response Program applicable to chlorine has been coordinated with Sacramento County Environmental Management Department, Hazardous Materials Division, the local agency responsible for hazardous materials inventory reporting and release response coordination.  Rancho Murieta Community Services District maintains First Responder capability with respect to chlorine releases.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which Rancho Murieta Community Services District committed to accomplish have been completed or are in progress.  Planned changes include installing an emergency alarm button.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}