{
  "FacilityID": 29177,
  "FacilityName": "OMNOVA Solutions Inc - Green Bay Facility",
  "FacilityStr1": "1701 Cornell Road",
  "FacilityStr2": null,
  "FacilityCity": "Green Bay",
  "FacilityState": "WI",
  "FacilityZipCode": "54313",
  "Facility4DigitZipExt": "8934",
  "FacilityCountyFIPS": "55009",
  "LEPC": "Brown County LEPC",
  "FacilityLatDecDegs": "44.590556",
  "FacilityLongDecDegs": "-88.070556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "www.omnova.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "OMNOVA Solutions Inc.",
  "Company2Name": null,
  "CompanyDUNS": 88498618,
  "Company2DUNS": 88498618,
  "OperatorName": "OMNOVA Solutions Inc",
  "OperatorStr1": "175 Ghent Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairlawn",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44333",
  "OperatorZipCodeExt": "3300",
  "FTE": 58,
  "OtherEPAFacilityID": "54313GNCRP1701",
  "EPAFacilityID": "100000095121",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-09-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-11-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-11-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-11-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-11-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 44.588889,
  "FRS_Long": -88.072778,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42130,
      "AltID": "Latex Manufacturing",
      "FacilityID": 29177,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55461,
          "ProcessID": 42130,
          "ChemicalID": 120,
          "Quantity": 271000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 55462,
          "ProcessID": 42130,
          "ChemicalID": 25,
          "Quantity": 313000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 55463,
          "ProcessID": 42130,
          "ChemicalID": 57,
          "Quantity": 75000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43079,
          "ProcessID": 42130,
          "NAICSCode": "32521",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24095,
              "Process_NAICS_ID": 43079,
              "SafetyReviewDate": "2003-05-05 00:00:00",
              "PHA_Date": "2002-11-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-10-22 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "detonation arrestors",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Shift safety inspection rounds",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-10-14 00:00:00",
              "TrainingReviewDate": "2003-10-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-03-12 00:00:00",
              "EquipmentInspectionDate": "2003-10-20 00:00:00",
              "EquipmentTested": "Reactor 4, R 416",
              "ChangeMgmtDate": "2003-09-18 00:00:00",
              "ChangeMgmtReviewDate": "2003-06-03 00:00:00",
              "PreStartupReviewDate": "2002-08-13 00:00:00",
              "ComplianceAuditDate": "2003-05-08 00:00:00",
              "AuditCompletionDate": "2004-08-01 00:00:00",
              "IncidentInvestigationDate": "2003-10-20 00:00:00",
              "InvestigationChangeDate": "2003-10-20 00:00:00",
              "ParticipationPlansReviewDate": "2003-04-30 00:00:00",
              "HotWorkPermitReviewDate": "2003-05-09 00:00:00",
              "ContractorSafetyReviewDate": "2003-01-09 00:00:00",
              "ContractorSafetyEvalDate": "2003-04-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35380,
                  "PreventionProgram3ID": 24095,
                  "ProcessChemicalID": 55461
                },
                {
                  "PrimaryKey": 35381,
                  "PreventionProgram3ID": 24095,
                  "ProcessChemicalID": 55462
                },
                {
                  "PrimaryKey": 35382,
                  "PreventionProgram3ID": 24095,
                  "ProcessChemicalID": 55463
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29177,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-05-05 00:00:00",
    "ERTrainingDate": "2003-10-13 00:00:00",
    "CoordinatingAgencyName": "Brown County LEPC",
    "CoordinatingAgencyPhone": "9204484270",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29177,
      "SummaryText": "EXECUTIVE SUMMARY:\n\nThis document was prepared as part of the Risk Management Program (RMP) of the Green Bay Latex Plant, Performance Chemicals Division of Omnova Solutions Inc..  The RMP conforms to the legal requirements established by the U.S. Environmental Protection Agency (EPA).  The purpose of the RMP plan is to:\n\nØ\tDescribe existing safety systems at the Green Bay Plant designed to protect employees, the community, the environment, and plant process.\nØ\tShare information with the community about Green Bay Plant Operations including steps taken to minimize risk from regulated substances.\nØ\tComply with the applicable EPA regulations in 40 CFR Part 68 section 112(r)\n\nThe following executive summary presents an overview of the Green Bay Latex Plant's accident prevention and emergency response programs\n\nOMNOVA SOLUTIONS's COMMITMENT TO SAFETY:\n\nOmnova Solutions and its Green Bay operations are and always have been committed to safe operations as a number one priority since the Company began the early design of the Green Bay Plant in 1991, and startup in 1993.   The commitment begins with qualified people and is reflected in all levels of the operation.  All employees at the Green Bay Plant are given the training, tools, and empowerment to perform their part of the operation in a safe manner.  Strict operational controls are in place to ensure safety from the conceptual stage through product development, manufacturing, and delivery to customers.  Green Bay has a staff of safety and environmental professionals, engineers, and security personnel to assure implementation of an ongoing commitment to, the highest standards of safe process management. This experience and professional competency has resulted in many years of safe operations consistently exceeding industry averages.\n\n.\nDESCRIPTION OF REGULATED PROCESS:\n\nThe Green Bay Latex Plant produces Lattices based on Styrene/Butadiene and Styrene/Butadiene/Acrylonitrile for the papermaking and textile industries.  Fin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29177,
      "SummaryText": "ished products are non-hazardous and are in the form of a waterborne white liquid.  \n\n5-YEAR ACCIDENT HISTORY:\n\nThe EPA regulations require regulated facilities to provide information about all accidents in the last 5 years involving an RMP regulated substance if the accident resulted in  (1) death, injury according to the RMP definition, or significant property damage on site, or, (2) known deaths, injuries, property or environmental damage off site.\n\n\nGreen Bay operations have had no accidents meeting the regulatory definition described above in the last 5 years or since our startup in 1993. \n\n\nHAZARD ASSESSMENTS:\n\nAs part of the EPA regulations, Process Safety Management requirements of the Occupational Safety and Health Administration (OSHA), and the Synthetic Organic Chemical Manufacturers Association (SOCMA) Responsible CareÒ Commitment, the Green Bay facility is required to conduct Hazard Assessments of the regulated process.   EPA regulations specifically require offsite consequence analyses in the form of Worst Case Scenarios and Alternative Release Scenarios for certain regulated substances. \n\nOmnova Solutions is concerned that these Worst Case Scenarios required to be disclosed under the regulations may overstate the risk of a worst-case release.  For example, the EPA published lookup tables do not take any local physical conditions into account.  An alternative to the lookup tables (allowed by the regulation) is to calculate release scenarios upon recognized risk analysis techniques, or models.  Limited consideration of local conditions is used in the models within strict EPA guidelines. Accordingly, Omnova Solutions uses the EPA recognized models in preparing it's release scenarios.   While these models may be more accurate, they  can still result in highly improbable and in some cases physically impossible risk scenarios.  For example, neither lookup tables nor models allow consideration of existing active safety devices such as sprinkler systems, wh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29177,
      "SummaryText": "ich can reduce the severity of an accidental release.   The models also increase the number of specific data points examined and, thus, present the most accurate information possible using all required inputs. \n\n Omnova Solutions has also prepared Alternative Release Scenarios which it believes are more accurate predictions of potential accidental releases from the Green Bay facility.  Alternative Release Scenarios are by definition more likely to occur than Worst Case Scenarios but are still very improbable due to engineering and administrative controls at the Green Bay Plant. \n\nWORST CASE SCENARIOS:\n\nEPA regulations require facilities to develop one Worst Case Scenario to represent all toxic substances and one Worst Case Scenario to represent all flammable substances from a list of regulated materials.  Additional Worst Case Scenarios are required if different public receptors (off site residences, businesses or community buildings within a possible impact radius) could be affected by the release of another regulated material.  Omnova Solutions is not subject to this additional requirement.\n\nWhen examining the following Worst Case and Alternative Release Scenarios, it is important to keep in mind that Omnova Solutions has numerous preventative measures in place at its Green Bay facility to effectively prevent these situations. These measures, most of which were not taken into consideration under the EPA regulations include leak detection systems, continuous monitoring and automated controls, automatic shutdowns, deluge water systems, secondary containment dikes and vaults, and employees specially trained in handling and emergency response methods.\n\nFlammable Materials\nOmnova Solutions's  Green Bay Plant has one regulated flammable substance covered by the regulation - 1,3 Butadiene. The plant's Worst Case Flammable Release Scenario involves the instantaneous loss of the entire content of its largest butadiene storage vessel, complete vaporization of the material,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29177,
      "SummaryText": "and a vapor cloud explosion of the entire content under the worst possible atmospheric conditions. The endpoint of a vapor cloud explosion is defined as the distance at which the overpressure from the blast reaches \n1 PSIG. \n\n.\n\nToxic Materials\nOmnova Solutions's Green Bay plant has two regulated toxic materials on site, 29% Ammonium Hydroxide Solution, and Acrylonitrile.  EPA regulations require one Worst Case Scenario to represent all regulated toxic materials.   \n\nOmnova Solutions's Worst Case Toxic Scenario assumes the release of the entire (10000gallons) of an Ammonium Hydroxide storage tank to the containment dike underneath it.  With the additional assumption that the material stays in the containment area without any mitigation measures to limit the amount that is evaporated to the atmosphere. Again, Omnova Solutions does not think this worst case is likely and may not be possible due to the conservative assumptions required by the regulation.  An array of mitigation techniques are in place to reduce the severity of any potential release.\n\n\nALTERNATIVE RELEASE SCENARIOS:\n\nApplicable EPA regulations also require facilities to submit one alternative release scenario to represent all flammables and one to represent each toxic material. \n\nFlammable Alternative:\nOmnova Solutions's Alternative Release Scenario for flammables is the instantaneous release of fourteen hundred pounds of 1,3 Butadiene as a result of a transfer pipe failure. \n\n\n\n\nToxic Alternatives\nThe Alternative release scenario for 29% Ammonium Hydroxide Solution involves the loss of content from a 4 inch diameter transfer line approximately 400 feet long. \nThe second Alternative Release Scenario involves a spill of about 200 gallons of Acrylonitrile from a failed transfer pipe.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM:\n\nOmnova Solutions began a formal Process Safety Management Program at the Green Bay facility in 1992 before our initial startup as new facility when OSHA promulgated 29 CFR 1910.119."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29177,
      "SummaryText": "Process Safety Management acting in concert with effective engineering design, Employee Safety Programs, Synthetic Organic Chemical Manufacturers Association Responsible CareÒ, EPA¿s RMP, and Emergency Response Programs make up the Green Bay Plant's Accidental Release Prevention Program.  \n\nEMERGENCY RESPONSE PLAN:\n\nOmnova Solutions's overall safety efforts at Green Bay consist of measures to prevent the release of hazardous material, as well as programs to mitigate the effects if a release should occur.   The Green Bay plant has a trained and equipped team of volunteer emergency responders capable of handling most foreseeable emergency situations. Importantly, coordination with local safety forces is a key element of the emergency response planning process.   Specific plans are in place to respond to chemical emergencies within the facility.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nIntrinsic safety is a key element in the design of all process equipment at Omnova Solutions's  Green Bay facility.  All covered process equipment design and modification is subject to formal Hazards Analysis Procedures.  During a hazard analysis, recommendations are made for the improvement of the process. In addition, formal accident and incident investigation procedures are in place so that causes of even the smallest failures are identified and corrected."
    }
  ]
}