{
  "FacilityID": 29222,
  "FacilityName": "El Paso Terminal",
  "FacilityStr1": "4200 J. C. Viramontes",
  "FacilityStr2": null,
  "FacilityCity": "El Paso",
  "FacilityState": "TX",
  "FacilityZipCode": "79938",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48141",
  "LEPC": "El Paso City/County LEPC",
  "FacilityLatDecDegs": "31.825",
  "FacilityLongDecDegs": "-106.258333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 848110701,
  "ParentCompanyName": "Valero GP, LLC  (General Partner)",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Valero Logistics Operations LP",
  "OperatorStr1": "4200 J. C. Viramontes",
  "OperatorStr2": null,
  "OperatorCity": "El Paso",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79938",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164868",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Nov. 2003 submittal",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2003-12-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-12-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2003-12-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-06-14 00:00:00",
  "DeRegistrationEffectiveDate": "2011-06-08 00:00:00",
  "AnniversaryDate": "2008-12-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 31.82371,
  "FRS_Long": -106.258113,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42246,
      "AltID": "Propane terminal",
      "FacilityID": 29222,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 55623,
          "ProcessID": 42246,
          "ChemicalID": 98,
          "Quantity": 4032541.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 55624,
          "ProcessID": 42246,
          "ChemicalID": 155,
          "Quantity": 120068.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 39573,
              "ProcessChemicalID": 55624,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 39574,
              "ProcessChemicalID": 55624,
              "ChemicalID": 118
            }
          ]
        },
        {
          "ProcessChemicalID": 55625,
          "ProcessID": 42246,
          "ChemicalID": 105,
          "Quantity": 16038.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43195,
          "ProcessID": 42246,
          "NAICSCode": "42271",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24172,
              "Process_NAICS_ID": 43195,
              "SafetyReviewDate": "2003-11-14 00:00:00",
              "PHA_Date": "2004-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-11-19 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-11-20 00:00:00",
              "TrainingReviewDate": "2003-11-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-07 00:00:00",
              "EquipmentInspectionDate": "2003-10-15 00:00:00",
              "EquipmentTested": "storage tanks",
              "ChangeMgmtDate": "1999-08-24 00:00:00",
              "ChangeMgmtReviewDate": "2003-10-15 00:00:00",
              "PreStartupReviewDate": "1996-03-31 00:00:00",
              "ComplianceAuditDate": "2003-10-09 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-24 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-06 00:00:00",
              "ContractorSafetyReviewDate": "2003-11-08 00:00:00",
              "ContractorSafetyEvalDate": "2003-10-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35502,
                  "PreventionProgram3ID": 24172,
                  "ProcessChemicalID": 55623
                },
                {
                  "PrimaryKey": 35503,
                  "PreventionProgram3ID": 24172,
                  "ProcessChemicalID": 55624
                },
                {
                  "PrimaryKey": 35504,
                  "PreventionProgram3ID": 24172,
                  "ProcessChemicalID": 55625
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29222,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-10-10 00:00:00",
    "ERTrainingDate": "2003-01-23 00:00:00",
    "CoordinatingAgencyName": "El Paso Fire department",
    "CoordinatingAgencyPhone": "9158587574",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 29222,
      "SummaryText": "rtaken by a team of qualified personnel with expertise in engineering and process operations, and will be revalidated at a regular interval of every five years.  Findings related to the process hazard analysis are being addressed in a timely manner.  \n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, the El Paso Terminal maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed, and is readily accessible to operators involved in the processes.\n\nTraining\n The facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nThe El Paso Terminal carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations.  These personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the El Paso Terminal to manage changes in process chemicals, technology, equipment and procedures. Operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29222,
      "SummaryText": "in established processes are conducted at the El Paso Terminal.   These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Valero Logistics Operations, L.P. - El Paso Terminal conducts audits to determine whether the provisions defined  within the RMP rule are being implemented.  These audits identify corrective actions, which are then resolved in a prompt manner. \n\nIncident Investigation\nThe facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nThe El Paso Terminal believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility¿s implementation of the RMP rule. \n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. The Valero Logistics Operations, L.P. - El Paso Terminal has a strict policy of informing the contractors of known potential hazards related the contractor¿s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a substance occur.\n \nFive-year Accident History\nThe Valero Logistics Operations, L.P. - El Paso Terminal has an excellent record of preventing accidental releases over the last five year"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29222,
      "SummaryText": "s.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\nEmergency Response Plan\nThe El Paso Terminal has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Monthly safety training, operator training and certification are some of the major steps we are taking to improve safety at our facility.  These changes are currently implemented and continuous."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29222,
      "SummaryText": "class involves a catastrophic release from propane storage.  In this scenario, 336,045 lb. of propane is released from one of the storage tanks without consideration for emergency shutdown valves or operator action.  The vessel is assumed to be full, and the entire quantity is released as a vapor.  The vapor then finds an ignition source, with ten percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather conditions, the calculated distance to the 1 psi endpoint will have offsite impacts.\n\nThe alternative release scenario submitted for Program 3 flammable substances involves a release of propane.  The release is assumed to result in a vapor cloud explosion.  The scenario involves the release of 5,125 pounds of propane in ten minutes from a leak in a pipe.  The release is controlled by active mitigation measures that include emergency shut off valves.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure would extend offsite.\n \nGeneral Accidental Release Prevention Program\nThe Valero Logistics Operations, L.P. - El Paso Terminal has taken all the necessary steps to comply with the accidental release prevention requirements defined within 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nThe El Paso Terminal maintains a record of safety information that describes the chemical hazards, operating parameters, equipment design and technology associated with the facility.\n\nProcess Hazard Analysis\nOur facility conducted a comprehensive study to ensure that hazards associated with our facility were identified and controlled effectively.  The methodology used to carry out this analysis was a checklist revalidation process hazard analysis.  The study was unde"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 29222,
      "SummaryText": "Executive Summary   - -   Valero Logistics, L.P.  -  El Paso Terminal\n\nAccidental Release Prevention Policy\nWe at Valero Logistics Operations, L.P. - El Paso Terminal are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\nStationary Source Description\nOur facility¿s primary activities encompass the storage and sale of motor fuel.  We have three regulated substances present at our facility above the threshold quantity: propane, ethyl mercaptan and a flammable mixture.  Propane is transferred through sales at a truck rack, while ethyl mercaptan is used to odorize the propane prior to loading.  The flammable mixture is contained in a tank, which captures the interface product mix during pipeline transfers.\n\nHazard Assessment Results\nTo evaluate the worst case scenario, we have used the EPA's RMP*Comp(TM) software.  For the alternative release scenario, the EPA's RMP Guidance for Propane Storage Facilities Reference Tables were utilized. The following paragraphs provide details of the chosen scenarios.\n\nThe Valero Logistics Operations, L.P. - El Paso Terminal has invested a great deal of time and effort to reduce the potential of any hazardous material release.  These efforts include the stringent design codes that the facility is built to, the routine inspections and monitoring that are performed daily, as well as the periodic inspections and repairs.\n\nThe combination of these systems ensures that small releases will be addressed quickly, and large releases can be effectively mitigated with no impact on the surrounding community.\n\nThe worst case release scenario submitted for Program 3 flammable substances as a"
    }
  ]
}