{
  "FacilityID": 29288,
  "FacilityName": "SAWS Twin Oaks Water Treatment Plant",
  "FacilityStr1": "4588 Hardy Road",
  "FacilityStr2": null,
  "FacilityCity": "Elemendorf",
  "FacilityState": "TX",
  "FacilityZipCode": "78112",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48029",
  "LEPC": "Bexar County LEPC",
  "FacilityLatDecDegs": "29.148056",
  "FacilityLongDecDegs": "-98.395278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PF",
  "FacilityURL": "saws.org",
  "FacilityEmailAddress": "gaguliar@saws.org",
  "FacilityDUNS": 57582603,
  "ParentCompanyName": "San Antonio Water System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "San Antonio Water System",
  "OperatorStr1": "1001 East Market Street",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78205",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Treatment Operations Director",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184622",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-12-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-12-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-12-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 29.14806,
  "FRS_Long": -98.39528,
  "FRS_Description": "PLANT ENTRANCE (FREIGHT)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42358,
      "AltID": "Water Treatment",
      "FacilityID": 29288,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43309,
          "ProcessID": 42358,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 55752,
          "ProcessID": 42358,
          "ChemicalID": 62,
          "Quantity": 64000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 555752,
          "ProcessID": 42358,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29288,
      "SummaryText": "The Twin Oaks Water Treament Aquifer Storage Recovery Facility is owned and operated by the San Antonio Water System (SAWS). The SAWS ASR Facility is a public utility owned by the City of San Antonio that was created in May 1992, and is responsible for treating drinking water and wastewater.\n\nA seven member Board of trustees, appointed by the City Council, governs SAWS. The mayor appoints the Chair each year and the board elects the vice-chair and secretary. Currently the San Antonio Water System  serves approximately 1.2 million customers in the urbanized part of Bexar County. By 2050 the population served is expected to increase to 2.2 million.\n\nSAWS takes great pride in observing the most stringent industrial safety precautions in preventing chemical related releases. The latest safety technology and monitoring detection systems are used at the Twin Oaks ASR Water Treatment Facility. Internal inspections and RMP audits are conducted by SAWS staff to include periodic inspections by the staff of  the Texas Conservation of Enviromental Quality.\n\nBoth active and passive mitigations sytems are incorporated into the operation and maintenance of chemical handling systems at Twin Oaks Water Treatment Aquifer Storage Recovery Faciltiy. Our goal is to first prevent accidental releases and second to defuse the impact of an accidental spillage, fire or explosion if it should occur. A reportable accident release has not occured at any of SAWS sites within the last five years.\n\nThe SAWS Treatment Group, which curently operates the Twin Oaks ASR Water Treatment Facility, is also responsible for the operation and maintenance of the systems four major Water Recycling Centers. These plants treat an average of 130 million gallons of wastewater per day.  Regulated materials included in the treatment process include chlorine and sulfur dioxide.\n\nLike other water utilities in the state, The Twin Oaks Aquifer Storage Recovery Water Facility is required to disinfect treated effluent pri"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29288,
      "SummaryText": "or to discharge into the drinking water system to ensure that disease causing bacteria are reduced to a safe level. Chlorine is a widely used disinfectant  in the water treatment industry because, it is effective against a broad spectrum of pathogens. Chlorine has shown itself to be an effective agent against waterborne bacteria, viruses and most protozoan agents.\n\nAmerican Water Works Association (AWWA) Process Hazard Analysis has been performed for this facility based on the Chlorine Institute Pamphlet 1 guidelines. Assuming a complete rupture of containers, off site receptors would be impacted. The storage containers used by SAWS must conform to the stringent Department of Transportation (DOT) construction standards, the occurrence of a worst case release is not realistic. Information from the hazard analysis is used to improve emergency planning activities with the Sandy Oaks Fire Department and the Bexar County LEPC.\n\nChlorine shipping containers are designed for safety. U.S. Department of Transportation Regulations 49CFR 173.304 set the maximum permissible filling density for chlorine containers to 125 percent of the ratio of the weight of chlorine in the container to the weight of water the container will hold at 60 degrees fahrenheit. Chlorine valves are protected either by housing (cylinders) or manhole cover (tank). In the event of a fire or temperatures exceeding 165 degrees fahrenheit, the fusible plugs on chlorine containers melt to relieve pressure. Ton chlorine containers are designed to withstand pressures of a least 330 psig. Emergency repair kits are available and detectors and alarms are available and operable.\n\nAn  Emergency Evacaution/Shelter-in-Place Response Plan is incorporated at this facility, parts of this plan include;  Standard Operating  Procedures for chlorine handling, emergency chemical release response, reporting, site control emergency actions, release contol procedures, post-incident evaluation, training, evacuation and shelter-in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29288,
      "SummaryText": "-place plan. All personnel handling regulated chemicals at the facility are required to be Texas Commission of Environmental Quality certified operators. All personnel handling chlorine also receive annual training in the safe use of chlorine to include HazMat certification and HazMat physicals. All HazMat Tech certified Operators particpate in quarterly chemical release exercises. SAWS will conduct joint chemical release exercises with the Sandy Oaks Fire Department and the San Antonio Fire Department HazMat Teams.\n\nThe regulated chemical safety management plan is reviewed and updated each year during the facility's Tier II submittal process. A copy of this RMP has been provided to the  Bexar County LEPC, San Antonio Fire Department, and Sandy Oaks Volunteer Fire Department."
    }
  ]
}