{
  "FacilityID": 29300,
  "FacilityName": "J.R. Simplot Company",
  "FacilityStr1": "14124 Wheeler Road N.E.",
  "FacilityStr2": null,
  "FacilityCity": "Moses Lake",
  "FacilityState": "WA",
  "FacilityZipCode": "98837",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53025",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "47.133056",
  "FacilityLongDecDegs": "-119.189722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.simplot.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "J.R. Simplot Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "J.R. Simplot Co.",
  "OperatorStr1": "14124 Wheeler Road N.E.",
  "OperatorStr2": null,
  "OperatorCity": "Moses Lake",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98837",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mitch Anderson",
  "RMPTitle": "Environmental Manager",
  "FTE": 442,
  "OtherEPAFacilityID": "WAD 009072836",
  "EPAFacilityID": "100000115449",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2003-12-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2003-12-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-12-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-12-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 47.13075,
  "FRS_Long": -119.19072,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42412,
      "AltID": "Ammonia System",
      "FacilityID": 29300,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43363,
          "ProcessID": 42412,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 55828,
          "ProcessID": 42412,
          "ChemicalID": 56,
          "Quantity": 33300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 555828,
          "ProcessID": 42412,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29300,
      "SummaryText": "A.  Describe the Accident Release Prevention and Emergency Policies\n\nIt is the intent of the J.R. Simplot Co. to provide a safe work environment of every employee and to protect them from inury and illness resulting from unsafe acts or conditions during hours of employment.  Simplot will also comply with all federal, state, and local laws and regulations.  The Unit Director has the responsibility for leadership of the safety and health program, for its effectiveness and improvement, and for providing the safeguards required to ensure safe conditions.\n\nAmmonia safety programs are key items in the plant safety and health program.  Simplot takes many precautions to prevent or minimize accidental releases of ammonia.  These precautions include safety controls (alarms and automatic shutdown devices) which are designed to identify and prevent potentially unsafe conditions like pressure increases that could cause a system failure, a preventive maintenance program designed to maintain the on-going integrity of the systems.  A training program designed to ensure that the systems are operated by qualified personnel, and emergency action procedures to isolate, ventilate and evacuate.\n\nThe Boiler and Refrigeration Supervisor is responsible for the management of the ammonia safety programs.\n\nB.  Stationary Source and Refulated Substances Handled\n\nSimplot's Moses Lake facility produces frozen potato products for sale to the public.  The facility operates an ammonia refrigeration system to cool and freeze the food products and the production areas.  The maximum ammonia inventory at the plant is approximately 33,300 pounds.  Ammonia is the only regulated substance handled at the Moses Lake facility.\n\nC.  Summary of Worst -Case and Alternative Release Scenarios\n\nThe worst-case toxic release scenario at the Moses Lake facility involves the release of 33,300 pounds of ammonia over a 10 minute period due to the failure of an ammonia receiver.  This maximum inventory reflects the writte"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29300,
      "SummaryText": "n administrative procedures in place at the plant to limit the amount of ammonia stored in the receiver to 85 percent.  Under worst-case conditions, the resulting vapor cloud could have off-site impacts.\n\nThe alternative toxic release scenario at the Moses Lake Plant involves the release of 4,250 pounds of ammonia over a 5.6 minute period due to a release from a pressure relief valve.  The release duration was assumed to be limited by the time it would take to empty the ammonia receiver under normal operating conditions.  Under alternative release conditions, the resulting vapor cloud could have off-site impacts.\n\nThe worst-case and alternative toxic release scenarios are unlikely for the following reasons:\n\n- The weather conditions that were used for the worst-case release scenario do not occur, while those used for the alternative case are uncommon;\n- Industry standards are followed for the design and manufacture of the equipment in the ammonia refrigeration system;\n- The ammonia receivers are well protected from vehicular traffic;\n- Pressure safety valves on the ammonia receivers should limit any pressure increases inside the receivers;\n- Ammonia detectors should readily detect releases from the pressure relief valves on the ammonia receivers;\n- Ammonia is not corrosive in this service;\n- The facility has a preventive maintenance program in place to maintain the on-going integrity of the ammonia refrigeration equipment;\n- The facility has a training program designed to ensure that the systems are operated by qualified personnel; and,\n- The facility emergency action procedures and system design that enable trained personnel to respond quickly to isolate any potential releases.\n\nD.  Description of the Accidental Release Prevention Program\n\nThe facility has a program level 3 accident release prevention program for the ammonia system that complies with OSHA's Process Safety Management Standard and EPA's Risk Management Program regulation.  The ammonia prevention prog"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29300,
      "SummaryText": "ram consists of the following elements:\n\n- Employee Participation Program\n- Process Safety Information\n- Process Hazard Analysis\n- Operating Procedures\n- Training Program\n- Contractor Safety Program\n- Pre-Starup Safety Review Procedures\n- Mechanical Integrity Program\n- Hot Work Permit Procedures\n- Management of Change Procedures\n- Incident Investigation Procedures\n- Compliance Audit Procedures\n\nE.  Five-Year Accident History\n\nThere have not been any ammonia-related incidents at the Moses Lake facility during the previous five years that resulted in significant on-site or offsite consequences.\n\nF.  Description of the Emergency Action Plan\n\nAn emergency action plan has been implemented at the Moses Lake facility.  This program contains procedures describing evacuation of facility personnel during an emergency.\n\nG.  Planned Changes to Improve Safety\n\nChanges were recommended to improve the equipment and the system operating procedures when the ammonia refrigeration system was analyzed in 1998.  The recommended changes have been evaluated and will be implemented as required."
    }
  ]
}