{
  "FacilityID": 29338,
  "FacilityName": "Iowa Quality Beef",
  "FacilityStr1": "3337 L Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tama",
  "FacilityState": "IA",
  "FacilityZipCode": "52339",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19171",
  "LEPC": "Tama County LEPC",
  "FacilityLatDecDegs": "41.958056",
  "FacilityLongDecDegs": "-92.550556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 128793333,
  "ParentCompanyName": "Iowa Quality Beef Supply Cooperative",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "IQB Supply Cooperative",
  "OperatorStr1": "3337 L Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tama",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52339",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ed Fitzgerald",
  "RMPTitle": "VP Operations & Cattle Procurement",
  "FTE": 560,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000005843",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-07-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2003-12-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-04-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 41.97338,
  "FRS_Long": -92.55262,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42470,
      "AltID": "Refrigeration",
      "FacilityID": 29338,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43422,
          "ProcessID": 42470,
          "NAICSCode": "311611",
          "_desc": {
            "NAICS_CODE": "311611",
            "NAICS_DESCRIPTION": "Animal (except Poultry) Slaughtering"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 55932,
          "ProcessID": 42470,
          "ChemicalID": 56,
          "Quantity": 22316.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 555932,
          "ProcessID": 42470,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29338,
      "SummaryText": "Executive Summary\n\nCommitment-Safety Approach\n\nIowa Quality Beef considers their employees as their most valuable resource, their health and safety is our greatest responsibility.  As our most valuable resource, we place top priority in informing, educating, protecting and preserving our employees as valuable members of the company.\n\nThe Company's primary focus is to prevent the occurance of unforeseen industrial incidents/accidents from occuring in the work environment.\n\nFacility Description and Regulated Substance \n\nThe operations at the facility consists of the processing of beef and specialty meat cuts.  The facility employs approximately 560 employees.  The refrigeration system at the facility comprises with the regulated substance being Ammonia (anhydrous).  This is a self-contained system which provides the refrigeration for the main facility (on L Avenue).\n\nAmmonia Refrigeration System Description\n\nThe ammonia refrigeration system is a single stage, closed-loop system that is used to provide cooling for: carcasses, process room, temperature control, water chilling and temper water for clean up.  A minimal amount of freezer storage is maintained at the facility.  Storage of product is off-site.\n\n5-Year Accident History\n\nThere have been no Anhydrous Ammonia incidents identified for the facility in the previous five (5) years which resulted in significant on-site or off-site consequences.\n\nPrevention Program \n\nTo accomplish the facility's goal in controlling accidental losses, the facility has established a multi-faceted Safety Program.  The objectives of the program are to acheive maximum efficiency and safety performance.\n\nThe facility has implemented a prevention program for accidental release of the Ammonia Process Elements of the program coincide with OSHA's Process Safety Management System (PSM) Standard (Safety Process Management of Highly Hazardous Chemical, 29 CFR 1910.119); EPA's Risk Management Program (RMP) Regulation, (Risk Management Programs for "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29338,
      "SummaryText": "Chemical Accidental Release Prevention, 40 CFR Part 68.  The purpose of the accidental release prevention and emergency response programs is to prevent occurances and minimize the consequences of significant releases of toxic substances as well as fire, explosion, and other types of catostrophic accidents.\n\nComponents of Accidental Release Prevention Program\n\nThe Facility's Accidental Release Prevention Program\n\n-Employee Participation                      - Training\n-Process Safety Information              - Contractors\n-Process Hazard Analysis                 - Pre-Startup Safety Review\n-Operating Procedures                       - Mechanical Integrity\n-Hot Work Permit                                 - Incident investigation\n-Management of Change                    - Compliance Audits\n-Preventative Maintenance                 \n\nEmergency Response Program\n\nAn Emergency Response Program has been implemented at the facility.  This program contains procedures describing how the facility will respond  to Anhydrous Ammonia spills and other emergencies, including evacuation procedures.  This program has been coordinated with the  Tama Fire Department..\n\nThe response plan includes such elements as organizational plan and responsibilities, communication procedures, action plans, emergency first aid and medical treatment procedure, evacuation procedures, outside assistance and response training.\n\nSummary of the Worst Case Scenario and Alternative Scenario\n\nIowa Quality Beef has diligently and proactively developed emergency reponse procedures to be followed in the unlikely event of a situation involving the release of anhydrous ammonia, which is commonly used in refrigeration systems in the food industry.\n\nAs required by the EPA and to minimize the safety of our employees and surrounding community, the company has developed a hypothetical worst case scenario.  This model involves the release of 19, 500 pounds of ammonia over a 10 minute period from a vessel leak (Liquid Spi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29338,
      "SummaryText": "ll and Vaporization) inside the facility.  Using a variety of factors such as extreme and unlikely weather conditions and mitigated release, ammonia would travel a theoretical distance before dispersing.  Based upon the model, that distance could be up to 2.2 miles.  However, industry experts consider the above scenario to be unlikely for the following reasons:\n\n-Pressure safety valves limit operating presures in these vessels;\n-Industry standards were followed for the manufacture and quality control of this vessel;\n-A comprehensive preventative maintenance program is in place to maintain the ongoing integrity of the vessel;\n-Emergency Response Procedures would enable highly-trained personnel to respond quickly to isolate any onsite or off-site situation.\n\nThe hypothetical alternative release scenario for the facility is described as a pipe leak located in the compressor room of the facility.  This model is based upon the release of 620 pounds of anhydrous ammonia over a 10 minute period.  Using a variety of factors , such as extreme of unlikely weather conditions, ammonia would travel a theoretical distance before dispersing.  Based upon the model, that distance could be up to .19 miles.  However, industry experts consider this hypothetical scenario to be unlikely for the following reasons:\n\n-The weather conditions which were used for this scenario are unlikely to occur;\n-Pressure safety valves limit operating procedures;\n-Industry standards were followed for the manufacture and quality control piping; \n-Preventative maintenance program in place to maintain the on-going integrity.\n\nContinual Safety Updates \n\nThe facility strives for continual safety improvement.  Some areas of updates in the future include, continued training for new employees and contractors and working with local Fire Department and LEPC for emergency prepredness puposes (touring the facility and familarizing themselves witht the layout and configuration of the facility and the refrigeration proc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29338,
      "SummaryText": "ess.)\n\nNote: 9.1 (a) LEPC has been notified and is planning on including the facility in the written Community Emergency Reponse Plan."
    }
  ]
}