{
  "FacilityID": 29396,
  "FacilityName": "Polysource, Inc",
  "FacilityStr1": "555 East Statler Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Piqua",
  "FacilityState": "OH",
  "FacilityZipCode": "45356",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39109",
  "LEPC": null,
  "FacilityLatDecDegs": "40.135694",
  "FacilityLongDecDegs": "84.225889",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A1",
  "LatLongDescription": "UN",
  "FacilityURL": "www.polysource.com",
  "FacilityEmailAddress": "rdickerson@polysource.com",
  "FacilityDUNS": 621471929,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Polysource, Inc",
  "OperatorStr1": "PO Box 916",
  "OperatorStr2": null,
  "OperatorCity": "Piqua",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45356",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184837",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-01-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-01-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-01-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 40.134641,
  "FRS_Long": -84.186472,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42609,
      "AltID": null,
      "FacilityID": 29396,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 56165,
          "ProcessID": 42609,
          "ChemicalID": 115,
          "Quantity": 65809.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43563,
          "ProcessID": 42609,
          "NAICSCode": "32614",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 16488,
              "Process_NAICS_ID": 43563,
              "SafetyReviewDate": "2004-01-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-01-05 00:00:00",
              "ChangeCompletionDate": "2004-01-05 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-01 00:00:00",
              "TrainingReviewDate": "2003-01-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-01 00:00:00",
              "EquipmentInspectionDate": "2003-12-31 00:00:00",
              "EquipmentTested": "Associated piping testedby the state of Ohio",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 17206,
                  "PreventionProgram2ID": 16488,
                  "ProcessChemicalID": 56165
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29396,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Miami County LEPC",
    "CoordinatingAgencyPhone": "9374760306",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29396,
      "SummaryText": "INTRODUCTION\n  Polysource, Inc. is a manufacture of expandable polystyrene, located in Piqua, Oh.\nDuring the manufacture of the EPS, Polysource uses Isopentane. Due to the storage of Isopentane in a quantity over the threshold limit of 10,000 pounds, Polysource is subject to Section 112( r) of the CAA(CFR 40 Part 68) and the Ohio Administrative Code(OAC) 3745-104. The maximum quantity of Isopentane stored on site is 65,809 pounds. The Isopentane is stored in two aboveground storage tanks located outside of the building, as is most of the associated piping. (See Appendix A for MSDS for Isopentane)(See Appendix B for Equipment Diagram)\n\n  By implementing the Risk Management Plan, it is not only the intent of Polysource to be in compliance with the regulations set by federal and state agencies, but to protect it¿s employees as well as the surrounding community. Polysource has implemented training procedures specific to the handling of Isopentane for the employees to follow, as well as for the inspection and maintenance of the associated equipment.\n\n1.0\tREGISTRATION\n\n  The facility registration will be provided through the use of RMP*Submit. This info is publicly available through the Internet, as well a hardcopy contained herein. (Appendix C) Public request for information presented in writing, will be handled by the Director of Operations at Polysource.\n\n2.0\tHAZARD ASSESSMENT\n\n  A review and evaluation of the following information has determined that the facility meets Program Level 2 requirements. This facility is operating under SIC code 2821. At this time it is not subject to OSHA PSM Standard CFR 1910.119.\n\n Material Stored Above Threshold Quantity\n  Isopentane as it is referred to in this manual, is not a pure substance, but is the single largest component and is referred to as such. The maximum inventory stored at the facility and inventory information is included. (See Appendix D- Tank Capacity/\nInventory)\n\nWorst-case Release Scenario \n  The determination of th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29396,
      "SummaryText": "e worst-case release scenario and the alternative release scenario were conducted using RMP*Comp. Worst-Case Release endpoint is .1 miles, there are no industrial receptors within that range of distance at this time. Over the course of the next five years, it is probable that there will be. There is a minimal number of residential receptors within the distance calculated. In the event of the calculated Alternative Release, no other receptors would be effected. (See Appendix E for Worst-Case Release Scenario)(See Appendix F for Alternative Release Scenario)\n\n5-Year Accident History\n  During the past five years, the facility has not had an accidental release of Isopentane that has caused offsite impacts where exposure to the Isopentane, its reaction products, overpressure generated by an explosion involving the substance, or radiant heat by a fire led to: death, injury, or response/restoration activities for an exposure of any receptor.\n\nReview and Update\n  The Director of Operations or designee will be responsible of development, implementation and upkeep of the RMP. A periodic review will be conducted of the current plan and any updates, modifications, or amendments will be handled accordingly.\n The offsite consequence analysis will be updated at least once every five years. If changes in the process or quantity of material stored, might reasonably affect the distance of a release endpoint by a factor of two, a revised RMP and registration will be submitted.\n\n3.0\tPREVENTION PROGRAM\n\nSafety Information\n  A Material Safety Data Sheet (Appendix A) for Isopentane CAS# 78-78-4 is maintained on site as required by 29 CFR 1910.1200. The maximum intended inventory for Isopentane is recorded on the worksheet included as Appendix D. \n  Two Aboveground Storage Tanks are used in accordance with applicable regulations and are safe for the purposes that they are intended. Only qualified personnel under the direction of the Director of Operations or his designate perform maintenan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29396,
      "SummaryText": "ce of the tanks and related equipment.\n  \nHazard Review  \n  The major hazards associated with the handling of Isopentane are flammability and toxification. This material has not been listed by National Toxicologly program, classified by International Agency for Research on Cancer, nor regulated by OSHA as a carcinogen. Isopentane can cause eye and skin irritation, therefore personal protective equipment in the form of safety glass or goggles and hand protection should be worn when coming in contact with Isopentane. \n  Isopentane is a flammable material and having a flash point of <-60 F. Portable fire extinguishers are available near the storage area. ¿No Smoking¿ signs are posted where appropriate. Piping, and other apparatus are kept tight to prevent leakage. Visual inspections are done routinely during the preventive maintenance program. \n  One of the primary causes of accidental releases from storage systems is human error. In an effort to have less human error, only trained personnel are permitted to unload the Isopentane from the tank vehicles. Furthermore the driver of the delivery truck stays in attendance at the point of transfer form the time of hook up to disconnection. Given the past history of operations at the facility and the design of the system, the chance of an accidental release that could cause offsite impacts are minimal. \n\nOperating Perimeters\n  Normal operating conditions for the tanks at atmospheric pressure is less than 0.5 psig. The conservation value, for normal venting, will prevent accumulation of tank pressure above 2.0 psig. The emergency venting, rupture disk, is rated for 2.5 psig in accordance with NFPA 30. The operating temperature of the tanks at atmospheric pressure is typically within 10 degrees F of the air temperature. In the event of an over temperature situation that would cause pressure in the vessels the normal and emergency venting would automatically be employed. Isopentane is conveyed to the machinery via a pipe and pum"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29396,
      "SummaryText": "p system that operates at a maximum operating pressure of 90 psig. Normal pump pressure is approx. 60 psig with a pressure bleed value at 90 psig. This pressure bleed  is in place to prevent an overpressure situation  in the piping.The piping has been tested to withstand 1.5 times the normal operating pressure. In the event of a major, more than 25%, pressure drop an automatic pump shut off is employed. This is to prevent accidental releases inside the manufacturing area.  The Isopentane is then injected directly into the extruders by a pump at a maximum pressure of 3000 psig. In the event of pump pressure in excess of 3000 psig is bleed back to the injection pump. A series of check values are utilized to prevent backpressure into the piping system. Normal injection pressure is approx. 1500 to 2000 psig.\n\nOperating Procedures\n  Procedures for the unloading of the bulk tank vehicles have been established and are periodically review for accuracy. A procedure for shutting down and starting up has also been established and is reviewed periodically. An emergency shut down procedure is also maintained for the tank system. There are no automatic monitoring devices; therefore this process utilizes no computers. The operating procedures are available during the hours of operation. (See Appendix G- Operating Procedures)\n\nTraining\n  On the job training is provided to each new hire as well as recurrent training for all employees, which includes, but is not limited to:\nEmergency Facility Evacuation\nHazard Communication\nPersonal Protective Equipment\nOnly specifically trained employees are allowed to transfer Isopentane from the tank vehicle to the storage tanks. These specifically trained employees will have a record of training in there files.\nIn the event that Contractors are to be in the facility they are to be made aware of the presence of the Isopentane and are to adhere to the safety regulations set forth by Polysource, Inc. \n\nMaintenance\n  Only trained maintenance personne"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29396,
      "SummaryText": "l, either employed by Polysource or contracted by Polysource, perform maintenance to the associated system, routine or non-routine.\nRecords of inspections and modifications will be documented and maintained.\n\nCompliance Audits\n  Competent individuals will do all compliance audits and records will be documented and maintained. NFPA 30 will be used as a guideline for internal audits.\nThe local fire authority will be invited to do annual audits. If an outside audit is done, Polysource will maintain a copy of that record as well.\n\nAccident Investigation\n  An Internal Spill Report should be completed for releases. After completion, this report is review by the Management Team assigned to the RMP program and filed at the back of this manual. An action plans to prevent future releases will be documented and maintained. (See Appendix H-Internal Spill Report)\n\nInspections\n  Tank inspections are to be conducted periodically to ensure the tanks and associated piping remains in good condition. Visual inspections will be conducted on a monthly basis to check for leaks and corrosion. Periodic inspection by a contracted source will be employed once every five years. These inspections will be done according to API 650/653. Records of these inspections will be maintained.\n\n4.0\tEMERGENCY RESPONSE PROGRAM\n\n Company employees are trained in the procedures to follow in the event of an accidental release. In the case of an emergency situation, access to and within the facility will be maintained for emergency response actions. Areas for potential fire or spill are easily accessed by the exiting driveway systems. Aisle space is maintained within the facility to allow for the movement of personnel and equipment to any area of the site.\n  In the event of an emergency situation involving the stored material, whether a leak, fire or explosion, personnel should be immediately evacuate the area. Do not attempt to contain the material if the flow of product cannot be shut off immediately and wit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29396,
      "SummaryText": "hout risk. The company has developed an evacuation plan in the event that, a situation should occur, an evacuation would be required. If such measures have been implemented, information would be broadcast on the company paging system. Upon evacuation, personnel are to exit via the nearest exit and proceed to the pre-determined meeting area off site. (See Appendix I-Emergency Evacuation Plan)"
    }
  ]
}