{
  "FacilityID": 29403,
  "FacilityName": "GenWest Silverhawk Power Plant",
  "FacilityStr1": "15111 Apex Power Parkway",
  "FacilityStr2": null,
  "FacilityCity": "North Las Vegas",
  "FacilityState": "NV",
  "FacilityZipCode": "89124",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.410694",
  "FacilityLongDecDegs": "-114.96075",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "forrest_hawman@apsc.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pinnacle West Energy Corporation",
  "Company2Name": null,
  "CompanyDUNS": 131155400,
  "Company2DUNS": 0,
  "OperatorName": "GenWest, LLC",
  "OperatorStr1": "PO Box 337260",
  "OperatorStr2": null,
  "OperatorCity": "North Las Vegas",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89033",
  "OperatorZipCodeExt": "7260",
  "FTE": 32,
  "OtherEPAFacilityID": "55841",
  "EPAFacilityID": "100000184864",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A1584",
  "SafetyInspectionDate": "2003-07-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-01-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-01-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-01-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 36.41069,
  "FRS_Long": -114.96075,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42616,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 29403,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 56172,
          "ProcessID": 42616,
          "ChemicalID": 57,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43570,
          "ProcessID": 42616,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 16489,
              "Process_NAICS_ID": 43570,
              "SafetyReviewDate": "2004-01-07 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2003-07-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-07 00:00:00",
              "TrainingReviewDate": "2004-01-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-07 00:00:00",
              "EquipmentInspectionDate": "2004-01-07 00:00:00",
              "EquipmentTested": "Ammonia Storage Tank and delivery system being constructed",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Aqueous Ammonia System for NOx emission control",
              "_chemicals": [
                {
                  "PrimaryKey": 17207,
                  "PreventionProgram2ID": 16489,
                  "ProcessChemicalID": 56172
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29403,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-08-15 00:00:00",
    "ERTrainingDate": "2003-09-08 00:00:00",
    "CoordinatingAgencyName": "Clark County Fire Department",
    "CoordinatingAgencyPhone": "7024557710",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29403,
      "SummaryText": "RMP*Submit Executive Summary\n\nThe following outlines the key components of the Risk Management Plan for the aqueous ammonia storage and handling system at the GenWest, LLC Silverhawk Power Plant.  The organization of this executive summary follows the elements listed in the U.S. EPA's RMP*Submit Users Manual, with a brief introduction.\n\nIntroduction\n\nGenWest, LLC, a subsidiary of Pinnacle West Energy Corporation, operates the Silverhawk Power Plant, an electric power generation facility located in North Las Vegas, Nevada.  The facility is a green-field site consisting of one combined-cycle unit.  This RMP covers the single unit (Unit 1) that is currently under construction.  \n\nAs part of construction of the new combined-cycle unit, selective catalytic reduction (SCR) control systems are being installed to reduce emissions of nitrogen oxides (NOx).  The SCR system utilizes aqueous ammonia to reduce NOx emissions.  Ammonia with concentrations of 20% or higher is listed as a regulated substance under Section 112(r) of the Clean Air Act Amendments of 1990.\n\nAs a result of the SCR NOx control system, the quantity of aqueous ammonia to be stored and used at the facility will be greater than the Threshold Quantity, thus a Risk Management Plan (RMP) is required.  The aqueous ammonia system was identified as the only process at the facility that triggers RMP requirements.  As explained in the following sections, even the highly unlikely worst-case release from the aqueous ammonia system will not result in the toxic endpoint reaching a public receptor.\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nAccidental release prevention and emergency response policies are supported at the highest level within the Company.  The facility is operated to protect the health and safety of our employees and neighbors, as well as to protect the environment.  To communicate this philosophy, GenWest, LLC has an ongoing environmental, health and safety-training program for e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29403,
      "SummaryText": "mployees.  In addition, a release such as that used for the worst-case scenario is highly unlikely due to this ongoing training, and preventive maintenance inspections of the ammonia system.\n\n2. Description of Facility and Regulated Substance Handled\n\nThe GenWest, LLC Silverhawk Power Plant is located in North Las Vegas, Nevada.  As mentioned, an SCR system is being installed to control NOx from the new unit.  The SCR system will utilize a 29.0% solution of ammonia in water, ammonium hydroxide.  The ammonia storage and handling system will consist of a single 30,000-gallon storage tank, pumps, and piping to the vaporizer, which produces a uniform distribution of aqueous ammonia injected into the flue gas upstream of the SCR catalyst.  The storage tank will have a maximum design pressure of 30 psia, and will be located within a walled containment basin designed to hold the entire tank content.  The tank will also have an administrative fill limit of 85% (25,500 gallons) and contain approximately 55,000 lbs. of ammonia in the solution.  Because the facility will store more than 20,000 lbs. of aqueous ammonia, an RMP will be required.  The facility will not be subject to OSHA?s Process Safety Management (PSM) standard because the concentration of aqueous ammonia is below 44%.  Because the facility is not subject to the PSM standard, the aqueous ammonia process will fall under EPA RMP Program 2.\n\n3. Worst-case Release Scenario\n\nThe worst-case scenario is a release of the entire contents of one of the storage tank.  The tank is surrounded by a walled containment basin that limits the exposed surface area and reduces the release rate for the 29.0 (weight %) aqueous ammonia.  The EPA Risk Management Guidance for Wastewater Treatment Plants (EPA 550-B-00-007, May 2000) was used to perform the offsite consequence analysis.  Under worst-case meteorology as per the guidance (1.5 m/s and F stability) the resulting distance to toxic endpoint from Exhibit 4-9 was 0.7 miles (rural"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29403,
      "SummaryText": " topography).  This distance is beyond the property boundary and extends into the adjacent parking lot and plant offices of the Mirant Apex Generating Station.   However, there are no public or sensitive receptors within the toxic endpoint.  The worst-case release from the storage tank is predicted to remain almost entirely on-site and is less than the distance to public or environmental receptors.  The facility is currently under construction has not had a release of a regulated substance in the past five years.  However, since the facility will store more than 20,000 lbs. of aqueous ammonia an alternative release scenario is required.\n\n4.  Alternative Release Scenario\n\nThe alternative release scenario may consider active mitigation such as automatic shutoff, valves and scrubbers.  Active mitigation consists of mechanical, electrical, or human input.  The scenario selected for Silverhawk assumes the release of 500 gallons of aqueous ammonia from a pipe resulting in a released quantity, which would cover the containment area to a depth of at least 1-centimeter. The worst-case scenario is a release of the entire contents of one of the storage tank.  The EPA Risk Management Guidance for Wastewater Treatment Plants (EPA 550-B-00-007, May 2000) was used to perform the alternative offsite consequence analysis.  Under alternative case meteorology as per the guidance (3.0 m/s and D stability) the resulting distance to toxic endpoint from Exhibit 4-21 was 0.2 miles (rural topography).  This distance is just beyond the property boundary and does not extend into any sensitive, public or environmental receptors.  This alternative case release from the storage tank is predicted to remain almost entirely on-site. \n\n5.  Accidental Release Prevention Program\n\nThe aqueous ammonia system was designed to reduce potential off-site impacts by including a concrete dike to provide 100% containment around the storage tank.  Operators will receive ongoing training in accident prevention an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29403,
      "SummaryText": "d chemical safety, will conduct visual inspections of the ammonia system routinely, as well as perform maintenance recommended by the equipment manufacturers to reduce the risk of accidents.  The storage tank as well as the ammonia delivery skids are equipped with gaseous ammonia detectors which will alarm in the control room as well as sound local audible alarms when triggered.\n\n6.  Five-Year Accident History\n\nThe Silverhawk Power Plant is a new facility and has had no accidents involving ammonia.    \n\n7.  Emergency Action/Response Program\n\nGenWest, LLC is required to meet the requirements for Program 2, which includes and emergency action plan and procedures for informing the public and local agencies.  GenWest, LLC will coordinate emergency response with the North Las Vegas Fire Department, Clark County Office of Emergency Management and Nevada Division of Environmental Management by notifying them of the chemical to be on-site via an Emergency Action Plan submitted in November, 2003.\n\n8.  Planned Changes to Improve Safety\n\nGenWest, LLC  has an ongoing program of training, maintenance, and inspections in order to minimize the possibility of accidents.  Following start-up of the ammonia system the facility will evaluate procedures and implement recommendations as appropriate from ongoing review of operator training and inspection programs."
    }
  ]
}