{
  "FacilityID": 29418,
  "FacilityName": "Ecotec",
  "FacilityStr1": "312 S.W. 7th Ave",
  "FacilityStr2": null,
  "FacilityCity": "Okeechobee",
  "FacilityState": "FL",
  "FacilityZipCode": "34974",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12093",
  "LEPC": "District #7 LEPC",
  "FacilityLatDecDegs": "27.240833",
  "FacilityLongDecDegs": "-80.837222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Enrique Bolanos",
  "OperatorStr1": "312 S.W. 7th Ave",
  "OperatorStr2": null,
  "OperatorCity": "Okeechobee",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34974",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184891",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-12-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-01-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-01-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-01-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 27.240778,
  "FRS_Long": -80.837534,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42631,
      "AltID": "LPG handling",
      "FacilityID": 29418,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 56187,
          "ProcessID": 42631,
          "ChemicalID": 111,
          "Quantity": 31000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 56188,
          "ProcessID": 42631,
          "ChemicalID": 155,
          "Quantity": 53000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 40468,
              "ProcessChemicalID": 56188,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 40469,
              "ProcessChemicalID": 56188,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43585,
          "ProcessID": 42631,
          "NAICSCode": "339999",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 24443,
              "Process_NAICS_ID": 43585,
              "SafetyReviewDate": "2003-12-10 00:00:00",
              "PHA_Date": "2003-12-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-12-10 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-10 00:00:00",
              "TrainingReviewDate": "2003-12-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-12-10 00:00:00",
              "EquipmentInspectionDate": "2004-01-14 00:00:00",
              "EquipmentTested": "Inspection of LPG handling system",
              "ChangeMgmtDate": "2003-12-10 00:00:00",
              "ChangeMgmtReviewDate": "2003-12-10 00:00:00",
              "PreStartupReviewDate": "2003-12-10 00:00:00",
              "ComplianceAuditDate": "2003-12-10 00:00:00",
              "AuditCompletionDate": "2004-12-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-12-10 00:00:00",
              "HotWorkPermitReviewDate": "2003-12-10 00:00:00",
              "ContractorSafetyReviewDate": "2003-12-10 00:00:00",
              "ContractorSafetyEvalDate": "2003-12-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 35895,
                  "PreventionProgram3ID": 24443,
                  "ProcessChemicalID": 56187
                },
                {
                  "PrimaryKey": 35896,
                  "PreventionProgram3ID": 24443,
                  "ProcessChemicalID": 56188
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29418,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-12-10 00:00:00",
    "ERTrainingDate": "2003-12-10 00:00:00",
    "CoordinatingAgencyName": "Okeechobee Fire Department",
    "CoordinatingAgencyPhone": "8637633872",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29418,
      "SummaryText": "General Executive Summary for Manufacturing Facilities\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at Ecotec are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass filling of aersol containers.  We have 3 regulated substances present at our facility.  These substances include Butane, Difluoroethane  [Ethane, 1,1-difluoro-] and Propane.  These substances are used for an aerosol propellant.  \n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's OCA Guidance Reference Tables or Equations.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 flammable substances as a class involves a catastrophic release from LPG handling.  In this scenario 53000 lb. of Flam. Mix.: Butane, Propane is released.  It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather conditions, the calculated distance of 0.30 miles is obtained corresponding to an endpoint of 1 psi overpressure.\n\nThe alternative release scenario submitted for Program 2 and 3 flammable substances involves a release from LPG handling.  The release is assumed to result in a Vapor Cloud Explo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29418,
      "SummaryText": "sion.  The scenario involves the release of 11872.64 lb. of Flam. Mix.: Butane, Propane in  minutes.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.08 miles.\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nEcotec maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/review was performed on 12/10/2003.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Ecotec maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nEcotec has a comprehensive training program in place to ensure that employees who are operating processes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29418,
      "SummaryText": "are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nEcotec carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Ecotec to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on 12/10/2003.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Ecotec.  The most recent review was performed on 12/10/2003.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nEcotec conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent comliance audit was conducted on 12/10/2003.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Inv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29418,
      "SummaryText": "estigation\nEcotec promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nEcotec truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Ecotec has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.\tFive-year Accident History\nEcotec has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.\tEmergency Response Plan\nEcotec carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29418,
      "SummaryText": "s regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nDistrict #7 LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.\tPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  The developments and findings were generated through the employee's suggestions, equipment vendors, and re-engineering of the process, are some of the steps to improve safety at our facility.  These changes are being generated continuously and are implemented as they are generated."
    }
  ]
}