{
  "FacilityID": 29479,
  "FacilityName": "Sara Lee Coffee & Tea; LiPS Facility",
  "FacilityStr1": "1370 Progress Road",
  "FacilityStr2": null,
  "FacilityCity": "Sufflok",
  "FacilityState": "VA",
  "FacilityZipCode": "23434",
  "Facility4DigitZipExt": "2148",
  "FacilityCountyFIPS": "51800",
  "LEPC": "Suffolk Fire Department",
  "FacilityLatDecDegs": "36.768583",
  "FacilityLongDecDegs": "-76.538083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "OT",
  "FacilityURL": "www.saralee.com",
  "FacilityEmailAddress": "khightower@saraleecoffee.com",
  "FacilityDUNS": 622659860,
  "ParentCompanyName": "Sara Lee",
  "Company2Name": null,
  "CompanyDUNS": 622659860,
  "Company2DUNS": 622659860,
  "OperatorName": "Chuck Gosstrom",
  "OperatorStr1": "1370 Progress Road",
  "OperatorStr2": null,
  "OperatorCity": "Sufflok",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23434",
  "OperatorZipCodeExt": "2148",
  "RMPContact": "Brad Borkowski",
  "RMPTitle": "Sr. Engineering & Maintenance Mngr",
  "FTE": 275,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184944",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "51-800-00095",
  "SafetyInspectionDate": "2003-11-24 00:00:00",
  "SafetyInspectionBy": "GE Gaps",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-01-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-01-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-01-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2022-02-14 00:00:00",
  "DeRegistrationEffectiveDate": "2022-01-27 00:00:00",
  "AnniversaryDate": "2009-01-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 36.76822,
  "FRS_Long": -76.53798,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42708,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 29479,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43662,
          "ProcessID": 42708,
          "NAICSCode": "31192",
          "_desc": {
            "NAICS_CODE": "31192",
            "NAICS_DESCRIPTION": "Coffee and Tea Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56289,
          "ProcessID": 42708,
          "ChemicalID": 56,
          "Quantity": 13500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556289,
          "ProcessID": 42708,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29479,
      "SummaryText": "A Risk Management Program (RMP) has been developed and a Risk Management Plan (RMP) has been prepared for use and storage of anhydrous ammonia in the Sara Lee Suffolk, Virginia refrigeration system.  The Risk Management Program and RMP meet and address the requirements of Title 40 Code of Federal Regulations Part 68.\nThis Executive Summary briefly describes the following elements:\n-The accidental release prevention and emergency response policies at the stationary source;\n-The stationary source and regulated substances handled; \n-The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario; \n-The general accidental release prevention program and chemical-specific prevention steps; \n-The five-year accident history; \n-The emergency response program; and\n-Planned changes to improve safety.\n\nTo address concerns of an accidental release prevention and emergency response all plant and field personnel are trained in ammonia action plan and coordination is periodically collaborated with the Suffolk Fire Department.\n \nAs a result of information gathered during preparation of this Risk Management Program, Sara Lee is committing additional resources to further increase employee awareness and equipment reliability and to establish operator training and preventive maintenance programs.  As a demonstration of Sara Lee?s high degree of commitment to public safety and service, they are taking action to decrease the risk of ammonia exposure to the public by implementing recommendations made during the Process Hazards Analysis.\n\nAnhydrous ammonia is used as a refrigerant in the Sara Lee Suffolk, Virginia facility refrigeration system.  The liquid is circulated as needed to the evaporators where heat is absorbed and removed from the medium.  The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system.  The ammonia is not used or mix"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29479,
      "SummaryText": "ed in any manner with other chemical processes.\n\nA \"Worst-Case Scenario Offsite Consequence Analysis\" and an \"Alternative Scenario Offsite Consequence Analysis\" were performed identifying the public and environmental receptors within the toxic endpoint concentration radius of 200 ppm.  The results are mitigated by the fact that most of the refrigeration equipment is inside the Suffolk, Virginia facility's building. \n\nSara Lee has a detailed Emergency Response Plan (ERP) for their facility.  The purpose of this plan is to provide the means for rapidly determining the appropriate response for any emergency that may develop at the facility such as an accidental release of anhydrous ammonia.  Sara Lee coordinates an emergency response plan on a regular basis or when the plan changes.\n\nTo address the five year accident history is not an issue, since the facility is new.  To prevent and/or minimize any potential future release of anhydrous ammonia, Sara Lee is implementing a detailed Process Safety Management program (Preventative Program 3) developed for their facility in Suffolk, Virginia.  The Preventative Program 3 provides extensive maintenance and operator/mechanic training to ensure that the system's mechanical integrity is maintained for the life of the covered process.  Program 3 also incorporates administrative controls when modifications are made to the covered process (ammonia refrigeration system), so that the training and preventative programs are updated as the system expands and changes.\n\nSara Lee will incorporate or address any recommendations resulting from the Process Hazard Analysis, incident investigations and program audits.  The flexibility of the program allows Sara Lee to respond effectively to prevent or minimize any potential of exposing Sara Lee employees, the surrounding public, and/or the environment to a release of anhydrous ammonia."
    }
  ]
}