{
  "FacilityID": 29515,
  "FacilityName": "Upland Farmer's Union Co-op, Inc.",
  "FacilityStr1": "Nebraska Spur 31A",
  "FacilityStr2": null,
  "FacilityCity": "Upland",
  "FacilityState": "NE",
  "FacilityZipCode": "68981",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31061",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "40.321111",
  "FacilityLongDecDegs": "-98.907222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "uplandcoop@gtmc.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Upland Farmer's Union Co-op Inc.",
  "OperatorStr1": "P.O. Box 127",
  "OperatorStr2": null,
  "OperatorCity": "Upland",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68981",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Fries",
  "RMPTitle": "General Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000000250",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-12-03 00:00:00",
  "SafetyInspectionBy": "State Fire Marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-02-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-02-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-02-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 40.32111,
  "FRS_Long": -98.90722,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42751,
      "AltID": "Product Storage",
      "FacilityID": 29515,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43705,
          "ProcessID": 42751,
          "NAICSCode": "44711",
          "_desc": {
            "NAICS_CODE": "44711",
            "NAICS_DESCRIPTION": "Gasoline Stations with Convenience Stores"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56341,
          "ProcessID": 42751,
          "ChemicalID": 56,
          "Quantity": 510000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556341,
          "ProcessID": 42751,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29515,
      "SummaryText": "\nThe United States Environmental Protection Agency (USEPA) developed the Risk\n\nManagement Program (RMP) rule (40 CFR 68) to assist facilities in preventing\n\naccidental releases of highly toxic or flammable chemicals.  The RMP established \n\nthree levels of requirements for the program.  Programs 1 and 2 are for facilities that pose less risk to the environment and therefore have reduced compliance requirements.  Program 1 is designed for \"no impact\" facilities and has the fewest requirements, while Program 3 is the most stringent of the three levels.\n\n            \n\nThe program level for each facility is determined by:\n\n         \n\n       Use of regulated substances in threshold quantity\n\n       Impact of an off-site public receptor (e.g., residence, school, park)\n\n       Standard Industrial Classification (SIC) code\n\n       Five-year accident history\n\n       OHSA PSM (29 CFR 1910.119) applicability. \n\n          \n\nThis facility is regulated under Program 2 requirements under 40 CFR 68.10 because:\n\n          \n\n       It stores anhydrous ammonia in excess of the threshold quantity\n\n       A release from this facility could impact an offsite public receptor     \n\n       (residence)\n\n       It does not operate under a SIC code specified in the rule\n\n       It has not had a reportable accident in the past five years\n\n       It is not subject to OSHA PSM (this is a retail facility).\n\n\n\n40 CFR Part 68 Subpart G applies to an owner or operator of a stationary\n\nsource that has more than a threshold quantity of a regulated substance in a process, as determined under 40 CFR 68.115.  Upland Co-op stores more than the threshold quantity of anhydrous ammonia (10,000 pounds) for commercial sale as fertilizer.   Therefore, Upland Co-op is required to submit a Risk Management Plan (RMP) as defined in 40 CFR 68.150 by June 20, 1999.\n\n\n\nThe Upland Farmer's Union Co-op is committed to operating in a safe and compliant manner. Employees involved in operating the ammonia storage and transfe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29515,
      "SummaryText": "r facility are thoroughly trained to identify and understand the hazards posed by this the transfer process.  Process safety and emergency response materials are kept on site and periodically reviewed.  Information includes information pertaining to the hazards of ammonia, process technology, process equipment, and emergency response procedures.\n\n\n\nThe stationary source is the Upland Co-op anhydrous ammonia storage and transfer facility at which ammonia is received, stored, and distributed for direct application to farm fields during the early spring and fall months.  The facility has four stationery storage tanks with capacities ranging from 10,000 to 26,000 gallons (100,000 to 125,000 pounds).  The facility also stores numerous smaller transportable tanks (nurse tanks) that are actually used in the fertilizer application process.        \n\n\n\n\n\nWorst Case Scenario:\n\n\n\nThe facility is required to complete one worst-case release scenario per 40 CFR 68.165(a)(2) to determine program applicability.  Upland Co-op has chosen to use the EPA program RMP Comp to determine offsite impacts.\n\n\n\nFor this facility, a worst-case release would occur in the event that a primary \n\nammonia tank would rupture and the entire contents would be released to the\n\natmosphere in 10 minutes.  The worst-case scenario requires a ground-level release height (0 feet).  Release calculations are presented below:\n\n\n\n\n\nFive ? Year Accident History:\n\n\n\nThere has not been a release of Anhydrous Ammonia within the past five years that has caused any death, injuries or significant property damage at the facility; nor to our knowledge have resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. \n\n\n\n\n\nAlternative Release Scenario:\n\n\n\nThe facility is required to complete one alternate release scenario per 40 CFR Part 68.165(a)(2). The alternative release scenario considered is in accordance with the guidelines provided in 40 CFR 68.22 and 68.28.  Alte"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29515,
      "SummaryText": "rnative release parameters are presented below:\n\n\n\nAlternative Scenario Parameters                \n\n           \n\n    1.   Land Use - Rural                 \n\n    2.   Release Qty - 600 lb           \n\n    3.   Release Rate - 60 lb/min \n\n    4.   Release Duration - 10 min\n\n      \n\nThe alternative scenario chosen for this facility involves a release because of a sudden split in the hose during transfer.  While this scenario is still unlikely because the transfer hoses used have multiple layers of rubber and a layer of braided stainless steel wire underneath the outer sheath (to prevent abrasions, cuts, and splits) it is more likely than the worst-case as required by 40 CFR 68.28(b)(i).  This scenario is also the most likely to occur, since overfilling is prevented by a return vapor line to the tank truck making the delivery.  The transfer hose rupture area is assumed at 0.5 square inches.  Because personnel are always present at the facility during transfer, Upland\n\nCo-op personnel will respond within 10 minutes.  Release rate was calculated using the OCAG tank release equation (Section 8.1.1).             \n\n        \n\nInput of the preceding data into RMP Comp an alternative release scenario impact \n\nof 0.1 miles for the facility. Since there are residence located closer than 0.1 \n\nmiles from the facility, this alternative release scenario satisfies the conditions of 68.28.  The population impact from the alternative release scenario is estimated at 100 people (from 1990 census data).     \n\n \n\n\n\nProcess Safety Management:\n\n\n\nThe facility maintains written process safety information to enable employees involved in handling ammonia to identify and understand the hazards posed by this process.  Written information includes physical properties of ammonia, health risks associated with ammonia exposure, and material safety data sheets.  In addition, the facility has conducted and/or implemented the following:\n\n\n\n\n\n\n\n             hazards review\n\n             standard operating "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29515,
      "SummaryText": "procedures\n\n             training program\n\n             maintenance program\n\n             compliance audits\n\n             incident investigation     \n\n       \n\n         \n\nRecommendations for safety improvements were identified in the hazard review\n\nwhich was completed December 08, 2003.  Recommendations were identified for\n\ntwo categories: Standard Operating Procedures, and Training.  Safety improvements will be investigated concerning their impacts on other systems and/or procedures prior to implementation.  Additional recommendations may be made upon review of any accidents and/or when the hazard review is updated every five years.  \n\n"
    }
  ]
}