{
  "FacilityID": 29604,
  "FacilityName": "Baytown Area Water Authority",
  "FacilityStr1": "7425 Thompson Road",
  "FacilityStr2": null,
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77521",
  "Facility4DigitZipExt": "1056",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Baytown Area LEP",
  "FacilityLatDecDegs": "29.8",
  "FacilityLongDecDegs": "-95.033333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 14550909,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fred L. Pack",
  "OperatorStr1": "7425 Thompson Road",
  "OperatorStr2": null,
  "OperatorCity": "Baytown",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77521",
  "OperatorZipCodeExt": "1056",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000022432",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-02-03 00:00:00",
  "SafetyInspectionBy": "City of Baytown",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-02-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-02-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-02-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 29.80098,
  "FRS_Long": -95.03173,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42916,
      "AltID": "Disinfection",
      "FacilityID": 29604,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 56638,
          "ProcessID": 42916,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 56639,
          "ProcessID": 42916,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 43871,
          "ProcessID": 42916,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 16546,
              "Process_NAICS_ID": 43871,
              "SafetyReviewDate": "2004-01-26 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-01-26 00:00:00",
              "ChangeCompletionDate": "2004-05-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Inspection of Ammonia Tank and review Chlorine Cylinder handling procedures.",
              "OpProceduresReviewDate": "2004-01-23 00:00:00",
              "TrainingReviewDate": "2004-01-23 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": "videos",
              "MaintenanceReviewDate": "2004-01-23 00:00:00",
              "EquipmentInspectionDate": "2003-04-01 00:00:00",
              "EquipmentTested": "Ammonia Tank.  New Chlorine header completed and tested 1/27/2004.",
              "ComplianceAuditDate": "2000-12-21 00:00:00",
              "AuditCompletionDate": "2000-12-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "1) The staff is trained to respond in a first response capacity.  2) Chlorine cylinders inspected by supplier and both cylinders and line are inspected by the staff before placing on-line.  3) Anhydrous Ammonia liquid level in the tank is mantained below 78%.  This level is below the general accepted limit of 82% liquid NH3.  4) Monthly safety staff meetings are held.  5) Anhydrous Ammonia and Chlorine safety reviewed quarterly.  6) Safety discussions held by supplier, videos, and occassionally written quiz.  7) Anhydrous Ammonia tank equipped with two relief valves each capable of maintaining tank safety individually.  In addition, each line from the tank is equipped with an excess flow valve.  8) Anhydrous Ammonia tank inspected every 3 months by staff and every year by an external source.  9) Installation of new Chlorine and Ammonia monitors along with a scrubber system for the Chlorine area should be completed this year.  10) The staff has written procedures to access the situation and to contact emergency responders (Baytown Fire Department) in conjunction with suppliers.",
              "_chemicals": [
                {
                  "PrimaryKey": 17272,
                  "PreventionProgram2ID": 16546,
                  "ProcessChemicalID": 56638
                },
                {
                  "PrimaryKey": 17273,
                  "PreventionProgram2ID": 16546,
                  "ProcessChemicalID": 56639
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29604,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-02-24 00:00:00",
    "ERTrainingDate": "2004-02-24 00:00:00",
    "CoordinatingAgencyName": "Baytown Fire Department",
    "CoordinatingAgencyPhone": "2814222311",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29604,
      "SummaryText": "A primary goal of the Baytown Area Water Authority (BAWA) is to eliminate or control both known and potential safety and health issues.  These issues are the responsibility of top management, supervisors, and every employee.  Our objective is to teach and motivate safe working habits.  Monthly safety meetings are held concerning general and specific safety issues, which include proper chemical handling procedures.  These safety meetings are held in an open forum allowing all employees to voice concerns about any safety issues and suggestions on improving safety procedures.  Our employees are provided education through training, continuing education, and certification as operators.  By maintaining this competency level, safety and health risk are greatly reduced.\n\nThe BAWA facility was completed in 1980 and is located on a 61-acre tract of land located at 7425 Thompson Road.  The plant processes raw, surface water from a 26-mile long canal originating at the Trinity River.  The process of treating raw water so that is it potable (safe to drink) as well as palatable (taste good) requires the addition of various chemicals.  The regulated substances utilized at the plant are Chlorine and Anhydrous Ammonia.  Chlorine and Anhydrous Ammonia are utilized at the plant to form Chloramines.  Monochloramine is the compound used to disinfect water to make it safe to drink. The Chlorine is transported by truck from the manufacturer in one-ton cylinders.  The manufacturer inspects these cylinders before transporting the cylinders.  In addition, the cylinders are inspected once they arrive and before the are placed on-line.  The largest number of Chlorine Cylinders on site at ony one time is twenty (one-ton) cylinders.  Anhydrous Ammonia is transported by tanker truck from the manufacturer to a storage tank on site.  The accepted general limit of 82% liquid volumne is never exceeded; the liquid volume of the tank on site will not exceed 77.5%.\n\nThe worst case and alternate scenario"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29604,
      "SummaryText": "s developed for BAWA utilized the Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  The worst case scenario was modeled as a direct release over a 10-minute period as required by the regulations resulting from a catastrophic failure due to corrosion, impact, or construction defects of the tank containing Anhydrous Ammonia.  The calculated area that could be affected by an accidental release is referred to as the \"Chemical Plume\".  The plume endpoint would be 2.8 miles in the direction of the wind.  This scenario could possibly have an offsite impact.  Although such an instantaneous tank failure is very unlikely, various safety measures are in place to minimize the effects of such a failure.  All pipe and hose connections to the tank are protected by excess flow valves to prevent massive leakage in the event of a catastrophic line break.  Pressure gage connections are equipped with isolating valves, which can be closed off in the event of a guage failure.  The tank is equipped with a dual safety relief valve system consisting of two safety valves mounted on a three-way valve.  Each valve alone is sized to adequately protect the tank.  The alternate scenario for Anhydrous Ammonia was modeled as piping failure from the top of a horizontal cylindrical tank resulting in the release of gas through a 1/2 inch line.  The plume endpoint would be 0.12 miles and could possibly have an offsite impact.  In this event, safety procedures and equipment are effective in responding to and controlling the leak.  The staff is equipped and trained as a first response team in the event of a leak and the excess flow valve will shut in seconds.  LaRoche is now contracted to repair any leaks or failures in the tank.\n\nThe second alternate scenario was modeled for the accidental release of Chlorine.  This scenario was modeled as a release from a horizontal cylindrical tank with a release occuring through a 5/16 inch tube connected to a one-inch schedule 80 pip"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29604,
      "SummaryText": "e fed from four one-ton cylinders and a one-ton cylinder on the other end.  This scenario is based on a tubing failure or bad connections between the lines and the Chlorine Cylinders.  This type of leak may be isolated and stopped by shutting manual valves.  Once again, the staff is trained to manage this situation and in addition, the supplier has an on call  Hazardous Material Response Team who could respond quickly.  This has been mitigated by the installation of a scrubber system.\n\nThe general accidental release prevention program is based on training, education, and maintenance.  These three facets are supplied by either the supplier or in house during the monthly safety meetings.  The staff  must verify that a checklist has been completed prior to utilizing personal protective equipment (respirator).  The Anhydrous Ammonia Tank is inspected every three month.  The Chlorine Cylinders are inspected and tested by the supplier and the cylinders are inspected on site by the staff.\n\nBAWA has not experienced an accidental chemical release is five years.\n\nThe emergency response program consists of the first response from trained personnel and notification of both the supplier and the City of Baytown Fire Department.  The Fire Department has access to the emergency siren alert system.  The alert system is a set of sirens stationed throughout the city utilized by the city and indusry to alert the public in the event of a chemical release.  In addition, the public may tune in to AM 740 and AM 1610 for further instructions.\n\nRecent changes to improve safety is to have LaRoach Industries inspect and maintain the Anhydrous Ammonia storage tank.  Another change was the installation of a Chlorine monitor and scrubber system for the Chlorine storage area."
    }
  ]
}