{
  "FacilityID": 29628,
  "FacilityName": "Flexible Foam Products, Inc.",
  "FacilityStr1": "103 Power Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Archbald",
  "FacilityState": "PA",
  "FacilityZipCode": "18403",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42069",
  "LEPC": "Lackawanna County LEPC",
  "FacilityLatDecDegs": "41.484028",
  "FacilityLongDecDegs": "-75.536944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ohio Decorative Products, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 97234718,
  "Company2DUNS": 0,
  "OperatorName": "Flexible Foam Products, Inc.",
  "OperatorStr1": "103 Power Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Archbald",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18403",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Shortridge",
  "RMPTitle": "General Manager",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185257",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-02-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-02-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-02-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 41.48403,
  "FRS_Long": -75.53694,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "ADDRESS MATCHING-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 42941,
      "AltID": "Polyurethane Foam Manufac",
      "FacilityID": 29628,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43896,
          "ProcessID": 42941,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56664,
          "ProcessID": 42941,
          "ChemicalID": 44,
          "Quantity": 240000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556664,
          "ProcessID": 42941,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29628,
      "SummaryText": "BUSINESS CONFIDENTIAL\n\nEXECUTIVE SUMMARY\n\nFLEXIBLE FOAM PRODUCTS, INC.\n103 POWER BLVD.\nARCHBALD, PA 18403\n\nFlexible Foam, Inc. owns and operates a polyurethane foam manufacturing facility on 103 Power Boulevard.  Flexible Foam receives raw materials at its facility, mixes the materials to produce a polyurethane foam bun on a foam production line.  The foam is then cured and stored on site prior to shipping to customers.  Some limited fabrication takes place at the facility.  \n\nOne of the components used in the production of polyurethane foam is toluene diisocyanate (TDI).  This compound is subject to EPA?s Risk Management Rule.\n\nToluene diisocyanate is delivered to the 103 Power Boulevard facility in tank trucks.  The trucks are off-loaded to a storage tank located inside the building.  Because the storage of TDI takes place inside the building,  the probability of release of toluene diisocyante vapors into the atmosphere is reduced.  As a result, the impact of such a release on the surrounding community is minimized.  There are no inhabited receptors (buildings and people other than the Flexible facility) that would be impacted by the release of stored or unloaded toluene diisocyanate but undeveloped property beyond the property line to the East and South would be impacted by a worst-case scenario..  \n\nBecause there are no public receptors and there have been no significant incidents or releases in the last five years (it is a new facility), Flexible Foam, 103 Power Boulevard facility is classified as a \"Program 1\" facility.\n\n\n WORST-CASE SCENARIO\n\n\nChemical:\nTOLUENE DIISOCYANATE\n\nAssumptions:\n\n*    Catastrophic failure of a storage tank car, (releasing all contents within five minutes)\n\n*    Worst-case weather conditions (stable, low wind speed)\n\n*    Instantaneous release of entire contents of tank ( 10000 gallons. )\n\nDistance:    11 yards (33 feet)\n\nDescriptions:\n\nThis release scenario has a toxic level of concern end point that does not extend off Flexible Foam?s property."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29628,
      "SummaryText": "  Based on computer modeling (using an EPA-approved model) of a catastrophic release of TDI as described above, it would not impact any person standing or driving outside the boundary of the Flexible?s property.  Any person visiting or working at Flexible would be advised of the proper response action through the company?s emergency response procedures.\n\n\nSECTION 2.  TOXICS:  WORST CASE  EXPLANATION\n\nSection 2.6 release rate:\n\nFlexible Foam modeled with Aloha, the release rate calculated was 0.00184 pounds per minute. Since EPA's RMP submit program does not accept any value less than 0.1, a factor of 0.1 was entered because that is the lowest number that the RMP program would accept.  Based on the modeled release rate Flexible Foam is a Program 1 facility, independent of the value entered into RMP Submit.\n\nACCIDENT PREVENTION\n\nFlexible Foam, Inc. takes safety very seriously.  We use safety equipment and strict procedures to prevent releases and to reduce the impact of any release that might occur.  Some examples are:\n\n    -Regular equipment inspections and maintenance to ensure proper operation.\n    -Investigation of all incidents to improve our procedures.\n    -Secondary containment to ensure that the contents of hazardous material remain on site.\n    -Hazardous Waste and Hazardous Materials, Emergency Contingency Planning.\n    -Hazardous Materials Awareness Training\n\nEMERGENCY RESPONSE\n\nFlexible personnel are regularly trained and drilled on safety and accident prevention.  \nThe following agencies are in place to respond to a release of hazardous material.\n\n    -Archbald Volunteer City Fire Department \n    -PADEP Emergency Response Team\n    -Datom Products\n\n\nAt the Flexible Products, Inc. ( Flexible Foam) plant in Archbald, Pennsylvania, we handle toluene diisocyanate (TDI), which is considered hazardous and is regulated by the EPA.  The same properties that make TDI valuable for use at our facility also make it necessary to observe certain safety precautions in the handling of the subst"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29628,
      "SummaryText": "ance.  TDI is considered a toxic substance, and associated safety precautions have been implemented to (1) prevent unnecessary human exposure, (2) reduce the threat to the health of our employees at the Archbald, PA plant, and (3) reduce the threat to nearby members of our community.  It is our policy to adhere to all applicable federal and state rules and regulations.\n\nWe are committed to the safety of our employees and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Successful implementation of our accidental release prevention program will help ensure that emergencies are unlikely and reduce the likelihood that emergency response procedures will be needed.  Nevertheless, an emergency such as a release of TDI is possible.  We have emergency response procedures to help ensure that accidents will be mitigated properly without undue risk to the public, environment, employees, contractors, or other personnel within the plant.\n\nDescription of the facility and the regulated substances handled\n\nThe primary purpose of this facility is to produce polyurethane foam, which is sold to other facilities and is used to produce furniture, bedding, carpet padding and a number of other products.  TDI is one of the reactants required to produce our polyurethane foam.  TDI is received by railcar and by tank truck, and is stored in two indoor storage tanks.  The maximum quantity of TDI stored in the process (i.e., in storage tanks) at our plant is about 200,000 lb.  The TDI is piped to a mix head where it is mixed with other reactants to produce a slab of polyurethane foam.  The foam products are shipped to customers by truck.\n\nTDI is the only substance handled at our plant that is regulated by EPA?s risk management program (RMP) rule.  This substance is covered because the maximum quantity contained in our TDI process exceeds EPA?s threshold quantity of 10,000 lb for TDI.\n\nOffsite consequence analysis of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29628,
      "SummaryText": "release scenarios\n\nWe performed an offsite consequence analysis (OCA) to estimate the potential for an accidental release to affect the public or the environment.  The OCA consists of evaluating worst-case release scenarios and alternative release scenarios (ARS's).  We do not expect a worst-case release scenario to ever occur.  An ARS represents a release that might occur during the lifetime of a facility like ours.  ARS?s can help us to work with the local emergency planning committee (LEPC) to improve the community emergency response plan.\n\nThe main objective of performing the OCA is to determine the distance at which an accidental release might affect the public (the endpoint distance).  The following could occur at the endpoint distance: Most people at the endpoint distance of a toxic substance release like TDI would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the released substance could be incapacitated.\n\n    [Note: The following sections entitled \"Worst-case release scenario\" and \"Alternative release scenario\" are similar to those contained in EPA and industry guidance documents for risk management plans (RMPlans).  The EPA has decided not to include on the Internet the OCA data submitted in sections 2 ? 5 of the RMPlan.  In January 1999, the EPA also revised its guidance on the scenario sections of the Executive Summary to delete an earlier instruction to identify the distance to the endpoints.  The current guidance remains to describe each of the plant?s scenarios but it has been revised for the plant to indicate whether the release has offsite impact.  The following scenario sections conform to this EPA guidance.]\n\nWorst-case release scenario.  \nCatastrophic failure of a TDI storage tank, having a capacity of 100,000 lb of TDI, would be a worst-case release for a toxic substance becau"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29628,
      "SummaryText": "se that is the largest TDI container at the plant.  We assumed the release would occur at 100 ?F to be conservative and allow for a margin of error in release modeling.  We also assumed that the entire contents of the tank would be released indoors as a liquid, form a pool that would spread to cover an area of approximately 126.15 ft2, and evaporate to form a toxic cloud that could disperse downwind if it escaped the building enclosure.  The terrain was considered more urban than rural.  Refined dispersion modeling predicts that the distance from the Tank to the TDI toxic endpoint concentration of 1.0 ppm (0.007 mg/L) extends approximately 11 yards and does not reach beyond the plant?s property boundary.  Concrete containment is used to restrict the size of the puddle from of 60,000 ft2 to about one-fifth of that area.  The installation of the containment reduced the ALOHA Model toxic cloud footprint to 0.0062 mile (or 11 yards).\n\nThe general accidental release prevention program and specific prevention steps\n\nThe plant has implemented programs and procedures that comply with EPA?s Level 1 Accidental Release Prevention Program Rule, which specifies that we notify and coordinate with local emergency planning agencies.\n\nWe have coordinated with the Lackawanna County LEPC, the Archbald Fire Department and Datom Products (contracted professional emergency response firm), Through both meetings and telephonic communication.\n\n The TDI process at our plant has hazards that must be managed to ensure continued safe operation.  The prevention program outlined above is applied to the TDI process.  Collectively, these prevention program activities help prevent potential accidental releases that could be caused by equipment failures, human errors, and management system failures.\n \n In addition to the accidental release prevention program, our plant has safety features on many units to help (1) quickly detect a release, (2) contain or control a release, and (3) reduce the conseque"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29628,
      "SummaryText": "nces of or mitigate a release.  The following types of safety features are used in various units of the TDI process:\n \n? Release Detection \n \n? Process alarms (e.g., high level alarms and flow cutoff relays on the TDI storage tanks)\n? Continuous operator surveillance (e.g., during TDI tanker unloading and TDI supply to the foam process)\n \n? Release Containment/Control\n \n? Curbing or dikes to contain TDI liquid releases\n? TDI storage tanks located inside an enclosed building\n? Automated shutdown systems for critical process parameters (e.g., high pressure)\n? Pressure relief devices on equipment to prevent rupture\n? Valves to permit isolation of process equipment\n? Vapor displaced from storage tanks during unloading is vented through a carbon filter\n? Facility personnel in attendance whenever TDI is being transferred from a bulk delivery \n  vessel to storage tanks.\n \n? Release Mitigation\n \n? Fire suppression and extinguishing systems\n? Contracted trained emergency response personnel\n? Personal protective equipment (e.g., protective clothing, self-contained breathing \n  apparatus)\n \n Five-year accident history\n \n This is a new facility so we have had no releases of TDI in the last 5 years that resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.  \n \n Emergency response program\n \n Our emergency response program is based on the requirements in OSHA?s emergency action plan regulation, OSHA?s hazardous waste and emergency operations regulation, and EPA?s emergency response program requirements in its RMP rule.  Our program includes procedures for responding to a release of TDI.  Our procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29628,
      "SummaryText": "s, and post-incident cleanup and decontamination requirements.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary, based on modifications made to plant processes or other facilities.  Personnel affected by changes in the program are informed and trained on those changes.\n \n The emergency response plan for the plant is coordinated with the LEPC.  This coordination includes providing them with a copy of the ERP and a subsequent telephone call and invitation to tour the plant.  The plant has around-the-clock communications capability with the appropriate LEPC officials and emergency response organizations such as the fire department.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident."
    }
  ]
}