{
  "FacilityID": 29631,
  "FacilityName": "El Dorado Propane Terminal",
  "FacilityStr1": "1651 Haverhill Road",
  "FacilityStr2": null,
  "FacilityCity": "El Dorado",
  "FacilityState": "KS",
  "FacilityZipCode": "67042",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20015",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "37.799444",
  "FacilityLongDecDegs": "-96.880833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.oneok.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ONEOK, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7907827,
  "Company2DUNS": 7907827,
  "OperatorName": "ONEOK Field Services Company",
  "OperatorStr1": "P.O. Box 871",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74102",
  "OperatorZipCodeExt": "0871",
  "RMPContact": "Blaine F. Bender",
  "RMPTitle": "Operations Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166232",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Ownership Change (2004-02-23)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-03-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-02-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-02-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-01-26 00:00:00",
  "DeRegistrationEffectiveDate": "2007-03-14 00:00:00",
  "AnniversaryDate": "2005-09-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 37.79897,
  "FRS_Long": -96.88084,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility is now included in the RMP for Frontier El Dorado Refining Co.",
  "_processes": [
    {
      "ProcessID": 42946,
      "AltID": "Propane Storage Tanks",
      "FacilityID": 29631,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 43901,
          "ProcessID": 42946,
          "NAICSCode": "42271",
          "_desc": {
            "NAICS_CODE": "42271",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56669,
          "ProcessID": 42946,
          "ChemicalID": 155,
          "Quantity": 3350000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 40916,
              "ProcessChemicalID": 56669,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 40917,
              "ProcessChemicalID": 56669,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 40918,
              "ProcessChemicalID": 56669,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 556669,
          "ProcessID": 42946,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29631,
      "SummaryText": "Risk Management Plan\nEL DORADO PROPANE TERMINAL\nExecutive Summary\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe El Dorado Propane Terminal has a long-standing commitment to worker and public safety.  This commitment is demonstrated by our efforts in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will evaluate the situation, take actions within the capabilities of the facility, and/or notify the necessary outside agencies.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe El Dorado Propane Terminal is located at 1651 S. Haverhill Road in El Dorado, Kansas.  The El Dorado Propane Terminal provides drying, storage, and loading of liquid propane.  Propane is delivered to the facility by pipeline and is shipped from the facility primarily by truck and occasionally via pipeline.  The El Dorado Propane Terminal is able to store enough of propane to meet the minimum RMP reporting quantities.\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThe worst-case scenario (WCS) for the El Dorado Propane Terminal is a vapor cloud explosion involving the largest inventory of a flammable mixture (predominately consisting of propane) contained in a single pressurized storage vessel.  The maximum quantity possible contained within this storage vessel is 160,000 pounds.  Although administrative controls are in place to limit this quantity, those controls were not considered in calculating this maximum quantity determination.  The entire inventory of the storage tank is assumed to release, forming a vapor cloud, igniting and exploding - creating a Vapor Cloud Explosion (VCE).  Using RMP*CompTM, the maximum distance to the 1-psig overpressure endpoint is 0.4 miles.  Although there are numerous controls to prev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29631,
      "SummaryText": "ent such releases, and to manage their consequences, no credit for passive mitigation measures was taken into account in evaluating this WCS.\n\nThe alternative release scenario (ARS) that is used as a planning case at the El Dorado Propane Terminal is a 4\" diameter pressure relief safety valve lifts due to an overfill causing a release of pressurized propane to the atmosphere at a rate of 1,432 pounds per minute.  This particular ARS is assumed to last for 5 minutes before operation of isolation valves, pumps, deluge, shutdowns and/or other mitigating actions can be utilized to mitigate the release.  Under this ARS, the released propane vapor is accidentally ignited - causing a vapor cloud fire.  Using RMP*CompTM, the maximum distance to the Lower Flammability Limit endpoint for this ARS is 0.1 mile.  With a radius of 0.1 miles, this ARS would extend outside of the boundary of the El Dorado Propane Terminal.  This event was selected as being a practical scenario for use in emergency planning and response.\n\n\n\n GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \n \n  The following is a summary of the accident prevention program in place at the Facility.  The process at the El Dorado Propane Terminal is regulated by both the Environmental Protection Agency's (EPA's) risk management program (RMP) rule and the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard.  Because RMP accident prevention requirements for this process are essentially the same as PSM, this summary addresses each of the OSHA PSM elements, and describes the management system in place to implement the accident prevention program at the El Dorado Propane Terminal.  \n \n Employee Participation\n \n The El Dorado Propane Terminal encourages employees to participate in all facets of process safety management and accident prevention, including process hazard analyses, incident investigations, and the development of operating and maintenance procedures. Employees also part"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29631,
      "SummaryText": "icipate in safety meetings, resolving certain safety concerns, and updating and compiling technical documents and chemical information pertaining to the process and critical equipment.  \n \n Employees have access to all information created as part of the facility's accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in a written employee participation plan that is maintained at the El Dorado Propane Terminal.  This employee participation plan addresses each accident prevention program element.  \n \n Process Safety Information\n \n The El Dorado Propane Terminal keeps a variety of technical documents that are used to help maintain safe operation of the process.  These documents address chemical properties and associated hazards, limits for key process parameters and specific inventories, safety interlocks, suppression systems, vent and relief studies, and equipment design basis/configuration information. \n \n Chemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in material safety data sheets (MSDSs). For specific process areas, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the equipment specifications and operating procedures.  The El Dorado Propane Terminal maintains the process within these limits by using process controls and monitoring instruments, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n \n The El Dorado Propane Terminal also maintains technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29631,
      "SummaryText": "ities, as well as for evaluating proposed process and facility changes so safety features in the process are not compromised.\n \n Process Hazard Analysis (PHA)\n \n The El Dorado Propane Terminal has a comprehensive program to identify and control hazards associated with the various processes that are identified and controlled.  Within this program, the process is systematically examined to identify potential hazards and controls in place to manage these hazards, and recommend additional controls, as appropriate.\n \n The facility uses a variety and combination of applicable methodologies to conduct PHAs.  These PHAs address (1) facility siting, (2) human factors, (3) qualitative evaluation of a range of the possible safety and health effects of failure of controls on personnel, (4) and one or more of the following methodologies appropriate to determine and evaluate the hazards of the process (a) What-if; Checklist, (b) Hazard and Operability (HAZOP), (c) Failure Mode and Effects Analysis (FMEA), (d) Fault Tree Analysis, or (e) an appropriate equivalent methodology.  PHAs are conducted using a team of people who have operating and maintenance experience, as well as engineering expertise.  This PHA team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and then makes recommendations for additional prevention and/or mitigation measures. \n \n The PHA team recommendations are forwarded to local management for resolution. Implementation of additional prevention and/or mitigation options in response to PHA recommendations is based on a relative priority ranking assigned by the PHA team.  The approved prevention and/or mitigation options in response to PHA team recommendations are tracked until they are completed.  The final resolution of each recommendation is documented and retained.\n \n The El Dorado Propane Terminal periodically revalidates these PHAs.  These PHAs are revalidated at least every 5 years, and will "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29631,
      "SummaryText": "be conducted at this frequency until the process no longer contains hazardous chemicals above the threshold quantities.  The recommendations from these revalidated PHAs are also forwarded to management for consideration, and the final resolution of each revalidated PHA recommendation is documented and retained.\n \n Operating Procedures\n \n The El Dorado Propane Terminal maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate. In addition, the El Dorado Propane Terminal maintains information on how to respond to upper or lower limit exceedances for specific process or equipment parameters.  This information, along with written operating procedures, is readily available to operators and for other personnel to use as necessary to safely perform their job tasks.\n \n Training\n \n To complement the written procedures for process operations, the El Dorado Propane Terminal has implemented a comprehensive training program for employees.  New operational employees receive training on the El Dorado Propane Terminal's operating procedures and basic training in process operations, if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  T"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29631,
      "SummaryText": "his refresher training is conducted at least every 3 years, or more frequently upon request.  All of this training is documented for each operator, including demonstrated skills used to verify that the operator understood the training.  Process maintenance personnel are trained in their perspective duties for maintaining the mechanical integrity of critical process equipment and systems. Personnel also receive training on the procedures for conducting hot work permitting; management of change; and other appropriate safe work practices.  \n \n Contractors\n \n The El Dorado Propane Terminal uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the El Dorado Propane Terminal has procedures in place to verify that contractors perform their work in a safe manner.  These contractor safety procedures include steps to verify contractors (1) have the appropriate knowledge and skills to perform their jobs safely, (2) are aware of the hazards in their workplace, (3) understand what they should do in the event of an emergency, (4) understand and follow site safety rules and (5) inform facility personnel of any potential hazards that they introduce or find during their work.  Contractors working within the El Dorado Propane Terminal are provided with (1) a process overview, (2) information about safety and health hazards, (3) emergency procedure requirements, and (4) site-specific applicable safe work practices prior to their beginning work.  In addition, the El Dorado Propane Terminal evaluates contractor safety programs and performance prior to selection of a contractor.  El Dorado Propane Terminal personnel periodically monitor contractor performance with respect to their safety obligations, and provide contractors with applicable safety performance feedback.\n \n Pre-startup Safety Reviews (PSSRs)\n \n The El Dorado Propane Terminal conducts a PSSR for any new or "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29631,
      "SummaryText": "modified facility that requires a change in the process safety information.  The purpose of the PSSR is to see that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check that construction is in accordance with the design specifications and required safety systems are operationally ready.  A PSSR also verifies that appropriate safety, operational and maintenance procedures are in place, and adequate training has been provided to the appropriate personnel.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.  When new facilities are commissioned, a PHA is included in the PSSR.  \n \n Mechanical Integrity\n \n The El Dorado Propane Terminal has established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include (1) utilization of appropriately trained maintenance personnel, (2) developing written procedures, and (3) performing inspections and tests, and correcting identified deficiencies.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n \n Maintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner. Written procedures provide that work is performed in a consistent manner and serve as basis for training.  Inspections and tests are performed to help verify equipment functions as intended and that equipment is within acceptable limits.  If a deficiency is identified that presents an imm"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 29631,
      "SummaryText": "ediate safety concern, El Dorado Propane Terminal personnel will correct the deficiency before placing the equipment back into service. \n \n Safe Work Practices\n \n The El Dorado Propane Terminal has long-standing safe work practices in place to help provide worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to isolate energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to verify that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help perform operations and maintenance activities safely.\n \n Management of Change\n \n The El Dorado Propane Terminal has a comprehensive system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) determine that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, equipment information, and operating procedures are updated prior to incorporating these changes.  In addition, operating and maintenance personnel are provided necessary training on the change.\n \n Incident Investigation\n \n The El Dorado Propane Terminal promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal in"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 29631,
      "SummaryText": "jury.  The goal of each investigation is to determine the factors that may have led to the incident, and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its recommendations to prevent a recurrence, and forwards these recommendations to facility management for resolution.  Corrective actions taken in response to the investigation team's recommendations are tracked until they are complete.  The final resolution of each recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the recommendations.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations. \n \n Compliance Audits\n \n To help determine that the accident prevention program is functioning properly, the El Dorado Propane Terminal periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  Both hourly and staff personnel participate in these audits.  The audit team develops findings that are forwarded to facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.  \n \n SPECIFIC PREVENTION STEPS\n \n The process at the El Dorado Propane Terminal has potential hazards that must be managed for continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n \n Universal Prevention Activities\n \n The accident prevention program summarized previously is applied to the RMP-covered process at the El Dorado Propane Terminal.  Collectively, these preve"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 29631,
      "SummaryText": "ntion program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n \n Specialized Safety Features\n \n The El Dorado Propane Terminal has safety features to provide a means of controlling a release, detecting a release, and reducing the consequences of (mitigate) a release.  These safety features include:\n \n Monitoring and detection systems include (1) Operations personnel on site during operational hours, (2) Visual warning alarms for high and low vessel levels, and (3) Fire eyes.\n \n Process controls include (1) Relief devices to avoid overpressure of process equipment, (2) Valves to permit process control or isolation (manual or automated), (3) Emergency shutdown systems, and (4) Interlocks and automated shutdown systems for specific process parameters. \n \n Active and passive mitigation systems include (1) Fire extinguishing systems, (2) Emergency procedures to react to emergencies, and (3) Communications link with local El Dorado Fire Department and emergency planning committee (LEPC).\n \n Release mitigation systems include (1) Fire extinguishing, (2) Coordination with emergency response personnel, (3) Participation in central emergency response system (COMAS), and (4) Personal protective equipment (e.g., fire retardant clothing).                                                                                                                                                                         \n  FIVE-YEAR ACCIDENT HISTORY\n \n The El Dorado Propane Terminal has an excellent record of accident prevention over the past 5 years. The following table is a summary showing we have had no incidents that have occurred during the past 5 years. \n                                                                            1994  1995  1996  1997  1998  1999\nNumber of RMP Events with Onsite Effects         0        0        0        0        0        0\nNumber of RMP Events with Offsite Effects         0        0        "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 29631,
      "SummaryText": "0        0        0        0\n \n EMERGENCY RESPONSE PROGRAM INFORMATION\n \n The El Dorado Propane Terminal maintains a written emergency action plan, which is in place to help protect worker and public safety as well as the environment.  The plan identifies steps to be taken in case of an accidental release including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies. Employees receive training in these procedures as necessary to perform their specific emergency duties.  The emergency action plan is updated when necessary based on modifications made to the process or other El Dorado Propane Terminal facilities.  \n \n The overall emergency response program for the facility has been coordinated with the El Dorado Fire Department.  The El Dorado Propane Terminal also has a mutual aid agreement and coordinates with the Frontier Refining Co. El Dorado Refinery.  This coordination includes periodic emergency response drills and meetings with the local fire departments and Frontier Refining Co. personnel.  The El Dorado Propane Terminal is manned during working hours (11 hours a day - five days per week) and has communications capability with the local fire department, and the a central emergency response system (COMAS) based in Denver, Co.  This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident."
    }
  ]
}