{
  "FacilityID": 29728,
  "FacilityName": "Northwest Wastewater Treatment Plant",
  "FacilityStr1": "4801 N. STATE  HIGHWAY 13",
  "FacilityStr2": null,
  "FacilityCity": "SPRINGFIELD",
  "FacilityState": "MO",
  "FacilityZipCode": "65803",
  "Facility4DigitZipExt": "8562",
  "FacilityCountyFIPS": "29077",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "37.284222",
  "FacilityLongDecDegs": "93.341667",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": "www.ci.springfield.mo.us/egov/publicworks/sanitary/nw_plant.html",
  "FacilityEmailAddress": "cparrott@sbcglobal.net",
  "FacilityDUNS": 234992700,
  "ParentCompanyName": "City of Springfield, Mo",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CITY OF SPRINGFIELD, MO",
  "OperatorStr1": "4801 N. STATE  HIGHWAY 13",
  "OperatorStr2": null,
  "OperatorCity": "SPRINGFIELD",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65803",
  "OperatorZipCodeExt": "8562",
  "FTE": 5,
  "OtherEPAFacilityID": "MO-0103039",
  "EPAFacilityID": "100000118384",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-03-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-03-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-03-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-12-29 00:00:00",
  "DeRegistrationEffectiveDate": "2005-10-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 37.2875,
  "FRS_Long": -93.341389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "chemicals used for the disinfection of the plant will no longer be used",
  "_processes": [
    {
      "ProcessID": 43097,
      "AltID": "DISINFECTION",
      "FacilityID": 29728,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 56993,
          "ProcessID": 43097,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 56994,
          "ProcessID": 43097,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44053,
          "ProcessID": 43097,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 44054,
          "ProcessID": 43097,
          "NAICSCode": "23311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29728,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-12-01 00:00:00",
    "ERTrainingDate": "2003-10-26 00:00:00",
    "CoordinatingAgencyName": "Springfield Fire Department",
    "CoordinatingAgencyPhone": "4178641000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29728,
      "SummaryText": "Executive Summary\n  1a.  Introduction\nThe Northwest Wastewater Treatment Plant, operated by the City of Springfield, has a\ncapacity of 6.4 million gallons per day.  This Risk Management Plan (RMP) covers the\nsection 112 regulated substances maintained at the Northwest Wastewater Treatment\nPlant, which will be referred to here in as the Plant.\n\n  1b.  Background Information\nThis Contingency Plan describes procedures in place at the Northwest Wastewater\nTreatment Plant to minimize the possibility of an emergency situation.  This plan also\nprovides response procedures to be implemented in emergencies to minimize hazards\nto human health or the environment from any unplanned sudden release of hazardous\nchemicals to the air, soil or surface water.\nIt is necessary to amend the plan if:\n1.)  The applicable regulations are revised;\n2.)  The plan fails in an emergency;\n3.)  The facility design, constriction or operations changes significantly;\n4.)The list of emergency personnel changes; or\n5.)The inventory or location of emergency equipment changes.  \n\nThis plan is prepared in a format so that the information may be easily updated      and\nphotocopied for educational purposes.  This plan and all  revisions to the        plan are\nto be kept at the Plant and regularly updated throughout the        operating life of the\nfacility.\n  Contingency plan information is kept in the Control Room at Wastewater Treatment\nPlant.  Copies and updated information are provided to local authorities and emergency\nteams, as may be called upon, to provide emergency \nservice.\nAny questions concerning this plan should be directed to Ed Malter, Superintendent of\nSanitary Service at the\nSouthwest Treatment Plant\n3301 S. Hwy. FF\nSpringfield, MO.  65807\nor phone at 417-891-1600 Ext 121.\n\n\n\n\n\n\n\n\n\n\n\n  1c.  Plant Description\nThe Wastewater Treatment Plant is an activated sludge plant designed to handle 6.5\nMGD.  The Plant maintains two regulated substances on site:  chlorine and sulfur\ndioxide.  These"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29728,
      "SummaryText": "chemicals are used for disinfection and de-chlorination.  The\nmaximum chlorine stored on site is 16,000 pounds, which exceeds the RMP\nthreshold quantity of 2,500 pounds for chlorine.  The maximum sulfur dioxide stored\non site is 8,000 pounds, which exceeds the RMP threshold quantity of 5,000 pounds\nfor sulfur dioxide.  The storage and management of both chlorine and sulfur dioxide\nare addressed in this RMP.  The Plant is located at   4801 N. State Highway 13,\nSpringfield, Missouri, which is a rural area.  The surrounding area includes some\nscattered residences.  The Plant is about 2.5 miles north of Interstate Highway 44,\nthe main highway that leads into Springfield and .25 miles off the west side of State\nHighway 13.\n\n  1d.  Accident History\nThe Plant has had no chlorine or sulfur dioxide releases in the past 5 years.  In the\n28 years, chlorine has been used for disinfection at the Northwest Treatment Plant,\nthere have been no releases that would have required this contingency plan to be\nimplemented.\n\n\n\n2.  The Worst Case Release Scenario\nThe worst-case release scenario for chlorine was calculated as the release of a\nsingle one-ton cylinder in accordance with the definition provided in the\nEnvironmental Protection Agency guidance for RMP development.  Only passive\ncontrol systems can be considered for the worst-case release, such as the\ncontainment provided by a building.  The conditions of the scenario, such as release\ntime and weather status are those provided in the EPA Off-site Consequence\nAnalysis Guidance.  The area of potential impact was determined using RMP*Comp\nmodeling software developed by the EPA.\n\nThe results of the worst case Off-Site Consequence analysis indicated that the\nchlorine would travel approximately 2.2 miles under the specified weather conditions\nbefore dispersing in the atmosphere to a harmless concentration.  The sulfur dioxide\nwould travel approximately 2.1 miles before dispersing to a harmless concentration. \nSince the toxic endpoint f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29728,
      "SummaryText": "or the chlorine release is farther away, it was used at the\nworst case scenario.  Within that radius of the Plant, an estimated 1,540 persons\ncould potentially be affected.  Maps of the area and a list of the types of receptors in\nthe potential impact area are provided in the Off-Site Impact Analysis Section.\n\n\n\n\n\n  2a.  The list of potential receptors includes:\na.  Head Start, OACAC (School)\nb.  Ritter Springs (Park)\nc.  SAC River Bike Trails (Park)\nd.  Fantastic Caverns (Park)\ne.  Glidewell Baptist Church\nf.   Montgomery Metal\ng.  Crossroads General Store\nh.  Carpet Barn\ni.   George Carden Circus\nj.   Sac River Stables\nk.  Fulbright Water Treatment Plant\nl.   Police Firing Range\nm. Dog Pound\nn.  Fire Department Training Center\nq.  All Star Gas\n\nThis type of release would only occur if the cylinder valve was broken off, or the\ncylinder was breached.  The likelihood of such an incident occurring is minimal.\n\n\n\n3.  Alternative Release Scenario\nThe alternative release scenario is, by definition, a more likely release scenario than\nthe worst case.  Engineered controls, such as detection systems, automatic tank\nshutoff valves, alarms, or scrubbers are considered in the analysis.\n\n   The type of system failure selected for the chlorine alternative release was the loss\nof chlorine due to a break in the flexible tubing leading from the cylinder to the\nvacuum regulator.  The chlorine would leak from a 3/8\" opening.  The leak would\ncontinue until the chlorine detection alarm sounded and the valve on the cylinder\ncould be closed. The automatic tank shutoff valves would close in less than 5\nseconds after alarm was activated.  Because chlorine would have leaked into the\nchlorine room, the Springfield Fire Dept. would respond according to their\nprocedures for a toxic chemical release.  The time for the response was estimated at\n10 minutes for the first Fire Department truck to be on the site.  The time for the\nresponse was estimated at 15 minutes for the first Fire Department Ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 29728,
      "SummaryText": "z-Mat truck to\nbe on the site.  Once on site, the fire response personnel would enter the room in\nprotective clothing and close the valve on the leaking cylinder. \n\n   The type of system failure selected for the sulfur dioxide alternative release is very\nsimilar to chlorine release because the two chemicals are stored in identical tanks\nand are applied with the same type of feed equipment.  The scenario was the loss of\nsulfur dioxide due to a break in the flexible tubing leading from the cylinder to the\nvacuum regulator.  The chemical would leak from a 3/8\" opening.  The leak would\ncontinue until the detection alarm sounded and the valve on the cylinder could be\nclosed.  Because sulfur dioxide would have leaked into the room, response would be\nmade by the Springfield Fire Department according to their procedures for a toxic\nchemical release.  The time for the response was estimated at 10 minutes.  Once on\nsite, the fire response personnel would enter the room in protective clothing and\nclose the valve on the leaking cylinder.\n    The results of the Alternative Release Off-Site Consequence Analysis using\nRMP*Comp, indicated that the chlorine would travel approximately 0.7 miles under\nthe specified weather condition in order to disperse in the atmosphere to a harmless\nconcentration.  Within the larger of these two distances from the Plant, an estimated\n100 persons could potentially be affected.  Maps of the area and a list of types of\nreceptors in the potential impact area are provided in the Off-Site Impact Analysis\nSection.  The list of potential receptors includes: \n \n\n  3a.  The list of potential receptors includes:\n      a.  Ritter Springs (Park)\n      b.  Carpet Barn\n      c.  All Star Gas\n      d.  Sac River Trail\n                                      (See area map included)    \n       \n              \n4.       Process Hazard Assessment\nA process hazard assessment was performed on the chlorine and sulfur dioxide\nsystems beginning with cylinder unloading and endi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 29728,
      "SummaryText": "ng with each chemical in\nsolution.  A combination checklist and modified a what if type of analysis was used. \nGeneral questions regarding the storage and use areas as well as practices and\nprotocols associated with the management of the chlorine and sulfur dioxide system\nwere answered.  A copy of the checklist is including in this plan.  Following the\nchecklist, each system was methodically evaluated valve by line from the cylinder to\npoint of chlorine injection using system flow diagrams (see flow diagrams 1, & 2). \nThe valves and other points in each system where the chemical could be released\nare numbered on the flow diagrams.  The assessments are formatted in accordance\nwith code requirements; considerations of potential failure, maintenance and\ninspection concerns, and standard operation procedures were reviewed for each\npoint in the system.  Comments are summarized in the Process Hazard Assessment\nsection.\n\n  4a.  Prevention System\nThe Plant has an operation, maintenance, and inspection system designed to review\neach element of the chlorine and sulfur dioxide systems routinely.  There are\nOperation and Maintenance manuals for each major piece of equipment, and\npersonnel receive significant training before being allowed to work on the system.  At\nthe beginning and end of the daily operating period, and as each cylinder is\nchanged, the valves and piping are checked for leaks.  There are standard operating\nprocedures (SOP) for startup, shutdown, normal operation, and emergency\noperation.  The SOPs are written and posted in appropriate areas.  Personnel are\ntrained routinely on safety concerns and general operation as well as emergency\nprocedures.\n    Each system is equipped with leak detectors and alarms that indicate leaks, air\noperated shout off valves activated by alarm condition or power failure.  Exhaust\nfans are provided on each chemical storage room and used only when a worker is\npresent.  Exhaust fans are equipped with an automatic setting that shuts off"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 29728,
      "SummaryText": "exhaust\nfans in the case of a leak to confine the chemical to the storage area.\n       \n5.  Emergency Response Plan\n  5a.  Alarm Condition:\nIn the event the chlorine gas content in ambient air reaches or exceeds the alarm\nlevel of the gas detectors, external alarm circuits are energized.  Red alarm light\ngoes on outside of the room with the alarm condition, audible alarms sound.  Alarm\nlights and audible alarm in the main office are also activated. Air operated motors\nclose the tank valves. \n    During times the Plant is not staffed, Atlas Security is notified by phone line from\nthe Plant PLC, in the Operations building.  Atlas Security is able to tell the\ndifferences between an intruder, mechanical and chemical alarm.\nThe alarm will continue to sound even after the alarm condition has been\nacknowledged every fifteen minutes for two seconds at a time, until the chlorine is no\nlonger at alarm levels and the detectors are able to be reset.  If the chlorine gas level\nin the atmosphere has not decreased below the alarm level, pressing the reset\nbutton will not extinguish the Red alarm light or audible alarms.  After all chlorine gas\nhas been removed from the atmosphere, wait 4-5 minutes or more to allow the\nchlorine in the sensor to completely dissipate before resetting the detector.  When\npressing the reset button, do not hold the button in for more than one second or the\ndetector may not reset.  If after the gas has dissipated, the detector cannot be reset\nand placed back in service, contact your supervisor.\n            \n  5b.  Emergency Response Program (40CFR 68.180)\nImplementation of the Emergency Response Plan requires notification of the list of\nfederal and state agencies to which the stationary source is subject.\n\n  National Response Center at telephone number...1-800-424-8802\n           Missouri DNR at telephone number      ..1-573-634-2436\n        (Emergencies only.  Operates 24 hours a day)\n            EPA Region VII at telephone number     ...1-913-281-0991"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 29728,
      "SummaryText": "Greene County LEPC at telephone number   ....417-869-6040\n            CHEMTREC (if needed) at telephone number  .1-800-424-9300\n\n     Information from the North American Emergency Response Guidebook\n     related to chlorine and sulfur dioxide is provided in Appendix A.\n\n  5c.  Cities Responsible Individuals\n\nRMProgram Element\nResponsible Employee\n\n                    Overall Responsibility:\n                        Program Manager\n                           Ed Malter\n                               \n                Alternative RM Program Manager\n                        Charles Parrott\n                               \n                      Safety Information\n                          Jim Noblitt\n                               \n                         Hazard Review\n                          Jim Noblitt\n                               \n                     Operating Procedures\n                        Charles Parrott\n                               \n                           Training\n                        Charles Parrott\n                               \n                          Maintenance\n                           Mark Ryan\n                               \n                       Compliance Audits\n                          Jim Noblitt\n                               \n                    Incidence Investigation\n                          Jim Noblitt\n                               \n                Emergency Planning and Response\n                          Jim Noblitt\n                               \n                  RM Plan Updates (5 year and changes)\n                           Ed Malter\n\n\n\n                               \n                               \n                               \n                               \n  5d.  Hazardous Chemicals at the Wastewater Treatment Plant\n A list will be kept at the Plant of chemicals with corresponding Material Safety Data\nSheets, for processes associated with wastewater treatment whether used in large or\nsmall quantities."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 29728,
      "SummaryText": "The list will include location of the chemicals at the facilities.  See\nappendix for list and locations of chemical.  The facility drawings of each building\nshow location of the chemicals and safety equipment.\n  5e.  Emergency Plan Procedures\n In the event an emergency chemical release situation develops at the \nfacility, the following procedures will be followed:\n\n1.)  During normal hours when Plant staff are present:  In the event of an\nemergency situation, call 911 immediately, to alert the Springfield Fire Department\nthat a chemical release (indicating what type of chemical has been released) has\noccurred at Springfield's Northwest Treatment Plant.  Then Plant staff will appraise\nthe leak conditions, wind direction to determine if the site needs to be evacuated\nimmediately upwind and to higher ground.  Plant staff will then proceed down the\nEmergency Call List notifying the appropriate city staff, while continuing to monitor\nthe environmental conditions.\n\nAll City Fire Department and Haz-Mat team personnel listed as Emergency\nResponse Personnel are thoroughly familiar with Contingency Plans, the location\nand characteristics of hazardous chemicals, the location of all records within the\nfacility, and the facility layouts.\n\n    All City Plant personnel listed as Emergency Response Personnel are to be Haz-\nMat certified to Operational level and are thoroughly familiar with all aspects of the\nfacility's Contingency Plans, all operations and activities at the facility, the location\nand characteristics of hazardous chemicals, the location of all records within the\nfacility, and the facility layouts.  The Emergency Coordinators have authority to\ncommit resources of the City to deal with emergencies at the facility and if more\nappropriate to the situation, will summon help from other employees.\n\n\n6.  Implementation of the Contingency Plan Assessment \nAll employees at the Northwest Treatment Plant are required to be Haz-Mat certified\nto Operational level and will respon"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 29728,
      "SummaryText": "d and assist as training allows.  Any response\nrequiring entry into a dangerous atmosphere or use of a chlorine tank repair kit is to\nbe managed by the Springfield Fire Department Haz-Mat team.  The Plant has an\nagreement with the Springfield Fire Department; a copy of this agreement is\nincluded.  The decision to implement the Contingency Plan will be made if it is\ndetermined that the conditions are unsafe during the hours staff is on duty or if the\nalarm conditions occurs during time when the Plant is not manned.\n     The Springfield Fire Department will assume control when arriving at the Plant.\nThe Fire chief on the scene or senior Haz-Mat official on scene will be the on-scene\nIncident Commander.  Plant and Public Works staff will assist as required.\n\nThe Contingency Plan shall be implemented due to a SPILL or CHEMICAL\nRELEASE if:\n1.)  The spill or leak endangers human health or the environment , on-site or off-        \n  site.\n2.)  The spill or leak could result in on-site or off-site soil contamination and/or            \n    ground or surface water contamination.\n3.)  The spill or leak could release toxic or flammable liquids or vapors, thus               \n  causing a fire or gas explosion hazard.  The potential exists for incompatible          \nchemicals to come in contact with each other. \n\nWhen the decision is made to implement the Contingency Plan, the \nEmergency Coordinator or designee will direct or complete the directions outlined in\nthe following sections of this plan, which describes procedures, emergency\nequipment, coordination agreements, and evacuation plans.\n\n  6a.  Contingency Plan Implemented\nIf the Contingency Plan must be implemented, the Emergency Response Personnel\nwill initiate the following procedures:\n1.)  Evaluate the circumstances of the alarm condition.  Greene Country    Sheriff\nDepartment may be needed for evacuation of surrounding area. The Emergency\nResponse Personnel will immediately identify the characteristics, source, amount,\na"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 29728,
      "SummaryText": "nd area extent of the release.  Because hazardous chemicals are stored in distinct\nareas and because drum or other contents are labeled, the chemicals involved and\naffected by the emergency situation should be readily identifiable.\n\n2.) If Springfield's Fire Department has arrived, they will have assumed control. \nPlant personnel will assist as needed.  If the Fire Department has not arrived,\nproceed to the next step.\n\n3.) City staff responding from Atlas Security call will proceed to the Plant, and will,\nafter evaluating wind direction (the wind sock is located South East of the chlorine\nbuilding mounted under the light on a 30 foot light pole, be visible at night from\noutside the plant) and other environmental conditions.  Assure that all appropriate\ncity and county responders on the Emergency Call List have been notified.\n\n (The Emergency Response Personnel should be called in the order they are\nlisted.  (Charles Parrott, Ed Malter, Jim Noblitt, the LEPC, etc.)\n\n4.) Isolate area, set perimeters, deny entry to all non emergency personal . \nEvacuate the area, affected building (s) or, if necessary, the entire facility.  Proceed\nUPWIND and OUT OF LOW AREAS.  Evacuate area as needed to higher ground up\nwind.\n5.) If equipment systems are involved, shut them down if such action can be done\nwithout putting personnel at risk.\n\n  6b.  Identification of Hazardous Chemicals\n1.)  During the emergency the Emergency Response Personnel shall undertake all\nreasonable measures necessary to ensure that discharges do not spread to other\nhazardous chemicals at the facility.  These measures may include, stopping\nprocesses and operations, collecting and containing released chemicals and\nremoving or isolating containers.\n2.) Immediately after an emergency, the Safety Coordinator should provide for\ncontaining and disposing of recovered chemicals, contaminated soil or surface water\nor any other material that results from the discharge.\n3.)  No chemical waste that may be incompatible with"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 29728,
      "SummaryText": "the released chemical is stored\nat the facility until clean-up procedures are completed;\n4.)  Emergency equipment listed in the Contingency Plan is to be leaned and fit for\nits intended use prior to resuming normal operations.\n\n  6c.  Notification\n1.) If a facility ceases or changes operation in response to a discharge, the\nSupervisor or plant personnel shall notify DNR about changes in operating\nconditions.   Ed Malter or appropriate personnel shall be responsible for notifying:\n           Missouri DNR at telephone number     .1-573-634-2436 \n2.) The Springfield Safety Coordinator, John Strahl 417-864-1652, or appropriate\nsafety person must notify the appropriate state and local authorities that the following\nhave been compiled with, in accordance with 40 CFR 265.56:  \nNational Response Center at telephone number .1-800-424-8802  \nEPA Region VII at telephone number      .....1-913-281-0991  \n\nWithin legal limits (from 24 hours to 15 days, depending on the release) the Risk\nManager shall submit a written report of the event to all appropriate agencies.  The\nwritten report shall include: \n a.  Name, address, and telephone number of owner and operator.  \n b.  Name, address, and telephone number of facility.\n c.  Date, time, and type of accident.\n d.  Type and quantity of chemicals involved. \n e.  The extent of injuries (if any) or possible hazards to human health or\n  environment outside of the facility. \n             f.  The estimate of quantity and disposition of hazardous chemicals that          \n              resulted from the incident. \n             g.  Assessment of actual and potential hazards.\n\n\n  6d.  Emergency Spill Control\nEmergency Spill or Leak Control Procedures to follow after 911 and Emergency\n     1.     Summon emergency medical services if necessary by dialing 911.\n     2.     Report the spill to the Assistant Safety Coordinator Jim Noblitt by calling\n     work number 864-1137, cell phone number 880-3189 or home number 737-\n     8126.\n     3.     Go"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 29728,
      "SummaryText": "vernment Emergency Notification Telephone Numbers\n     The Safety Coordinator shall notify, as appropriate:\n                _Greene County LEPC        ...417-869-6040\n                _National Response Center     ...1-800-424-8802\n                _Missouri DNR           ..1-573-634-2436\n          (Emergencies only.  Operates 24 hours a day)\n          _EPA Region VII          ...1-913-281-0991\n          _CHEMTREC (if needed)       1-800-424-3900\n     4.     If the spill/leak is small, take appropriate action to contain the flow of the gas\n     or liquid.  Trained personnel wearing appropriate chemical protective gear\n     should only attempt this action.\n     5.     Provide information to the Fire Department and Haz-Mat Team, upon their\n        arrival, concerning the spilled/leaking chemicals (s).  Upon arrival the Fire     \n  Department or Haz-Mat unit will be in charge.  Public Works safety                  \n  personnel and Plant personnel will work with Fire Department to insure           spill\n  containment, process needs and reporting needs.\n     6.     Haz-Mat Team wearing appropriate protective gear should conduct air\n     monitoring to identify hazardous vapor or particulate concentrations in the\n     area.  The Safety Coordinator and local government officials should consider\n     off-site evacuation of the public.\n     7.     Efforts to contain the spill/leak should be initiated or continued, if applicable.\n     Only trained and properly clothed personnel should attempt these actions.\n     8.     Pump large amounts of contained chemical to drums for disposal.  Small\n      quantities of the chemical can be absorbed and placed in drums for                  \n  disposal.  Trained personnel wearing appropriate protective gear should            \n  only attempt this action.\n     9.     Clean all contaminated surfaces, including drums, containment structures, \n     containers and ancillary equipment.  Clean-up personnel must wear            \n     appropriate prote"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 29728,
      "SummaryText": "ctive gear.\n     10.    Decontaminate all response personnel protective gear, equipment, and\n     apparatus.  Wearing of appropriate protective gear is required during\n     decontamination operations.\n\n\n7.  Post-Incident Procedures\n    The Safety Coordinator must record every spill on the Supervisor=s Incident\nInvestigation Report.  The Risk Manager along with Safety Coordinator and the Plant\nmanagement will review the report to determine what action should be taken to\nprevent similar occurrences in the future.  Other reports are required by law and are\ndiscussed in subsequent paragraphs.\n\n  7a.  Floods  \n    The hazardous chemicals management activities at the Wastewater Treatment\nPlant are located outside the 500-year flood plain; therefore; exceeding the flood\nstage will be dealt with on a case-by-case basis.\n\n  7b.  Evacuation Plans\n   In an uncontrolled emergency, all persons are to be evacuated from the area. \nEvacuation should proceed UPWIND AND OUT OF LOW AREAS.  The Plant\nintercom system will be used to notify all personnel of the emergency.  Operators are\ntrained in what equipment and systems may need to be shut down.  During\nevacuation, a check by the supervisor must be made to ensure that all personnel are\naccounted for and out of the dangerous area.\n    Information from the North American Emergency Response Guidebook related\nto evacuation distances, is provided in Appendix A.\n\n  7c.  Record Keeping and Reporting\nEmergencies are recorded and maintained as part of the operating record. \nLeaks/spills or other incidents are recorded on a Supervisor's Incident Investigation\nReport form and are filed as required.  A spill or releases, if of a minor or controllable\nnature, will not necessarily require implementation of the Contingency Plan.\n    If full implementation of the Contingency Plan is implemented, then within \n 15 days or statutory limits of full implementation of the Contingency Plan, the Risk\nManager shall submit a written report to the appropriate"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 29728,
      "SummaryText": "agencies.  The report shall\ninclude the following information:\n            > Name, address, and telephone number of facility, owner and operator.\n            > Date, time and type of accident\n            > Type and quantity of chemicals involved.\n            > The extent of injuries (if any) or possible hazards to human health or             \n          environment outside the facility.\n            > The estimate of quantity and disposition of hazardous chemicals that             \n          resulted from the incident.\n            >  Assessment of actual and potential hazards.\n\n8.  Preparedness and Hazard Communication\n       New personnel hired are trained in recognizing hazardous situation. \n       Proper use of protective gear, to include the SCBA, emergency response\n       measures and emergency telephone numbers.  New personnel will be\n       trained and certified to the Haz-Mat operations level.\n       \n       8a.  Primary Local Phone Numbers\nA.  Primary\n  Ed Malter, Superintendent of Sanitary Services\n2201 S. State Highway FF (During office hours)\nSpringfield, MO  65807\n417-891-1600 (Ext. 121 Office); 417-581-1454 (Home)\n417-832-3600 (Pager); 417-840-9501 (Cell)\n\n\n\n\nCharles Parrott, Plant Shift Supervisor\n4801 N. State Highway 13 (During office hours)\nSpringfield, MO  65803\n417-833-0697 (Office); 417-832-9959 (Home)\n417-868-1489 (Pager)\n\nJohn Strahl, Occupational Health\n840 Boonville (During office hours)\nSpringfield, MO  65802\n417-864-1652 (Office); 417-881-1158 (Home)\n\nJim Noblitt, Safety Technician\n1226 W. Nichols (During office hours)\nSpringfield, MO  65802\n417-864-1137 (Office); 417-732-8126 (Home)\n417-880-3189 (Cell Phone)\n\n      B.  Local Emergency Notification Telephone Numbers\n       a. Springfield Fire Department:  Dial 911\n       b.  Ambulance:  Dial 9113\n       c.  Springfield Police Department:  Dial 911\n       d.  Springfield Safety Coordinator, 417-864-1652 (Office)\n       e.  Greene County Sheriff:  Dial 911 or 417-868-4040 (Non-emergency)"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 29728,
      "SummaryText": "C.  Emergency Responders\n      Police Department                                              \n      321 E. Chestnut Expwy.\n      Springfield, MO  65802\n      Emergency Dial 911\n      Non- emergency dial 417-864-1810\n\n      Greene Country LEPC\n      833 Boonville Ave\n      Springfield, MO  65802\n      Emergency Dial 911      \n       Non- Dial 417-869-6040.\n\n      Springfield Fire Department \n      830 Boonville Ave\n      Springfield, MO  65802\n      Emergency Dial 911\n      Non- Emergency Dial 417-864-1500\n\n\n      Greene Co. Sheriffs Dept. Boonville\n      1010 Boonville \n      Springfield, MO  65802\n      Emergency Dial 911\n      Non- Emergency Dial 417-868-4040        \n\n      9.  Arrangements with Local Authorities\n     The requirements of 40 CFR 265.37 call for the Treatment Plant to make\narrangements to familiarize police, fire departments, and emergency response teams\nwith the layout of the facility, properties of the hazardous chemicals at the facilities,\nplaces where personnel would be normally working, entrances to and roads inside\nthe Plant, and possible evacuation routes.  To fulfill this responsibility, the City of\nSpringfield, MO.  Has sent a copy of this Contingency Plan to the Police and Fire\nDepartments, Greene County Sheriff Department, Local Emergency Planning\nCommittee and invited them to visit the plant and discuss its operation in more detail. \nThe police, fire departments and Local Emergency Planning Committee will be\nnotified of any subsequent changes made to this Contingency Plan."
    }
  ]
}