{
  "FacilityID": 29731,
  "FacilityName": "Shoal Creek Filter Plant",
  "FacilityStr1": "1755 Buford Dam Road",
  "FacilityStr2": null,
  "FacilityCity": "Buford",
  "FacilityState": "GA",
  "FacilityZipCode": "30518",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13135",
  "LEPC": null,
  "FacilityLatDecDegs": "34.145",
  "FacilityLongDecDegs": "-84.0425",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": "www.co.gwinnett.ga.us",
  "FacilityEmailAddress": "spiveyne@co.gwinnett.ga.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Gwinnett County Department of Public Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gwinnett County, GA",
  "OperatorStr1": "1755 Buford Dam Road",
  "OperatorStr2": null,
  "OperatorCity": "Buford",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30518",
  "OperatorZipCodeExt": null,
  "RMPContact": "Neal Spivey",
  "RMPTitle": "Director of Water Production",
  "FTE": 73,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185505",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-03-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-03-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-03-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 34.145,
  "FRS_Long": -84.0425,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43100,
      "AltID": "Chlorine Storage Facility",
      "FacilityID": 29731,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44058,
          "ProcessID": 43100,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 56997,
          "ProcessID": 43100,
          "ChemicalID": 62,
          "Quantity": 82000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 556997,
          "ProcessID": 43100,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29731,
      "SummaryText": "Chlorine is used as a disinfectant at the Shoal Creek Filter Plant to protect consumers from potentially harmful microorganisms (such as Giardia, Legionella, coliforms, viruses, etc.) that may be present in the raw water supply (Lake Lanier).  Although the use of chlorine has been known to produce various regulated disinfection by-products in the finished water, the use of chlorine is required by the Safe Drinking Water Act and by the Georgia Environmental Protection Division (GAEPD).  Disinfection by-products associated with chlorine are  below the regulated levels as regulated by the Stage 1 Disinfectants/Disinfection By-Products Rule and water quality criteria established by the Georgia Environmental Protection Division.\n\nThis RMP provides process safety information, process hazard analysis, employee training, standard operating procedures, safe work practices, information on the contractor safety program, and emergency response related to the Shoal Creek Filter Plant Chlorine system.\n\nChlorine is delivered to the Shoal Creek Filter Plant in one-ton chlorine containers by a chemical supplier.  Under normal operating conditions, the Shoal Creek Filter Plant will have up to 41 tons (16 in service and 25 in storage) of chlorine at any given time.  These chlorine containers are connected to a pipeline system (designed exclusively for the transport of chlorine gas) and delivered to four chlorinators.  The chlorinators operate under vacuum conditions and deliver chlorine gas to a chlorine injector.  The injector mixes the chlorine gas into a water stream that makes a concentrated chlorine solution.  The chlorine solution is then applied to the appropriate application point at the water treatment plant to insure adequate disinfection is provided as required by the Surface Water Treatment Rule.  A chlorine residual is also maintained in the distribution system to protect the system from potential outside contamination and to control microbial populations within the syste"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29731,
      "SummaryText": "m.  \n\nAccidental chlorine releases can be caused by a multitude of reasons.  In the event of a chlorine release (either small or large) employees are routinely trained on how to safely retain chlorine releases.  The plant also has a detailed standard operating procedure (SOP) that clearly identifies how to unload chlorine containers, hook up chlorine containers, startup the chlorinators, and how to disconnect chlorine containers.  In addition to the above, employees are required to conduct walk through inspections of the chlorine facilities 12 times a day (every 2 hours) and document any potential problems that may occur.\n\nThe RMP defined alternative release case, which represents the most realistic chlorine release scenario, will result from a break in the chlorine gas transfer line with a simultaneous failure of a cylinder emergency shut-off valve and the scrubber system .  This release may produce a release rate of 185 pounds a minute for a duration of 10.8 hours and will produce a toxic endpoint of 0.2 miles.  This area is entirely within the Shoal Creek Filter Plant site.  To prevent this from occurring, all chlorine gas cylinders have emergency shut off valves and  numerous closure valves located at strategic locations that would provide containment of this type of release.   Chlorine monitors and alarms are also present that will promptly alert the operators that a chlorine release is occurring, and would start the emergency scrubber system that is designed to handle a 2000 lb release.   It is estimated that approximately 10 people could be potentially exposed to chlorine levels that may cause illness or physical damage under this alternative release case.\n\nIn the event of a chlorine release, an emergency response plan has been developed that identifies the operational and managerial procedures used to evaluate and determine if a plant evacuation is necessary.  The plan addresses the procedures for responding to minor and major chlorine releases and describes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29731,
      "SummaryText": " evacuation plans for the employees, contractors, and visitors, at the Shoal Creek Filter Plant."
    }
  ]
}