{
  "FacilityID": 2975,
  "FacilityName": "CATAWBA RIVER POLLUTION CONTROL FACILITY",
  "FacilityStr1": "1000 VINEARDEN RD",
  "FacilityStr2": null,
  "FacilityCity": "MORGANTON",
  "FacilityState": "NC",
  "FacilityZipCode": "28680",
  "Facility4DigitZipExt": "3448",
  "FacilityCountyFIPS": "37023",
  "LEPC": "Burke County LEPC",
  "FacilityLatDecDegs": "35.778333",
  "FacilityLongDecDegs": "-81.660556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CITY OF MORGANTON",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF MORGANTON",
  "OperatorStr1": "PO DRAWER 3448",
  "OperatorStr2": null,
  "OperatorCity": "MORGANTON",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28680",
  "OperatorZipCodeExt": "3448",
  "RMPContact": "DON DANFORD",
  "RMPTitle": "DIRECTOR OF WATER RESOURCES",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014067",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-05-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.77861,
  "FRS_Long": -81.66528,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3319,
      "AltID": "CHLORINE",
      "FacilityID": 2975,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3387,
          "ProcessID": 3319,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3540,
          "ProcessID": 3319,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503540,
          "ProcessID": 3319,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 2975,
      "SummaryText": "The Accidental Release Prevention and Emergency Release Policies at the Stationary Source.\n The City of Morganton's Catawba River Pollution Control Facility uitilizes chlorine to disinfect the treated wastewater as it leaves the facility.  Chlorine is the only chemical that Morganton uses in the threshold quantities as it pertains to 40 CFR Part 68.130 Table 1. This document is intended to satisfy all requirements for the Risk Management Plan Clean Air Act 112(r).  Morganton has adopted emergency response plans as well as revising the Process Safety Management Plan.\n\nThe Stationary source and regulated substances handled\n     Chlorine is the only regulated chemical on the plant grounds, two ton cylinders are used at one time.\nMaximum storage on site would be 16,000 pounds.  There are chlorine sensors and alarms which are connected to computer monitoring system located in the operator's control room.  One ton cylinders are stored in a building with a built up roof and no walls and  therefore no barriers to leakage.  There is a chlorination room where the chlorinators feed and monitor, flows and chlorine being fed. One alarm is located in the building with the chlorinators and one is located oustide of the building.\n\nWorst Case Release and Alternate Scenarios Including Mitigation Measures to Limit the Distances for Each Reported Scenario.\nBy the regulations worst case is a release caused by tank failure or corrosion etc., in which 2,000 pounds of material is released over a 10 minute time frame, the topography for the Catawba River Pollution Control Facility is rural and according to the guidance for Wastewater Plants the resulting distance to toxic endpoint is 3.0 miles.  Alternate scenario includes the leak of three eighths inch feed line or valve or yoke assembly for 10 minutes to a toxic endopoint of 0.3 miles.  Population involved is only seven individuals, there are three homes with in this distance and all are higher in elevation than the POTW.  \n\nFive Year Acc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 2975,
      "SummaryText": "ident History\n    There has been no accident in the last five years that chlorine escaped offsite that resulted in death, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nThe only time there have been leaks is when the cylinders were switched and these were only very minor leaks.  One ton cylinders are used to feed the chlorine.    \n\nThe Emergency Response Program\n    Personnel are trained in the use of the chlorine kit \"b\" , SCBAs are worn 10 minutes per month to maintain comfort levels as part of respiratory protection program, which also requires annual hearing tests, and fit testing.  Chlorine safety training is conducted annually   Burke county LEPC is the group of record that will respond should a leak occur that the plant personnel cannot handle.  Eighty to ninety percent of the Burke County LEPC are City of Morganton Public Safety Officers.  Should this group prove unable to respond Asheville City Fire Dept. will be called through the 911 system to fix the leak.\n\nPlanned changes to Improve Safety\n     This facility has a single chemical of concern.  The feed area has a very good leak history, the equipment has been upgraded in 1997, and the equipment has been designed and installed according to engineer's specifications.  All repairs for critical equipment are from chlorine vendors.  A barrier has been installed in front of the chlorine feed area to prevent vehicular from accidentally crashing into the chlorine storage area.\n\nThe General Accidental Prevention Program and Chemical Specific Prevention Steps\nThe Catawba River Pollution Control Facility has emergency response plans which have been included in the RPMPSM document."
    }
  ]
}