{
  "FacilityID": 29840,
  "FacilityName": "Fresh Water Supply District No. 51",
  "FacilityStr1": "14701 Woodforest Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Channelview",
  "FacilityState": "TX",
  "FacilityZipCode": "77530",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.792306",
  "FacilityLongDecDegs": "95.158611",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "G1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "blalen@att.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "N/A",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Fresh Water Supply District No. 51",
  "OperatorStr1": "P. O. Box 24338",
  "OperatorStr2": null,
  "OperatorCity": "Channelview",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77229",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185765",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-04-30 00:00:00",
  "ErrorReportDate": "2004-04-30 00:00:00",
  "ReceiptDate": "2000-01-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "Yes",
  "PostmarkDate": "1999-12-30 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-12-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "2.0",
  "FRS_Lat": 29.792453,
  "FRS_Long": -95.158682,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43473,
      "AltID": "2",
      "FacilityID": 29840,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 57410,
          "ProcessID": 43473,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 57411,
          "ProcessID": 43473,
          "ChemicalID": 49,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44434,
          "ProcessID": 43473,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 29840,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-11-05 00:00:00",
    "ERTrainingDate": "1999-08-10 00:00:00",
    "CoordinatingAgencyName": "Harris County Emergency Management",
    "CoordinatingAgencyPhone": "7138813100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29840,
      "SummaryText": "EXECUTIVE SUMMARY\n\nPROCESS AT FRESH WATER SUPPLY DISTRICT NO. 51\n\nHarris County Fresh Water Supply District No. 51 (FWSD) wastewater treatment works utilizes the complete mix system to aerate wastewater in the treatment process.  Vaporized liquid chlorine is used to disinfect the final effluent.  Vaporized liquid sulfur dioxide is utilized as a dechlorinating agent for the final treated effluent prior to the effluent discharge to Carpenter¿s Bayou, an improved natural drainage facility.\n\n1.  THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY.\n\nThe most hazardous material used at this facility is chlorine.  As per the MSDS, the specific gravity of chlorine is 1.47.  This specific gravity will cause the chlorine to seek low spots in preference to becoming airborne.  The worst case scenario, however, supposes that the release will become airborne.\n\nEmployees are trained to promptly donn SCBAs before beginning emergency shutdown procedures.\n\nAll proper authorities are to be advised of a release and emergency response teams are to be summoned to the site.\n\nThere could be as much as 6,000 pounds of chlorine on site.  However, the normal quantity is 4,000 pounds. \n\nSulfur dioxide is also used at this facility.  There could be as much as 4,000 pounds of sulfur dioxide on site, however, the normal quantity is 2,000 pounds.  As per the MSDS, the specific gravity of sulfur dioxide is 1.434.  Therefore, the same accidental release procedures as for chlorine apply.\n\n2.  YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED.\n\nAt this facility, two (2)-regulated substances are handled:  chlorine and sulfur dioxide.  The maximum quantity of chlorine on hand is 6,000 pounds and the maximum quantity of sulfur dioxide on hand is 4,000 pounds.  These substances are stored in high integrity storage containers.\n\n3.  THE WORST-CASE RELEASE SCENARIO\n\nThere could be as much as 6,000 pounds of chlorine at this facility.  However, the normal quantity is 4,000 poun"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 29840,
      "SummaryText": "ager, Plant Superintendent or Superintendent for the FWSPD STP emergency condition should occur as soon as possible once an emergency condition (an event without warning) has occurred.\n\nOnce the emergency condition has occurred, the ¿On Call¿ operator at FWSPD and FWSPD STP is in charge until the General Manager or one of the Superintendents is in communication with the ¿On Call¿ personnel.  The ¿On Call¿ operator will provide an initial survey of damage and report on the impact of the damage at the direction of the General Manager or Superintendent.\nFurther, the ¿On Call¿ and ¿Standby¿ personnel would, under directions from the General Manager or the Superintendent provide for initial damage control activities, isolation of utilities, equipment and/or processes.  The ¿On Call¿ operator or General Manager/Superintendent will provide for damage support by initiating the recall of emergency essential personnel and may include communications with police, fire, ambulance or hazardous response units of Channelview/Harris County."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29840,
      "SummaryText": "ds.  The facility is topographically engineered in such manner that a release that does not become airborne will flow toward Carpenter¿s Bayou.\n\nThere are single family homes within 300 meters of the facility.  In the worst-case scenario, the maximum number of people who could be affected is 50.\n\n4.  THE 5-YEAR ACCIDENT HISTORY\n\nThere have been no accidents within the past 5 years.\n\n5.  EMERGENCY RESPONSE PLAN\n\nPURPOSE\nThe purpose is to provide guidance to employees as to their responsibilities during the event of an emergency or disaster.\n\nPROCEDURE(S)\nThe primary operations of the FWSPD and FWSPD Sewer Treatment Plant (STP) are carried out in a normal 8:00 a.m. to 5:00 p.m. work day, Monday through Friday.  ¿On Call¿ personnel are on duty 24 hours per day, seven days per week providing minimal coverage of the FWSPD operations and the FWSPD STP operation.\n\nIt is unlikely that advance warning of a natural disaster or major accident or incident could be provided.  Events that are known about in advance (i.e. hurricanes, freezes and heavy rain) can be prepared for and sufficient personnel can be placed on duty to react to the emergency.  However, these events, and others, can happen without warning.  These advance-planning considerations are included should such an emergency occurring without the minimum number of people on duty.\n\nIn the event of an emergency, the notification protocol is:\nA.  The ¿On Call¿ FWSPD operator calls 911 to advise and request assistance from emergency personnel (i.e., law enforcement, hazardous materials response).  If the emergency is vaporization, law enforcement officers will alert the affected population and ensure removal to a safe area.\nB.  The ¿On Call¿ FWSPD operator calls the Local Emergency Planning Committee regarding the emergency.  \nC.  The ¿On Call¿ FWSPD operator notifies the 1) General Manager, or, 2) Superintendent.\n\nNotification of the General Manager or Superintendent for the FWSPD emergency conditions and the General Man"
    }
  ]
}