{
  "FacilityID": 29965,
  "FacilityName": "Texarkana Water Utilities I. P. Chlorine Building",
  "FacilityStr1": "Shady Harbour Road",
  "FacilityStr2": null,
  "FacilityCity": "Texarkana",
  "FacilityState": "TX",
  "FacilityZipCode": "75501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48067",
  "LEPC": null,
  "FacilityLatDecDegs": "33.174500",
  "FacilityLongDecDegs": "-094.094500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.txkusa.org",
  "FacilityEmailAddress": "king@txkusa.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Texarkana, Texas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Texarkana Water Utilities",
  "OperatorStr1": "P. O. Box 2008",
  "OperatorStr2": null,
  "OperatorCity": "Texarkana",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75504",
  "OperatorZipCodeExt": "2008",
  "RMPContact": "William D. King, Jr.",
  "RMPTitle": "Executive Director",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078293",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 33.29583,
  "FRS_Long": -94.1625,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "100",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43676,
      "AltID": "Disenfection of water",
      "FacilityID": 29965,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44645,
          "ProcessID": 43676,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 57688,
          "ProcessID": 43676,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 557688,
          "ProcessID": 43676,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 29965,
      "SummaryText": "The International Paper Raw Water Chlorination Station is a facility to pre-chlorinate raw surface water from Wright Patman Reservoir, prior to treatment at a conventional water treatment plant whose water is used in paper production and for potable consumption. The station is a municipally owned and operated facility by the City of Texarkana, Texas, located near the eastern shore of Wright Patman Reservoir. The facility's only activity is the pre-chlorination or raw surface water.\n\nLiquid chlorine, stored in one ton cylinders, is the only chemical used at the site. Up to four (4) cylinders are manifolded together and used in the process. \n\nLiquid chlorine is the only chemical used in sufficient quantity at the facility to be regulated under the RMP program. Up to fourteen (14) one ton cylinders are stored on site at any one time with no more than two cylinders, piped independently, used in the process.\n\nTexarkana Water Utilities is dedicated to the safe and proper handling of chemicals necessary for the production of drinking water and treatment of wastewater for its citizens. Utility management has consistently budgeted and the elected bodies of the two Texarkana's have consistently approved funds to support personnel and citizen safety preventative maintenance training, chemical awareness and handling, emergency response and equipment related to chemicals used at the facility.\n\nSeveral training and procedural methods make a worst case release unlikely. Highly trained personnel and an extensive preventative maintenance program keep all chlorination equipment in like new condition. The chlorination room is monitored by a remote chlorine gas detector and alarm set a 3ppm. Safety procedures, including those associated with chlorine are standardized through written Standard Operating Procedures (SOP's). Chlorine cylinder repair kits are kept at several locations in the system.\n\nThe American Water Works Association publication Compliance Guidance and Model Risk Managem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 29965,
      "SummaryText": "ent Program for Water Treatment Plants, was used in the selection of an alternative release scenario. \n\nThe accidental release prevention program is predicated on well informed, well trained employees. The facility makes use of written, video and classroom training from the Texas Commission on Environmental Quality, Arkansas Department of Health, Chlorine Institute, The American Water Works Association and the Water Environment Association. Facility management has developed written standard operations procedures for all chemical equipment and chemical handling. These SOP's set up and require extensive preventative maintenance programs that provide frequent checks and keep equipment in like new condition. Gas detection and alarm devices are used to provide early alert to any chlorine releases.\n\nThere have been no reportable chlorine releases or accidents for a period exceeding five (5) years largely due to the previously described steps taken by Texarkana Water Utilities Management.\n\nThe Utility is included in the written community emergency response plan and maintains a close working relationship with the local Emergency Management Office. The facility has its own written emergency response plan and participates in site-specific, multi-agency response drills. Highway 59 Environmental, a compay which maintains a Hazardous Waste Operations and Emergency Response (HAZWOPER) team, is available to back up and respond to any chemical release. The International Paper emergency response team will also respond to a chemical release at this location.\n\nThe Utility has a geographic information system base map to assist utility, fire, police and emergency management personnel in prevention and response planning for any chemical release."
    }
  ]
}