{
  "FacilityID": 30115,
  "FacilityName": "City of Port Neches Wastewater Treatment Plant",
  "FacilityStr1": "6499 Georgia",
  "FacilityStr2": null,
  "FacilityCity": "Groves",
  "FacilityState": "TX",
  "FacilityZipCode": "77619",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.953889",
  "FacilityLongDecDegs": "-093.942778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78952285,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Port Neches",
  "OperatorStr1": "P.O. Box 758",
  "OperatorStr2": null,
  "OperatorCity": "Port Neches",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77651",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis J. Macha",
  "RMPTitle": "Supervisor WWTP",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056146",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-24 00:00:00",
  "ErrorReportDate": "2008-06-24 00:00:00",
  "ReceiptDate": "2004-05-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 29.95361,
  "FRS_Long": -93.94139,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43834,
      "AltID": "Chlorine",
      "FacilityID": 30115,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 44808,
          "ProcessID": 43834,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 57863,
          "ProcessID": 43834,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 557863,
          "ProcessID": 43834,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30115,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n1. Accidental Release Prevention and Emergency Response Policies:\nThe purpose of the Risk Management Plan contained herein is to detect and prevent or minimize accidental releases of chlorine from the Wastewater Treatment Plant, and to provide a prompt emergency response to any such releases in order to protect human health and the environment.  The City of Port Neches Wastewater Treatment Plant incorporates safety training annually to update the Plant?s Emergency Response Plan.                                                               \n2. The City of Port Neches Wastewater Treatment Plant:\n\nThe City of Port Neches owns and operates a wastewater treatment plant located at 6499 Georgia in Groves, Texas.  The plant uses chlorine in the wastewater treatment process for disinfecting the final effluent.  The Risk Management Program for the plant considers toxic release scenarios only.  There are no flammables stored or used on-site that are considered a regulated substance according to the guidelines of 40 CFR 68.\n\nChlorine\n\nChlorine is delivered in DOT 106A500X 1-ton containers from a local chemical supplier.  The maximum quantity of chlorine present at any given time at the plant is 8,000 pounds.  The 1-ton containers are stored in an enclosed structure.  Chlorine is included in the City?s Risk Management Program because the on-site quantity exceeds the threshold limit listed in 40 CFR 68.130.  \n\nThe maximum quantity of chlorine used on-line in the chemical feed process is 4,000 pounds.  It is the policy of the City of Port Neches to have a maximum of two 1-ton chlorine containers connected to the chemical feed process at any given time. \n\n3. Accidental release prevention and emergency response policies:\n\nThe City of Port Neches Wastewater Treatment Plant uses chlorine in the treatment process, which is considered hazardous by the EPA.  The same properties that make chlorine an effective chemical for disinfecting raw surface water also make it n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30115,
      "SummaryText": "ecessary to exercise certain precautions in the handling of chlorine to prevent unnecessary human exposure.  The Wastewater Treatment Plant operators use chlorine-handling procedures that are designed to reduce the threat to themselves and their co-workers, and to reduce the threat to members of the surrounding community.  It is the policy of the City of Port Neches to adhere to all applicable Federal and State rules and regulations.  Safety is dependent on the manner in which chlorine is handled, the design of the chlorine feed process, and the training of the operators in safe handling procedures.\n\nThe emergency response program for the Water Treatment Plant is based on the Chlorine Institute?s EMERGENCY RESPONSE PLANS FOR CHLORINE FACILITIES, Edition 4, November 1995.  The emergency response plan includes procedures for notification of the Port Neches Fire Department (PNFD), and any potentially affected neighbors within the affected toxic endpoint radius calculated by the RMP*Comp software.\n\n\n4. Five-year accident history:\n\nThere were no reportable accidents in the last five years.\n\n\n5. The emergency response program:\n\nThe City of Port Neches Water Treatment Plant?s Emergency Response Program is based on the Chlorine Institute?s EMERGENCY RESPONSE PLANS FOR CHLORINE FACILITIES, Edition 4, November 1995.  The program was developed with recommendations and guidance of the PNFD.  The Jefferson County Emergency Planning Committee has been notified of the specific scenarios and responses that the plan covers.  A planning meeting between the treatment plant supervisors and the PNFD was held in June 1999 to implement the current plan.\n\n\n6. Planned changes to improve safety:\n\nThe chemical feed system was designed and constructed within the last 15 years.  The design and construction were approved by the TCEQ.  The hazard assessment, prevention program, and emergency response plan were reviewed and updated before submittal of the current Risk Management Plan.  No changes "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30115,
      "SummaryText": "in operating procedures or processes are necessary at this time.  If there are any reportable chemical accidents the accidents have to be added to the RMP within six months of the date of the accident.  Changes in emergency contact information must also be reported to the RMP within one month."
    }
  ]
}