{
  "FacilityID": 30183,
  "FacilityName": "Mammoth Pacific L.P.",
  "FacilityStr1": "95 Casa Diablo Cuttoff",
  "FacilityStr2": null,
  "FacilityCity": "Mammoth Lakes",
  "FacilityState": "CA",
  "FacilityZipCode": "93546",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06051",
  "LEPC": "Mono County Health Department",
  "FacilityLatDecDegs": "37.645000",
  "FacilityLongDecDegs": "-118.913889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 619719685,
  "ParentCompanyName": "Ormat Nevada Inc.",
  "Company2Name": "Constellation Energy",
  "CompanyDUNS": null,
  "Company2DUNS": 625133707,
  "OperatorName": "Bob Sullivan",
  "OperatorStr1": "95 Casa Diablo Cuttoff",
  "OperatorStr2": "PO Box 1584",
  "OperatorCity": "Mammoth Lakes",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93546",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": "CAL000004488",
  "EPAFacilityID": "100000091713",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-03-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-05-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.0",
  "FRS_Lat": 37.644934,
  "FRS_Long": -118.914855,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 43923,
      "AltID": "Unit G-2, G-3",
      "FacilityID": 30183,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58059,
          "ProcessID": 43923,
          "ChemicalID": 107,
          "Quantity": 405000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44897,
          "ProcessID": 43923,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 43924,
      "AltID": "Unit G-1 100, 200",
      "FacilityID": 30183,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58060,
          "ProcessID": 43924,
          "ChemicalID": 107,
          "Quantity": 121000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 44898,
          "ProcessID": 43924,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30183,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-11-17 00:00:00",
    "ERTrainingDate": "2003-05-12 00:00:00",
    "CoordinatingAgencyName": "Mono County Office of Emerg Service",
    "CoordinatingAgencyPhone": "7609325234",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30183,
      "SummaryText": "Risk Management Plan Executive Summary\nDescription Of Corporate Prevention And Emergency Response Approach.\nThis facility complies with numerous standards for pressure vessel design and testing as \nwell as all Federal and California process safety management requirements.  It is our \npolicy to adhere to all applicable federal, state, and local laws.  Copies of emergency \nresponse, process hazard analyses and process safety management plans and all \ntechnical drawing (P&IDs) for process equipment are maintained onsite for reference.  \nRegular inspection and testing of systems in isobutane service are performed to ensure \nequipment integrity is maintained.  The facility is equipped with a network of leak \ndetection equipment, automatic shutdown logic controls, deluge systems, fireproof \ninsulation, safety relief valves, fire detection monitors.  Mammoth Pacific LP provides \nhigh levels of training in operating procedures, safety and emergency response.  If an \nemergency were to occur, it is our policy to implement the emergency response \nprocedures to mitigate damages, and to notify the Long Valley Volunteer Fire \nDepartment and request that they respond to the emergency.  Long Valley determines if \nadditional response is necessary from Mammoth Lakes Fire Department, and Mono \nCounty Office of Emergency Services \nDescription of Stationary Source\nThe Mammoth Pacific Power Plants, are fueled by geothermal brine from the Casa \nDiablo Hot Springs. Mammoth Pacific G1 was built in 1984 and generates 10 \nmegawatts. The G2 and G3 projects were built in 1990 and generate 22 megawatts of \nelectrical power. The power from all three projects is sold to Southern California Edison. \nThe project consists of 12 production wells and 8 injection wells. A total of eight single \nstage, radial flow gas expanders are used. \nThe plants utilize hot geothermal water as an energy source for binary Rankine cycle \nsystems.  The basic Rankine cycle consists of four components:\n*\tPump - Work Input"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30183,
      "SummaryText": "*\tBoiler - Heat Input \n*\tTurbine - Work Output \n*\tCondenser - Heat Rejection\n\n \n\nThe Rankine cycle consists of pressurizing a liquid (isobutane), vaporizing the high \npressure liquid, expanding the high pressure vapor and condensing the low pressure \nvapor for reuse.  The energy necessary for the vaporization is provided by geothermal \nbrine at a maximum temperature of 340øF.  The geothermal energy is transferred to the \nIsobutane working fluid via tube and counter-current shell heat exchangers.  The MPLP \nfacilities use commercial isobutane with a dry cooling heat rejection system.\nThe binary working fluid is Isobutane, a flammable vapor/liquid.  The Isobutane is \npresent on-site at each facility is in various states including high pressure liquid, high \npressure superheated vapor, low pressure liquid and low pressure superheated vapor as \nwould be typical of a power generation process.  \nThe expansion of isobutane occurs in single stage radial turbo-expanders.  The \ncondensing system utilizes ambient air to cool the Isobutane in fin-fan style induced draft \nheat exchangers.  A pressurized liquid accumulator vessel receives the cooled vapor \nand maintains the liquid inventory under pressure.\nPrimary Activities\nGeothermal energy is converted to electric power.  The facility is rated at 40MW.  The \nnet power output to the electrical grid is 18 - 34 MW.  Power output is reduced in warm \nweather due to limitations of the air cooled heat exchangers.\nUse of regulated substance\nIsobutane, a flammable vapor/liquid is used as a binary working fluid. Liquid isobutane is \npumped from a condenser to shell and tube heat exchangers.  Thermal energy provided \nby geothermal brine is transferred to the isobutane.  The geothermal heat input causes \nthe isobutane state to change from liquid to high pressure superheated vapor that is \npassed through turbines to produce electric power.  The vapor is condensed and \nrecycled back to a pressurized liquid accumulator vessel to complete t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30183,
      "SummaryText": "he Rankine cycle.  \nIsobutane in storage tanks is available for makeup.\nThe facility design is segregated into multiple sections, each having its own design \nspecifications dictated by the Isobutane conditions in that section.  The sections include: \nthe low pressure process equipment, the high pressure process equipment, Isobutane \nunloading system, vapor recovery system, evacuation system and non-condensable \nremoval system.  Each section is protected by pressure relief systems that may include \nPressure Safety Valves, Pressure Control Valves, control system shutdown and \nintervention logic and administrative practices.\nQuantities handled or stored\nThe design inventory of the system consists of Isobutane present both as a gas and as a \nliquid.  The nominal maximum liquid inventory exists when the facilities are not \noperating.  At that time the energy in the Isobutane is reduced and most of the inventory \nis present as a liquid in the liquid accumulator vessels.  The following chart indicates the \nnormal maximum inventory at each plant at the facility:\nPlant\nLiquid Inventory \n(pounds)\nVapor Inventory \n(pounds)\nTotal Inventory \n(pounds)\nG1(U-100 & U-200)\n120,000\n1,500\n121,500\nG2\n200,000\n2,500\n202,500\nG3\n200,000\n2,500\n202,500\n\nWorst Case Scenario\nDescription\nThe worst case scenario was based on a combined Plant G2 and G3 vapor cloud \nexplosion.  Although safeguards are in place, that make a worst case scenario extremely \nunlikely, it was assumed the explosion originates at the G2 accumulator and propagates \nto the G3 accumulator and all equipment in vapor and liquid service.  The total isobutane \nmaterial is 405,000 lbs.  \nEnd point distance\nThe RMP*Comp model was used to model the worst case scenario.  The distance to the \n1 psi overpressure was determined to be less than 0.6 miles (1 kilometer).\nResults of Consequence Analysis\n\nChemical: Isobutane [Propane, 2-methyl]\nCAS #: 75-28-5\nCategory: Flammable Gas\nScenario: Worst-case\nLiquefied under pressure\nQuantity Rele"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30183,
      "SummaryText": "ased: 405000 pounds\nRelease Type: Vapor Cloud Explosion\nEstimated Distance to 1 psi overpressure: .6 miles (1.0 kilometers)\n\n--------Assumptions About This Scenario---------\nWind Speed: 1.5 meters/second (3.4 miles/hour)\nStability Class: F\nAir Temperature: 77 degrees F (25 degrees C)\n------------------------------------------------\n\nModeled distance to endpoint is not affected by the vapor state of the isobutane or by \nexclusion of the liquid and vapor components.  End point distance is reduced by 0.1 \nmiles if explosion does not propagate to both units.  The impact zone for a worst case \nscenario of Unit G1 lies within the radius of the worst case scenario for G2 and G3. The \nRMP Comp model is a conservative screening tool and may overestimate distances to \nendpoint.  The model does not accommodate mitigative measures or topography that \nmay reduce consequences of any accident.\n\nExamination of topographic maps and visual observation of the potentially affected area \nin a worst case scenario did not identify any residential structures, parks or other public \nplaces.  The endpoint encompasses a portion or U.S. Route 395.  MPLP is located in a \nrelatively isolated area surrounded by undeveloped land owned by the U.S. Forest \nService and managed for mineral resources by Bureau of Land Management (BLM).  \nThe facility is approximately 3-miles from the outskirts of Mammoth Lakes, CA (POP. \n5000 ).\nPrevention Program Description\nSafety Information, \nThe facility is in compliance with OSHA?s regulatory programs for Process Safety \nManagement (29 CFR 1910.119), Emergency Action Planning (29 CFR 1910.120), and \nHazardous Waste Operations and Emergency Response (HAZWOPER) Plan \nregulations (29 CFR 1910.38).  Re-training was completed on 5/12/2003.\nThe principal methods of accident prevention include equipment design safeguards, \nwritten procedures and operator/employee training.  Safety systems are present in the \nfacilities and have various methods of operation.  \nPressure s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 30183,
      "SummaryText": "afety systems typically have three levels of degree.  The initial degree is an \nalarm that is presented audibly and visually to the Control Room Operator.  The next \nmore severe degree is a shutdown of process equipment likely to be causing or \nexacerbating the condition and an alarm that is presented audibly and visually to the \nControl Room Operator.  The third and most severe degree of pressure safety system \nare Pressure Safety Valves which relieve to atmosphere or to larger low pressure \nsystems.  Some of these PSV?s also have Control Room Alarms.\nA combustible gas detection system is present in each of the plants.  Sensors are \nstrategically located in each plant.  Control Room audio and visual alarms annunciate \nconcentrations in excess of 40% of LEL.  A warning light is present at the entrance to the \nG2 and G3 facilities and it is lighted when combustible gas is determined to be a hazard \nat either facility.\nA fire suppression system is present in each of the plants.  Fusible links are utilized for \nactivation of several systems.  Fusible links are capable of automatic activation of \nisolation valves in the Isobutane process system and high volume active deluge spray \nsystems around major equipment which activates Control Room alarms.  A 250,000 \ngallon water storage tank provides an assured water supply for fire suppression \nequipment.\nA Distributed Control System Emergency Shut Down event (ESD), depending on the \nsource alarm, will either automatically shutdown a process, or arm a shutdown \nprocedure that needs to be confirmed before it is activated.  Several alarms can cause \nan ESD.  The ESD logic is explained in detail in Operation Manual Volume 3 Procedure \nOP E-203 Section 11.D.\nShutdown of Isobutane main pumps occurs when expander discharge pressure exceeds \npredetermined values.  Values and shutdowns are staged at 10 psi increments below \nthe set-points of the Pressure Safety Valves on the low pressure system.  Control type is \nhardwired logic.  Sh"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 30183,
      "SummaryText": "utdown of Isobutane main pumps occur when expanders shutdown \non a one for one basis.  Control Type is hardwired logic.\nProcess Hazard Analysis\nMPLP utilized a professional safety consultant experienced in binary geothermal power \nfacilities to perform a hazard analysis appropriate to the complexity of the process for \nidentifying, evaluating, and controlling hazards involved in the process and shall \ndetermine and document the priority order for conducting process hazard analyses \nbased on the extent of process hazards, number of potentially affected employees, age \nof the process and process operating history.  A ?What-if? analysis was selected and \nutilized.\nOperation Procedures\nMPLP has developed and implemented written procedures that provide clear instructions \nfor safely conducting activities involved in each process consistent with the process \nsafety information.  The operations copy of the Operations Manuals consists of four \nVolumes located in the Control Room.\nMPLP maintains a library of documents that include engineering design specifications, \nmanufacturers data sheets, Process and Instrument Diagrams(P&ID?s), construction \ndrawings and engineering calculations.  These are collected into bound volumes (Data \nBooks) associated with each plant at the facility.  Copies are stored in the conference \nroom at the office building, the General Managers office, the instrument shop in the \nmaintenance building and at the home office.  Additional copies of P&ID?s are kept in the \nOperation Manuals in the control room.\nTraining\nEach employee presently involved in operating or maintaining a process, and each \nemployee before working in a newly assigned process, is provided initial training \nincluding an overview of the process and in the operating procedures.  At least every \nthree years, and more often if necessary, refresher and supplemental training are \nprovided to each maintenance or operating employee and other workers necessary to \nensure safe operation of t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 30183,
      "SummaryText": "he facility. \nWeekly safety meetings are used to identify maintenance priorities and to discuss \nimproved procedures and training requirements.  Training certificates are maintained in \nemployee records. Testing procedures are used to ensure competency in job skill levels \nand safe and healthy work practices.  \nMaintenance Procedures\nMPLP has installed and operates a Computerized Maintenance Management Software \n(CMMS) program.  This CMMS contains information on all equipment in the facility \nrequiring maintenance, inspections, testing, certification, calibration, etc..  NFPA, Cal-\nOSHA, manufacturer?s recommendations and operations experience have been utilized \nto produce a comprehensive maintenance work order system that produces \nmaintenance requests at appropriate frequencies.  Employees report any equipment \ndeficiencies to the Control Room Operator who generates ?Work Orders? for the repair or \nassessment of the problem.  Routine comprehensive inspections are performed using \nchecklists.  \nIncident Investigation\nMPLP has established guidelines for prompt reporting and investigating every incident \nwhich results in or could reasonably have resulted in a major accident. The procedure is \nlocated in the Control Room in the Safety Manual Volume 1 Section D Injury and Illness \nPrevention Program Subsection D, Accident / Incident Investigation.\nManagement Of Change\nMPLP has established and implemented a written procedures to manage changes \n(except for replacement in kind) to process chemicals, technology, and equipment, and \nchanges to facilities. The procedure is located in the Control Room in Maintenance \nManual Volume 1 Division 200 Section 201 ?Engineering Change Notice.?\nContractors\nContractors that perform work in the process plant boundaries or at the well pads (not \njust at the general facilities) are required to participate in an orientation training session \nthe first time that they are on site.  The training includes site rules, basic safety \nrequirem"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 30183,
      "SummaryText": "ents, handling of emergencies, fire protection information and hazardous \nmaterials present at the site.  The safety brief is contained in the Plant Safety Manual \nVolume 1 Procedure SMP-1 Exhibit 6.  The hazardous materials information sheet \nutilized in the training is Exhibit 6 of the same procedure.  A copy of the Safety Manual \nTable of Contents is contained in Appendix H of this manual.\nHot Work Permits\nMPLP has developed and implemented a written procedure for the issuance of hot \nwork permits.  The procedure is located in the Control Room in Safety Manual Volume 1 \nProcedure SMP-14 ?Safety Permit for Work Requiring Special Precautions.?\nManagement of Change\nMPLP has established and implemented a written procedures to manage changes \n(except for replacement in kind) to process chemicals, technology, and equipment, and \nchanges to facilities. The procedure is located in the Control Room in Maintenance \nManual Volume 1 Division 200 Section 201 ?Engineering Change Notice.?\nAccident History\nThere have been no accidents related to the regulated equipment in the past five years, \nnor for the history of the facility.\nMPLP has established guidelines for prompt reporting and investigating every incident \nwhich results in or could reasonably have resulted in a major accident. The procedure is \nlocated in the Control Room in the Safety Manual Volume 1 Section D Injury and Illness \nPrevention Program Subsection D, Accident / Incident Investigation.\nEmergency Response Program\nMPLP has developed and distributed a business plan for emergency response pursuant \nto subdivision (a) of Section 25503.5 and subdivision (b) of Section 25505 of the Health \nand Safety Code.  A copy of the Business Plan is available in the Control Room.\nEmergency response is based on recognition and observation of potential emergency \nconditions, and immediate repair, or notification of the primary response agency.  The \npolicy for emergency response at MPLP is to mitigate any accident by impleme"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 30183,
      "SummaryText": "nting \nemergency procedures that have been developed for all known contingencies.  Small \nfires will be contained and mitigated with water sprays, fire extinguishing equipment and \nautomatic deluge and isolation controls.  Emergency notification is required for any \nrelease or threatened release of a hazardous material which poses a significant present \nor potential health, safety or environmental hazard.  The Facility Manager is designated \nincident command when present.  The senior operator is designated incident command \nwhen management is not present.  Incident command is transferred to emergency \nresponders upon arrival.\n  U.S. Census Statistics, 1990"
    }
  ]
}