{
  "FacilityID": 30314,
  "FacilityName": "Alameda Chemical & Scientific - HTP",
  "FacilityStr1": "860-81st Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oakland",
  "FacilityState": "CA",
  "FacilityZipCode": "94621",
  "Facility4DigitZipExt": "2510",
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.751111",
  "FacilityLongDecDegs": "-122.188056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": "www.acs-htp.com",
  "FacilityEmailAddress": "fpidgeon@acs-htp.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ronald F. Miller",
  "OperatorStr1": "860-81st Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Oakland",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94621",
  "OperatorZipCodeExt": "2510",
  "FTE": 28,
  "OtherEPAFacilityID": "CAD981451161",
  "EPAFacilityID": "100000016118",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-05-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-09-05 00:00:00",
  "DeRegistrationEffectiveDate": "2012-09-12 00:00:00",
  "AnniversaryDate": "2009-05-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.0",
  "FRS_Lat": 37.750932,
  "FRS_Long": -122.188026,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-PRIMARY NAME",
  "HorizontalAccMeasure": "1000",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 44083,
      "AltID": "Aqueous Ammonia",
      "FacilityID": 30314,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58234,
          "ProcessID": 44083,
          "ChemicalID": 57,
          "Quantity": 359548.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45059,
          "ProcessID": 44083,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 44084,
      "AltID": "Aqueous Hydrochloric Acid",
      "FacilityID": 30314,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 58235,
          "ProcessID": 44084,
          "ChemicalID": 53,
          "Quantity": 226052.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45060,
          "ProcessID": 44084,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30314,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-06-22 00:00:00",
    "ERTrainingDate": "2002-07-22 00:00:00",
    "CoordinatingAgencyName": "City of Oakland Fire Services",
    "CoordinatingAgencyPhone": "5102387759",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "49 CFR and 21 CFR"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30314,
      "SummaryText": "Executive Summary\n\nThis Executive Summary has been prepared for Alameda Chemical & Scientific, Inc. corporate facility in Oakland, California.\n\nAlameda Chemical & Scientific, Inc. (AC&S) is a member of the National Association of Chemical Distributors (NACD) and operates under NACD¿s ¿Responsible Distribution Process¿.  This process requires each member company to have an active program designed to continuously improve safety and reduce incidents.  The AC&S Risk Management Program in conjunction with other applicable AC&S programs, plans, and policies and procedures define our readiness and approach to chemical safety. \n\nWe belief the risks to employees and the surrounding community are minimal to none, given the sophistication of our facility; the training given our employees; and our operating policies and procedures.  These include the following:\n\n¿\tEmergency preparedness; Evacuation plans; Community Right-To-Know Notification; and Local/State/Federal Agency Notifications\n¿\tHazard assessment programs\n¿\tInternal Compliance Auditing\n¿\tFederal, State, and Local guidelines\n¿\tOn-Site 40-hour trained Hazwoper Team\n¿\tPrimary and secondary 24 hr emergency response contractors on call as backup to Hazwoper Team\n¿\tFacility used by the City of Oakland Fire Department for new recruit training\n\nAccidental release prevention and emergency response policy\n\nAC&S approach to chemical safety is based on zero tolerance.  Our training, readiness and facilities all contribute to safe operations.  Our Risk Management Program is designed to protect human health and the environment.  All materials brought into the AC&S facility are evaluated for safe storage and compatibility.\nResources utilized to evaluate safe chemical handling include (but are not limited to):\n\n¿\tNFPA rating\n¿\tUniform Building Codes for storage requirements\n¿\tUniform Fire Codes for storage requirements\n¿\tCalifornia Accidental Release Prevention Program guidelines\n¿\tEPA Toxic Substances Control Act guidelines\n¿\tUSDOT"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30314,
      "SummaryText": "Hazmat Transportation and Training guidelines\n\nSenior management¿s commitment to safety is demonstrated through the resources made available to ensure a safe operation, including current ISO 9002 certification.  ISO 9002 drives our continuous improvement efforts in all areas of the operation by formalizing our corrective action system and training documentation.  AC&S has adopted the concept of NACD Product Stewardship and has passed NACD¿s Third Party Verification program; Community Outreach; and Emergency Response and Public Preparedness requirements.\n\nFacility Description\n\nAC&S located at 860 81st Avenue in Oakland, CA is a chemical warehouse and distribution company serving the microelectronics, biotechnology and specialty industries.  The 121,000 sq. ft. building is a state-of-the-art facility that complies with 1994 Uniform Building and Fire Codes for storage of hazardous materials.  The hazardous operation study included structural and seismic upgrades of the original building.  A water sprinkler system is plumbed throughout the building as well as an aqueous film forming foam (AFFF) system in the flammable and combustible storage areas.\n\nHydrochloric acid and Ammonia are the two regulated substances stored onsite above the Threshold Process Quantity (TPQ). Although quantities may vary at any one time, anticipated quantities on hand would be 226,052 lbs of HCL and 359,548 lbs of Ammonia solution.\n\nThe worst case release scenario(s) and the alternative release scenario(s)\n\nThe following are considered the only plausible scenarios considering our safety procedures and weekly/monthly facility safety inspections. These also represent the worst case volumes based on the largest packaging configuration and exceeding the threshold reporting quantity stored at AC&S for that substance.\n\nAir Temperature: 77 ?\t\tWind Speed: 3-7 mph\n\n¿\tHydrochloric acid, 37%, CAS 7647-01-0\nA 539 lb. drum is leaking into the contained and bermed 45,000 sq. ft. H-7 corrosive storage area."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30314,
      "SummaryText": "Release rate to outside air is 0.000000514 pounds per min. The estimated distance traveled by toxic plume is <0.1 miles.\n\n¿\tAmmonium Hydroxide Solution, 30%, CAS 1336-21-6\n2,000 lb polyethylene tote is leaking into the contained and bermed 45,000 sq. ft. H-7 corrosive storage area.  Release rate to outside air is .250 pounds per min.  The estimated distance traveled by toxic plume is <0.1 miles.\n\nThe general accidental release prevention and chemical specific prevention steps\n\nTraining provided to each employee is determined from the guidelines and requirements established by applicable regulatory agencies and company policies.  All Federal, State and local Health, Safety and Environmental regulations pertaining to our operations are monitored daily and programs, plans, and policies and procedures (in addition to employee training) are developed and implemented to ensure compliance, the protection of people, the environment, and property.\n\nOur Hazardous Materials Business Plan and Risk Management Plan are on record with the City of Oakland Fires Services, Hazardous Materials Division and Office of Emergency Services.  \n\nFive year accident history\n\nThere have been no accidental releases in the last 5 years.\n\nThe emergency response program\n\nOnsite hazardous waste operations emergency response team (Hazwoper) has been established for emergency preparedness, hazardous materials spills and evacuation and contingency plan procedures.  Advanced Environmental Technical Services and Foss Environmental have been coordinated with for 24 hr. emergency response service as a backup to the facility¿s Hazwoper team.\n\nIn the event of an imminent health risk to employees the emergency evacuation plan will be activated.  Emergency response Hazwoper team members will notify the local fire department as well as community right to know notification, if surrounding area is in danger, the California Emergency Response Commission and the National Emergency Response Center will be contacted"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30314,
      "SummaryText": "thus activating the local emergency broadcasting service notification to the public.\n\nPlanned changes to improve safety\n\nOur corrective action program and other applicable programs, plans, and policies and procedures will continue to improve daily operations through identification of potential hazards, mitigation of potential hazards, and opportunities for additional training and/or additional resources required to meet business and safety objectives."
    }
  ]
}