{
  "FacilityID": 30325,
  "FacilityName": "Kennebunk, Kennebunkport, & Wells Water District",
  "FacilityStr1": "135 York Street",
  "FacilityStr2": null,
  "FacilityCity": "Kennebunk",
  "FacilityState": "ME",
  "FacilityZipCode": "04043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23031",
  "LEPC": "York County LEPC",
  "FacilityLatDecDegs": "43.363611",
  "FacilityLongDecDegs": "-070.560000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "PG",
  "FacilityURL": "www.kkw.org",
  "FacilityEmailAddress": "info@kkw.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Norm Labbe - Superintendent",
  "OperatorStr1": "P.O. Box 88, 92 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Kennebunk",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04043",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Silke",
  "RMPTitle": "District Engineer",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000154799",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Chlorine Process",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 43.3763,
  "FRS_Long": -70.5502,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44095,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 30325,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 45071,
          "ProcessID": 44095,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 58248,
          "ProcessID": 44095,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 558248,
          "ProcessID": 44095,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30325,
      "SummaryText": "A brief overview of the RMP elements. The regulated chemical is chlorine which is kept in a separate enclosure at the stationary source. Chlorine detectors and alarms are in place as is automatic shut down. Safety information that describes the hazards associated with chemicals, operational procedures and equipment is maintained at the stationary source. Qualified personnel have examined and revalidated engineering, processing and operational procedures to ensure that hazards associated with the station's operation are identified and controlled efficiently. New insights are reported and addressed in a timely fashion. Written policies/SOPs are maintained to ensure activities are safely conducted. Various modes of operation such as normal operations, temporary operations, normal/emergency shutdown, initial/after shutdown/startup or emergency protocol/preparedness are regularly reviewed and readily accessible to facility operators. All employees who work with regulated/hazardous substances or could come in contact with such materials are given specific training depending upon their assigned duties and in addition to First Aid/HazCom training. Hazardous materials training requirements are based upon federal and state proficiency standards as set forth by law. The facility maintains a complete list of employees who have had training and of what type. Refresher training is provided as needed and annually. Maintenance operations and checks are performed and documented by qualified personnel with training in maintenance practices. Equipment examined b ythese checks include but are not limited to pressure valves, storage tanks, piping systems, relief and vent systems, emergency systems, controls and pumps. Any equipment deficiencies identified by these checks are corrected in a safe and timely manner. Any employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to manage the change whether it be chemical, t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30325,
      "SummaryText": "echnological, related to equipment or procedural. Pre-start safety reviews relating to new process/equipment/procedures are conducted to confirm safe operation. A review of emergency plans, procedures/policies, data, and responsibilities to reflect current and actual assignments is performed annually. A file of recommended changes/improvements is maintained. Any revisions are detailed on revision sheet that is distributed to those groups affected, along with a copy of the plan. The revision sheet is included in the plan as part of the permanent record. Any incident that has resulted in/could result in the release of regulated substance is promptly investigated. These investigations are to identify the situation leading to the incident and any corrective actions to prevent recurrence. All reports are retained for a minimum of five (5) years. All employees carry out their jobs in a safe manner and actively contribute to the development of safety policies and practices. Each employee is responsible to follow established procedures, and for taking reasonable care for his/her personal safety and for the safety of others, who may be affected by the employee's acts/omissions at work. Employees have access to all information of this plan including information resulting  from hazard analyses in particular. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. On occasion, it becomes necessary to hire contractors to perform specialized activities. A thorough safety evaluation prior to selection and a review of procedures including review of \"hot work\" is carried out. Contractors are informed of known potential hazards and procedures for emergency response should an incident occur. Data from the release scenarios was obtained from the RMP Comp program produced by EPA. The worst case scenario could involve 4,000 of the population and the alternative would be less than 100 as automatic shutdown would"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30325,
      "SummaryText": " take place. For further information see the entire plan."
    }
  ]
}