{
  "FacilityID": 30616,
  "FacilityName": "Rifle Gas Plant",
  "FacilityStr1": "620 County Road 264",
  "FacilityStr2": null,
  "FacilityCity": "Rifle",
  "FacilityState": "CO",
  "FacilityZipCode": "81650",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08045",
  "LEPC": "Garfield County LEPC",
  "FacilityLatDecDegs": "39.530000",
  "FacilityLongDecDegs": "-107.826944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.xcelenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6915953,
  "ParentCompanyName": "Xcel Energy",
  "Company2Name": "Kinder-Morgan",
  "CompanyDUNS": 186614616,
  "Company2DUNS": 0,
  "OperatorName": "Public Service Company of Colorado",
  "OperatorStr1": "4653 Table Mountain Drive",
  "OperatorStr2": null,
  "OperatorCity": "Golden",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80403",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": "COR000000125",
  "EPAFacilityID": "100000019277",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Rifle Gas Plant RMP Plan Resubmission June 2004",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.0",
  "FRS_Lat": 39.52957,
  "FRS_Long": -107.81722,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 44543,
      "AltID": "Nat. Gas Liq. Extraction",
      "FacilityID": 30616,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 58863,
          "ProcessID": 44543,
          "ChemicalID": 155,
          "Quantity": 612260.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 42887,
              "ProcessChemicalID": 58863,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 42888,
              "ProcessChemicalID": 58863,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 42889,
              "ProcessChemicalID": 58863,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 42890,
              "ProcessChemicalID": 58863,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 45525,
          "ProcessID": 44543,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 17147,
              "Process_NAICS_ID": 45525,
              "SafetyReviewDate": "2003-10-13 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Dept. of Transportation",
              "FR_Comments": null,
              "HazardReviewDate": "2003-07-23 00:00:00",
              "ChangeCompletionDate": "2003-08-15 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Operator error",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "SCADA alarms",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Fire and gas leak detection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Establish and implement safety relief valve testing program",
              "OpProceduresReviewDate": "2004-05-17 00:00:00",
              "TrainingReviewDate": "2002-01-29 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-01-29 00:00:00",
              "EquipmentInspectionDate": "2004-04-15 00:00:00",
              "EquipmentTested": "All valves and fittings were inspected for leaks.",
              "ComplianceAuditDate": "2001-09-18 00:00:00",
              "AuditCompletionDate": "2002-01-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2001-08-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Natural Gas Liquids Extraction",
              "_chemicals": [
                {
                  "PrimaryKey": 17884,
                  "PreventionProgram2ID": 17147,
                  "ProcessChemicalID": 58863
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 30616,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rifle Fire Protection District",
    "CoordinatingAgencyPhone": "9706251243",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 30616,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the Public Service Company of Colorado (PSC) Rifle Gas Plant.\n\nPrevention and Release Policies\nThe accidental release prevention and emergency response policies are represented in the Emergency Planning and Response Sections of the Rifle Gas Plant RMP manual for the liquid hydrocarbon product and propane system.  PSC takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are properly trained in the safe operation of covered processes and the safe handling of regulated chemicals.  As for emergency response, PSC has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nPSC management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the RMP manual.  Additionally, PSC has determined that, despite qualification for Program 2 compliance, it is prudent to establish and maintain Program 3 compliance as a conservative safety and business approach.\n\nStationary Source and Regulated Substances\nRifle Gas Plant is a 50 mmscf/day natural gas dewatering and liquid hydrocarbon extraction facility constructed as a joint project between PSC and Rocky Mountain Natural Gas (division of KN Energy);  the plant is operated by PSC.  The RMP-regulated substances handled at this facility are liquid hydrocarbon product, propane, and natural gas.  The hydrocarbon product is extracted from the natural gas processed at the plant;  propane is used for process cooling.  There are four 30,000 gallon liquid hydrocarbon product storage tanks (607,200 pounds) and one 1000 gallon propane tank (5060 pounds).\n\nThe gas processin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 30616,
      "SummaryText": "g section and the liquid hydrocarbon storage between the ESD on the inlet of the gas plant (SV 155) and the ESD on the outlet of the gas plant (SV 153) are currently the only portions of the Rifle Gas Plant regulated under the RMP regulation.  The balance of the facility is regulated under the DOT Pipeline Safety regulations Parts 190-199.\n\nThis is a remote, unmanned facility exempt from OSHA PSM requirements.  However, three PSC operators perform periodic system checks and maintenance at the plant.\n\nPrevention Steps for Liquid Hydrocarbon Product and Propane\nThe prevention program and chemical-specific prevention steps are described in detail in the Rifle Gas Plant RMP manual.  The prevention program includes the Program 3 elements:\n? Employee participation, which includes provisions for active participation by plant employees in the development and implementation of the facility RMP program, as well as ready access to program information\n? Process safety information, which has been collated into the RMP manual located in the Rifle Gas Plant control room\n? Process hazard analysis (PHA) - The initial PHA for the liquid hydrocarbon product and propane system was conducted in July 1998; all recommendations from the PHA have been addressed.  A new PHA was conducted in June 2001 to address installation of a new 3-phase separator;   all recommendations have been addressed.  A PHA revalidation was conducted in July 2003;  all recommendations have been addressed.\n? Operating procedures for the facility operations, which are available at the plant\n? Training for all plant personnel involved in the operation and maintenance of the plant operations\n? Contractor management program, which includes provisions for the evaluation and selection of contractors to work on the regulated process, exchange of hazard information, system access control, and oversight during work activities on site\n? Pre-startup safety review procedure for implementation for significant system changes to e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 30616,
      "SummaryText": "nsure that the construction and equipment installation is according to design specifications, appropriate procedures are in place and accurate, a PHA has been done and the recommendations resolved, and employees are trained prior to startup of the modified system\n? Mechanical integrity program through the operator computer system to ensure that the system equipment is maintained in good and safe working condition\n? Hot work procedures to require controls as specified in the Gas Standards Manual before hot work is performed on the liquid hydrocarbon product and propane system\n? Management of change program to ensure that proposed system changes are comprehensively evaluated before implementing the change\n? Incident investigation procedures for the investigation of any catastrophic (or potentially catastrophic) incident associated with the liquid hydrocarbon product and propane system\n? Compliance audits to be conducted at least once every three years to ensure the continued compliance of the Rifle Gas Plant RMP program.  The initial RMP audit was conducted in September 2001 and all changes recommended by the audit have been completed.\n\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of regulated flammable materials meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies.  The program is described in detail in the Emergency Planning and Response section of the RMP compliance manual and meets the requirement of 40 CFR 68.95.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes for Improved Safety\nIdeas for changes to improve safety are actively sou"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 30616,
      "SummaryText": "ght from employees.  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nDuring the development of the Rifle Gas Plant RMP program, a process hazard analysis was conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered processes."
    }
  ]
}