{
  "FacilityID": 31332,
  "FacilityName": "Columbia Crest Winery",
  "FacilityStr1": "Highway 221",
  "FacilityStr2": "Columbia Crest Drive",
  "FacilityCity": "Paterson",
  "FacilityState": "WA",
  "FacilityZipCode": "99345",
  "Facility4DigitZipExt": "0231",
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "45.956389",
  "FacilityLongDecDegs": "-119.608056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "columbia-crest.com",
  "FacilityEmailAddress": "info@columbia-crest.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ste. Michelle Wine Estates",
  "Company2Name": "International Wine & Spirits Ltd.",
  "CompanyDUNS": 69552750,
  "Company2DUNS": 0,
  "OperatorName": "Columbia Crest Winery",
  "OperatorStr1": "P. O. Box 231",
  "OperatorStr2": null,
  "OperatorCity": "Paterson",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99345",
  "OperatorZipCodeExt": "0231",
  "RMPContact": "Tom Sommerfeldt",
  "RMPTitle": "Director of Safety Services",
  "FTE": 150,
  "OtherEPAFacilityID": "WAD980977938",
  "EPAFacilityID": "100000014245",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-10-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 45.95639,
  "FRS_Long": -119.60806,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45470,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 31332,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 46470,
          "ProcessID": 45470,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60046,
          "ProcessID": 45470,
          "ChemicalID": 56,
          "Quantity": 14500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560046,
          "ProcessID": 45470,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31332,
      "SummaryText": "The Columbia Crest Winery is a manufacturer and bottler of premium wines in the Columbia Valley. The winery consists of a single structure that is mostly surrounded by vineyards and other agricultural land. It is located approximately one mile from the commercial center of Paterson, Washington, and it has a public retail shop in a structure that is attached to the winery building. The structure also contains a warehouse and receiving/shipping facility, offices, and a grape receiving system.\n\nThe anhydrous ammonia refrigeration process cools the building space, as well as wine stored in tanks. Gaseous ammonia is separated from pressurized liquid ammonia in two accumulator pressure vessels, after which the gaseous ammonia is compressed and condensed. The condensed liquid ammonia is stored in a single receiver-dryer pressure vessel. When needed, the liquid ammonia is pumped to evaporators or expansion valves on the tank jackets to provide cooling. Ammonia fluid is then pumped back to the accumulators. A computer-based remote monitoring and control system provides process control. Through the process control system, ammonia flow is controlled remotely or automatically through the use of temperature monitoring sensors. The control system can also remotely shut some of the main valves in the winery in order to isolate the equipment in the event of an ammonia leak.\n\nThe prevention program includes preventive maintenance, such as regular scheduled compressor and pump disassembly, inspection, and replacement of wearable parts and seals. Critical parts are inspected regularly, and tests are performed of the automatic shutoff equipment to ensure that the shutoffs will work in an emergency. Only trained experts are allowed to work on the equipment, and a contractor that has extensive experience in industrial ammonia refrigeration systems designs all major repairs and modifications.\n\nThe facility has an on-site emergency response team that has been trained and that operates in c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31332,
      "SummaryText": "onformance with the OSHA HAZWOPER regulations. Among company employees that are trained in the response methods for ammonia releases are the mechanics that maintain the ammonia refrigeration system and the safety professionals that coordinate the program and provide emergency medical care. While the facility has not had a major ammonia leak, the team has responded to an ammonia leak at a nearby agricultural produce processing facility after being requested by the local emergency response authority (the Paterson Fire Department). In fact members of the local fire department have attended the facility?s emergency response training sessions.\n\nSpecific safety features of the ammonia refrigeration system are as follows:\n-Emergency king valve remote shutoff, closing the outlet valve of the receiver-dryer; as long as power is available the compressors continue to evacuate the lines and the condensers and pumps continue to collect liquid ammonia in the receiver-dryer.\n-Automatic compressor shutoffs are activated at low suction pressure, high discharge pressure, high discharge temperature, high oil temperature, low oil pressure, high motor amps; check valves allow isolation of one or more compressors while the rest of the system continues to operate.\n-Redundant pressure relief valves on each pressure vessel automatically activate when pressure is higher than the design pressure; receiver-dryer and compressors will release at a pressure of 250 psi, while accumulators, chilled water system, and wine cooler will release at 150 psi.\n-Isolation valves that allow for minimizing releases in the event of a leak; some isolation valves are remotely activated.\n-Compressors have one-way check valves and liquid pumps have double mechanical seals.\n-Automatic computer-based process control system monitors the flow of ammonia and activates automatic alarms and shutdowns if parameters are outside of pre-set limits, or if any major component fails.\n-Accumulators have high and low level sensor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31332,
      "SummaryText": "s with automatic pump activation switches and alarms if a pump fails.\n-All ammonia piping is outside the authorized range of vehicle traffic to minimize the chances of a collision, either through elevation, barriers, or restricted travel warning signs.\n-All ammonia piping and valves are Schedule 80 and are specifically designed and manufactured for ammonia service; piping slopes downward toward the receiver-dryer so that liquid ammonia will flow in that direction in the event of a power failure.\n-Ammonia detectors activate a louvered opening and high capacity exhaust fan in the compressor room.\n\nThere is a detailed emergency response and evacuation assessment procedure in place for ammonia releases. The emergency response to a release that may migrate off-site will be coordinated through the Paterson Fire Department; the senior fire department official will assume control of the emergency response and public notification. \n\nThere have been no ammonia releases at the winery that have caused on-site injuries or that caused off-site evacuations or injuries."
    }
  ]
}