{
  "FacilityID": 3142,
  "FacilityName": "Greater Greensburg Wastewater Treatment Plant",
  "FacilityStr1": "210 West Otterman Street",
  "FacilityStr2": null,
  "FacilityCity": "Greensburg",
  "FacilityState": "PA",
  "FacilityZipCode": "15601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42129",
  "LEPC": "Westmoreland County LEPC",
  "FacilityLatDecDegs": "40.268611",
  "FacilityLongDecDegs": "-79.558056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Greater Greensburg Sewage Authority",
  "OperatorStr1": "240 West Otterman Street",
  "OperatorStr2": "P.O. Box 248",
  "OperatorCity": "Greensburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15601",
  "OperatorZipCodeExt": "0248",
  "RMPContact": "James Cherubini",
  "RMPTitle": "Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000038746",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-10 00:00:00",
  "SafetyInspectionBy": "Reliance National Indemnity",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-02-22 00:00:00",
  "DeRegistrationEffectiveDate": "2016-09-01 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.26724,
  "FRS_Long": -79.5592,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3519,
      "AltID": null,
      "FacilityID": 3142,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3592,
          "ProcessID": 3519,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3762,
          "ProcessID": 3519,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503762,
          "ProcessID": 3519,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3142,
      "SummaryText": "Greater Greensburg Sewage Authority\nWastewater Treatment Plant\nRisk Management Program\n\nExecutive Summary\n\nA. The accidental release prevention policy at the Greater Greensburg Sewage Authority's wastewater treatment facility involves a combined effort between management, operating and local emergency personnel.  The facility has an ongoing effort to identify hazards, review safety techniques, and implement employee training through operation, maintenance and inspection procedures to manage the risk of a chlorine gas release.\n\nB. The Greater Greensburg Sewage Authority's, wastewater treatment facility was originally placed into operation in 1965.  The facility was expanded in 1992.  The facility currently has the capacity of treating 6.75 million gallons per day of wastewater.  Gaseous chlorine, which is stored in a separate room, is utilized to disinfect the effluent prior to discharging to the receiving water.  The amount of chlorine handled is two-ton containers for a total of 4,000 pounds.  The chlorine gas feeders are wall-mounted and are designed for conveying the gas under vacuum.  The chlorine system is inspected daily by the wastewater treatment plant operating personnel.  The facility is manned 17.5 hours per day.\n\nC. The offsite consequence analysis includes consideration of two chlorine release scenarios, identified as \"worst case\" and \"alternate case\".  EPA's RMP Guidance for Wastewater Treatment Plants Reference Tables were utilized in the evaluation of both scenarios.\n\nAs defined by EPA, the worst case analysis is based upon a release of chemical in a quantity equal to the greatest amount held in a single vessel over a period of 10 minutes.  In the case of the Greater Greensburg wastewater treatment plant, the release quantity would equal 2,000 pounds.  Utilizing EPA's assumptions, a distance to toxic endpoint of 1.3 miles and an estimate of population potentially affected of 17,000 people resulted.\n\nThe alternate release scenario involves the misalig"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3142,
      "SummaryText": "nment of the lead washer on the controller, causing a chlorine gas leak through an opening 3/16\" diameter.  For this scenario, it was assumed that the leak started at the same time the wastewater treatment facility became unmanned.  Since there is only a warning light and a computer print out with no sounding alarm in the event of a chlorine leak, it was assumed that the leak would go unnoticed for the entire duration of the treatment facility being unmanned (approximately 7.5 hours).  Again utilizing EPA's assumptions relative to meteorological conditions and a chlorine release rate of 5 pounds/minute, a distance to toxic endpoint of 0.1 mile and an estimate of population potentially affected of 100 people resulted.  In the determination of an \"alternate case\" scenario, actuation of the chlorine detector and availability of the ton-cylinder repair kit were both considered.  Another form of active mitigation present at the Greater Greensburg Wastewater Treatment Plant is the vacuum-type chlorinators with some of the chlorine gas piping under pressure, with pressure relief valves and some of the chlorine gas piping under vacuum.\n\nD. In general, the Greater Greensburg Treatment Facility's accidental release prevention program is based on the following:\n\n* Compilation of safety information for chlorine storage\n* Review of potential on-site hazards of the chlorine process\n* Preparation of written operating procedures for safely conducting any activity involving the chlorination process\n* Implementation of employee training program\n* Preparation of written maintenance and inspection techniques and schedule for safe operation of the chlorine system\n\nAs an integral part of the prevention program, the Greater Greensburg Sewage Authority will perform a compliance audit at least once every 3 years.  The compliance audit will include a review of all aspects of the risk management program in conjunction with corrective actions if any deficiencies exist.  Written documentation o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3142,
      "SummaryText": "f the audit will be maintained on-site.\n\nAny incident that results in, or could have resulted in, a catastrophic release of chlorine will be investigated immediately.  A summary of the investigation and corrective actions will be documented and maintained at the treatment facility.\n\nChemical-specific prevention measures include the facility having the appropriate safety equipment on-site including a chlorine detection device, self-contained breathing apparatuses, and a ton-cylinder repair kit.  The facility promotes training and educating the employees relative to acceptable operating and handling techniques of chlorine gas.\n\nE. No accidental releases of chlorine have occurred at this facility in the past five years.\n\nF. The facility is included under the Local Emergency Planning Committee (LEPC) of Westmoreland County's written emergency response plan.  Release response procedures by all involved parties, evacuation procedures, and training exercises are included within the plan.  The public is to be notified by the County Emergency Management Agency as soon as a release occurs.  Evacuation route has been mapped within the plan.  The plan is reviewed/updated annually by the facility emergency coordinator.\n\nThe Greater Greensburg Wastewater Treatment Plant employees will not respond to accidental releases of chlorine gas.  Emergency responders will include the local fire department, police department, emergency medical service, and HAZMAT team.\n\nG. There are no actions planned to improve safety regarding the chlorine system at this time."
    }
  ]
}