{
  "FacilityID": 31430,
  "FacilityName": "Murrells Inlet Wastewater Treatment Plant",
  "FacilityStr1": "1441 Pond Road",
  "FacilityStr2": null,
  "FacilityCity": "Murrells Inlet",
  "FacilityState": "SC",
  "FacilityZipCode": "29576",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45043",
  "LEPC": "Georgetown County LEPC",
  "FacilityLatDecDegs": "33.574278",
  "FacilityLongDecDegs": "-079.022306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": "www.gcwsd.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 556984730,
  "ParentCompanyName": "Georgetown County Water and Sewer District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Georgetown County Water and Sewer",
  "OperatorStr1": "P. O. Box 2730",
  "OperatorStr2": null,
  "OperatorCity": "Pawleys Island",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29585",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000067198",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-08-27 00:00:00",
  "DeRegistrationEffectiveDate": "2020-08-18 00:00:00",
  "AnniversaryDate": "2009-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 33.561944,
  "FRS_Long": -79.085278,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45610,
      "AltID": "Sewage Treatment Facility",
      "FacilityID": 31430,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60219,
          "ProcessID": 45610,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46612,
          "ProcessID": 45610,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26151,
              "Process_NAICS_ID": 46612,
              "SafetyReviewDate": "2009-05-05 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-05-05 00:00:00",
              "TrainingReviewDate": "2009-01-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-05-05 00:00:00",
              "EquipmentInspectionDate": "2009-06-02 00:00:00",
              "EquipmentTested": "valves, chlorinator, injectors, piping",
              "ChangeMgmtDate": "2003-04-30 00:00:00",
              "ChangeMgmtReviewDate": "2009-06-01 00:00:00",
              "PreStartupReviewDate": "1999-04-06 00:00:00",
              "ComplianceAuditDate": "2004-02-24 00:00:00",
              "AuditCompletionDate": "2004-02-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-10 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-10 00:00:00",
              "ContractorSafetyReviewDate": "2003-04-30 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38225,
                  "PreventionProgram3ID": 26151,
                  "ProcessChemicalID": 60219
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31430,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-06-01 00:00:00",
    "ERTrainingDate": "2009-01-15 00:00:00",
    "CoordinatingAgencyName": "Georgetown Co. Civil Defense",
    "CoordinatingAgencyPhone": "8435466869",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31430,
      "SummaryText": "1.  The Georgetown County Water and Sewer District owns and operates the Murrells Inlet Wastwater Treatment Plant on Pond Road in Murrells Inlet, South Carolina.  The District is committed to providing Georgetown County employees a safe working environment.  To ensure this environment, the District has establish safe working practices, standard operating procedures, and accident prevention programs.  Management is dedicated to training employees on proper operating procedures, emergency response, and equipment use.  To prevent accidential releases of chemicals, the District follows all applicable sections of the United States Environmental Protection Agency (EPA) Prevention Program.  In the event of a release, the District has an in-house emergency response team.  The team is equipped with all items necessary to respond to a chlorine spill or leak.\n2.  The Murrells Inlet Wastwater Treatment Plant treats domestic and industrial wastewater from the surrounding area.  The plant consist of a bar screen, two oxidation ditches, two clarifiers, a chlorine contact chamber, dechlorination chamber and a post-aeration/effluent pump station.  The chlorination system, installed at the plant to disinfect the effluent flow before discharging the treated wastewater, is housed in a control building where the chlorinators, safety equipment and instrumentation are located.  The plant is equipped to use chlorine from one-ton cylinders under normal operation.  The chlorine is fed as a gas from one-ton cylinders to a chlorinator which mixes the gas with a stream of water.  The resultant chlorine solution is fed to a mixing chamber adjacent to the chlorine contact tanks.   The Murrells Inlet wastewater Treatment Plant typically has 2 one-ton cylinders for a total of 4,000 pounds.\n3.  For the Process Hazard Analysis, toe release scenarios, a worst-case release and alternate release scenario, were evaluated for impact on the plant and its surroundings.  The worst-case release, as define"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31430,
      "SummaryText": "t.  The resultant distance to toxic endpoint was 0.56 miles.  Approximately 1,600 people, a schoolm, and a recreational area would be affected.  No passive mitigation has been considered at the wastewater treatement plant.  The installation of chlorine detectors and alarms in conjunction with a trained emergency response team have prepared the Georgetown County Water and Sewer District for a chemical release.  In the event of a release the response team can evaluate and contain the situation.  The District has on-site Chlorine Institute Emergency Repair Kits for the chlorine sylinders to aid the team in controlling the release. \n4.  The Georgetown Countu Water And Sewer District follows the EPA guidelines for Risk Management and the guidelines established by OSHA for Process Safety Management.  The two codes require the District to evaluate the on and off site risks associated with a highly hazardous chemical and ensure that proper precautions and plans are implemented to minimize the impact of such release.  The District completed a Process Hazard Analysis to review the causes and effects of a chemical release.  To aid in the prevention of a leak, the District has established a preventative maintenance program to keep the chlorine equipment in optimum condition.  Any equipment not in proper working order is immediately evaluated for repair or replacement.  In addition to a preventative maintenance program, the District has established standard operating procedures in conjunction with the Chlorine Institute and manufacturer's recommendations.  Employees are required to folow the standard procedures at the plant, especially near a highly hazardous chemical area.  All employees are trained prior to exposure to equipment and provided refresher training at least every three years.  Chemical awareness is discussed both in training and during monthly safety meetings where employees can discuss any hazards or portential hazards of the chlorine system.  Chemical specific pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31430,
      "SummaryText": "evention steps include the installation of the gas monitors and alarm system.  Self-contained breathing apparatus, gloves, goggles and aprons are available for employees for protection against a chlorine leak.  \n5.  The Pawleys Island Wastewater Treatment Plant is covered under the Georgetown County Water And Sewer District's Emergency Response Plan.  The District works in conjunction with the Georgetown County Civil Defense for emergency response to the wastewater treatment plant.\n6.  No official safety improvements are scheduled at this time.  The Water & Sewer District is currently using the Communicating Your Chlorine Risk Management Plan guideline from the Chlorine Institute to provide public awareness of the hazards associated with the chlorine system and address public concerns."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31430,
      "SummaryText": "d by EPA, is the greater of the following: (1) For substances in a vessel, the greatest amount held in a single vessel, taking into accunt administrative controls that limit the maximum quanitity; or (2) For substances in pipes, the greatest amount in a pipe, taking into account administrative controls that limit the maximum quantity¿ as a liquid under pressure, the owner or operator shall assume that the quantity in the vessel or pipe ¿ is released as a gas over 10 minutes.  The alternative scenario is one more likely to occur than the worst-case release scenario.  The wrost-case scenario for the Murrells Inlet Wastewater Treatment Plant evaluated the release of 2,000 pounds of chlorine as a gas within a ten-minute time span.  The release was modeled using the EPA modeling tool, RMP*Comp to determine the distance to toxic endpoint.  The distance to toxic endpoint is the distance the vapor cloud will travel before the maximum airborne concentration reaches a level that nearly all individuals can be exposed for up to one-hour without experiencing or developing irreversible or other serious health effects.  For the chlorine system at the wastewater treatment plant, the release of one ton-cylinder (2000 pounds) would travel 2.2 miles before reaching its toxic endpoint.  This distance accounts for the EPA-mandated meteorological conditions, namely Stability F, wind speed of 1.5 m/sec, highest maximum daily temperature of 116 degreesF and average humidity of 65%.  Approximately 2,900 people, schools, recreation areas, and commercial/industrial areas would be affected.  The Intracoastal Waterway is an environmental receptors for the worst-case spill.  The alternative release scenario involves a vapor release from a tubing failure at a rate of 10.5 pounds per minute for 60 minutes.  The release was modeled in AWWA's Compliance Guidance and Model Risk Management Program.  The release accounted for a wind speeds of 3.0 m/sec, and Stability Calss D in a rural environmen"
    }
  ]
}