{
  "FacilityID": 31551,
  "FacilityName": "Dynaflex Division of Cartex",
  "FacilityStr1": "410 Factory Road",
  "FacilityStr2": null,
  "FacilityCity": "Addison",
  "FacilityState": "IL",
  "FacilityZipCode": "60101",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17043",
  "LEPC": "Dupage County LEPC",
  "FacilityLatDecDegs": "41.913889",
  "FacilityLongDecDegs": "-087.999444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48953954,
  "ParentCompanyName": "Woodbridge Holdings",
  "Company2Name": null,
  "CompanyDUNS": 161659883,
  "Company2DUNS": null,
  "OperatorName": "Cartex Corporation",
  "OperatorStr1": "410 Factory Road",
  "OperatorStr2": null,
  "OperatorCity": "Addison",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60101",
  "OperatorZipCodeExt": null,
  "FTE": 96,
  "OtherEPAFacilityID": "60101CRTX410FA",
  "EPAFacilityID": "100000080057",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "043005AAG",
  "SafetyInspectionDate": "1997-07-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2008-10-10 00:00:00",
  "AnniversaryDate": "2009-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 41.913954,
  "FRS_Long": -87.999129,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45766,
      "AltID": "Polyurethane Foam",
      "FacilityID": 31551,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60411,
          "ProcessID": 45766,
          "ChemicalID": 77,
          "Quantity": 73000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46782,
          "ProcessID": 45766,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 17676,
              "Process_NAICS_ID": 46782,
              "SafetyReviewDate": "2004-02-23 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-05-19 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-20 00:00:00",
              "TrainingReviewDate": "2004-03-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-12 00:00:00",
              "EquipmentInspectionDate": "2004-05-12 00:00:00",
              "EquipmentTested": "The ISO Tank farm,ISO skid and piping are inspected daily during production per the maintenance schedule. The maintenance schdules are detailed in the equipment manuals.",
              "ComplianceAuditDate": "2002-04-25 00:00:00",
              "AuditCompletionDate": "2002-10-25 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2004-02-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18444,
                  "PreventionProgram2ID": 17676,
                  "ProcessChemicalID": 60411
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31551,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-12 00:00:00",
    "ERTrainingDate": "2004-05-01 00:00:00",
    "CoordinatingAgencyName": "Addison fire Department",
    "CoordinatingAgencyPhone": "6306283100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31551,
      "SummaryText": "EPA's RISK MANAGEMENT PLAN\r\nEXECUTIVE SUMMARY\r\nFOR \r\nDYNAFLEX \r\n\r\n1.\tAccidental release prevention and emergency response policies.\r\n\r\nThe Dynaflex Plant, as part of the Woodbridge Group of companies, believes the health and safety of its employees and the protection of the natural environment, should be of the utmost concern in the operation of its business.  We are committed to operating and maintaining all of our processes in a safe and responsible manner.\r\n\r\nIt is our policy to:\r\n\r\n* Comply with all applicable laws, regulations, and standards.\r\n* Review and assess our operations for the purpose of making health, safety & environmental improvements.\r\n\r\nOur complete Heath Safety & Environmental policy statement, signed by our plant manager, is posted in the lobby of our facility. \r\n\r\nWe use a combination of prevention programs and emergency response planning, which are described later in this document, to help ensure the safety of our employees and the public as well as protection of the environment. Our Plant Manager has the overall responsibility for ensuring that our facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our risk management program.  To ensure that our risk management program is appropriately developed and implements, our Plant Manager has assigned the role of RMP coordinator to a staff member with the background, training, and experience necessary to manage the program. The RMP Coordinator, acting with the authority delegated directly from the Plant Manger, is responsible for coordinating the development, implementation and integration of the RMP elements as is required under Section 68.15 of the RMP rule. \r\n\r\n2.\tThe stationary source and regulated substances handled.\r\n\r\nThe primary purpose of the Dynaflex Plant is to produce polyurethane foam seat cushions for the automotive and furniture industry. The foam is made by high pressure mixing of chemicals immediately prio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31551,
      "SummaryText": "r to pouring the mixture into a mold that is attached by carrier to a continuously moving line. The mold moves through a curing oven. Upon exiting the oven, the foam pads are removed from the mold, crushed, trimmed and prepared for shipment to customers. Toluene Diisocyanate (TDI), which is regulated by EPA's risk management program rule, is one of the reactants required to manufacture polyurethane foam. TDI is received at the plant by tanker truck. It is stored in 3 tanks in the TDI bulk storage tank farm located inside the plant building.  The TDI is transferred to the process utilizing a computer-controlled system. \r\n\r\nAccess to the site is restricted to authorized facility employees, management personnel, and contractors. The maximum amount of TDI that can be stored at this facility is 72,000 pounds.\r\n\r\n3. Off-site consequence analysis scenarios \r\n\r\nEPA's RMP rule requires that we provide information about the worst-case release and alternative release scenario's for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.  \r\n\r\n The methodology used to determine the distance to the toxic endpoint was Aloha version 5.3.1 for plume modeling.  Climatological information was obtained from the National Climate Data Center.  The parameter used for the models were 95 degrees F, 70% average relative humidity, 1.5 m/sec wind speed and class B stability.\r\n\r\nWorst-case Release Scenario.\r\n Catastrophic failure of the North bulk storage tank would be the worst case scenario as defined by the RMP rule.  This tank has a capacity of 51,520 pounds of TDI.  However, it is never filled beyond 80 percent of capacity or 41,000 pounds.  This is controlled by the TDI unloading procedure, TDI ordering procedure and the high level alarm in the top of the tank.  The tank farm is enclosed in a diked area of 538 square feet with a height of two"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31551,
      "SummaryText": "feet. The maximum temperature the TDI could reach in the bulk storage tank is 80 degrees. The distance to the endpoint concentration of 0.007 mg/l is 33 feet.  The residential population is not affected by this worst-case scenario event.  \r\n\r\nAlternative Release Scenario. \r\n An accidental movement of the tank truck severs a 20-ft length of 2-inch hose would trigger a release of TDI.  Operator intervention stops the flow, and only the contents of the hose are released.  The resulting liquid forms a pool with a depth of 1 cm that evaporates to form a toxic cloud, which disperses downwind.  The distance to the endpoint concentration of 0.007 mg/l is 32.7 ft.   This release has the possibility of extending beyond the facility boundary.\r\n\r\n4.\tThe general accidental release prevention program and the specific prevention steps. \r\n\r\nWe take a systematic, proactive approach to preventing accidental releases of chemicals. Our management systems for our TDI process address each of the key features of successful prevention programs including: \r\n\r\nSafety information \r\nHazard reviews of our processes\r\nOperating procedures\r\nTraining\r\nEquipment Maintenance Program\r\nRMP Compliance Audits\r\nAccident/Incident Investigation\r\nContractor Use\r\nHot Work Permits\r\n\r\nIn addition, we have an established Isocyanate Control Program which outlines the hazards of handling toluene diisocyanate and the controls which are in place to reduce the hazards of isocyanate exposure to the employees, the community and the environment.\r\nThese listed individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we conduct business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\r\n\r\n\r\n5.\tFive-year accident history. \r\n\r\nWe have not had any TDI releases that qualify for listing in the EPA's"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31551,
      "SummaryText": "required five-year accident history report. We have had small releases of TDI in the past five years. Each release occurred inside the facility buildings with no resulting injuries, property damage, or environmental impact.  A thorough and complete investigation of each of these releases was conducted in accordance with our accident/incident investigation program, root cause was determined, and appropriate corrective action taken.\r\n\r\n6. The emergency response program.\r\n\r\nWe maintain an integrated contingency plan, which consolidates the various federal, state and local regulatory requirements for emergency response planning.  Our program provided essential planning and training for effectively protecting workers, the public and the environment during emergency situations. \r\n\r\nThe Dynaflex plant has an in-house Emergency Response team and maintains the necessary equipment to respond to and mitigate a small release of isocyanate.  All members of the team have received training as required by OSHA 1910.120.  In addition to the in-house emergency responders, Dynaflex is a charter member of the Addison Fire Protection District ERU and has participated in training when offered.  The facility emergency response plan details the steps to be taken in the event of a small, large or catastrophic release of isocyanate. Should a catastrophic release occur Dynaflex has retained the services of a trained outside contractor to aid in the mitigation and clean up of such a release. In addition, The Addison Fire protection district has access to the building on off-hours through a \"suprasafe\" lock box.  The box contains building keys, MSDS's and additional information that would be need in the event of an emergency.  We have coordinated our program with the local emergency planning committee and the fire department. A representative of the Addison fire department routinely visits this plant to discuss how to respond to a release of TDI.  We have also given local hospitals information"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31551,
      "SummaryText": "regarding medical treatment for exposure to TDI.\r\n\r\n7. Planned changes to improve safety.\r\n\r\n\r\nAt this time we are continuing to maintain our current safety management systems.  In addition, we are investigating the possibilities for enhanced containment in our tanker truck unloading area. We also anticipate improving our training programs in the area of specific maintenance tasks."
    }
  ]
}