{
  "FacilityID": 31568,
  "FacilityName": "Unilever Bestfoods North America - Atlanta",
  "FacilityStr1": "1591 Murphy Ave. SW",
  "FacilityStr2": null,
  "FacilityCity": "Atlanta",
  "FacilityState": "GA",
  "FacilityZipCode": "30310",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13121",
  "LEPC": "Fulton County LEPC",
  "FacilityLatDecDegs": "33.710278",
  "FacilityLongDecDegs": "-084.425278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.unilever.com",
  "FacilityEmailAddress": "Jonathan.Jett-Parmer@Unilever.com",
  "FacilityDUNS": 1378892,
  "ParentCompanyName": "Conopco, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1375088,
  "Company2DUNS": null,
  "OperatorName": "Unilever Best Foods North America",
  "OperatorStr1": "1591 Murphy Ave. SW",
  "OperatorStr2": null,
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30310",
  "OperatorZipCodeExt": null,
  "FTE": 160,
  "OtherEPAFacilityID": "GAD984289132",
  "EPAFacilityID": "100000061782",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-08-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "99170GK",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-07-11 00:00:00",
  "DeRegistrationEffectiveDate": "2013-07-08 00:00:00",
  "AnniversaryDate": "2009-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 33.710278,
  "FRS_Long": -84.425278,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45784,
      "AltID": "Refrigeration System",
      "FacilityID": 31568,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60430,
          "ProcessID": 45784,
          "ChemicalID": 56,
          "Quantity": 18500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46800,
          "ProcessID": 45784,
          "NAICSCode": "311225",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26259,
              "Process_NAICS_ID": 46800,
              "SafetyReviewDate": "2001-10-18 00:00:00",
              "PHA_Date": "2004-03-11 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Transportation accident, bomb threat, and release at nearby facility.",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Grounded electrical system",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Engine room ventilation.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-08-22 00:00:00",
              "TrainingReviewDate": "2004-01-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-20 00:00:00",
              "EquipmentInspectionDate": "2004-03-26 00:00:00",
              "EquipmentTested": "Annual inspection of all vessels, compressors, and other system components performed by outside contractor based on IIAR guidelines.",
              "ChangeMgmtDate": "2004-03-12 00:00:00",
              "ChangeMgmtReviewDate": "2004-03-12 00:00:00",
              "PreStartupReviewDate": "2004-03-19 00:00:00",
              "ComplianceAuditDate": "2001-10-18 00:00:00",
              "AuditCompletionDate": "2004-10-01 00:00:00",
              "IncidentInvestigationDate": "1997-08-28 00:00:00",
              "InvestigationChangeDate": "1997-09-15 00:00:00",
              "ParticipationPlansReviewDate": "2003-01-22 00:00:00",
              "HotWorkPermitReviewDate": "2001-10-31 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-03 00:00:00",
              "ContractorSafetyEvalDate": "2001-12-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38367,
                  "PreventionProgram3ID": 26259,
                  "ProcessChemicalID": 60430
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31568,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-01-22 00:00:00",
    "ERTrainingDate": "2004-01-20 00:00:00",
    "CoordinatingAgencyName": "Fulton County LEPC",
    "CoordinatingAgencyPhone": "4047305600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31568,
      "SummaryText": "1.1    SOURCE\n\nThe Unilever Bestfoods North America (UBFNA) Atlanta, Georgia, margarine production facility is subject to the USEPA's Risk Management Program (RMP) for Accidental Chemical Release regulation (40 CFR 68) because it has a refrigeration system that contains more than the threshold quantity (10,000 pounds) of anhydrous ammonia (CAS Number 7664-41-7).  Anhydrous ammonia (NH3, is a gas at ambient conditions.  The anhydrous ammonia (ammonia) refrigeration system is used to control the processing and storage temperature for margarine and related products.  It is a closed system that contains ammonia in various physical states (gas, liquid, and saturated vapor).  Most of the ammonia equipment is located indoors.  The condensing towers, make-up air units, and some piping runs are located outdoors.\n\nAmmonia is the oldest and most common refrigerant in general industrial use throughout the world.  It is a high capacity refrigerant that operates at reasonable pressure.  Although exposure to ammonia is irritating and potentially toxic in large doses, personnel exposure to more than a small leak is rare because ammonia operates within a closed system of vessels, piping, and equipment.\n\n\n1.2    PROCESS DESCRIPTION\n\nThe ammonia refrigeration system is a two-stage system consisting of a high pressure side and a low pressure side.  The margarine processing units (MPUs) operate on the low pressure side to quickly freeze product.  Ammonia suction from the MPUs at about 0 psig passes through the low pressure accumulator before entering the booster compressors.  \n\nThe high side compressor suction draws from the intercooler (booster discharge) and the high side suction accumulator at bout 25 psig.  The major discharge from the high side compressors (hot gas) is directed to five condensing towers.  A portion of the hot gas is also used for defrosting and for operation of the pumper drums.\n\nThe condensed liquid is returned to the high pressure receiver where it is fed to the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31568,
      "SummaryText": "low and high pressure equipment.   \n\n\n2.0    PREVENTION PROGRAM\n\nTo help minimize the probability and severity of an ammonia release, a prevention program that satisfies the Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of Highly Hazardous Chemicals (29 CFR 1910.119) has been implemented.  The key components of the prevention program are summarized below:\n\n* The development, documentation, and operator availability of critical process safety information regarding the hazards of ammonia, the design basis of the system, and the equipment.  This information is used to fully understand and safely operate the ammonia refrigeration system.\n\n* The development of an extensive employee participation program, which includes UBFNA employees from all levels of the organization and from all areas within the plant (i.e., production and maintenance).  \n\n* The performance of a formal process hazard analysis (PHA) re-validation in 2004, using the What-if... technique.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the system.  The PHA addressed:  (1) process hazards; (2) previous incidents; (3) engineering and administrative controls applicable to the hazards; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  The PHA resulted in procedural and/or hardware recommendations to improve the safety and operation of the refrigeration system.  The PHA will be updated and revalidated every five years.\n\n* Written standard operating procedures (SOPs) were prepared to provide the basis for proper and safe operation of the ammonia refrigeration system.  The SOPs include procedures for normal operations, startup, shutdown, emergency operations, and emergency shutdown.  They als"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31568,
      "SummaryText": "o describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\n\n* Refrigeration system operators receive refresher training at least every three years.  The training content is based upon the process safety information and operating procedures.  The training program ensures that the operators understand the nature and causes of problems arising from system operations and serves to increase awareness with respect to the hazards particular to ammonia and the refrigeration process.\n\n* Events that might (or did) cause an accidental or unexpected release of ammonia are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent recurrence.\n\n* Contractors that are hired to work on, or adjacent to, the refrigeration system are pre-qualified based upon their knowledge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  \n\n* Prior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, grinding), management must approve the work by executing a written hot work authorization permit to verify that precautions to prevent fire have been implemented.\n\n* Replacement of all pressure relief valves occurs every five years.\n\n* Numerous of safety systems, including pressure relief valves, monitors, and ammonia vessel level controls and safety interlocks are used in the refrigeration system.\n\n* Periodic inspection is performed on liquid level sensors, temperature and pressure instruments, switches and shutdown devices that have safety implications.\n\n* Periodic inspections are performed for major powered equipment, including compressors, pumps and large fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure.\n\n* Proper design"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31568,
      "SummaryText": ", including adherence to recognized safety codes, such as the International Institute of Ammonia Refrigeration (IIAR).\n\n* Adherence to fire codes and preparation for fires, storms, or events which could impact the ammonia system.\n\n* Prevention program compliance audits are performed every three years to verify that the elements are being properly implemented.  Any deficiency found in an audit is corrected.\n\n\n3.0    ACCIDENT HISTORY\n\nThere have been no accidental releases of ammonia at the facility in the last five years that have resulted in death, injury, or significant property damage on site or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.\n\n\n4.0    EMERGENCY RESPONSE PROGRAM\n\nThe UBFNA facility has implemented a detailed written Emergency Response Plan (ERP).  The ERP is intended to address all emergencies at the facility, in addition to incidents related to a release of ammonia.\n\nThe ERP includes awareness and response training for employees, coordination with the local fire department, coordination with the Local Emergency Planning Committee (LERC), and evacuation of the facility and surrounding area.  The plan details what personal protective equipment and spill response equipment is available; identifies specific individuals, their 24-hour telephone numbers, and their responsibilities; identifies procedures for emergency medical care; and refers to other pertinent elements of the management system."
    }
  ]
}