{
  "FacilityID": 31577,
  "FacilityName": "Honeywell Nylon Inc.  - Columbia Plant",
  "FacilityStr1": "4401 St. Andrews Road",
  "FacilityStr2": null,
  "FacilityCity": "Columbia",
  "FacilityState": "SC",
  "FacilityZipCode": "29210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45063",
  "LEPC": "Lexington County LEPC",
  "FacilityLatDecDegs": "34.048056",
  "FacilityLongDecDegs": "-081.156389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ShawIndustries.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3361987,
  "ParentCompanyName": "Shaw Industries Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 45840055,
  "Company2DUNS": 45840055,
  "OperatorName": "Honeywell International Inc.",
  "OperatorStr1": "PO Drawer 2128",
  "OperatorStr2": null,
  "OperatorCity": "Dalton",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30722",
  "OperatorZipCodeExt": "3812",
  "FTE": 522,
  "OtherEPAFacilityID": "29210LLDFB4402S",
  "EPAFacilityID": "100000019151",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-1560-0016",
  "SafetyInspectionDate": "2004-04-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 34.047222,
  "FRS_Long": -81.151361,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45795,
      "AltID": null,
      "FacilityID": 31577,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60441,
          "ProcessID": 45795,
          "ChemicalID": 31,
          "Quantity": 63200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46811,
          "ProcessID": 45795,
          "NAICSCode": "32521",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 46812,
          "ProcessID": 45795,
          "NAICSCode": "32522",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31577,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-19 00:00:00",
    "ERTrainingDate": "2004-04-22 00:00:00",
    "CoordinatingAgencyName": "Irmo Fire Department",
    "CoordinatingAgencyPhone": "8037984979",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CERCLA",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31577,
      "SummaryText": "RMP*Submit Executive Summary\n                                                                            Honeywell Nylon Inc.\n                                                                                 Columbia Plant\n\n\n\n\nAbout Honeywell:\n\nThe Honeywell Nylon Inc. Columbia Plant is a manufacturing facility located in Columbia, South Carolina.  It is part of the Specialty Materials business group of Honeywell International Inc.\nHoneywell International is a $23 billion diversified technology and manufacturing leader, serving customers worldwide with aerospace products and services; control technologies for buildings, homes and industry; automotive products; turbochargers; and specialty materials.  Headquartered in Morris Township, N.J., Honeywell International¿s shares are traded on the New York, London, Chicago and Pacific Stock Exchanges. \n\nHoneywell Specialty Materials, also based in Morris Township, N.J., is a business group of Honeywell International and a global leader in providing high-performance specialty materials such as fluorocarbons, specialty films, advanced fibers, customized research chemicals and intermediates.\n\nHoneywell Nylon is a wholly owned subsidiary of Honeywell International.  Honeywell Nylon is a fully integrated producer of Nylon 6 carpet fibers and resins, automotive and textile fibers, specialty polymers and chemical intermediates. Honeywell Nylon is based in Charlotte, N.C., and has manufacturing facilities in the Eastern U.S, Canada and China.\n\n \nHealth, Safety and Environment / Responsible Care:\n\nHoneywell Nylon is committed to managing health, safety and the environment as a core business value. The company also integrates health, safety and environment into all aspects of our businesses as a competitive advantage in achieving profitable growth and accelerated productivity.\n\nHoneywell Nylon participates in the Responsible Care program of the American Chemistry Counci"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31577,
      "SummaryText": "l.  Established in 1988, Responsible Care is a voluntary program focused on achieving improvements in environmental, health and safety performance beyond levels required by the U.S. government\n\nIn addition to detailing practices for the safe use of materials and requiring audits, the Responsible Care initiative requires its member and partner companies to develop mechanisms for outreach with the communities in which they operate. Community Advisory Panels (CAP) serve as important links between chemical facilities and their neighboring communities.  Honeywell Nylon subscribes to the Responsible Care initiative.\n\n\nHoneywell Nylon Columbia Plant:\n\nThe Honeywell Nylon Columbia plant is a nylon resin and fiber manufacturing facility that has approximately 525 employees. The plant¿s products are used to make a variety of different types and styles of nylon carpeting, woven and knitted nylon performance fiber products, and a multitude of plastic products from automobile parts to food wrap films.  The one material used by the facility which is on the RMP Rule's list of regulated substances is cyclohexylamine.  The Columbia plant's storage and use of cyclohexylamine exceeds the specified threshold of 15,000 lbs., as defined by the EPA¿s RMP Rule.  \n\n\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for the Honeywell Nylon Inc., Columbia plant: \n\n1) Accidental Release Prevention and Emergency Response Policies: \n\nIt is the policy of the Honeywell Nylon Columbia plant to operate a safe and environmentally sound facility by identifying and controlling health, safety, and environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to ensure that all laws and regulations applicable to its operations and products are kno"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31577,
      "SummaryText": "wn and observed.  The accidental release prevention and emergency response policy associated specifically with the plant's use of cyclohexylamine involves the integration of safety devices and technologies inherent in the design of the process, safe operational procedures and management practices, operator training, the preparation and testing of site emergency response plans, the maintenance of onsite emergency response equipment and a professionally trained Safety Brigade, coordinating our efforts and resources with local emergency response services, and communicating with the community. \n\n2) Description of the Facility and the Regulated Substance Handled:  \n\nThe Honeywell Nylon Inc., Columbia Plant uses cyclohexylamine as a additive in the manufacturing of nylon.  It is stored and handled in quantities that exceed the threshold quantity specified in the RMP Rule.  The Plant's stationary source of cyclohexylamine consists of bulk storage and process distribution equipment located as part of the Carpet Fibers Polymer Department on the eastern side of the Plant site.  Cyclohexylamine is purchased from an outside vendor and is delivered to the Plant via tank truck on an \"as needed\" basis.  The tanker's contents are unloaded by Plant operators into an above ground bulk storage tank identified as VT-902 which is located in an outdoor tank park.  The maximum capacity of the bulk storage tank is 54,000 lbs.  Cyclohexylamine is pumped from the bulk storage tank through an enclosed piping system into the production areas where it is fed into the nylon polymerization process units.  \n\n3) The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  \n\nThe general accidental release prevention program at the Honeywell Nylon Inc., Columbia Plant for the cyclohexylamine stationary source includes the following elements: a) established process safety management system for oversight and control of the cyclohexylamine process; b) development and implem"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31577,
      "SummaryText": "entation of accurate procedures for safe operation and maintenance of the process;  c) an on-going mechanical integrity program that ensures critical process equipment is designed, constructed, and installed in accordance to codes and standards and is also inspected, tested and proactively maintained;  d) performance of process hazards analysis with prompt resolution of any recommendations;  e) use of safety shutdown, relief and vent systems, interlocks, dikes and other secondary containment installations, control instrumentation, and process monitoring for early warning and detection;  f) implementation of procedures designed to review and manage changes to the process;  g) performance of incident investigations, process safety compliance audits, and pre-startup safety reviews; and  h) a thorough area-specific training program for process operators and maintenance personnel.  \nChemical-specific prevention steps include:  a) developing an understanding among the operators for the hazardous properties of cyclohexylamine, the process chemistry and safe operational process limits such as temperatures, pressures, and flows;  b) understanding the benefits of safe chemical handling and the consequences of process deviations and inadvertent mixing of incompatible chemicals;  c) having knowledge of the requirements, capabilities and limitations of both personal protective and emergency response equipment and maintaining easily accessible inventories of each;  d) designing the process technology and process equipment based on a thorough understanding of the hazardous properties of cyclohexylamine; and e) providing operators with specialized training from the manufacturer of cyclohexylamine regarding its hazards and proper handling procedures. \n\n4) The Five Year Accident History:  \n\nNo accidental releases from the cyclohexylamine stationary source have occurred at the Honeywell Nylon Inc., Columbia Plant in the past 5 years.   \n\n5) The Emergency Response Plan:  \n\nThe Honeywel"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31577,
      "SummaryText": "l Nylon Inc., Columbia Plant has an emergency preparedness planning and response program designed to deal with accidental releases and other unplanned events associated with the facility's stationary source involving cyclohexylamine.  The Plant has a written Emergency Response Plan that addresses various types of contingencies including specific actions for responding to an accidental release of cyclohexylamine.  The Plan provides for both internal Plant and external community emergency alerting and notification with established call trees with multiple means of communication.  The Plan addresses emergency health care, in-place sheltering, evacuation, and implementation of an Incident Command System to direct and coordinate the Plant's response activities.  The Plan has been coordinated with the LEPC and with the local Fire Department who would direct offsite community response activities.  All members of the local Fire Department visit the Plant annually to receive training on the Site's RMP Program, the source location and hazards of cyclohexylamine, the Site Emergency Response Plan and emergency response resources, and are taken on a tour of the facility.  The 2004 visit by the Fire Department for RMP cross training at the Columbia Plant was in April.  The Fire Department's fire station is physically located immediately next door to the Plant on adjoining property.  The Honeywell Nylon Columbia Plant maintains its own professionally trained Safety Brigade which is knowledgeable and prepared to respond to incidents involving accidental releases of cyclohexylamine.  The Safety Brigade trains monthly and holds annual Plant emergency response drills and exercises.  Joint training exercises are conducted with members of the local Fire Department response group.  In-house testing and audits of the Plant's emergency response alarm and communication systems are performed weekly. \n\n6) Planned Changes to Improve Safety:  \n\nThe Process Hazard Analysis of the Honeywell Nylon"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 31577,
      "SummaryText": "Inc., Columbia Plant's covered process and stationary source of cyclohexylamine was revalidated and updated in July and August of 2003.  As a result of this systematic safety review, several action items were identified and resolved to further improve the existing safeguards of the covered source and to further reduce the potential for an accidental release.  The Process Hazard Analysis for the cyclohexylamine stationary source and covered process will be reviewed and revalidated every five years.  In 2002 the Columbia Plant purchased ten (10) new self contained breathing apparatus units (SCBAs), eleven (11) two way walkie - talkie radios and a foam fire fighting unit to augment emergency response capabilities for accidental releases of cyclohexylamine.  Even though air dispersion modeling results for the worst case release scenario of cyclohexylamine from the facility's largest container, VT-902, show that the distance the vapors travel to reach the toxic endpoint concentration would not exceed the Plant's property line,  the Honeywell Nylon Columbia Plant plans to relocate the VT-902 vessel approximately 800 feet further back from its existing location in a direction away from the Plant's property line and the Plant's predominant employee population and process control operational areas."
    }
  ]
}