{
  "FacilityID": 3159,
  "FacilityName": "Onondaga Cogeneration Facility",
  "FacilityStr1": "300 Bridge Street",
  "FacilityStr2": null,
  "FacilityCity": "Syracuse",
  "FacilityState": "NY",
  "FacilityZipCode": "13209",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36067",
  "LEPC": "Onondaga County LEPC",
  "FacilityLatDecDegs": "43.065833",
  "FacilityLongDecDegs": "-76.214722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Onondaga Cogeneration Limited Parnership",
  "Company2Name": null,
  "CompanyDUNS": 869023952,
  "Company2DUNS": null,
  "OperatorName": "Onondaga Cogeneration Limited Partn",
  "OperatorStr1": "300 Bridge Street",
  "OperatorStr2": null,
  "OperatorCity": "Syracuse",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13209",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": "NY0000202135",
  "EPAFacilityID": "100000039166",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "313200-2040",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": "1999-06-17 00:00:00",
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2014-02-26 00:00:00",
  "DeRegistrationEffectiveDate": "2011-05-31 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.06691,
  "FRS_Long": -76.21732,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3539,
      "AltID": "Ammonia System",
      "FacilityID": 3159,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 3783,
          "ProcessID": 3539,
          "ChemicalID": 57,
          "Quantity": 41000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3612,
          "ProcessID": 3539,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 2219,
              "Process_NAICS_ID": 3612,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API-620, NYCRR Title 6 Chapter V Subchapter D Part 599",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-02 00:00:00",
              "ChangeCompletionDate": "1999-07-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Truck Containmnent",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-06-01 00:00:00",
              "TrainingReviewDate": "1998-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-01-01 00:00:00",
              "EquipmentTested": "Tank Inspection and Level Transmitter Calibration",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2259,
                  "PreventionProgram2ID": 2219,
                  "ProcessChemicalID": 3783
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3159,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1998-10-01 00:00:00",
    "CoordinatingAgencyName": "Onondaga County Emergency Mgmt Offi",
    "CoordinatingAgencyPhone": "3154352525",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3159,
      "SummaryText": "Risk Management Plan Pursuant to 40 CFR 68(G)\n                                                Executive Summary\n                        Onondaga Cogeneration Limited Partnership\n                                                                 \n                              \n                                                                 \nJune 11, 1999      \nRevision 1.1\n                        1.   INTRODUCTION\n\nOnondaga  Cogeneration Limited Partnership owns  and  operates  a cogeneration   facility   in   Syracuse,   New   York   (Onondaga Cogeneration  or  OCLP facility) which is  subject  to  U.S.  EPA regulations   governing  Accidental  Release   Prevention   (ARP) Requirements:  Risk Management Programs under Section  112(r)  of the  Clean  Air Act (40 CFR Part 68).  This Risk Management  Plan (RMP)  has  been  developed in accordance with  the  requirements specified  under  40 CFR Part 68, Subpart G. This  RMP  certifies that  Onondaga Cogeneration Limited Partnership has instituted  a Risk  Management Program at the OCLP Syracuse, New York  facility that is in compliance with U.S. EPA ARP requirements.  \n\nThe RMP includes an Executive Summary and Data Elements following the format published by U.S. EPA.  In addition to identifying the applicable  corporate  policies  and  risk  management   systems, identifies a set of worst case and alternative release scenarios, the  potential off-site consequences of those releases,  and  the facility's  five-year  accidental  release  history.   This   RMP certifies that prevention and emergency response programs are  in place  so  as  to  minimize risks to workers and the  potentially affected public.\n\n           2.   ACCIDENTAL RELEASE PREVENTION POLICIES\n\n2.1. Risk Management Policies\n\nIt is the policy of OCLP management to implement the requirements of the Risk Management Program (RMP) in accordance with the USEPA regulations  under 40 CFR Part 68. The objective of this  program is to minimize"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3159,
      "SummaryText": "the risk of a release of a hazardous material and, if  a release were to occur, to minimize the potential impact  to OCLP employees, the public and the environment.\n\nThis  objective will be accomplished by utilizing good  operating procedures, providing appropriate training to all employees,  and coordinating  response activities, as necessary, with  the  local emergency  response providers. OCLP's management is committed  to providing  the  resources  necessary to  implement  this  policy. Further,  the OCLP management recognizes that it has  a  duty  to protect  its  employees and neighbors from  the  effects  of  all dangerous chemicals.\n\n2.2. Risk Management System\n\nThe  OCLP facility has developed a management system to implement and maintain compliance with the ARP Program and related chemical safety  and  emergency response programs.  At the OCLP  facility, the Plant Manager has primary responsibility for implementing and ensuring  compliance  with  the  ARP  Program.  Other  individual employees  will assist the Plant Manager with various aspects  of the program as required.\n\n       3.   PROCESSES AND SUBSTANCES SUBJECT TO 40 CFR 68\n\n3.1. Facility Overview\n\nThe OCLP facility is a combined-cycle cogeneration facility which produces   electric  power  for  sale  to  the   Niagara   Mohawk Corporation  and  process  steam to its host  facility  (Crucible Specialty  Metals Products). The OCLP facility  consists  of  two General  Electric gas turbines rated at 45 and 23  Megawatts  (MW) of  electric output. Waste heat from the turbine exhaust gases is\npassed through a heat recovery steam generator to generate steam. Natural gas is the facility's primary fuel, with No. 2 distillate oil used as a backup fuel.\n\nThe  combustion  turbine design includes Best  Available  Control Technology (BACT) for the control of carbon monoxide and nitrogen oxides.  Emissions of carbon monoxide are controlled through  the use  of  an  oxidation catalyst in Turbine No.  1.  Emissions"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3159,
      "SummaryText": "of nitrogen  oxides  are  controlled with  a  combination  of  water injection   and  Selective  Catalytic  Reduction   (SCR).   Water injection is used to cool the flame temperature in Turbine Nos. 1 and  2  thus inhibiting the formation of \"thermal NOx\".  Nitrogen oxide  emissions are further reduced through the  application  of SCR.  SCR is a process which involves the post-combustion removal of  nitrogen oxides from the combustion flue gas with a catalytic reactor.  In the SCR process, aqueous ammonia, which is  injected into  the  turbine exhaust gas stream, reacts with  the  nitrogen oxides and oxygen in the exhaust gas stream to form nitrogen  and water.\n\nIt  is  this  aqueous  ammonia (CAS No.  7664-41-7)  which  is  a regulated  substance under 40 CFR 68 and present at the  site  in amounts greater than the threshold quantity.\n\n3.2. Process Description\n\nAmmonia  is  present at the facility in the form  of  an  aqueous solution in concentrations ranging up to 30 percent. The  aqueous ammonia is delivered to the site via tank truck and stored in  an above  ground  tank  with a maximum capacity  of  18,000  gallons (40,554  pounds). The tank is surrounded by a dike of  sufficient volume  to completely contain and spill from the storage tank.  A piping  system (both above and below ground) is used  to  deliver the  ammonia to the combustion turbines. Prior to injection  into the combustion turbine exhaust gas stream, the aqueous ammonia is vaporized and injected as a gas.\n\n3.3. Program Level Identification\n\nThe  EPA  Risk Management Regulation identifies three  levels  of requirements  defined  as \"programs\".  EPA recognizes  that  some regulated  processes  would not pose an off-site  hazard  in  the event of an accidental release.  Such processes are classified as Program  1.  Program 1 is applicable to any process for which  it can  be  demonstrated  that the public  would  not  be  adversely affected by a release. Thus, to qualify for Program 1, a facilit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3159,
      "SummaryText": "y with a regulated toxic chemical needs to meet two criteria.\n\n- no release over the most recent 5-year period has resulted in off-site injury or environmental damage; and\n- dispersion modeling demonstrates that a worst-case release (as defined by the regulation) will not result in concentrations at public receptors that exceed the toxic endpoint.\n \nThe  Onondaga  Cogeneration facility has not had an  accident  or release involving the aqueous ammonia during the history  of  the facility.  However, the worst-case release,  as  defined  by  the regulation,  results in concentrations at public  receptors  just beyond  the  facility fenceline that exceed the  toxic  endpoint. Therefore,  the  aqueous  ammonia process  is  not  eligible  for Program 1.\n\nProgram  2 and 3 are applicable to processes that do not  qualify for Program 1. Program 3 applies to processes that are subject to Occupational  Safety  and  Health Administration  (OSHA)  Process Safety  Management  Standard (PSM) or  listed  among  nine  North American  Industrial  Classification System  (NAICS)  codes.  All other  processes  are subject to Program 2. The  aqueous  ammonia process  is  not subject to the OSHA PSM standard, therefore  the process is subject to Program 2.\n\n                     4.   HAZARD ASSESSMENT\n\nFor  the  purposes  of developing and maintaining  adequate  Risk Management Plans, the EPA has defined in its governing rules  and guidance a series of modeling methods and assumptions, which  are to  be  used  as administrative guides for planning purposes.  In order  to  standardize  and simplify the many  factors  that  can potentially  occur  in an accidental release situation,  some  of these  assumptions  may  not  take  into  account  the  available preventive measures or mitigation methods that could diminish  or\neven  eliminate the implied risks that are suggested  by  \"worst-case\"  analyses.  For  that  reason, both  the  results  for  the standardized \"worse-cases\" defined by th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3159,
      "SummaryText": "e EPA methods and  a  set of  alternative cases which are believed by the facility to  more realistically represent situations that may possibly, but rarely, occur within the lifetime of the facility are also presented. The sections  of  the Risk Management Plan which discuss both  worst-case,  and  alternative  cases, are meant  to  provide  the  data\nnecessary  to develop and evaluate possible improvements  in  the overall safety programs of the facility's RMP program.\n\n4.1. Worst-Case\n \nThe worst-case release scenario, as defined by 40 CFR Part 68, is a  sudden  release  of the maximum amount of a  stored  regulated substance from the largest single vessel. Toxic liquids, such  as aqueous ammonia, are assumed to spill instantaneously and  spread to  a  depth of 1 cm in an undiked area or to cover a diked area. The  duration of the release is based on the evaporation rate  of the  toxic liquid and the amount spilled. Only passive mitigation (e.g.,  dikes,  enclosures) and administrative  controls  may  be\naccounted for in the evaluation. \n\nEPA has established \"toxic endpoints\" for various chemicals based on  the American Industrial Hygiene Association (ACGIH) Emergency Response  Planning  Guideline, Level 2 (ERPG-2),  which  protects\nindividuals  from health-threatening or escape-impairing  injury. The ERPG-2 is defined as:\n\n     \"the  maximum airborne concentration below which it  is\n     believed  that nearly all individuals could be  exposed\n     for  up  to  1  hr without experiencing  or  developing\n     irreversible  or  other  serious  health   effects   or\n     symptoms which could impair an individual's ability  to\n     take protective action.\"\n\nGiven that the worst-case is a 10-minute release duration with  a 10-minute concentration averaging time, the actual hazard zone is typically overestimated by the ERPG-2. Within such a time  period there  are  a  number of emergency measures that  can  reduce  or eliminate  exposures  to levels this high for  an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3159,
      "SummaryText": "interval  much shorter than an hour.\n\nUnder  Section  68.22  (e),  the  RMP  rule  identifies  \"surface roughness\"  as  a  parameter  to  be  specified  in  the   hazard assessment.   The  surface  roughness  affects  the   amount   of dispersion that occurs within a released plume and influences the distance  to  toxic  endpoint.  The  surface  roughness  used  in determining   the   distance   to  toxic   endpoint   should   be characteristic  of  the  transport path of  the  plume  from  the release point to the endpoint distance. `Urban' surface roughness indicates  areas  where  there  are  many  obstacles,   such   as industrial buildings or trees.  `Rural' indicates that there  are\nno buildings in the immediate vicinity of a facility and that the terrain is generally flat and unobstructed.\n\nIn  the  immediate vicinity of the aqueous ammonia storage  tank, the  aerodynamic surface roughness is `urban' in nature,  due  to the buildings, tanks and structures at the site. Urban dispersion was therefore used in this analysis.\n\nAt  the  OCLP  facility,  the  regulatory  prescribed  worst-case release is an instantaneous spill of the entire contents  of  the aqueous  ammonia storage tank. The spill area, and thus the  rate of  evaporation is limited by a dike with a maximum surface  area of  approximately 433 square feet. The aqueous ammonia is  stored at  ambient  temperature, which for purposes of  this  worst-case analysis  was  assumed  to  be  at  the  highest  daily   average temperature  as  historically measured at  the  nearest  National Weather Service station.\n\nThe   EPA's  Risk  Management  Program  Guidance  for  Wastewater Treatment Plants (EPA 1998) was utilized to determine distance to the  toxic  endpoint  for the worst-case release.  This  guidance document  contains methodologies to estimate the  toxic  endpoint distances for worst-case releases of aqueous ammonia from a diked storage  tank.  The  equations  contained  in  the  EPA  guidance docum"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3159,
      "SummaryText": "ent   incorporate   the   prescribed   worst-case   modeling assumptions  i.e., stable atmosphere with limited  dispersion  (F stability  and 1.5 m/sec wind speed).and provide for  corrections for  storage concentration and storage temperature. For  purposes of  the  worst-case  release,  the maximum  concentration  of  30\npercent  and  maximum historical daily daily average  temperature were assumed.\n\nThe  results of the worst-case release are documented in the Data Elements  section. The distance to the less than  0.09  miles  or approximately  465  feet.  Within this  distance  are  two  small industrial  operations  which qualify as \"public  receptors\".  No schools, hospitals, residences, or recreational areas are  within the worst-case toxic endpoint distance.\n\n4.2. Alternative Releases of Toxic Substances\n\nAlternative releases are intended to represent release  scenarios that  have  a greater likelihood of occurrence than a  worst-case release.  Alternative releases do not necessarily  represent  the types  of  releases  that  the hazards analysis  and/or  accident history  indicate  would be most frequent, but rather  a  release that is somewhat more likely than the worst-case release and that generally still has the potential to affect off-site receptors. In accordance with the RMP rule, alternative releases are modeled under typical (rather than worst-case) dispersion conditions. The EPA  OCAG  default dispersion conditions are neutral  atmosphere, with  dispersion  neither enhanced nor limited (D  stability  and 3  m/sec wind speed). Unlike the worst-case release (for which an instantaneous  spill  or 10-minute ground-level  gas  release  is\nassumed),  alternative  scenarios  can  account  for  the  actual release  configuration, and account for both active  and  passive mitigation.\n\nThe  OCLP  facility performed a thorough review  of  the  aqueous ammonia   process   utilizing  engineering   plans,   operational experience,  and  maintenance  records,  in"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 3159,
      "SummaryText": "order  to   identify potential   alternative   release  scenarios.   Each   identified alternative  release  scenario was  evaluated  to  determine  the potential for to affect offsite public receptors. Based  on  this  analysis, no alternative release was  identified which  would  result  in  a toxic endpoint  distance  beyond  the facility fenceline. This analysis included the regulatory defined worst-case  scenario (i.e., sudden release of the maximum  amount of  aqueous  ammonia in the storage tank) which is  an  extremely improbably event.\nThe  selected  alternative release scenario was  a  tank  filling accident where the transfer hose disconnects between the delivery truck and the storage tank. The design of the truck delivery area is  sloped  such that any spill in this area will drain  directly into  the  tank dike area. For a release into the diked area,  as would occur in this situation, the maximum endpoint distance will occur  when  the  surface  area of a pool  formed  by  the  total quantity of solution spilled to the ground in the absence of  the dike  would be greater than the diked surface area. Based on  the dike  area,  this  amount is approximately 105  gallons.  Amounts greater than this will not result in larger endpoint distances.\n\nThe  distance  to the toxic endpoint for the alternative  release was  estimated  using the EPA's Risk Management Program  Guidance for   Wastewater  Treatment  Plants  (EPA  1998).  The  estimated distance  to  the toxic endpoint for this worst-case  alternative release  scenario  is less than 0.05 miles or  approximately  250 feet.  This  distance is less than the distance to  the  facility fenceline, therefore, there are no public receptors affected by a worst-case alternative release.\n\n                5.   ACCIDENT PREVENTION PROGRAM\n\nThe  elements  of  the Program 2 Prevention  Program  are  safety information,  hazard  review,  operating  procedures,   training, maintenance, incident investigation, and comp"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 3159,
      "SummaryText": "liance audits.  Each is discussed briefly below. \n\n5.1. Safety Information\n\nThe facility keeps a variety of technical documents that are used to   help  maintain  safe  operation  of  the  processes.   These documents  address  chemical properties and  associated  hazards, limits for key process parameters, specific chemical inventories, and equipment design basis/configuration information.\n\n5.2. Hazard Review\n\nThe  facility  used the What-If/Checklist analysis  technique  to perform  the  evaluation of the regulated systems.  The  analyses were  conducted  using a team of people who  have  operation  and maintenance  experience  as well as engineering  expertise.  This team  identified  and evaluated hazards of the  process,  accident prevention  and  mitigation measures, and  made  suggestions  for additional  prevention and/or mitigation measures when  the  team believed such measures were necessary. The recommendations from the team will be tracked to completion.\n\n5.3. Operating Procedures\n\nThe  facility  maintains written procedures that address  various modes  of  process operations, such as: unit startup, operations, shutdown,  and loading. These procedures form the  basis  of  the operator  training  and  are periodically reviewed  and  annually certified as current and accurate.\n\n5.4. Training\n\nTo  complement the written procedures for process operations, the facility  has a comprehensive training program for all  employees involved  in  operating the affected process.  A  combination  of classroom  and  on-the-job training and observation  is  used  to ensure  the  person  has  developed the necessary  skills.   All operators  receive  refresher training each three  years  on  the complete  process to ensure that their skills and  knowledge  are maintained  at  an acceptable level.  The training is  documented for each operator.\n\n5.5. Maintenance\n\nThe   facility  has  an  established  maintenance   program   for maintaining  the  mechanical integrity of th"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 3159,
      "SummaryText": "e process  equipment. This  program includes daily visual inspection of all  equipment. All  mechanical  equipment are maintained per the  manufacturer's recommended maintenance schedules.\n\n5.6. Incident Investigation\n\nThe facility has in place an incident investigation procedure for the  complete  investigation of all incidents  at  the  facility. These  procedures  include not only the RMP  affected  substance, aqueous ammonia, but all environmental incidents at the facility. The   investigation   team  documents  its   findings,   develops\nrecommendations  to  prevent  a recurrence,  and  forwards  these results  to plant management for resolution.  Corrective  actions taken  in  response  to  the investigation  team's  findings  and recommendations are tracked until they are completed.\n\n5.7. Compliance Audits\n\nCompliance  audits for the accidental release prevention  program elements will be conducted every three years. The audit team will develop  findings  that  are forwarded to  plant  management  for resolution.  Corrective actions taken in response  to  the  audit team's  findings will be tracked until they are  completed.   The final  resolution  of each finding will be is  documented  in  an audit report.\n\n                 6.   FIVE YEAR ACCIDENT HISTORY\n\nIn  conjunction  with  the  OCLP  facility's  existing  emergency response  and  incident  investigation  procedures,  there  is  a standard  management  practice that requires  immediate  internal reporting  of  unusual  events,  including  those  in  which  any abnormal   emission  of  regulated  chemicals  is   observed   or suspected.  The  incident information is reviewed by  supervisory staff  and  a  determination is made as to whether  a  reportable quantity   of  any  chemical  listed  as  requiring  reports   to regulatory  authorities  is involved.   If  so,  the  appropriate authorities are promptly notified.\n\nDuring  the  past  5  years there has been no accident  involving aqueous  ammonia"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 3159,
      "SummaryText": "that qualifies for reporting under 40  CFR  Part 68.\n\n                 7.   EMERGENCY RESPONSE PROGRAM\n\nThe  OCLP  facility has coordinated potential emergency  response activities with the Onondaga County LEPC. Procedures are in place to ensure that the LEPC is prepared to respond to an emergency at the facility. An emergency action plan is in place to ensure that the LEPC is notified promptly in the event of an emergency and to ensure the safety of the employees.\n\nFacility  personnel are not expected to \"respond\" to an emergency as defined by the OSHA HAZWPOPER Standard. Facility personnel are expected  to  perform incidental response activities to  minimize incidental or minor releases. \n\n             8.   PLANNED CHANGES TO IMPROVE SAFETY\n\nThe  OCLP facility, management recognizes that process safety  is not  only critical to facility operations but also for the safety of  the employees and the community. The management system, which has  been implemented at the OCLP facility, is designed to ensure that process safety is implemented on an ongoing, daily basis.\n\nAs   a   result  of  the  process  hazards  analysis,  additional maintenance   procedures   were   identified   to   improve   the effectiveness  of the existing mitigation system. These  will  be developed and implemented in an expeditious manner."
    }
  ]
}