{
  "FacilityID": 31619,
  "FacilityName": "Galmish Loading and Storage Facility",
  "FacilityStr1": "State Route 20",
  "FacilityStr2": "P.O. Box 370",
  "FacilityCity": "Pine Grove",
  "FacilityState": "WV",
  "FacilityZipCode": "26419",
  "Facility4DigitZipExt": "0370",
  "FacilityCountyFIPS": "54103",
  "LEPC": "Marshall/Wetzel County LEPC",
  "FacilityLatDecDegs": "39.567778",
  "FacilityLongDecDegs": "-080.688611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.dom.com",
  "FacilityEmailAddress": "Brian_K_Ruhlman@dom.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dominion Transmission, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 116025180,
  "Company2DUNS": 0,
  "OperatorName": "Dominion Transmission, Inc.",
  "OperatorStr1": "445 West Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Clarksburg",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26302",
  "OperatorZipCodeExt": "2450",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060248",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.56647,
  "FRS_Long": -80.70339,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 45857,
      "AltID": "Storage/Transportation",
      "FacilityID": 31619,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 60553,
          "ProcessID": 45857,
          "ChemicalID": 98,
          "Quantity": 3400000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 60554,
          "ProcessID": 45857,
          "ChemicalID": 118,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 60555,
          "ProcessID": 45857,
          "ChemicalID": 107,
          "Quantity": 540000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 60556,
          "ProcessID": 45857,
          "ChemicalID": 105,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 46876,
          "ProcessID": 45857,
          "NAICSCode": "324199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26298,
              "Process_NAICS_ID": 46876,
              "SafetyReviewDate": "1999-02-16 00:00:00",
              "PHA_Date": "2004-04-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-01 00:00:00",
              "TrainingReviewDate": "2004-02-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-16 00:00:00",
              "EquipmentInspectionDate": "2004-03-01 00:00:00",
              "EquipmentTested": "Radios, fire extinguishers, relief valves",
              "ChangeMgmtDate": "1999-02-16 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-01 00:00:00",
              "PreStartupReviewDate": "1999-02-16 00:00:00",
              "ComplianceAuditDate": "2004-12-01 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": "1999-02-16 00:00:00",
              "InvestigationChangeDate": "1999-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2003-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-02-01 00:00:00",
              "ContractorSafetyReviewDate": "2001-10-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38456,
                  "PreventionProgram3ID": 26298,
                  "ProcessChemicalID": 60553
                },
                {
                  "PrimaryKey": 38457,
                  "PreventionProgram3ID": 26298,
                  "ProcessChemicalID": 60554
                },
                {
                  "PrimaryKey": 38458,
                  "PreventionProgram3ID": 26298,
                  "ProcessChemicalID": 60555
                },
                {
                  "PrimaryKey": 38459,
                  "PreventionProgram3ID": 26298,
                  "ProcessChemicalID": 60556
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31619,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-01-26 00:00:00",
    "ERTrainingDate": "2001-11-01 00:00:00",
    "CoordinatingAgencyName": "Wetzel County Emergency Dispatch",
    "CoordinatingAgencyPhone": "3043864222",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31619,
      "SummaryText": "Executive Summary for Dominion Transmission,Inc. - Galmish Loading and Storage Facility\n\n1.  Accidental Release Prevention and Emergency Response Policies\nDominion Transmission, Inc. - Galmish Loading and Storage Facility (Galmish) is committed to employee, public, and environmental safety.  This commitment is demonstrated by our release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If a release does occur, our regular personnel are at hand to control and mitigate the effects of the release.  Dominion has contracted Weavertown Environmental Group as an Oil Spill Response Organization to provide additional emergency response expertise.  Also, Dominion will contact the Wetzel County Emergency Dispatch to obtain additional resources from local volunteer fire departments, law enforcement and emergency medical services.\n\n2.  The Stationary Source and the Regulated Substances Handled\nThe title of the Galmish Loading and Storage Facility is self explanatory.  This facility handles four regulated substances.  Propane, butane, and isobutane [propane, 2-methyl] are stored in spheres until loaded on tank cars or tank trucks.  Propane can also be pumped back to the Hastings Extraction Plant to replenish the propane refrigeration system during start up operations.  The fourth regulated substance at Galmish is ethyl mercaptan  [ethanethiol].  Ethyl mercaptan is used to odorize propane so that a leak of this otherwise odorless substance can be detected by smell.  The maximum inventory of propane at our facility is 1,712,000 pounds while butane, isobutane  [propane, 2-methyl] and ethyl mercaptan [ethanethiol] are present at our facility in quantities of 1,139,000 pounds, 541,000 pounds and 12,700 pounds, respectively.\n\n3.  The General Accidental Release P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31619,
      "SummaryText": "revention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 Code of Federal Regulations (CFR) Part 68 of the EPA.  This facility was designed and constructed in accordance with ASME B31.3.  A number of processes at our facility are subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nGalmish maintains a detailed record of process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with all processes.  Much of this information was compiled during the preparation of the Process Hazard Analysis (PHA).  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  Galmish primarily uses the What-if method analysis technique to perform these evaluations.  The studies were undertaken by a team of qualified personnel with expertise in engineering and process operations and will revalidated at regular intervals of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Galmish maintains written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the process safety.  These procedures address various modes of operation such as initial startup, normal operations, tempo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31619,
      "SummaryText": "rary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nGalmish develops and implements safe work practices to provide for the control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel.  These safe work practices apply to employees and contractor employees.\n\nTraining\nGalmish has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Initial training on gas plant operations is provided, and refresher training is conducted at least every 3 years or more frequently as needed.  Both initial and refresher training is documented\n\nMechanical Integrity\nThe Galmish facility has written procedures for mantaining on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, corrective action for equipment deficiencies, and the application of quality assurance measures.  Galmish Loading and Storage Facility carries out documented maintenance checks on process equipment to ensure proper installation and operation.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified and trained personnel.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  The plant also incorporates quality assurance measures to ensure that equipment and parts are suitable for the process application for which they will be used.\n\nManagement of Change\nWritten procedures are "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31619,
      "SummaryText": "in place at Galmish to manage changes in process chemicals, technology, equipment and procedures.  These procedures will be updated as needed.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes will be conducted as a regular practice at Galmish.  These reviews are conducted to confirm that construction and equipment is in accordance with design specifications, and safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Galmish facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out by at least one person knowledgeable in the process and are conducted at least every 3 years.  Audit findings are documented in a report.  Any corrective actions required as a result of the audits are undertaken in a safe and prompt manner and are also documented.  The facility will maintain the two most recent compliance audit report.\n\nIncident Investigation\nGalmish promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  An incident investigation will be initiated as promptly as possible, but no later than 48 hours after the incident, and will involve at least one person knowledgeable of the process involved.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  A report will be prepared at the conclusion of the investigation and will included any resolutions and corrective action.  All reports are retained for a minimum of 5 yea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31619,
      "SummaryText": "rs.\n\nEmployee Participation\nThe Galmish facility believes that PSM and accident prevention are a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nHot Work Permit\nGalmish will issue a hot work permit for hot work operations conducted on or near a covered process.  The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed.  The permit will be kept on file until completion of the hot work operations.\n\nContractors\nDominion hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Before any contractors are allowed to work in the Galmish facility, they undergo an orientation conducted by the PSM team.  During this orientation contractors are made aware of the known potential hazards related the contractor's work, the hazards of regulated substances within Galmish, the safe work procedures insisted on by Dominion, and familiarized with the Hot Work Permit Policy and the Lock Out/Tag Out procedures used at the Galmish.  Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur, and this information includes evacuation routes and assembly points.  Galmish will document that the contractor has received and understands the training.\n\nChemical Specific Prevention Steps\nThe processes at the Galmish facility have hazards that must be managed to ensure continued safe operation.  T"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 31619,
      "SummaryText": "he following is a description of existing safety features applicable to prevention of accidental releases of regulated substances at the facility.\n\nThe accident prevention program summarized previously is applied to all RMP-regulated processes at Galmish.  Collectively, these prevention program activities help prevent potential accidental scenarios that could be caused by equipment failures and human error.  The Galmish facility has safety features on many units to help (a) contain/control a release (e.g., diking and enclosures); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms), and (c) reduce the consequences of (mitigate) a release (e.g.., fire suppression and extinguishing).\n\n4.  Five-year Accident History\nGalmish has an excellent record of preventing accidental releases over the last 5 years and no reportable releases have occurred.\n\n5.  Emergency Response Program\nGalmish has a written emergency response plan to deal with accidental releases of hazardous materials, which is in place to protect worker and public safety, as well as, the environment.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  Employees receive training in emergency procedures.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.  The emergency plan has been coordinated with and verified by the Marshall/Wetzel County the Local Emergency Planning Committee (LEPC).\n\n6.  Planned Changes to Improve Safety\nThe Galmish facility will continue improve safety at the facility through training.  No other upcoming events are planned to improve safety at this time."
    }
  ]
}