{
  "FacilityID": 3171,
  "FacilityName": "Kraft Foods, Inc.",
  "FacilityStr1": "7388 Utica Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Lowville",
  "FacilityState": "NY",
  "FacilityZipCode": "13367",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36049",
  "LEPC": "Lewis County LEPC",
  "FacilityLatDecDegs": "43.786111",
  "FacilityLongDecDegs": "-75.659167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 43823939,
  "ParentCompanyName": "Philip Morris Companies, Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 144628310,
  "Company2DUNS": 144628310,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "Three Lakes Drive",
  "OperatorStr2": null,
  "OperatorCity": "Northfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60093",
  "OperatorZipCodeExt": null,
  "RMPContact": "Marjorie Capron",
  "RMPTitle": "Environmental and Safety Coord.",
  "FTE": 280,
  "OtherEPAFacilityID": "NYD980785950",
  "EPAFacilityID": "100000040608",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1991-12-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.78723,
  "FRS_Long": -75.46842,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3557,
      "AltID": null,
      "FacilityID": 3171,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3630,
          "ProcessID": 3557,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3802,
          "ProcessID": 3557,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503802,
          "ProcessID": 3557,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3171,
      "SummaryText": "\n\n\n\nKRAFT FOODS, Lowville, NY \nRISK MANAGEMENT PROGRAM\n(Executive Summary and Data Elements)\n\nThis document and the accompanying spreadsheet contain all required information in order to meet 40 CFR 68 Risk Management Program including an Executive Summary and RMP data elements (68.155 through 68.185).\n\nEXECUTIVE SUMMARY\n\n1.0    Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Lowville, New York has an excellent record in preventing and minimizing releases of anhydrous* ammonia. This facility has implemented an electronic preventive maintenance system. This is a system that uses a real time data base to track training and inspection dates and issue reminders to responsible groups.\n\nThe emergency response policies at this facility ensure that there is emergency response coverage, 24 hours - 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as with the Lowville Fire Department and the LEPC, in the event of an emergency.\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n2.0    Process Description and Regulated Substances\n\nAt this location Kraft Foods manufactures all varieties of cream cheese.  The NAICS code for the  primary process at this facility are 311513.  This facility is capable of producing and packaging various cream cheese products for consumer intake.  Many of the areas of the plant are refrigerated to preserve the cream cheese products.  Some of these areas include: receiving, chillers, production areas and other storage areas.\n\nKraft Foods has one regulated substance under 40 CFR 68: i.e., ammonia, at this location.  Ammonia is used as a refrigerant in the refrigeration of the cream cheese products in the various areas described above.\n\nThe  ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia stored on-site is approximately 35,000 pounds, which is less than the systems total capacity of "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3171,
      "SummaryText": "45,315 pounds.  Thus, 40 CFR 68 is applicable to Kraft Foods in Lowville, NY.\n\n    Ammonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989. Its distinctive, pungent odor is very noticeable to most people, even in small quantities. Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it can be corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause  burns. The potential risks to people exposed to an accidental ammonia release include irritation of respiratory tract, burning of skin and other tissue when contacted by ammonia vapor, and freezing of skin and other body tissue when contacted by liquid ammonia.\n\n\n3.0    Release Scenarios\n\nAlthough there are quality and safety systems in place at Krafts Lowville plant, a release from the ammonia refrigeration system could potentially affect employees on-site and the general public offsite.   USEPA requires companies to use models for worst-case and alternate release scenarios for each regulated chemical.  Given the safety precautions at the plant, both scenarios are unlikely to occur. If a release occurred, however, the alternative scenario would be more likely.  \n\n    The ammonia release scenario was modeled using SLAB (June 1990 version) to obtain the distance to the ERPG-2 endpoint.   The Emergency Response Planning Guideline, Level 2, ERPG-2, was developed by the American Industrial Hygiene Association.  It refers to the level of ammonia that individuals could be exposed to for up to one hour without being subjected to irreversible or other serious health effects that could make it difficult for them to leave the affected area.\n    \n\n4.0    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThis facility has developed an OSHA PSM  program for  their  ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3171,
      "SummaryText": "gram which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program 3.  Thus, Krafts ammonia PSM has been reviewed and determined to be complete for the RMP document. \n\nThere are several aspects of the prevention program that are key:\n\n1.    Process Safety Management (PSM) meetings are conducted on a weekly basis.\n\n2.    The computer generated PM system at the plant tracks the ammonia system efficiently.\n\n3.    Most of the pipe work is out of the way of people and the machinery and so there is less of a chance of an ammonia release.\n\n4.    The plant  maintains good training, certification and employee awareness of operating procedures).\n\n5.0    Five-year Accident History\n\nThe review of this facility's accident history includes the following range of dates: June 22, 1994 - June 21, 1999.  According to 40 CFR Part 68.42(a), there have been no accidental releases at this facility.\n\n6.0    Emergency Response Program\n\nAs mentioned earlier, this facility has developed a combination emergency response plan  which addresses:\n\n7 accidental discharge of hazardous substances and hazardous waste into the environment\n \n7 the measures to be taken to prevent an accident\n \n7 Countermeasures to be taken in the event of an emergency, and;\n \n7 procedures for containing and limiting the duration of the emergency measures to be employed for further protection of employees responding to the emergency, as well as other plant personnel\n \nThis plan also incorporates the SPCC plan, by reference, which includes the location, types and amounts of chemicals stored on-site, notification procedures, and countermeasures to be taken in the event of a spill.  It also deals with the planning, training, response and countermeasures to be taken for location personnel who respond to spills and leaks anywhere on site.\n\nThe purpose of this document is to also establish procedures to notify appropriate agencies (like the LEPC and the L"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3171,
      "SummaryText": "owville Fire Department) and company personnel in the event of an emergency.\n\nOur comprehensive emergency response plan is designed to protect our empoyees, environment and the community and, among other things, requires that:\n\n7 All nonessential personnel immediately exit the area affected by the release;\n \n7 Kraft immediately notify local officials, requesting their assistance, if necessary;\n\nFor a release which leaves the Kraft site, the company would work with local officials to notify neighbors so that appropriate safety precautions could be taken.  If ammonia is in the outside atmosphere, the safest place to be is indoors with windows and doors shut and the ventilation system turned off.\n\n\n7.0    Planned Changes to Improve Safety\n\nBased on the what-if\" PHA completed for ammonia, a list of action items was developed and is being monitored to determine if implementation was accomplished. The what-if method is used for each component of the ammonia system.  For example, on October 14, 1997 a hazard analysis was done for the accumulator and the soft body tank #14.  Some of the hazards identified were:\n\n7 What if the evaporator that chills a liquid experiences a jacket failure which results in an ammonia release into the chilled liquid system.  It was decided that this would be monitored by in-plant personnel during processing.\n \n7 What if the vessel (accumulator) is impacted by a vehicle causing a rupture that results in an ammonia release.  It was identified that this scenario is not applicable to this specific refrigeration system\n \n7 What if the level gauges on the accumulator are not protected from impact which could result in an ammonia release.  It was identified that protection was already being provided to prevent impact.\n\nThere are numerous other examples of safety improvements in our continuing efforts to improve our ammonia system.\n\n7 Complete valve and pipe replacement according to new standards\n7 Insulation upgrade\n7 Manning ammonia detection system a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3171,
      "SummaryText": "dded\n7 Receivers are now monitored by PLC on a twenty-four hour - 7 day week system\n7 All new vessels have been added in the compressor room\n7 New ventilation system and controls added"
    }
  ]
}