{
  "FacilityID": 31751,
  "FacilityName": "Grafton Water Department",
  "FacilityStr1": "630 NP Avenue",
  "FacilityStr2": "P.O. Box 578",
  "FacilityCity": "Grafton",
  "FacilityState": "ND",
  "FacilityZipCode": "58237",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38099",
  "LEPC": "Walsh County LEPC",
  "FacilityLatDecDegs": "48.427500",
  "FacilityLongDecDegs": "-097.396670",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "jtibert@graftongov.com",
  "FacilityDUNS": 39805056,
  "ParentCompanyName": "CITY OF GRAFTON",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ARLIS V. BISCHOFF",
  "OperatorStr1": "630 NP AVENUE",
  "OperatorStr2": "P O BOX 578",
  "OperatorCity": "GRAFTON",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58237",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120228",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-06-02 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-05-12 00:00:00",
  "AnniversaryDate": "2009-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 48.422089,
  "FRS_Long": -97.386353,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46017,
      "AltID": "WATER CHLORINATION",
      "FacilityID": 31751,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 60727,
          "ProcessID": 46017,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47039,
          "ProcessID": 46017,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 17794,
              "Process_NAICS_ID": 47039,
              "SafetyReviewDate": "2004-06-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "NSF, UL, AWWA",
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-01 00:00:00",
              "ChangeCompletionDate": "2004-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "TRAINING",
              "OpProceduresReviewDate": "2004-06-01 00:00:00",
              "TrainingReviewDate": "2004-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "ONE-ON-ONE",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-02 00:00:00",
              "EquipmentTested": "CHLORINATOR, INJECTOR, PRESSURE REDUCING VALVE, REMOTE VACUUM CHECK UNIT",
              "ComplianceAuditDate": "2003-02-14 00:00:00",
              "AuditCompletionDate": "2003-02-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 18562,
                  "PreventionProgram2ID": 17794,
                  "ProcessChemicalID": 60727
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 31751,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "WALSH COUNTY LEPC",
    "CoordinatingAgencyPhone": "7013522311",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31751,
      "SummaryText": "Executive Summary\n\nIntroduction\n\nThe Grafton Water Department has submitted a Risk Management Plan (RMP) to the United States Environmental Protection Agency (USEPA) to comply with the requirements of 40 CFR Part 68, the Chemical Accident Prevention Rule, herein referred to as the ¿Rule¿.  As such, the Grafton Water Department has completed a comprehensive review of the risk associated with the regulated process, water chlorination, at its facility.  Additionally, the Department has completed an offsite consequence analysis and has developed and implemented a prevention program to promote safe operation of the regulated process.  The facility has also updated emergency response procedures and initiated communication with the Local Emergency Planning Committee (LEPC) and Fire Department to form a cooperative response to potential releases at the facility.  The prevention program focuses on training employees in safe operating and maintenance procedures and to recognize the potential hazards of the regulated chemical and processes.\n\nBackground\n\nThe Grafton Water Department was constructed in 1954 with an addition constructed in 1979.  The facility is owned and operated by the City of Grafton, and currently treats approximately 1 million gallons of water per day in the summer months and 700,000 gallons per day in the winter.  The facility is a conventional filtration plant with pre-sedimentation, lime softening, recarbonation, fluoridation, stabilization, and chlorine disinfection.  Gaseous chlorine contained in one-ton chlorine containers is introduced into the water using a vacuum feed system.  The facility stores a maximum of two one-ton containers onsite, for a combined total of 4,000 pounds of chlorine.  According to the Rule, any facility with greater than 2,500 pounds of chlorine onsite is required to develop and implement a RMP.  Therefore, the Grafton Water Department chlorination system is a Risk Management-regulated process.\n\nChlorine containers are stored i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31751,
      "SummaryText": "n the chlorine room, which is located on the northwest corner of the facility.  The room is equipped with a ventilation system capable of exchanging one complete air volume per minute.  The Grafton Water Department operates the facility from 7:00 am to 5:00 pm, Monday through Friday, and 7:00 am to 3:00 pm Saturdays, Sundays, and Holidays.  The chlorine room and its components are visually inspected at least once per hour during operation.  When the system is not in operation, the chlorination system equipment and all related process valves are disabled.  The door to the chlorine room is kept locked at all times.\n\nChlorine is a toxic gas stored as a liquid under pressure.  Its boiling point is ¿29.4°F.  Chlorine is irritating and corrosive to the eyes, skin, and respiratory tract and reacts violently with easily oxidized materials.  Contact with evaporating chlorine or equipment releasing flashing chlorine can cause frostbite burns.  Chlorine gas is heavier than air and will travel along the ground and fill low spaces and pits by displacing air.  One-ton chlorine containers are welded steel tanks with removable steel protective caps over the container valves.  They are built to meet Federal specifications, and are regularly inspected and pressure tested in accordance with Federal regulations.\n\nEmergency Response\n\nAlthough the potential for a release exists, the Grafton Water Department has determined that the chlorination system is safe by industry standards and that the potential for a release from the facility is very small.  The facility is working with the LEPC and the Fire Department to prepare emergency responders in the event of a major release.  The Grafton Water Department employees do not respond to releases other than those that can be stopped by closing a valve and will not enter the room to stop a chlorine release if the chlorine concentration is estimated to be above safe levels.  The Grafton Water Department relies on the Grafton Fire Department, whic"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31751,
      "SummaryText": "h works closely with the LEPC and the Grand Forks Hazardous Materials Response Team (HAZMAT) team, to plan response procedures in the event of a major chlorine release at the facility.  The results of the offsite consequence analysis have been communicated to the LEPC, which shares information with the Fire Department.  In addition, the Grafton Water Department communicates with the Fire Department directly on a regular basis with regard to potential hazards at the facility.\n\nAccident History\n\nThe Grafton Water Department has not had an accident in the last 5 years.  The Grafton Water Department is committed to ongoing employee training to increase awareness of the potential hazards associated with the chlorination process and to further reduce the likelihood of future accidents which may result in injury and equipment or property damage.\n\nPrevention Program\n\nThe day-to-day result of the Rule is the mandatory implementation of a prevention program.  The intent of the prevention program is to document procedures within the facility that promote safe operation of the regulated process and reduce the potential for an uncontrolled release of the regulated substance (chlorine gas).  Components of the prevention program include the assembly of safety information, the performance of periodic hazard reviews, the establishment of safe operating and maintenance procedures, updating training policies, conducting routine compliance audits, the development of an incident investigation procedure, and the formalization of a management system.\n\nSafety information, such as Material Safety Data Sheets and equipment specifications, have been compiled and attached to the RMP for easy access by employees.  This information specifies the safe operating limits for regulated process equipment, and lists codes and standards that apply to the equipment.  Instruction manuals for regulated process equipment are also attached to this section.\n\nA hazard review has been conducted by site personne"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 31751,
      "SummaryText": "l to identify potential hazards associated with the process and regulated chemicals at the site.  A hazard review will be performed every 5 years, or prior to implementation of a new or changed process.\n\nOperating procedures relating to normal and emergency operations of the regulated process have been updated and compiled in the RMP.  Maintenance procedures have been compiled in a similar fashion.  These procedures will be reviewed periodically and updated as necessary.\n\nA training policy has been developed and training records have been reviewed and updated to reflect the current status of all employees.  New employee and refresher training will be periodically provided and documented to maintain safe operating and maintenance procedures.  The Grafton Water Department will continue its practice of documenting all training, and will require operators to be familiar with publications such as the Chlorine Institute¿s Chlorine Manual and the New York State Emergency Response Commission¿s Chlorine Safety Manual (For Water and Wastewater Facilities).  Refresher training will be conducted every 3 years, at a minimum.\n\nA compliance review policy has been developed, and compliance audits designed to review the facility¿s compliance with the Rule will be conducted every 3 years.  The audits will examine the components of the Risk Management Program and the implementation of each component.\n\nAn incident investigation procedure has been developed to aid in instituting corrective actions resulting from an incident and to prevent future incidents from occurring.  This procedure establishes a timeline for completion of an incident investigation and documents any procedure changes resulting from the investigation.\n\nLastly, a management system which assigns responsibility for each component of the Risk Management Program has been instituted.  This procedure will also be reviewed periodically and updated to reflect changes in responsibilities at the facility.\n\nConclusion\n\nIn summar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 31751,
      "SummaryText": "y, the Grafton Water Department is confident that although the potential for a chlorine release that could affect the public or the environment is present, it is slight.  The facility has committed to comprehensive employee training and communication with offsite responders in the event of a major chlorine release.  The facility has examined the hazards associated with the regulated process, identified additional safety measures, and set a schedule for implementation of those safety measures.  The Grafton Water Department intends to use the Risk Management Program as a means to operate more safely and efficiently and to communicate more effectively with offsite responders and the public it serves."
    }
  ]
}