{
  "FacilityID": 31840,
  "FacilityName": "Harcros Chemicals Inc. - Tampa",
  "FacilityStr1": "5132 Trenton St.",
  "FacilityStr2": null,
  "FacilityCity": "Tampa",
  "FacilityState": "FL",
  "FacilityZipCode": "33619",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.913333",
  "FacilityLongDecDegs": "-082.398611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "harcroschem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1355957,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Harcros Chemicals Inc.",
  "OperatorStr1": "P.O. Box 2930",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66110",
  "OperatorZipCodeExt": "2930",
  "RMPContact": "Rick Hesketh",
  "RMPTitle": "Engineering & Environmental Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "33619HRCRS5132T",
  "EPAFacilityID": "100000008671",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-11-17 00:00:00",
  "DeRegistrationEffectiveDate": "2008-11-10 00:00:00",
  "AnniversaryDate": "2009-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 27.9131,
  "FRS_Long": -82.39834,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46109,
      "AltID": null,
      "FacilityID": 31840,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47133,
          "ProcessID": 46109,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60838,
          "ProcessID": 46109,
          "ChemicalID": 62,
          "Quantity": 500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560838,
          "ProcessID": 46109,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31840,
      "SummaryText": "EXECUTIVE SUMMARY ? TAMPA\n\n\n1. Accidental release prevention and emergency response policies\n\nIn this distribution facility, we handle chlorine, which is considered hazardous by the EPA.  The same properties that make chlorine valuable as a commodity chemical also make it necessary to observe certain safety precautions to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as that of our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle chlorine, and the training of our personnel.\n\nOur emergency response program is based upon The Chlorine Institute?s Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  The emergency response plan includes procedures for notification of the local fire authority and notification of our immediate neighbors.\n\n\n2. The stationary source and regulated substances handled\n\nOne of the primary purposes of this facility is to repackage and distribute chlorine to water treatment facilities and general industry.  We also manufacture sodium hypochlorite (bleach) as a byproduct of the chlorine repackaging operation.  Chlorine is received by rail cars.  Chlorine from rail cars is used to fill DOT approved containers.  Access to the site is restricted to Harcros employees, and authorized contractors and visitors.  The maximum total inventory of chlorine at this facility is 500,000 pounds.    The average inventory of chlorine is much less.\n\n\n3. The general accidental release prevention program and the specific prevention steps\n\nThis distribution facility complies with EPA?s Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility is operated in accordance with recommendations from The Chlorine Institute and with the Responsible Distribution Process of the National Association of Chemical Distributo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31840,
      "SummaryText": "rs.\n\n\n4. Five year accident history\n\nWithin the past 5 years, this facility has had no accidental releases that have resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  There have been a couple of minor chlorine releases.  These incidents were investigated and corrective actions implemented to help prevent their reoccurrence.\n\n\n5. The emergency response program\n\nThis facility?s emergency response program is based upon The Chlorine Institute?s Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  This plan is reviewed annually and updated when required.  All response team members attend annual refresher training including the use of response equipment on simulated leaks.  We work closely with our suppliers, customers, public responders, and The Chlorine Institute to continuously improve our emergency response capabilities.\n\n\n6. Planned changes to improve safety\n\nThis distribution facility was constructed in 1960.  We continue to participate in The Chlorine Institute and the National Association of Chemical Distributor programs, and to continue to improve our operations in accordance with Responsible Distribution Guidelines.  \n\nIn 2003, we developed a new security plan to help guard against intentional misuse of hazardous chemicals.  We have recently added new equipment and have implemented new procedures to improve security even further.  We are continuing to evaluate and implement new security measures by sharing knowledge with other Harcros facilities and general industry.\n\nThe refrigeration system used in sodium hypochlorite manufacturing is currently being converted for use with a less toxic refrigerant.  The former refrigerant was not used in quantities subject to the RMP regulations.  However, its use did involve some risk which we are now eliminating."
    }
  ]
}