{
  "FacilityID": 31903,
  "FacilityName": "Naches River Water Treatment Plant",
  "FacilityStr1": "6390 US Hwy 12",
  "FacilityStr2": null,
  "FacilityCity": "Yakima",
  "FacilityState": "WA",
  "FacilityZipCode": "98908",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53077",
  "LEPC": "Yakima County LEPC",
  "FacilityLatDecDegs": "46.685972",
  "FacilityLongDecDegs": "-120.653528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Yakima",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Yakima",
  "OperatorStr1": "6390 US Hwy 12",
  "OperatorStr2": null,
  "OperatorCity": "Yakima",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98908",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mel Young",
  "RMPTitle": "WTP Supervisor",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186381",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-01-27 00:00:00",
  "SafetyInspectionBy": "Yakima County Fire Protection Bureau",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-01-11 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-04 00:00:00",
  "AnniversaryDate": "2009-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46176,
      "AltID": "Chlorine for Water Treatm",
      "FacilityID": 31903,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47202,
          "ProcessID": 46176,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 60920,
          "ProcessID": 46176,
          "ChemicalID": 62,
          "Quantity": 13500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 560920,
          "ProcessID": 46176,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 31903,
      "SummaryText": "The City of Yakima owns and operates the Naches River Water Treatment Plant (\"WTP\") in Yakima, Washington. The WTP employs eight persons. The WTP uses chlorine for water treatment. Chlorine is subject to EPA regulation under 40 CFR 68, Accidental Release Risk management of Highly Hazardous Chemicals.\n\nPursuant to the RMP regulations (40CFR 68) and the Process Safety Management (PSM) regulations, the City of Yakima - Naches River WTP has developed a comprehensive PSM written program to protect employees and the surrounding community fromn exposure to the hazardous chemicals onsite. The facility completed a process hazards analysis (PHA) for chlorine using the Hazard and Operability (HAZOP) methodology. The PHA was completed using technical and operations staff from the WTP as well as experienced facilitators from an outside engineering firm.\n\nThe City of Yakima - Naches River WTP implementation of the PSM program includes empoyee education in the hazards of chlorine and measures that can be used to reduce employee and community exposure to accidental releases of chlorine. The plans include preventive maintenance programs (mechanical integrity) for the chlorine system as well as a program for both pre-startup safety reviews and management of changes (MOC) to the system. The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the chlorination system.\n\nLastly, the PSM written program incorporates the City of Yakima - Naches River WTP emergency response plan and places special emphasis on handling accidental releases of hazardous chemicals and coordination of emergency response with local fire departments and other emergency response organizations.\n\nAs part of the RMP requirements, the City of Yakima - Naches River WTP undertook a review of the potential offsite consequences of the accidental releases of the largest vessels in the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 31903,
      "SummaryText": "system. Although such a release is highly unlikely, the regulation requires this review. The following is a description of the results.\n\nChlorination for water treatment\n\nThe Naches River WTP stores and uses chlorine onsite for water treatment. Chlorine at the facility is kept entirely within the chlorination system, as the system is run under vacuum. The Naches River WTP has never experienced a release of chlorine involving consequences that affected residents or the environment.\n\nThe worst case scenario was assumed to be the release of the entire contents of a 2,000-pound cylinder of chlorine, which is located indoors. The analysis of this release indicates that a potential exposure of an area approximately 1.96 miles in diameter (distance to endpoint of 0.98 miles) would result. The total population within the potential exposure area is estimated to be 164.\n\nIn determining the alternate case scenario for chlorine, th City of Yakima - Nache River WTP analyzed incidents occurring at other water treatment facilities and the results of the internal process hazards analysis (PHA). The scenario chosen for the chlorine system assumes the failure of one of the 3/8\" fusible plugs in the chlorine ton container. Such a release would affect an area of 0.48 miles ( 0.24 miles to the toxic endpoint) and create the potential to affect approximately 18 persons. Residences are located within this area.\n\nThe City of Yakima is committed to minimizing accidental releases of chlorine from the chlorination process at the Naches River WTP. Treatment plant personnel are invloved in the design, operation, and maintenance of the system, and employees at all levels have been involved in the devolopment of the PSM and RMP programs. Management has committed to working with local agencies to educate the public regarding the hazards of chlorine and to ensure a safe workplace and surrounding community. Specific questions regarding RMP compliance at the City of Yakima - Naches River WTP should b"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 31903,
      "SummaryText": "e addressed to the Water Treatment Plant Supervisor, Mel Young at (509)575-6177 or via e-mail at Myoung@ci.yakima.wa.us.\n\nSpecial note: The City of Yakima-Naches River Water Treatment Plant is currently under major construction and update in order to change the chlorination system from a chlorine gas system to an on-site generation of sodium hypochlorite system. The change from gas to Sodium Hypochlorite will be complete mid-summer 2004, at that time the Naches River water Treatment Plant will no longer be using or storing any chlorine gas. At the time of our switchover to Sodium Hypochlorite, we will De-Register our RMP with the EPA."
    }
  ]
}