{
  "FacilityID": 32087,
  "FacilityName": "Helena Chemical Company, Whitewright Facility",
  "FacilityStr1": "1110 South Bond St.",
  "FacilityStr2": null,
  "FacilityCity": "Whitewright",
  "FacilityState": "TX",
  "FacilityZipCode": "75491",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48181",
  "LEPC": "Grayson County LEPC",
  "FacilityLatDecDegs": "33.500833",
  "FacilityLongDecDegs": "-096.391667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "15158 East Highway 56",
  "OperatorStr2": null,
  "OperatorCity": "Honey Grove",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75446",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163146",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-11-12 00:00:00",
  "DeRegistrationEffectiveDate": "2019-11-08 00:00:00",
  "AnniversaryDate": "2004-10-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.50133,
  "FRS_Long": -96.39475,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "12",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C02",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46421,
      "AltID": "Farm Supplies Wholesalers",
      "FacilityID": 32087,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 61214,
          "ProcessID": 46421,
          "ChemicalID": 56,
          "Quantity": 476381.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47451,
          "ProcessID": 46421,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 18013,
              "Process_NAICS_ID": 47451,
              "SafetyReviewDate": "2003-10-30 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2003-10-30 00:00:00",
              "ChangeCompletionDate": "2003-10-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Helena has updates its RMP to require the independent contractor to provide PSM and hazard review procedures and updates.",
              "OpProceduresReviewDate": "2003-10-30 00:00:00",
              "TrainingReviewDate": "2003-10-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-10-30 00:00:00",
              "EquipmentInspectionDate": "2004-01-30 00:00:00",
              "EquipmentTested": "Helena personnel ensured that the independent contractor inspected its equipment related to the blending process.",
              "ComplianceAuditDate": "2003-10-30 00:00:00",
              "AuditCompletionDate": "2003-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2003-10-30 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Operations Manager implements the RMP at this facility and is assisted by other Helena staff as directed.  The RMP includes multiple attachments which address its prevention program.  The ammonia handling process is implemented by an independent contractor.  To ensure that the independent contractor is responsible for complying with relevent operation, maintenance, training and contingency procedures, Helena requires tha the independent contractor certify that it: (1) operates under an OSH PSM, and (2) complies with Helena's emergency shut-down and notification procedures.  Furthermore, Helena requires for its independent contractor to prepare and make available its' hazard review, and operating and maintenance procedures relevent to the blending process.",
              "_chemicals": [
                {
                  "PrimaryKey": 18795,
                  "PreventionProgram2ID": 18013,
                  "ProcessChemicalID": 61214
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32087,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Grayson County LEPC",
    "CoordinatingAgencyPhone": "9038134253",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32087,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Helena Chemical Company (Helena) Whitewright Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards. This electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Whitewright Facility located at 1110 South Bond Street, Whitewright, TX 75491.  The electronic RMP summarizes the policies and procedures implemented by the Whitewright Facility to minimize the likelihood of an accident. The electronic RMP also summarizes the actions that the Whitewright Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\nPURPOSE FOR UPDATING RMP\n\nHelena has updated this RMP in response to recent changes in its management of the RMP program.  Although Helena has updated the RMP, Helena was not required to update the off-site consequence analysis because the containers and volumes used for the off-site consequence analysis in the original RMP did not change (i.e. 34,000-gallon railcar).  Furthermore, Helena was not required to update the potentially affected population because there has been no significant change in population or potential receptors since the original RMP.  \n\nFACILITY\n\nThe Whitewright Facility is a retail agricultural chemical facility.  Anhydrous ammonia is unloaded from a railcar and batch processed through a reactor.  The process operations conducted at this facility are performed by an independent contractor.  The independent contractor performs the batch reactor operations using a mobile pipe reactor.  The batch"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32087,
      "SummaryText": " operations consist of unloading the anhydrous ammonia from the rail car into the reactor and mixing it with water and phosphoric acid to produce ammonium phosphate fertilizer.  The contractor is responsible to OSHA for Process Safety Management compliance. Helena Chemical Company does not own or operate the formulation processes at the facility.\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative consequence analysis were completed for the ammonia storage process. The worst case scenario release for the Whitewright Facility assumed that all the contents in the largest single storage tank were released. The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\nThe alternative (or more likely to occur) scenario assumes a rupture of a 3-inch line caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although this event is classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment (rail guards, check valves) and operating procedures that Helena uses to safeguard ammonia transfer operations.\n\nBoth the worst case and alternative scenario are overly conservative because even a 2-minute release is unlikely to occur since check valves on the system should close immediately upon increased flow resulting from the severed transfer line.\n\nACCIDENT PREVENTION PROGRAM\n\nThe Depot Manager implements the risk management planning process at this Helena facility.  The Depot Manager is assisted by other Helena staff, as directed.  The fertilizer handling process is implemented by an independent contractor.  \n\nTo ensure that its contractor is responsible to Helena for complying with relevant operation, maintenance, training procedures and documentation, the contractor must, at a minimum:\n\n?    Have in place and certify complia"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32087,
      "SummaryText": "nce with an OSHA Process Safety Management Plan (PSM);\n?    Make available to Helena and EPA upon request, any documentation necessary to comply with the PSM;\n?    Review, certify and comply with Helena?s emergency shut-down procedures for ammonia unloading, and emergency notification and evaluation procedures.\n\nAll of Helena?s contractors subject to this standard will be required to acknowledge and sign an Independent Contractor Certification Statement.  Helena will provide a copy of its Contingency Plan and Operating Procedures to its contractors for review and implementation.  A copy of the Helena RMP will be available for the independent contractor?s review at the Helena facility.  Helena personnel are responsible for  providing notification to the Local Emergency Planning Committee (LEPC) and Fire Department when its contractor  intends to operate the reactor;\n\nEMERGENCY RESPONSE PROGRAM\n\nHelena Chemical Company?s Whitewright Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Whitewright Facility.\n\nCONCLUSION\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Whitewright Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Whitewright Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Grayson county LEPC.\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA?s RMP Submit Program are not applicable to the Whitewright Facility."
    }
  ]
}