{
  "FacilityID": 32101,
  "FacilityName": "Bayer-Mishawaka Plant",
  "FacilityStr1": "430 S. Beiger St.",
  "FacilityStr2": null,
  "FacilityCity": "Mishawaka",
  "FacilityState": "IN",
  "FacilityZipCode": "46546",
  "Facility4DigitZipExt": "2004",
  "FacilityCountyFIPS": "18141",
  "LEPC": "St. Joseph Co. Emerg. Mgmt Ag.",
  "FacilityLatDecDegs": "41.658700",
  "FacilityLongDecDegs": "-086.147720",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bayerus.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 114424690,
  "ParentCompanyName": "Bayer Corporation",
  "Company2Name": null,
  "CompanyDUNS": 64960248,
  "Company2DUNS": 0,
  "OperatorName": "Bayer HealthCare, LLC",
  "OperatorStr1": "430 S. Beiger St.",
  "OperatorStr2": null,
  "OperatorCity": "Mishawaka",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46546",
  "OperatorZipCodeExt": "2004",
  "RMPContact": "Fred D. Strell",
  "RMPTitle": "Staff Utilities Engineer",
  "FTE": 572,
  "OtherEPAFacilityID": "46544MLSNC430S",
  "EPAFacilityID": "100000039291",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-08-22 00:00:00",
  "SafetyInspectionBy": "EPA;State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.657,
  "FRS_Long": -86.1489,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "5000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46456,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 32101,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47486,
          "ProcessID": 46456,
          "NAICSCode": "325413",
          "_desc": {
            "NAICS_CODE": "325413",
            "NAICS_DESCRIPTION": "In-Vitro Diagnostic Substance Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61268,
          "ProcessID": 46456,
          "ChemicalID": 56,
          "Quantity": 22350.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561268,
          "ProcessID": 46456,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32101,
      "SummaryText": "MISHAWAKA PLANT:\n\nExecutive Summary\n\nRelease prevention and emergency response policies:\nPersonnel at this Bayer HealthCare, LLC (Bayer) facility take a very active approach in maintaining and improving chemical safety.  Building on well established corporate policies, this facility has developed and follows an OSHA process safety management plan that complies with the level 3 prevention program requirements.\n\nBayer demonstrates its management's commitment to safety through the efforts of corporate and facility safety personnel.  Through safety  committee meetings, internal audits, and monitoring of new regulatory and industry developments, Bayer meets or exceeds process safety requirements.  For compliance with 40 CFR 68, Bayer established an ammonia RMP planning committee (ammonia is the regulated substance at this facility), comprised of representatives from Bayer facilities coast-to-coast.  Although the committee has since disbanded, the guidance that the committee developed along with updates from Corporate Process Safety, insures continued compliance.\n\nFacility and regulated substance:\nBayer's Mishawaka Plant is part of Bayer HealthCare's Diagnostics Division.  It manufactures self-testing products for blood glucose and point-of-care products such as urine chemistry analyzers and reagent strips to test for indication of kidney and liver disease.\n\nProcess cooling and the cooling of office areas is accomplished with a refrigeration system charged with anhydrous ammonia.  It is a closed loop system capable of producing up to 1,800 tons of refrigeration.  Hot, gaseous anhydrous ammonia is compressed to aproximately 180 psig and condensed with the help of water-cooled evaporative condensers.  Liquid ammonia from the condensers is collected and stored in two receivers from which it is then transferred on demand to chillers to cool glycol which then provides cooling to work areas and processes.  By absorbing heat from the glycol, the ammonia is vaporized and enters t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32101,
      "SummaryText": "he compression system where the cycle is repeated.  All ammonia is kept at a Refrigeration Mechanical Building which is separated from the production facility.\n\nThe ammonia refrigeration system as a whole contains up to 22,350 pounds of anhydrous ammonia.\n\nAccidental release prevention program:\nThe facility's prevention program complies with the OSHA 29 CFR 1910.119 process safety management standard and the corresponding sections of the EPA 40 CFR 68 rule for program level 3 processes.  To achieve and maintain this compliance, Bayer has in place many procedural and technological safeguards.  The procedural safeguards include an extensive employee training program and detailed operating and maintenance procedures for those employees involved in operating the covered process.  The technological safeguards include level controls, sensors, alarms, relief valves, and redundant systems.  All of these serve to prevent unintended releases of ammonia, or at least minimize the effects of a release.\n\nFive-year accident history:\nThis facility has had no accidental releases of ammonia which meet the criteria of 68.42 of the RMP rule.\n\nEmergency response program:\nThe facility has a well developed, written emergency response and preparedness plan that is coordinated with the local emergency responders.  The Mishawaka City Fire Department or the South Bend Hazmat Team is the primary responder.  Their response is triggered by phone communication.  Bayer employees handle incidental releases of ammonia and are trained and equipped to do so.\n\nThe emergency response and preparedness plan includes procedures for reporting emergencies, notifying the public, evacuation, system shutdown, and post-response, or cleanup, activities.  The plan clearly defines the actions that employees should take when an emergency occurs.  The lines of internal notification and authority are clearly stated.\n\nThe facility has sensors which signal alarms in the building, at the control panel and at the Mishawak"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32101,
      "SummaryText": "a Plant Security Command Center.  The Mishawaka Plant Security Command Center is staffed continuously.  Fire alarms and firefighting sprinkler systems are provided throughout the facility.  These are connected to the Plant Security Command Center.  In addition, there is a deluge system that can be used to mitigate a release of ammonia.\n\nPlanned changes to improve safety:\nThe maintenance and improvement of safety is an ongoing job at this facility.  Training in matters of safety takes place throughout the year.  Safety-related recommendations from employees, whether made during formal sessions like process hazard analysis or made upon observation of a potential hazard, are always considered carefully for implementation.  This process is continuous and, even at times when no major process changes are anticipated, existing safety systems and procedures are fine-tuned as a matter of course."
    }
  ]
}