{
  "FacilityID": 32178,
  "FacilityName": "Westinghouse Specialty Metals Plant",
  "FacilityStr1": "559 Westinghouse Road",
  "FacilityStr2": null,
  "FacilityCity": "Blairsville",
  "FacilityState": "PA",
  "FacilityZipCode": "15717",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42129",
  "LEPC": "Westmoreland County LEPC",
  "FacilityLatDecDegs": "40.446667",
  "FacilityLongDecDegs": "-079.308333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": "westinghouse.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5000625,
  "ParentCompanyName": "Westinghouse Electric Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 62661272,
  "Company2DUNS": 0,
  "OperatorName": "Westinghouse Electric Company LLC",
  "OperatorStr1": "559 Westinghouse Road",
  "OperatorStr2": null,
  "OperatorCity": "Blairsville",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15717",
  "OperatorZipCodeExt": null,
  "FTE": 292,
  "OtherEPAFacilityID": "15717WSTNGRD4BO",
  "EPAFacilityID": "100000056324",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-02-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-03-03 00:00:00",
  "DeRegistrationEffectiveDate": "2010-09-01 00:00:00",
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 40.44596,
  "FRS_Long": -79.30802,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46555,
      "AltID": "Storage - HF",
      "FacilityID": 32178,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 61370,
          "ProcessID": 46555,
          "ChemicalID": 55,
          "Quantity": 8500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47586,
          "ProcessID": 46555,
          "NAICSCode": "331491",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32178,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-01-20 00:00:00",
    "ERTrainingDate": "2004-05-27 00:00:00",
    "CoordinatingAgencyName": "Westmoreland County LEPC",
    "CoordinatingAgencyPhone": "7246007300",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32178,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nThe Westinghouse Electric Company (WEC) Specialty Metals Plant in Blairsville, PA has a a long-standing commitment to worker and public safety.  The plant was recertified by OSHA in 2001 as a Voluntary Protection Program (VPP) Star site.  The commitment to safety is demonstrated by the resources invested in accident prevention and emergency response.  This includes training of the general employee population and the emergency brigade; establishing, maintaining, and reinforcing, and enforcing safety policies and procedures, and emphasizing safety in the design, installation, operation, and maintenance of our facilities and equipment.  Great importanace is placed on the recognition, evaluation, elimination and/or control of hazards and environmental risks.\nPolicies and procedures are in place at various levels in the organization, and these procedures generally get more detailed as they flow down, from the WEC Environmental, Health, and Safety (EH&S) Manual to detailed department level operating procedures, which describe safe steps to safely perform a given task.\n\nFacility Description and Substances Handled\n\nThe Westinghouse Specialty Metals plant is a manufacturer of nuclear grade tubing for the nuclear power industry. The tubing is made by rolling and drawing of nonferrous metals, primarily zirconium alloys.  Part of the manufacturing process involves the pickling or surface treatment of the tubing using an acid mixture of nitric and hydrofluoric acids.  The facility stores and handles 140 pound containers of the regulated substance hydrofluoric acid at 70% concentration.  The maximum quantity on site is 8,500 pounds.  The hydrofluoric acid is diluted with water and nitric acid in the pickling baths.  The facility also has bulk storage in aboveground tanks of 49% hydrofluoric acid and 70% nitric acid.  Although these are not regulated substances under the RMP rule, they are addressed in the facility's a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32178,
      "SummaryText": "ccident prevention and emergency response programs.  The plant is comprised of 507,000 square feet of manufacturing space and 54,000 square feet of office space.  The facility is located in a rural area on a site of approximately 525 acres.\n\nAccidental Release Prevention\n\nTo prevent the accidental release of hydrofluoric acid (HF) at the Specialty Metals Plant, safety procedures are in place covering the receiving, transport, decanting, processing, and acid waste transfer to tank trailer.  All involved personnel are trained to these procedures.  Procedures are also in place for the inspection and maintenance of acid containing systems and for spill response, including decontamination procedures.  The containers of acid are stored within secondary containment and the pickling process itself is within secondary containment.  The containers themselves are DOT approved for transport and storage of 70% HF and are rigorously tested.  The HF supplier is required to inspect and recondition the HF containers prior to refilling them.  Inspection, maintenance, and training programs are also in place fork trucks and cranes, which are used to transport the HF containers onsite.\n\nAlthough not covered by the RMP rule, there are numerous safeguards in place for the tank storage and transfer of 49% HF and 70% nitric acid.  The bulk tank and associated handling system for 49% hydrofluoric acid was installed in 2001 to reduce further the risks associated with handling of the 70% HF containers, and approximately 80% of the HF used on site is now through the  49% tank system.  The 49% HF is about 5 times less volatile than 70% HF and is handled in a totally automated transfer system, which is operated remotely.  The bulk hydrofluoric acid and nitric acid tank systems comply with the requirements of the Pennsylvania Storage Tank and Spill Prevention program, including the certification, inspection , design, and monitoring requirements.\n\nFive Year Accident History\n\nThe Westinghouse Specia"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32178,
      "SummaryText": "lty Metals Plant has had no releases involving a regulated substance in the past five years.\n\nEmergency Response Program\n\nThe Westinghouse Specialty Metals Plant has and integrated SPPC and PPC plan that covers all chemical spill response scenarios.  The plans are updated every 3 years and are reviewed with the plant Emergency Brigade and others who have responsibility in the event of a spill/release incident.  Copies of the plans are submitted to state and local agencies and emergency response organizations.  The plant also has an Emergency Response Plan that details the expected response of employees to chemical spills and other emergencies.  Included in the plan are the plant's emergency alarm system and evacuation procedures.  Training is done annually for all employees and an evacuation drill is performed annually.   The plant also coordiantes response with the local LEPC through an Off-site Emergency Response Plan filed with the Westmoreland County Emergency Planning Committee, which details the hazardous substances on-site, a hazard analysis, and appropriate emergency response.  The Off-site Emergecy Response Plan is updated annually.\n\nThe plant's Emergency Brigade is trained to a First Responder Operations level under the OSHA HAZWOPER standard. The Brigade conducts drills to maintain readiness and goes through a variety of training throughout the year.  A hazardous material exercise was performed with outside local response agencies in October 2003, including Westmoreland County HAZMAT team and local fire departments and medical reponse teams, where a spill of a hazardous substance with medical casualties was simulated.   The drill was witnessed and feedback provided by representatives of  Westmoreland County, FEMA and corporate Westinghouse.  The drill and feedback were useful in improving the overall chemical spill response capabilities and coordination with the local response organizations.  In addition to these drills, the local emergancy response organ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32178,
      "SummaryText": "izations periodically undergo training and a plant tour to familiarize them with our facility.\n\nPlanned Changes to Improve Safety\n\nThe plant is considering measures to totally eliminate the need for handling and storage of 70% HF in containers.  For one application, a more dilute concentration of HF in a container is being evaluated.  In addition to going to a less volatile mixture, this improvement would also eliminate the need to handle partial containers, by going to a one use approach.  The plant is also considering consolidating all pickling into the part of the facility which is serviced by the automated 49% HF tank system (there are currently two pickling facilities).  If this occurs, the plant could be de-registered under the RMP rule."
    }
  ]
}