{
  "FacilityID": 32196,
  "FacilityName": "Pactiv Corporation PPNA - Plymouth",
  "FacilityStr1": "1411 Pidco Drive",
  "FacilityStr2": null,
  "FacilityCity": "Plymouth",
  "FacilityState": "IN",
  "FacilityZipCode": "46563",
  "Facility4DigitZipExt": "1352",
  "FacilityCountyFIPS": "18099",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.351389",
  "FacilityLongDecDegs": "-086.325833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.pactiv.com",
  "FacilityEmailAddress": "ifoss@pactiv.com",
  "FacilityDUNS": 150605269,
  "ParentCompanyName": "Pactiv Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5211768,
  "Company2DUNS": 0,
  "OperatorName": "Pactiv Corporation",
  "OperatorStr1": "1411 Pidco Drive",
  "OperatorStr2": null,
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46563",
  "OperatorZipCodeExt": "1352",
  "RMPContact": "Dennis Hughes",
  "RMPTitle": "Plant Manager",
  "FTE": 220,
  "OtherEPAFacilityID": "IND984882928",
  "EPAFacilityID": "100000044631",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T099-5969-00028",
  "SafetyInspectionDate": "2004-03-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.35166,
  "FRS_Long": -86.32422,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46580,
      "AltID": "Foam Production",
      "FacilityID": 32196,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47611,
          "ProcessID": 46580,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61395,
          "ProcessID": 46580,
          "ChemicalID": 155,
          "Quantity": 90667.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 45115,
              "ProcessChemicalID": 61395,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 45116,
              "ProcessChemicalID": 61395,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 561395,
          "ProcessID": 46580,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32196,
      "SummaryText": "Pactiv - PPNA, Plymouth, IN\n\n1 ACCCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nWe at Pactiv are strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, we are completely coordinated with the Marshall County Local Emergency Planning Commission (LEPC) and the Plymouth Fire Department to provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2. THE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\nOur facility's primary activities encompass the manufacturing of polyethylene foam products that is used as Packaging material. We have a flammable mixture of regulated substances which are used as a blowing agent at this facility.\n\n3. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. In addition, we have one process at our facility which is subject to the Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119 and we have an air operating permit IDT099-5696-00028 from the Indiana Department of Environmental Management. The following sections briefly describe the elements of the accidental release prevention program that are in place at Pactiv.\n\nProcess Safety Information\nPactiv maintains a detailed record of safety information that describes the chemical hazards, operating\nparameters and equipment designs associated with the covered process.\n\nProcess Hazard An"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32196,
      "SummaryText": "alysis Pactiv conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. FMEA methodology is used to carry out these analyses. These studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and revalidated at a regular interval of 5 years and when major changes are made to the covered process. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered process, Pactiv maintains written\noperating procedures. These procedures address various modes of operation such as startup, shutdown,\nnormal operations temporary operations, emergency shutdown and emergency operations. The information is\nreviewed on a regular basis and is readily accessible to operators involved in the process.\n\nTraining\nPactiv has a comprehensive training program in place to ensure that employees who are operating\ncomponents of the covered process am competent in the operating procedures associated with these\ncomponents. Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity \nPactiv performs documented maintenance checks on covered process equipment to ensure proper operations. Process equipment examined by these checks includes but is not limited to storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The maintenance operations are done by qualified personnel with previous training in maintenance practices; and these personnel are provided specialized training as needed.   \n\nManagement of Change\nWritten procedures are in place at Pactiv to manage changes in covered process chemicals, technology,\nequipment and procedures. Operations, maintenance personnel or any oth"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32196,
      "SummaryText": "er employee whose job tasks are\naffected by a modification in the covered process conditions are promptly made aware of and given training to\ndeal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to additions and modifications to the covered process are conducted as a\nregular practice at Pactiv. These reviews are conducted to confirm that construction, equipment, operating\nand maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nPactiv will continue to conduct periodic audits to ensure that the provisions set forth under the RMP and PSM\nrules are being implemented. Any corrective actions required as a result of the audits will be undertaken in a\nsafe and prompt manner.\n\nIncident Investigation\nPactiv promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic\nrelease of a regulated substance. These investigations are undertaken to identify the situation leading to the\nincident as well as any corrective actions that would prevent the release from reoccurring. All reports are\nretained at our facility for a minimum of 5 years.\n\nEmployee Participation\nPactiv truly believes that process safety management and accident prevention is a team effort. Company\nemployees are strongly encouraged to express their views concerning accident prevention issues and they\nactively participate in process safety management. In addition, Pactiv employees have access to all\ninformation created as part of the facility's implementation of the RMP and PSM rules, including information\nresulting from process hazard analyses.\n\nContractors on occasion, Pactiv hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough safety performance evaluation of the contractor is carried out. Pactiv has a strict policy of informing the contractors of known potential hazards related the contractors work and the cov"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32196,
      "SummaryText": "ered process. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n4. FIVE-YEAR ACCIDENT HISTORY\n\nPactiv has an excellent record of preventing accidental releases over the last 5 years. As a result of Pactiv's stringent release prevention programs, there have been no significant accidental releases during this period.\n\n5. EMERGENCY RESPONSE PLAN\n\nPactiv maintains a written emergency evacuation plan for the safety of our employees during accidental releases of hazardous materials. The plan includes adequate first aid and medical treatment, evacuations and notification of local emergency response agencies. Pactiv employees do not respond to the emergency.\n\nEmergency notification equipment is regularly inspected and serviced to ensure proper functioning. Upon modification of the covered process, the plan is promptly updated to reflect any pertinent changes within the covered process that would require a modified emergency response.\n\n6. PLANNED CHANGES TO IMPROVE SAFETY\n\nTo enhance our continuous improvement in occupational safety and health, we conduct monthly general safety planning meetings which includes employee participation."
    }
  ]
}