{
  "FacilityID": 32200,
  "FacilityName": "metalsAmerica, Inc.",
  "FacilityStr1": "135 Old Boiling Springs Road",
  "FacilityStr2": null,
  "FacilityCity": "Shelby",
  "FacilityState": "NC",
  "FacilityZipCode": "28152",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37045",
  "LEPC": "Cleveland County LEPC",
  "FacilityLatDecDegs": "35.292500",
  "FacilityLongDecDegs": "-081.585000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.imc-group.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 783664683,
  "ParentCompanyName": ".",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Peter Schorsch",
  "OperatorStr1": "165 Township Line Road",
  "OperatorStr2": null,
  "OperatorCity": "Jenkintown",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19046",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093524",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2009-06-15 00:00:00",
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 35.2925,
  "FRS_Long": -81.585,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "20000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46584,
      "AltID": "Chlorine",
      "FacilityID": 32200,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61399,
          "ProcessID": 46584,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47615,
          "ProcessID": 46584,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26637,
              "Process_NAICS_ID": 47615,
              "SafetyReviewDate": "2003-03-31 00:00:00",
              "PHA_Date": "2003-03-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-03-31 00:00:00",
              "TrainingReviewDate": "2004-04-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-03-31 00:00:00",
              "EquipmentInspectionDate": "2003-11-01 00:00:00",
              "EquipmentTested": "packrd column scrubber; pumps",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-11-20 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2003-03-09 00:00:00",
              "AuditCompletionDate": "2004-09-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-03-31 00:00:00",
              "HotWorkPermitReviewDate": "2003-03-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 38888,
                  "PreventionProgram3ID": 26637,
                  "ProcessChemicalID": 61399
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32200,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-03-31 00:00:00",
    "ERTrainingDate": "2004-04-08 00:00:00",
    "CoordinatingAgencyName": "Cleveland CountyLEPC",
    "CoordinatingAgencyPhone": "7044844841",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32200,
      "SummaryText": "General Executive Summary for metalsAmerica, Inc.\nIMC Group ¿ 2004\nShelby, North Carolina\nPrepared by\nWrightPadgettChristopher, Inc.\n10907 Downs Road\nCharlotte, NC 28134\nTelephone: (704) 927-4000\n\n1.\tAccidental Release Prevention and Emergency Response Policies\n\nWe at International Metals & Chemicals Group (IMC Group) are strongly committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, and maintenance demonstrates this commitment, along with employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with the Cleveland County LEPC and Emergency Response Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nThe facility manufactures materials for use in the electroplating industry.  The facility casts copper and tin, cuts nickel, and also formulates inorganic metallic salt solutions for the electroplating industry.  The operations are located in Shelby, North Carolina and housed in a 160,000 square foot facility.  We employ approximately 92 people and operate 24 hours a day five days a week.  The regulated substance present at our facility used in the production of the inorganic metallic solutions is chlorine. \n\nThe Chlorine process is a Program 3 process because it is covered under OSHA Process Safety Management rules.  The maximum inventory of chlorine at our facility is 12,000 lb.  The chlorine is stored in one-ton cylinders.  Two cylinders are hooked up to the process and up to a maximum of four additional cylinders are on site at any time.\n\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), incl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32200,
      "SummaryText": "uding administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nTo perform the required off-site consequence analysis for our facility, we have used equations from Appendix D of the EPA's Offsite Consequence Analysis Guidance and the model EPA Comp.  .  In compliance with the requirements for the June 21, 2004 resubmittal facilities are no longer required to describe their Offsite Consequences Analysis (OCA) in the Executive Summary of the RMP. Accordingly, facilities may revise their RMPs at any time to remove this information.  Most facilities may choose to do so as part of updating and re-submitting their RMPs, which facilities must do at least once every five years.  Since most facilities submitted their initial RMPs by the original June 21, 1999 deadline and have not updated and re-submitted their RMPs since, most facilities will need to update and re-submit their RMPs by June 21, 2004.  EPA has revised the RMP rule to remove the requirement that facilities include a brief description of the off-site consequences of hypothetical worst-case and alternative accidental releases (i.e., OCA) as part of the Executive Summary.  This revision addresses security concerns.\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken the necessary steps to comply with the accidental release prevention requirements set forth under 40 CFR part 68 of the EPA.\n\n\n4.1\tChlorine Process\n\nThe Chlorine process at our facility is subject to the OSHA PSM standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program in place at our Chlorine source.\n\nProcess Safety Information\nIMC Group maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the process.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32200,
      "SummaryText": "ards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a what-if analysis.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, IMC Group maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\nTraining\nIMC Group has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\n\nMechanical Integrity\nIMC Group carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Qualified personnel with previous training in maintenance practices carry out maintenance operations.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at IMC Group to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modifi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32200,
      "SummaryText": "cation in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in the established process are conducted as a regular practice at IMC Group.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nIMC Group conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nIMC Group promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nIMC Group truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  IMC Group has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32200,
      "SummaryText": "actors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.\tFive-year Accident History\nIMC Group has an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period from a covered process.\n\n6.\tEmergency Response Plan\nIMC Group coordinates with the Cleveland County LEPC and Emergency Management to deal with accidental releases of hazardous materials.  Additionally, IMC Group has an emergency response plan that outlines procedures to follow in the event of an accidental release.\n\n 7.\tPlanned Changes to Improve Safety\nIMC Group is dedicated to safety.  IMC Group is currently updating its preventative maintenance procedures for the facility and each covered process.\n\n 8.\tCertification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n9.\t         Consultant Preparer Information\n\nWrightPadgettChristopher, Inc.\n10907 Downs Road\nCharlotte, NC 28134\nTelephone: (704) 927-4000\n \n\n10. \tRevision Information\nSpecific revision information is included in the attached letter from A.L. Shatto related to modifications requested in a compliance assistance letter from NC DENR dated January 28, 2003.  Additionally, information related to the hydrofluoric acid (HF) process is deleted from this RMP submittal, as the HF process is no longer in use at metalsAmerica, Inc.\n\n\nName:\t\tRichard Strachan\nSignature:\nTitle:\t\tTechnical Director\nDate signed:\tJune 15, 2004"
    }
  ]
}