{
  "FacilityID": 32214,
  "FacilityName": "Grapevine Water Treatment Plant",
  "FacilityStr1": "2600 Fairway Dr",
  "FacilityStr2": null,
  "FacilityCity": "Grapevine",
  "FacilityState": "TX",
  "FacilityZipCode": "76051",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.961389",
  "FacilityLongDecDegs": "-097.053056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Grapevine",
  "OperatorStr1": "2600 Fairway Dr",
  "OperatorStr2": null,
  "OperatorCity": "Grapevine",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76051",
  "OperatorZipCodeExt": null,
  "RMPContact": "Matt Singleton",
  "RMPTitle": "Director of Public Works",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000159151",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-02-13 00:00:00",
  "ErrorReportDate": "2007-02-13 00:00:00",
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 32.96139,
  "FRS_Long": -97.05306,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46598,
      "AltID": "Water Treatment Plant",
      "FacilityID": 32214,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47632,
          "ProcessID": 46598,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61418,
          "ProcessID": 46598,
          "ChemicalID": 56,
          "Quantity": 4500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 61419,
          "ProcessID": 46598,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561418,
          "ProcessID": 46598,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561419,
          "ProcessID": 46598,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32214,
      "SummaryText": "Executive Summary\n\nThe purpose of the Accidental Release Prevention Risk Management Program rule (40 CFR Part 68) is similar to the Occupational Safety and Health Administration?s Process Safety Management Program, which is designed to protect workers from accidental releases of hazardous substances.  The chemical accident prevention regulations require that full updates and resubmissions of Risk Management Plans (RMPs) at least once every five years.  The City of Grapevine complied with the rule by submitting our RMPs on August 18,1999, and now are complying with the five year resubmission requirement.  The City of Grapevine personnel and GIS department compiled the updated data using the available tools provided by the United States Environmental Protection Agency (USEPA), DEGADIS+, ALOHA and ESRI?s ArcMap product.  The City of Grapevine WTP facility stores chlorine and ammonia and are covered by the Accidental Release Prevention Risk Management Program rule.\n\nThe Grapevine Water Treatment Plant uses chlorine and ammonia as a component of a chloramine disinfectant in the water treatment process for the purpose of consumption and to insure that the water is potable.  The Grapevine WTP regularly has storage of a maximum of 1,000 gallons of ammonia at its facility and a maximum of 12 one-ton containers of chlorine, which are stored outside in stationary tanks.  Both are above the threshold limits set by the USEPA.  The ammonia feed facility at the Grapevine WTP consists of one 1,000 gallon stationary tank, gaseous piping and valves, ammoniators and gas diffusers.  The Chlorine system consists of up to 12 one-ton containers, two vacuum regulators with an automatic switch over module, gas piping, valves, ejectors, and chlorine diffusers.  The only place on the plant grounds that chlorine gas has a potential to generate a gaseous release is the chlorine storage area.\n\nThe City of Grapevine prevention program includes safety information, hazard review, operating procedur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32214,
      "SummaryText": "es, training, maintenance, incident investigation and compliance audits.  The Grapevine WTP facility maintains material safety data sheets on chlorine and ammonia.  The Grapevine WTP uses SARA Title III, Chlorine Institute, Texas Commission on Environmental Quality (TCEQ) ? Rules and Regulations for Public Water Systems, Uniform Fire Code (UFC), and Compressed Gas Association (CGA) practices and guidelines to insure compliance with federal or state regulations, standards and codes, and industry guidelines.  \n\nThe City of Grapevine conducted a review of hazards associated with Chlorine and Ammonia.  The City of Grapevine looked at several safety improvements during the five-year review and still is considering making upgrades in the near future when plant expansions and/or improvements are necessary.  These improvements are to be made and designed when the City of Grapevine replaces current equipment in the near future.  \n\nThe Grapevine WTP updated operating procedures, training and maintenance based on the hazard review assessment. The Grapevine WTP carries out consistent operation and maintenance of its chlorine and ammonia systems utilizing only fully trained personnel in this area.  The City of Grapevine Management enforces consistent operation through discipline for operational deviations. The City of Grapevine utilizes several safety protocols by including safety in the contract bids for chemicals by requiring suppliers to comply with the City?s policies.  The City of Grapevine has several safety items in place such as isolation valves, leak detection, and a operator awareness program, which requires operators to walk the plant and check these items on a routine basis, which will help in the detection of any problems that might arise.\n\nThe Grapevine WTP facility in Grapevine, Texas has an excellent record in preventing and minimizing releases of ammonia and chlorine and maintains procedures and policies to investigate accidental releases that might occur. The e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32214,
      "SummaryText": "mergency response policies at this facility ensure that there is emergency response coverage 24 hours per day, 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as the Grapevine Fire Department in the event of an emergency.  In the event of a release, plant staff will contact the Grapevine Fire Department, relaying information regarding the release prior to implementing plant evacuation to a location outside the plant gates, awaiting the arrival of the fire department to inform its personnel of all information about the release and to provide assurance that the plant has been totally evacuated.  \n\nThe Grapevine WTP accident history was reviewed for a period from June 1999 through June 2004.  During this period of time no accidental releases of chlorine or ammonia had occurred.\n\nAs mentioned earlier, the Grapevine Water Plant has developed an Emergency Response Program involving immediate plant evacuation once the City?s Fire Department is called to implement response and repair to leaking ammonia or chlorine gas.  The plant is staffed 24 hours per day and 7 days per week.  Plant operators are required to make rounds for inspection and monitoring of the plant processes at least every two hours.  Accordingly, plant staff will detect any releases of ammonia and the Fire Department is trained to respond to this situation The Emergency Response Plan includes procedures to follow in the event of a ammonia emergency, information about the plant evacuation plan, and a detailed description of the emergency responder?s plan for handling such an emergency. \n\nThe Grapevine Fire Department has been designated to provide emergency responders and equipment, and will assume Incident Command upon arrival to the plant?s emergency call. \n\nThe City of Grapevine conducted a review of the existing Accidental Release Prevention Risk Management Program to determine if the City of Grapevine complied with the updated Accidental Release Preventi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32214,
      "SummaryText": "on Risk Management Program rules (40 CFR Part 68). After updating the required elements, the City of Grapevine is now in compliance with the Accidental Release Prevention Risk Management Program rules (40 CFR Part 68)."
    }
  ]
}