{
  "FacilityID": 3228,
  "FacilityName": "Elizebeth George Water Treament Plant",
  "FacilityStr1": "1125 Banner Lava Cap Road",
  "FacilityStr2": null,
  "FacilityCity": "Nevada City",
  "FacilityState": "CA",
  "FacilityZipCode": "95959",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06057",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "39.2375",
  "FacilityLongDecDegs": "121.025",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "barretta@nid.dst.ca.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nevada Irrigation District",
  "Company2Name": null,
  "CompanyDUNS": 47883061,
  "Company2DUNS": 0,
  "OperatorName": "Nevada Irrigation District",
  "OperatorStr1": "P.O. Box 1019",
  "OperatorStr2": null,
  "OperatorCity": "Grass Valley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95945",
  "OperatorZipCodeExt": "1019",
  "RMPContact": "Benedict J. Barretta",
  "RMPTitle": "Assistant General Manger",
  "FTE": 2,
  "OtherEPAFacilityID": "4941",
  "EPAFacilityID": "100000039647",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-12-07 00:00:00",
  "DeRegistrationEffectiveDate": "2012-05-07 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.3027,
  "FRS_Long": -120.9687,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3617,
      "AltID": "water treatment plant",
      "FacilityID": 3228,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3690,
          "ProcessID": 3617,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3869,
          "ProcessID": 3617,
          "ChemicalID": 62,
          "Quantity": 2500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503869,
          "ProcessID": 3617,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3228,
      "SummaryText": "\n\nExecutive Summary\n\nNevada Irrigation District\n\nElizabeth George Water Treatment Plant\n\n\n\nThe Elizabeth George Water Treatment Plant is owned and operated by the Nevada Irrigation District which is a local governmental agency headquartered in Grass Valley, California. It is governed by the citizens of the district who elect its board of directors, and it is staffed by approximately 160 regular employees. This plant is located in a residential neighborhood in Nevada County between the communities of Nevada City and Grass Valley. It uses chlorine gas as its disinfecting agent, and processes untreated surface water that originates from reservoirs in the High Sierra. It produces some of the finest drinking water in the world.\n\nIn 1994 a project, costing approximately $5 Million, upgraded the facility to current standards. This project placed the handling, storage and usage of chlorine in the separate building no connected to other building that do other processes. The fact that we have never experienced a measurable release of chlorine gas attests to the high degree of care and training. It is a level of excellence that upper management and the community insist is maintained.\n\nThe Nevada irrigation District's Accidental Release Prevention Policy involves a unified approach that integrates technologies, procedures, and management practices. The district adheres to all applicable procedures of the Environmental Protection Agency Prevention program. The district's Emergency Response Policy involves the preparation response plans which are tailored to this facility and to the emergency response of the community and local responding agencies. It is in compliance with the EPA emergency Response program requirements.\n\nThe offsite consequence analysis includes two scenarios. The first releases the chlorine gas in ten minutes at an amount of two thousand pounds. The second scenario states that 317 pounds would be released in sixty minutes. Any release would trigger alarm and Au"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3228,
      "SummaryText": "toDial systems and quick response from district personnel and emergency local responding agencies. It would activate our emergency response plan.\n\nThe Nevada Irrigation District's accidental release prevention program is in compliance with the OSHA PSM rule and is based upon the following key elements:\n7 A high level of training of our state certified plant operators.\n7 A preventive maintenance program with strict adherence.\n7 The use of state of the art process and safety equipment.\n7 The use of accurate and effective operating procedures written with the participation of the operators.\n7 The performance of hazard review and inspection programs.\n7 The implementation of an auditing and inspection program.\n\nThe operators of this facility are Certified Water Treatment Operators, Grade II through Grade IV. They are trained and certified by the California Department of Health Services. As part of their certification and their training, the emphasis of safe handling , high standards of maintenance of processing equipment, release prevention and emergency response are made a top priority. Regular safety training, preventive maintenance of equipment, and continuing education are the intrinsic duties of the operators of this plant.\n\nThe District's nine treatment plant operators and supervisors make up the Chlorine Emergency Response Team. They are trained regularly in the usage of self-contained breathing apparatus while wearing B level chemical suits. The District has one ton and one hundred and fifty pound chlorine emergency repair kits. The response team's exercises include the use of these kits while wearing the suits and the self-contained breathing apparatus systems. Training exercises are performed at the plant site while simulating equipment failures. Each team member has regular cardiopulmonary testing. The District has a health clinic and provides excellent healthcare benefits.\n\nThe Foundation of our Accidental Release Prevention Program is the chlorine leak detec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3228,
      "SummaryText": "tion system that is installed at the site. It is connected to a telemetry alarm and an automatic dialing systems that notifies the appropriate personnel who are on twenty-four hour call. This system as well as other processing systems are tested and maintained regularly. Major overhauls on all system components, including the leak detection system, are preformed annually.\n\nThe emergency response program includes interaction and communication with local and State responsive agencies. The Nevada County Department of Environmental Health, as part of their business plan program, inspects our facilities bi-annually and is notified immediately if there is a hazardous release. The Nevada County Consolidated Fire District, as incident commander in the case of a chlorine release, coordinates evacuation procedures in a worst case scenario. The California State Office of Emergency Services and Nevada County Office of Emergency Services are also notified in a worst case scenario. The District's chlorine manufacturer is also notified.\n\nThese policies and procedures are described in the Nevada Irrigation District's Chlorine Process Safety Management Manual. This manual, as required by State and local regulatory agencies, also contains information and procedures relating to chlorine processing equipment, handling, leak response and repair procedures, education and safety training. It contains a HAZOP Study and various report forms.\n\nThe Elizabeth George Plant meets all current safety requirements. As in the past, the Nevada Irrigation District will comply with any and all new requirements and advancements in water treatment processes and safety. The well being of our community and our employees is paramount in the goals of our organization."
    }
  ]
}