{
  "FacilityID": 32312,
  "FacilityName": "ConAgra Foods - Foodservice Company, Lufkin, TX",
  "FacilityStr1": "800 Ellen Trout Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lufkin",
  "FacilityState": "TX",
  "FacilityZipCode": "75902",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48005",
  "LEPC": "Angelina County LEPC",
  "FacilityLatDecDegs": "31.373056",
  "FacilityLongDecDegs": "-094.717778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7258908,
  "ParentCompanyName": "ConAgra, Inc.",
  "Company2Name": "ConAgra Foods Culinary Foods Division",
  "CompanyDUNS": 7258908,
  "Company2DUNS": 7258908,
  "OperatorName": "ConAgra Foods Lufkin, Texas",
  "OperatorStr1": "800 Ellen Trout Drive",
  "OperatorStr2": null,
  "OperatorCity": "Lufkin",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75902",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122805",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-06-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2008-03-31 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 31.373056,
  "FRS_Long": -94.717778,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "removed all ammonia from the ammonia refrigeration system & sold the facility",
  "_processes": [
    {
      "ProcessID": 46736,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 32312,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61585,
          "ProcessID": 46736,
          "ChemicalID": 56,
          "Quantity": 51000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47771,
          "ProcessID": 46736,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26728,
              "Process_NAICS_ID": 47771,
              "SafetyReviewDate": "2004-02-16 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-07-26 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "There are 3 ammonia detectors in the engine room and 1 ammonia detector by each of 4 critical air units.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Ammonia detectors are present in the engine room and by each critical air unit.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-16 00:00:00",
              "TrainingReviewDate": "2004-02-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-16 00:00:00",
              "EquipmentInspectionDate": "2004-02-16 00:00:00",
              "EquipmentTested": "2/16/04",
              "ChangeMgmtDate": "2004-04-08 00:00:00",
              "ChangeMgmtReviewDate": "2001-03-16 00:00:00",
              "PreStartupReviewDate": "2001-11-23 00:00:00",
              "ComplianceAuditDate": "2004-05-26 00:00:00",
              "AuditCompletionDate": "2005-01-01 00:00:00",
              "IncidentInvestigationDate": "2004-03-31 00:00:00",
              "InvestigationChangeDate": "2004-05-01 00:00:00",
              "ParticipationPlansReviewDate": "2003-09-01 00:00:00",
              "HotWorkPermitReviewDate": "2004-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-03-31 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 39002,
                  "PreventionProgram3ID": 26728,
                  "ProcessChemicalID": 61585
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32312,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-01 00:00:00",
    "ERTrainingDate": "2003-04-01 00:00:00",
    "CoordinatingAgencyName": "Lufkin Fire Dept./ Angelina LEPC",
    "CoordinatingAgencyPhone": "9366330366",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32312,
      "SummaryText": "Risk Management Plan\nConAgra Foods ¿ Foodservice Company\nFrozen Division\n\nI.\tIntroduction\nA Risk Management Program has been implemented at the ConAgra Foods - Foodservice Company (ConAgra), Lufkin facility, for the reduction of accidental releases of hazardous materials. This Program summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to site personnel, contractors, visitors, and the community and environment at large of hazardous chemical releases. The Risk Management Plan (RMP) is organized to correspond with specific U.S. Environmental Protection Agency (EPA) RMP, Program 3 of 40 CFR 68, definitions and requirements of Subpart G, including: \n·\tIntroduction;\n·\tConAgra¿s policies to protect health, environment, and safety;\n·\tFacility identification and regulated substances covered processes;\n·\tHazard Assessment;\n·\tPrevention Program;\n·\tFive-Year Accident History;\n·\tEmergency Response Plan; \n·\tEmergency Communications;\n·\tSpill Reporting / Environmental Release Procedures;\n·\tPlanned changes to improve safety; and\n·\tManagement Program\n\nII.\tConAgra¿s Policies To Protect Health, Environment, and Safety\nRisk management and safety are important concerns at ConAgra; this RMP formalizes and documents these activities. ConAgra is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. It is ConAgra¿s policy to comply with all applicable federal, state, and local rules and regulations.\n\nThis RMP has identified potential hazards and has taken steps to design and maintain a safe facility in order to prevent releases, and minimize the consequences of accidental releases, which could occur. RMP addresses potentially catastrophic chemical releases that could result in immediate harm and acute health effects to offsite receptors (public and environmental). The RMP includes the Facility¿s Emergency Response Plan (ERP) that contains pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32312,
      "SummaryText": "cedures, which are designed to maximize the safety of all employees, contractors, and visitors in the event of an emergency and also guard against environmental consequences.\n\nAlthough ammonia is a listed toxic substance, it is also a ubiquitous material, which is used by the surrounding farmers for fertilizer. Pursuant to 40 CFR 68.125 Exemptions ¿ Ammonia used as an agricultural nutrient, when held by farmers, is exempt from all provisions of this part (40 CFR 68).\n\nIII.\tFacility Identification\nThe ConAgra facility is located at 800 Ellen Trout Drive, Lufkin, Texas. The facility is a producer of numerous meat products and sauces / gravies.  Some of the meat products include marinated chicken and fajita meat.  The NAICS code for the facility is 311612. Many areas of the plant are refrigerated to preserve the meat products. \n\nThe facility uses ammonia for refrigeration, and is regulated under 40 CFR Part 68, the EPA RMP Rule. There is one refrigeration system onsite that is used for refrigerating meat products. The system previously contained a charge of 34,780 pounds of ammonia. The amount of ammonia currently present in the refrigeration system is approximately 51,000 pounds, which is above the minimum threshold quantity of 10,000 pounds. \n\nA topographic map identifying the site location is included as Appendix A. An area map is included as Appendix B. \n\nIV.\tHazard Assessment ¿ Worse Case Scenarios (WCS)\n Appendix C consists of the RMP*Submit Printout and contains additional information on the worst-case scenario.  Appendix D consists of the offsite consequence analysis data and maps for the worse case release scenario. \n\nV.\tHazard Assessment ¿ Alternative Release Scenarios (ARS)\nAppendix C consists of the RMP*Submit Printout and contains additional information on the worst-case scenario.  Appendix E consists of the offsite consequence analysis data and maps for the alternative release scenario. \n\nVI.\tGeneral Accidental Release Prevention Program\nA prevention prog"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32312,
      "SummaryText": "ram is in place to minimize the risk of hazardous chemical releases in accordance with the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) and the EPA Risk Management Program. This prevention program covers those processes that handle ammonia above the threshold quantity for both PSM and RMP rules. The next audit of the PSM program will occur by May 26, 2007, in compliance with the requirement to conduct PSM audits every three years.  The elements of the PSM / Program 3 prevention program and a brief description are listed below.\n·\tEmployee Participation ¿ ConAgra has developed a site-specific employee participation plan that ensures employees and their representatives are consulted when conducting and developing process hazard analyses and other information required to be developed under the PSM/RMP regulation.  In addition, the employee participation program ensures employees and their representatives have access to process hazard analyses and all other information required to be developed under PSM/RMP.  Employees at ConAgra have assisted in developing the initial PHA for the ammonia process and will participate in updating and revalidating the PHA every five years.  In addition, employees have assisted in the development of other PSM/RMP information such as the development of operating and preventative maintenance procedures.\n·\tProcess Safety Information ¿ ConAgra has developed a site-specific PSI program that ensures information pertaining to the hazards, technology, and equipment of the process are properly developed and maintained. Process safety information for the ammonia process has been compiled and was last reviewed and updated as of February 16, 2004.\n·\tProcess Hazard Review ¿ ConAgra has developed a site-specific PHA program that ensures a PHA is conducted initially, at a minimum of every five (5) years, and whenever a change is significant enough    to require a change in PSI.  In addition, this program has been established to ensure P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32312,
      "SummaryText": "HAs are conducted in accordance with OSHA and EPA regulations and to ensure findings and recommendations of PHAs are properly documented. The last PHA was completed on  July 26, 2001.\n·\tOperating Procedures ¿ ConAgra has developed a site-specific procedure that ensures operating procedures provide clear instruction for different phases of process operations and ensures they are properly maintained.  The Standard Operating Procedures were updated on February 16, 2004. Annually, the operating procedures will be reviewed and certified as accurate.\n·\tTraining ¿ ConAgra has developed a site-specific training procedure that ensures employees operating the ammonia process have the knowledge to safely operate the process, are aware of the potential hazards of the process, and understand the causes of process problems.\n·\tManagement of Change ¿ ConAgra has developed a site-specific management of change procedure that ensures changes (except for replacement in kind) to the ammonia process, such as additions of new equipment or changes in operating, maintenance, or other procedures are documented. \n·\tPre-Startup Review ¿ ConAgra has developed a site-specific pre-startup safety review procedure that ensures a safety review is performed when modifications to the ammonia process are significant enough to require a change in PSI.\n·\tMechanical Integrity ¿ ConAgra has developed a site-specific mechanical integrity procedure that ensures written preventative maintenance procedures are developed and maintained, preventative maintenance tests and inspections are properly documented, and employees maintaining the process receive adequate training.  Preventative maintenance procedures have been established within written operating procedures dated February 16, 2004. In addition, a preventative maintenance database application has been established to assist in documenting and tracking preventative maintenance activities.\n·\tContractor Qualifications ¿ ConAgra has developed a site-specific c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32312,
      "SummaryText": "ontractor qualification procedure that ensures all contract employers¿ safety performance and programs are evaluated, a contract employee injury and illness log is maintained, information of potential hazards are communicated between ConAgra and the contract employer, and required training and information is communicated, such as the provisions of the emergency action plan and control over entrance into process areas.\n·\tIncident Investigation ¿ ConAgra has developed a site-specific incident investigation procedure that ensures each incident that either results in a release or could have resulted in a release of anhydrous ammonia is investigated, within 48 hours, by a team of at least one person knowledgeable in the process.  This procedure also makes provisions to ensure a report is prepared at the conclusion of the investigation and findings are promptly addressed. \n·\tCompliance Audit ¿ The facility completed an original RMP on June 21, 1999 for the ammonia refrigeration system that held a charge of 34,780 pounds of ammonia. The amount of ammonia currently present in the refrigeration system is approximately 51,000 pounds. A compliance audit was conducted on May 26, 2004, and the next compliance audit will be conducted by May 26, 2007.  ConAgra has developed a site-specific compliance audit program that ensures compliance audits are conducted at a minimum of every three years to verify that ConAgra¿s PSM/RMP practices and procedures are adequate and are being followed.\n·\tHot Work Permits ¿ ConAgra has developed and implemented a best management practice for hot work.\n\nVII.\tFive-Year Accident History\nThe ConAgra facility has not had an accidental anhydrous ammonia release, which resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nVIII.\tEmergency Response Program\nConAgra has an Emergency Response Plan (ERP), updated o"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32312,
      "SummaryText": "n July 1, 2003, to ensure that in the event of an emergency the facility personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release. Response activities are coordinated with the Angelina County Local Emergency Planning Committee (LEPC) and the Lufkin Fire Department (which includes a HAZMAT Team). This coordination effort includes providing the fire departments with site diagrams and hazardous material information, meeting with fire department personnel to discuss facility operations/processes, and periodic on-site inspections by fire department personnel.\n\nThe facility maintains an ERP on file at the plant. According to the ERP, facility employees are responsible for investigating and assisting the fire department (if necessary) with response to accidental releases of ammonia. The plan includes annual training of all employees on evacuation procedures and emergency notification procedures. The plan also includes annual training for emergency response team members. It identifies the Emergency Response Coordinators and Evacuation Coordinator.  In addition to the facility ERP, the plant is included in a community emergency response plan developed by the Angelina County Local Emergency Planning Committee. ConAgra coordinates with the Lufkin Fire Department (which includes a HAZMAT Team) on emergency response activities. \n\nThe facility has a windsock present onsite for use in determining wind direction in the event of an ammonia release. \n\nResponders receive HAZWOPER training through classroom instruction, on-the-job training and drills. HAZWOPER training includes the first responder awareness level, the first responder operations level and hazardous materials technician training.  The facility¿s Chief Engineer also receives incident commander training. Responder HAZWOPER training includes procedures for using and maintaining emergency response equipment as required.\n\nThe facility's Onsite Incident Com"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32312,
      "SummaryText": "mander or Emergency Response Coordinator (Chief Engineer) is responsible for notifying onsite emergency response personnel, emergency response contractors and local, state and federal agencies of releases. The Plant Manager is responsible for submitting written communication concerning releases to local, state and federal agencies.\n\nThe facility¿s Evacuation Coordinator (Human Resources Manager) is responsible for coordinating site evacuation in the event of a release that requires evacuation.\n\nThe facility¿s Emergency Response Plan is maintained onsite as part of the Risk Management Program. \n\nThe current Material Safety Data Sheet (MSDS) for anhydrous ammonia is included in Appendix F. \n\nIX. \tEmergency Communications\nThe telephone numbers of agencies and plant personnel that may be contacted in case of an emergency are included in the facility¿s Emergency Response Plan.  \n\nX.\tPlanned Changes to Improve Safety\nChemical safety is an important part of ConAgra¿s operations. ConAgra recently conducted an audit of their Process Safety Management Program and will be dutifully implementing the recommendations from that audit. Continuous improvement in safety is an important goal for ConAgra. In addition to the facility ERP, the plant is included in a community emergency response plan developed by the Angelina County Local Emergency Planning Committee. \n\nXI.\tManagement Program\nConAgra has developed a management system to oversee the implementation of the risk management program elements.  This includes assigning a qualified person (or position) to have overall responsibility for the development, implementation, and integration of the risk management program elements.  If any portion of the program is delegated to others, the names or positions of those individuals need to be documented and the lines of authority defined through an organization chart or similar document.  James A. Richardson, Chief Engineer, is responsible for implementation of the overall Risk Management P"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32312,
      "SummaryText": "rogram."
    }
  ]
}