{
  "FacilityID": 3236,
  "FacilityName": "North Auburn Water Treatment Plant",
  "FacilityStr1": "12200 Locksley Lane",
  "FacilityStr2": null,
  "FacilityCity": "Auburn",
  "FacilityState": "CA",
  "FacilityZipCode": "95604",
  "Facility4DigitZipExt": "0000",
  "FacilityCountyFIPS": "06061",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.95",
  "FacilityLongDecDegs": "121.1",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "barretta@nid.dst.ca.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nevada irrigation District",
  "Company2Name": null,
  "CompanyDUNS": 47883061,
  "Company2DUNS": 0,
  "OperatorName": "Nevada irrigation District",
  "OperatorStr1": "P.O. Box 1019",
  "OperatorStr2": null,
  "OperatorCity": "Grass Valley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95945",
  "OperatorZipCodeExt": "1019",
  "FTE": 2,
  "OtherEPAFacilityID": "4941",
  "EPAFacilityID": "100000040289",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-09-25 00:00:00",
  "DeRegistrationEffectiveDate": "2013-01-02 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.95053,
  "FRS_Long": -121.09668,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3625,
      "AltID": "chlorine",
      "FacilityID": 3236,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 3877,
          "ProcessID": 3625,
          "ChemicalID": 62,
          "Quantity": 2500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 3698,
          "ProcessID": 3625,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1239,
              "Process_NAICS_ID": 3698,
              "SafetyReviewDate": "1997-03-10 00:00:00",
              "PHA_Date": "1999-01-05 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-28 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "telemetry alarm and autodial systems",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-03-10 00:00:00",
              "TrainingReviewDate": "1999-01-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-28 00:00:00",
              "EquipmentTested": "chlorinators and switchover systems",
              "ChangeMgmtDate": "1997-03-10 00:00:00",
              "ChangeMgmtReviewDate": "1997-03-10 00:00:00",
              "PreStartupReviewDate": "1999-05-28 00:00:00",
              "ComplianceAuditDate": "1997-08-11 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-03-10 00:00:00",
              "HotWorkPermitReviewDate": "1997-03-10 00:00:00",
              "ContractorSafetyReviewDate": "1997-03-10 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Nevada Irrigation District's accidental release prevention program involves a united approach that integrates technologies, policy,and management practices. It is in compliance with all EPA Prevention Program Requirements.                                                             1. Safety Information: The Nevada Irrigation District has developed and maintains written safety information about the chlorination process,the technology of chlorination and equipment used in its processing. The operation of this facility adheres to the guidelines of the Chlorine Institute.                                                                                                                  2. Process Hazardous Analysis:The District conducted a process of hazardous analysis appropriate to the complexity of the chlorination process that identified, evaluated, and controlled potential hazards using the HAZOP process. This process includes the analysis of hazards due to equipment malfunction and human error. It describes steps used to detect and monitor releases.This PHA will be updated in every three years and the district will conduct reviews whenever major changes to processes occur.                                                                                                                       3. Operating Procedures: The district has prepared written procedures that provide clear instructions for the safe operational activities associated with the chlorine process. These procedures are included in the Process Safety Management Manual. This manual includes procedures for operation of all phases of the processes,and normal and emergency shutdown and operation     and all newly assigned employees are trained and tested competent in all operation procedures. Training documentation is maintained on all of these employees. Refresher training is provided on emergency procedures is provided quarterly.             4. Mechanical Integrity: The district has a preventive maintenance program that insures the mechanical integrity of its chlorination processing equipment which includes periodic inspection, testing and an annual overhaul of critical processing equipment.                                                                                                         5. Management of Change: The District has implemented written procedures to manage changes (except changes in kind) to process chemical technology, equipment and procedures. Employees affected by a change in a process are informed of and trained in the change prior to start up of the process or affected part of the process. Safety information and operating procedures are  updated accordingly.                                                     6. Pre-Startup Review: Written procedures have been developed to allow operators to perform a pre-startup safety review for new and modified chlorination equipment, or where modification to the process is significant enough to require a change in the process safety information.                                                                                                         7. Compliance Audits: Compliance audits will be performed every three years to verify that the procedures and practices are adequate and are being followed.  Water treatment supervisors will perform the audit.  A report will be developed and deficiencies will be corrected. The two most recent audits will be kept.                                                                                                                      8. Incident investigation: The district will investigate any incident which results or could result in a catastrophic release of chlorine gas. The investigation will be performed within 48 hours of the incident. All key factors will be addressed and recommendations for correction will result. Finding will be reviewed by all affected personal. The report will be kept for five years.                                     9. Employee Participation: Managers and operators of Nevada Irrigation District water treatment plants participate in the process hazardous analysis. The PHA has been made available to all affected employees and is kept at the facilities.                                  10. Hot Work Permit: A hot work permit process has been developed and implemented for hot work operations conducted on or near the chlorination process. The permit documents the fire and accident prevention requirements and is implemented prior to beginning any hot work operations. The permit is kept on file until the completion of any hot work.                                                                   11. Contractors: Contractors working on or near the water treatment plant are required to comply with the regulatory provisions of the process safety management. A form has been developed to address the following: contractor safety program, informing of the hazard on the site, review of the emergency evacuation plans, record contractor meeting about the plans, and require contractor to train their employees in the hazards of the process. 12.Emergency Resonse Program: The Nevada Irrigation District has developed and implemented an emergency response program.  It is coordinated with the local emergency responders.",
              "_chemicals": [
                {
                  "PrimaryKey": 1389,
                  "PreventionProgram3ID": 1239,
                  "ProcessChemicalID": 3877
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3236,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1997-03-10 00:00:00",
    "ERTrainingDate": "1999-01-07 00:00:00",
    "CoordinatingAgencyName": "Placer Consol.Fire Protection Distr",
    "CoordinatingAgencyPhone": "9168897991",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "Placer county office of emergency services and environmental health department"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3236,
      "SummaryText": "\n\nExecutive Summary\n\nNevada Irrigation District\n\nNorth Auburn Treatment plant\n\n\n\n\nThe North Auburn Treatment Plant is owned and operated by the Nevada Irrigation District which is a local governmental agency headquartered in Grass Valley, California. It is governed by the citizens of the district who elect its board of directors, and it is staffed by approximately 160 regular employees. This plant is located in a residential and industrial subdivision in Placer County, California , North of the community of Auburn. It processes untreated surface water that originates from reservoirs in the High Sierra. It produces some of the finest drinking water in the world.\n\nThe Nevada Irrigation District's accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. The district adheres to all applicable procedures of the Environmental Protection Agency Prevention Program. The district Emergency Response Policy involves the preparation response plans which are tailored to this facility and to the emergency response of the community and local responding agencies. It is in compliance with the EPA Emergency Response Program requirements.\n\nThe North Auburn Treatment Plant has been installed to disinfect raw surface water and produce water for potable purposes. The plant includes a chlorination process building, an office, a control room and filters. The amount of chlorine connected to a manifold system is two one ton cylinders of gaseous chlorine.\n\nTh offsite consequences analysis includes two scenarios. The first scenario releases the gas in ten minutes at an amount of two thousand pounds. The second scenario states that 317 pounds of chlorine gas would be released in sixty minutes. Any releases would trigger an alarm and AutoDial system and quick response from district personnel and from emergency responding local agencies. It would activate our emergency response plan.\n\nThe Nevada Irrigation District's accid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3236,
      "SummaryText": "ental release prevention program is in compliance with the OSHA PSM rule and is based upon the following key elements:\n7 A high level of training of our state certified plant operators.\n7 A preventive maintenance program with strict adherence.\n7 Use of state of the art process and safety equipment.\n7 The use of an accurate and effective operating procedure written with the participation of the operators.\n7 Performance of hazard review of equipment and procedures.\n7 Implementation of an auditing and inspection program.\n\n\nThe operators of this facility are Certified Water Treatment Operators, Grade II through Grade IV. They are trained and certified by the California Department of Health Services. As part of their certification and their training, safe chlorine handling , high standards of maintenance of processing equipment, release prevention and emergency response are made  top priorities. Regular safety training, preventive maintenance of equipment, and continuing education are the intrinsic duties of the operators of this plant.\n\nThe District's nine treatment plant operators and supervisors make up the Chlorine Emergency Response Team. They are trained regularly in the usage of self-contained breathing apparatus while wearing B level chemical suits. The District has one ton and one hundred and fifty pound chlorine emergency repair kits. The response team's exercises include the use of these kits while wearing the suits and the self-contained breathing apparatus systems. Training exercises are performed at the plant site while simulating equipment failures. Each team member has regular cardiopulmonary testing. The District has a health clinic and provides excellent healthcare benefits.\n\nThe foundation of our accidental release prevention program is the chlorine leak detection system that is installed at the site. It is connected to an automatic dialing systems and a telemetry based alarm system that notifies the appropriate personnel who are on twenty-four hour ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3236,
      "SummaryText": "ll. This system as well as other processing systems are tested and maintained regularly. Major overhauls on all system components, including the leak detection system, are preformed annually.\n\nThe emergency response program includes interaction and communication with local and State responsive agencies. The Placer County Department of Environmental Health, as part of their business plan program, is notified immediately if there is a hazardous release. The Placer Consolidated Fire protection District, as incident commander in the case of a chlorine release, coordinates evacuation procedures in a worst case scenario. The California State Office of Emergency Services and Placer County Office of Emergency Services are also notified in a worst case scenario. The District's chlorine manufacturer is also notified.\n\nThese policies and procedures are described in the Nevada Irrigation District's Chlorine Process Safety Management Manual. This manual, as required by State and local regulatory agencies, also contains information and procedures relating to chlorine processing equipment, handling, leak response and repair procedures, education and safety training. It contains a HAZOP Study and various report forms.\n\nThe North Auburn Treatment Plant meets all current safety requirements. As it has in the past, the Nevada Irrigation District will comply with any and all new requirements and advancements in water treatment processes and safety. The well being of our community and our employees is paramount in the goals of our organization."
    }
  ]
}