{
  "FacilityID": 32387,
  "FacilityName": "Cypress Chemical Company",
  "FacilityStr1": "1305 Hwy 20 South",
  "FacilityStr2": "P.O. Box 589",
  "FacilityCity": "Helena",
  "FacilityState": "AR",
  "FacilityZipCode": "72342",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05107",
  "LEPC": "Phillips County LEPC",
  "FacilityLatDecDegs": "34.476667",
  "FacilityLongDecDegs": "-090.607500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "jcarr@uesg.net",
  "FacilityDUNS": 808231328,
  "ParentCompanyName": "Unified Environmental Services Group",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Unified Environmental Services Grou",
  "OperatorStr1": "1305 Hwy 20 South",
  "OperatorStr2": "P.O. Box 589",
  "OperatorCity": "Helena",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72342",
  "OperatorZipCodeExt": null,
  "FTE": 29,
  "OtherEPAFacilityID": "72342CYPRSHWY",
  "EPAFacilityID": "100000027641",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1492-AOP-R3",
  "SafetyInspectionDate": "1998-08-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 34.47361,
  "FRS_Long": -90.60261,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "PUBLIC LAND SURVEY-SECTION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46826,
      "AltID": "Ammonia Granulation",
      "FacilityID": 32387,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 61696,
          "ProcessID": 46826,
          "ChemicalID": 56,
          "Quantity": 255623.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47863,
          "ProcessID": 46826,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26780,
              "Process_NAICS_ID": 47863,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "2003-02-14 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Operating Procedures, contractor safety, preventive maintenance inspections",
              "OpProceduresReviewDate": "2002-08-21 00:00:00",
              "TrainingReviewDate": "2002-06-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-06-12 00:00:00",
              "EquipmentInspectionDate": "2002-08-15 00:00:00",
              "EquipmentTested": "anhydrous ammonia storage TANK",
              "ChangeMgmtDate": "2003-01-30 00:00:00",
              "ChangeMgmtReviewDate": "2002-06-12 00:00:00",
              "PreStartupReviewDate": "2002-08-21 00:00:00",
              "ComplianceAuditDate": "2003-01-24 00:00:00",
              "AuditCompletionDate": "2003-03-31 00:00:00",
              "IncidentInvestigationDate": "2004-04-13 00:00:00",
              "InvestigationChangeDate": "2004-06-30 00:00:00",
              "ParticipationPlansReviewDate": "2002-06-12 00:00:00",
              "HotWorkPermitReviewDate": "2002-06-12 00:00:00",
              "ContractorSafetyReviewDate": "2002-06-12 00:00:00",
              "ContractorSafetyEvalDate": "2002-06-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonium Sulfate Granulation Manufacturing Process",
              "_chemicals": [
                {
                  "PrimaryKey": 39068,
                  "PreventionProgram3ID": 26780,
                  "ProcessChemicalID": 61696
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32387,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-06-12 00:00:00",
    "ERTrainingDate": "2004-03-25 00:00:00",
    "CoordinatingAgencyName": "Phillips County LEPC",
    "CoordinatingAgencyPhone": "8703385530",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32387,
      "SummaryText": "1.0  Accidental Release Prevention and Response Policies\n\nCypress Chemical (Cypress Chemical) has a long standing commitment to operating our facility in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is Cypress Chemical system to help ensure the safe operation of our processes.  Our commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our processes, as well as extensive training of our operating personnel. \nIn the event of an accidental release, Cypress Chemical has procedures which are designed to control and contain the release in a manner which will be safe for our employees and will help prevent injury to the public and the environment.  Cypress Chemical?s emergency response personnel receive thorough training in handling accidental releases.  An emergency response coordinator has been assigned to oversee response activities and to coordinate response efforts with local emergency agencies. Communications with the Local Emergency Planning Committee (LEPC) have been ongoing throughout the preparation of this plan and policies.\nTo effectively implement these policies, Cypress Chemical established a management system headed by the Plant Manager to ensure the proper implementation and effectiveness of our Risk Management Program.\n\n\n2.0  Cypress Chemical and Regulated Substances\n\nCypress Chemical, located in Helena, Arkansas, is primarily involved in the manufacture of agricultural fertilizer products.  To manufacture our products, Cypress Chemical utilizes one regulated substance in sufficient quantity to be covered by the Risk Management Program Rule (RMP Rule).  The following table lists Cypress Chemical?s covered process under the RMP Rule and the associated Regulated Substance with its respective maximum quantity:\n\nProcess\nDescription    Program Level    Regulated\nSubstance    Maximum\nQuantity (l"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32387,
      "SummaryText": "bs)\nAmmonium Sulfate/Unity Granulation    3    Anhydrous Ammonia    255,623\n\n\n 3.0  Hazard Assessment\n\nCypress Chemical performed an offsite consequence analysis to estimate the potential impacts of accidental releases of anhydrous ammonia (NH3) from our process. The regulated substance was evaluated for a possible worse case release scenario and alternative release scenario.  It is important to understand that Cypress Chemical has invested extensive resources to prevent releases, and the potential for a worse case release is extremely small.  The alternative release scenario represents a more realistic potential for occurrence and is based on historical data from our process or other similar processes.  By identifying these potential releases, Cypress Chemical has developed an extensive program to prevent such an occurrence. This program is discussed in detail in the Prevention Program section of this plan.\nThe primary objective of performing the offsite consequence analysis is to determine the distance at which adverse effects might occur to the public and/or the environment as a result of an accidental release.  This point is called the endpoint distance.  At distances less than the endpoint distance, the adverse effects would be greater; at distances farther than the endpoint, the adverse effects would be less.\n\n\n4.0  Accidental Release Prevention Program 3\n\nCypress Chemical Ammonium Sulfate/Unity Granulation Process is covered by the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Ammonium Sulfate/Unity Granulation Process Prevention Program consists of the following elements.\n\n4.1  Process Safety Information\n\nCypress Chemical maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\n\n? physical properties of hazardous substances handled,\n? chemical properties and a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32387,
      "SummaryText": "ssociated hazards of those substances,\n? operating parameters and limitation(s) of the process equipment,\n? design basis and configuration of the equipment, and\n? specific chemical inventories.\n\nCypress Chemical ensures that the process safety information is available to all Cypress Chemical employees, the LEPC, and the local fire department.  The Plant Engineer is responsible for maintaining and updating this information, as needed.\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  MSDS information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates regarding the hazards of NH3 and other chemicals used in our processes.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are addressed and communicated to the appropriate parties.\nCypress Chemical also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes:\n\n? materials of construction,\n? design pressures,\n? temperature ratings,\n? electrical ratings,\n? flow limits,\n? block flow diagrams,\n? consequences of deviation from operating limits,\n? safety systems,\n? applicable design codes and standards,\n? process chemistry, and\n? design basis for relief and ventilation systems.\n\nWhen information was not available for design documents, it was developed through special project committees or during the Process Hazard Analyses (PHAs) of the Ammonium Sulfate/Unity Granulation Process.  Many of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\n\n? train employees,\n? perform Process Hazard Analyses (PHAs), and\n? help maintain the equipment.\n\nAll the above men"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32387,
      "SummaryText": "tioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Ammonium Sulfate/Unity Granulation Process are not compromised.\n\n4.2  Process Hazard Analysis\n\nCypress Chemical performs and periodically updates process hazard analyses (PHAs) of the Ammonium Sulfate/Unity Granulation Process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Ammonium Sulfate/Unity Granulation Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\nTo perform the PHAs, Cypress Chemical primarily uses the ?What-if/Checklist? technique.  The PHAs are conducted using a team of people with experience in engineering and Ammonium Sulfate/Unity Granulation Process operation and a leader with experience in process hazard analysis techniques. This team identifies and evaluates hazards of the process as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, including a list of recommendations ranked according to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the Plant Engineer and is tracked through completion.  The final resolution of each finding is documented and retained.\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, Cypress Chemical periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Ammonium Sulfate/Unity Granulation Process is no longer in operation.  The results a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32387,
      "SummaryText": "nd findings of these updates are documented and retained.  The team findings are forwarded to the Manager for consideration, and the final resolution of the findings is documented and retained.\n\n4.3  Operating Procedures\n\nCypress Chemical engineers, operators, and supervisors work together to develop and maintain written operating procedures to define how tasks related to the Ammonium Sulfate/Unity Granulation Process operation should be safely performed.  These written procedures address various modes of process operations, such as:\n\n? unit startup,\n? normal operations,\n? temporary operations,\n? emergency shutdown,\n? normal shutdown, and\n? initial startup of a new process.\n\nThe written operating procedures include:\n\n? steps for safely conducting process tasks,\n? applicable process safety information, such as safe operating limits and consequences of process deviations, and\n? safety and health considerations, such as chemical hazards, personal protective equipment requirements, and action(s) to take in the event of an exposure to a hazardous substance.\n\n4.4  Training\n\nCypress Chemical trains workers to safely and effectively perform their assigned tasks.  Cypress Chemical training program includes both initial and refresher training that covers:\n\n? a general overview of the Ammonium Sulfate/Unity Granulation Process,\n? the properties and hazards of the substances in the process, and\n? a detailed review of the process operating procedures and safe work practices.\n\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of Cypress Chemical ?s ongoing safety training effort.\n 4.5  Mechanical Integrity\n\nCypress Chemical maintains the mechanical integrity of Ammonium Sulfate/UnityGranulation Process equipment to help prevent failures that could endanger workers, the publ"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32387,
      "SummaryText": "ic, or the environment.  Cypress Chemical mechanical integrity program includes:\n\n? an inspection and testing program to help identify equipment deterioration and damage before the equipment fails,\n? a quality assurance program to help ensure that the new and replacement equipment meet the design standards required for service in our process,\n? procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or equipment opening,\n? training of maintenance personnel, and\n? documentation of maintenance activities.\n\n4.6  Management of Change\n\nCypress Chemical has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Ammonium Sulfate/UnityGranulation Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training related to the change.\n\n4.7  Pre-startup Review\n\nCypress Chemical performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\n\n? construction and equipment are in accordance with design specifications,\n? adequate safety, operating, maintenance, and emergency procedures are in place,\n? employee training has been completed, and\n? for covered processes, a PHA has been performed for new processes and management of change requirements have been completed for modified processes.\n\nA pre-startup review team uses checklists to verify all aspects of re"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32387,
      "SummaryText": "adiness.  The review involves field verification of the construction elements and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n 4.8  Compliance Audit\n\nCypress Chemical conducts periodic audits of the Ammonium Sulfate/UnityGranulation Process to ensure Cypress Chemical Prevention Program has been effectively implemented and addresses the safety issues of our operations. Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Ammonium Sulfate/UnityGranulation Process.  The team evaluates Cypress Chemical Prevention Program and other aspects of Cypress Chemical Risk Management Program.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  Cypress Chemical maintains records of at least the last two audits conducted.\n\n4.9  Incident Investigation\n\nCypress Chemical promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n4.10  Employee Participation\n\nCypress Chemical developed a written employee participation program for the Ammonium Sulfate/UnityGranulation Process and other aspects of our operations to ensure that the safety concerns are addressed.  Cypress Chemical encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of Cypress Chemical Risk Management Plan (RMP"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32387,
      "SummaryText": ") and participate on PHA and Compliance Audit teams.\n\n4.11  Hot Work Permits\n\nCypress Chemical established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility. Cypress Chemical utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\n\n4.12  Contractors\n\nCypress Chemical established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that Cypress Chemical hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\n\n? perform their work in a safe manner,\n? have the appropriate knowledge and skills,\n? are aware of the hazards in the workplace,\n? understand what to do in the event of an emergency,\n? understand and follow Cypress Chemical?s safety rules, and\n? inform Cypress Chemical personnel of any hazards identified during their work.\n\nProgram efforts are accomplished by providing contractors with:\n\n? a process overview,\n? information about safety and health hazards,\n? emergency response plan requirements, and\n? safe work practices prior to beginning work.\n\n\n5.0  Chemical Specific Prevention Steps\n\nIn addition to the required prevention program elements, Cypress Chemical has installed/implemented safety features specific to the hazardous substances used at our facility.  The following describe some of these safety features:\n\n? ammonia storage tanks are equipped with vents, relief valves, check"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 32387,
      "SummaryText": " valves, scrubbers, manual and automatic shutoffs, and excess flow devices,\n? ammonia spills are mitigated through a deluge system,\n? replacement of relief valves on the NH3 storage tank periodically,\n? replacement of unloading hoses annually and as needed, and\n? installation of a single switch in the main control room to stop the flow of all raw materials to the reactor in the event of an emergency.\n\n\n6.0  Five-Year Accident History\n\nCypress Chemical has completed a five-year accident history study of the Ammonium Sulfate/UnityGranulation Process process.  No incidents have occurred in the Ammonium Sulfate/UnityGranulation Process which resulted in offsite or onsite injuries or property damage.\n\n\n 7.0  Emergency Response Programs\n\nCypress Chemical maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  \nCypress Chemical?s emergency response program includes procedures for:\n\n? informing the local LEPC, fire department, and public about accidental releases that could reasonably result in offsite consequences,\n? providing proper first aid and emergency treatment for accidental human exposure to hazardous substances,\n? evacuation plans and methods for accounting for personnel after an evacuation,\n? controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment,\n? inspecting and maintaining emergency response equipment,\n? post-incident cleanup and decontamination requirements, and\n? reviewing and updating the emergency response plan.\n\nCypress Chemical maintains an emergency response team trained in these emergency response procedures.  All Cypress Chemical personnel are trained in evacuation procedures.  Drills are conducted periodically to test our ev"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 32387,
      "SummaryText": "acuation and emergency response procedures.  Annual drills are conducted with local emergency response agencies to ensure emergency plans are properly coordinated. \n\n\n8.0  Planned Changes to Improve Safety\n\nCypress Chemical continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements, which may improve the safety of our processes.  As a result of these efforts, Cypress Chemical has planned the following changes in our processes to improve safety:\n\n\n1)  Annual emergency drills; and\n2)  Regular and continued use of outside safety consultants to improve safety, with implementation of recommendations where appropriate."
    }
  ]
}