{
  "FacilityID": 32410,
  "FacilityName": "Unilever - Best Foods",
  "FacilityStr1": "3701 Southwestern Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21229",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24510",
  "LEPC": "Baltimore County LEPC",
  "FacilityLatDecDegs": "39.269056",
  "FacilityLongDecDegs": "-076.683167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1378892,
  "ParentCompanyName": "Conopco, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1375088,
  "Company2DUNS": 0,
  "OperatorName": "Unilever Best Foods",
  "OperatorStr1": "3701 Southwestern Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21229",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken Kaiser",
  "RMPTitle": "Plant Manager",
  "FTE": 200,
  "OtherEPAFacilityID": "MDD059169425",
  "EPAFacilityID": "100000094854",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-01-17 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-02-12 00:00:00",
  "DeRegistrationEffectiveDate": "2015-10-29 00:00:00",
  "AnniversaryDate": "2009-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.26907,
  "FRS_Long": -76.68273,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46851,
      "AltID": "Anhydrous ammonia refrige",
      "FacilityID": 32410,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47889,
          "ProcessID": 46851,
          "NAICSCode": "311225",
          "_desc": {
            "NAICS_CODE": "311225",
            "NAICS_DESCRIPTION": "Fats and Oils Refining and Blending"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61723,
          "ProcessID": 46851,
          "ChemicalID": 56,
          "Quantity": 18800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561723,
          "ProcessID": 46851,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32410,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n1.0    SOURCE AND PROCESS DESCRIPTION\n\n1.1    SOURCE\n\nThe Unilever Best Foods (UBF) Baltimore, Maryland margarine \n\nproduction facility is subject to the USEPA's Risk Management Program \n\n(RMP) for Accidental Chemical Release regulation (40 CFR 68) because it \n\nhas a refrigeration system that contains more than the threshold quantity \n\n(10,000 pounds) of anhydrous ammonia (CAS Number 7664-41-7).  \n\nAnhydrous ammonia (NH3), is a gas at ambient conditions.  The \n\nanhydrous ammonia (ammonia) refrigeration system is used to control the \n\nprocessing and storage temperature for margarine and related products.  \n\nIt is a closed system that contains ammonia in various physical states (gas, \n\nliquid, and saturated vapor).  Most of the ammonia equipment is located \n\nindoors.  The condensing towers, main ammonia receiver, make-up air \n\nunits, and some piping runs are located outdoors.\n\nAmmonia is the oldest and most common refrigerant in general industrial \n\nuse throughout the world.  It is a high capacity refrigerant that operates at \n\nreasonable pressure.  Although exposure to ammonia is irritating and \n\npotentially toxic in large doses, personnel exposure to more than a small \n\nleak is rare because ammonia operates within a closed system of vessels, \n\npiping, and equipment.\n\n1.2    PROCESS DESCRIPTION\n\nThe ammonia refrigeration system is a two-stage system consisting of a \n\nhigh pressure side and a low pressure side.  The margarine processing \n\nunits (MPUs) operate on the low side (i.e., low pressure) to quickly chill \n\nproduct on scrape surface heat exchangers.  Ammonia suction from the \n\nMPUs at about 0 psig passes through the low accumulator before entering \n\nthe booster compressors.  Any liquid ammonia in the low side suction is \n\ntrapped in the low side accumulators and returned as high pressure liquid \n\nfor the system.  The booster discharge passes through an intercooler/high \n\nside suction before entering the high side compressors.\n\nThe high side compresso"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32410,
      "SummaryText": "r suction draws from the intercooler/high side \n\nsuction accumulator at about 30 psig (booster discharge).  This \n\naccumulator receives suction from various cooler units.  Excess ammonia \n\nliquid that collects in the high side accumulator is removed and return to \n\nthe system.\n\nThe major discharge from the high side compressors (hot gas) is vented to \n\nfive condensing towers.  A portion of the hot gas is also used for \n\ndefrosting and for operation of the pumper drums.\n\nThe condensed liquid is returned to the high pressure receiver where it is \n\nfed to the low and high side equipment, including the MPUs, cooler units, \n\nand air handlers.\n\nThe ammonia refrigeration system is protected by the existence of specific \n\nsafety systems/hardware, including safety relief valves, engine room \n\nventilation, and system safety interlocks.  Safety relief valves protect the \n\ncompressor discharge, condensers, pumper drums, suction accumulators, \n\nintercooler, and pump-out system from the hazards associated with \n\noverpressure.  Safety interlocks include high pressure and high \n\ntemperature alarms and cutouts for the compressors, as well as high level \n\nfloats and sensors for vessels.  The high pressure cutouts for the \n\ncompressors are set at 200 psig.\n\n2.0    PREVENTION PROGRAM\n\nThe facility has carefully considered the potential for accidental releases of \n\nammonia, such as the occurrence of the worst-case and alternative-release \n\nscenarios described in Section 2.0.  To help minimize the probability and \n\nseverity of an ammonia release, a prevention program that satisfies the \n\nOccupational Safety and Health Administration (OSHA), Process Safety \n\nManagement (PSM) of Highly Hazardous Chemicals (29 CFR 1910.119) \n\nhas been implemented.  The key components of the prevention program \n\nare summarized below:\n\n-    The development, documentation, and operator availability of critical \n\nprocess safety information regarding the hazards of ammonia, the \n\ndesign basis of the system, and the eq"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32410,
      "SummaryText": "uipment.  This information is \n\nused to fully understand and safely operate the ammonia \n\nrefrigeration system.\n\n-    The development of an extensive employee participation program, \n\nwhich includes Unilever Bestfoods employees from all levels of the \n\norganization and from all areas within the plant (i.e., production and \n\nmaintenance).  This program also assumes that employees that utilize \n\nthe ammonia system and are most knowledgeable about it are able to \n\neasily, effectively, and regularly recommend changes or \n\nimprovements which enhance safety.\n\n-    The performance of a formal process hazard analysis (PHA) update \n\nand revision in 2000, using the \"What-if...\" technique.  A team with \n\nexpertise in engineering, operations, maintenance, and safety \n\nevaluated the existing refrigeration system in depth and developed \n\nrecommendations to improve the safety and operability of the system.  \n\nThe PHA addressed:  (1) process hazards; (2) previous incidents; \n\n(3) engineering and administrative controls applicable to the hazards; \n\n(4) the consequence of control failure; (5) facility siting; (6) human \n\nfactors; and (7) a qualitative evaluation of possible safety and health \n\neffects of control system failures.  The PHA resulted in nearly 32 \n\nprocedural and/or hardware recommendations to improve the safety \n\nand operation of the refrigeration system.  These recommendations \n\nhave been completed.  The PHA will be updated and revalidated in \n\n2005 and every five years thereafter.\n\n-    Written operating procedures (OPs) were prepared and are reviewed \n\nannually to provide the basis for proper and safe operation of the \n\nammonia refrigeration system.  The OPs include procedures for \n\nnormal operations, startup, shutdown, emergency operations, and \n\nemergency shutdown.  They also describe safe operating limits for \n\ntemperature and pressure, the consequences of operating outside \n\nthese safe operating limits, and a description of safety systems and \n\nhow they operate.\n\n-    Refrig"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32410,
      "SummaryText": "eration system operators receive refresher training at least \n\nevery three years.  The training content is based upon the process \n\nsafety information and operating procedures.  The training program \n\nensures that the operators understand the nature and causes of \n\nproblems arising from system operations and serves to increase \n\nawareness with respect to the hazards particular to ammonia and the \n\nrefrigeration process.\n\n-    Formal authorization systems (i.e., management of change procedure, \n\npre-startup safety review) are in place to ensure that system changes \n\nor expansions are as safe as the original design and that an \n\nindependent recheck confirms that the changes are consistent with \n\nthe engineering design and in condition to be operated prior to \n\nstartup.\n\n-    Events that might (or did) cause an accidental or unexpected release \n\nof ammonia are subjected to a formal investigation.  The objective of \n\nthe investigation is to correct deficiencies in such a way as to prevent \n\nrecurrence.\n\n-    Contractors that are hired to work on, or adjacent to, the refrigeration \n\nsystem are \"pre-qualified\" based upon their knowledge of ammonia \n\nrefrigeration, understanding of applicable codes and standards, and \n\ntheir demonstrated ability to work safely.  \n\n-    Prior to the performance of any hot work (i.e., spark or flame \n\nproducing operations such as welding, cutting, brazing, grinding), \n\nmanagement must approve the work by executing a written hot work \n\nauthorization permit to verify that precautions to prevent fire have \n\nbeen implemented.\n\n-    Periodic formal walk-throughs occur to find unusual or increasing \n\nvibration, incipient leaks, or other indications of potential upsets or \n\nfailures that could lead to a release.\n\n-    Replacement of all pressure relief valves occurs every five years.\n\n-    Numerous of safety systems, including pressure relief valves, \n\nmonitors, and ammonia vessel level controls and safety interlocks are \n\nused in the refrigeration system.\n\n-    Periodic "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32410,
      "SummaryText": "inspection and calibration is performed on liquid level \n\nsensors, temperature and pressure instruments, switches and \n\nshutdown devices that have safety implications.\n\n-    Periodic inspections are performed for major powered equipment, \n\nincluding compressors, pumps and large fans, bearings, couplings, \n\nshaft seals, mountings, etc., for vibration or incipient mechanical \n\nfailure.\n\n-    Proper design, including adherence to recognized safety codes, such \n\nas the International Institute of Ammonia Refrigeration (IIAR).\n\n-    Adherence to fire codes and preparation for fires, storms, or events \n\nwhich could impact the ammonia system.\n\n-    Planning with the local fire department to ensure a rapid response to \n\npotential incidents with the system or external events, such as floods \n\nor tornadoes.\n\n-    Prevention program compliance audits are performed every three \n\nyears to verify that the elements are being properly implemented.  \n\nAny deficiency found in an audit is corrected.\n\n3.0    ACCIDENT HISTORY\n\nThere have been no accidental releases of ammonia at the facility in the \n\nlast five years (since June 1999) that have resulted in death, injury, or \n\nsignificant property damage on site or off-site death, injury, evacuation, \n\nsheltering in place, property damage, or environmental damage.\n\n4.0    EMERGENCY RESPONSE PROGRAM\n\nThe UBF facility has implemented a detailed written Emergency Response \n\nPlan (ERP).  The ERP is intended to address all emergencies at the facility, \n\nin addition to incidents related to a release of ammonia.\n\nThe ERP includes awareness and response training for employees, \n\ncoordination with the local fire department, coordination with the Local \n\nEmergency Planning Committee (LERC), and evacuation of the facility \n\nand surrounding area.  The plan details what personal protective \n\nequipment and spill response equipment is available; identifies specific \n\nindividuals, their 24-hour telephone numbers, and their responsibilities; \n\nidentifies procedures for emergen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32410,
      "SummaryText": "cy medical care; and refers to other \n\npertinent elements of the management system (i.e., standard operating \n\nprocedures).\n\n5.0    PLANNED CHANGES TO IMPROVE SAFETY\n\nThe UBF facility is in the process of  implementing a new software system \n\nto catalog every vessel and piping system in the ammonia refrigeration \n\nsystem in order to identify, schedule and track the preventive \n\nmaintenance performed on the system.  This new software will improve \n\nthe frequency and comprehensiveness of the preventive maintenance \n\ncapabilities, yielding better maintained, safer equipment and a safer \n\nprocess.\n\n\n\nERM    5    UNILEVER BESTFOODS\n\n        6/11/04\n\ns:\\unilever\\0016219\\xxxx\\reports\\exec_sum.doc\n\n"
    }
  ]
}