{
  "FacilityID": 32414,
  "FacilityName": "Burns Point Gas Plant",
  "FacilityStr1": "187 Marathon Lane",
  "FacilityStr2": null,
  "FacilityCity": "Franklin",
  "FacilityState": "LA",
  "FacilityZipCode": "70538",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22101",
  "LEPC": "Morgan City Fire Department",
  "FacilityLatDecDegs": "29.608889",
  "FacilityLongDecDegs": "-091.535556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 969448505,
  "ParentCompanyName": "Marathon Oil Company",
  "Company2Name": null,
  "CompanyDUNS": 55122568,
  "Company2DUNS": null,
  "OperatorName": "Marathon Oil Company",
  "OperatorStr1": "200 Corporate Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Lafayette",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70508",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089548",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2660-00068-VI",
  "SafetyInspectionDate": "2003-11-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-20 00:00:00",
  "DeRegistrationEffectiveDate": "2018-12-14 00:00:00",
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 29.608123,
  "FRS_Long": -91.535796,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46855,
      "AltID": null,
      "FacilityID": 32414,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61730,
          "ProcessID": 46855,
          "ChemicalID": 155,
          "Quantity": 26000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 45266,
              "ProcessChemicalID": 61730,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 45267,
              "ProcessChemicalID": 61730,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 45268,
              "ProcessChemicalID": 61730,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47893,
          "ProcessID": 46855,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26789,
              "Process_NAICS_ID": 47893,
              "SafetyReviewDate": "2004-04-19 00:00:00",
              "PHA_Date": "2001-02-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-04-16 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-19 00:00:00",
              "TrainingReviewDate": "2004-04-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Base Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-19 00:00:00",
              "EquipmentInspectionDate": "2004-03-16 00:00:00",
              "EquipmentTested": "Safety Systems",
              "ChangeMgmtDate": "2003-05-30 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-19 00:00:00",
              "PreStartupReviewDate": "2003-05-30 00:00:00",
              "ComplianceAuditDate": "2004-04-19 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2003-11-10 00:00:00",
              "InvestigationChangeDate": "2004-01-01 00:00:00",
              "ParticipationPlansReviewDate": "2004-04-19 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-19 00:00:00",
              "ContractorSafetyReviewDate": "2003-11-25 00:00:00",
              "ContractorSafetyEvalDate": "2004-04-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 39081,
                  "PreventionProgram3ID": 26789,
                  "ProcessChemicalID": 61730
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32414,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Morgan City Fire Department",
    "CoordinatingAgencyPhone": "5043804617",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 32414,
      "SummaryText": "nd retained.\n  \n  The plant periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n  \n  \n Operating Procedures\n  \n  The Burns Point Gas Plant maintains written procedures that address various modes of process operations, such as; (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. \n  \n   This information is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\n  \n Training\n  \n  To complement the written procedures for process operations, the Burns Point Gas plant has implemented a comprehensive training program for all employees involved in operating the process. New employees receive basic training in gas plant operations if they are not already familiar with such operations.  New operators are paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures when procedures change"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 32414,
      "SummaryText": "EXECUTIVE SUMMARY\n                                                                                                                                                                             \n  11049 LDEQ Facility ID Number\n  \n  ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n  \n The Burns Point Gas Plant has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our process. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. The Plant has been designated as a Non-Responding facility in accordance with 40 CFR Part 68.90(b). In the event of a major release and/or fire, Marathon will utilize trained contract response personnel for emergency response and recovery operations and/or may rely upon local fire department capabilities as well as mutual aid from other fire departments.\n \n  \n  DESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n  \n  The Burns Point Gas Plant is located in St. Mary Parish, near the city of Burns Point, Louisiana, off highway 317.  It is a single process that removes a mixture of petroleum liquid products (e.g., ethane, propane, butane, and condensate) from natural gas. The Burns Point Gas Plant has several regulated flammables, such as propane, ethane, and butane, but it has no regulated toxic substances. \n \n As described in the registration information of the plant, Burns Point Gas Plant maintains five full time employees with a maximum of three there at any given time due to the work rotation schedule of the employees.  The employees work on a seven days on and seven days off rotation schedule.\n  \n  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n  \n  The following is a summary of the accident prevention program in place at the plant. The process at the gas plant is regulated by the Envi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32414,
      "SummaryText": "ronmental Protection Agency's (EPA's) risk management program (RMP), and is also subject to the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) standard. This summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n  \n  \n   Employee Participation\n  \n  The Burns Point Gas Plant encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team. Employees have access to all information created as part of the gas plant accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in the \"Process Safety Management / Safety and Environmental Management Program Manual\" (PSM/SEMP Manual) that is maintained at the gas plant and addresses each accident prevention program element. \n  \n  Process Safety Information\n  \n  The Burns Point Gas Plant keeps a variety of technical documents that are used to help maintain safe operation of the process. These documents address chemical properties and associated hazards, and equipment design basis/configuration information. In coordination with the Gulf Coast Region's operation staff in Lafayette, Louisiana, Burns Point Gas Plant personnel are assigned responsibility for maintaining up-to-date process safety information. A table summarizing the reference documents is readily available as part of the written employee participation plan summarized in the \"PSM/SEMP Manual\". \n  \n  Chemical-specific information, including exposure hazards and emergency response / exposure treatment considerations, is provided in Material Safety Data Sheets (MSDSs), which are kept at the plant.  For specific process areas, the gas plant has documented safety-rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32414,
      "SummaryText": "ated limits for specific process parameters (e.g., temperature, level, composition). The gas plant ensures that the process is maintained within these limits using process controls and monitoring instruments, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n  \n  The gas plant also maintains numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n  \n  Process Hazard Analysis (PHA)\n  \n  The Burns Point Gas Plant has a comprehensive program to help ensure that hazards associated with the process are identified and controlled. Within this program, the process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n  \n  The Burns Point Gas Plant primarily uses the hazard analysis \"Checklist\" technique to perform these evaluations.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise, and a person from the plant is always included on the team.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. \n  \n  The Hazards Analysis (HA) team findings are forwarded to local management for resolution.  All approved mitigation options in response to HA team findings are tracked until they are completed. The final resolution of each finding is documented a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32414,
      "SummaryText": "to ensure that their skills and knowledge are maintained at an acceptable level.  A complete list of training is summarized in Marathon's GCR Training Matrix. \n  \n  Contractors\n  \n  The Burns Point Gas Plant uses contractors to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors, (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, including the location of MSDS's for the plant,  (3) emergency action plan requirements, and (4) safe work practices prior to beginning work. In addition, the contractor safety programs and performance are reviewed during the selection of a contractor. Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n \n  \n  Pre-startup Safety Reviews (PSSRs)\n  \n  The Burns Point Gas Plant conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review also provides a check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review uses a checklist to verify all aspects of readiness including verification that the accident prevention program requirements are properly implemented.\n  \n  Mechani"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 32414,
      "SummaryText": "cal Integrity\n  \n  The Burns Point Gas Plant has well-established practices and procedures, developed in conjunction with relevant and appropriate industry standards, to maintain pressure vessels, storage tanks, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\n  \n  Another integral part of the mechanical integrity program is quality assurance. The Burns Point Gas Plant incorporates quality assurance measures into equipment purchases and repairs. Equipment specifications comply with Marathon's \"General Specification Manual\" and equipment purchases follow the Gulf Coast Region's \"Requisitioning and Purchasing Procedures\".  This helps ensure that equipment is suitable for its intended use and proper materials and spare parts are used when repairs are made. \n  \n  Safe Work Practices\n  \n  The Burns Point Gas Plant has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of plant personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n  \n  Manageme"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 32414,
      "SummaryText": "nt of Change\n  \n  The Burns Point Gas Plant has a comprehensive system to manage changes to the process. This system requires that changes to items such as process equipment, procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\n  \n  Incident Investigation\n  \n  The Burns Point Gas Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to gas plant management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future Has and HA re-validations. \n  \n  Compliance Audits\n  \n  To help ensure that the accident prevention program is functioning properly, the Burns Point Gas Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are cond"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 32414,
      "SummaryText": "ucted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to gas plant management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained. \n  \n  CHEMICAL-SPECIFIC PREVENTION STEPS\n  \n  The process at the Burns Point Gas Plant has potential hazards that must be managed to ensure continued safe operation. The following is a description of safety features applicable to prevention of accidental releases of regulated substances in the facility.  These features are established and maintained with recognized and generally accepted engineering practices. \n  \n  Universal Prevention Activities\n  \n  The accident prevention program summarized previously and found in \"Marathon Oil Company Gulf Coast Region's PSM/SEMP Manual\" is applied at Burns Point Gas Plant. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by such unlikely events as equipment failures and human errors.\n  \n  Specialized Safety Features\n  \n  The Burns Point Gas plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the process:\n  \n  Release Detection\n  \n · Hydrocarbon detectors with alarms\n  \n  Release Containment/Control\n  \n · Process relief valves that discharge to a flare to capture and incinerate episodic releases\n  \n · Valves to permit isolation of the process (manual or automated)\n  \n · Automated shutdown systems for specific process parameters (e.g., high temperature)\n  \n · Curbing or diking to contain liquid release\n \n · Redundant equipment and instrumentation \n \n · Atmospheric relief devices.\n  \n  Release Mitigation\n  \n · Fire s"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 32414,
      "SummaryText": "uppression and extinguishing systems\n  \n · Personal protective equipment (e.g., chemical protective clothing)\n  \n · Blast-resistant buildings to help protect control systems and personnel\n \n  \n  FIVE-YEAR ACCIDENT HISTORY\n  \n  The Burns Point Gas Plant has had an excellent record of accident prevention over the past 5 years.  No significant incidents involving regulated substances have occurred over the past five years that resulted in on- or off-site effects. \n  \n  \n  \n  EMERGENCY RESPONSE PROGRAM INFORMATION\n  \n    Since Burns Point Gas Plant has been designated as a Non-Responding facility in accordance with 40 CFR Part 68.90(b), it is not required to maintain a formal Emergency Response Plan. It does maintain a written Emergency Action Plan, (as required by OSHA under 29CFR 1910.38 and 1910.119), which is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The plan addresses, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs as well as a training personnel to properly react to an emergency at the Burns Point Gas Plant. The Emergency Action Plan is updated when necessary based on modifications made to gas plant facilities.\n \n The overall Emergency Action Plan for the Burns Point Gas Plant is coordinated with the Morgan City Fire Department, and the Local Emergency Planning Committee (LEPC). The Burns Point Gas Plant and Marathon's Lafayette regional office have around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. The Burns Point Gas Plant conduct"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 32414,
      "SummaryText": "s periodic emergency and annual refresher training exercises to ensure that all employees at Burns Point are familiar with their roles as outlined in the Emergency Action Plan. \n  \n  \n  PLANNED CHANGES TO IMPROVE SAFETY\n  \n  The Burns Point Gas Plant resolves all findings from hazard analysis studies (HAs), some of which result in modifications to the process.  HAs are updated and revalidated on intervals not to exceed five years."
    }
  ]
}