{
  "FacilityID": 3243,
  "FacilityName": "Camden Water L.L.C. - Morris-Delair WaterTreatment",
  "FacilityStr1": "9800 Zimmerman Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Pennsauken",
  "FacilityState": "NJ",
  "FacilityZipCode": "08110",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34007",
  "LEPC": "Pennsauken Township OEM",
  "FacilityLatDecDegs": "39.988056",
  "FacilityLongDecDegs": "-75.050278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "us-water.com",
  "FacilityEmailAddress": "gciaccio@us-water.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "U.S. Water L.L.C",
  "Company2Name": null,
  "CompanyDUNS": 969271121,
  "Company2DUNS": 0,
  "OperatorName": "Camden Water L.L.C",
  "OperatorStr1": "1257 South Second Street",
  "OperatorStr2": null,
  "OperatorCity": "Camden",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08104",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Stephens",
  "RMPTitle": "Water Treatment Superintendent",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040528",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-11-01 00:00:00",
  "DeRegistrationEffectiveDate": "2006-10-25 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.9866,
  "FRS_Long": -75.04681,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3641,
      "AltID": "Chlorine",
      "FacilityID": 3243,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3714,
          "ProcessID": 3641,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 3894,
          "ProcessID": 3641,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 503894,
          "ProcessID": 3641,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3243,
      "SummaryText": "Executive Summary\n\nFor nearly five years, the City of Camden implemented a successful accidental release prevention program for the Morris-Delair Water Treatment Plant.  As operator, Camden Water LLC has improved upon this successful program to achieve an even greater level of process safety and risk management at the water treatment plant.\n\nAll process safety information is clearly documented in a central location where operators and contractors working on or near the covered process are encouraged to access and review information found therein.  \n\nProcess Hazard analyses are conducted on a five-year schedule by a process hazard analysis team.  The team is composed of a team leader/process engineer, maintenance specialist, plant superintendent and a process operator.  Vulnerable processes or procedures are identified and recommendations to eliminate the vulnerability to the extent possible are identified.  \n\nThe water treatment superintendent using the process safety information in cooperation with the process operator writes the operating procedures used when working on or around the chlorine processes.  The water treatment superintendent and a process operator verify all existing operating procedures for correctness once a year.  Operating procedures are available at the plant.\n\nTraining is formulated and tracked by the plant superintendent according to a training schedule developed to respond to the development needs of the employees.  The plant superintendent keeps the training materials on file.  Written tests, oral exams and demonstration assure understanding of the training.  The Group Health & Safety Officer also tracks training for the site.\n\nThe Mechanical Integrity program assures the continued integrity of process equipment.  The program consists of equipment lists, preventative maintenance procedures and a time dependent maintenance schedule.  Equipment is replaced prior to the expected useful life of the equipment or if excessive wear that indicates d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3243,
      "SummaryText": "egradation of its effectiveness is evident. The Responsible Manager assures the Mechanical Integrity program.\n\nThe Management of Change program ensures that system changes are properly reviewed against original design specifications and can be accomplished safely.  It ensures any changes made to the processes will not increase the risk of an accident occurring on the process.  It is composed of a written program with elements delegated to appropriate members of the management team.  The Responsible Manager quality assures the Management of Change and keeps all completed Management of Change forms on file. \n\nThere is a written pre-startup safety review program that ensures that prior to startup of any changes made to the processes, which require a change in the process safety information, are reviewed to ensure that the process is ready to operate safely.  The pre-startup safety review program is quality assured by the Responsible Manager.  Progress is documented in the Management of Change files.\n\nCompliance audits assure that the program remains compliant in all respects.  The audits are led and conducted once a year by the Responsible Manager in cooperation with the delegated personnel implementing the program elements.  Deficiencies are noted and scheduled for system improvements by the delegated program implementers.  The Water Manager with the Project Engineer monitor scheduled completion dates.\n\nThe Incident investigation program reduces the risk of incidents that come close to causing an accident.  The program follows corporate policy for fact determination, root cause system analysis, and recommendation implementation.  The Water Manager, together with the Group Health & Safety Officer, monitors system update schedules developed through the compliance audit and incident investigation.\n\nEmployee participation is incorporated in each element program description.\n\nThe Contractor Program follows Camden Water LLC contractor policy.  The Purchasing Manager impleme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3243,
      "SummaryText": "nts the program.\n\nAt most, thirty thousand pounds of chlorine are inventoried in potable water treatment at the Morris-Delair Water Treatment Plant.\n\nThe Worst Case toxic release scenario of chlorine involves the unlikely event of a single cylinder releasing its entire contents within 10 minutes.  This scenario would result in a vapor cloud migrating off site.\n\nThe Alternate Case toxic release scenario of chlorine involves the release of a vapor cloud within the feed room from the unlikely event of a one inch puncture in one of the ton cylinders.  This scenario would result in a vapor cloud that does not migrate off site.  The chlorine feed room is used as passive mitigation.\n\nRelease prevention and chemical specific prevention used are manual shutoff, alarms and procedures, emergency power, rupture disks, and excess flow devices.  Firewalls are used for mitigation systems.  The process areas are monitored by leak detection systems indicated by an audible alarm.  The maintenance program conducts equipment reliability reviews to assure operation of the prevention devices. \n\nThere have been no accidents resulting in off-site releases.  Minor releases have occurred on two occasions, which have been rapidly controlled on-site.\n\nThe company's emergency response program for chlorine release was updated in June of 1999.  The plan defines the response organization, coordination with local emergency response committee, equipment, response procedures, training, notification procedures, and drills.  The plan is updated periodically according to the need identified by the periodic drills."
    }
  ]
}