{
  "FacilityID": 32442,
  "FacilityName": "OMNOVA Solutions  Fitchburg Plant",
  "FacilityStr1": "119 Authority Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fitchburg",
  "FacilityState": "MA",
  "FacilityZipCode": "01420",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25027",
  "LEPC": "Fitchburg LEPC",
  "FacilityLatDecDegs": "42.552092",
  "FacilityLongDecDegs": "-071.849629",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "OMNOVA Solutions Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1316330,
  "Company2DUNS": null,
  "OperatorName": "OMNOVA Solutions Inc.",
  "OperatorStr1": "119 Authority Drive",
  "OperatorStr2": null,
  "OperatorCity": "Fitchburg",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01420",
  "OperatorZipCodeExt": null,
  "FTE": 37,
  "OtherEPAFacilityID": "01420THDRB119AU",
  "EPAFacilityID": "100000075713",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 42.552185,
  "FRS_Long": -71.84844,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46885,
      "AltID": "Acrylate Polymerization",
      "FacilityID": 32442,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 61761,
          "ProcessID": 46885,
          "ChemicalID": 25,
          "Quantity": 2100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 47924,
          "ProcessID": 46885,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 26801,
              "Process_NAICS_ID": 47924,
              "SafetyReviewDate": "2004-03-18 00:00:00",
              "PHA_Date": "2004-05-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Thermal Oxidizer",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "shortstop (kill solution) system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable LEL & VOC Meters",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-24 00:00:00",
              "TrainingReviewDate": "2003-08-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-06-10 00:00:00",
              "EquipmentInspectionDate": "2004-06-05 00:00:00",
              "EquipmentTested": "pre-emulsion & polymerization vessels",
              "ChangeMgmtDate": "2004-05-11 00:00:00",
              "ChangeMgmtReviewDate": "2003-03-01 00:00:00",
              "PreStartupReviewDate": "2002-05-14 00:00:00",
              "ComplianceAuditDate": "2003-10-22 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-01-09 00:00:00",
              "HotWorkPermitReviewDate": "2002-12-01 00:00:00",
              "ContractorSafetyReviewDate": "2002-12-05 00:00:00",
              "ContractorSafetyEvalDate": "2003-01-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 39094,
                  "PreventionProgram3ID": 26801,
                  "ProcessChemicalID": 61761
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32442,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-10-18 00:00:00",
    "ERTrainingDate": "2004-03-05 00:00:00",
    "CoordinatingAgencyName": "Fitchburg LEPC",
    "CoordinatingAgencyPhone": "9783459663",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32442,
      "SummaryText": "OMNOVA Solutions Performance Chemicals Division\nFitchburg, MA Facility\nRisk Management Plan\n\nEXECUTIVE SUMMARY:\n\nThis plan was prepared as part of the Risk Management Program (RMP) of the Fitchburg, MA facility of the Performance Chemicals Division of OMNOVA Solutions Inc. . The RMP conforms to the legal requirements established by the U.S. Environmental Protection Agency (EPA) . The purpose of the RMP is to:\n\n· Describe existing safety systems at the Fitchburg Plant designed to protect employees, the community, the environment, and the production facility.\n· Share information with the Fitchburg community about plant operations, including steps taken to minimize risk from the handling of regulated  substances.\n· Comply with the applicable EPA regulations; 40 CFR Part 68 Section 112(r).\n\nThe following summary presents an overview of the Fitchburg facility accident prevention and emergency response programs.\n\nOMNOVA SOLUTIONS COMMITMENT TO SAFETY:\n\n\nOMNOVA Solutions recognizes that safe operations are the product of many factors. High on the list of  safeguards in use at Fitchburg are: excellent process engineering design and control, rigorous process change reviews and scale up of new products, thorough equipment maintenance and check-out, developing  highly qualified employees, use of qualified, safety-conscious contractors, and the use of accurate and up to date manufacturing procedures.\n\nStrict operational controls are in place to ensure safety is considered in each step of the supply chain, from raw material selection and testing, chemical handling and process design, manufacturing, and finally packaging and delivery to customers.\n\nTo assure proper attention to safety, the facility maintains a full-time Safety, Health and Environmental Coordinator to oversee safety programs and assure conformance to internal and governmental standards.\n\nDESCRIPTION OF THE REGULATED PROCESS:\n\nThe Fitchburg facility produces water-based acrylic emulsions for the textile, graphic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32442,
      "SummaryText": "arts, floor care and paper industries. The finished products are generally non-hazardous white liquids. OMNOVA Solutions's Fitchburg, MA facility processes one material subject to EPA risk management planning: acrylonitrile. This material is stored in a state-of-the-art underground tank system  commissioned in late December 1998. Acylonitrile is a hydrocarbon raw material used to make acrylate polymers. This manufacturing process, called emulsion polymerization combines and reacts the acrylonitrile with other materials in water to form a different non-toxic chemical structure which is sold as a product to customers in the textile, graphic arts, floor care and paper industries.\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nEPA regulations require facilities to provide information about all accidents involving specified hazardous substances over the past five years. Accidents resulting in (1) death or serious injury as defined by the RMP regulation, or, (2) significant property damage on-site, or, (3) known deaths, injuries , property or environmental damage off-site. \n\nNo accidents have occurred over the last 5 years at the Fitchburg facility as described above.\n\n\nHAZARD ASSESSMENTS:\n\nIn concert with the OSHA Process Safety Management Standard 29CFR 1910.119, the Fitchburg facility has conducted hazard assessments on the acrylic emulsion manufacturing process to evaluate the likelihood and consequences of process upsets and to recommend and install appropriate safeguards. EPA RMP regulations now require additional highly-structured assessments of offsite consequences in the form of a Worst-Case Scenario, and an Alternative Release Scenario. A scenario is defined as an outline of a hypothesized or projected chain of events, which can involve various emission estimating techniques, depending upon the specific circumstances of the release.  For example, the EPA published lookup tables are used to project the extent of a release of a hazardous substance, but do not account for"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32442,
      "SummaryText": "local conditions like topography.  An alternative to using the lookup tables provided by the RMP regulation is to calculate the consequences of a release of a regulated substance using other (publicly-available) recognized risk analysis tools or models.  Many models account for subtle but important local conditions that define the profile of a chemical release. Accordingly, OMNOVA Solutions uses EPA-recognized models to project offsite consequences for both the worst-case and alternative release scenarios. \n\nThe worst case scenario is intended to predict the greatest possible severity of a chemical release. When properly used, the EPA-required worst-case hypothesis can be a very useful emergency planing tool, by providing an analysis of offsite conditions and community safeguards. The worst case scenario does not describe overall risk from a process or facility because it lacks the dimension of likelihood. For example the worst case scenario does not recognize the effectiveness of active safety devices that have been engineered into a process such as sprinkler systems or quench systems which can stop or greatly reduce the severity of a chemical release. On the other hand, the unlikely (complete) loss of a vessels structural integrity and instantaneous release of the entire contents is contemplated in the worst case model. And as a final note, it should also be recognized that for a toxic worst case, the impacted area is extrapolated to the area of a circle, despite the use of a 1.5 meter-per-second wind speed, which will transport vapors in one general sector from the point of release.\n\nOMNOVA Solutions has also prepared an Alternative Release Scenario which is intended to represent a more likely description a chemical release scenario from the Fitchburg facility because this exercise attempts to account for both the likelihood and severity of a chemical release, which defines risk.  Still, while more likely, OMNOVA Solutions believes the alternative scenar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32442,
      "SummaryText": "io is improbable due to engineering and administrative controls at the Fitchburg Plant.\n\n\n\nWORST CASE & ALTERNATE RELEASE SCENARIO:\n\nEPA RMP instructions require facilities handling regulated substances to construct one worst-case scenario describing the release of all relevant toxic substances on site. An additional  worst case scenario must be prepared if different public receptors (off site residences, businesses or community buildings within a possible impact radius) could be affected by the release of another regulated material. Since the Fitchburg facility only handles one RMP substance, additional scenarios are not applicable.\n\nDescriptions of the Worst Case and Alternate Release Scenarios have been removed from the Executive Summary section of this RMP submittal consistent with the requirements of 40 CFR 68.155, as amended April 9, 2004, 69 FR 18819.\n\n\n\nLESSONS LEARNED:      \n\n\nOMNOVA Solutions's Core Values have been clearly defined and communicated throughout the organization, including the Fitchburg MA facility. Among the four Core Values is Demonstrating Respect for the Environment and our Neighbors. OMNOVA Solutions and its Fitchburg facility recognize that risk management is a continuous learning process, and we can learn from both probable and improbable accidental release scenarios.  The RMP scenarios developed for the Fitchburg plant show how significantly the process safety elements contribute to continuously managing risk: having relevant process information, review of process and equipment changes before they are made, a checkout of equipment and preparedness before starting up modified or new equipment, strong employee participation in process safety, formal process hazard analyses and recommendations, hot work permitting and contractor control, and effective incident investigation.  Additionally, the RMP process emphasizes the value of intrinsic safety design, that is safeguards that do not rely upon physical intervention to work, or sim"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32442,
      "SummaryText": "ple is better when it comes to risk reduction.\n\nOMNOVA Solutions has acquired a sophisticated model (TRACE version 8b) to best predict the dispersion of a vapor from the release of any volatile liquid. The Fitchburg Plant's safety program will continue to benefit from the ability to use this predictive tool to verify ongoing safe process engineering design for both new and modified acrylate manufacturing."
    }
  ]
}