{
  "FacilityID": 32440,
  "FacilityName": "US Foodservice - Los Angeles Division",
  "FacilityStr1": "15155 Northam Street",
  "FacilityStr2": null,
  "FacilityCity": "La Mirada",
  "FacilityState": "CA",
  "FacilityZipCode": "90638",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.886473",
  "FacilityLongDecDegs": "-118.013298",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.usfoodservice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 926581737,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "US Foodservice",
  "OperatorStr1": "15155 Northam Street",
  "OperatorStr2": null,
  "OperatorCity": "La Mirada",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90638",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry Gerlach",
  "RMPTitle": "Facility Manager",
  "FTE": 618,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049413",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-12-21 00:00:00",
  "SafetyInspectionBy": "ASI",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.88467,
  "FRS_Long": -118.00926,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 46883,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 32440,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 47922,
          "ProcessID": 46883,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 61759,
          "ProcessID": 46883,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 561759,
          "ProcessID": 46883,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32440,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nUS Foodservice is one of the largest broadline foodservice distributors in the United States. The company distributes food and related products to over 250,000 customers, including restaurants, healthcare facilities, lodging establishments, cafeterias, schools and colleges. US Foodservice markets and distributes more than 43,000 national, private label, and signature brand items and employs more than 29,500 foodservice professionals.  As stated on their website, ?US Foodservice is one of the leading broad line foodservice distributors in the United States, with yearly revenues exceeding $19 billion. Our corporate office is strategically positioned between Washington, D.C. and Baltimore, Maryland, in one of the fastest growing business corridors in the country - Columbia, Maryland. With over 100 distribution centers nationwide, US Foodservice is conveniently located for quick and easy, local access for all existing and potential customers.  US Foodservice believes that yesterday, today, and tomorrow, our success depends upon our customers' success. That's why US Foodservice works hard to nurture the very best customer relations - our goal is to be the industry leader.?\n\nUS Foodservice?s senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  The facility maintains a Safety Committee whose members are the designated incident commanders for the facility.  US Foodservice has an Emergency Action Plan (Plan) in effect, which is detailed in the Emergency Planning and Response section of the PSM document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32440,
      "SummaryText": "the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nConstruction of the ammonia refrigeration system at US Foodservice was completed in 1995. The facility is located at 15155 Northam Street, La Mirada, California 90638. The system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes. \n\nThe US Foodservice facility receives and distributes food and food products to local vendors. The ammonia refrigeration system uses 20,000 pounds of ammonia for dock operations, warehouse cold storage, and freezer storage. The majority of the system is located in the ammonia engine room including vessels and compressors. The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas. \n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe US Foodservice ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, the US Foodservice facility operates in accordance with OSHA's Process Safety Management regulation. \n\nThe US Foodservice facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system. These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in selected cold storage areas, and automatic shut down systems. In addition, the majority of the ammonia is maintained inside the engine room and just outside of the machine room (condensers). All pressure vessels are equipped wi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32440,
      "SummaryText": "th pressure relief valves that are commonly piped to the water diffusion tank. \n\nA 400 kW backup generator is maintained on site to power certain systems in the facility during a loss of electrical services. These systems include: the ammonia detection and alarm systems, ammonia scrubber and diffuser equipment, building management system computer, telephone/public address system, emergency lighting, and fire monitoring and alarm systems. \n\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into the US Foodservice facility accident history during the Process Hazard Analysis Revalidation (May 11, 2004), revealed that there have been no reportable ammonia related accidents, incidents or releases at the facility over the past five years (May 1999 - May 2004.)\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe US Foodservice has an emergency action plan in effect at the facility. The Emergency Evacuation and Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document maintained at the facility. This Plan was designed to meet the following objectives: \n\n1.)    To save lives. \n2.)    To minimize and avoid injuries. \n3.)    To protect the environment.\n4.)    To minimize property damage. \n\nUS Foodservice maintains a safety committee whose members are the designated emergency coordinators for the facility. The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility. \n\nUS Foodservice has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm. In the case of an ammonia-related "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32440,
      "SummaryText": "emergency, it is the policy of US Foodservice to evacuate and to allow the fire department and the refrigeration contractors to respond to the emergency. All employees at US Foodservice will be given emergency response training during New Employee Orientation and Department Safety Meetings. At least annual emergency evacuation drills are held at the facility. \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA Process Hazard Analysis (PHA) was completed prior to startup of the ammonia refrigeration system in 1995 based on the requirements of California's RMPP regulation. As part of the RMP, US Foodservice conducted a revalidation of the original PHA on January 13, 1999. A majority of the original recommendations were determined to be complete at this time. The additional recommendations generated during the most recent Revalidation are scheduled to be complete in June 2005.  A PHA Addendum was performed on February 19, 2003.\n\nIn addition, a Process Hazard Analysis Revalidation was conducted in May 2004 to further improve the safety of the facility.  The 2004 PHA consisted of a:\n\n?    Review in detail the recommended action items from the previous PHA Studies.  Determine status, responsible parties, and estimated completion dates.\n?    Review the recommendations from the 2003 Three Year Compliance Audit.  Determine status, responsible parties, and estimated completion dates.\n?    A site walk to review the piping diagrams used during the previous PHA Study.\n?    A discussion of any releases of ammonia since the previous PHA Study (review Incident Investigation forms).\n?    Review any Management of Change forms prepared since the previous PHA Study.\n?    Review industry checklists, as necessary to complement the previous PHA studies and Revalidations.\n\nThe mitigation measures include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The US Foodservice Safety Committee is planning to complete several items, including the recommen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 32440,
      "SummaryText": "dations as a continual effort to provide a safe work environment for their employees."
    }
  ]
}