{
  "FacilityID": 32623,
  "FacilityName": "Dolco Packaging - Wenatchee",
  "FacilityStr1": "1121 S. Columbia Street",
  "FacilityStr2": null,
  "FacilityCity": "Wenatchee",
  "FacilityState": "WA",
  "FacilityZipCode": "98801",
  "Facility4DigitZipExt": "6197",
  "FacilityCountyFIPS": "53007",
  "LEPC": "Chelan/Douglas County LEPC",
  "FacilityLatDecDegs": "47.409611",
  "FacilityLongDecDegs": "-120.299167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 29604832,
  "ParentCompanyName": "Tekni-Plex, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 42023333,
  "Company2DUNS": 0,
  "OperatorName": "Dolco Packaging - Wenatchee",
  "OperatorStr1": "1121 S. Columbia Street",
  "OperatorStr2": null,
  "OperatorCity": "Wenatchee",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98801",
  "OperatorZipCodeExt": "6197",
  "FTE": 140,
  "OtherEPAFacilityID": "WAD027576040",
  "EPAFacilityID": "100000071058",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 47.41065,
  "FRS_Long": -120.29874,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47142,
      "AltID": "Blowing Agent System",
      "FacilityID": 32623,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 62074,
          "ProcessID": 47142,
          "ChemicalID": 155,
          "Quantity": 77000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 45515,
              "ProcessChemicalID": 62074,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 45516,
              "ProcessChemicalID": 62074,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48190,
          "ProcessID": 47142,
          "NAICSCode": "32614",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 32623,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-08-01 00:00:00",
    "ERTrainingDate": "2004-04-29 00:00:00",
    "CoordinatingAgencyName": "Wenatchee City Fire Department",
    "CoordinatingAgencyPhone": "5096643950",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32623,
      "SummaryText": "Background\n\nThe Dolco Packaging facility in Wenatchee, Washington produces extruded polystyrene foam products using butane as the expanding agent.  The facility consists of manufacturing areas, storage warehouses, and offices, with a butane storage tank located outside of the buildings.  The facility operates as much as 24-hours per day, 365 days per year and employs approximately 140 people.  Our foam products are used in products such as egg cartons and food packaging trays.\n\nProcess Description\n\nButane is the only material at the facility subject to the United States Environmental Protection Agency's (USEPA's) Risk Management Plan (RMP) program.  Butane is received by Dolco as a liquid in tank trucks and is unloaded into a storage tank located outside that was installed in 1995.  The maximum butane storage quantity is 88% of the tank design capacity to allow room for emergency expansion under emergency situations.  Butane is pumped through a controlled system into the foam production building.  The butane is then used to expand melted plastic within the extruders to create the desired foam product.  A number of valves, controllers, and instruments control and monitor the pressure and flow of the butane throughout the process.  \n\nThe primary hazards associated with the butane system are releases that could occur outside or inside the extrusion building that could lead to a fire or explosion.  The possible causes of releases include pump failure, failure of piping or tubing, failure of valves or instruments, storage tank leakage, or failure of equipment used for tank filling.  \n\nFive Year Accident History\n\nThe facility has not experienced any significant accidents associated with handling butane in the last five years.  A significant accident would be one causing some type of off-site impact or on-site injuries or significant property damage.\n\nRelease Prevention Program\n\nDolco's Plant Manager has the overall responsibility for ensuring that the facility operates in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32623,
      "SummaryText": " a safe and reliable manner.  This responsibility includes overseeing the implementation of the RMP.  To ensure that the risk management program is appropriately developed and implemented, the Plant Manager has assigned the role of RMP Coordinator to a staff member with the necessary background, training, and experience.  The RMP Coordinator, acting with the authority delegated directly from the Plant Manager, has the responsibility for the development and implementation of the RMP.\n\nDolco Packaging has invested significant manpower and resources to prepare and implement this RMP and the related Process Safety Management (PSM) program to address the potential hazards associated with butane at the Wenatchee facility.  The facility's RMP/PSM program contains a Prevention Program that focuses on prevention of releases.  The Prevention Program includes the use of appropriate equipment design standards, safety valves and instruments, written operating procedures, employee and contractor training, regular equipment inspection and maintenance, and periodic program auditing to reduce the likelihood of butane releases occurring.  The facility has compiled process safety information and has conducted a process hazard analysis (PHA) review of the butane system.  The butane storage tank was designed and constructed in accordance with the American Society of Mechanical Engineers (ASME) code for pressure vessels.  The butane system was designed and constructed in accordance with the applicable portions of the National Fire Prevention Association (NFPA) 58 LP-Gas Code and is equipped with a variety of modern safety equipment.  \n\nThe facility has implemented administrative controls and procedures to aid in the prevention of releases from the operation of the butane system.  Personnel operating and maintaining the butane system undergo regular training.  The training program includes initial training as well as periodic refresher training and training updates when major process or e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32623,
      "SummaryText": "quipment changes are made.  Written operating procedures are used to standardize the procedures for startup, normal operation, normal shutdown, and emergency shutdown.  Tank loading is conducted by contract truck drivers certified to safely handle LP-gases and monitored by trained Dolco Packaging personnel.  The facility conducts regular planned inspection and preventative maintenance of the butane system equipment. \n\nRelease Detection and Emergency Response\n\nThe plant has 30 gas detectors located throughout the facility.  The detectors are designed to warn an operator of a potential butane release.  These include gas detectors on relief valve vent lines to indicate when a safety relief device has activated.  Automatic sprinkler systems are located throughout the building areas where butane is present.  The facility has organized an Incipient Fire Brigade which manages emergency response in the event of a leak, fire, or explosion.  The Fire Brigade is responsible for evacuation of employees, notification of local emergency services, safe and complete shutdown of equipment if needed, rendering first aid to injured employees, and locating, containing, and extinguishing fires (within the guidelines of NFPA 600 1-4.3.1 defining incipient fires).  The facility has coordinated with the City of Wenatchee Fire Department with regard to emergency response on the butane system.  For additional information on what actions to take in the event of an emergency, contact the City of Wenatchee Fire Department.\n\nAdditional Steps to Improve Safety\n\nDolco has created a culture for continuous improvement of its safety systems and programs.  We have trained our employees to safely perform their assigned tasks.  We also encourage our employees to suggest changes or improvements that will help to increase the safety of the facility.  We perform inspections and preventative maintenance to minimize the potential for unanticipated failure of our equipment.  Our systems and programs are audit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32623,
      "SummaryText": "ed, typically by an outside company, at least every three years to evaluate their effectiveness.  \n\nWe have recently reviewed and modified elements of our Prevention Program.  The entire RMP/PSM program is updated and audited on a regular basis with a focus on continuous improvement of all elements of the program.  As a result of the ongoing review and improvement of butane safety systems at the facility, capital improvements were made to the high-pressure pump room, including the installation of new or improved fire walls, fire doors, explosion-proof lighting, and ventilation. This was completed in August 2001."
    }
  ]
}