{
  "FacilityID": 32637,
  "FacilityName": "Rose Creek Water Pollution Control Plant",
  "FacilityStr1": "1957 Authority Drive",
  "FacilityStr2": null,
  "FacilityCity": "Woodstock",
  "FacilityState": "GA",
  "FacilityZipCode": "30189",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13057",
  "LEPC": null,
  "FacilityLatDecDegs": "34.134444",
  "FacilityLongDecDegs": "-084.572778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.ccwsa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 825402886,
  "ParentCompanyName": "Cherokee County Water & Sewage Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cherokee Water & Sewerage Authority",
  "OperatorStr1": "1957 Authority Drive",
  "OperatorStr2": null,
  "OperatorCity": "Woodstock",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30189",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Wilson",
  "RMPTitle": "Manager of Plant Operations",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000105174",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-08-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-21 00:00:00",
  "DeRegistrationEffectiveDate": "2009-05-14 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 34.13692,
  "FRS_Long": -84.56922,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47157,
      "AltID": null,
      "FacilityID": 32637,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48205,
          "ProcessID": 47157,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62089,
          "ProcessID": 47157,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562089,
          "ProcessID": 47157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 32637,
      "SummaryText": "The Cherokee County Water and Sewerage Authority?s (CCWSA) Rose Creek Water Pollution Control Plant, located in the southern Cherokee County, can provide tertiary treatment for average daily flow of 5.0 million gallons per day (mgd).  Treated effluent is discharged to Lake Allatoona through sub-aqueous diffuser located in the Etowah River channel.  The Rose Creek WPCP is tertiary treatment facility designed to remove organic waste, suspended solids, and nutrients.  Biological treatment is achieved with sequencing batch reactors (SBRs) which is a fill and drain process rather than the more conventional continuous flow activated sludge process.  Downstream of the SBRs, the treatment processes consists of tertiary clarifiers for removal of chemically precipitated phosphorus, sand filters for removal of fine suspended solids, disinfection with chlorine, and dechlorination with sodium bisulfite to eliminate any chlorine residual prior to being pumped to Lake Allatoona.\n\nChemical Safety\nThe CCWSA complies with the Hazardous Communications standard set forth by the Occupational Safety and Health Administration (OSHA).  Compliance is accomplished by compiling a hazardous chemical list, using Material Safety Data Sheets (MSDS), ensuring that containers are labeled and providing employee training.  The purpose of the program is to alert and educate employees about chemicals in the workplace by giving them greater access to information on the physical and health hazards of chemicals, safe handling and storage precautions and emergency first aid procedures.  It applies to all employees who may be exposed to hazardous substances during the scope of their employment.  Copies of the written program are available for the employees.\nEach department head maintains a list of all hazardous chemicals used by their departments.  These lists are updated as necessary.  Each employee in charge has available a list of chemicals applicable to their area of employment.\nMaterial Safety Data She"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 32637,
      "SummaryText": "ets (MSDS) provide specific information on chemicals used.  Each department head maintains a binder containing all MSDS for every chemical substance purchased and used by the city is available to all employees.  Aside from the main MSDS binder, department heads make their MSDS binder available and accessible to their respective employees/\n\nWorst Case/Alternative Cause Releases\nThe EPA Risk Management Program Guidance Document for Wastewater Treatment Plants was used for the off site analyses and LandView? V was used to estimate population and public receptors.  It should be noted that LandView? V uses 2000 census data and the current population will most likely be greater than indicated.\nThe worst case release scenario is the failure of a one-ton cylinder outside the chlorine building, yielding a release of 2,000 lbs of chlorine to the atmosphere over a period of 10 minutes.  Using the EPA tables, the distance to the endpoint for urban condition is 1.3 miles.  The alternative or more likely release scenario is a leak in one of the ton vessels located within the chlorine building.  For this analysis it has been assumed chlorine will released through a ?-in diameter hole.  Exhibit 4-13 in the EPA Guidance Document indicates a release relate of approximately 150 lbs/min.  Since this scenario assumed the release occurred in a building, the release rate can be reduced to 55 percent of the release rate (EPA Guidance Document, Section 4.3).  As a result, the release rate is reduced to approximately 83 lbs/min and a distance to the end point of 0.2 miles.\n\nAccident Release Prevention Program\nActive environmental, health and safety programs with regards to the safe handling of chlorine and chlorination equipment are in place at the plant.  The following safety policies and procedures are adhered to by CCWSA staff.\n\nHandling:\n-  All operators are trained in safe handling of chlorine.\n-  A Self-Contained Breathing Apparatus (SCBA) must be used, when connecting or disconnection"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 32637,
      "SummaryText": " chlorine cylinders.  Self-contained breathing equipments are available where gas or liquid chlorine is used.  These units are approved by the National Institute of Occupational Safety and Health (NIOSH)\n-  The two-man rule is used for all connecting and disconnecting of chlorine cylinders (two men present, one in SCBA the other on standby).\n-  Adequate ventilation shall be provided at all times.\n-  It is optional to use the chlorine detectors (detects chlorine concentrations so small that they are impossible to smell.  A chlorine detector can give early warning, so a small leak can be stopped before it becomes larger).\n\nOne Ton Chlorine Cylinder Storage:\n- Cool, clean, and dry place with adequate ventilation.\n-  Away from other chemicals and equipment.\n- Always use lifting clamps or cradles - do not use ropes, cables or chain when moving.\n- Keep the protective cap on the cylinder when it is not in use.\n-  Mark empty containers and store them aside from full containers.\n\nFirst Aid:\n-  First aid for eyes exposed to chlorine is immediate irrigation with flowing water for at least 15 minutes, and contact a physician immediately.\n-  If skin is exposed to liquid chlorine, it can cause burns.  The skin should be washed with flowing water for 30 minutes.  If the skin is burned, contact a physician immediately.  Chlorine gas can become trapped in the clothing and react with body moisture to form hydrochloric acid which could burn the skin.  Remove the clothing of the victim and wash the body down with water.\n-  In case of inhalation, remove the victim to fresh air, administer oxygen if available, call a physician or transport the injured person to a medical facility.\n\nWarning: \n-  When entering the room that may contain chlorine gas, open the door slightly and check for the smell of chlorine.  NEVER go into a room containing chlorine gas with harmful concentration in the air without a self-contained air supply, protective clothing and help standing by.\n\nAccident History\nAn "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 32637,
      "SummaryText": "accidental release of chlorine has not occurred at the Rose Creek Water Pollution Control Plant within the past five years.\n\nEmergency Response Program\nThe Rose Creek Water Pollution Control Plant is included in the community?s response plan.  Response to incidents are handled by the Oak Grove Fire Department.\n\nPlanned Safety Changes\nThe Rose Creek Water Pollution Control Plant will continue to provide operator training and periodically review its policies and procedures, but is not planning any major safety changes."
    }
  ]
}