{
  "FacilityID": 33038,
  "FacilityName": "Teris LLC",
  "FacilityStr1": "309 American Circle",
  "FacilityStr2": null,
  "FacilityCity": "El Dorado",
  "FacilityState": "AR",
  "FacilityZipCode": "71730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05139",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "33.204498",
  "FacilityLongDecDegs": "-092.631420",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.suez.fr",
  "FacilityEmailAddress": "anne.liontas@suez.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "SUEZ",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "SUEZ France (Teris LLC)",
  "OperatorStr1": "17300 Dallas Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75248",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mohamed Abdulhafid",
  "RMPTitle": "Director of Compliance",
  "FTE": 307,
  "OtherEPAFacilityID": "ARD069748192",
  "EPAFacilityID": "100000108901",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1009-AOP-R1",
  "SafetyInspectionDate": "1999-01-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.20833,
  "FRS_Long": -92.62472,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47673,
      "AltID": "Direct Burn Process",
      "FacilityID": 33038,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48746,
          "ProcessID": 47673,
          "NAICSCode": "562211",
          "_desc": {
            "NAICS_CODE": "562211",
            "NAICS_DESCRIPTION": "Hazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62830,
          "ProcessID": 47673,
          "ChemicalID": 100,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 100,
            "ChemicalName": "Ethyl chloride  [Ethane, chloro-]",
            "CASNumber": "75-00-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62831,
          "ProcessID": 47673,
          "ChemicalID": 113,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 113,
            "ChemicalName": "Trimethylamine [Methanamine, N,N-dimethyl-]",
            "CASNumber": "75-50-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562830,
          "ProcessID": 47673,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562831,
          "ProcessID": 47673,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33038,
      "SummaryText": "\nTERIS LLC,  309 AMERICAN CIRCLE, EL DORADO, ARKANSAS  71730\n\nEPA ID # 100000108901                                             JUNE 2004\n\n\n\nFACILITY DESCRIPTION, REGULATED SUBSTANCE, ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\n\n\nTeris LLC is a hazardous waste incineration facility that operates rotary kilns for solid incineration and thermal oxidation for liquid incineration.  Two warehouses are permitted for storage of containerized hazardous waste, as well as several agitated tanks for the storage of liquids awaiting incineration. The products stored on site are waste because there is no longer any economical use for them.  Incineration has been determined to be the most cost effective and environmentally sound method of disposal for this waste.  The products are hazardous because they meet one or more of the standard hazard categories (flammable, reactive, toxic or corrosive).  Teris handles two chemicals in the incineration process that are regulated under the EPA Risk Management Plan standard (40 C.F.R. 68), ethyl chloride and trimethylamine.  Both flammable substances are present in mixtures (ethyl chloride in concentrations of 30% to 60% and trimethylamine in concentrations of 5% to 25%) and are liquids at ambient temperatures.\n\n\n\nThe products stored for incineration include a wide variety of petroleum based materials and other organic and inorganic chemicals in varying degrees of purity.  The majority of the products are completely reacted, diluted, or mixed with dirt and debris.  All products brought into the facility are profiled and analyzed by technical chemists to determine the proper disposition.  The waste products are then subjected to extreme heat which breaks the chemicals down into its basic molecular structure, eliminating its hazardous components.  It should be noted that the NAICS code reported in the RMP data elements is 562211 which is Hazardous Waste Treatment and Disposal.  This is the only NAICS code available to choose from that best describes the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33038,
      "SummaryText": " facilities activities; however to clarify the description, Teris is not involved in the disposal of the hazardous waste. \n\n \n\nTeris? commitment to providing a safe, healthy work environment for employees as well as providing a safe, healthy environment for the surrounding community is supported by installation of  the latest technology in process controls, active mitigation, passive mitigation, monitoring detection systems and emergency response procedures.  Teris? policy in the event of an accidental release of ethyl chloride and or trimethylamine is to respond to the release with employees that have been specially trained to control and cleanup releases of hazardous chemicals.  Teris adheres to all applicable Federal, State and local safety and environmental regulations for the prevention of releases of these chemicals.\n\n\n\nACCIDENT RELEASE PREVENTION PROGRAM:\n\n\n\nThe distance to the 1 psi overpressure for ethyl chloride for the worst-case scenario does not reach public receptors, therefore Teris is subject to Program 1 requirements of the RMP rule.  Program 1 requires that a worst-case scenario is analyzed and that Teris coordinates emergency response actions with local emergency planning and response agencies.  However, to ensure the safe operation of the processes, Teris has developed and implemented accidental release prevention programs for the ethyl chloride and trimethylamine processes as well as for all chemical processes at the facility.  Operating procedures were developed for the safety operation of each process and employees are trained on proper implementation of these procedures.   The prevention program includes inspections and testing of equipment in the process to ensure the mechanical integrity of the system, high level alarms and emergency venting equipment, hydrocarbon detectors and alarms located throughout the facility, and spill containment provided on-site.  These elements of the prevention program help to ensure an uncontrolled release of e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33038,
      "SummaryText": "thyl chloride and trimethylamine is prevented.\n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\n\n\nNo accidental releases of ethyl chloride or trimethylamine have occurred at Teris in the past five years that has resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\n\n\nTeris has developed an emergency response plan (in accordance with 29 CFR 1910.38) that includes provisions to evacuate non-responding employees from the facility in the event of an uncontrolled accidental release of a hazardous chemical.  Teris is also subject to OSHA?s Hazardous Waste Operations and Emergency Response (HAZWOPER) Plan regulations (29 CFR 1910.120).  Teris has developed and implemented a HAZWOPER program that includes on-site emergency responders, on-site fire brigade, fixed and mobile fire protection equipment, and fire and vapor suppression chemicals.  Training on the HAZWOPER program is conducted on a bimonthly basis to ensure employees are properly trained and ready to respond to a chemical emergency.    \n\n\n\nIn the event of an uncontrolled release of ethyl chloride and or trimethylamine, trained Teris personnel will respond to the emergency.  The Union County LEPC will be contacted as well as the local fire department to assist in the emergency response.  Teris has coordinated with the Union County LEPC and the local fire department on the hazard chemicals present at the facility and Teris? emergency response policies.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\n\n\nTeris is committed to continuous efforts to improve the safe operation of the ethyl chloride and trimethylamine processes by implementing preventative maintenance programs, inspection programs, and employee training in the safe operation of the equipment and the system.  Both the ethyl chloride and trimethylamine processes are designed in accordance with good engineering practices.  Regul"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33038,
      "SummaryText": "ar review of the ethyl chloride and trimethylamine process ensures that any system changes or modifications are evaluated and necessary safety precautions and or safety improvements are made before the process is placed into operation.\n\n\n\n??\n\n\n\n??\n\n\n\n??\n\n\n\n??\n\n\n\nEXECUTIVE SUMMARY - CONTINUED\n\n\n\n\n\n\n\n\n\n2\n\nTeris LLC, El Dorado, Arkansas         June 2004\n\nRisk Management Plan\n\n\n\nEXECUTIVE SUMMARY\n\n\n\n\n\n"
    }
  ]
}