{
  "FacilityID": 33081,
  "FacilityName": "Piscataway Wastewater Treatment Plant",
  "FacilityStr1": "11 Farmington Road W.",
  "FacilityStr2": null,
  "FacilityCity": "Accokeek",
  "FacilityState": "MD",
  "FacilityZipCode": "20607",
  "Facility4DigitZipExt": "9767",
  "FacilityCountyFIPS": "24033",
  "LEPC": "Prince George's County LEPC",
  "FacilityLatDecDegs": "38.411700",
  "FacilityLongDecDegs": "-077.000200",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "L1",
  "LatLongDescription": "CE",
  "FacilityURL": "wsscwater.com",
  "FacilityEmailAddress": "theikki@wsscwater.com",
  "FacilityDUNS": 969150721,
  "ParentCompanyName": "Washington Suburban Sanitary Commission",
  "Company2Name": null,
  "CompanyDUNS": 3258654,
  "Company2DUNS": null,
  "OperatorName": "Washington Sub. Sanitary Commission",
  "OperatorStr1": "14501 Sweitzer Lane",
  "OperatorStr2": null,
  "OperatorCity": "Laurel",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "20707",
  "OperatorZipCodeExt": "5902",
  "FTE": 31,
  "OtherEPAFacilityID": "MDD980554299",
  "EPAFacilityID": "100000126776",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-09-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2007-12-01 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 38.688645,
  "FRS_Long": -76.996768,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47746,
      "AltID": "chlorine",
      "FacilityID": 33081,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 62912,
          "ProcessID": 47746,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 62913,
          "ProcessID": 47746,
          "ChemicalID": 49,
          "Quantity": 22000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48821,
          "ProcessID": 47746,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27322,
              "Process_NAICS_ID": 48821,
              "SafetyReviewDate": "2004-02-26 00:00:00",
              "PHA_Date": "2004-05-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "Yes",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "cyliner leak repair kits",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "scrubber system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-26 00:00:00",
              "TrainingReviewDate": "2004-02-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "State Certification",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": "State Certification",
              "MaintenanceReviewDate": "2002-04-01 00:00:00",
              "EquipmentInspectionDate": "2004-05-21 00:00:00",
              "EquipmentTested": "Gas Leak Detectors",
              "ChangeMgmtDate": "1999-05-14 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-14 00:00:00",
              "PreStartupReviewDate": "2004-02-26 00:00:00",
              "ComplianceAuditDate": "2004-02-26 00:00:00",
              "AuditCompletionDate": "2004-02-26 00:00:00",
              "IncidentInvestigationDate": "2001-02-05 00:00:00",
              "InvestigationChangeDate": "2002-04-01 00:00:00",
              "ParticipationPlansReviewDate": "2004-02-26 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-25 00:00:00",
              "ContractorSafetyReviewDate": "2004-02-11 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 39752,
                  "PreventionProgram3ID": 27322,
                  "ProcessChemicalID": 62912
                },
                {
                  "PrimaryKey": 39753,
                  "PreventionProgram3ID": 27322,
                  "ProcessChemicalID": 62913
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33081,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-27 00:00:00",
    "ERTrainingDate": "2004-04-02 00:00:00",
    "CoordinatingAgencyName": "Prince George's County LEPC",
    "CoordinatingAgencyPhone": "3012626013",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33081,
      "SummaryText": "Piscataway Wastewater Treatment Plant EPA/RMP Executive Summary June 2004\n\nI. THE WASHINGTON SUBURBAN SANITARY COMMISSION\n\nThe Washington Suburban Sanitary Commission (WSSC) is a quasi-government agency established by the Maryland General Assembly in 1918 as a regional (bi-county) organization under Article 29 of the Annotated Code of Maryland, to provide water and sewer services for Prince George's and Montgomery Counties, Maryland.  Currently WSSC provides service to 396,000 customer accounts and an area of nearly 1,000 square miles.\n\nII. THE VISION AND MISSION OF THE WSSC\n\nThe WSSC Vision - Since we are entrusted by our communities to provide safe drinking water, to ensure reliable service, and to safeguard the environment, we will demonstrate, through our daily performance in meeting these responsibilities, the importance of earning the trust and advocacy of our customers.  We will be recognized as pioneers in our field and will be looked up to by our peers.  Our leadership role in community involvement will forge working partnerships that place trust in our customers' interests as they place trust in our tested experience.\n\nWe inspire among our employees' sensitivity and responsiveness to customers' needs, with a commitment to excellence at every level in the organization.  We will develop an empowered and diverse work force representative of the public we serve and one that will exhibit a sense of individual values that translate into teamwork, pride, and personal responsibility.\n\nOur Mission - We are entrusted by our community to provide safe and reliable water, life's most precious resource, and to return clean water to our environment, all in a financially responsible manner.\n\nIII. FULFILLING OUR VISION AND MISSION\n\nTo fulfill our mission of providing safe, reliable water that meets or exceeds all standards for purity and of returning clean water to the environment - all in an efficient, financially responsible manner - WSSC operates and maintains an extens"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33081,
      "SummaryText": "ive array of highly automated facilities.  Its two water filtration plants, drawing from the Potomac and Patuxent Rivers, produce an average of 166 million gallons of potable water per day, and over 5,000 miles of water mains deliver that product to homes and businesses in Prince George's and Montgomery Counties.  The Commission operates four raw water reservoirs, with a total capacity of over 14 billion gallons, to ensure a reliable water supply for all seasons and conditions.\n\nSix wastewater treatment plants operated by WSSC provide wastewater treatment.  Every day an average of 181 million gallons of wastewater from Prince George's and Montgomery Counties move to facilities through 4,900 miles of sewers maintained by the WSSC.  The six WSSC wastewater treatment plants have a combined capacity of over 73 million gallons per day (mgd).  Under the Inter-municipal Agreement, WSSC is allocated 169 mgd of Blue Plains' capacity.  WSSC, in turn, pays a share of the Blue Plains' operating and capital expenses.\n\nIV. POWERS AND RESPONSIBILITIES\n\nA six-member commission governs WSSC - three members from each county.  The Commissioners are appointed to four-year terms by their respective county executives, and confirmed by their county councils.\n\nThe Commission's powers and responsibilities are set forth in State law and in subsequent legislative amendments.  The Maryland General Assembly conferred these powers upon the WSSC to enable it to fulfill its principal functions.\n\nThe Commission's major functions are to:\n\n? provide for the construction, operation, and maintenance of water supply and sanitary sewerage systems in Montgomery and Prince George's Counties,\n? approve the locations of, and issue permits for, utilities installed in public ways, and\n? establish waster consumption rates, sewer usage rates, connection charges, front foot benefit charges, and permit fees, and if required, cause ad valorem taxes to be levied.\n\nThe Commission also:\n\n? reviews preliminary subdivis"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33081,
      "SummaryText": "ion plats as to suitability of water and sewer design, and reviews street grades for those streets in which there are Commission facilities,\n? formulates regulations, issues permits for, and inspects, all plumbing and gas-fitting installations, and\n? conducts examinations for master and journeyman plumbers and gas fitters, and issues licenses to those qualified to perform plumbing and gas-fitting work.\n\nV. WSSC'S DEDICATION TO EMERGENCY RESPONSE AND PROTECTION\nOF PUBLIC HEALTH\nHistorically WSSC has always taken its responsibilities related to accident prevention, emergency response, and the protection of public health . Our initiatives have normally been above and beyond the regulatory mandated requirements.  While extensive efforts were taken back in June of 1999 to respond to the requirements of the Risk Management Plans, the unfortunate events of September 11, 2001, prompted us to re-visit our philosophy and approach towards emergency response.  WSSC invested in a large-scale emergency response plan upgrade project on June 30, 2003.  This project was primarily intended to meet the requirements of HR 3448, Title IV - Drinking Water, Security and Safety, Section 401 - Terrorist and Other Intentional Acts, contained in the \"Public Health Security and Bioterrorism Preparedness and Response Act of 2002.\" WSSC took this project to a higher elevation by updating all emergency response plans in accordance with the National Response Team's Integrated Contingency Plan Guidance (\"One Plan\").  Furthermore, while the Bioterrorism Act only required the WSSC to update our emergency response plans for drinking water treatment plants, WSSC took the initiative to update all emergency response plans for all wastewater treatment plants as well.  On September 29, 2003, the WSSC provided a Certification of Compliance of Integrated Contingency Plan with Requirements of Public Health Security and Bioterrorism Preparedness and Response Act of 2002 - Emergency Response Planning.  The WSSC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33081,
      "SummaryText": "continues to be in the forefront of our industry related to emergency response planning.\n\nVI. THE PRODUCTION TEAM\n\nThe Production Team provides continuous high quality cost effective operation and maintenance of the WSSC's water supply dams, reservoirs, water filtration plants, water distribution facilities, wastewater collection facilities, wastewater treatment plants, biosolids management programs and laboratories.\n\nOne of the Production Team's primary goals is to provide a safe and reliable supply of drinking water to our customers maintaining an adequate volume and pressure of water for fire-fighting and customer use that meets or exceeds the requirements of the Safe Drinking Water Act and other federal and state regulations.  The WSSC has never exceeded a maximum allowable contaminant level (MCL) established by the U.S. Environmental Protection Agency (EPA) in accordance with the Safe Drinking Water Act.  The Team is accomplishing this mission by maintaining and operating the Commission's raw water supply, dams, reservoirs, water filtration plants, and distribution system.  The two major water treatment plants, the Potomac and Patuxent Plants, operate in coordination with the distribution system and its various storage facilities, 65 tanks, and 13 pump stations to maximize water quality and customer satisfaction while minimizing costs.  All remote water pumping stations, storage tanks, and remote control pressure reducing stations are monitored and controlled through our supervisory control and data acquisition (SCADA) system.  These treatment and distribution systems utilize a combination of advanced process control and human intervention to meet ever increasing regulatory demands.\n\nThe second primary goal of the Production Team is to produce a quality effluent from its wastewater treatment plants which meets discharge standards to protect public health and environment.  This process begins with the operation and maintenance of portions of the WSSC wastewater"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33081,
      "SummaryText": "collection system.  Forty-two wastewater pumping stations pump wastewater to the treatment plants.  These facilities are remotely monitored by our SCADA system for proper operations to minimize overflows and protect equipment against damage.  Six wastewater treatment plants, Seneca, Damascus, Parkway, Western Branch, Piscataway, and Hyattstown, along with the District of Columbia Water and Sewer Authorities (WASA) Blue Plains Plant provide wastewater treatment for WSSC's customers.  All of these wastewater treatment plants produce biosolids, the solids residuals removed from the wastewater during the treatment process.  The Production Team handles the biosolids beneficial reuse program.  \n\nAs this Team moves toward best practices, the continued and improved use of automation technology for process control and centralized control are critical to provide oversight and coordination with both the water and wastewater systems.  The use of this technology as a strategy allows automation and remote monitoring to support unstaffed or reduced staff operations and maintenance scheduling while maintaining a vigilant watch on these complicated systems.  \n\nA variety of support organizations exist within the Production Team.  Laboratory Services provides all laboratory testing and results necessary to operate the treatment processes including biological, organic and metals testing.  This laboratory data is utilized to optimize processes as well as meet the requirement of federal and state regulations.  The Laboratory also supports a variety of other teams within WSSC and performs laboratory work for other organizations.  The Production Team also provides coordination with numerous agencies regarding regional water supply, wastewater treatment and related issues.\n\nThe Production Team is responsible for providing overall supervision, management, coordination, and administration of the Water and Wastewater Groups.  The Team formulates operating policy and procedures, provides techn"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33081,
      "SummaryText": "ical advice to the Commission and staff, and participates in inter and intra-agency meetings. The Team Chief also serves as WSSC's representative to the Council of Government's Environmental and Public Works Directors Committee (a committee which develops environmental policy recommendations for the Board of Directors), the Montgomery County Water Quality Advisory Group (which advises the Council on water policies), and the Chairman of the WSSC Plumbing Board (which makes policy recommendations regarding the Plumbing Code).  The Team Chief provides the supervision, management, and administrative control of the Water and Wastewater and support Groups.\n\nVII. PISCATAWAY WASTEWATER TREATMENT PLANT\n\nThe Piscataway Wastewater Treatment Plant (WWTP) is located at 11 Farmington Road West in Accokeek, Maryland. It is our mission to protect and enhance the environmental quality of the Chesapeake Bay Watershed, while meeting the wastewater needs of approximately 160,000 people in the southwest quadrant of Prince George's County. The Piscataway WWTP is designed to treat 30 million gallons per day (mgd) of wastewater. It employs a Step Feed Biological Nitrogen Removal process, followed by chemical phosphorous removal, secondary clarification, gravity filtration, chlorination, chemical pH adjustment, and dechlorination prior to release into the Potomac River. The current plant average flow is approximately  22 mgd. Plant biosolids are dewatered and nutrients returned to the soil for beneficial reuse through application on agricultural land. Plant staff also monitors and maintains seven remote wastewater-pumping stations in southern Prince George's County.\n\nPerformance and safety are the hallmarks of the Piscataway WWTP. Performance has enabled the Piscataway WWTP to receive many awards, including the National First Place Award in U.S. Environmental Protection Agency Operations, and Maintenance Excellence Award Program in 1990 for outstanding wastewater management. The plant has a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 33081,
      "SummaryText": "lso received many awards from the Association of Metropolitan Sewage Agencies, including Gold Awards, for excellent compliance with the Plant's National Pollutant Discharge Elimination System permit in 1986, 1987, 1988, 1989, 1990, 1991,1995, 1997, 1998, 1999, 2000, 2001, 2002 and 2003. The Piscataway WWTP has also received the Prince George's County Beautification Award in 1988, 1991, and 1992. In 1998, the plant was the proud recipient of the Governor's Award of Excellence.\n\nVIII. PREVENTION PROGRAM\n\nThe Commission Accidental Release Prevention Program is part of the agency's overall Safety and Health Program and involves a unified approach that integrates technologies, procedures and management practices to assure our workers and the public a safe environment. The RMP requirement is essentially an expansion of the OSHA Process Safety Requirement and the Employee and Community Right-to-know programs that have been in existence a number of years.\n\nHazardous material has always been recognized as a unique hazard for our employees and the public; therefore, we have made every possible effort to ensure the proper and safe use of all hazardous materials. WSSC's Chemical Safety Prevention Program includes: the availability of personal protective equipment; obtaining and use of Material Data Safety Sheets, (MSDS); designing facilities for safety and accident prevention, training and educating employees on chemical systems and processes; planning and practicing for emergency situations; requiring contractors and consultants to abide by established safety practices; sharing of information with employees, contractors and consultants; conducting periodic inspections and audit reviews of chemical process systems; and formulating policies and procedures for an effective chemical handling process.\n\nAdditionally, all Commission facilities are designed and built to conform with the industry recognized codes, such as: National Electric Code, American Society of Mechanical Engineer"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 33081,
      "SummaryText": "s, American National Standards Institute, ASME Boiler and Pressure Vessel Codes, BOCA Codes, American Society of Heating, Refrigeration and Air Condition Engineers, American Water Works Association, etc.\n\nA review of the hazards associated with the chlorine and dechlorination processes and procedures are performed annually.\n\nPlant Management developed written procedures that provide clear instructions and steps for safely conducting activities associated with our chlorination and dechlorination processes. The procedures include initial startup, normal operations, emergency shutdown and operation, and emergency planning and response. A contractor is on call to provide twice yearly inspection and maintenance of the chlorination/ dechlorination feed equipment. Employees currently operating and maintaining the chlorination and dechlorination processes have been trained and tested as competent to perform their work duties. Newly assigned workers will also receive the appropriate training to perform their assigned tasks.\n\nPiscataway places great emphasis on safety.  Everyone is taught safety first, and that no job can be completed without following proper safety procedures.  Extensive safety training is required of all employees.  Operators must attend the following courses:\n\n? Self Contained Breathing Apparatus\n? Chlorine Repair Kit\n? Chlorine Leak Drill\n? CPR\n? Slips and Falls Prevention\n? Right-to-Know\n? Lockout/Tagout\n? Confined Space\n\nThese courses were developed by Production Team personnel, and are taught by the plant's Safety Coordinator.  Course content is a mixture of lecture, video, and hands-on training.  We recently studied the effectiveness of these courses, and determined that better instructor development coupled with more hands-on training would improve comprehension.  The Safety Coordinator position is rotated among qualified, Fully Certified Operators.  Before becoming a Safety Coordinator, an operator must complete a 3-day training class.\n\nIn addition"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 33081,
      "SummaryText": "to conducting training classes, Safety Coordinators perform inspections, investigate accidents, conduct safety meetings, and correct plant safety problems.  The rotation of an operator/facility technician into Safety Coordinator position gets more operators directly involved in safety, promotes the concept of safety being everyone's job, and provides a fresh approach to safety.\n\nThe Plant Safety Program is a part of the overall WSSC Program.  WSSC safety professionals provide assistance on many safety matters.  They assist with developing training courses, investigating accidents, correcting unsafe conditions, providing physicals and random drug and alcohol tests for CDL drivers, and ensuring chemicals are handled properly.  Each year a safety specialist (in conjunction with the plant Safety Coordinator) performs a detailed inspection of the plant to ensure we meet all safety requirements.  All of the needed safety equipment is supplied by the WSSC.  This includes coveralls, rain suits, chemical-handling suits, hard hats, breathing apparatus, various types of gloves, eye protection equipment, manhole retrieval equipment, atmosphere testing meters, and well maintained vehicles.  Our position is that all needed safety equipment and training is provided to each employee.  Therefore, we accept no excuses for failure to work safely.\n\nAs a WSSC prerequisite for long term employment, all wastewater plant operators or Facility Technicians must become fully certified by the State of Maryland's Department of the Environment by passing examinations. This ensures all operational personnel are capable of effectively operating the plant. At Piscataway, all operational personnel have State of Maryland certification. Piscataway has an excellent safety record, as evidenced by winning the WSSC Wastewater Operations Division Annual Safety Award, (awarded to the plant with the best safety record), four years in a row, 1989 through 1992, and then again in 1996, 1998, and 1999. Because s"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 33081,
      "SummaryText": "afety is so important, there have been no releases of sulfur dioxide or chlorine gas to the environment in the history of the plant.\n\nThe plant is designed to provide reliable operations year round. Power to the plant originates from two different electrical sources, providing electrical redundancy and thereby reducing the potential occurrence of a total power outage. The plant is designed with redundant equipment at every phase of the treatment process. Thus, when an equipment failure occurs, the process can continue producing a high quality final effluent and provide maximum protection to our environment.\n\nThe Safety Program is clearly a success.  Accidents and injuries are at very low levels.  A plant record of 1,775 days without a lost-time accident was set recently.  In the past five years, the only occupational injury related to the use of chlorine and sulfur dioxide was when an employee changed a ton cylinder without use of her PPE.  This occurred on February 5, 2001, and the employee became exposed to sulfur dioxide, which leaked during the cylinder change.  As a result of this incident, WSSC PPE requirements were reviewed and revised for all WSSC personnel working with chlorine or sulfur dioxide.\n\nManagement decided years ago that formal recognition of safe working employees was a good idea.  For each injury-free quarter, the plant receives an award.  For each injury-free year, the plant receives a plaque.  Individuals are also recognized.  Every two consecutive injury-free years are rewarded with a safety jacket or other safety incentives.  It is felt that recognition demonstrates the management commitment to safety.  The small amount of money spent on these recognitions is a cost saving to our overall prevention of accidents and injuries.\n\nPlans are in place to replace the chlorine and sulfur dioxide with an ultra-violet light (U.V.) disinfection system.  We expect to have a U.V. disinfection system in operation by 2006.  This is a clear indication of the"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 33081,
      "SummaryText": "WSSC's commitment to protecting the public's health and safety.\n\nIX. EMERGENCY RESPONSE PLANNING\n\nThe Piscataway WWTP has a written emergency response planning program.  A written emergency plan is maintained by the site plant personnel with the support of the WSSC Safety Unit.  The plan is consistent with the EPA 40 CFR Emergency Response Planning and Community Right-to-Know Act of 1986 of the Title III of the Superfund Amendments and Reauthorization Act and includes:  delegation of authority; notification of officials; emergency procedures; and procedures for working with local officials should an emergency create the need for an evacuation of the plant and/or surrounding community.\n\nPlant personnel are regularly trained on the plan requirements and conduct periodic emergency response drills for a variety of plant emergencies.  The plant personnel and the Safety Unit document training.  Some training courses related to emergency response are requirements for operators to maintain their plant certifications by the Maryland Department of the Environment.\n\nClose relations with the local fire department have been established.  Fire fighters regularly visit the plant and are familiar with plant components.  Some cross training between organizations has taken place.  They have trained us on use of various fire extinguishers, and we have trained them on chlorine and sulfur dioxide leak procedures.  Several years ago, the Prince George's County Fire Department conducted their annual FEMA disaster drill at WSSC's Western Branch Plant using a simulated massive chlorine leak as the disaster event.  Emergency plant evacuation drills are conducted every six months to reinforce emergency procedures.\n\nA WSSC staff member from the Safety Unit is a member of the Montgomery County Local Emergency Planning Committee (LEPC), and attends the LEPC meetings in Prince George's County, the site of WSSC's Western Branch WWTP.  He assists the plant and fire department in coordinating emerg"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 33081,
      "SummaryText": "ency response planning and training procedures for the plant.  WSSC has shared with the Prince George's and the local fire departments our Risk Management Plan for this facility.\n\nSafety Unit Coordinator\nWashington Suburban Sanitary Commission\n14501 Sweitzer Lane\nLaurel, Maryland  20707\n301-206-7060"
    }
  ]
}