{
  "FacilityID": 33095,
  "FacilityName": "Uniroyal Chemical Company Incorporated",
  "FacilityStr1": "214 West Ruby Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Gastonia",
  "FacilityState": "NC",
  "FacilityZipCode": "28054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37071",
  "LEPC": "Gaston Emergency Management",
  "FacilityLatDecDegs": "35.243611",
  "FacilityLongDecDegs": "-081.187500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cromptoncorp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3164464,
  "ParentCompanyName": "Crompton Corporation",
  "Company2Name": null,
  "CompanyDUNS": 52813136,
  "Company2DUNS": 0,
  "OperatorName": "Crompton Corporation",
  "OperatorStr1": "199 Benson Road",
  "OperatorStr2": null,
  "OperatorCity": "Middlebury",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06749",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryan A. Laney",
  "RMPTitle": "EHS Manager",
  "FTE": 95,
  "OtherEPAFacilityID": "28054NRYLC214WE",
  "EPAFacilityID": "100000143392",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 35.24349,
  "FRS_Long": -81.18748,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47764,
      "AltID": "Urethane Prepolymer Mfg",
      "FacilityID": 33095,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48840,
          "ProcessID": 47764,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62932,
          "ProcessID": 47764,
          "ChemicalID": 44,
          "Quantity": 168600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562932,
          "ProcessID": 47764,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33095,
      "SummaryText": "Plant Description\n\nThe Uniroyal Chemical Company Inc. Gastonia Plant, a 12 acre site, is situated in a residential neighborhood, with homes directly adjacent to the east and west fence lines.  To the north of the plant, directly adjacent to the fence line, is Catawba Creek, a tributary of the Catawba River.  The Catawba River feeds Lake Wylie, a major recreational usage lake.  Municipalities downstream of Lake Wylie, on the Catawba River, utilize the river as their major drinking water supply.  All stormwater leaving the plant site flows directly into Catawba Creek.\n\nAccess to the facility is via a two-lane street, lined with homes, and several blocks from a major throroughfare.\n\nThe Uniroyal facility manufactures Castable Urethane Prepolymers utilizing Toluene Di-isocyanate as a reactant, in combination with high molecular weight polyethers and polyesters.\n\nThe Gastonia Plant has both a Safety and Health Policy and an Environmental Policy.  These policies contain the key elements of our on-going safety and environmental programs.  Numerous written Standard Practices and Standard Operating Procedures are in place, and their implementation is documented.\n\nEnvironmental Policy\n\nUniroyal Chemical Company Inc. Gastonia Plant will\n1. Produce, store, transport, use, and dispose of chemicals in a manner that protects the environment as well as the health and safety of the work force and the public.\n2.  Comply with all the laws, regulations, and standards applicable to our products, processes, and wastes.\n3.  Actively pursue reductions of the generation of waste and the discharge of contaminants into the environment.\n4.  Commit to continual improvement by setting and reviewing objectives and targets. \n5.  Undertake scheduled environmental assessments of the Gastonia Plant.\n6.  Entrust each manager/supervisor with the responsibility for the environmental performance of his/her area.\n7.  Continue training of plant personnel on the aspects of environmental responsibilities.\n8."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33095,
      "SummaryText": "  Communicate this policy to all employees and to the public.\n\n\nSafety and Health Statement\n\nUniroyal Chemical Company Inc., Gastonia Plant, recognizes that safe working conditions and healthy employees are fundamentally important to it's success.\n\nWe believe that:\n\nManagement is responsible for establishing safe working conditions and effective health and safety programs;\n\nEach employee is responsible for following proper procedures and for caring enough to prevent injury to others;\n\nThe well being of our company and our fellow employees depends on all employees working together to keep safety and health awareness an important part of all of our daily activities.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Gastonia plant has several programs and policies to deal directly with accidental release and \nemergency response.  Additionally, an Environmental Management Manual has been prepared as part\nof their ISO 14000 Registration.  Included in that manual are several policies, which also address release prevention and emergency response.\n\nRelease Prevention\n\nThe storage and handling of TDI is covered in several significant environmental aspects (Gastonia \nWSP #41).  Preventative maintenance, daily inspection documentation, and internal reporting requirements\nare covered in WSP #23, and SOP #30.\n\nEmergency Response\n\nEmergency response to a release of TDI is also covered in three main procedures:\n\nWSP #33 - Spill Prevention, Control and Countermeasures Plan, which includes TDI along with all other \nhazardous materials stored on site including fuel oil.\n\nSOP #25 - Emergency Procedure for Hazardous Release, which includes training, hazardous awareness, necessary PPE, and annual drills.\n\nWSP #28 - Emergency and Disaster Plan, which covers fires, natural disasters, civil disturbances, and\nbomb threats.\n\n\nWorst Case Release Scenario\n\nThe worst case release scenario modeled by Uniroyal Chemical Company Inc.  Involves a release from our toluene di-isocyan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33095,
      "SummaryText": "ate (TDI) storage tank equivalent to a 2-inch valve breaking.  The valve in this scenario would spill approximately 122,400 pounds of TDI into the secondary containment dike surrounding this tank.  The presence of this dike serves to limit the surface area of the spill, which extends the amount of time necessary for this material to completely evaporate.\n\nThe RMP submit Program Limits will not accept the actual modeling data.  \nActual modeling data is as follows\nTotal Quantity Released (Toxic Liquid Pool and Evaporation with Dike)  - 122,400 pounds\nEvaporation Rate - 0.02 pounds per minute\nRelease Duration - 6,120,000 minutes\n\nAs demonstrated by the above data, it would take many days for this material to completely evaporate due to the extremely low vapor pressure of this material at its storage temperature.  The toxic endpoint for TDI would occur within Uniroyal's fence line.  Uniroyal Chemical Company Inc. has emergency response and cleanup plans in place, and would clean up a release of TDI as quickly as possible to minimize impact to the environment and neighboring community.\n\nFive Year Accident History\n\nUniroyal Chemical Company Inc. has not had a release of TDI with an off-site impact during the past five years.\n\nPlanned Safety Related Changes\n\nUniroyal Chemical Company Inc. operates the Gastonia Plant with Safety as a high priority.  There are no safety related improvements identified for implementation by Uniroyal at this time."
    }
  ]
}