{
  "FacilityID": 33093,
  "FacilityName": "Sierra Pacific - Patterson",
  "FacilityStr1": "340 South First Street",
  "FacilityStr2": null,
  "FacilityCity": "Patterson",
  "FacilityState": "CA",
  "FacilityZipCode": "95363",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.469299",
  "FacilityLongDecDegs": "-121.124809",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 783722622,
  "ParentCompanyName": "Sierra Pacific Warehouse Group",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ken Sauls",
  "OperatorStr1": "340 South First Street",
  "OperatorStr2": null,
  "OperatorCity": "Patterson",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95363",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken Sauls",
  "RMPTitle": "General Manager",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000152648",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-21 00:00:00",
  "SafetyInspectionBy": "Stanislaus County",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-11-09 00:00:00",
  "DeRegistrationEffectiveDate": "2009-05-18 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 37.46942,
  "FRS_Long": -121.1258,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47762,
      "AltID": null,
      "FacilityID": 33093,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 48838,
          "ProcessID": 47762,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 62930,
          "ProcessID": 47762,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 562930,
          "ProcessID": 47762,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33093,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nSierra Pacific - Patterson, located in Patterson, California, utilizes refrigeration for the cold and freezer storage of a wide variety of food products.\n\nSenior management at Sierra Pacific - Patterson is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Senior management as well as Safety Coordinators administer the facility's safety and environmental policies and programs.  These programs include but are not limited to forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturers documentation, Emergency Response, as well as the Risk Management Plan.\n\nSierra Pacific - Patterson has coordinated emergency response efforts with Stanislaus County.  In the case of an ammonia-related emergency, it is the policy of Sierra Pacific - Patterson to evacuate employees and to allow the fire department/HazMat team to respond to the emergency.  Facility refrigeration operators will be available for guidance and assistance.\n\nThe majority of the equipment is located inside the engine room.  The system is a closed loop refrigeration system similar to a residential refrigerator.  There are no emissions or planned releases of ammonia.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE \n\nThe ammonia refrigeration system is a closed system that cycles the refrigerant, or ammonia, from liquid to gas and back again.  The system, consisting of vessels, piping, valves, and process equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold and freezer storage of food products. \n\nChanges in pressure are directly related to changes in temperature: lowering the ammoni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33093,
      "SummaryText": "a pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing ambient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  Typical operating conditions range from approximately 9 psig on the low pressure side of the system to 135 psig on the high side. \n\nAmmonia is used as the refrigerant in the refrigeration process. \n\nThe maximum intended inventory of ammonia is 15,000 pounds. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS \n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following: \n\nIIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\"\nIIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\" \nIIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\nIIAR \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\" \n\nIn addition, Sierra Pacific - Patterson has implemented a Process Safety Management program for compliance with the Cal-OSHA regulation.  For example, the facility recently conducted a Process Hazard Analysis Revalidation on April 1rst, 2004. In addition, the facility has a Mechanical Integrity program that includes an \"Engineering Checklist\" for equipment inspections. \n\nFIVE YEAR ACCIDENT HISTORY \n\nAn investigation into Sierra Pacific - Patterson's accident history revealed that there have been no reportable ammonia releases over the last five years (March 1999 - March 2004). \n\nEMERGENCY RESPONSE PROGRAM \n\nIn the event of a spill, release, near miss, or threatened release involving ammonia, the event will be reported to the supervisor in whose area the incident occurred.  The supervisor will in turn report to the Plant Manager and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33093,
      "SummaryText": "/or Chief Engineer.  The Plant Manager and/or Chief Engineer will immediately determine the quantity of the release and, if deemed necessary, notify the appropriate authorities and agencies.  They will also determine whether the system requires shut down.\n\nIf evacuation of the facility is necessary, plant personnel will vacate the facility according to evacuation routes outlined in Section 15 of the Sierra Pacific Emergency Response Plan and Procedures.  Emergency assembly area locations are to the north of the facility, and are discussed in the same section of the Emergency Response Plan and Procedures.  The ERT and area supervisors are the responsible parties for ensuring all employees are evacuated safely.  They are also responsible for ensuring all employees evacuate to the designated rendezvous point. \n\nNotification of evacuation will be provided in the form of an emergency whistle, or \"disaster alarm\". Three (3) short blasts of the disaster alarm, followed by a pause, followed by three more short blasts will signify work area evacuation.  The emergency coordinator is responsible for sounding the disaster alarm. \n\nIn the event the emergency coordinator is unavailable, the emergency coordinator alternate will become responsible for sounding the disaster alarm.  If evacuation of the entire facility is necessary, designated emergency action personnel will coordinate the movement of employees to the appropriate assembly area or rendezvous point.  Emergency response drills involving all facility personnel are performed on an annual basis.  This ensures that employees are familiar with evacuation routes from the facility.\n\nPLANNED CHANGES TO IMPROVE SAFETY \n\nA Process Hazards Analysis (PHA) Revalidation was conducted on March31st and April 1st, 2004.  The PHA Revalidation report includes the results from the following two elements: 1) the Hazard and Operability (HAZOP) study and 2) a Site Inspection. These studies were performed to define potential hazards associated"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33093,
      "SummaryText": " with operational deviations of the ammonia system.  As a result of the Process Hazards Analysis, a number of recommendations were made, such as procedural changes, ammonia awareness training and some equipment upgrades.  These recommendations are scheduled to be complete by April 2005.\n\nIn addition, the facility is planning to complete several items over the next year to help with their continued effort to provide a safe work environment for Sierra Pacific - Patterson employees.  These changes include the following items:\n\n1. Continue to train all employees in Cal-OSHA's Process Safety Management, EPA's Risk Management Program, and the California Accidental Release Prevention program.\n2. Continue to have employee involvement in updating and refining the above mentioned safety programs via the facility's Employee Participation program.\n3. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}