{
  "FacilityID": 33107,
  "FacilityName": "City of Pocatello POTW",
  "FacilityStr1": "10733 N. Rio Vista Road",
  "FacilityStr2": null,
  "FacilityCity": "Pocatello",
  "FacilityState": "ID",
  "FacilityZipCode": "83201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16005",
  "LEPC": "Bannock County LEPC",
  "FacilityLatDecDegs": "42.915556",
  "FacilityLongDecDegs": "-112.518333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 853804,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brent Hokanson",
  "OperatorStr1": "P.O. Box 4169",
  "OperatorStr2": null,
  "OperatorCity": "Pocatello",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83201",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": "000007897440",
  "EPAFacilityID": "100000030664",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-06-19 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-05-18 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-23 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 42.91528,
  "FRS_Long": -112.51694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 47777,
      "AltID": "Sewage Treatment Plant",
      "FacilityID": 33107,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 63062,
          "ProcessID": 47777,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 63063,
          "ProcessID": 47777,
          "ChemicalID": 49,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 48853,
          "ProcessID": 47777,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 18491,
              "Process_NAICS_ID": 48853,
              "SafetyReviewDate": "2003-06-16 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-16 00:00:00",
              "ChangeCompletionDate": "1999-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-08-21 00:00:00",
              "TrainingReviewDate": "2002-08-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-08-21 00:00:00",
              "EquipmentInspectionDate": "2004-05-17 00:00:00",
              "EquipmentTested": "Service & inspection of Chlorinators and Sulfonators, 04/26/2004 Alarms chlorine/sulfur dioxide,",
              "ComplianceAuditDate": "1999-03-25 00:00:00",
              "AuditCompletionDate": "1999-09-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Sewage Treatment Plant - Chlorination/dechlorination process",
              "_chemicals": [
                {
                  "PrimaryKey": 19285,
                  "PreventionProgram2ID": 18491,
                  "ProcessChemicalID": 63062
                },
                {
                  "PrimaryKey": 19286,
                  "PreventionProgram2ID": 18491,
                  "ProcessChemicalID": 63063
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33107,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-08-01 00:00:00",
    "ERTrainingDate": "2002-08-01 00:00:00",
    "CoordinatingAgencyName": "Pocatello Fire Department",
    "CoordinatingAgencyPhone": "2082347071",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33107,
      "SummaryText": "Pocatello POTW Executive Summary\n\nPocatello's POTW is located west of the city at 10733 Rio Vista Road. The POTW treats  wastewater generated by the City of Pocatello, the City of Chubbuck, and some of the out lying Bannock County areas. The processes include primary and secondary treatment with disinfection using a final chlorination/dechlorination process prior to discharge to the Portneuf River. The City of Pocatello exceeds the threshold quantity for the chemicals chlorine and sulfur dioxide and must comply with the mandated EPA Risk Management Plan (RMP).\n\nThe two major elements in the RMP for Pocatello are the off site consequence analysis for chlorine and sulfur dioxide, both worst case and alternative release, and a prevention program. Pocatello's prevention plan includes information about safety, process hazards, operating procedures, training programs, maintenance programs, audits, and accident investigations. The offsite consequence analysis for both the worst case release scenario and alternative release scenario were completed using EPA's RMP*Comp program. Pocatello used EPA's TRI Program to determine facility latitude and longitude.\n\nFive Year Accident History\n\nThere have been no accidental releases of chlorine or sulfur dioxide in the past five years. The object of this plan is to continue this history and prevent any accidental releases and to respond effectively and timely in the unlikely event there is a release. Pocatello's RMP incident report form will be used in the unlikely event there is an accidental release.\n\nManagement System\n\nThe roles and responsibilities of the staff that oversee the risk management program elements will help to ensure effective communication about process changes between divisions; clarify the roles and responsibilities related to process safety issues; avoid confusion and allow team work; and ensure that the program elements are integrated into an ongoing approach to identifying hazards and managing risks.\n\nPrevention "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33107,
      "SummaryText": "Program (Program 2)\n\nPocatello's prevention plan has integrated the seven basic elements - safety information, process hazards analysis, operating procedures, training programs, maintenance programs, compliance audits, and accident investigations into a risk management system. Safety information is used to perform a process hazard analysis and the results of the analysis are used to revise and update operating and maintenance procedures. Training programs ensure employees understand and manage risks are revised as needed and continued training is provided.\n\nEPA requires Pocatello to review and update its hazard review at least once every five years. The review and all updates of the hazard review, as well as resolutions of any problems identified are documented.\n\nProcess Safety Information\n\nChlorine and sulfur dioxide have been used for many years for the chlorination/dechlorination processes at Pocatello's POTW. As references for chlorine and sulfur dioxide handling Pocatello uses \"The Chlorine Manual\" (The Chlorine Institute, 1986, 5th edition), \"Chlorine and Its Properties\" (Capitol Controls Company, Inc. 1990, Pub.No. 381-5), Sulfur Dioxide and Its Properties (Capitol Controls Company, Inc. 1989, Pub. No. 482-2), Material Safety Data Sheets (MSDS) BOC GASES, 1996, and Pocatello's \"Operating Procedures for Chlorine and Sulfur Dioxide Cylinder Handling and Storage\", 1999.\n\nOperating Procedures\n\nOperating procedures and instructions are important for training personnel and insuring safe operations of the chlorine and sulfur dioxide systems. The standard operating procedures (SOPs) for operating the chlorine and sulfur dioxide systems and associated equipment are located in the operations office, maintenance office, and the operators lab which are accessible to all plant personnel. The SOPs cover everything from receiving the ton cylinders through valving the to various discharge points. SOPs include the start-up and shut down of all related handling equipment. SOPs"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33107,
      "SummaryText": " are updated as needed.\n\nNew employees are given general training in the hazards as part of their plant employee orientation. New operators are required to review and understand the SOPs and are given on the job training (OJT) on all chlorine and sulfur dioxide related tasks required as part of their operational duties. The maintenance employees also receive OJT before they are allowed to independently work on the chlorine and sulfur dioxide systems.\n\nMaintenance\n\nWritten procedures for inspecting and testing are incorporated into a preventive maintenance (PM) program and have been in effect since the construction completion in 1992. The PM is conducted in accordance with the manufactures recommended procedures and sound engineering practices. The PM program is operated by a computer system that generates the needed information when a piece of equipment is in need of inspection or service.\n\nTechnical manuals for the process systems consist of three volumes which are current and located in the maintenance library.\n\nInitial training on the process systems were conducted by construction contractor and equipment manufactures at completion of construction. Safety training requirements for maintenance personnel are the same as for operations personnel.\n\nIncident Investigation\n\nThe intent of the incident investigation is to learn from past experiences and avoid future similar incidents. The incidents employees are expected to recognize and initiate the investigation process are the types of events that result or could have reasonably resulted in a major chlorine or sulfur dioxide release. That is what we may refer to as a \"near miss\" meaning that serious consequences did not occur, but could have.\n\nCompliance Audit\n\nThe POTW is required under EPA regulations to self-audit its procedures and practices for compliance with the regulations at least every three years to verify their adequacy and implementation. Self audits are to be documented. A report of the findings of all a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33107,
      "SummaryText": "udit are developed.\n\nThe POTW Superintendent or designee will determine and document a response to each deficiency identified in the compliance audit. Any deficiency noted in the audit will be corrected and documented as such.\n\nThe POTW will keep the two most recent compliance audit reports on file for internal purposes and EPA inspection.\n\nEmergency Response Plan\n\nAny time a chlorine or sulfur dioxide emergency is apparent or suspected, the operator in charge will initiate the procedure to assess the severity of the emergency. The procedure requires a minimum of two individuals to be present when an emergency is apparent or suspected. A minimum of \"Level B\" respiratory equipment will be required. The reason for a two party assessment is due to staffing levels.\n\nOnce the level of emergency has been assessed, the operator in charge will then make a determination as to what Action Response Procedure will be followed based on the information provided by the assessment. The operator in charge will immediately begin a record of the event.\n\nSmall leaks that are contained within the process building area may be repaired and alleviated through immediate action of trained POTW personnel. Large releases that may effect public and/or private receptors or risk personal injury to POTW personnel will be responded to by the Regional Hazmat Team (local fire department).\nPocatello POTW Executive Summary\n\n\n\nPocatello's POTW is located west of the city at 10733 Rio Vista Road. The POTW treats \n\nwastewater generated by the City of Pocatello, the City of Chubbuck, and some of the out lying\n\nBannock County areas. The processes include primary and secondary treatment with disinfection\n\nusing a final chlorination/dechlorination process prior to discharge to the Portneuf River. The City\n\nof Pocatello exceeds the threshold quantity for the chemicals chlorine and sulfur dioxide and must\n\ncomply with the mandated EPA Risk Management Plan (RMP).\n\n\n\nThe two major elements in the RMP for Pocatell"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33107,
      "SummaryText": "o are the off site consequence analysis for\n\nchlorine and sulfur dioxide, both worst case and alternative release, and a prevention program.\n\nPocatello's prevention plan includes information about safety, process hazards, operating\n\nprocedures, training programs, maintenance programs, audits, and accident investigations. The\n\noffsite consequence analysis for both the worst case release scenario and alternative release\n\nscenario were completed using EPA's RMP*Comp program. Pocatello used EPA's TRI Program\n\nto determine facility latitude and longitude.\n\n\n\nFive Year Accident History\n\n\n\nThere have been no accidental releases of chlorine or sulfur dioxide in the past five years. The\n\nobject of this plan is to continue this history and prevent any accidental releases and to respond\n\neffectively and timely in the unlikely event there is a release. Pocatello's RMP incident report\n\nform will be used in the unlikely event there is an accidental release.\n\n\n\nManagement System\n\n\n\nThe roles and responsibilities of the staff that oversee the risk management program elements will\n\nhelp to ensure effective communication about process changes between divisions; clarify the roles\n\nand responsibilities related to process safety issues; avoid confusion and allow team work; and\n\nensure that the program elements are integrated into an ongoing approach to identifying hazards\n\nand managing risks.\n\n\n\nPrevention Program (Program 2)\n\n\n\nPocatello's prevention plan has integrated the seven basic elements - safety information, process\n\nhazards analysis, operating procedures, training programs, maintenance programs, compliance\n\naudits, and accident investigations into a risk management system. Safety information is used to\n\nperform a process hazard analysis and the results of the analysis are used to revise and update\n\noperating and maintenance procedures. Training programs ensure employees understand and\n\nmanage risks are revised as needed and continued training is provided.\n\n\n\nEPA requires Pocat"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33107,
      "SummaryText": "ello to review and update its hazard review at least once every five years. The\n\nreview and all updates of the hazard review, as well as resolutions of any problems identified are\n\ndocumented.\n\n\n\nProcess Safety Information\n\n\n\nChlorine and sulfur dioxide have been used for many years for the chlorination/dechlorination\n\nprocesses at Pocatello's POTW. As references for chlorine and sulfur dioxide handling Pocatello\n\nuses \"The Chlorine Manual\" (The Chlorine Institute, 1986, 5th edition), \"Chlorine and Its\n\nProperties\" (Capitol Controls Company, Inc. 1990, Pub.No. 381-5), Sulfur Dioxide and Its\n\nProperties (Capitol Controls Company, Inc. 1989, Pub. No. 482-2), Material Safety Data Sheets\n\n(MSDS) BOC GASES, 1996, and Pocatello's \"Operating Procedures for Chlorine and Sulfur\n\nDioxide Cylinder Handling and Storage\", 1999.\n\n\n\nOperating Procedures\n\n\n\nOperating procedures and instructions are important for training personnel and insuring safe\n\noperations of the chlorine and sulfur dioxide systems. The standard operating procedures (SOPs)\n\nfor operating the chlorine and sulfur dioxide systems and associated equipment are located in the\n\noperations office, maintenance office, and the operators lab which are accessible to all plant\n\npersonnel. The SOPs cover everything from receiving the ton cylinders through valving the to\n\nvarious discharge points. SOPs include the start-up and shut down of all related handling\n\nequipment. SOPs are updated as needed.\n\n\n\nNew employees are given general training in the hazards as part of their plant employee\n\norientation. New operators are required to review and understand the SOPs and are given on the\n\njob training (OJT) on all chlorine and sulfur dioxide related tasks required as part of their\n\noperational duties. The maintenance employees also receive OJT before they are allowed to\n\nindependently work on the chlorine and sulfur dioxide systems.\n\n\n\nMaintenance\n\n\n\nWritten procedures for inspecting and testing are incorporated into a preventive "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 33107,
      "SummaryText": "maintenance\n\n(PM) program and have been in effect since the construction completion in 1992. The PM is\n\nconducted in accordance with the manufactures recommended procedures and sound engineering\n\npractices. The PM program is operated by a computer system that generates the needed\n\ninformation when a piece of equipment is in need of inspection or service.\n\n\n\nTechnical manuals for the process systems consist of three volumes which are current and located\n\nin the maintenance library.\n\n\n\nInitial training on the process systems were conducted by construction contractor and equipment\n\nmanufactures at completion of construction. Safety training requirements for maintenance\n\npersonnel are the same as for operations personnel.\n\n\n\nIncident Investigation\n\n\n\nThe intent of the incident investigation is to learn from past experiences and avoid future similar\n\nincidents. The incidents employees are expected to recognize and initiate the investigation process\n\nare the types of events that result or could have reasonably resulted in a major chlorine or sulfur\n\ndioxide release. That is what we may refer to as a \"near miss\" meaning that serious consequences\n\ndid not occur, but could have.\n\n\n\nCompliance Audit\n\n\n\nThe POTW is required under EPA regulations to self-audit its procedures and practices for\n\ncompliance with the regulations at least every three years to verify their adequacy and\n\nimplementation. Self audits are to be documented. A report of the findings of all audit are\n\ndeveloped.\n\n\n\nThe POTW Superintendent or designee will determine and document a response to each\n\ndeficiency identified in the compliance audit. Any deficiency noted in the audit will be corrected\n\nand documented as such.\n\n\n\nThe POTW will keep the two most recent compliance audit reports on file for internal purposes\n\nand EPA inspection.\n\n\n\nEmergency Response Plan\n\n\n\nAny time a chlorine or sulfur dioxide emergency is apparent or suspected, the operator in charge\n\nwill initiate the procedure to assess the sever"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 33107,
      "SummaryText": "ity of the emergency. The procedure requires a\n\nminimum of two individuals to be present when an emergency is apparent or suspected. A\n\nminimum of \"Level B\" respiratory equipment will be required. The reason for a two party\n\nassessment is due to staffing levels.\n\n\n\nOnce the level of emergency has been assessed, the operator in charge will then make a\n\ndetermination as to what Action Response Procedure will be followed based on the information\n\nprovided by the assessment. The operator in charge will immediately begin a record of the event.\n\n\n\nSmall leaks that are contained within the process building area may be repaired and alleviated\n\nthrough immediate action of trained POTW personnel. Large releases that may effect public\n\nand/or private receptors or risk personal injury to POTW personnel will be responded to by the\n\nRegional Hazmat Team (local fire department)."
    }
  ]
}