{
  "FacilityID": 33326,
  "FacilityName": "Pottstown Water Filtration Plant",
  "FacilityStr1": "668 Old Reading Pike",
  "FacilityStr2": null,
  "FacilityCity": "Stowe",
  "FacilityState": "PA",
  "FacilityZipCode": "19464",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42091",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "40.243500",
  "FacilityLongDecDegs": "-075.693972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pottstown Borough",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Borough of Pottstown Water Auth.",
  "OperatorStr1": "100 East High Street",
  "OperatorStr2": "City Hall",
  "OperatorCity": "Pottstown",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19464",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Maul",
  "RMPTitle": "Director of Utilities",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000095336",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-28 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 40.24316,
  "FRS_Long": -75.69226,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48072,
      "AltID": "Water treatment",
      "FacilityID": 33326,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 49166,
          "ProcessID": 48072,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 63461,
          "ProcessID": 48072,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 563461,
          "ProcessID": 48072,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33326,
      "SummaryText": "The Pottstown Borough Authority (PBA) Water Treatment Plant (WTP) located in Stowe, Montgomery County, is owned by the Pottstown Municipal Authority (PMA) and operated by the PBA located at Borough Hall, 241 King Street, Pottstown, Pennsylvania.  The plant intake is located along the Schuylkill River.\n\nThe Pottstown WTP was built in 1965 and is capable of treating up to 12 million gallons per day to the level required by the Pennsylvania Department of Environmental Protection (PADEP) and the Environmental Protection Agency (EPA).\n\nThe primary purpose of a WTP is to provide safe drinking water to the community.  The EPA?s Safe Drinking Water Act of 1974 established national minimum standards that all WTPs were required to meet.  The Pottstown WTP achieves these goals with filtration and proper disinfection of all incoming water.\n\na. The Pottstown WTP's accidental release prevention program is designed to ensure that the facility operates in compliance with the RMP Rule and with industry standards of performance, such as the guidance documents written by the Chlorine Institute.  The prevention program is based on the following key elements:\n\n - High level of training of the operators\n - Preventive maintenance program\n - Use of state-of-the-art process and safety equipment\n - Use of accurate and effective standard operating procedures, written with the participation of the operators\n - Performance of a hazard review of equipment and procedures\n - Implementation of an auditing and inspection program\n\nb. The disinfection facility for the Pottstown WTP is located on-site and was designed to disinfect the water entering and leaving the plant.  Chlorine is used to kill any pathogenic organisms before the drinking water is pumped to the distribution system.  A maximum of 10 one-ton containers (20,000 pounds) of chlorine may be stored onsite at any time, with 2 chlorine containers in use at any given time.  Containers that are connected in the process are located in a brick b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33326,
      "SummaryText": "uilding designed specifically and solely for the safe movement, storage and use of these regulated chemicals.\n\nc. Preventive maintenance is regularly scheduled and performed.  Trained, experienced personnel clean, service and replace pipes, valves, chlorinators, and other equipment, as needed.  Pigtails are replaced on a yearly basis.\n\nChemical-specific prevention steps include the availability of self-contained breathing apparatus (SCBA), awareness of the hazardous and toxic properties of chlorine, and the presence of a chlorine detector.\n\nd. There have been no accidental releases of chlorine in the past five years.\n\ne. The Pottstown WTP is not required to maintain a site-specific emergency response program, as defined by OSHA and EPA.  However, it does have an Emergency Plan which has been coordinated with the LEPC, which gives specific details regarding emergency contacts, potentially affected areas, evacuation routes, and other information regarding the WTP.  The WTP would contact the local fire department, APEX and the Montgomery County Local Emergency Planning Committee (LEPC) in the event of an accidental release, since it does not train its employees to handle such an emergency.\n\nf. Based on the hazard evaluation, the compliance audit, and other actions taken to prepare this RMP, a few areas were identified for improvement and changes were made to improve safety at the facility.  This included the following:\n\n - Writing a standard operating procedure for connecting and disconnecting containers;\n - A more formal documentation system for employee training;\n - Revising the preventive maintenance procedures;\n - Developing an Emergency Action Plan."
    }
  ]
}