{
  "FacilityID": 33383,
  "FacilityName": "The Glass Group Millville Operations",
  "FacilityStr1": "1300 Wheaton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Millville",
  "FacilityState": "NJ",
  "FacilityZipCode": "08332",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34011",
  "LEPC": "Millville City LEPC",
  "FacilityLatDecDegs": "39.407778",
  "FacilityLongDecDegs": "-075.034444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 121014109,
  "ParentCompanyName": "The Glass Group Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wheaton USA Inc.",
  "OperatorStr1": "200 G Street",
  "OperatorStr2": null,
  "OperatorCity": "Millville",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08332",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert LaMastro",
  "RMPTitle": "Manager Tech Srv& Env Affairs",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006771",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-29 00:00:00",
  "DeRegistrationEffectiveDate": "2006-03-01 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.41081,
  "FRS_Long": -75.03441,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48142,
      "AltID": null,
      "FacilityID": 33383,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 49236,
          "ProcessID": 48142,
          "NAICSCode": "32721",
          "_desc": {
            "NAICS_CODE": "32721",
            "NAICS_DESCRIPTION": "Glass and Glass Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 63545,
          "ProcessID": 48142,
          "ChemicalID": 55,
          "Quantity": 27520.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 563545,
          "ProcessID": 48142,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33383,
      "SummaryText": "Wheaton USA Inc. (Wheaton), located in Millville, New Jersey, is committed to ensuring a safe work environment for the employees and the community. To this end, the management strongly supports the implementation of safe procedures for all aspects of operation, including the one regulated process: hydrofluoric acid (HF acid). The facility fully complies with the regulation and intent of both the Environmental Protection Agency's (EPA) Risk Management Program (RMP) and the New Jersey Department of Environmental Protection's (NJDEP) Toxic Catastrophe Prevention Act (TCPA). The success of the facility's commitment is verified by the fact that there have been NO accidents which involve the HF acid system at any time since the system was installed.\n\nThe HF acid process deals with unloading, transporting and distributing HF acid into quantities used in Wheaton's glass frosting process. Wooden pallets on containment pallets are used to transport four 55-gallon drums at a time. Generally a shipment from Maryland Chemical consists of 10 pallets (40 drums). These drums are transported from the unloading area in Shed C (generally door 6) to a storage area known as Heavy Equipment Cage #58. Pallets are taken to be stored in the warming hallway in the building as needed. The acid room attendants or \"frosters\" then transport these drums into the \"new acid room\" and install the pump, which will be used to pump the HF into red 5-gallon buckets for use in the frosting process. Up to three red buckets are transported at a time to process lines A, B or C using a walk-behind push-cart. Here they are emptied one at a time into the HF acid mixing tank. Once the HF acid is added to the mixing tank, the concentration of HF is below 50% by weight and is not subject to the RMP regulations.\n\nAs part of the RMP requirements, facilities which contain a regulated substance (such as HF acid) at quantities exceeding 1,000-pounds must consider the impact of a worst-case and an alternate-case releas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33383,
      "SummaryText": "e of the substance. In order to determine the impact a release would have, Wheaton utilized procedures outlined in the RMP Offsite Consequence Analysis Guidance, USEPA, May 1996.\n\nBy definition, a worst-case release involves a catastrophic failure under the worst possible atmospheric conditions, and is therefore extremely unlikely. For this facility, the worst-case scenario is the failure of the 55-gallon HF acid drum. The evaporating HF acid released in this situation would reach offsite endpoints and nearby public receptors. The HF acid drums are stored in a protected and fairly isolated location, making a catastrophic failure all the more unlikely.\n\nThe alternate-case release which was evaluated involved the same conditions as the worst-case, only under typical meteorological conditions rather than worst-case.\n\nAs mentioned previously, this facility has had no accidents involving HF acid within the five-year accident history period. In fact, there has never been an HF acid accident during the history of the facility.\n\nWheaton does not have its own Emergency Response Program. Instead, the facility is included in the community emergency response plan developed under SARA Title III, Emergency Planning and Community Right-to-Know Act (EPCRA).\nA mutual aid organization, which includes the Millville Fire Department, will provide personnel for emergency response. Wheaton will provide technical assistance with response procedures and supplies necessary for the mutual aid organization to safely perform clean-up/containment responsibilities.\n\nWheaton is committed to continuously improving the overall safety and environmental performance record at the facility. Although no specific changes are currently planned, specific policies aimed at improving safety will be continually improved. These policies include continuing development of best management practices; conducting site- and job-specific training; and upholding the facility's goal for a safe workplace.\n\nIn summary, Whe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33383,
      "SummaryText": "aton is fully committed to the safe storage, use, and operation of the HF acid system utilized at the facility. The facility fully complies with the regulation and intent of both the TCPA rule and RMP regulations. As a result of effective facility planning, well-trained and capable employees, and implemented safety procedures, the facility has never had an accident involving the HF acid system."
    }
  ]
}