{
  "FacilityID": 33451,
  "FacilityName": "Diamond Walnut Growers, Inc.",
  "FacilityStr1": "1050 South Diamond Street",
  "FacilityStr2": null,
  "FacilityCity": "Stockton",
  "FacilityState": "CA",
  "FacilityZipCode": "95201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.948833",
  "FacilityLongDecDegs": "-121.253861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Diamond Walnut Growers, Inc.",
  "OperatorStr1": "1050 South Diamond Street",
  "OperatorStr2": null,
  "OperatorCity": "Stockton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Lescisin",
  "RMPTitle": "Director Environmental Affairs",
  "FTE": 650,
  "OtherEPAFacilityID": "CAD981448897",
  "EPAFacilityID": "100000106137",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "N 285",
  "SafetyInspectionDate": "2003-10-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-06-19 00:00:00",
  "DeRegistrationEffectiveDate": "2006-12-15 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 37.94796,
  "FRS_Long": -121.25683,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48216,
      "AltID": "Refrigeration",
      "FacilityID": 33451,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 49312,
          "ProcessID": 48216,
          "NAICSCode": "31199",
          "_desc": {
            "NAICS_CODE": "31199",
            "NAICS_DESCRIPTION": "All Other Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 63623,
          "ProcessID": 48216,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 563623,
          "ProcessID": 48216,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33451,
      "SummaryText": "\nDiamond Walnut Growers, Inc (Diamond Walnut), located in Stockton, California, uses approximately 11,000 lbs. of anhydrous ammonia as a refrigerant.  Based on the quantity of ammonia used Diamond Walnut was subject to the State of California, Program 3 Accidental Release Prevention (CalARP) Program and the Federal Level 3 Risk Management Plan (RMP).  On 21 June 1999, a Level 3 CalARP Program was submitted to the San Joaquin County, Office of Emergency Services, and Level 3 RMP information was submitted to the U.S. Environmental Protection Agency (EPA) via RMP*Submit software.  Facilities subject to the CalARP and RMP regulations are required to update the risk management programs at least once every five years and resubmit those programs to the respective agencies.  This submittal to the US EPA serves that purpose.\nThe initial process hazard analysis (PHA) of the ammonia process was completed in March 1994, a PHA review was completed in December 1998, and the most recent PHA review was completed on 3 June 2004.  The risk reduction measures completed since December 1998, as well as those developed during the June 2004 PHA reviews, are included in the five-year CalARP Program Update document submitted to the San Joaquin County, Office of Emergency Services.\nThe worst-case release and the alternative release scenarios for ammonia remain unchanged from those submitted in June 1999. The OCAs submitted at that time were based on the 1990 US Census data and the OCAs submitted as part of this update were based on the 2000 US Census data. \nDiamond Walnut has developed and implemented a Level 3 RMP since June 1999. The program components include process specific safety information, process hazard analyses, operating procedures, training, mechanical integrity, management of change, pre startup reviews, compliance audits, incident investigation, employee participation, hot work permits and contractor management.\nDiamond Walnut has an Emergency Response Program that includes sp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33451,
      "SummaryText": "ecific actions to be taken in response to an accidental release of anhydrous ammonia that includes responding to the release, evacuation procedures, and procedures for informing local public agencies and specialty contractors.  The Emergency Response Program also includes information on emergency health care.  The Stockton Fire Department is the primary local emergency response agency that Diamond Walnut coordinates the Emergency Response Program with.  The most recent training and coordination activities conducted with the Stockton Fire Department were on 7 October 2003 with the Fire Department?s HazMat Team.\nDiamond Walnut has not had releases of ammonia over the last five-year period that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  \nPlanned changes to improve safety include installing additional vapor monitors, additional pressure and temperature audible alarms, revising operator inspection procedures, and installing additional traffic barriers for the ammonia refrigeration system. The planned modifications are described in detail within the five-year CalARP Update document submitted to the County OES. Some of the planned modifications are scheduled for completion in 2004, and the remainder scheduled for completion no later than 3 June 2005."
    }
  ]
}