{
  "FacilityID": 33465,
  "FacilityName": "Merck & Co., Inc., Flint River Plant",
  "FacilityStr1": "3517 Radium Springs Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Albany",
  "FacilityState": "GA",
  "FacilityZipCode": "31705",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13095",
  "LEPC": "Dougherty County LEPC",
  "FacilityLatDecDegs": "31.500833",
  "FacilityLongDecDegs": "-084.128333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "NE",
  "FacilityURL": "www.merck.com",
  "FacilityEmailAddress": "judith_corbett@merck.com",
  "FacilityDUNS": 1317064,
  "ParentCompanyName": "Merck & Co., Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 1317064,
  "Company2DUNS": null,
  "OperatorName": "Merck & Co., Inc.",
  "OperatorStr1": "3517 Radium Springs Road",
  "OperatorStr2": null,
  "OperatorCity": "Albany",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31705",
  "OperatorZipCodeExt": null,
  "FTE": 459,
  "OtherEPAFacilityID": "31708MRCKC3517R",
  "EPAFacilityID": "100000118561",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "28330950022V020",
  "SafetyInspectionDate": "2003-11-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2007-02-26 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 31.500833,
  "FRS_Long": -84.128333,
  "FRS_Description": "NE CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48230,
      "AltID": "DSA",
      "FacilityID": 33465,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 63641,
          "ProcessID": 48230,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49327,
          "ProcessID": 48230,
          "NAICSCode": "325411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27597,
              "Process_NAICS_ID": 49327,
              "SafetyReviewDate": "2004-03-31 00:00:00",
              "PHA_Date": "2002-06-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Curbing",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-06 00:00:00",
              "TrainingReviewDate": "2004-03-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-30 00:00:00",
              "EquipmentInspectionDate": "2003-08-13 00:00:00",
              "EquipmentTested": "Anhydrous ammonia storage tank (TA-I-401)",
              "ChangeMgmtDate": "1998-07-08 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-10 00:00:00",
              "PreStartupReviewDate": "2004-02-26 00:00:00",
              "ComplianceAuditDate": "2002-06-14 00:00:00",
              "AuditCompletionDate": "2002-10-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-14 00:00:00",
              "HotWorkPermitReviewDate": "2001-09-24 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 40238,
                  "PreventionProgram3ID": 27597,
                  "ProcessChemicalID": 63641
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 48231,
      "AltID": "Methyl Formate Storage",
      "FacilityID": 33465,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 63642,
          "ProcessID": 48231,
          "ChemicalID": 124,
          "Quantity": 85000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49328,
          "ProcessID": 48231,
          "NAICSCode": "325411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33465,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-01 00:00:00",
    "ERTrainingDate": "2003-04-28 00:00:00",
    "CoordinatingAgencyName": "Albany Fire Department",
    "CoordinatingAgencyPhone": "2294313266",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33465,
      "SummaryText": "The Merck & Co., Inc. (hereinafter referred to as Merck) Flint River Plant is located in Albany, Georgia on a site that is approximately 800 acres and employs approximately 470 employees.  Merck produces bulk pharmaceutical compounds that include ZOCOR® (simvastatin), PRILOSEC® (omeprazole), COZAAR® (trityl losartan), HYZAAR® (Hydrochlorothiazide), and CRIXIVAN® (indinavir sulfate).\n\nMerck uses various raw materials in the manufacture of these compounds  including, but not limited to acids, bases, and flammables.\n\nTwo of these raw materials (i.e., anhydrous ammonia and methyl formate) are used in excess of the thresholds and are thus covered by the Risk Management Plan (RMP) regulations. Anhydrous ammonia is used in the manufacture of hydrochlorothiazide.  Methyl formate is used in the manufacture of omeprazole.\n\nThe concepts of the RMP regulations, which are prevention, detection and response, are not new to Merck.  Merck has implemented programs to prevent releases of compounds used at the facility.  Further, Merck¿s maintains equipment and procedures to quickly detect a release (if one were to occur), trained emergency response personnel and equipment to respond to any release.   Merck¿s management and employees have been committed to these prevention activities for many years.  In 1987, Merck started its formal process safety management (PSM) program which was five years before this same type of program was required by OSHA.  Merck¿s PSM program involves a detailed, step-by-step evaluation of every process.  At each point in the evaluation key questions are asked such as ¿What would happen if this equipment failed?¿, ¿What would happen if this instrument malfunctioned?¿, or  ¿What would happen if this operation was performed incorrectly?¿  By using this step-by-step hazard assessment, we are able to identify and prevent problems from occurring.\n\nThe facility has multiple layers of protection for safeguarding Merck's regulated processes which include trained op"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33465,
      "SummaryText": "erck's Fire Department is one of only two industrial fire departments in Georgia that meets all of the same certification requirements of municipal fire departments such as the City of Albany.  This is a significant accomplishment and one that took many hours of training and work for the Fire Department.  This high level of training and preparedness of our responders combined with some of the best fixed and mobile fire-fighting and emergency response equipment anywhere in Southwest Georgia makes for an excellent on-site emergency response capability.  \n\nIn addition, Merck has been actively involved in the leadership of the Local Emergency Planning Committee (LEPC).  This extends Merck's emergency response capabilities by coordinating our response activities with the local community responders.  Merck was involved early on in the formation of what is now the Albany/Dougherty Local Emergency Planning Committee (LEPC).  This organization was first formed as a Community Awareness and Emergency Response (CAER) committee in the mid 1980s.  Occasionally, Merck will participate in LEPC emergency drills to test its coordination between the plant's and the community¿s emergency response plans.  In-between drills, Merck will conduct its own in-plant drills and ¿table top¿ exercises to further improve the plant¿s readiness and ability to respond to an emergency. \n\nFurther, there are several requirements for information that must be included in the RMP.  One of these requirements is a 5-year accident history.  The facility is required to review any accidents involving a RMP compound from a ¿covered process¿ (as defined by the regulations) that may have occurred in the past 5 years (1999 ¿ 2004) that resulted in an injury, significant property damage, known off-site injuries, an evacuation, or property or environmental damage.  These records were reviewed and there were no events required to be included in the RMP 5-year accident history.  \n\nIn addition to the process safety mana"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33465,
      "SummaryText": "gement aspects of  the RMP, the regulations require a facility to perform two types of evaluations related to potential off-site impacts of a release of an RMP compound.   The first evaluation is referred to as the ¿worst case scenario.¿  This evaluation is described in detail by the RMP regulations and requires the assumption that the largest tank in the process releases its contents in a very short period (instantaneously for liquids and within 10 minutes for compressed gases).  It also requires the facility to assume that none of the layers of protection are used.  Finally, the RMP regulations require that a facility assume that all this happens during the worst possible weather conditions.  This scenario can be used as a screening tool for emergency response planning, even though it is highly improbable.  \n\nThe second evaluation (referred to as the ¿alternate case scenario¿) is more likely to occur than the ¿worst-case scenario¿ and allows the facility to consider the use of the active and passive mitigation systems.  This scenario allows an evaluation using more common and more reasonable types of potential events such as leaks from pipes, overfilling of the storage tank, releases that may occur during filling and releases due to the malfunction of pressure relief valves.  These types of events are more likely to happen and serve as much more useful information for emergency response planning.  The detection and emergency response systems that are in place can be considered in the evaluation of alternate case release scenarios.  Additionally, this scenario allows the consideration of alarm and interlock systems, water curtains, fixed fire protection, effective emergency response teams and operators trained in emergency response.  When these factors are considered, this would be more indicative of an actual event and greatly reduces the potential for an offsite impact.  Finally, the alternate case release scenario evaluations are performed using more likely weat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33465,
      "SummaryText": "her conditions.  Weather conditions can frequently have a big effect on a release of toxic or flammable compounds and this type of evaluation can provide scenarios that emergency responders are more likely to encounter.  \n\nMerck has used the EPA recommended RMP*Comp software program for all worst case scenario and alternate case scenario modeling.  RMP*Comp is an electronic version of EPA¿s Offsite Consequence Analysis Guidance and was chosen because it was provided by EPA for the purposes of preparing RMPs.\n\nSince the last RMP submission in 1999, Merck has automated the ammonia storage tank water curtain which is automatically activated by the sensors located around the tank.  This fixed protection system, along with our mobile fire truck and other fixed fire cannons combine to form a solid wall of protection in the event of a release of anhydrous ammonia. \n\nA total of eight alternate case scenarios regarding anhydrous ammonia storage and handling were evaluated.  None of these scenarios, when considering the layers of safety protection in place, resulted in an offsite impact.  These layers of protection include, trained operators who can quickly detect a release, ammonia sensors that can also detect a release, safety interlocks that are triggered on pressure sensors that can detect a drop in line pressure and automatically shut off flow of ammonia, high flow shutoff valves that limit the release of ammonia if a transfer line were to break, a water curtain that is automatically activated and will effectively scrub an ammonia release, and emergency response personnel who can further assist in controlling an ammonia release.  The fact that no alternate case release scenario resulted in offsite impacts is a very good indication that the multiple layers of protection, are appropriate prevention, detection and response measures for our anhydrous ammonia system.\n\nThe alternate case release scenario for anhydrous ammonia chosen for inclusion in this RMP was a line failure"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33465,
      "SummaryText": "resulting in a leak at just below setpoint of the high flow shutoff valves.  This scenario was chosen because it involves the largest release of anhydrous ammonia.  The layers of protection considered in this evaluation were: an interlock which prevents a release of this kind from occurring outside of the area protected by the water curtain; a concrete dike which will contain the released anhydrous ammonia while it evaporates and reduces the evaporation rate of the released pool; an automated water curtain which will effectively scrub vapors coming from the pool of released ammonia; and trained personnel who can stop the leak of ammonia once the released vapors are controlled.  Using the EPA recommended release evaluation software RMP*Comp and considering the layers of protection listed above, it was determined that this release scenario resulted in no offsite impact.\n\nMerck will continue to maintain the safety systems, equipment and state of readiness needed to protect its workers and the surrounding community.  Merck will continue to be involved in the LEPC to ensure that our emergency response activities are fully coordinated with community responders."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33465,
      "SummaryText": "erators, detailed operating procedures, using management of change procedures, issuing hazardous work permits, conducting safety audits, performing incident investigations and reviewing processes prior to start-up.  These different elements of PSM work together as an integral part of Merck's ability to manufacture active pharmaceutical ingredients safely. These elements also ensure that multiple layers of protection have been developed and implemented to prevent potential problems from happening.\n\nMerck has also implemented programs to detect releases at the facility.  For example, one layer of protection involves the use of monitoring systems.  In critical areas of the plant, Merck has specially designed sensors that will automatically detect a release 24 hours a day, 7 days a week.  For anhydrous ammonia, sensors have been strategically installed along the entire storage and transfer system.  In addition, the facility is monitored around the clock by trained operating and response personnel.  These response personnel are trained in the process and equipment operation, potential impact of the hazards posed by the regulated compounds and emergency response.  These employees are trained to know what to look for and steps to take if there is an event that deviates from standard operating procedures.  Additional monitoring and detection systems at Merck, include the distributive control systems with monitoring instruments, and round the clock video monitoring of process areas.  All of these people, procedures, equipment and systems combine to ensure that if a release were to occur, it will be detected and addressed quickly.\n\nAnother layer of protection is Merck¿s ability to respond to an emergency.   Since the mid 1970s, Merck has maintained a trained on-site emergency response team.  In fact, Merck¿s in-plant fire department, which is manned by operators, mechanics and engineers who volunteer as firefighters, have achieved the status of a certified Fire Department.  M"
    }
  ]
}