{
  "FacilityID": 33603,
  "FacilityName": "Onondaga County Resource Recovery Facility",
  "FacilityStr1": "5801 Rock Cut Road",
  "FacilityStr2": null,
  "FacilityCity": "Jamesville",
  "FacilityState": "NY",
  "FacilityZipCode": "13078",
  "Facility4DigitZipExt": "9408",
  "FacilityCountyFIPS": "36067",
  "LEPC": "Onondaga County LEPC",
  "FacilityLatDecDegs": "43.002778",
  "FacilityLongDecDegs": "-076.098889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Covanta Onondaga, L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Covanta Onondaga, L.P. (operator)",
  "OperatorStr1": "5801 Rock Cut Road",
  "OperatorStr2": null,
  "OperatorCity": "Jamesville",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13078",
  "OperatorZipCodeExt": "9408",
  "FTE": 44,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000069285",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "7-3142-00028",
  "SafetyInspectionDate": "2006-06-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Air Pollution Control",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-06-04 00:00:00",
  "DeRegistrationEffectiveDate": "2018-04-30 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 43.004785,
  "FRS_Long": -76.11473,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48440,
      "AltID": "SNCR",
      "FacilityID": 33603,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 63906,
          "ProcessID": 48440,
          "ChemicalID": 56,
          "Quantity": 55600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49547,
          "ProcessID": 48440,
          "NAICSCode": "562213",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27729,
              "Process_NAICS_ID": 49547,
              "SafetyReviewDate": "2009-05-14 00:00:00",
              "PHA_Date": "2009-05-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Storage and process use areas detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-09 00:00:00",
              "TrainingReviewDate": "2004-03-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-05-14 00:00:00",
              "EquipmentInspectionDate": "2004-06-14 00:00:00",
              "EquipmentTested": "10 year tank inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-03-09 00:00:00",
              "PreStartupReviewDate": "1994-11-01 00:00:00",
              "ComplianceAuditDate": "2005-03-22 00:00:00",
              "AuditCompletionDate": "2005-08-07 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-03-09 00:00:00",
              "HotWorkPermitReviewDate": "2009-03-20 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-18 00:00:00",
              "ContractorSafetyEvalDate": "2009-03-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 40408,
                  "PreventionProgram3ID": 27729,
                  "ProcessChemicalID": 63906
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33603,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-07-08 00:00:00",
    "ERTrainingDate": "2008-10-22 00:00:00",
    "CoordinatingAgencyName": "LEPC",
    "CoordinatingAgencyPhone": "3154352525",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33603,
      "SummaryText": "1.0  EXECUTIVE SUMMARY\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY SUMMARY\n\nThe United States Environmental Protection Agency (USEPA) has established a regulatory program to prevent accidental releases of certain regulated substances that may potentially affect public health and the environment. The rule (40 CFR Part 68) requires that some 66,000 facilities across the United States in various industries develop a Risk Management Program (RMP). The RMP incorporates various required elements into a program designed to prevent accidental releases of regulated substances and establish emergency response preparedness in the event of an accidental release of such regulated substances. RMPs must be submitted to the USEPA by the owner or operator of any facility that has a process containing more than a threshold quantity of any of the regulated substances that is covered under the RMP rule. Pursuant to the RMP rule, the Onondaga Resource Recovery Facility (\"OCRRF\" or \"the Facility\"), operated by Covanta Onondaga, Limited Partnership has submitted this RMP for anhydrous ammonia. \n\nAnhydrous ammonia is a commonly used chemical with various applications in industry and agriculture. By volume, anhydrous ammonia is the fourth largest industrial chemical produced over 80% of which goes to agricultural fertilizers. In addition to anhydrous ammonia application as a fertilizer in crop production, some other common uses for anhydrous ammonia include: food production and processing, textile and chemical manufacturing, refrigeration (such as refrigerated warehouses), metal treating and as an air pollution control reagent.   \n\nAnhydrous ammonia is used at the Facility exclusively as a reagent in the facility's nitrogen oxide (NOx) control system. The NOx control system is an important part of the Facility's sophisticated air pollution control equipment that reduces nitrogen oxides to a level below the limit contained in the Facility's Title V air permit. Nitrogen o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33603,
      "SummaryText": "xides are pollutants that contribute to acid rain and photochemical smog. Nitrogen oxide (NO) is a colorless gas produced during high temperature combustion. In ambient air, nitrogen oxide is oxidized to nitrogen dioxide (NO2). Nitrogen dioxide reacts with water in ambient air to form nitric acid, which contributes to the formation of acid rain; and, nitrogen oxides also contribute to the formation of photochemical smog by reacting with sunlight to form ozone (O3) in the atmosphere. The Facility's NOx control system reduces nitrogen oxides by the injection of anhydrous ammonia into the furnace section of the boilers. In the boilers, a reaction takes place between the anhydrous ammonia, nitrogen oxide and oxygen. The resulting products of this reaction are the major components in the air we breathe, nitrogen gas (N2), oxygen and water. A significant environmental benefit is achieved through the use of anhydrous ammonia in the operation of the NOx control system.\n\nCovanta operates the Facility, which is located in Jamesville, New York in a manner that is protective of the health and safety of OCRRF employees, contractor employees, the public and the environment. In addition, Covanta is committed to operating the Facility in full compliance with applicable Occupational Safety and Health Administration (OSHA) requirements, federal regulatory requirements and applicable state and/or local requirements.\n\nCovanta previously developed an OSHA Process Safety Management (PSM) Program for anhydrous ammonia. The OSHA PSM rule guides employees in the preventive maintenance, safe management and operation of processes that use regulated substances, and aims to protect employees from accidental releases of these materials onsite. The USEPA's RMP regulation builds and expands upon the OSHA PSM program by requiring facilities to evaluate offsite impacts to public and environmental receptors, in the event of an accidental release. Key elements of the OSHA PSM program have been incorpo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33603,
      "SummaryText": "rated into the USEPA RMP regulation.\n\nAs part of the USEPA RMP effort, Covanta updated the PSM program for anhydrous ammonia and the associated Process Hazard Analysis (PHA). Among the other important components of the RMP are systems of policies and procedures for operation and maintenance of the facility, and the facility-specific Emergency Response Plan (ERP). Covanta has operated the regulated process for a number of years without a release due to these solid preventive maintenance programs, safe design and operating practices, and established training programs.  \n\nThe Facility Manager has the primary responsibility for this RMP and its implementation.\n\n\n1.2  STATIONARY SOURCE DESCRIPTION\n\nThe OCRRF is a waste-to-energy (WTE) facility that burns municipal solid waste and recovers steam to produce electricity. Each day, this WTE facility reduces the volume of approximately 990 tons of solid waste by more than 90%, while converting the otherwise waste energy into electricty.\n\nOne process at the Facility involves the use of a substance regulated under 40 CFR Part 68, thereby requiring the preparation and implementation of an RMP. This covered process is the NOx control system (discussed in Section 1.1 above) which utilizes anhydrous ammonia injection for NOx control.  The specific NOX control system utilized at OCRRF is a Selective Non-Catalytic Reduction (SNCR) system. Anhydrous ammonia is the reagent utilized in the Facility's NOx control system in order to significantly reduce nitrogen oxide emissions, as discussed above. \n\nAnhydrous ammonia is stored at the Facility. Administrative controls are used to limit the tank capacity to 85%.\n\nBoth passive and active mitigation measures are used at the Facility to limit the likelihood and/or severity of an accidental release of anhydrous ammonia. Passive mitigation systems do not require human, mechanical or energy input, such as the concrete dike that surrounds the storage tank area. Conversely, active mitigation syste"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33603,
      "SummaryText": "ms do require human, mechanical or energy input for initiation. Leak detectors and alarms, excess flow valves, pressure relief valves, emergency shut-off devices and the water sprinkler system are examples of the active mitigation systems in place at OCRRF. \n\n1.3   WORST CASE AND ALTERNATIVE CASE ACCIDENTAL RELEASE SCENARIOS\n\nA summary of the off-site consequence analysis (OCA) for the worst-case and alternative release scenarios is no longer required to be included in the executive summary.  While the RMP rule originally required that the executive summary briefly describe the OCA for the worst-case and alternative release scenarios, the USEPA amended the RMP rule in 2004 to remove this requirement because of security concerns.\n\n1.4  ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Facility has an accidental release prevention program that is based upon a foundation of employee awareness and proactive system maintenance.  This program is documented in the RMP, and meets the requirements of the RMP regulation.\n\nThe Facility provides process safety information to employees through written materials, such as Material Safety Data Sheets, various operating and maintenance manuals, system descriptions and safety procedures. Employees attend periodic training and contractors are briefed on process hazards prior to working onsite. Preventive maintenance and regular inspections are conducted for maintaining mechanical integrity. Inspections and testing are scheduled through the preventive maintenance program.  Hazard analysis documents are reviewed periodically and updated as required. Compliance audits are used to evaluate the need for revising or updating the procedures related to the processes.\n\n\n1.5  FIVE-YEAR ACCIDENT HISTORY\n\nFor the five years prior to the submission of this RMP, there have been no accidental releases, as defined in 40 CFR Part 68.42(a) at the Facility, which resulted in injuries or death to onsite (i.e., Facility or contractor employees) or offsite (i.e.,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33603,
      "SummaryText": "the public). Since there has not been an accidental release, there has not been a need for sheltering in place or evacuation; nor has damage to property or environmental receptors ever occurred as a result of an accidental release. In fact, Covanta has operated the Facility in the safest possible manner since it has commenced operations.\n\n\n1.6  EMERGENCY RESPONSE PROGRAM\n\nThe Facility has an Emergency REsponse Plan (ERP) that defines the sequence of actions to be taken by OCRRF employees in the event of an accidental release of anhydrous ammonia. This ERP has been communicated to the local Fire Department and Local Emergency Planning Committee (LEPC). Individuals who are likely to witness or discover a release have been trained to initiate an emergency response sequence by notifying the proper authorities. It is currently OCRRF's policy that individuals that have received the requisite training will attempt to secure a release of anhydrous ammonia if the action can be taken without significant risk of injury or death. The Incident Commander from the local emergency response agency is presently responsible for determining when sheltering-in-place or evacuation of off-site areas is necessary, and also for public notification.\n\n1.7  PLANNED CHANGES TO IMPROVE SAFETY\n\nThis RMP incorporates existing Facility procedures, which are designed to improve employee safety awareness and enhance safe operations.  Further, emergency response procedures have been reviewed and coordinated with local response entities to increase the speed and effectiveness of a response by outside agencies, should a release occur. \n\nFOOTNOTE\n\n1  J.Harte, C.Holdren, R.Schnieder and C.Shirley. Toxics A to Z ¿ A Guide to Everyday Pollution Hazards, 1991, University of California Press, 479 pps."
    }
  ]
}