{
  "FacilityID": 33720,
  "FacilityName": "Sault Ste. Marie Water Treatment Facility",
  "FacilityStr1": "West 24th Street",
  "FacilityStr2": "West 4th Ave.",
  "FacilityCity": "Sault Ste. Marie",
  "FacilityState": "MI",
  "FacilityZipCode": "49783",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26033",
  "LEPC": "Chippewa County LEPC",
  "FacilityLatDecDegs": "46.487639",
  "FacilityLongDecDegs": "-084.417028",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 184663300,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Sault Ste. Marie",
  "OperatorStr1": "325 Court Street",
  "OperatorStr2": null,
  "OperatorCity": "Sault Ste. Marie",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49783",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000146488",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 46.48764,
  "FRS_Long": -84.41703,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48593,
      "AltID": "Water Chlorination",
      "FacilityID": 33720,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 64105,
          "ProcessID": 48593,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49707,
          "ProcessID": 48593,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27801,
              "Process_NAICS_ID": 49707,
              "SafetyReviewDate": "2004-04-05 00:00:00",
              "PHA_Date": "2004-04-05 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-05 00:00:00",
              "TrainingReviewDate": "2004-04-05 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-05 00:00:00",
              "EquipmentInspectionDate": "2004-06-07 00:00:00",
              "EquipmentTested": "Chlorination Equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-04-05 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-04-05 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Sault Ste. Marie Water Treatment Plant's prevention program is based upon the OSHA Process Safety Management of Highly Hazardous Chemicals Rule.  We rely on employee involvement on all aspects of the prevention program.  All procedures, equipment, maintenance, and training are reviewed on a continuous basis to keep us alert of the dangers of chlorine and how we can continue to safely apply it to our drinking water.",
              "_chemicals": [
                {
                  "PrimaryKey": 40522,
                  "PreventionProgram3ID": 27801,
                  "ProcessChemicalID": 64105
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33720,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2004-06-01 00:00:00",
    "CoordinatingAgencyName": "Chippewa County OES",
    "CoordinatingAgencyPhone": "9066356350",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33720,
      "SummaryText": "The City of Sault Ste. Marie\nWater Treatment Facility \nRisk Management Plan \nExecutive Summary\n\n\nThe following is the City of Sault Ste. Marie Water Treatment Plant?s Executive Summary of our Risk Management Plan.  It is the #1 priority of the City of Sault Ste. Marie Water Treatment Plant to ensure that our citizens source of high quality and plentiful drinking water does not cause a chemical release to harm them, their families, or their property.\n\nThis Executive Summary is submitted in eight segments.  It was created to both satisfy the Section 112r requirements and to assure our citizens of the great care taken in their protection from a release of the chlorine that is beneficial to the disinfection of their drinking water.\n\nThis Executive Summary was written by the management of the Water Treatment Plant.  It summarized the overall safety programs that all Water Treatment staff created, maintain, update, and train for.  In no way is it intended to provide all the safety measures and programs at the Water Treatment Plant.  It is an overview to provide our customers with chlorine information and to satisfy the risk management plan requirements.\n\nThe staff of the Water Treatment Plant live in the City of Sault Ste. Marie.  The citizens of Sault Ste. Marie are our family, friends, and neighbors.  Their protection from an accidental release of chlorine has been, is, and shall remain to be of the utmost importance to us.\n\nI.  The Water Treatment Facility \n\nThe City of Sault Ste. Marie has approximately 15,000 residents who reside within it?s 15 square miles.  The City?s boundaries are the St. Mary?s River on the East, North, and West sides and 3 mile Road as it?s Southern border.\n\n \nThe citizens of Sault Ste. Marie have been served with municipally supplied drinking water for more than a century.   The City currently owns and operates a state of the art ?direct filtration? complete treatment water plant that was commissioned in 1993.  It is capable of treating and de"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33720,
      "SummaryText": "livering 6 million gallons of high quality drinking water per day.  The current facility replaced a water treatment plant that was commissioned in 1902.\n\nThe Water Treatment Plant continues to use liquid chlorine for disinfection of it?s water supply.  The City of Sault Ste. Marie has used liquid chlorine for water disinfection for over 50 years.  The management and staff have a combined total of over 3/4 of a century of liquid chlorine experience.  We are very knowledgeable in it?s use and extremely aware of the inherent dangers of it?s presence.\n\nThe Water Treatment Plant is located at 1634 W. 24th Street.  The plant is situated in a large, heavily wooded tract of land.  It?s raw water source is the St. Mary?s River located to the North of the plant.  A 36\" intake pipeline is located 1600 feet offshore and 4 vertical turbine pumps deliver the raw (untreated) water to the plant.\n\nChlorine is added to the raw water to kill any pathogenic organisms that may be present.  The water then is coagulated, mixed, filtered, fluoridated, stabilized, stored and then delivered to the citizens of Sault Ste. Marie.  Both in-house and outside laboratory analysis is performed on our water during all stages of treatment.  It should be noted that disinfection is by far the most important aspect of treating our water.\n\nThe chlorination equipment at the Water Treatment Plant was installed during the construction of the facility and first used in 1993.  The chlorine system was purchased from RS Technical Services of Lowell, Michigan.  The entire system was manufactured by Wallace & Tiernan.  All components in our chlorine system are compatible with each other because they were designed as a package system by Wallace & Tiernan.\n\nOur chlorine system is inherently safer than earlier chlorination systems because it transports gaseous chlorine throughout the chlorination system by vacuum, instead of container pressure.  In the event of a chlorine line break, vacuum would drop off, shutting o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33720,
      "SummaryText": "ff the gas flow from the ton container.\n\nOur chlorine is stored in ton containers.  The ton containers are stored and used in the Chlorine Storage Room.  The Chlorine Storage Room was designed and is used specifically for ton containers.  It is kept at a temperature of 55 to 65 degrees year round.  The Chlorine Storage Room is kept locked at all times and has a sensitive alarm system that activates in the event of the most minute chlorine leak.  The maximum inventory capability is eight ton containers, although normal inventory levels are often less then half that amount.\n\n \nAttached to the active ton containers are vacuum regulator/check units.  Gaseous chlorine under pressure enters the vacuum regulator.  If vacuum is present in the upstream chlorine line from the injector, the check unit opens and vacuum draws the chlorine to the chlorinators.  In the event of a chlorine line breaking, vacuum will drop, thus closing the check unit portion.  This action will shut off the chlorine supply from the tank.  The chlorine then flows to the chlorinators.  The 4 Wallace & Tiernan chlorinators meter, control, and inject the chlorine gas into the water supply.\n\nThe injector portion of the chlorinator mixes the gaseous chlorine with water to form a chlorine solution and delivers the solution to the point of application in the water treatment process.  The injector also supplies the vacuum that draws the gaseous chlorine through the chlorination system.\n\nII.  Regulated Substances\n\nOur chlorine supply is the only substance that falls under the Section 112r regulations.  Our chlorine is also regulated under OSHA?s Process Safety Management of Highly Hazardous Chemicals.\n\nChlorine is considered a toxic substance and has a characteristic, penetrating, and irritating odor.  The gas is greenish-yellow in color and the liquid is clear amber in color.  Gaseous chlorine is heavier than air and will sink to lower levels in a release.  It is non-flammable and alone it is stable, but it i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33720,
      "SummaryText": "s a strong oxidizer and will and can react with a variety of hydrocarbons and metals.\n\nChlorine gas is primarily a respiratory irritant.  At chlorine concentrations above 5 parts per million, the gas is very irritating.  At concentrations near the threshold of smell (well below 1 part per million for most people) chlorine gas will, after several hours of exposure, cause mild irritation of the eyes and the respiratory tract.  In extreme cases of chlorine inhalation, difficulty in breathing can progress to the point of death through suffocation.\n\nLiquid chlorine in contact with eyes or skin will cause local irritation and/or burns.\n\nIII.  The Accidental Release Prevention and Emergency Policies at the Water Treatment Plant.\n\nThe Sault Ste. Marie Water Treatment Facility takes a many-faceted approach to the safe handling of our chlorine and chlorination equipment.  We follow OSHA?s Process Safety Management of Highly Hazardous Chemicals rule to assist us in our use of chlorine.\n\n \nOur chlorine safety program begins with employee involvement.  All Water Treatment Plant employees have a hand in it?s formation, implementation, and application.  We have bi-monthly safety meetings held on the first and third Wednesdays of each month.  These meetings also cover other topics related to chlorine safety, such as lock-out/tag-out, and personal protective equipment.  Employees are encouraged to bring new safety issues to the meeting.\n\nIt is a goal of the Water Treatment Plant management and the City of Sault Ste. Marie to have a well trained workforce who can safely, correctly, and quickly respond to any situation by relying on their previous training and common sense to overcome any hazardous situation that may confront them.  Training is the key to this goal, so all employees receive documented training on all our operating procedures.  No employee can work a shift alone until they have become fully trained.\n\nOur operating procedures are annually reviewed by the staff to make s"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33720,
      "SummaryText": "ure they reflect any changes made to the operations or equipment.  Our operating procedures are also checked to see if they could be made safer or more efficient.\n\nWe have an extensive maintenance program at the Water Treatment Plant.  All chlorination equipment?s maintenance requirements are documented and scheduled.  Procedures, in accordance with the equipment?s manufacturer, were written for all maintenance activities, and qualified personnel only work on our chlorination equipment.  If an employee finds, or suspects a piece of equipment not to be performing up to specifications, it shall be removed from service and a work order made out to notify maintenance personnel of the problem.  All work orders relating to our chlorination equipment receive the highest priority.\n\nThe staff performed a Process Hazard Analysis on our chlorination system and all it?s components and procedures.  We used the ?What If? method and wrote numerous ?What If? scenarios.  We answered the scenarios as a group and now include them in our operating procedures and our contingency plan.\n\nIn short, Sault Ste. Marie Water Treatment Plant employees are trained in Process Safety Management, Process Hazard Analysis, operating procedures, maintenance procedures, standard safety practices, and safe work practices on a continuing basis to guard against the possibility of a chlorine release.  In the unlikely event of a chlorine release, the staff is trained in stopping and repairing the release and to know when to call in outside help if necessary. \n\nIV.  Worst Case Chlorine Release Scenario\n\n \nOur worst case scenario for chlorine release is the complete release of a full ton container in 10 minutes, which represents a release rate of 200 lbs of chlorine per minute.\nThe model we used for our worst case is the ?EPA?s RMP Guidance for Wastewater Treatment Plants? reference tables and equations.  The conditions in the worst case are a class F atmospheric stability, 50% relative humidity at 250 C with"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33720,
      "SummaryText": " a wind speed of 1.5 meters per second.  The height of the release is at ground level.  Even though we have a relatively low population in the surrounding area of the Water Treatment Plant, we selected the ?urban? topography as directed in the RMP Submit instructions because of the heavily wooded surroundings that represent obstructions.\n\nThe endpoint for our worst case is 1.3 miles.  Offsite consequences from the worst case include an effected population of 1600 people.  Within the 1.3 mile radius is an elementary school, residential housing, and a City-owned recreational area and park.\n\nThe worst case scenario is highly unlikely due to our vacuum operated chlorination equipment and the fact that we feed chlorine in the gaseous form, not the liquid form.  To get the volume of release calculated in the worst case scenario, a ton container would have to vent chlorine through an opening in the thick, steel container wall, which is very unlikely, or by breaking off the lower valve or fusible plug below the liquid line of the container.  Due to the staff?s extreme care and extensive training in the handling of the ton containers, this is also highly unlikely.\n\nV.  Alternate Chlorine Release Scenario\n\nOur Alternate release scenario is designed to represent the most likely type of chlorine release.  It estimates the loss of gaseous chlorine if a 1/4\" line was broken and it released gaseous chlorine at a rate of 9 lbs per minute for 10 minutes.  It also represents weather conditions that are more frequent at the Water Treatment Plant; a 3 meter per second wind speed with a class D atmospheric stability.  All other data is the same as in the worst case scenario.\n\nThe endpoint for our alternate release scenario is 0.1 miles.  A 0.1 mile radius contains an estimated population of 20 people.  The alternate release scenario model is from the ?EPA?s RMP Guidance for Wastewater Treatment Plant?s\n\nThe chance of breakage on a 1/4\" chlorine line is very remote.  Strictly followed pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 33720,
      "SummaryText": "ocedures, extensive training, and excellent preventive maintenance are just some of the tools our staff uses to prevent even the smallest of chlorine leaks from occurring.\n\nVI.  5 Year Accident History\n\n \nThe City of Sault Ste. Marie Water Treatment Plant has never had a release of chlorine since the plant was commissioned in 1993.\n\nVII.  Emergency Response Plan\n\nOur emergency response to a chlorine leak can be broken down into two parts: small releases that can be stopped and repaired in-house and larger leaks, where it is beyond the capabilities of the Water Treatment Plant staff to deal with alone.\n\nSmall releases are those that chlorine does not leave the Water Treatment Plant?s grounds.  These type of releases are stopped and repaired by the Water Treatment Plant staff by shutting down the chlorination system and the treatment process.  The Water Treatment Plant staff has an intimate knowledge of all aspects of our chlorination system and receive training in leak repair, chemical safety and Self Contained Breathing Apparatus (SCBA).\n\nFor larger releases that endanger areas beyond the Water Treatment Plant?s grounds, the staff shall immediately contact outside help to assist us in controlling the emergency situation.  The outside help is the Chippewa County Office of Emergency Services.  We shall invoke the Emergency Operations Plan for Chippewa County and notify and/or evacuate the public and prevent the release from becoming larger.\n\nParticipants of the Chippewa County Emergency Operations Plan are:\n\n1.  Office of Emergency Services\n2.  City of Sault Ste. Marie Pubic Works Department\n3.  City of Sault Ste. Marie Police Department\n4.  City of Sault Ste. Marie Fire Department\n5.  Chippewa County Sheriffs?s Department\n6.  Michigan State Police\n7.  War Memorial Hospital\n8.  Sault Area Schools\n9.  United States Coast Guard\n10.  City of Sault Ste. Marie City Hall Personnel\n11.  Chippewa County Health Department\n\nThe Chippewa County Emergency Operations Plan states d"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 33720,
      "SummaryText": "uties for each of the above participants in the event of a toxic release, with the Police and Fire Departments performing the notification and/or evacuation if necessary.\n\n \nThe Water Treatment Plant?s staff?s primary duties during a large chlorine release is to immediately notify the Office of Emergency Services by calling 911.  The 911 switchboard will activate Emergency Services.  The Water Treatment Plant staff shall provide all necessary information to prepare the responding agencies to take the proper actions.  \n\nThe Water Treatment Plant staff shall make every effort to safely contain and stop the release using the proper techniques, personal protective equipment and our Chlorine Repair Kit ?B? which has the capability to repair any type of release from a ton container.  The Water Treatment Plant staff are regularly trained in the use of all emergency equipment.\n\nVIII.  The Future of the Water Treatment Plant?s Chlorination & Operation of Chlorination Equipment.\n\nThe City of Sault Ste. Marie Water Treatment Plant has no current plans to replace the chlorine disinfection with ton containers.\n\nWe could switch to 150 lbs cylinders and thus relieve us of these Risk Management requirements, but it is the opinion of the management and staff that the risk of a chlorine leak is greater with the smaller cylinders than our current practices simply because we would have to change them more often, providing more opportunity for our alternate release scenario to occur.\n\nOur primary mission is to provide safe and plentiful drinking water to our fellow citizens and our current chlorination equipment is the most economical and effective way of meeting this goal.  Our multi-faceted approach to chemical safety and our well trained and conscientious employees compensate for any inherent dangers present from the chlorine that is beneficial to the health of our water customers.\n\n\nJames Moreau\nWater Treatment Superintendent"
    }
  ]
}