{
  "FacilityID": 33760,
  "FacilityName": "Engelhard Corporation",
  "FacilityStr1": "1729 East Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Erie",
  "FacilityState": "PA",
  "FacilityZipCode": "16503",
  "Facility4DigitZipExt": "2367",
  "FacilityCountyFIPS": "42049",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.130556",
  "FacilityLongDecDegs": "-080.047222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.engelhard.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 41399403,
  "ParentCompanyName": "Engelhard Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Engelhard Corporation",
  "OperatorStr1": "1729 East Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Erie",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16503",
  "OperatorZipCodeExt": "2367",
  "FTE": 89,
  "OtherEPAFacilityID": "PAD041399403",
  "EPAFacilityID": "100000092106",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-03-07 00:00:00",
  "DeRegistrationEffectiveDate": "2005-12-31 00:00:00",
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 42.131944,
  "FRS_Long": -80.045833,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 48678,
      "AltID": "Maleic Catalyst",
      "FacilityID": 33760,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 64197,
          "ProcessID": 48678,
          "ChemicalID": 54,
          "Quantity": 42000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 49792,
          "ProcessID": 48678,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 27849,
              "Process_NAICS_ID": 49792,
              "SafetyReviewDate": "2000-07-26 00:00:00",
              "PHA_Date": "2004-09-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-01-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Blow-out panels",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-22 00:00:00",
              "TrainingReviewDate": "2003-12-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-05 00:00:00",
              "EquipmentInspectionDate": "2002-10-02 00:00:00",
              "EquipmentTested": "Tube Trailer Transfer System",
              "ChangeMgmtDate": "2004-05-26 00:00:00",
              "ChangeMgmtReviewDate": "2003-05-27 00:00:00",
              "PreStartupReviewDate": "2004-04-15 00:00:00",
              "ComplianceAuditDate": "2003-06-12 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-01-12 00:00:00",
              "InvestigationChangeDate": "1999-05-15 00:00:00",
              "ParticipationPlansReviewDate": "2003-05-28 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-27 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-01-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 40566,
                  "PreventionProgram3ID": 27849,
                  "ProcessChemicalID": 64197
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 33760,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-15 00:00:00",
    "ERTrainingDate": "2003-12-31 00:00:00",
    "CoordinatingAgencyName": "Erie County Emerg. Mgt. Agency",
    "CoordinatingAgencyPhone": "8148701911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "EPA NPDES Reg @ 40 CFR 122; PADEP Titles 25 and 34."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 33760,
      "SummaryText": "ACCIDENT RELEASE PREVENTION AND EMRGENCY RESPONSE POLICIES\n\nEngelhard Erie has a long and proud history of safe operations and commitment to our employees and the community.  Engelhard, as a responsible corporate citizen, is committed to respecting the environment in the conduct of its business and recognizes the need to preserve and protect our vital natural resources.  Environmental protection plays a key role in Engelhard's business objectives and is an integral component of all daily operations.  We are routinely inspected by the Pennsylvania Department of Environmental Protection (PADEP) for our compliance with all applicable air, water, and waste regulations.  There have been no incidents of non-compliance.  Similarly, we have a good record with the City of Erie Bureau of Sewers on our wastewater compliance.  The site also complies with the applicable Occupational Safety and Health Administration (OSHA) Process Safety Management Standards for the regulated processes.  The site is International Standard Organization (ISO) 9000-2000 certified.  Most importantly, we have not had any accidental releases of a regulated hazardous substance in the past five years.\n\nEngelhard Erie is an active part of the Erie County Emergency Management Agency's Emergency Response Program for the Erie, Pennsylvania, community.  Site personnel serve in the leadership of the Erie County Local Emergency Planning Commission (LEPC) and we routinely invite the Local Fire Department to our site to review our operations and to educate them on the chemicals we use.  We have trained twenty site personnel to the Operations and Technician levels as Hazardous Waste Operations and Emergency Response (HAZWOPER) First Responders.  We have a strong internal safety awareness training program and detailed response plans to cover emergency situations.  We will work in cooperation with the appropriate emergency response services available in the community to meet any challenge.  The site has an approved"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 33760,
      "SummaryText": "detailed emergency plan on file with the Erie County LEPC and is in compliance with the EPA's Emergency Response Program requirements.\n\nSTATIONARY RESPONSE AND REGULATED SUBSTANCE HANDLED\n\nThe Engelhard Erie facility manufactures nickel, vanadium, copper, chrome, and noble metal-based catalysts.  These catalysts are used in the food and petrochemical industries.  Anhydrous Hydrogen Chloride (AHCL), which is on the RMP regulated substance list, is used as a raw material in the manufacture of just two of our many different catalyst products.  These two products are members of a family of catalysts that are manufactured in a single facility covered by OSHA's Process Safety Management program.  The Erie Plant typically operates on a 24 hour per day, seven days per week schedule.  The various products that are manufactured at the site are campaigned and the two products made from AHCL are typically of our job shop production schedule.  Specifically, these two products are manufactured in campaigns and would only require the use of AHCL for about three months per year.  At the completion of the production campaign, the AHCL is returned to the vendor so as not to be stored unnecessarily on the site.  Our employees receive a great deal of training in the safe handling of AHCL and we have numerous safety procedures and devices engineered into our process to insure that we can routinely handle AHCL in our process safely.  At the present time, there are no operations conducted at the Engelhard Erie facility that require the use of AHCL.  It is unknown at this time whether operations requiring the use of AHCL will be reinstated at this facility.\n\nThe offsite consequence analysis includes consideration of two release scenarios for AHCL, the worst case scenario and an alternate case scenario.  The worst case scenario is defined by the EPA and states that the owner or operator shall assume that the¿maximum quantity in the largest vessel¿is released as a gas over 10 minute"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 33760,
      "SummaryText": "s, due to an unspecified failure.  This is an extremely unlikely event.  The worst case scenario also requires that wind speed and other meteorological conditions be virtually optimized to allow the maximum dispersion of the chemical.  Another feature of the worst case scenario is the fact that we must assume that none of our administrative procedures or engineered safety devices to safe guard the site and community are in use at the time of release.  Once again, it is extremely unlikely that events would ever turn out that way.  The alternate case scenario is defined as more likely to occur than the worst case release scenario.  In this example, we have a realistic release profile, coupled with typical meteorological conditions and wind speed.  The assumption is that our administrative procedures and engineered controls are in place and we have, as a result, a much more realistic model of a likely outcome.  However, even the alternate release scenario is an unlikely event, considering that when AHCL is present at this facility, it is on site for about three months of the year and we have not had any accidental releases in the past five years.\n\nWORST AND ALTERNATE CASE SCENARIOS\n\nThe atmospheric dispersion modeling, which has been performed to the requirements put forth by the EPA, is used to determine the potential distance the AHCL will travel before its concentration decreases to the toxic endpoint.  This endpoint for AHCL specified in 40 CFR Part 68 Appendix A is 0.03mg/L of air (20 ppm).  The residential population within a circle radius corresponding to the toxic endpoint distance has to be defined, to estimate the population potentially affected.\n\nThe worst case scenario involves a failure of a tube in a tube trailer.  The tube contains 3,000 lbs. of AHCL, which is released as a gas over a 10 minute period.  EPA mandated meteorological conditions for the worst case scenario were: Stability F; wind speed of 1.5 meters per second; highest daily"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 33760,
      "SummaryText": "temperature of 98º F; and avaerage humidity of 71%.  Since the Engelhard Erie facility is located in a city, the worst case scenario would encompass the residential population and environmental receptors.  Again, the possibility that this scenario would occur is extremely remote.\n\nThe alternate case scenario involves a breech (20% rupture) in the 0.5 inch connecting line to the tube trailer.  The entire contents of three tubes are released based on the normal operation of the AHCL feed from the tube trailer.  The start of the release is conservatively set at 15 minutes prior to activation of the water deluge system, one of several of our engineered safety devices.  The release is assumed to last for an additional 203 minutes after the water deluge system is activated.  During this time, the three tubes of AHCL would empty.  Meteorological conditions used for the alternate case scenario are ambient wind speed of 3 meters per second, temperature of 98º F, atmospheric stability D, and relative humidity of 71%.  The alternate case scenario is more plausible than the worst case scenario, but is still a very unlikely event.  As modeled, it would affect a few offsite residents, but would not encompass any environmental receptors.\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM AND PREVENTION STEPS\n\nThe Engelhard Erie facility has had an active safety program and exemplary safety results since operations were started in 1964.  Since April 1995, The OSHA Process safety Management Program has covered the operating department that uses AHCL.  Each of the 14 management elements in the program are followed.  Some of the highlites are:\n1.  There is a written Employee Participation Plan, which is being implemented.\n2.  A Process Hazard Analysis was conducted in February of 2000.  Required Process Safety Information was available.  Major problem areas were corrected.\n3.  Operating procedures are up to date.\n4.  Operators are trained and qualified.\n5.  There is an active contractor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 33760,
      "SummaryText": "qualification and selection program.\n6.  Change is managed and prestart-up safety rveiews are conducted.\n7.  A prevention maintenance and inspection program covers critical equipment.\n8.  Site work practices are covered by required permit systems.\n9.  Incidents are investigated.\n10. A compliance audit was conducted in June of 2003.  No violations were found.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases of AHCL within the past five years.  This is a very key point and one which gives credibility to our commitment to employee and community safety.\n\nEMERGENCY RESPONSE PROGRAM\n\nEngelhard Erie has a comprehensive Emergency Procedures Manual that includes:\n1.  A description of the emergency organization.\n2.  Evacuation alarms and evacuation routes.\n3.  Procedures for communication and public notification.\n4.  Emergency medical plans.\n5.  Procedures for support services.\n6.  Department shutdown plans.\n7.  Procedures for handling spills.\n8.  Emergency Response Team procedures and checklists.\n\nIn addition, The site is covered by an Off-Site Plan that has been approved by the Erie County LEPC.\n\nEngelhard Erie has emergency responders trained at the 24-hour technician level (OSHA HAZWOPER Standard). These responders are trained to handle potential releases of AHCL.  Specific on-site response plans for handling releases of AHCL exist.  The Emergency Response Team is well equipped with conventional chemical sensing equipment, personal protective equipment, offensive and defensive strategy tools and equipment, and radio communication.  Pre-determined response checklists are available for the Incident Commander, Operations Chief, Security Officer, Staging/Resources Chief, Safety Officer, and Environmental Officer.  Emergency decontamination and medical equipment and supplies are available.  The Engelhard Erie Emergency Response Team uses the Incident Command System.  This system includes provisions for interaction and support of off-site professional emergen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 33760,
      "SummaryText": "cy responders.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAs mentioned earlier, a process hazard analysis of the facility was conducted in June of 2003.  Only minor improvements to the AHCL system were found to be applicable.  These improvements will be evaluated when it is determined whether or not AHCL will be brought back on site."
    }
  ]
}