{
  "FacilityID": 3393,
  "FacilityName": "RUTGERS Organics Corporation -  Augusta Plant",
  "FacilityStr1": "3750 Clanton Road",
  "FacilityStr2": null,
  "FacilityCity": "Augusta",
  "FacilityState": "GA",
  "FacilityZipCode": "30906",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13245",
  "LEPC": "Richmond County LEPC",
  "FacilityLatDecDegs": "33.362778",
  "FacilityLongDecDegs": "-82.012222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "PP",
  "FacilityURL": "www.ruetgers-organics-corp.com",
  "FacilityEmailAddress": "dburns@ruetgers-organics-corp.com",
  "FacilityDUNS": 3008539,
  "ParentCompanyName": "RUTGERS Organics Corporation",
  "Company2Name": "N/A",
  "CompanyDUNS": 3008539,
  "Company2DUNS": 0,
  "OperatorName": "RUTGERS Organics Corporation",
  "OperatorStr1": "201 Struble Road",
  "OperatorStr2": "N/A",
  "OperatorCity": "State College",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Daniel Burns",
  "RMPTitle": "Plant Manager",
  "FTE": 42,
  "OtherEPAFacilityID": "GAD0000610378",
  "EPAFacilityID": "100000042081",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-19 00:00:00",
  "SafetyInspectionBy": "Other- Insurance carrier",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-08-15 00:00:00",
  "DeRegistrationEffectiveDate": "2006-07-26 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.3687,
  "FRS_Long": -82.01413,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3813,
      "AltID": null,
      "FacilityID": 3393,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3893,
          "ProcessID": 3813,
          "NAICSCode": "32541",
          "_desc": {
            "NAICS_CODE": "32541",
            "NAICS_DESCRIPTION": "Pharmaceutical and Medicine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4072,
          "ProcessID": 3813,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4073,
          "ProcessID": 3813,
          "ChemicalID": 4,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504072,
          "ProcessID": 3813,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504073,
          "ProcessID": 3813,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3393,
      "SummaryText": "The R\\TGERS Organics Corporation Augusta (GA) Plant manufactures various organic chemicals for clients in the agricultural chemical and pharmaceutical industries.\n\nAccidental release prevention and emergency response policies\n\nThe R\\TGERS Organics Augusta Plant is committed to conducting operations in a manner that prevents accidental chemical releases.  R\\TGERS Organics' policy is to design, maintain, operate and audit operations to make sure the possibility of a chemical release is kept as low as possible.  In the unlikely event an accidental chemical release does occur, R\\TGERS Organics' policy is to have a well trained and prepared workforce capable of responding to a release; and have the equipment and facilities available to minimize the release and its affects on employees, the public, and the environment.  The R\\TGERS Organics Augusta Plant's accidental release prevention program, coupled with the emergency response program, consists of \"Six Layers of Protection\" designed to prevent or minimize the effects of an accidental chemical release.  \n\nThe stationary source and regulated substances handled\n\nThe R\\TGERS Organics Corporation Augusta Plant is located on a 77 acre tract of land in south Augusta, GA.  Originally built in 1980, the mission of the plant has changed over the years.  The current purpose of the facility is to manufacture organic chemicals for client customers.  Presently, the Augusta Plant is engaged in the manufacturing of a number of organic chemicals, but due to client demands and equipment availabilities, all of the products are not manufactured year round or at the same time.  Periodically throughout a typical year, production will be switched from one process to another.\n\nOne of the chemicals manufactured at the Augusta Plant is a pharmaceutical intermediate used to treat a terminal illness.  This product requires the use of chlorine and chloroform.  Both of these chemicals are listed by the EPA as a regulated toxic substance, and the qu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3393,
      "SummaryText": "antities used of each substance during the production of the product exceeds the threshold quantity defined by the EPA.  The threshold quanity for chlorine is 2,500 pounds and chloroform is 20,000 pounds.  When not producing the pharmaceutical intermediate, chlorine and chloroform are not maintained in inventory.  It is forecasted that production of the pharmaceutical intermediate will run approximately three months per year.\n\nChlorine is used as a raw material to produce the pharmaceutical intermediate.  Chlorine in one ton containers is received by truck, connected to the process, and used to chlorinate one of the chemical intermediates necessary to produce the final product.  Once a ton container is empty, a new ton container is connected to the process and the old container is returned to the chlorine supplier.  At no time is more than one ton container connected to the process, and administrative controls limit the number of chlorine ton containers maintained at the site.  The maximum inventory of chlorine at the Augusta Plant is 4000 pounds (two one ton containers).\n\nChloroform is used as an extraction and purification agent.  Chloroform is received by tanker truck and is pumped to two storage tanks.  The chloroform is then used at various points in the process.  To minimize the amount of waste produced, the used chloroform is distilled on site and returned to the storage tanks.  The maximum inventory of chloroform at the Augusta Plant is 50,000 pounds.\n\nWorst-case release scenario(s) and the alternate release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nWorst-Case Release Scenario:  For processes with more than one regulated toxic substance, the EPA regulations require reporting of the worst-case release scenario estimated to result in the greatest distance to a specified toxic endpoint.  For the pharmaceutical intermediate process, the worst-case release scenario is a release of chl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3393,
      "SummaryText": "orine.  Failure of a one ton container of chlorine would release 2,000 pounds of chlorine gas to the atmosphere over a ten minute period.  Using worst-case weather conditions, as specified by the EPA, the distance to the chlorine toxic endpoint of 0.0087 mg/l for this release would be 3.0 miles.  These results are based on modeling performed using ALOHA version 5.2.1 air dispersion modeling software.\n\nAlternate Release Scenario - Chlorine:  For chlorine, the alternate release scenario that is more likely than the worst-case release scenario is a piping flange leak occurring in the chlorine supply line.  A typical flange leak would emit approximately 5 pounds/min of chlorine.  Since operators must monitor the reaction vessel at least every 15 minutes, the longest the leak would continue without being detected is 15 minutes.  With chlorine sensors located near piping flanges, the leak would probably be detected sooner than 15 minutes.  Once the leak is detected, either by operators or the sensors, process controls would be triggered that automatically isolate the leak and stop the release.  Alarms would also sound to alert emergency response personnel on site.  A total of 75 pounds of chlorine gas are released during this scenario.  Using typical weather conditions for Augusta, GA, the distance to the chlorine toxic endpoint of 0.0087 mg/l for this release would be 0.26 miles (1,389 feet).  These results are based on modeling performed using ALOHA version 5.2.1 air dispersion modeling software.\n\nAlternate Release Scenario - Chloroform: An alternate release scenario was developed for chloroform.  The release scenario for this chemical does not result in concentrations that reach the EPA toxic endpoint beyond the fence line of the facility.  The results are based on modeling performed using ALOHA version 5.2.1 air dispersion modeling software and the EPA's reference tables in the Off-Site Consequence Analysis (OCA) Guidance.\n\nThe general accidental release prevention pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3393,
      "SummaryText": "ogram and the specific prevention steps\n\nAccidental chemical releases are prevented at the R\\TGERS Organics Augusta Plant through an extensive management and operational prevention program designed to protect employees, the public's health, and the environment.  The R\\TGERS Organics Augusta Plant's accidental release prevention program, coupled with the emergency response program, consists of \"Six Layers of Protection\" designed to prevent or minimize the effects of an accidental chemical release.  \n\nThe first layer is to ensure all processes are designed for safety.  Hazard assessments are performed on the initial process design and every five years afterwards.  Safety systems are designed into the process that actively or passively help minimize the effects of a chemical release.  Equipment and piping are designed and installed per established industry codes and standards, such as the American Society of Mechanical Engineers and the Chlorine Institute.  All changes to a process are thoroughly reviewed by technical and health and safety personnel to ensure any change to equipment, procedures, chemicals, etc. will not affect the safety of employees, the environment, or the public.  \n\nThe second layer of the prevention program involves the maintenance of process equipment.  A preventive maintenance program is in place that is designed to identify problems with plant equipment before they occur.  All critical safety equipment is checked regularly and prior to process startup to ensure it operates as designed.  Inspections and tests of critical devices such as relief valves, pressure vessels, and storage tanks are regularly performed to ensure the integrity and function of the equipment is maintained.  In addition, maintenance personnel are highly skilled and regularly trained.\n\nOperating the plant in a safe manner makes up the third layer of the Augusta Plant's prevention program.  Operators are trained on a process prior to startup and at least every three years after"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3393,
      "SummaryText": "wards.  Chlorine Institute guidelines for training personnel on the properties, handling, storage, and use of chlorine are part of the employee training program.  A management of change system is in place that requires review and approval for all changes that are made to the process, the operating procedures and the process equipment.  All operations are conducted using written procedures that have been reviewed and approved by management, safety and technical personnel.  Access to the plant is restricted to authorized employees, authorized visitors, and authorized contractors.  Areas where chlorine is stored and handled are further restricted during handling operations.  Sensitive and/or critical process parameters, such as process temperatures and pressures, are continuously monitored by computer in the Control Room.  Maintaining an excellent safety program is considered everyone's responsibility, and for the last six years, the Augusta Plant prides itself on not having a single accident that required an employee to lose time away from work.\n\nThe fourth layer of the accident prevention program involves auditing plant operations.  Internal reviews by plant management and health and safety personnel are continuously performed to ensure employees are doing their job correctly and safely.  Operating procedures are reviewed annually to guarantee that they are current and reflect design intentions.  R\\TGERS Organics corporate environmental, health and safety personnel perform annual audits on plant operations.  All processes undergo a pre-startup safety review that confirms design specifications have been followed, procedures are in place, a hazard assessment has been performed and all recommendations from the assessment have been implemented, and that training for all employees involved in the process has been conducted.  Should any incident occur involving a chemical release, no matter how small, the incident is investigated and any recommendations from the investigat"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3393,
      "SummaryText": "ion are implemented to ensure the possibility of any future occurrence is minimized.  \n\nFive year accident history\n\nThere have been no accidental releases of reportable quantities of any EPA regulated substances at the R\\TGERS Organics Augusta Plant over the past five years.\n\nThe emergency response program\n\nThe R\\TGERS Organics Augusta Plant's emergency response program is based on two fundamentals: (1) have a properly trained and prepared workforce, and (2) if a release does occur, have the equipment and procedures necessary to minimize the possible health and environmental effects of the release.  These are the last two layers of chemical release protection.\n\nTraining for an emergency involves all personnel at the Augusta Plant.  The plant has at least two trained HAZMAT Technicians per shift that are able to offensively stop chemical releases.  The rest of the plant is trained on emergency equipment, emergency response and evacuation procedures.  Emergency exercises are performed regularly with Augusta-Richmond County emergency responders.  The last exercise was performed in October, 1998, and simulated a chlorine release.  All exercises are critiqued afterwards for improved efficiency.  \n\nIf a release does occur, the facility is equipped with a plant alarm to alert all personnel.  A contingency plan is in place that directs employees on the actions to take in the case of a chemical release.  This plan includes notification procedures (i.e., 9-1-1 the community, including area schools, businesses, etc.), procedures to control the release, safety procedures (i.e., evacuation, shelter-in-place), and procedures for establishing a response management system.  R\\TGERS Organics's HAZMAT Technicians are always on site to respond to a chemical release, and Augusta-Richmond County Fire Department and HAZMAT teams can respond to an emergency within minutes.  In addition to these procedures, the plant is equipped with various emergency equipment, including foam spray nozzle"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3393,
      "SummaryText": "s, fire hydrants, sprinkler systems, and spill kits that assist in combating an emergency.\n\nPlanned changes to improve safety\n\nThe R\\TGERS Organics Augusta Plant, which is a member of the Chemical Manufacturer's Association (CMA), strives to improve operations in accordance with the CMA's Responsible Care guidelines.  These guidelines steer member companies towards continuously improving product stewardship, employee health and safety, process safety, pollution prevention, and community awareness and emergency response.  The plant is also committed to participating in Chlorine Institute programs and complying with guidelines established by this organization.  To further improve working conditions and practices, the Augusta Plant has a goal to become an OSHA Voluntary Protection Program (VPP) Star Status facility in the near future."
    }
  ]
}