{
  "FacilityID": 34041,
  "FacilityName": "Water Reclamation Facility",
  "FacilityStr1": "380 Avenida Pico",
  "FacilityStr2": null,
  "FacilityCity": "San Clemente",
  "FacilityState": "CA",
  "FacilityZipCode": "92672",
  "Facility4DigitZipExt": "3803",
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.434440",
  "FacilityLongDecDegs": "-117.629167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.san-clemente.ca.us",
  "FacilityEmailAddress": "watersewer@san-clemente.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of San Clemente Utilities Division",
  "Company2Name": null,
  "CompanyDUNS": 785394883,
  "Company2DUNS": 0,
  "OperatorName": "City of San Clemente Util Division",
  "OperatorStr1": "380 Avenida Pico",
  "OperatorStr2": null,
  "OperatorCity": "San Clemente",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92672",
  "OperatorZipCodeExt": "3803",
  "RMPContact": "Jay Elston",
  "RMPTitle": "Utilities Operations Supervisor",
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045248",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "020237",
  "SafetyInspectionDate": "2004-03-29 00:00:00",
  "SafetyInspectionBy": "Orange County Fire Authority",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-06-17 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-06 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.43444,
  "FRS_Long": -117.62917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49048,
      "AltID": "Wastewater Treatment",
      "FacilityID": 34041,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50169,
          "ProcessID": 49048,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 64647,
          "ProcessID": 49048,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 564647,
          "ProcessID": 49048,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34041,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe chlorine system at Water Reclamation Facility of City of San Clemente Utilities Division is used for the treatment of wastewater.  The Water Reclamation Facility uses chlorine for odor control, filamentous control, and disinfection at the various stages of the treatment processes:  1) chlorine contact basins, 2) headworks prechlorination, 3) Return Activated Sludge (RAS), and 4) solids handing hypochlorite scrubber.  As stated on their website, \"The purpose of the City Utilities Division is to ensure uninterrupted water, sewer, and drainage service to all our customers that meet all regulatory requirements.\"\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nStartup of the chlorine system occurred in 1988.  The process is located at 380 Avenida Pico, San Clemente, California 92672.  The chlorine system for the Water Reclamation Facility of City of San Clemente Utilities Division consists of chlorine one-ton containers which are the storage vessels.  Chlorine gas is drawn from a maximum of four tanks on line through a vacuum regulator to the chlorinators.  Still under vacuum from the chlorinators, it is drawn to injectors and mixed with water from the treatment processes.\n\nThe maximum quantity of chlorine that can be stored on site is 16,000 pounds.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe chlorine system at the Water Treatment Facility has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the City of San Clemente Utilities Division treatment processes operate in accordance with OSHA's Process Safety Management regulation and the California Accidental Release Prevention (CalARP) Program.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices outlined by the Chlorin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34041,
      "SummaryText": "e Institute.\n\nIn the event that the primary engineering or administration controls at the Water Reclamation Facility fail and result in a release of chlorine, there are three mechanisms in the facility to minimize the impact: 1) chlorine sensors/detectors, 2) visual/audible alarms, and 3) emergency chlorine scrubber system.  The chlorine sensors that trigger audible and visual alarms are located in the chlorine storage room and chlorinator room.  Once a chlorine concentration of 1 ppm is detected by the sensors, the ventilation system that continuously circulates the air in the chlorine building will be shut off by the chlorine scrubber system.  The chlorine scrubber system then will absorb and will reduce the chlorine concentration of the chlorine storage room.  The operator on duty will then be paged.\n\nThe emergency chlorine scrubber system at the Water Treatment Facility system uses a horizontal packed bed and exhaust fan design to reduce the concentration of chlorine within the chlorine storage room to 0.5 ppm.  As the chlorine laden gases pass through each of the stages, chlorine is absorbed and reacted with caustic solution and chlorine free air is exhausted through the stack. The system is designed with the ventilation rate of 3,000 ACFM air flow rate and the maximum discharge chlorine concentration of 5 ppm.\n\nFIVE YEAR ACCIDENT HISTORY\n\nA review into the accident history of the facility revealed that there have been no reportable releases of chlorine at the City of San Clemente Utilities Division Water Reclamation Facility over the past five years (April 1999 - April 2004).\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of San Clemente Utilities Division has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives: \n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the enviro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34041,
      "SummaryText": "nment.\n4.) To minimize property damage.\n\nThe City of San Clemente Utilities Division maintains a safety committee whose members include the emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan was be reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current. \n\nThe Plan also includes the Emergency training for all City of San Clemente Utilities Division employees.  The City of San Clemente Utilities Division performs periodic emergency evacuation drills to enhance the emergency response skills of its personnel.\n\nThe Emergency Response Plan is reviewed and updated by the City of San Clemente Utilities Division Water Reclamation Facility responsible person, Mr. Jay Elston at least once a year.  This Plan will be review and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nThe City of San Clemente Utilities Division has coordinated emergency response efforts withe the local fire department,  Orange County Fire Department.  In the case of a chlorine-related emergency, its is the policy of City of San Clemente Utilities Division to evacuate the employees and to allow the fire department to respond to the emergency (potentially with the assistance of trained facility personnel).  There is a windsock present on the building to ensure that the responder are approaching from the upwind direction.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) Revalidation provided mitigation measures to improve safety at the City of San Clemente Utilities Division Water Reclamation Facility.  The Revalidation was comprised of one session that included a discussion of any changes to the chlo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34041,
      "SummaryText": "rine system since the 2002 PHA Addendum, a detailed review of the recommended action items generated during the 1998 PHA  and 2001 PSM/RMP/CalARP audit, a discussion of the facility's accident history dating back five years, the review of chlorine checklists, and a site inspection to review seismic issues.  The changes are scheduled to be completed by May 2005.\n\nIn addition the facility is planning to complete several items over the next year as their continued effort to provide a safe work environment for the Water Reclamation Facility employees.  These changes include the following items:\n\n1.  Continue to train all employees in Process Safety Management and the facility's safety programs.\n\n2.  Continue to have employee involvement in updating and refining Process Safety Management and the facility's safety programs.\n\n3.  Continue employee involvement through the Employee Participation program.\n\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}