{
  "FacilityID": 3414,
  "FacilityName": "Seneca Foods Corp.- Cold Storage, Rochester,  MN",
  "FacilityStr1": "308 20th St. SE",
  "FacilityStr2": null,
  "FacilityCity": "Rochester",
  "FacilityState": "MN",
  "FacilityZipCode": "55904",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27109",
  "LEPC": "ST. of MN-Emerg. Response Com.",
  "FacilityLatDecDegs": "43.990833",
  "FacilityLongDecDegs": "-92.459167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2207322,
  "ParentCompanyName": "Seneca Foods Corp.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Seneca Foods Corp.",
  "OperatorStr1": "308 20th St. SE",
  "OperatorStr2": null,
  "OperatorCity": "Rochester",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55904",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Thiel",
  "RMPTitle": "Production Supervisor",
  "FTE": 95,
  "OtherEPAFacilityID": "MNR000010280",
  "EPAFacilityID": "100000042731",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.99083,
  "FRS_Long": -92.45917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 3836,
      "AltID": "Seneca- Cold Storage",
      "FacilityID": 3414,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 3916,
          "ProcessID": 3836,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4099,
          "ProcessID": 3836,
          "ChemicalID": 56,
          "Quantity": 18300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504099,
          "ProcessID": 3836,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3414,
      "SummaryText": "\nSeneca Foods Corp.- Cold Storage, Rochester,  MN\n\nINTRODUCTION:\n\n     The Cold Storage Facility stores, packages, and distributes a variety of frozen vegetables.  The facility\noperates two shifts, 5-6 days per week, year round.  Much of the product used at the facility is produced\nat the Seneca Foods Corp.-Process Facility located at 1217 3rd Ave. SE, Rochester,  MN(approximately 8\nblocks north of the Cold Storage Facility).\n     Two ammonia refrigeration systems are used at the Cold Storage Facility- ammonia is a regulated sub-\nstance per 40CFR Part 68 Environmental Protection Agency(Appendix A).  The 1986 constructed system\ncontains 7,174 lbs. of ammonia, and the 1995 constructed system contains 11,128 lbs. of ammonia--total\nbetween the two systems is 18,302 lbs.  The threshold reporting quantity for anhydrous ammonia is 10,000\nlbs., thus Seneca's Cold Storage Facility is required to comply with the EPA's Risk Management Plan(RMP)\nrequirements.  The 86' Engine Room and the 95' Engine Room are separated by approximately 150 yards.\nThere is no mingling of ammonia between the two systems, each system supplies ammonia to specific pieces of refrigeration equipment.  The 18,302 lb. total charge of anhydrous ammonia in the two systems is used to provide refrigerant for cooling the product storage areas, Processing Room, and Loading Dock.  Seneca's Cold Storage Facility has an accidental release prevention program in place which complies with OSHA's 29 CFR 1910.119 Process Safety Management Standard.  The International Institute of Ammonia Refrigeration's (IIAR) \"Guide to the Implementation of Process Safety Management(PSM) for Ammonia Refrigeration\" was used to implement the PSM program at the Cold Storage Facility.  Parts of the program include:\n                                                                                                                                                                                                      1)  Employee Participation\n  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3414,
      "SummaryText": "                        2)  Process Safety Information\n                          3)  Process Hazard Analysis(PHA)\n                          4)  Operating Procedures\n                          5)  Training\n                          6)  Contractor Requirements\n                          7)  Pre Start-up Safety Review\n                          8)  Mechanical Integrity Audits\n                          9)  Hot Work Permits\n                         10)  Management of Change\n                         11)  Incident Investigation\n                         12)  Emergency Planning and Response\n                         13)  Compliance Audits\n\nGartner Refrigeration and Manufacturing, Inc. of Minneapolis,  MN was(-and continues to be) used to help implement the facility's PSM program,  including: system audits, PHA development, and employee training.  Gartner Refrigeration also performs maintenance on the refrigeration systems.  The refrigeration systems were installed in 1986, and 1995 respectively.  All components were new when installed-- no second hand equipment was used.  The systems remain in excellent condition as a result of the diligent maintenance program used by Seneca and Gartner.      \n                                                                                                                                                                            \n     The Rochester Fire Department is the Senecaa Cold Storage Facility's designated outside first \nresponse team.\n\n      If an uncontrolled release develops, the following procedure will be used:\n\n                         1)  Cold Storage Mechanic confirms leak.\n                         2)  Cold Storage Mechanic evacuates the immediate area.\n                         3)  Management determines the need for a plant wide evacuation.\n                         4)  An upwind location is selected and the evacuation signal is ordered by the\n                              management staff(High-Low Siren).\n                         "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3414,
      "SummaryText": "5)  Time cards are colected for role call.\n                         6)  Rochester Fire Department* is notified by calling 911.\n                         7)  Roll call is taken at the assembly area and first aid is administered.\n                         8)  A list of employees not accounted for at roll call will be forwarded to the \n                               Rochester Fire Department.\n                         9)  Notification of appropriate Company Officials and Government Agencies\n                              is done.\n*= Rochester Fire Department will notify potentially affected offsite parties.\n\n\nWORST-CASE SCENARIO:\n\n     The Seneca Cold Storage Facility has 18,302 lbs. of anhydrous ammonia on site(7,174 lbs. at the 86' system and 11,128 lbs. at the 95' system).  The Risk Management Program rule states: \"The worst-case release quantity shall be the greatest amount held in a vessel, taking into account administrative controls that limit the maximum quantity.\"  The \"Low Temperature Recirculator\"(LTR) located inside of the 95' Engine Room is the largest ammonia storage vessel at the Cold Storage Facility and is large enough to store the entire 11,128 lb. charge of ammonia used in the 95' system.  It is possible that a large quantity of liquid ammonia could be stored in the vessel while performing maintenance on another part of the system.  It is also possible, but extremely improbable(-due to level controls and safeties), that all 11,128 lbs. could migrate to the LTR during operation.  The Offsite Consequence Analysis- Worst Case Scenario for the Seneca Cold Storage Facility is based on a rupture to the LTR while it contains 11,128 lbs. of ammonia.  Rupturing of a vessel can result from impact with a lift truck, thermal shock, or tank fatigue.  The rupture of the LTR would have an offsite impact.\n     The Process Hazard Analysis(PHA) which was performed for the 95' system in 1996 listed a rupture to the LTR as:\n                         a.  Likelihood= \"Very Low\""
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3414,
      "SummaryText": "\n                                          and\n                         b.  Frequency of Occurrence=  \"Has Occured in Industry\"\n\nThe PHA stated the following reasons that a rupture to the LTR would be unlikely:\n\n                         1)  All vessels are designed according to appropriate ASME standards.\n                         2)  The vessel is isolated in a room(Warehouses) to minimize vehicle impact.\n                         3)  The LTR is equipped with Pressure Relief Valves(PRV's) set to relieve at 150 psi.\n                         4)  All PRV's throughout the facilities are on a 5-year, documented, maintenance \n                               program.\n                          5)  The lines are equipped with a by-pass line to minimize the potential for over-\n                                pressurization of the line and the LTR.\n                           6)  By design, the LTR is normally maintained at a pressure of 19-28 psia(Warehouse).\n\n     The Offsite Consequences Anslysis- Worst Case Scenario Formula found in the \"EPA GUIDE to RISK MANAGEMENT for AMMONIA REFRIGERATION\" was used to determine the potential toxic endpoint distance of the ruptured LTR vessel.  The \"Passive Mitigation\" formula was used since the LTR is located inside of a building.  Factors for the formula included:\n\n                                                                Quantity of Ammonia=  11,128 lbs.\n                                                                     Engine Room Size=  46,460 cu.ft.\n                                                       Ventilation of Engine Room=  17,000 CFM\n\nThe result of the formula showed a potential toxic endpoint distance in an Urban Setting of .7 miles from the Seneca Cold Storage 95' Engine Room.\n\n\nALTERNATIVE SCENARIO:\n\n     The Seneca Cold Storage 86' System's Evaporative Condenser is located outside(just east of the Engine Room) near a vehicle traffic area.  Although the Evaporative Condenser is protected with a steep asphalted incl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3414,
      "SummaryText": "ine, there is potential for the condenser supports to be struck by a truck or other vehicle.  The  Offsite Consequence Analysis- Alternative Scenario for the Seneca Cold Storage is based on potential damage done to the High Pressure Condensate Return Line resulting from the impact of a truck or other vehicle striking the supports.  A rupture to the Return Line would have an offsite impact.\n     The Process Hazard Analysis(PHA) which was performed in 1996 for the 86' System listed potential for a line rupture from a striking of the Evaporative Condenser supports by a truck as:\n\n                         a.  Likelihood=  \"Very Low\"\n                                           and\n                         b.  Frequency of Occurrence=  \"Has Occurred in Industry '\n\nThe PHA stated the following reason that a line rupture would be unlikely:\n\n                          1)  There is a heavy incline to minimize impact from a truck.\n\n     Exhibit 4-6-- Release Rates and Distances to Toxic Endpoint for Leaks of Anhydrous Ammonia(Alternative Scenario) found in the \"EPA GUIDE to RISK MANAGEMENT for AMMONIA REFRIGERATION\" was used to determine the potential toxic endpoint distance of the ruptured Condensate Return Line.  The four factors used in determining the endpoint distance were:\n\n                                                      Quantity of Ammonia=  7,174 lbs.\n                                                                 Release Rate =  2,100 lb./min.\n                                                                  Hole Diameter=  1\"\n                                                                 Line Pressure=  180 psig.\n\nThe result of Exhibit 4-6 showed a potential toxic endpoint distance in an Urban Setting of .3 miles from the Seneca Cold Storage 86' Engine Room.\n\n\nTRAINING:\n\n     Gartner Refrigeration presents 16 hours of Ammonia Refrigeration Training every three years for maintenance and supervisory personnel.  The Cold Storage Facility also uses the \"IIAR Ammon"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3414,
      "SummaryText": "ia Refrigeration Education and Training Program:  Series I- Basic Ammonia Refrigeration\" as an inhouse training program for maintenance and supervisory personnel.  The IIAR video \"Ammonia- Refrigerant of the Future\" is also used in training.  A Training Session will be conducted with the Rochester Fire Department annually.\n\n\nOTHER:\n\n     A new ammonia detector will be installed during 1999 in the 86' Engine Room, replacing the outdated ammonia detector installed in 1986."
    }
  ]
}