{
  "FacilityID": 34248,
  "FacilityName": "BOC - Lincoln",
  "FacilityStr1": "Lomar Drive & Old Ferry Road",
  "FacilityStr2": null,
  "FacilityCity": "Lincoln",
  "FacilityState": "AL",
  "FacilityZipCode": "35096",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01121",
  "LEPC": "Talladega County LEPC",
  "FacilityLatDecDegs": "33.610000",
  "FacilityLongDecDegs": "-086.179167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "boc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The BOC Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1368141,
  "Company2DUNS": 0,
  "OperatorName": "BOC",
  "OperatorStr1": "3616 Seventh Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Birmingham",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35222",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000026438",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-12-03 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "MAPP Storage and Distribution",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-08-16 00:00:00",
  "DeRegistrationEffectiveDate": "2005-08-01 00:00:00",
  "AnniversaryDate": "2009-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 33.60972,
  "FRS_Long": -86.17778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49399,
      "AltID": "MAPP Storage/Distribution",
      "FacilityID": 34248,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 65085,
          "ProcessID": 49399,
          "ChemicalID": 129,
          "Quantity": 144700.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 50525,
          "ProcessID": 49399,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 19016,
              "Process_NAICS_ID": 50525,
              "SafetyReviewDate": "2003-11-04 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2003-11-04 00:00:00",
              "ChangeCompletionDate": "2004-05-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-11-05 00:00:00",
              "TrainingReviewDate": "2003-11-05 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-11-05 00:00:00",
              "EquipmentInspectionDate": "2003-11-04 00:00:00",
              "EquipmentTested": "Tank & Piping",
              "ComplianceAuditDate": "2003-11-05 00:00:00",
              "AuditCompletionDate": "2004-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2003-11-04 00:00:00",
              "CBI_Flag": 0,
              "Description": "MAPP Storage & Distribution",
              "_chemicals": [
                {
                  "PrimaryKey": 19841,
                  "PreventionProgram2ID": 19016,
                  "ProcessChemicalID": 65085
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 34248,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-11-05 00:00:00",
    "ERTrainingDate": "2003-11-05 00:00:00",
    "CoordinatingAgencyName": "Lincoln Fire Dept.",
    "CoordinatingAgencyPhone": "2057612125",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34248,
      "SummaryText": "The BOC Gases Lincoln facility, owned and operated by The BOC Group, Incorporated is located at\nLomar Drive & Old Ferry Road., Lincoln, AL. 35222. \n\nThe management and employees of the Lincoln facility are committed to the prevention of any accidental releases of  MAPP (Methylacetylene-Propadiene/Propylene/Propane Mixture).  If an accidental release should occur, the facility  is prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to the community and the environment.\n\nThe Lincoln operation is a MAPP (Methylacetylene-Propadiene/Propylene/Propane Mixture) storage and \ndistribution facility which is generally unmanned. When manned, the facilities primary operation is the \ndistribution ,unloading of  MAPP (Methylacetylene-Propadiene / Propylene/Propane Mixture)  from  railcars  (35,000 gal/144,700 lb.) into two 18,000 gal (73,400 lb ) high pressure ASME storage tanks. The MAPP  is then transfilled into DOT approved road tankers and distributed to customers.\n\nThe worst-case scenario, based on the EPA's definition for a flammable gas release, and Alternative Release Scenario is also base on EPA criteria for a Vapor Cloud Explosion. Results and other information can be review by contacting the facility. The impacted area was determined using  \"Land View V\". \n\nPassive and Active Mitigation systems in place that would reduce the likelihood of a release or the release \nitself. These include check valves in the fill lines, Excess Flow Valves,  a preventive maintenance \nschedule for the system, safeties and testing of the tanks.\n\nThe facility has developed a comprehensive prevention program designed to prevent accidental releases of\n MAPP in accordance with EPA?s Risk Management Part 68, Program Level #2.  The program utilizes \nstate-of-the-art technology, sound engineering practices, administrative controls and active employee \nparticipation.\n\n Written process safety information was developed for"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34248,
      "SummaryText": " the MAPP system to enable managers, supervisors,\n and employees to identify and understand the process hazards.  This information was utilized to develop a \n Hazard Review Checklist (HR) which assists management and employees in making decisions for \nimproving safety and reducing the consequences of releases of MAPP. The HR focuses attention on \nequipment, instrumentation, utilities, human actions, (routine and non routine), and external factors that \nmight impact the process by identifying potential failure points or failure modes in the process. The HR was  review and updated in November 2003 and will be updated at least every 5 years. \n\nDetailed 0perating procedures exist which describe tasks to be performed, dates to be recorded, operating \nconditions to be maintained, samples to be collected, and safety and health precautions to be taken.  The \nprocedures were reviewed/approved to ensure they are technically accurate by employees, managers and \npersonnel with the technical expertise/knowledge of the process.  The operating procedures were review in \nNovember 2003 and are annually reviewed/revised as necessary to reflect current operations.\n\nEmployees are thoroughly trained, including maintenance and contractor employees.  The training meets \nand exceeds the requirements as outlined in OSHA?s hazard communication standard 29 CFR 1910.1200.\n\nTraining includes operating procedures, safe work practices, emergency procedures (including alarms), \nspecial assignments, evacuation and emergency response; safety rules and procedures; routine and \nnon routine work authorization; and other pertinent process safety information.  Each employee trained has a defined and documented program based on their job duties.  The training goals and objectives have been \nestablished and written in clear and measurable terms.  Hands-on training is provided to employees to \nenhance their senses beyond listening.  In addition, employees receive traditional classroom instruction \nincluding"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34248,
      "SummaryText": " lectures, videos, programmed and on-the-job instruction.  Employees are encouraged to actively \nparticipate.  The employees  are periodically evaluated to ensure they posses the necessary skills and \nknowledge via written tests, observation and/or oral interviews. The training program was last reviewed in November 2003.\n\nAn on-going mechanical integrity program (maintenance) is used to ensure safe process operations. \nEquipment used to store, process, or handle MAPP has been designed, constructed, installed, and \nmaintained to minimize releases.  The mechanical integrity program includes the identification and \ncategorization of equipment/instrumentation, inspection/tests and their frequencies, development of \nmaintenance procedures and training of maintenance personnel, criteria for acceptable test results, \ndocumentation of test/inspection results, and documentation of manufacturer's recommendations to \nprevent failure of equipment and instrumentation. This program was review in November 2003\n\nManagement of Change (MOC) procedures have been developed for permanent changes to process \nchemicals, technology, equipment and facilities.  MOC procedures are designed to ensure that prior to any \nchange occurring, that technically qualified personnel with knowledge and expertise of the chemical process,  reviews and approves the proposed changes.  This would include both technical and mechanical changes.  Process changes include all modifications to equipment, procedures, raw materials and processing  conditions other than \"replacement in kind\".  A Process Change Authorization is required for all changes.  Management of Change procedures were review in November 2003.\n\nProcess incidents that result in or could reasonably have resulted in a release of MAPP are investigated, \nincluding \"near misses\", within 48 hours of the incident.  The purpose of the incident investigation is to \nIdentify the underlying causes of the incident and to implement corrective action to prevent "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34248,
      "SummaryText": "similar \nincidents and avoid past mistakes.  Process incidents are investigated by a Team, which include both \nManagement and employees and is multidisciplinary. An incident report is prepared following the \nInvestigation which includes the findings, conclusions, and recommendations. The Facility Manager is \nResponsible for ensuring that all report recommendations are completed or resolved by those individuals \nresponsible for follow-up. All resolutions are communicated to all affected employees.\n\nThe facility receives a compliance audit in accordance with EPA's Risk Management Standard Part 68 at \nleast once every three years.  The audit includes an evaluation of the design and effectiveness of the risk \nmanagement system and a field inspection of the safety and health conditions, and practices to ensure \ncompliance.  The Team uses an audit tool to document each audit step and ensure an effective audit is \nconducted.  A Protocol Policy has been developed to ensure that proper follow-up is accomplished.\n\nBOC Gases will make available all information, including any Trade Secret information as it relates to \ncompliance with this regulation.   \n\nThe facility has an Emergency Response Plan that has been integrated with the local community \nEmergency Response Plan. All employees and contractors are trained in the plan prior to commencement \nof work.  The Emergency Plan is tested and critiqued twice a year to insure that it is current. Changes are \nmade and reviewed if deficiencies are found. The site does not have trained Emergency Responders at the \ntechnician level, however, BOC maintains trained technician level Emergency Responders on 24hr. call \nthrough out the US.\n\nSafety improvement is an on-going process at the facility.  Periodic evaluations are performed to assess \nthe maintenance of safe conditions.  There are no additional specific MAPP safety recommendations for \nimplementation at this time."
    }
  ]
}