{
  "FacilityID": 34385,
  "FacilityName": "CoorsTek, Electronic Products Group",
  "FacilityStr1": "17750 West 32nd Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Golden",
  "FacilityState": "CO",
  "FacilityZipCode": "80401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08059",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "39.765000",
  "FacilityLongDecDegs": "-105.201477",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.coorstek.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7057334,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CoorsTek",
  "OperatorStr1": "17750 West 32nd Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Golden",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80401",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rob Spurrier",
  "RMPTitle": "General Manager",
  "FTE": 380,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000024742",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "96JE080",
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2008-12-12 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.765,
  "FRS_Long": -105.20147,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49610,
      "AltID": "Ammonia",
      "FacilityID": 34385,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50738,
          "ProcessID": 49610,
          "NAICSCode": "327113",
          "_desc": {
            "NAICS_CODE": "327113",
            "NAICS_DESCRIPTION": "Porcelain Electrical Supply Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65316,
          "ProcessID": 49610,
          "ChemicalID": 57,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565316,
          "ProcessID": 49610,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34385,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program and policies for the Ammonia System at the CoorsTek Electronic Products Group.\n\nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are presented in the Emergency Planning and Response Sections of the Building 19 PSM/RMP manual for the ammonia system.  CoorsTek takes an active role in preventing accidental releases at its facility by ensuring that employees are properly trained in the safe operation of the ammonia process and the safe handling of treatment chemicals.  CoorsTek has established and maintains procedures for emergency notification and response.  These are reviewed with employees on an annual basis and revised as needed.\n\nStationary Source and Regulated Substances\nBuilding 19 manufactures ceramic electronic components.  The RMP regulated substance at this facility is ammonia (NH3).  The ammonia is used as feedstock for the ammonia disassociation process at the Nitroneal Generator and the Sargent & Wilbur Disassociator.  The ammonia is stored in a 16,000 gallon tank with a maximum inventory of 65,000 pounds.\n\nPrevention Steps for Ammonia\nThe prevention program and chemical safety issues are described in detail in the facility PSM/RMP Manual.  This facility is covered under the requirements of the OSHA Process Safety Management (PSM) standard and that allows us to employ technical and management systems approaches to ensuring safety of the ammonia system.  The following elements are included in the manual:\n\n- Employee Participation:  includes provisions for employees to be involved in development and implementation of the RMP program.\n- Process Safety Information: includes technical information on the process and components.\n- Process Hazard Analysis: this section outlines the company's approach to PHA's for the ammonia system.\n- Operating Procedures: this section describes the nature and general content of the operating procedures"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34385,
      "SummaryText": " for the process.  \n- Training: personnel are provided training and competencies are evaluated as described in this section.\n- Contractor Management: the company's process for managing contractors is described in this section.\n- Pre-startup Safety Review: the requirements for conducting pre-startup reviews are covered in this section.\n- Mechanical Integrity: maintaining the system in safe condition is part of the mechanical integrity requirements discussed in this section.\n- Hot Work: the company maintains a hot work permit program as detailed in this section of the manual.\n- Management of Change: the MOC procedure directs the requirements to evaluate any changes made to the RMP program or the covered process.\n- Incident Investigation: this section describes the company's process for investigating incident(s) involving the system.\n- Audits: this section describes the company's process for auditing the RMP program and the PHA.\n- Trade Secrets: this section provides information for personnel access to information on the ammonia process.\n\nAccident History\nThere are no reportable accidental releases of ammonia during the previous five years as required by 40 CFR 68.42.\n\nEmergency Response Program\nThe facility's Emergency Response Program is coordinated with local response agencies and the plan is reviewed at least annually and updated as required.  Drills are held as required by our procedures and regulations, and the plan is updated accordingly.  \n\nPlanned Changes for Improved Safety\nEmployees are encouraged to provide suggestions for improvement on an ongoing basis.  New employees are informed of the RMP program, ERP plans and alarms, to recognize hazards and to present ideas for safety improvement.  There are no signficant changes planned for this operation.\n\nEmployees were involved in the initial and revalidation Process Hazard Analyses.  Recommendations for safety improvement made during these sessions were recorded.  Recommendations are considered and responses ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34385,
      "SummaryText": "e provided."
    }
  ]
}