{
  "FacilityID": 34502,
  "FacilityName": "Seneca Foods Corporation",
  "FacilityStr1": "430 7th Avenue South",
  "FacilityStr2": "P. O. Box 232",
  "FacilityCity": "Buhl",
  "FacilityState": "ID",
  "FacilityZipCode": "83316",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16083",
  "LEPC": "Twin Falls County LEPC",
  "FacilityLatDecDegs": "42.597500",
  "FacilityLongDecDegs": "-114.747778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "senecafoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2207322,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Seneca Foods Corporation",
  "OperatorStr1": "430 7th Avenue South",
  "OperatorStr2": "P. O. Box 232",
  "OperatorCity": "Buhl",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83316",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Thorson",
  "RMPTitle": "Quality Assurance Manager",
  "FTE": 400,
  "OtherEPAFacilityID": "IDD 073084353",
  "EPAFacilityID": "100000117571",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-09-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 42.59694,
  "FRS_Long": -114.75,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "25000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49746,
      "AltID": null,
      "FacilityID": 34502,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50878,
          "ProcessID": 49746,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65488,
          "ProcessID": 49746,
          "ChemicalID": 56,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565488,
          "ProcessID": 49746,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34502,
      "SummaryText": "\nExecutive Summary:\n\n\n\nThe Seneca Foods Corporation Buhl, Idaho facility processes (canned\n\nand frozen) seasonal vegetables along with being a labeling and\n\ndistribution center.  Main products are Asparagus, Sugar Snap Peas,\n\nand Sweet Corn.  Ammonia is used in our product freezing and\n\nstoring operations.  The main operating system was upgraded in 1990\n\nand charged with 55,000 lbs of ammonia.  A separate smaller system\n\ncontains 8,000 lbs of ammonia and is used to operate the 102,000\n\nsquare foot frozen warehouse at a -10 degree temperature.\n\n\n\nIt is the policy of the Seneca Foods Corporation to assure safe and\n\nhealthful working conditions for every employee and to comply with\n\nthe letter and spirit of applicable laws and regulations.  The\n\nCompany will provide adequate safeguards against health and safety\n\nhazards by providing a safe work environment, by job training and\n\ninstruction on safe procedures, by making appropriate protective\n\nequipment available, and by the proper administration of safety\n\nprograms and activities.\n\n\n\nAll employees are expected to comply with safety and health rules\n\nand procedures and to take an active role in the safety and health\n\nprogram and activities.\n\n\n\nOur worst case release scenario involves the High Pressure Receiver\n\non the Northside of the freezer operations building.  This receiver\n\nwill contain the largest quantity of ammonia on sight.  The cause\n\nof the worst case release would be due to a vehicle losing control,\n\ngoing over the protective barricades, and hitting the High Pressure\n\nReceiver tank causing it to rupture and release ammonia.\n\n\n\nThe amount of ammonia being released when the end of the vessel is\n\nremoved is 25,000 lbs.  The capacity of this tank is 25,000 lbs. \n\nUsing the EPA's RMP Guidance for Ammonia Refrigeration Reference\n\nTables or Equations, this release over a 10 minute period would\n\nrelease 2,500 lbs per minute resulting in an evacuation area of 1.9\n\nmiles surrounding the facility considering the urban "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34502,
      "SummaryText": "setting.  If\n\nthe setting was strictly rural, the evacuation area could extend to\n\n2.9 miles.\n\n\n\nThe barricades protecting the High Pressure Receiver are being\n\nupgraded prior to the Corn Pack of 1999.  The silage operation\n\nduring corn pack presents the greatest frequency for having\n\nvehicles in the area of the High Pressure Receiver.  They would\n\nalso present the greatest probability of losing control due to\n\nequipment/brake failure or driver neglect.  The barricades would be\n\ndesigned to withstand an impact with the silage truck, thus\n\npreventing the worst case scenario.\n\n\n\nThe other cause of the worst case scenario could be an airplane\n\ncrashing into the High Pressure Receiver area.  The probability of\n\na plane hitting is very remote.\n\nOur alternative release scenario involves the failure of a shaft\n\nseal.  This release could be caused by manufacturer quality issues\n\nor maintenance neglect.  This release would result in approximately\n\n50 lbs of ammonia being released.  Using the EPA's RMP Guidance for\n\nAmmonia Refrigeration Reference Tables or Equations, this release\n\nover a 10 minute period would release 5 lbs per minute resulting in\n\nan evacuation area of .10 miles surrounding the facility\n\nconsidering the urban setting.  If the setting was strictly rural,\n\nthe evacuation area would be the same .10 miles.  Being that our\n\nfacility property is not strictly controlled, in terms of denying\n\naccess to the public, even the small distance of .10 of a mile\n\nwould be considered to have offsite impact.\n\n\n\nOur defined maintenance procedures requires review of shaft seals\n\neach maintenance session and replacement as needed.  Prior to being\n\ninstalled seals are inspected for quality issues that could lead to\n\nfailure .\n\n\n\nThis release was selected due to the variables of manufacturer\n\nquality control and the human judgement error that could occur\n\nduring maintenance activities.  Other types of failures that could\n\nlead to a release were reviewed.  These included a 4-bolt "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34502,
      "SummaryText": "flange\n\ncoming loose, a fisher valve failure, and a packing gland leak. \n\nThe shaft seal failure was chosen due to having the possibility of\n\nthe largest amount of ammonia released.  The other types of\n\nfailures would release a smaller amount of ammonia and would be\n\neasier to control.\n\n\n\nWe have had no releases of ammonia in the last 5 years that\n\nrequired evacuation of our facility.  We have had no onsite or\n\noffsite injuries due to an ammonia release.\n\n\n\nIf a release occurred that required evacuation of our facility, the\n\nresponse efforts under our Emergency Action Plan are coordinated\n\nwith the local Buhl City Fire Department, the Region IV MVERT\n\n(Magic Valley Emergency Response Team) and the Twin Falls County\n\nLEPC (Local Emergency Planning Commission).  MVERT, based in\n\nJerome, consists of approximately 60 Technicians of which 6 are\n\nmembers of the Buhl City Fire Department.  The Buhl City Fire\n\nDepartment participates in an annual tour of our facility to\n\nunderstand the facility layout and associated hazards.\n\n\n\nTo assure orderly evacuations of personnel, evacuation drills are\n\nconducted annually.\n\n\n\nMaintenance personnel in frozen operations receive training on\n\nSCBA's (Self Contained Breathing Apparatus) that can be used during\n\nroutine maintenance activities to assure their safety.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOperator training occurs at least every 3 years.  Our formal\n\ntraining initiative began in 1992 with what was called Level III\n\n(24 hours) training, it was followed by Level II (24 hours)\n\ntraining in 1993, and then Level I (24 hours) operator training in\n\n1994.  In 1997, Gartner Refrigeration presented a 16 hour Ammonia\n\nRefrigeration Refresher Training Course.  The operator training\n\ncourses cover the various components of the refrigeration system,\n\nthe physical factors that affect the refrigeration cycle, operation\n\nand maintenance, and safe operating procedures.\n\n\n\nThe engine room operators also attend training classes put on by\n\nequipment manufacturers.  The"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34502,
      "SummaryText": " most recent being a Frick Compressor\n\nOperating Class instructed by Frick Compressor Training,\n\nEngineering, and Service personnel in December of 1997.\n\n\n\nThe engine room operators have developed a 4 hour course to \n\nintroduce other maintenance personnel, including electricians, to\n\nthe operational aspects of the ammonia system.  The operators have\n\na defined 2 - 4 week training time frame for educating new\n\noperators\n\non our system. \n\n\n\nEngineering safety designs are present in our ammonia system to\n\ncontrol and minimize the possibility of an ammonia release that\n\nwould endanger Seneca personnel or residents of the Buhl Community.\n\n\n\nThese safety controls include simple ideas such as installing\n\nammonia piping with avoidance of forklift traffic in mind, and\n\nusing physical barriers to prevent contact with ammonia equipment.\n\n\n\nAutomated high-level cutoff controls are utilized to prevent\n\noverfilling of system components by shutting down the system and\n\ncontrolling the migration of liquid ammonia.  Relief valves are\n\nreplaced every 5 years as a precautionary measure to avoid valve\n\nfailure.\n\n\n\nThe computerized/PLC (Programmable Logic Controllers) operating\n\nsystem control was upgraded in June of 1999.  The new Citect\n\ntechnology allows better monitoring of the ammonia system during\n\nprocessing.  The current computerized operating system is Y2K\n\ncompliant.\n\n\n\nEfforts began in March of 1999 to replace 9 reciprocating\n\ncompressors with screw compressors.  4 of the 9 were replaced in\n\nphase I.  Associated piping is also being replaced and upgraded.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAn internal SOP (Standard Operating Procedure) requires that our\n\nrefrigeration system must be reviewed by an expert authority on an\n\nannual basis.  Gartner Refrigeration & Manufacturing Incorporated\n\nbased in Minneapolis, MN reviews our frozen operations and storage\n\nfacilities for us on an annual basis.  Areas of review include\n\nsafety concerns, operating issues, capacity, maintenance,\n\nefficiency, P"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34502,
      "SummaryText": "rocess Safety Management Compliance, Risk Management\n\nPlan and training.  Our objective with this procedure is to ensure\n\nsafety of plant personnel, fulfill compliance requirements with all\n\napplicable regulations and prevent any unnecessary down time within\n\nthe plant relating to the these processes.\n\n\n\nThe engine room has an automated auto dialer that functions 24\n\nhours a day, 7 days a week and will contact engine room personnel\n\nif any part of the ammonia system is not operating properly or if\n\nammonia is present in key areas. \n\n\n\nPrior to the ammonia system being started back up each processing\n\nseason, a Pre-Startup Safety Review, which includes a Safety\n\nInspection Check List for each individual system component (i.e.\n\ncompressor), is completed.\n\n\n\nOrganizationally, a Frozen Operations Coordinator position was\n\nadded to the facility in January of 1999.  This individual's duties\n\ninclude coordinating operator training and working with engine room\n\npersonnel to identify and complete ammonia system safety and\n\noperational issues.\n\n\n\n\n\n\n\nfile=EXSEPA\n\n"
    }
  ]
}