{
  "FacilityID": 34515,
  "FacilityName": "Spartan Stores Distribution, LLC",
  "FacilityStr1": "850 76th Street SE",
  "FacilityStr2": null,
  "FacilityCity": "Grand Rapids",
  "FacilityState": "MI",
  "FacilityZipCode": "49518",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26081",
  "LEPC": "Kent County LEPC",
  "FacilityLatDecDegs": "42.826371",
  "FacilityLongDecDegs": "-085.683678",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "NE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6959613,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Clifford C. Sasfy",
  "OperatorStr1": "850 76th Street SE",
  "OperatorStr2": null,
  "OperatorCity": "Grand Rapids",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49518",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Environmental Supervisor",
  "FTE": 1229,
  "OtherEPAFacilityID": "MID006959613",
  "EPAFacilityID": "100000060097",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 42.82242,
  "FRS_Long": -85.68858,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49775,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 34515,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 50907,
          "ProcessID": 49775,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 50908,
          "ProcessID": 49775,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65542,
          "ProcessID": 49775,
          "ChemicalID": 56,
          "Quantity": 31691.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565542,
          "ProcessID": 49775,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34515,
      "SummaryText": "EXECUTIVE SUMMARY\n\nFishbeck, Thompson, Carr & Huber, Inc. has been retained by Spartan Stores Distribution, LLC (Spartan) to prepare and resubmit a Risk Management Plan (RMP) for their distribution facility located at 850 76th Street, SE, Grand Rapids, Michigan. Spartan is a distributor of retail grocery products. A site location map and site plan are shown as Figures 1 and 2, respectively.\n\nAs required in the U.S. Environmental Protection Agency (EPA) Risk Management Program rules listed in 40 CFR Part 68, this document contains information intended to analyze the impact of an accidental release of an extremely hazardous substance and to highlight the steps the facility is taking to prevent a release from occurring. The intent of the rule is to reduce the likelihood of a chemical release and the consequences of a release if one were to occur. The refrigeration process utilizes anhydrous ammonia, which is a regulated substance under the Risk Management Program. Spartan has a maximum inventory of 31,691 pounds of anhydrous ammonia. The rule lists an anhydrous ammonia threshold of 10,000 pounds. The facility is also subject to the Occupational Health and Safety Association (OSHA) Process Safety Management (PSM) Program. Modeling results indicate the worst-case release would cause an offsite impact. Due to these factors, Spartan is subject to Program 3 requirements under 40 CFR Part 68. During the past ten years, Spartan has not had an accidental release that met the criteria of 40 CFR Part 68.42(a). \n\nBecause of the potential hazards when using ammonia as a refrigerant, it is of paramount importance that steps be taken to minimize the risk of a catastrophic release. Consequently, a prevention program that is based on the following key elements is in place: Spartan has purchased, installed, and maintains high quality equipment; Spartan has developed plans and programs to ensure safe operation of the system; Spartan has provided process information and training to affec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34515,
      "SummaryText": "ted employees, and requires contractors to verify knowledge of training and of Spartan?s procedures; Spartan conducts audits to ensure adherence to plans and programs, as well as to continue the minimization of risk.\n \nSpartan has developed and implemented many standard operating procedures (SOPs) for the processes covered under the OSHA PSM Program requirements. These procedures outline steps for each operating phase, operating limits, health and safety considerations, as well as safety systems and their functions. The procedures outline safe work practices to provide for the control of hazards during operations. The process complies with good engineering practices, and procedures are in place for maintaining mechanical integrity and planning for change. Employees are trained in safe operations, health and safety hazards, and emergency procedures with respect to their job tasks. \n\nDue to the extensive preventative maintenance procedures, training, and emergency response procedures that have been implemented at Spartan, it is highly unlikely that a release would occur. However, a hazard analysis was conducted to predict the offsite impact in the event of an emergency, according to the procedures outlined in the rule. \n\nSpartan has been actively involved in emergency response planning for many years. They have worked closely with the Kent County Local Emergency Planning Committee (LEPC) over the past several years. Spartan is a Program 3 source and a nonresponding facility. The Spartan Emergency Response Plan outlines procedures for internal response to incidental releases and notification and coordination with the local emergency response organizations in the event of an incidental release that cannot be contained and will have offsite impacts. \n\nSpartan has an ongoing process to evaluate health and safety and environmental programs. In addition, periodic audits are completed by outside contractors to identify areas for improvement. \n\nThis Executive Summary, excludi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34515,
      "SummaryText": "ng figures and reference to the radius of the hazard zones, has been included in the RMP submitted to the EPA. A copy of the RMP submittal sent to the EPA is attached."
    }
  ]
}