{
  "FacilityID": 34627,
  "FacilityName": "Foster Farms Fresno Dairy",
  "FacilityStr1": "3380 West Ashlan",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "93722",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.794611",
  "FacilityLongDecDegs": "-119.852389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 28684363,
  "ParentCompanyName": "Foster Farms",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Foster Farms",
  "OperatorStr1": "3380 West Ashlan",
  "OperatorStr2": null,
  "OperatorCity": "Fresno",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93722",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rick Nitschke",
  "RMPTitle": "Safety Coordinator",
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163253",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-08-31 00:00:00",
  "DeRegistrationEffectiveDate": "2012-03-28 00:00:00",
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 36.79364,
  "FRS_Long": -119.85297,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 49930,
      "AltID": null,
      "FacilityID": 34627,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51064,
          "ProcessID": 49930,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 65906,
          "ProcessID": 49930,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 565906,
          "ProcessID": 49930,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 34627,
      "SummaryText": "FOSTER FARMS DAIRY\nRISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\nAnhydrous Ammonia Refrigeration System\n\nRevised June 2004\n\nEXECUTIVE SUMMARY\n\n\nFoster Farms Dairy revised this document, previously submitted in August 1999, due to the revalidation of their process hazard analysis?s and the regulatory requirements requiring re-submittal within six months of a change that resulted in a revised process hazard analysis.  \n\nFoster Farms Dairy (Foster Farms) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations.  The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et. Seq.  The Federal Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68.  Finally, both the Occupational Safety and Health Association (OSHA) and the California Occupational Safety and Health Association (CalOSHA) regulate facilities with certain acutely hazardous materials under the PSM regulations, as defined in CCR Title 8 Section 5189 and CFR Title 29 Part 1910 Section 119, respectively.\n\nFoster Farms prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility.  Foster Farms incorporated many state-of-the-art safety features into the ammonia refrigeration system at the facility as part of the original system construction and system modifications.  Foster Farms will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM.  In the unlikely event that a chemical release does occur at the facility, Foster Farms personnel are train"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 34627,
      "SummaryText": "ed in the appropriate response measures, relying on support services provided by the local fire department and hazardous materials response team.\n\nFoster Farms is located at 3380 West Ashlan in Fresno, California.  The surrounding area consists of industrial and commercial businesses and residential development.  The site is bordered by Ashlan Avenue to the south, North Valentine Avenue to the west, West Holland to the north, and industrial businesses to the east and west.  Foster Farms is approximately one half mile east of Highway 99.\n\nThe facility was originally constructed in the mid-1960s.  The refrigeration system was remodeled in the mid-1980s.  Operations at the facility consist of the storage, processing, packaging, and distribution of milk and dairy products.  The facility is surrounded by chain-link fencing and is staffed by a refrigeration operator or mechanic 24 hours per day, 365 days per year.\n\nAnhydrous ammonia is used in a refrigeration system at the facility.  The refrigeration system, which is a closed system, contains approximately 13,000 pounds of anhydrous ammonia.  The system provides cooling for production areas, product, and water chilling.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, and compressor controls.  \n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility.  The Foster Farms facility reported no accidental releases of ammonia within the past five years. \n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Foster Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 34627,
      "SummaryText": "quipment due to ammonia expansion.  The Foster Farms ammonia system is continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.  The major pressure vessels in the system are connected to a diffusion panel.  Ammonia from the vessels can be mixed with water (neutralized) and discharged to the city sewer to prevent over-pressurization of the vessels.  Further, all pressure vessels in the system are equipped with pressure relief valves.\n\nOther safety features at the facility include: \n?emergency shutdown systems\n?component specific safety shutdowns\n?pressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\n?all major vessels are connected to a fire diffusion panel\n?engine room is equipped with ammonia detection system\n?engine room is equipped with emergency shut down switch\n?engine room is equipped with a ventilation system\n?many of the ammonia pipes, valves and components are labeled\n?a fire sprinkler system is installed in the plant\n?operators receive ongoing training in operations, maintenance and emergency response\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP/PSM auditing and inspection program.  Written standard operating procedures (SOPs) are being prepared for the ammonia system at the facility.  The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the sy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 34627,
      "SummaryText": "stems.\n\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A preventive maintenance system is utilized to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility includes daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment.  The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nChanges to improve safety at the facility are ongoing.  Many of the mitigation measures suggested by the process hazard analysis team have already been implemented.  Others will be implemented during the next several months.  The status of significant mitigation measures is as follows:\n?preventive maintenance program has been reviewed to verify that all ammonia system components are included and maintenance frequencies are appropriate\n?management is evaluating engine room exhaust requirements \n?spring return valves are used for all oil draining\n?ammonia awareness will be added to forklift training program\n?safe work practices and emergency response plan have been updated\n\nFoster Farms will respond to all suggested mitigation measures promptly.  Foster Farms is scheduling completion of proposed actions.  Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility.  As such, this document and related attachments and program elements will evolve as Foster Farms continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community.  Foster Farms will submit revised information if a change occurs that is considered significa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 34627,
      "SummaryText": "nt and requires resubmission under the regulations.  However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Foster Farms? internal review practices, and Foster Farms will maintain the most current versions on site.  Thus, the most current version RMP/PSM, related documents, and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}