{
  "FacilityID": 35052,
  "FacilityName": "The Dannon Company, Inc.",
  "FacilityStr1": "1300 West Peter Smith Street",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.740139",
  "FacilityLongDecDegs": "-097.339363",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dannon.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Dannon Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 57454019,
  "Company2DUNS": 0,
  "OperatorName": "The Dannon Company, Inc.",
  "OperatorStr1": "120 White Plains Road",
  "OperatorStr2": null,
  "OperatorCity": "Tarrytown",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "10591",
  "OperatorZipCodeExt": "5536",
  "RMPContact": "Michael Edgemon",
  "RMPTitle": "Environmental Manager",
  "FTE": 260,
  "OtherEPAFacilityID": "TXD987797665",
  "EPAFacilityID": "100000095559",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-07-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-06-15 00:00:00",
  "DeRegistrationEffectiveDate": "2012-06-08 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 32.74003,
  "FRS_Long": -97.339,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50527,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35052,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51673,
          "ProcessID": 50527,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66584,
          "ProcessID": 50527,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566584,
          "ProcessID": 50527,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35052,
      "SummaryText": "The Dannon Company is a processor of yogurt.\n\nGeneral accidental release and prevention policy of The Dannon Company: In this facility we utilize anhydrous ammonia as refrigerant.  Anhydrous ammonia is considered hazardous by the Environmental Protection Agency.  The same properties that make ammonia a valuable refrigerant also makes it necessary to observe certain safety precautions during it?s use to prevent exposure to our workers, the surrounding community and the environment.\n\nIt is our policy at The Dannon Company to implement the requirements of the Risk Management Program by managing and operating this facility in full compliance with all applicable federal and state regulations that we are governed by.  The objective is to minimize the risk of an accidental release of hazardous materials.  Safety depends directly on our proper handling of ammonia.  Our plant personnel have been trained on the equipment operating procedures and the various safety devices that are incorporated in our facility to prevent the possibility of accidental releases.\n\nStationary source and regulated substance handled: The Dannon Company, Inc., 1300 Petersmith Street, Fort Worth, Texas, operates a refrigeration system utilizing anhydrous ammonia as the primary refrigerant.  Mechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as a heat exchanging fluid to maintain a desired temperature in an enclosed environment.  The refrigeration cycle consists of evaporation, compression, condensation and expansion.  Evaporation and condensation are designed to alter the quantity of energy associated with the refrigerant.  Compression and expansion are designed to change the availability of the associated energy.  The refrigeration cycle is a closed loop process.  The ammonia cycle utilizes fluid temperature, pressure, and latent heat of vaporization for cooling.  The refrigeration system uses this phenomenon to remove heat from a desired space, and then to di"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35052,
      "SummaryText": "scard that heat through condensation, to an area where it is of no consequence.\n\nThe Dannon Company facility uses ammonia refrigeration to maintain processing, storage room and product tank temperatures required for the processing and storage of our product.  There are approximately 350 employees at this facility, including hourly and salary personnel, that manufacture and prepare shipment of refrigerated dairy products via truck approximately 24 hours a day, seven days a week.\n\nThe refrigeration system contains 56,000 pounds of aggregate ammonia.  The potential hazards that could lead to an accidental release of the ammonia include, but are not limited to, equipment failure, damage to piping, damage to equipment, human error, etc.\n\nAlthough ammonia is a colorless, tasteless liquid, its dominant characteristic is it?s pungent, distinct odor.  Persons exposed to ammonia will not voluntarily stay in areas of even small concentrations, although these levels would not normally result in any health risks.  Risks from accidental exposure to ammonia in a vapor state are irritations to the eyes, nose and throat.  The extent of irritation depends on the exposure amount and length of time exposed.  Ammonia is classified non-flammable by the Department of Transportation.  Ammonia will burn, but only in a very narrow concentration level when accompanied with a constant ignition source.\n\nAdministrative and engineering controls to limit/prevent accidental release: \n*  Electronic ammonia detection installed in compressor rooms, coolers, \nprocessing areas and receiving.  Alarm system activates a local audible alarm to alert plant personnel of the potential ammonia leak in the monitored areas.\n*  High liquid level switches are configured to accumulators and \nrecirculators.  High level switches will shut down associated compressor operation during a high level condition.\n*  All compressors are configured with critical safety controls (high \npressure, low pressure, high oil temp cut-o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35052,
      "SummaryText": "uts, etc) to shut down the respective compressor in the event of an abnormal operating condition.\n*  Safety Relief Valves are configured to all pressure vessels, condensers \nand compressor oil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n*  Periodic Maintenance Program is contracted through a reputable refrigeration company to ensure the refrigeration systems and its components are kept in optimum mechanical and operating status.  Weekly inspections are conducted by the refrigeration contractor.  Daily rounds are made by plant personnel to verify proper equipment operation.\n*  Security personnel on premises 24 hours a day, seven days a week to monitor facility access as well as make rounds to detect malfunctions within the refrigeration equipment.\n\nFive-year accident history: The Dannon Company facility at Fort Worth has had zero accidental releases to report.\n\nEmergency Action Program: The purpose of The Dannon Company Emergency Action Plan is to:\n\n1.Minimize exposure to our employees and the surrounding community in the event of a hazardous material release or spill.\n2.Assure the safe emergency evacuation of the plant in the instance that it is required.\n3.Provide for prompt medical attention to any employees who become seriously injured or ill at work.\n4.Facility management has developed an Emergency Response Plan to ensure a fast and efficient response in the event of an accidental release of hazardous materials.\n\nOur Emergency Action Plan currently meets requirements as set forth in OSHA 29 CFR 1910.38, Employee Emergency and Fire Prevention Plans."
    }
  ]
}