{
  "FacilityID": 3507,
  "FacilityName": "Red Mountain Water Plant",
  "FacilityStr1": "1401 West 9th Street",
  "FacilityStr2": "N/A",
  "FacilityCity": "Glenwood Springs",
  "FacilityState": "CO",
  "FacilityZipCode": "81601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08045",
  "LEPC": "Garfield County LEPC",
  "FacilityLatDecDegs": "39.544667",
  "FacilityLongDecDegs": "-107.339194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "N/A",
  "FacilityEmailAddress": "jwade@rof.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Glenwood Springs",
  "Company2Name": "N/A",
  "CompanyDUNS": 30458046,
  "Company2DUNS": 0,
  "OperatorName": "Jerry K. Wade",
  "OperatorStr1": "1401 West 9th Street",
  "OperatorStr2": "N/A",
  "OperatorCity": "Glenwood Springs",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry K. Wade / Mike Piper",
  "RMPTitle": "Asst.Supt.W&WW / Fire Chief",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000031422",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-09-09 00:00:00",
  "SafetyInspectionBy": "CIRSA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2019-12-20 00:00:00",
  "AnniversaryDate": "2004-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.54467,
  "FRS_Long": -107.33919,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4053,
      "AltID": "N/A",
      "FacilityID": 3507,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4133,
          "ProcessID": 4053,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4321,
          "ProcessID": 4053,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504321,
          "ProcessID": 4053,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3507,
      "SummaryText": "                                                                                                                                                    May 10,1999\n  \n\nTo whom it may concern,\n\n     The City of Glenwood Springs Water Treatment Facility currently utilizes chlorine gas in the disenfection\nprocess. We store a minimum of 6,000 pounds of chlorine gas on the premises at all times. Because of the amount of this chemical we fall under the new regulation.\n     For many years the City of Glenwood Springs has had what we feel are adequate precautionary measures to offset the possibility of a major chlorine release. Our plan has been subject to some modification over the years in order to improve it. The City of Glenwood Springs has never experienced any type of chlorine release into the atmosphere. Other than our in-house procedures at the Water Treatment Facility, we rely heavily on our State and Local Glenwood Springs Fire Department (GSFD) because we are a small city. I have attached protocols and procedures that are routinely used by my in-house personnel and the local agencies.\n      I would like to explain briefly how our response would be in the event of even a minor release contained in the chemical area. \n     The Water Treatment Plant is equipped with a chlorine sensing device located in the chlorine process and storage area. This sensing device is tested every week by releasing a small amount of gas ( created by mixing bleach and vinegar ). The chlorine sensing device is also equipped with a separate backup power source ( UPS ) in case of a power outage. This UPS is also tested under a load every week.\n     In the process / storage area there are always two one ton cylinders on scales hooked up to the chlorine feed systems at any given time. We have the capability of storing a total of four one ton cylinders in this area.\n     Upon detection of chlorine gas at a concentration of 3 ppm in the atmosphere, it engages an alarm which initiates a signal to the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3507,
      "SummaryText": " Chlorine Scrubber System and a signal to the in-plant Fire Communicator System. The Chlorine Scrubber System will continue to operate until the chlorine leak is contained or corrected. The Fire Communicator dials out to an alarm monitoring company which in turn calls our local Police Dispatch. The Police Dispatch pages the Glenwood Springs Fire Department (GSFD) and the Police Departments. The dispatch also pages out the plant operator on call. All parties meet at a designated site as police units seal off certain identified areas around the plant. Once the plant operator and GSFD evaluate the situation, they proceed to the Water Treatment Plant. The GSFD provides backup for the plant opeator. After suiting up with Self Contained Breathing Apparatus' ( SCBA ), the plant operator enters the chlorine area and repairs / isolates the leak. In the event of the worst case scenario, the GSFD, police, and State HAZMAT departments would address the situation as per the enclosed protocol.\n     There has been a few false alarm call outs where this plan has been tested and it seems to be adequate. The Glenwood Springs Fire Department has also initiated mock tests in the past and the plan seems to be in proper order. The Glenwood Springs Fire Department has been involved in cases where there has been chlorine gas releases at swimming pools in the area and their plan seems to work well. The only thing that we lack is an actual major chlorine release to test our plan which we hope never happens.\n     We have an in-house training program that includes the use of the SCBA', rotation on chlorine cylinder changeovers, and loading / offloading of the chemical. In addition to this we attend seminars as they become available to us. We have also began to include some additional training offered through Chlorine Consultants Inc.. This training is an eight hour refresher course that the plant operators and members of the Glenwood Springs Fire Department will attend annually. We began atten"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3507,
      "SummaryText": "ding this training in 1998.\n     We have a very aggressive maintainence program on all of our plant equipment especially the equipment associated with the chlorine areas. Equipment in the chlorine area includes but is not limited to the chlorine alarm system, scales, chlorinators, chlorine scrubber system, and chlorine cylinder lifting bar assembly.\n    Enclosed with the Risk Management Plan you will find copies of all of our in-plant procedures and protocol that we have developed over the years and revised as necessary. \n     The City of Glenwood Springs feels that the safety of the public and its employees is of the utmost importance and we will strive to improve our plan and encourage any constructive criticism regarding this plan.\n     If you have any questions regarding this plan or find it necessary to obtain more information, please feel free to contact me by phone at 970-945-8372 or e-mail jwade@rof.\n\n                                                                                                   Thank You,\n                                                                                                   Jerry K. Wade\n                                                                                                   City of Glenwood Springs"
    }
  ]
}