{
  "FacilityID": 35174,
  "FacilityName": "Southern States Russellville Coop., Inc.",
  "FacilityStr1": "Highway 68 East",
  "FacilityStr2": null,
  "FacilityCity": "Russellville",
  "FacilityState": "KY",
  "FacilityZipCode": "42276",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21141",
  "LEPC": "Logan LEPC",
  "FacilityLatDecDegs": "36.842778",
  "FacilityLongDecDegs": "-086.866667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8964637,
  "ParentCompanyName": "Southern States Russellville Coop., Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Southern States Russellville Coop",
  "OperatorStr1": "Highway 68 East",
  "OperatorStr2": null,
  "OperatorCity": "Russellville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42276",
  "OperatorZipCodeExt": null,
  "RMPContact": "Timothy Markham",
  "RMPTitle": "Manager",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075438",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-01-01 00:00:00",
  "SafetyInspectionBy": "Paul Akers",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 36.84278,
  "FRS_Long": -86.86667,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50684,
      "AltID": "Ammonia Storage",
      "FacilityID": 35174,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51833,
          "ProcessID": 50684,
          "NAICSCode": "42459",
          "_desc": {
            "NAICS_CODE": "42459",
            "NAICS_DESCRIPTION": "Other Farm Product Raw Material Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66776,
          "ProcessID": 50684,
          "ChemicalID": 56,
          "Quantity": 130050.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566776,
          "ProcessID": 50684,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35174,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n(Russellville, KY)\n\n\n\nThe accidental release prevention and emergency response policies at your facility:\n\n\n\nThis facility handles anhydrous ammonia, which is considered to be a regulated toxic substance by EPA.\n\nWe observe all necessary safety precautions in handling anhydrous ammonia to prevent unnecessary\n\nhuman exposure, to reduce the threat to our own personal health and to reduce the threat to nearby \n\nmembers of the community.  It is our policy to adhere to all applicable federal, state and local\n\nrules and regulations.  Safety depends upon the manner in which we handle anhydrous ammonia, the\n\nsafety devices inherent to the design of this facility, the safe handling procedures that we use\n\nand the training of our personnel.\n\n\n\nThis facility complies with ANSI K-61.1 and OSHA 1910.111 requirements for anhydrous ammonia\n\nstorage.  If an emergency were to occur, it is our policy to notify the local emergency\n\nresponse agency.\n\n\n\nA description of your facility and the regulated substances handled:\n\n\n\nThe primary purpose of this facility is storage.  We receive anhydrous ammonia by transport\n\ntruck and store it as a liquid in pressurized vessels.  Access to the process is restricted to\n\nauthorized employees and contractors.  The maximum amount of anhydrous ammonia that can be\n\nstored at this facility is 30,000 gallons (water capacity).\n\n\n\nThe alternative release scenario:\n\n\n\nThe alternative release scenario is pipe leak\n\nThe operator observes the leak and isolates the pipe by closing the\n\nshut-off valves.  The contents of the pipe are released over a period of ten minutes (1450 lbs \n\ntotal).  The distance to the endpoint of 140 ppm is 0.40 miles, based on the dense gas dispersion \n\nmodel Degadis.  This distance extends slightly beyond the facility boundary and there are no\n\nreceptors within the distance to endpoint.\n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\n\n\nThis facility complies with EPA's "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35174,
      "SummaryText": "accident prevention rule and all applicable state and local\n\ncodes and regulations.  The anhydrous ammonia system is designed, installed, and maintained\n\nin accordance with ANSI K-61.1, OSHA 1910.111 and state law.\n\n\n\nProcess Safety Information\n\nWe maintain safety information that describes the chemical hazards, operating parameters and\n\nequipment designs associated with our anhydrous ammonia storage facilities.\n\n\n\nProcess Hazard Review\n\nOur Environmental, Health, Safety and Security (EHSS) team conducts comprehensive studies\n\nand reviews to ensure that hazards associated with our processes are identified and controlled\n\nefficiently.  These activities are undertaken by a team of qualified personnel with expertise\n\nin process operations and are revalidated at a regular interval.  Any findings related to the\n\nhazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nWe maintain written operating procedures for operation of the anhydrous ammonia storage\n\nfacility.  These procedures address various modes of operation including initial startup,\n\nnormal operations, temporary operations, emergency shutdown, emergency operations, normal\n\nshutdown and startup after a turnaround.  The information is readily accessible to operators.\n\n\n\nTraining\n\nWe have a comprehensive training program in place to ensure that employees who are operating\n\nprocesses are competent in the operating procedures associated with these processes.  Refresher\n\ntraining is provided at least every three years.\n\n\n\nMaintenance\n\nOur EHSS team performs thorough annual maintenance inspections of process equipment to ensure\n\nproper operations.  Basic visual inspections are performed by facility operators on a more\n\nfrequent basis during loading and unloading of anhydrous ammonia delivery vehicles.  Process\n\nequipment examined by these checks includes:  pressure vessels, storage tanks, piping systems,\n\nrelief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operation"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35174,
      "SummaryText": "s\n\nare performed by qualified personnel that have been trained in safe maintenance practices.  Any\n\nequipement deficiencies are corrected in a safe an dtimely manner.\n\n\n\nCompliance Audits\n\nWe conduct compliance audits on a regular basis to confirm that the provisions set out under\n\nthe RMP rule are being implemented.  These audits are performed at least every 3 years and any\n\ncorrective actions required as a result of the audits are undertaken in a timely manner.\n\n\n\nIncident Investigation\n\nWe promptly investigate any incident that has resulted in, or could reasonbly result in, a \n\ncatastrophic release of anhydrous ammonia.  These investigations are undertaken to indentify\n\nthe situation leading to the incident as well as any corrective actions to prevent the\n\nincident from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nFive-year accident history:\n\n\n\nThere have been no accidents in the past five years at this facility.\n\n\n\nThe emergency response program:\n\n\n\nIt is company policy for each of our facilites to maintain an Emergency Action Plan &\n\nEmergency Response Plan.  This plan addresses chemical inventory, evacuation procedures and\n\ninstructions for notifying emergency response agencies.  This plan is reviewed on an annual\n\nbasis and is included in the employee training program.  In the event of a emergency, it is\n\nour policy to notify the local emergency response agency and request that they respond to\n\nthe emergency.\n\n\n\nPlanned changes to improve safety:\n\n\n\nWe will continue to implement our safety program to guarantee that our facility is operated\n\nin a safe and reliable manner and to ensure the safety of our employees and the surrounding\n\ncommunity.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}