{
  "FacilityID": 35208,
  "FacilityName": "Pinnacle Foods Group Inc. - Erie",
  "FacilityStr1": "2200 East 38 Street",
  "FacilityStr2": null,
  "FacilityCity": "Erie",
  "FacilityState": "PA",
  "FacilityZipCode": "16510",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42049",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.119722",
  "FacilityLongDecDegs": "-080.019167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.pinnaclefoodscorp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 965953359,
  "ParentCompanyName": "Pinnacle Foods Group Inc.",
  "Company2Name": null,
  "CompanyDUNS": 965953359,
  "Company2DUNS": 965953359,
  "OperatorName": "Pinnacle Foods Group Inc",
  "OperatorStr1": "Six Executive Campus",
  "OperatorStr2": null,
  "OperatorCity": "Cherry Hill",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08002",
  "OperatorZipCodeExt": null,
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155734",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-07-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Mrs. Paul's --  Erie PA",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-05-17 00:00:00",
  "DeRegistrationEffectiveDate": "2006-04-12 00:00:00",
  "AnniversaryDate": "2007-12-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 42.11957,
  "FRS_Long": -80.01967,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50721,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35208,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 66816,
          "ProcessID": 50721,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 51870,
          "ProcessID": 50721,
          "NAICSCode": "311712",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 29078,
              "Process_NAICS_ID": 51870,
              "SafetyReviewDate": "2002-03-12 00:00:00",
              "PHA_Date": "2002-03-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-10-31 00:00:00",
              "TrainingReviewDate": "2002-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": "computer testing",
              "MaintenanceReviewDate": "2002-12-06 00:00:00",
              "EquipmentInspectionDate": "2002-12-12 00:00:00",
              "EquipmentTested": "ongoing PM program",
              "ChangeMgmtDate": "2002-05-02 00:00:00",
              "ChangeMgmtReviewDate": "2002-05-08 00:00:00",
              "PreStartupReviewDate": "2002-10-19 00:00:00",
              "ComplianceAuditDate": "2002-05-09 00:00:00",
              "AuditCompletionDate": "2002-12-31 00:00:00",
              "IncidentInvestigationDate": "2002-07-09 00:00:00",
              "InvestigationChangeDate": "2002-07-24 00:00:00",
              "ParticipationPlansReviewDate": "2002-10-19 00:00:00",
              "HotWorkPermitReviewDate": "2002-10-19 00:00:00",
              "ContractorSafetyReviewDate": "2002-07-10 00:00:00",
              "ContractorSafetyEvalDate": "2002-10-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 42218,
                  "PreventionProgram3ID": 29078,
                  "ProcessChemicalID": 66816
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35208,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-04-09 00:00:00",
    "ERTrainingDate": "2002-11-27 00:00:00",
    "CoordinatingAgencyName": "Erie County LEPC",
    "CoordinatingAgencyPhone": "8148709920",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35208,
      "SummaryText": "PINNACLE FOODS  - MRS. PAUL¿S\nErie Pennsylvania\n\nINTRODUCTION\nThe Pinnacle Foods Group Inc. (Pinnacle) facility is located at 2200 East 38th Street Erie Pennsylvania.  The facility was historically owned/operated by Van De Kamps (¿VDK¿) Frozen Foods and Aurora Foods Corporation. The Process Safety Management (PSM) program was developed for the facility in 1994/1995 under VDK. The original Risk Management Program was developed by VDK using the existing PSM and the initial Risk Management Plan (RMP) was submitted to EPA.  Aurora Foods Corporation purchased the facility in June 2000 and a complete resubmission of the RMP report was submitted to EPA in December 2002.  Aurora emerged bankruptcy in March 2004, survived a merger and was renamed Pinnacle Foods Group Inc.  Pinnacle is providing a partial update to reflect changes in personnel and management and to remove the offsite consequence analysis from the executive summary.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nPinnacle is committed to providing a safe workplace that is operated in an environmentally responsible manner. Pinnacle strives to protect all its valuable resources and assets - both personnel and property.  We live and have families in this community.  We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment. Pinnacle is also committed to comply with all applicable laws and regulations relating to safety in the workplace and the protection of the environment.  Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases.\n\nIt is Pinnacle Foods Group Inc. / Pinnacle Foods Corporation policy that we will promote overall public and associate safety by developing, implementing and maintaining all required elements of the EPA¿s RMP provisions and OSHA¿s PSM standard regarding the storage, handling, and processing of anhydrous ammon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35208,
      "SummaryText": "ia used at this facility.  The incorporation of these programs helps to prevent the occurrence, and minimize the consequences, of significant releases of highly hazardous materials as well as fires, explosions, and other types of catastrophic incidents.  \n\nThis Facility incorporates a comprehensive management system to oversee the continued development, implementation and maintenance of the RMP. The Facility¿s Plant Manager is responsible for the implementation of the RMP.  In turn, he has designated the facility Safety and Environmental Coordinator as PSM coordinator having overall authority for, and oversight of, the Facility RMP. As part of the PSM and Risk Management Program, the Facility has an Emergency Response Plan and Procedures Manual which provides instructions and responsibilities required of all facility personnel in case of the following plant emergencies: employee illness/injury, ammonia release, fire, and severe weather. The manual also provides procedures and responsibilities for controlled and emergency shutdowns of facility equipment. The management team is committed to safety and the implementation of safe procedures at the Pinnacle facility.  \n\n\nFACILITY OVERVIEW AND REGULATED SUBSTANCES HANDLED\n\nThe facility is located on 10 acres in Erie, along the Pennsylvanian shores of Lake Erie.  The facility consists of one building with over 117,000 square feet under roof. The purpose of our facility is the processing and packaging of frozen food products primarily fish.  We utilize anhydrous ammonia as the primary means for refrigeration, cooling and freezing.  The Environmental Protection Agency (EPA) considers anhydrous ammonia hazardous; therefore, the properties, which make ammonia valuable as a refrigerant, also necessitate certain safety precautions.  A nationally recognized, reputable and professional ammonia delivery company is used to fill our main receiver tanks.  Steel piping then carries the ammonia to the needed refrigeration, cooling or fr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35208,
      "SummaryText": "eezing units.  Access to the site is restricted to facility employees, authorized management personnel and authorized contractors.\n\nAnhydrous ammonia is the only RMP regulated substance (toxic or flammable) used at our facility.  We operate a single refrigeration system with an inventory of approximately 40,000 pounds.  \n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nFor the purposes of this 2004 RMP update, only minor incidents have occurred and no accidental releases resulting in deaths, injuries, or significant property damage on-site or known off-site deaths, injuries, evacuations, sheltering in-place, property damage, or environmental damage have occurred at the facility within the past five years.\n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\n\nThe ammonia refrigeration system design and construction is based upon accepted and proven engineering design practices for a safe operating refrigeration plant.  The system was designed and constructed to meet the Uniform Building Code, Uniform Mechanical Code, Uniform Fire Code, ASHRAE Standard 15 and the National Electrical Code.  Shut-off valves are strategically located throughout the refrigeration system to allow emergency shut-off, periodic maintenance and repair.  Depending on location and use in the system, pressure vessels are ASME rated and fitted with either a single or dual safety relief valve as required by ASME.\n\nThe Pinnacle Foods Corp. facility complies with applicable Federal, State and Local regulations including the EPA's Accidental Release Prevention Rule.  Our personnel are trained about this during our Hazard Communications Training and through access to our Written Programs.  Our Refrigeration Operators/Mechanics receive a combination of classroom training plus On-The-Job (OTJ) training.  They are given written tests and are able to demonstrate proper job skills and knowledge. \n\nPinnacle has reviewed and revised the documents and procedures for compliance with OSHA's PSM an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35208,
      "SummaryText": "d EPA's Risk Management Program for ammonia use and storage.  A management system has been established to maintain the elements of the PSM and Risk Management Programs.  Applicable written elements of the PSM and the Risk Management Program are readily accessible by employees.  An automatic ammonia detection system (ADS) also provides reliable notification of ammonia releases.\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nThe Emergency Response Plan and Procedures manual covers the ammonia refrigeration system in accordance with Process Safety and Risk Management.  Our emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies.   If a release of ammonia is detected by the ADS or by employees, the procedures within this manual will be followed including notification of hazardous materials responders (refrigeration mechanics) by radio and as required, the involvement of the incident commander. The manual describes the level of personnel protective equipment to be used to respond to ammonia incidents.  Facility responders have received initial and annual refresher training in accordance with 29 CFR 1910.120.  Facility-wide training regarding emergency procedures and evacuation routes occurs on an annual basis.\n\nPinnacle has an in-house HAZMAT team that initially responds and works in conjunction the Erie County Local Emergency Planning Committee, the Erie Fire Department and HAZMAT team on emergency preparedness.  The Fire Department and Police will handle public notification, under the control of the LEPC.  We meet periodically with representatives of each to address any changes in the facility or any new concerns. Pinnacle will work with these agencies as necessary to notify the public about an ammonia release. The manual also contains procedures for emergency alerting and response procedures for on-site personnel, off-site emergency contacts, and adjacent plants.  Senior management will handle media relations."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35208,
      "SummaryText": "We strive to minimize off-site consequences through the implementation of emergency response program elements:  pre-emergency planning, facility evacuation procedures, emergency response procedures, emergency medical and first aid procedures, post-emergency guidelines, and training program.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nCurrently, Pinnacle trains and tests all refrigeration technicians.  Our preventative maintenance program is above standard and our total ammonia Process Safety Program is reviewed annually and updated periodically.  Our program is improved continuously through annual updating of our written program and annual training of our technicians.  We also take advantage of new technologies when safer and more economical alternatives are available."
    }
  ]
}