{
  "FacilityID": 35244,
  "FacilityName": "Tamarac Water Treatment Plant",
  "FacilityStr1": "Tamarac Water Treatment Plant",
  "FacilityStr2": "7803 Northwest 61st Street",
  "FacilityCity": "Tamarac",
  "FacilityState": "FL",
  "FacilityZipCode": "33321",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12011",
  "LEPC": null,
  "FacilityLatDecDegs": "26.201111",
  "FacilityLongDecDegs": "-080.256389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tamarac",
  "OperatorStr1": "City of Tamarac",
  "OperatorStr2": "6001 Nob Hill Road",
  "OperatorCity": "Tamarac",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33321",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Harvey",
  "RMPTitle": "Water Trtmnt. Plant Superintendent",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000055842",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "Broward Co. Dept. Of Natural Resourses",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-01-11 00:00:00",
  "DeRegistrationEffectiveDate": "2004-12-30 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 26.20007,
  "FRS_Long": -80.25619,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50783,
      "AltID": "Chlorine system",
      "FacilityID": 35244,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51933,
          "ProcessID": 50783,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66896,
          "ProcessID": 50783,
          "ChemicalID": 62,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566896,
          "ProcessID": 50783,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35244,
      "SummaryText": "INTRODUCTION                                                                                                                                                                At the turn of this century water borne diseases were a leading cause of death in the United States.  Epidemics of typhoid, cholera, dysentery and other water-borne diseases occurred.  After chlorine?s introduction into public water supplies, deaths from typhoid in the U.S. dropped dramatically from 25,000 in 1900 to less than 20 in 1960.  Water-borne disease is even still a leading cause of infant mortality in many countries throughout Asia, Africa, and Latin America where infant mortality rates are 10 to 20 times greater than in the U.S.  In the U.S., however, water-borne disease has been virtually eliminated due to an effective public health strategy of utilizing chlorine for drinking water disinfection.  Chlorine disinfection is arguably one of the greatest achievements for public health worldwide in the last hundred years and is credited with increasing the life expectancy of Americans by more than 50 percent.\n    The use of chlorine is not risk free, however.  Historically it is clear that utilities have recognized the risks and have been successful in developing procedures to handle chlorine safely and to protect the off-site public and the environment from potential accidental releases.\n    As an added layer of protection, the United States Environmental Protection Agency (EPA) promulgated Hazardous Chemical Risk Management Program (RMP) regulations to further ensure that facility owners understand the risks and take proactive efforts to reduce risk through comprehensive training programs, procedures, and risk mitigation measures.  Additionally, EPA wanted the public to be informed regarding these issues.\n    The City of Tamarac Water Treatment Plant staff have always understood these risks and have maintained a well-trained staff and a safely operated and maintained facility.  The City of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35244,
      "SummaryText": " Tamarac?s track record is exemplary with respect to handling hazardous chemicals.  Furthermore, the City of Tamarac took a comprehensive approach to be in full compliance with the RMP regulation by June 21, 1999 and has ever since been complying with EPA?s RMP requirements.\n                                                                                                                                                                              FACILITY BACKGROUND\n    The City of Tamarac owns and operates the City of Tamarac Water Treatment Plant.  The facility?s mission is to protect public health by providing its customers with safe drinking water, free of harmful pathogens.  Approximately 500 to 600 pounds per day of chlorine gas is used to disinfect the water and make it safe for human consumption.  A maximum of 31,000 pounds of chlorine are stored on-site.  The chlorine is stored as a gas that is liquefied under pressure in containers that contain 2,000 pounds each. \n                                                                                                                                                                          CHLORINE PROCESS AND SAFETY EQUIPMENT\n    The City of Tamarac Water Treatment Plant chlorine system is a complete vacuum system that feeds chlorine gas through vacuum regulators mounted on ton containers.  The chlorine containers and associated feed equipment are located in a building.  The building offers passive mitigation to attenuate the release rate to the atmosphere during a chlorine leak.\n    The chlorine supply to the system consists of two banks.  Each bank has three containers connected to a header.  Each container holds 2,000 pounds of chlorine gas liquefied under pressure.  Capital Controls Advance Series 200 vacuum regulators are mounted on each chlorine container gas valve.  As the pressurized gas from the container passes through the vacuum regulator, it is reduced to a slight vacuum.  The vacuum, created by the ven"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35244,
      "SummaryText": "turi effect of the injectors, pulls the chlorine gas through schedule 80 PVC piping from the vacuum regulators, through the rotameters, and into the injector assemblies.  Chlorine gas is mixed with water in the injections to form a chlorine solution.  The chlorine solution is then distributed to the various application points.  The flowrate of chlorine gas is controlled to each application point by manual adjustment of the respective rotameter located just upstream of the injector assembly.\n    The complete vacuum system is the safest chlorine feed arrangement available.  Since the vacuum regulator is mounted directly to the chlorine container, any break or failure in equipment downstream of the regulator will cause the regulator valve to close and stop the flow of chlorine gas.  Therefore, the only possible chlorine leak scenario would be a failure of the chlorine container or its supply valve.\nIn the event of a chlorine leak, perimeter chlorine leak detectors would activate alarms throughout the plant to warn operators of a problem.  Alarms are as follows:\n* A horn and flashing beacon located outside of the injector room.\n* A horn and flashing beacon located outside of the chlorine container storage room.\n* A horn and warning light located in the operations control room.\n                                                                                                                                                                                   RISK MANAGEMENT AND PROCESS SAFETY MANAGEMENT PROGRAM OVERVIEW\n    Chlorine is subject to the Environmental Protection Agency?s Risk Management Program regulation which can be found in 40 CFR 68 and the Occupational Safety and Health Administration?s (OSHA?s) Process Safety Management Program (PSMP) regulation which can be found in 29 CFR 1910.119.\n    The primary components of the RMP are as follows:\n* A five-year accident history\n* An off-site consequence analysis for a worst-case and alternative release scenario\n* A co"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35244,
      "SummaryText": "mprehensive prevention program to minimize risks (i.e. minimize the potential for a release)\n* An overall management program to supervise the implementation of the RMP\n    Following development of the RMP submitted in year 1999, the facility must submit a RMP Update to the EPA by June 21, 2004.  The RMP update, which is presented every five years, reports any process changes or if a new process is added.  The OSHA PSM regulation has basically the same requirements as the prevention program element of the EPA RMP.  The City of Tamarac Water Treatment Plant?s RMP meets the requirements of both regulations.\n    The following sections briefly summarize the elements of the City?s RMP.\n                                                                                                                                                                                   FIVE-YEAR ACCIDENT HISTORY\n    The City of Tamarac Water Treatment Plant has used chlorine to disinfect water for 30 years. In the last five years, the facility has had no accidental releases, which were required to be reported under the RMP regulation.                                                                                                                                                                                                                                                                                                                                                           WORST-CASE RELEASE SCENARIO\n   The results of this scenario are not being reported for security reasons.\n                                                                                                                                                                     ALTERNATIVE RELEASE SCENARIO\n   The results of this scenario are not being reported for security reasons.\n                                                                                                                                                            "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35244,
      "SummaryText": "           PREVENTION PROGRAM\n    There are always inherent risks associated with handling and using chlorine.  These risks include the potential inhalation of chlorine gas if it is accidentally released.  The prevention program is a key component to reducing the risk associated with a potential chlorine gas release.  Key elements of the prevention program include:\n* Employee participation\n* Process safety information\n* Process hazard analysis\n* Incident investigation\n* Standard operating procedures\n* Mechanical integrity\n* Management of change\n* Pre-startup review\n* Training\n* Contractors\n* Compliance audits\n* Hot work permits\n* Trade secrets\n    The following briefly states the benefits of the following prevention program elements: standard operating procedures, mechanical integrity program, employee training and the process hazard analysis.\n    The facility staff has developed up-to-date and accurate written standard operating procedures (SOPs) to ensure that operators have clear instructions for safe operation of the chlorine system.  Effective SOPs, when combined with operator training, are instrumental in ensuring safe operation of the system and in preventing accidental releases.\n    The purpose of the mechanical integrity program is to ensure the continued integrity of the process equipment.  An effective mechanical integrity program is integral to preventing accidental chlorine releases that may result from mechanical failure of improperly maintained equipment.  The City of Tamarac Water Treatment Plant?s mechanical integrity program includes maintenance, inspection, and testing procedures and schedules along with maintenance personnel training.\n    Knowledgeable well-trained personnel are essential to preventing and mitigating the effects of accidental chemical releases. The City of Tamarac Water Treatment Plant?s training program ensures that personnel working on or near the chlorine system are adequately trained in operation and maintenance procedures an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 35244,
      "SummaryText": "d the appropriate response actions to an accidental chlorine release.\n    The process hazard analysis is a valuable risk reduction tool that outlines deficiencies in equipment and procedures, identifies potential system failure modes, and provides recommendations for system and operational improvements.\n                                                                                                                                                                      EMERGENCY RESPONSE PROGRAM\n    A comprehensive emergency response program outlines the procedures and lines of communication that are necessary to effectively respond to and mitigate a potential chlorine gas release.\n    In the event of a chlorine gas release, a detector located in the storage area, will detect the presence of chlorine gas.  The detector will activate audible and visual alarms throughout the facility to give warning to plant staff.  The facility emergency response program includes procedures for notifying the local hazardous materials (hazmat) teams of the incident and procedures for evacuating the facility.  There are four local hazmat teams in Broward County that can respond to mitigate a chlorine leak.  Facility staff have coordinated with the local hazmat team and fire department to ensure that they are fully trained and equipped to quickly respond to an incident.\n                                                                                                                                                                           PLANNED CHANGES TO IMPROVED SAFETY\n    The City of Tamarac undertook a study to review the costs and qualitative issues of changing the existing chlorine system to an alternative (i.e., safer) disinfection system.  The alternatives evaluated included switching to on-site generation of sodium hypochlorite (at 0.8% concentration) and purchasing bulk hypochlorite (at 12% concentration).  In addition, these alternatives were compared to staying with chlorine g"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 35244,
      "SummaryText": "as and adding an emergency chlorine scrubber.  The hypochlorite system was selected and is in the final design stage. The new hypochlorite system is scheduled to begin operations in October 2004."
    }
  ]
}