{
  "FacilityID": 35256,
  "FacilityName": "City of Tyler- Westside Wastewater Treatment Plant",
  "FacilityStr1": "14939 CR 46",
  "FacilityStr2": null,
  "FacilityCity": "Tyler",
  "FacilityState": "TX",
  "FacilityZipCode": "75704",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48423",
  "LEPC": "Smith County LEPC",
  "FacilityLatDecDegs": "32.396944",
  "FacilityLongDecDegs": "-095.411389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cityoftyler.org",
  "FacilityEmailAddress": "waterutilities@tylertexas.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tyler, Texas",
  "OperatorStr1": "P.O. Box 239",
  "OperatorStr2": null,
  "OperatorCity": "Tyler",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75710",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Norris",
  "RMPTitle": "Chief Operator",
  "FTE": 13,
  "OtherEPAFacilityID": "TXD000836353",
  "EPAFacilityID": "100000138326",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-28 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "City of Tyler, Texas",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 32.39806,
  "FRS_Long": -95.42028,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50800,
      "AltID": "Wastewater Treatment",
      "FacilityID": 35256,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51953,
          "ProcessID": 50800,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66918,
          "ProcessID": 50800,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 66919,
          "ProcessID": 50800,
          "ChemicalID": 49,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566918,
          "ProcessID": 50800,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566919,
          "ProcessID": 50800,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35256,
      "SummaryText": "     Westside Wastewater Treatment Plant lies outside the city of Tyler's limits with boundaries delineated by a chain link fence.  The site has appropriate buffers from residential areas.  The Westside Wastewater Treatment Plant remains an essential facility for the City of Tyler.  The plant currently treats approximately 60% of the city's wastewater.  This equals out to around 7.5-8 million gallons per day.  The plant effectively serves the city of Tyler's sanitary sewer needs.\n\n     Wastewater treatment is the regulated process at this facility.  This facility only stores two hazardous chemicals above the stated threshold quantity: chlorine and sulfur dioxide.  Chlorine gas disinfects the water while the sulfur dioxide removes the chlorine from the water prior to discharge.  The use of both chlorine and sulfur dioxide gas for wastewater treatment results in a cost-effective method for meeting state and federal surface water discharge rules and regulations.  The plant safely stores 24,000 pounds of chlorine and 24,000 pounds of sulfur dioxide.\n\n     The Westside WWTP chief operator drafted the written operating procedures around safety and site specific information and were recently updated.  In addition, all operators must have an operator's license from the Texas Commission on Environmental Quality.  All employees who handle chlorine and sulfur dioxide know about the dangers of the gases and how to safely handle the them.  Procedures for the handling of chlorine gas come from the Chlorine Institute while sulfur dioxide procedures come from the Sulfur Dioxide Handling Manual.  The chief operator facilitates chemical safety by coordinating with the chlorine and sulfur dioxide gas suppliers to come out to the facility and perform a chemical safety class for the employees.\n\n     The Westside WWTP complies with the rules and regulations of the EPA RMP.  The most important preventative measure for avoiding accidental release involves the gas feed systems.  The chlorin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35256,
      "SummaryText": "e and sulfur dioxide gas feeds via gas vacuum.  The gas will cease to flow when gas piping breaks and vacuum is lost downstream of the vacuum regulator.  The only potential for gas escaping is the very small amount of piping from the vacuum regulator to the ton containers.  This ensures that any failure in the process equipment (chlorinators & sulfonators) will cease gas flow.  This helps to eliminate chlorine and sulfur dioxide gas releases.  A building with adequately designed ventilation systems and with firewalls separate the two chemical feed areas.  In addition, gas detectors in the process area and storage areas will alarm personnel that a leak has occurred.  \n\n     All operators are trained in the written operating procedures.  Preventative maintenance procedures aid in changing out wearable parts before they fail.  For example, pigtails are changed out annually or at any sign of deterioration and all gaskets are replaced after any servicing.  Inspections of the storage area and process area help to ensure that all valves and components are quite capable of proper shut down to isolate and stop leaks.  In addition, both chemical feed systems are identically designed and adjacent to each other. This allows for streamlining safety, maintenance, and inspection procedures.  The close proximity also allows for efficient inspections and increases reaction time.  The SCBA's and gas detectors are tested on a routine basis for proper functioning.  Finally, the Westside plant site is located away from high residential areas.\n\n     The City of Tyler Westside Wastewater Treatment Plant has not had any accidental releases within the last five years that resulted in personal injury or property damage offsite or onsite.\n\n     Under the City of Tyler Emergency Management Plan, response procedures exist where by emergency evacuation measures will be implemented as required.  Any incidence of toxic or hazardous chemical leak or spill subject to off-site contamination will resu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35256,
      "SummaryText": "lt in a 911 call by Department personnel requesting Tyler's HAZMAT Team respond to the emergency.  Tyler Water Utilities complies with Federal and State HAZCOM reporting requirements, thus all chemical quantities and storage locations are on file with the Tyler Fire Department and Local Emergency Preparedness Committee (LEPC).  Tyler's HAZMAT possesses mobile communication capabilities enabling them to access the LEPC's CAMEO software (located at the County Fire Marshall's Office in the Smith county Office Building). Thus, the evacuation area is clearly defined and City of Tyler Emergency Response personnel will implement evacuation procedures in accordance with the Emergency Management Plan.  The State Emergency Response Commission has approved the emergency management Plan.\n\n  Operator's inspect the chlorine and sulfur dioxide areas at every shift and document the results in the daily log book.  The plant is staffed 24 hours with every operator being a certified wastewater operator by the Texas Commission on Environmental Quality.  In addition, plant safety meetings occur on a regular basis that review safety operations at all levels.  In addition, the wastewater superintendant maintains his office at the Westside Wastewater Plant.  The wastewater superintendant is also an emergency contact, his email address is ebrown@tylertexas.com."
    }
  ]
}