{
  "FacilityID": 35276,
  "FacilityName": "Simeus Foods International",
  "FacilityStr1": "212 Nuway Packing Road",
  "FacilityStr2": null,
  "FacilityCity": "Forest City",
  "FacilityState": "NC",
  "FacilityZipCode": "28043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37161",
  "LEPC": "Rutherford County LEPC",
  "FacilityLatDecDegs": "35.336111",
  "FacilityLongDecDegs": "-081.840556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 73145815,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Simeus Foods International",
  "OperatorStr1": "212 Nuway Packing Road",
  "OperatorStr2": null,
  "OperatorCity": "Forest City",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28043",
  "OperatorZipCodeExt": null,
  "RMPContact": "Butch Edwards",
  "RMPTitle": "Maintenance Suoertendent",
  "FTE": 54,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014959",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-06-05 00:00:00",
  "DeRegistrationEffectiveDate": "2020-01-01 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 35.33193,
  "FRS_Long": -81.85143,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50822,
      "AltID": "Meat processed from fresh",
      "FacilityID": 35276,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51976,
          "ProcessID": 50822,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66944,
          "ProcessID": 50822,
          "ChemicalID": 56,
          "Quantity": 45400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566944,
          "ProcessID": 50822,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 50823,
      "AltID": "Meat process from fresh",
      "FacilityID": 35276,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 51977,
          "ProcessID": 50823,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 66945,
          "ProcessID": 50823,
          "ChemicalID": 98,
          "Quantity": 65200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 566945,
          "ProcessID": 50823,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35276,
      "SummaryText": "EXECUTIVE SUMMARY\n\nTHE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIn this facility, we use Anhydrous Ammonia and propane, which are considered hazardous by the EPA. These chemicals must be used to provide cooling for he process and controlling the process heating. It is our policy to have programs in place dealing with safety precautions in handling these substances in order to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community. It is our policy to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which we handle ammonia and propane combined with the safe handling procedures that we use and the training of our personnel. \n\nThis facilities emergency response program is based on the IIAR?s ?Risk Management Guidelines Program for Ammonia Refrigeration? and NPGA?s LP Gas Handbook ?Guidelines for Developing Plant Emergency Response Procedures.? The plan has been provided and reviewed with the Rutherford County Local Emergency Planner Center. Coordination with the LEPC has been made to notify them through the emergency response plan to respond to incidents that may affect the public.\n\nSTATIONARY SOURCES AND REGULATED SUBSTANCES HANDLED\n\nThe Simeus Foods? manufacturing facilities is in the business of processing beef and pork. These products require cooking controls and cooling of the materials during and after being processed. There is one hazardous chemical (Anhydrous Ammonia) and one flammable (propane) used at this site for these purposes.\n\nAnhydrous Ammonia is the refrigerant used for the cooling process due to the low cost of the medium and the low temperatures that must be obtained. The ammonia is enclosed within a closed loop that removes hear from the products and storage rooms. The ammonia is evaporated by removing heat from the products and cooling areas at low temperature an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35276,
      "SummaryText": "d pressures and then dispenses the heat at high pressures and temperatures to outside air.\n\nThe ammonia system at the Simeus Foods Inc. contains 65,000 pounds of ammonia.\n\nPropane is also used at the facility. Propane is used in the cooking of the meat products. It is received from retailers by truck and stored in an 18,000 gallon tank. The maximum inventory of the tank is controlled at 85 percent level.\n\nThe maximum amount of propane that can be stored at this plant is 65,178 pounds.\n \nSUMMARY OF MAJOR HAZARDS\n\nCONSEQUENCE OF FAILURE TO CONTROL HAZARDS\n\nAMMONIA\n\nHealth Hazards\n\nAmmonia is a colorless gas with extremely pungent odor. Liquid ammonia vaporizes to a poisonous gas cloud.\n\nAmmonia is a severe irritant of the eyes. It penetrates the eyes more readily than any other alkali. Contact with liquid anhydrous ammonia and concentrated solutions can produce severe eye injury or blindness. Exposure of the eyes to high gas concentrations can cause temporary blindness and severe eye damage. Laceration or watering of the eyes can occur upon exposure to 150 ppm gas and higher.\n\nAmmonia is an irritant by inhalation. At increasing concentrations it can cause symptoms ranging from runny nose, coughing, chest pain, trouble with breathing, and death. It can cause severe breathing difficulties that are delayed in onset. Inhalation of concentrations of 2500 to 6500 ppm causes shortness of breath, bronchospasm, chest pain, and pulmonary edema (filling of the lungs with fluid) that may be fatal.\n\nExposure of the skin to liquid anhydrous ammonia or high concentrations of the gas can cause first and second degree burns to the skin. Vapor concentrations of 10,000 ppm are mildly irritating to moist skin, while 30,000 ppm or greater causes a stinging sensation and can produce skin burns and blisters. These high concentrations of ammonia are corrosive to moist skin and other body tissues.\n\nAmmonia or ammonia with oil or other debris is an explosion hazard when exposed to flame or fir"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35276,
      "SummaryText": "e. The Lower Explosive Limit (LEL) is 16% and Upper Explosive Limit (UEL) is 25% by volume in air. Elevated temperatures can cause containers of the substance to explode. Ammonia emits toxic fumes when exposed to heat. When heated to temperatures above 850?F, ammonia will emit hydrogen gas. The auto ignition temperature is 1204?F if catalyzed by iron.\n\nAmmonia can react to form potential explosive reactions with halogens (e.g., chlorine, bromine). It can react to form potential violent or explosive reactions with strong oxidizers, hypo chlorite bleaches, silver compounds, mercury compounds, gold, other metals and acids.\n\nCommon Exposure and Control Methods\n?    Process enclosure\n?    Local exhaust ventilation\n?    General dilution ventilation\n?    Personal protective equipment\n?    Use of water\n?    Area monitoring (with alarm systems)\n\nPotential for Exposure to Ammonia\n\nThe refrigeration operation is a closed system with no purposeful exposure to ammonia. As a closed system, exposure potentials are primarily related to equipment failure, fugitive emissions from improperly adjusted or worn valve packings, pump and compressor seals and pipe connector gaskets, or mistakes in operation of the system.\n\nPROPANE\n\nHealth Hazards\n\nPropane is a colorless gas with faint petroleum-like odor. It is shipped as liquefied gas under its vapor pressure. For transportation it may be stenched. Contact with the liquid can cause frostbite. It is easily ignited. Its vapors are heavier than air and a flame can flash back to the source of leak very easily. This leak can be either a liquid or vapor leak. It can asphyxiate by the displacement of air. Under fire conditions the cylinders or tank cars may violently rupture and rocket.\n\n\n\nTHE FIVE YEAR HISTORY\n\nThere has been only one incident during the last five years at the Simeus Foods Inc. plant site involving ammonia. This incident was the result of a valve bonnet coming off during operations of the valve and 600 pounds of ammonia was lost. There were no in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35276,
      "SummaryText": "juries, deaths or damage to the environment as a result of this incident. This incident was investigated and improvements were made in maintenance and operating procedures.\n\nThere have been no incidents in the last five years for the propane system.\n\nHOW RELEASES ARE PREVENTED\n\nHistorically, exposures to ammonia most often occur from:\n?    Leaking valve stem packing glands while opening or closing a valve\n?    Leaking at valve flanges or other piping connections\n?    Pressurizing any equipment with sight glasses (especially the round type)\n?    Mistakenly venting gas through open equipment to the atmosphere\n?    Malfunctioning pressure relief valves\n?    Mechanical seal failures on compressors and pumps\n\nRELEASE PREVENTION PROGRAM AND PREVENTION STEPS\n\nSimeus Foods Inc. complies with the EPA?s Accidental Release Preventative Rule, with all applicable state codes and regulations for ammonia and propane. Management systems are in place to administer the RMP prevention programs for ammonia and propane. The maintenance supervisor is the responsible person for leading this program.\n\nSimeus Foods Inc. is in compliance with OSHA?s PSM rule for ammonia. The RMP?s accidental release preventative programs are acquired by:\n\n?    Effective preventative maintenance programs\n?    Reviews for proper design\n?    Development of and following operating procedures\n?    A mechanical integrity program that includes equipment testing procedures\n?    Training to be aware of potential exposure situations and using exposure prevention procedures and/or protective equipment\n\nEMERGENCY RESPONSE PLAN\n\nThis facilities emergency response program is based on the IIAR?s ?Risk Management Guidelines Program for Ammonia Refrigeration? and NPGA?s LP Gas Handbook, ?Guidelines for Developing Plant Emergency Response Procedures.? An emergency response plan is in place at Simeus Foods Inc. to deal with emergencies and incidents that might take place on this site. The site maintains it?s own HAZMAT teams. Training for these functions is g"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35276,
      "SummaryText": "iven annually per state requirements. Onsite drills are also scheduled as part of emergency response plan to familiarize employees of the dangers of ammonia and propane and the proper response to alarms and evacuations.\n\nThe plan has been provided and reviewed with the Rutherford County Local Emergency Planner Center. Coordination with the LEPC has been made to notify them through the emergency response plan to respond to incidents that may affect the public.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nSimeus Foods International is putting together an updated training program to enhance the skills of the refrigeration operators and to increase their abilities to respond to emergencies. This includes onsite refrigeration training courses, operating procedure reviews and drills."
    }
  ]
}