{
  "FacilityID": 35331,
  "FacilityName": "Crompton Corporation - North Plant",
  "FacilityStr1": "1000 Morgantown Industrial Park",
  "FacilityStr2": null,
  "FacilityCity": "Morgantown",
  "FacilityState": "WV",
  "FacilityZipCode": "26501",
  "Facility4DigitZipExt": "9624",
  "FacilityCountyFIPS": "54061",
  "LEPC": "Monongalia County LEPC",
  "FacilityLatDecDegs": "39.610270",
  "FacilityLongDecDegs": "-079.975430",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "LW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 88400325,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Crompton Corporation",
  "OperatorStr1": "1000 Morgantown Industrial Park",
  "OperatorStr2": null,
  "OperatorCity": "Morgantown",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26501",
  "OperatorZipCodeExt": "9624",
  "RMPContact": "Roger Evans",
  "RMPTitle": "EHS Manager",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045131",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.61111,
  "FRS_Long": -79.97333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50929,
      "AltID": "TPP - North Plant",
      "FacilityID": 35331,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52084,
          "ProcessID": 50929,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67123,
          "ProcessID": 50929,
          "ChemicalID": 59,
          "Quantity": 146000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 59,
            "ChemicalName": "Phosphorus trichloride  [Phosphorous trichloride]",
            "CASNumber": "7719-12-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567123,
          "ProcessID": 50929,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35331,
      "SummaryText": "1.0  Introduction\n\nThis Risk Management Plan is part of Crompton Corporation?s continuing commitment to minimize the potential impact from our facility on our workers, our community neighbors, or the environment.  It is the stated policy of Crompton Corporation to safely manage our site operations.  In addition, we have prepared contingency plans to be used in the unlikely event that a major accident should occur.  The efforts at our Morgantown, West Virginia facility have been recognized by the U.S. Occupational Safety and Health Administration (OSHA), who oversees our programs, as among the best in the nation for worker safety.\n\nWe believe it is important for all interested parties to have access to information that can help them better understand our business and our facility.  If you have any questions about this document, or any other aspect of our company or our plans, please contact our Environmental Health and Safety Manager at (304) 284-2380.\n\n2.0  Accidental Release Prevention and Emergency Response Policies\n\nOur company is committed to operating safe and environmentally sound chemical production facilities everywhere we do business.  Protection of our neighbors and workers is the highest priority.  This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities.\n\nIn order to provide top quality products for our customers, the Crompton Corporation Morgantown, West Virginia facility uses in its manufacturing process some raw materials that are classified as toxic or flammable.  We are committed to comply with governing laws, regulations, and engineering standards as well as systematic assessments to manage and maintain a safe operation.  Our operating practices and procedures ensure that numerous controls are implemented to prevent an accidental release of a chemical.  However, if a major release does occur, our trained on-site emergency response organization will b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35331,
      "SummaryText": "e activated.  This organization includes medical and chemical emergency response teams.\n\nThe outstanding programs at the Morgantown facility have earned the OSHA STAR award, presented by the Occupational Safety and Health Administration for exemplary safety management.  This is OSHA?s highest award for safety performance.\n\n3.0  Description of the Facility and Regulated Substances\n\nCrompton Corporation operates two facilities, both located in Morgantown Industrial Park in Morgantown (Westover), West Virginia.  These are known as the ?North Plant? and the ?South Plant?.  Both plants were built in 1965 and currently employ about 200 people in the Morgantown area.  Crompton Corporation manufactures millions of pounds of antioxidant chemicals marketed under trade names such as ULTRANOX?, WESTON?, and others.  Our products are used in various plastics, inks, coatings, and adhesives for improved ultraviolet (UV) heat, color, and processing stability.\n\nThis site is also home to a Technology Center, where Crompton Corporation conducts advanced research in specialty chemical technology.\n\n4.0  Hazard Assessment Results\n\nAs part of our risk management planning, we have specifically identified the type of event that, should it ever occur, would have the most negative impacts on our workers and our neighbors.  This is known as the Worst-Case Scenario (WCS).  As defined by EPA, we are required to assume that the numerous engineering and administrative safety controls we have in place to prevent or mitigate such accidents have all failed at once.  EPA defines a worst-case scenario as a catastrophic failure, which is an event that essentially results in the instantaneous release of the contents in the largest single vessel on-site.\n\nA worst-case and alternative release scenario were developed for the North and South Plants using the RMP Comp software and ALOHA software.  The scenarios predicted the endpoint for each release scenario based upon the data input.\n\n5.0  General Accidenta"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35331,
      "SummaryText": "l Release Prevention/Chemical Specific Prevention Steps\n\nCrompton Corporation has implemented a comprehensive program to prevent accidental releases of highly hazardous chemicals known as Process Safety Management (PSM).  PSM is an integral part of working safely at Crompton Corporation facilities.  PSM ensures that proper safety information is in place; operating procedures are followed; chemical hazards are identified; employees and contractors are trained; and critical equipment is properly inspected and maintained.  PSM satisfies the accidental release prevention requirements of the RMP.\n\nSome of the many, specific safety features to prevent chemical accidents include:\n\n?  Computer controlled safety systems on the phosphorous trichloride storage and transfer systems to ensure that any deviations from the intended operating conditions are immediately identified and corrected;\n\n?  Safety procedures that reduce the potential for human error which could lead to a storage tank overfill;\n\n?  Secondary containment dikes around storage tanks and tank truck unloading areas to contain a spill;\n\n?  Building enclosures around phosphorous trichloride tank truck unloading and storage equipment to contain a leak;\n\n?  Transfer of phosphorous trichloride liquid is done with a double-walled or \"pipe-within-a-pipe\" system to prevent leaks to the atmosphere - includes a leak detection system;\n\n?  Gas sensors to detect and warn of a release of phosphorous trichloride;\n\n?  Phosphorus trichloride unloading operations are continuously attended by operators trained in DOT regulations;\n\n?  Extensive safety information about the processes reviewed with employees;\n\n?  Written operating procedures that include emergency response actions;\n\n?  Comprehensive employee and contractor training programs to promote consistently safe work-practices;\n\n?  Maintenance programs to ensure ongoing equipment reliability - includes equipment testing and inspection;\n\n?  A safety procedure to review proposed "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35331,
      "SummaryText": "plant modifications before they are implemented for possible hazards (this is called \"Management of Change\");\n\n?  Safety pre-qualification for all contractors;\n\n?  Safety reviews prior to startup of our processes; and,\n\n?  Safety-permit procedures that control hazards during special operations such as welding and other maintenance activities.\n\n6.0  FIVE YEAR ACCIDENT HISTORY\n\nOver the long term, the Morgantown, WV site has had a positive accident prevention record that demonstrates its commitment to public and worker safety.  Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.\n\nEPA requires that all incidents involving RMP-regulated chemicals that resulted in any off-site impact or significant on-site impacts are reported in this document.  During the previous five-year period, no such incidents have occurred at the plantsite involving phosphorous trichloride.\n\n7.0  EMERGENCY RESPONSE PROGRAM\n\nThe Morgantown, WV site maintains a written emergency response program designed to protect workers, the public, and the environment in the event of a major accidental release.  All of our employees are trained in the proper response to an incident.  We also invest in the equipment needed to respond to emergencies, both on-site and off-site.  Our medical and chemical response teams work closely with area hospitals, industries, and other response organizations in the Monongalia County area.\n\nFor example, recent emergency drills, organized and directed by the Crompton emergency teams, have included:\n\n?  A simulated liquid waste incident conducted in September 1996 with Monongalia County Emergency officials, and police departments from the City of Westover, West Virginia;\n\n?  A simulated chemical tanker truck incident with Monongalia County Emergency services conducted during January 1997;\n\n?  A simulated phosphorus trichloride incident and community-wide drill with the Westover Volunteer Fire Department, Monongalia Eme"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35331,
      "SummaryText": "rgency Services and area hospitals during June 1998.\n\n?  Participated in the Morgantown Mock Disaster Drill, West Virginia Regional Response Team, October 2002.\n\n?  Participated in Mock Biological Attack Drill, Mountaineer Express, February 2004.\n\nOngoing training exercises are important to the company's emergency response organization and help better prepare our partners in the community for emergency response necessary in the unlikely event of a major industrial incident.\n\nInformation about how to shelter yourself and your family in the event of a chemical emergency can be found in the Bell Atlantic telephone directory.\n\nCrompton personnel have helped develop emergency preparedness plans for local communities.  In addition, they are members of local emergency planning and emergency preparedness groups.  As consistent with the Monongalia County Emergency Response Plan, Crompton will work through the Monongalia County Emergency Management Commission to communicate any appropriate actions to be taken by the public in the event of a chemical emergency.\n\n8.0  PLANNED CHANGES TO IMPROVE SAFETY\n\nCrompton Corporation is committed to continuously improving the overall safety and environmental performance record at the Morgantown, WV facility.  Some of the specific planned changes aimed at improving safety are:\n\n?  Continuing development of best management practices under OSHA's Voluntary Protection Program (VPP) and Process Safety Management Standard (PSM);\n\n?  Submission for OSHA VPP renewal in August 2004;\n\n?  Implementing additional training programs for employees to further reduce the chance of human error leading to a workplace injury or an accidental release;\n\n?  Continuing active involvement in the Local Emergency Planning Committee and support emergency preparedness programs."
    }
  ]
}