{
  "FacilityID": 35334,
  "FacilityName": "Air Products, Sacramento",
  "FacilityStr1": "5025 83rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95826",
  "Facility4DigitZipExt": "4743",
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.529722",
  "FacilityLongDecDegs": "-121.398889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.airproducts.com",
  "FacilityEmailAddress": "cargilrc@apci.com",
  "FacilityDUNS": 188587349,
  "ParentCompanyName": "Air Products and Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 3001070,
  "Company2DUNS": 0,
  "OperatorName": "Race Cargile",
  "OperatorStr1": "5025 83rd Street",
  "OperatorStr2": null,
  "OperatorCity": "Sacramento",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95826",
  "OperatorZipCodeExt": "4743",
  "RMPContact": "Race Cargile",
  "RMPTitle": "Plant Manager",
  "FTE": 8,
  "OtherEPAFacilityID": "CAD982023665",
  "EPAFacilityID": "100000001972",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-30 00:00:00",
  "SafetyInspectionBy": "Sacramento County EMD",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 38.52983,
  "FRS_Long": -121.39881,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50932,
      "AltID": "Liquid Hydrogen Plant",
      "FacilityID": 35334,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52087,
          "ProcessID": 50932,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67126,
          "ProcessID": 50932,
          "ChemicalID": 155,
          "Quantity": 112000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 49768,
              "ProcessChemicalID": 67126,
              "ChemicalID": 149,
              "_chemical": {
                "ChemicalID": 149,
                "ChemicalName": "Hydrogen",
                "CASNumber": "1333-74-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 49769,
              "ProcessChemicalID": 67126,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 567126,
          "ProcessID": 50932,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35334,
      "SummaryText": "CalARP Risk Management Plan\nAir Products and Chemicals, Inc.\nSacramento, California\nJune 2004\n\n\n\n    EXECUTIVE SUMMARY\n\n1.      Accidental release prevention and emergency response policies:\n\nAt this facility, we manufacture gaseous and liquid hydrogen.  Hydrogen, in the amounts \nhandled by our facility, is considered hazardous by the EPA.  It is our policy to adhere to \nall applicable Federal and state rules and regulations.  In addition, Corporate Practice \n1002A, Emergency Response Program, and 1003A Planning for Emergencies, \nspecifically highlight the Air Products' commitment of being prepared for and \nresponding promptly and appropriately to emergency events. Air Products manages the \nsafety of the regulated processes by means of operating procedures, equipment testing \nand inspections, safety devices (e.g., alarms, shutdowns, instrumentation, relief devices) \ninherent in the design of this facility and other controls and systems such as the site \nsecurity system, communications system, fire control system, and flammable gas \nmonitoring system, designed and used to help prevent and control accidental releases of \nhazardous chemicals.  Safe work practices and training of our personnel supplement the \ninherent safe design of the plant.\n\nOur emergency response program is based upon OSHA's HAZWOPER regulation.  The \nemergency response plan includes procedures for the notification of the local fire \nauthority and Hazardous Materials unit so that appropriate measures can be taken by \nlocal emergency responders to control accidental releases.\n\nThis document has been prepared in accordance with the EPA's Risk Management Plan \nregulation (40 CFR, Part 68). The substances and processes considered during the \npreparation of this RMP and the scenarios described were selected based on criteria \nestablished in the regulation.\n\n2.    The stationary source and regulated substances handled:\n\nThe Sacramento facility mailing address is 5025 83rd Street, Sacramento, California and it \nis "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35334,
      "SummaryText": "located at 38 31' 47\" N and 121 23' 56\" W.  The facility is owned and operated by Air \nProducts Manufacturing Corporation, a wholly owned facility of Air Products and \nChemicals, Inc.  The facility has the following registrations: RMP ID 100000001972, \nEPA ID CAD082023665 and a Dunns # 003002070.  The site's manager and emergency \ncontact is Race Cargile (916) 381-1776.  \n\nThe primary purpose of this facility is the manufacturing of gaseous and liquid hydrogen. \nGaseous hydrogen is used by our customer in their manufacturing process. Gaseous \nhydrogen is produced in the reformer process (See Reformer Process below) and \ntransmitted to the customer via pipeline. The pipeline is connected to a 20,000 gallon \nliquid hydrogen backup tank that supplies the pipeline when the reformer is off-line.  \nGaseous hydrogen exists in various stages of purity at the Sacramento plant, depending \nupon where it is in the manufacturing process.  Ultimately the product gaseous hydrogen \nsent to P&G is pure hydrogen. \n\nLiquid hydrogen is also produced from the hydrogen gas taken from the reformer \nprocess. Liquid hydrogen is produced by passing  hydrogen gas through a series of \ncompression, cooling, and expansion steps. The liquid hydrogen is stored in two 70,000 \ngallon and one 20,000 gallon liquid hydrogen tanks.  Liquid hydrogen is loaded into \nhighway tankers and shipped to various off-site customers.  Liquid hydrogen stored on \nsite is pure hydrogen.\n\nREFORMER PROCESS: Hydrocarbon based gases (natural gas or methane) are received \nby our plant via pipeline and used as our feedstock.  The feedstock is then compressed \nand \"cracked\" in our reformer (furnace).  By exposing the feedstock to a catalyst in the \npresence of heat (approximately 1,500 degrees F.) and steam, a chemical reaction takes \nplace that converts the feedstock into hydrogen, carbon monoxide and carbon dioxide.  \nThe carbon monoxide and carbon dioxide is then separated from the hydrogen in \nadsorbers.  The pure hydrog"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35334,
      "SummaryText": "en is then compressed and delivered to customers or the \nhydrogen liquefier via pipe. \n\nThe regulated substance handled at this facility is the flammable gas  hydrogen.   The site \nstores approximately 160,000 gallons of liquid hydrogen in two 70,000 gallon tanks and \none 20,000 gallon tank.  This is equivalent to approximately 95,000 pounds of liquid \nhydrogen at 14.7 psia.  .  The site also has a small amount of gaseous hydrogen \n(approximately 200 pounds) contained in the operating process equipment and lines.\n\n\n\n3.      The general accidental release prevention program and specific prevention \nsteps:\n\nThe facility developed prevention program elements based on the Federal EPA's \nAccidental Release Prevention Plan, the California Accidental Release Prevention \nProgram (CalARP), and OSHA's Process Safety Management (PSM) regulation.  This \nfacility was designed and constructed to comply with applicable state and industry codes.\n\nAs part of the basic prevention plan a formal HAZOP was performed considering hazards \nsuch as toxic release, fire, explosion, runaway reactions, over pressurization, corrosion, \noverfilling, process contamination, equipment failure, loss of cooling, heating, electrical \npower, and instrument air, and earthquakes.  All PHA and pre-startup recommendations \nwere identified and have been addressed since the initial CalARP program was put in \nplace.\n\nDesign and operations process controls used to control potential process related incidents \ninclude vents, relief valves, check valves, manual shutoffs, automatic shutoffs, interlocks, \nalarms and procedures, grounding equipment, rupture disks and excess flow devices.  \nMitigation systems include the firewater monitors and deluge systems.  Process area \ndetectors are employed to monitor system operations.  Design features employed to \nprevent and/or mitigate possible release events include bullards (bump posts) to protect \nprocess and storage equipment and structural design to meet Seismic Zone 4 sta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35334,
      "SummaryText": "ndards.\n\nThe Sacramento facility employs both company wide and site-specific operating \nprocedures to assure safe and proper plant operations.  In addition to plant operations \ntraining all personnel complete the company Environmental, Health and Safety training \nand maintain competence through regularly scheduled refresher courses and program \nupdates.  A mechanical integrity program has been developed and is in place for the \nSacramento facility for all RMP covered process systems.  The Sacramento facility \nparticipates in the Production Systems Organization Facility Change Notice \n(Management of Change) program assuring the proper level of technical review for all \nproposed facility changes.  Compliance audits of RMP systems and all EH&S systems by \nour Corporate Process Safety Group and the Corporate Assurance Group.  All incidents \nthat could have a safety and/or environmental impact are entered into the Corporate \nIncident Tracking System and evaluated both by plant and corporate personnel.  Apollo \nRoot Cause Analyses are performed on any serious incidents or near misses and are \nreviewed by the PSO Incident Review Committee comprised of senior operations \nmanagement.  All operations employees are engaged directly and continuously through \nthe company's Basic Safety Process.  Hot work permits are controlled under Section 5 ? \nSafe Systems of Work, in the Air Products Global EH&S standards.  All contractors \ncontractor firms are evaluated prior to employment both in terms of technical competence \nand safety performance.  All contract workers participate in safety indoctrination training \nbefore being allowed to work on-site.\n\n\n4.      Five-year accident history:\n\nThere have been no accidents involving or accidental releases of flammable gas that \nresulted in any deaths, injuries, or significant property damage on site, or known off-site \ndeaths, injuries, evacuations, sheltering in place, property damage, or environmental \ndamage in the past five years.\n\n5.      The"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35334,
      "SummaryText": " emergency response program:\n\nThe facility's emergency response program is based upon OSHA's HAZWOPER \nstandard.  At this site, employees are trained to recognize emergencies and initiate \nemergency response from outside agencies.  They have been trained to OSHA's First \nResponder Awareness Level.  The employees receive annual refresher training in their \nrole in the emergency plan.  Emergency response activities have also been coordinated \nwith the City of Sacramento Fire Department  Hazmat Team  for emergencies related to \nthe hydrogen process.  Periodic site meetings  are conducted with the Fire Department  to \nreview the effectiveness of our emergency procedures.\n\n6.      Planned changes to improve safety:\n\nThe facility resolves recommendations from PHAs and Incident Investigations, some of which\nmay result in modifications to the plant design and operating procedures.  A Security and \nVulnerability Assessment by an independent auditor was conducted in May of 2003.\nImplementation of the resulting recommendation is currently underway.  Currently there\nare no other facility changes planned.\n\nCommitment\nDue Date\nResponse to Security and Vulnerability \nAssessment\n12/31/05"
    }
  ]
}