{
  "FacilityID": 35348,
  "FacilityName": "Union Carbide Marine Terminal",
  "FacilityStr1": "2800 Loop 197 South",
  "FacilityStr2": "P.O. Box 471",
  "FacilityCity": "Texas City",
  "FacilityState": "TX",
  "FacilityZipCode": "77592",
  "Facility4DigitZipExt": "0471",
  "FacilityCountyFIPS": "48167",
  "LEPC": "Galveston County-Texas City LE",
  "FacilityLatDecDegs": "29.361667",
  "FacilityLongDecDegs": "-094.918056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dow.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1289008,
  "ParentCompanyName": "The Dow Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Houston Dow Center",
  "OperatorStr1": "400 W. Sam Houston Parkway S",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77042",
  "OperatorZipCodeExt": "1299",
  "RMPContact": "Marilyn Doescher",
  "RMPTitle": "Responsible Care Leader",
  "FTE": 35,
  "OtherEPAFacilityID": "77592NNNCRB2600",
  "EPAFacilityID": "100000129933",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-01422",
  "SafetyInspectionDate": "2004-01-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-08-23 00:00:00",
  "DeRegistrationEffectiveDate": "2004-07-01 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 29.36034,
  "FRS_Long": -94.90717,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility Change of Ownership",
  "_processes": [
    {
      "ProcessID": 50959,
      "AltID": "Marine Terminal",
      "FacilityID": 35348,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52114,
          "ProcessID": 50959,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67220,
          "ProcessID": 50959,
          "ChemicalID": 29,
          "Quantity": 21000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 67221,
          "ProcessID": 50959,
          "ChemicalID": 129,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567220,
          "ProcessID": 50959,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567221,
          "ProcessID": 50959,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35348,
      "SummaryText": "\nThe Dow Chemical Company\n\nUnion Carbide Marine Terminal\n\nEPA ID# 1000 0012 9933\n\n\n\nRisk Management Plan Five-Year Update \n\nExecutive Summary\n\n\n\nDescription of the Facility and Purpose of Submittal \n\n\n\nUnion Carbide Texas City Operations is a manufacturing facility that annually produces more than \n\nfive (5) billion pounds of chemicals and plastics including hydrocarbons, specialty polymers, \n\nsolvents, intermediates, monomers and industrial products.  Union Carbide Marine Terminal is \n\nlocated three (3) miles from Union Carbide Texas City Operations and assists in the \n\ntransportation and distribution of chemicals and products from the main plant.  In accordance with \n\nU.S. EPA regulation 40 CFR 68, the U.S. EPA has identified quantities for 140 toxic or flammable \n\nsubstances that require a facility to comply with the Risk Management Program (RMP) rule when \n\nunit inventories exceed threshold quantities.  The RMP rule requires a facility to report the unit \n\ninventory for each RMP substance that exceeds threshold quantities, along with an EPA \n\napproved chemical release prevention program.  In addition, 40 CFR 68 requires all RMP \n\ncovered facilities to update its Risk Management Plan (RMPlan) every five (5) years or six (6) \n\nmonths after an RMP reportable incident. Union Carbide Marine Terminal initially submitted its \n\nRMPlan in June 1999.  In compliance with 40 CFR 68, Union Carbide Marine Terminal is \n\nsubmitting the five (5) year update to its initial RMPlan submittal.\n\n\n\nUnion Carbide Marine Terminal currently holds the following RMP-regulated substances above \n\nthreshold quantities:\n\n\n\nPropylene - CAS No. 115-07-1\n\nVinyl Acetate Monomer - CAS No. 108-05-4\n\n\n\nKey Offsite Consequence Analysis \n\n\n\n40 CFR 68 requires all facilities, subject to the rule, to conduct an offsite consequence analysis to \n\nprovide information about any potential consequences of an accidental chemical release to the \n\npublic and state and federal environmental agencies.  Offsite cons"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35348,
      "SummaryText": "equence analyses are \n\nessential in identifying potential hazards of accidental release. The offsite consequence analysis \n\n(OCA) comprises 2 elements, a worst case scenario and an alternative release scenario.\n\n\n\nWorst Case Scenarios\n\n\n\nOffsite consequence analyses for the worst-case scenarios (WCS) were conducted using the \n\nEnvironmental Protection Agency's (EPA) RMP Offsite Consequence Analysis Guidelines.  The \n\nRMP sets forth specific criteria that must be incorporated in modeling the worst-case scenarios.  \n\nThe EPA defines a WCS as one that results in the greatest distance from the point of release to a \n\nspecified endpoint.  As defined by the rule, the endpoint for a toxic substance is a specified \n\nconcentration while for flammables it is a specified overpressure from a vapor cloud explosion \n\n(VCE).\n\nThe scenarios for Union Carbide Texas City Operations were calculated using the EPA OCA \n\nLook Up Tables.  Although numerous controls are in place to prevent chemical releases and \n\nmanage such consequences should an incident occur, no credit for active mitigation measures \n\nwas taken into account in evaluating these scenarios.\n\n\n\n\n\nAlternative Release Scenarios\n\n\n\nAlternative Release Scenarios (ARS) assess the potential hazards that are more realistic than \n\nworst-case scenarios and are designed to assist in the development of emergency response \n\nplans.  EPA's RMP Offsite Consequence Analysis Guidelines were used in modeling the \n\nalternative release scenarios.  A summary of the alternative release scenarios for Union Carbide \n\nMarine Terminal is provided in Table 3.  As required, alternative release scenarios are created for \n\nboth a toxics and flammables.  These scenarios were calculated using the EPA OCA Look Up \n\nTables.  Although numerous controls are in place to prevent chemical releases and manage such \n\nconsequences should an incident occur, no credit for active mitigation measures was taken into \n\naccount in evaluating these scenarios.\n\nFive-Year A"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35348,
      "SummaryText": "ccident History\n\nUnion Carbide Marine Terminal, in the past five (5) years, has not incurred any chemical releases \n\nthat resulted in any known onsite or offsite deaths, injuries, significant damage, evacuations or \n\nsheltering in place.  \n\n\n\nAccidental Release Prevention Policies\n\n\n\nUnion Carbide Marine Terminal is committed to operate and maintain its facility in a safe and \n\nenvironmentally friendly manner.  Union Carbide Marine Terminal incorporates Dow Chemical's \n\nGlobal Management Systems and Emergency Response Plan with the rules and regulations set \n\nforth by the U.S. EPA Risk Management Plan and OSHA's Process Safety Management Program \n\nto ensure the safety of employees and public surroundings.\n\nUnion Carbide Marine Terminal designed its accident prevention program to comply with both the \n\nEPA RMP rule and with OSHA's Process Safety Management.  Union Carbide incorporates the \n\nDow Chemical Operating Discipline Management Systems (ODMS), which globalize all Dow \n\nfacilities with the same environmental, health, and safety regulations.  Included in Dow's ODMS \n\nare elements addressing the following:\n\n\n\n-    Equipment Design - Vessels (including shipping containers) and other process \n\n    equipment are designed according to recognized industry standards and/or governmental \n\n    requirements.\n\n-    Process Safety Information - Chemical hazard, process technology, and equipment \n\n    information is documented, maintained up-to-date, and available to operating personnel.\n\n-    Process Hazard Analysis (PHA) - PHAs are conducted every three (3) years to identify \n\n    major process hazard scenarios and to recommend corrective action(s) needed to \n\n    prevent their occurrence.\n\n-    Episodic Risk Management - Periodic reviews are conducted to identify hazards which \n\n    could have significant community impact and to recommend corrective action(s) needed \n\n    to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment \n\n    techniques.\n\n-    Operational Safety Standar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35348,
      "SummaryText": "ds - Design requirements for active and passive mitigation \n\n    controls used to prevent major process hazards are documented in operational safety \n\n    standards.\n\n-    Operating Procedures - Operating procedures provide detail on how to safely operate a \n\n    process and are maintained up-to-date.\n\n-    Operator Training/Certification Program - The plant has a training and testing program \n\n    which provides operators with the proper skills and knowledge prior to allowing them to \n\n    independently operate a process.\n\n-    Technical Staff Training and Support - Trained technical staff employees are available 24 \n\n    hours a day to support operations.\n\n-    Maintenance Procedures - The plant has specific procedures for maintaining process \n\n    equipment so that it operates safely.\n\n-    Maintenance Training -  The plant trains persons who perform routine or complex \n\n    maintenance tasks on process equipment.\n\n-    Mechanical Integrity Program - Vessels (including shipping containers) and other \n\n    process equipment are periodically tested and/or inspected to ensure safe operation of \n\n    process equipment, following recognized industry standards and/or governmental \n\n    requirements.\n\n-    Management of Change (MOC) - The plant has a management system to ensure that \n\n    modified facilities and processes will be safe to operate.\n\n-    Pre-startup Safety Review - Reviews are conducted just prior to startup to ensure that \n\n    modified facilities and processes are safe for operation.\n\n-    Incident Investigation - The plant has a program to ensure that accidents and incidents \n\n    are properly investigated to determine the cause(s) and to implement corrective action(s) \n\n    that are needed to prevent the event from reoccurring.\n\n-    Employee Participation - The plant has a program to involve employees in prevention \n\n    program elements.\n\n-    Hot Work Permit - The plant has a procedure to ensure that welding, cutting, and brazing \n\n    are safely performed in areas where flammables or combustible material may be present.\n\n-    Contra"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35348,
      "SummaryText": "ctor Safety Program - The plant has a procedure to ensure that contractors are \n\n    properly trained and perform their work in compliance with safety requirements.\n\n-    Compliance Audits - Periodic corporate and plant-led audits are conducted to ensure that \n\n    process operations comply with governmental and corporate requirements.\n\n-    Operational Safety Program - Union Carbide has a comprehrensive program to ensure \n\n    that all the elements listed are implemented at every Union Carbide location.  This \n\n    program includes accountabilities for timely and proper implementation of the program \n\n    elements.\n\n\n\nThese general prevention elements are parts of an overall management system to prevent \n\naccidental chemical releases.  Union Carbide and its employees are committed to the standards \n\nthat these management systems set, and have specific accountabilities and controls to ensure \n\nthat they are meeting their own high standards for accident prevention.\n\n\n\nEmergency Response Program\n\n\n\nUnion Carbide Marine Terminal maintains a written emergency response program to protect \n\nworker and public safety, as well as the environment.  The program consists of procedures for \n\nresponding to releases of hazardous substances, including fire or explosion and is updated when \n\nnecessary based on modifications made to the facility. \n\nThe procedures address all aspects of emergency response, including:\n\n\n\n- Proper first-aid and medical treatment for exposures.\n\n- Evacuation plans and accounting for personnel after an evacuation.\n\n- Notification of local emergency response agencies and the public if a release occurs.\n\n- Post-incident cleanup and decontamination requirements.\n\n- Inspecting, testing, maintaining, and using emergency response equipment.\n\n\n\nUnion Carbide Marine Terminal maintains a trained emergency squad to handle fire, explosions, \n\ntoxic vapor releases, spills, and medical emergencies.  The facility trains and drills with local \n\nemergency responders to enhance their skills a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 35348,
      "SummaryText": "nd tactics for responding to an accidental \n\nchemical release.  Critiques are held on drills and actual events.  \n\nThe emergency response program provides the essential planning and training for effectively \n\nprotecting workers, the public, and the environment during emergency situations.  Detailed \n\nemergency response plans are developed and coordinated with the Texas City/La Marque Local \n\nEmergency Planning Committee (LEPC).\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nUnion Carbide Marine Terminal continually strives to improve its safety-related systems.  Dow \n\nChemical's Management Systems (ODMS) has globalized its policies and procedures to provide \n\neach facility with the most-improved and efficient means to minimize environmental impacts on-\n\nsite and to the public.  Union Carbide Marine Terminal also continues to improve by implementing \n\nan incident investigation database known as GIRD (Global Incident Reporting Database) to \n\nmonitor potential risks of future incidents.  These improvements, along with monthly reviews of \n\ncurrent safety protocols, reduce the risk of future incidents.     \n\n\n\n\n\n\n\n    \n\n"
    }
  ]
}