{
  "FacilityID": 35341,
  "FacilityName": "Maine Independence Station",
  "FacilityStr1": "125 Shore Road",
  "FacilityStr2": null,
  "FacilityCity": "Veazie",
  "FacilityState": "ME",
  "FacilityZipCode": "04401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23019",
  "LEPC": "Penobscot County LEPC",
  "FacilityLatDecDegs": "44.823889",
  "FacilityLongDecDegs": "-068.708056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.duke-energy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 949448104,
  "ParentCompanyName": "Casco Bay Energy Company, LLC",
  "Company2Name": "Duke Energy North America",
  "CompanyDUNS": 609191705,
  "Company2DUNS": 0,
  "OperatorName": "Casco Bay Energy Company",
  "OperatorStr1": "125 Shore Road",
  "OperatorStr2": null,
  "OperatorCity": "Veazie",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04401",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gonzalo Garcia",
  "RMPTitle": "Plant Manager",
  "FTE": 20,
  "OtherEPAFacilityID": "ME0036188",
  "EPAFacilityID": "100000167801",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A-728-71-A-N",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 44.82389,
  "FRS_Long": -68.70806,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 50942,
      "AltID": "SCR System",
      "FacilityID": 35341,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52097,
          "ProcessID": 50942,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67143,
          "ProcessID": 50942,
          "ChemicalID": 57,
          "Quantity": 159200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567143,
          "ProcessID": 50942,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35341,
      "SummaryText": "Maine Independence Station\nExecutive Summary ? Risk Management Plan\nModifications to meet the requirements of RMP Submit 2004\n\n\n1.    Purpose\n\nThis executive summary is part of the information Maine Independence Station (MIS) is required to submit to the U.S. Environmental Protection Agency (EPA) relating to accidental release prevention.  More important, it is an integral part of a greater commitment by MIS owners, Casco Bay Energy Company and Duke Energy North America, to protect the health and safety of its employees, customers, and the communities they serve.\n\n2.    Background Scope Purpose\n\nMIS is a single unit, 520 MW natural gas-fueled electric generating plant, located in Veazie, Maine.  MIS is a new plant that began operating in the spring of 2000.  As part of its air pollution control technology, MIS uses selective catalytic reduction (SCR).\n\nThe SCR process removes nitrogen oxides from exhaust gases produced during combustion of fossil fuels in the gas turbines when generating electricity.  The SCR process introduces aqueous ammonia into the exhaust gas stream and then passes the mixture through a catalyst bed.  The resultant chemical reaction generates nitrogen gas and water as the reduced end products, which in turn are released to the atmosphere via the plant?s exhaust stack.\n\nMIS stores the aqueous ammonia on site as a 29.5 percent solution in a 21,282-gallon tank.  The quantity of aqueous ammonia stored exceeds the EPA regulated threshold quantity for accidental release prevention.  Therefore, MIS is subject to EPA?s Risk Management Program (RMP).\n\nThe goal of the RMP is:  1) to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures; and 2) to mitigate the severity of releases that may occur.\n\nCovered facilities, such as MIS, must develop and implement a RMP.  The RMP must include an analysis of potential off-site consequences of a regulated substance accidental release, a release p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35341,
      "SummaryText": "revention program, and an emergency response program.  Covered facilities also must submit to the EPA a summary of their risk management program, which also will be made available to other federal, state, and government agencies as well as the public.\n\n\n3.    Off-Site Consequence Analysis\n\nAs required, MIS performed an off-site consequence analysis that included a worst-case and alternative accident scenario of its regulated substance, aqueous ammonia.  The worst-case scenario is the release of the largest quantity of a regulated substance (regardless of its likelihood) that results in the greatest distance to an endpoint. The endpoint is a numerical concentration chosen by EPA beyond which it is believed that nearly all individuals could be exposed without any serious health effects.  The alternative scenario is one that is more likely to occur than the worst-case scenario and that reaches off site.\n\nMIS performed a number of different accident analyses to determine which ones present the greatest distance to the endpoint.  The distance to the endpoint is the radius of a circular area that might be affected in the event of an accidental chemical release.  The accident analyses followed the steps detailed in the EPA guidance document ?Risk Management Program Guidance for Off-Site Consequence Analysis,? April 1999.  The endpoint distances were calculated using EPA?s software utility program RMP*Comp.\n\n4.    Accidental Release Prevention Program\n\nTo ensure a hazardous chemical release does not occur, MIS has implemented a multi-element prevention program.  The program elements are designed to meet EPA?s Risk Management Program requirements and include the use of:\n\n?    Operator attendance at truck loading and unloading operations;\n?    Secondary containment around tanks;\n?    Process safety information to document the safe process design;\n?    Process hazard reviews to evaluate the chemical and process hazards;\n?    Operating procedures to ensure that the systems are operated safely;\n?    Ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35341,
      "SummaryText": "intenance to ensure that the systems meet applicable standards and manufacturer?s recommendations;\n?    Training to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n?    Incident investigation procedures to examine each incident and ?near misses? to determine the root cause and make needed safety improvements; and\n?    Periodic compliance audits.\n\nMIS believes that these elements provide a well-established, integrated approach to ensure that the storage of aqueous ammonia will have a substantial margin of safety to protect both the public and the environment.\n\n\n\n5.    Emergency Response Program\n\nIn the event of an emergency, the MIS has developed an Integrated Contingency Plan (ICP).  The ICP is designed to minimize the hazards to the public or the environment from fires, explosions, natural disasters, or any unplanned sudden or non-sudden release of chemicals to air, soil, or surface water.  The provisions of the plan include procedures for internal and external notifications, preliminary emergency assessment, mitigating actions, and mobilization of resources.  Additionally, the ICP describes personnel training, conduct, and frequency of drills or exercises, and coordination with local responders.\n\nIf a hazardous chemical release did occur, plant personnel would immediately call for local emergency response assistance and mobilize our trained emergency responders to help contain and minimize the effect of the release.  Local emergency management agencies would notify the public of any actions necessary to ensure public protection."
    }
  ]
}