{
  "FacilityID": 3547,
  "FacilityName": "Ypsilanti Community Ultilities Authority",
  "FacilityStr1": "2777 State Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Ypsilanti",
  "FacilityState": "MI",
  "FacilityZipCode": "48198",
  "Facility4DigitZipExt": "9231",
  "FacilityCountyFIPS": "26161",
  "LEPC": "Washtenaw County LEPC",
  "FacilityLatDecDegs": "42.224833",
  "FacilityLongDecDegs": "-83.551833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": "www.ycua.org",
  "FacilityEmailAddress": "tkmet@provide.net",
  "FacilityDUNS": 79849188,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ypsilanti Community Ultilities Auth",
  "OperatorStr1": "2777 State Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Ypsilanti",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48198",
  "OperatorZipCodeExt": "9231",
  "RMPContact": "Thomas Kmet",
  "RMPTitle": "Health & Safety Supervisor",
  "FTE": 84,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043446",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "575-77",
  "SafetyInspectionDate": "1997-07-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-08-22 00:00:00",
  "DeRegistrationEffectiveDate": "2003-08-06 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.22483,
  "FRS_Long": -83.55508,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4096,
      "AltID": "Disinfection/ Wastewater",
      "FacilityID": 3547,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4178,
          "ProcessID": 4096,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4364,
          "ProcessID": 4096,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504364,
          "ProcessID": 4096,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 4097,
      "AltID": "Dechlorination",
      "FacilityID": 3547,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4179,
          "ProcessID": 4097,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4365,
          "ProcessID": 4097,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504365,
          "ProcessID": 4097,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3547,
      "SummaryText": "Ypsilanti Community Ultilities Authority ( YCUA )  recognizes it`s responsibility for the safety and health of it`s employee`s and the surrounding community regarding it`s use of hazardous chemicals in our workplace. This of course, has always  included the environment, but in the last decade the increase to the detail of our duties in these areas have multiplied extensively. Our objective is to  maintain a OSHA Process Safety Management Program which in turn has given us the building blocks for preparation  of this EPA Risk Management Program. These programs will aid YCUA and it`s employees in our efforts to prevent or mitigate episodic chemical releases that could lead to a catastrophe in the workplace and the surrounding community. Our PSM committee has on file a signed letter of agreement for safety improvement recommendations that concern CL2, SO2 process`s from the General Superintendant (1994), Larry R Thomas. He is now the Director of the Ultilities.\n\nOur Wastewater Treament Plant services 9 separate communities. The average flow of wastewater is 22 million gallons per day. The plant includes five (5) levels of treatment: 1. Pretreament - screening, grit removal, and diurnal equalization which includes detention during heavy storm events. 2. Primary - gravity sedimendation. 3. Secondary - aeration and final settling. 4. Tertiary - rapid sand filters. 5. Disinfection - chlorine contact- 30,000lbs max. / sulfur dioxide- 8,000lbs max. used for dechlorination. The biosolids are removed during the (5) levels of treatment, then dewatered through a filter press. They are then landfilled or incinerated. A pilot biosolid composting project has begun this year(1999). This will allow  us an environmentally conscious alternative to the previousiy mentioned disposal process choices. The facilities primary function is the production of a clean effluent to our receiving streams.\n\nThe worst case release scenario: This was taken out of the EPA-CEPP (RMP Series) Risk Manageme"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3547,
      "SummaryText": "nt Program Guidance for Wastewater Treatment Plants (40 CFR Part 68 ). This is a 2000 lbs single vessel release in 10 min / 1.3mile toxic endpoint. \n\nThe alternative release scenario: This is the loss of the contents of a one ton cylinder from a major valve problem.\n\nTheir are written operating procedures in place. The building has gas alarms in place. A control room operator that is stationed in an adjacent building on a 24hr basis  also has alarm notification. Ventilation shut-down instructions with active mitigation for any chemical leak that could be contained using existing leak repair kit for one ton cylinders. This kit is a standard issue \" B \" kit that has been made available by the Chlorine Institute. This kit contains devices to stop leaks at the valve and fusible plugs, and in the sidewall of ton containers. The method that was used for offsite impact analysis was also taken directly from Chapter #4 (Offsite Consequence Analysis) of the above mentioned manual.\n\nOur facilitiy falls uder the OSHA PSM standard, Emergency Response Planning and the Community Right -to-Know- EPCRA of 1984 40 CFR. The Mechanical Integrity protocol of the building and the Hazardous Response Technican training the operators and select maintenance personal have received are some of the highlights of our program. Hand held gas detection monitors to complement the existing permanent wall mounted type. Instructional operation guidelines mounted on the walls for safety back-up and plans for future upgrades.\n\nThe facility has been in operation since 1982 (17yrs) and has never had an offsite impact.\n\nOur Emergency Response Plan contains: The Purpose of EMP - Management`s Role- Description of the Facilty- Site Security- Transportation Routes- Vulnerable Zones- Chemical Information- Summary of Preplanned Emergency Senario`s- Chain of Command list- Instruction Protocol for Emergency Senario`s-Control Room Operator Commands includes public notification and alert system activation- Employee S"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3547,
      "SummaryText": "helter Location / Protocol and Procedures for work shut-down- First Aid for Chemical Exposure- Training / Employee responsibilty list- Drill requirements- Incident History Form- Clean-Up Procedures- Alarms / Communication / Respiratory / PPE / Tools / Monitors / Ventilation / Wind Direction / Vehicles- Reporting Requirements. This includes reporting to the LEPC, which we hold an appointment on the committee. The employees are certified Haz- Mat technican trained, which includes Incident Command Training for selected employees. Drills have been conducted onsite.\n\nThe installation of automatic shut-off valve equipment is under investigation. This will include a trial test of the different equipment available. The futures hold new technology. Ultra Violet (UV) Radiation has proven its effectiveness at other wastewwater treatment facilities. we are in the planning stages of a plant expansion. This is to include UV Radiation for use in our disinfection process. Hence the removal of Cl2 / SO2 from our plant site/ and the potential of a Chemical Catatrophe from our employees and our neighbors."
    }
  ]
}