{
  "FacilityID": 35505,
  "FacilityName": "Gerber's Poultry, Inc.",
  "FacilityStr1": "5889 Kidron Rd.",
  "FacilityStr2": "PO Box 206",
  "FacilityCity": "Kidron",
  "FacilityState": "OH",
  "FacilityZipCode": "44636",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39169",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "40.728056",
  "FacilityLongDecDegs": "-081.746083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.gerbers.com",
  "FacilityEmailAddress": "mgerber@gerbers.com",
  "FacilityDUNS": 4211041,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gerber's Poultry, Inc.",
  "OperatorStr1": "5889 Kidron Rd.",
  "OperatorStr2": "PO Box 206",
  "OperatorCity": "Kidron",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44636",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Gerber",
  "RMPTitle": "President",
  "FTE": 290,
  "OtherEPAFacilityID": "00002099900",
  "EPAFacilityID": "100000147959",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Kidron, OH",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-11-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.72806,
  "FRS_Long": -81.74608,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "61",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51180,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 35505,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52338,
          "ProcessID": 51180,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67541,
          "ProcessID": 51180,
          "ChemicalID": 56,
          "Quantity": 14100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567541,
          "ProcessID": 51180,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35505,
      "SummaryText": "Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is the Policy of Gerber's Poultry, Inc. to conduct business in a manner that is safe to the employees, the community and the environment.  The Company's officers, managers and supervisors are accountable to carry out the policies of Gerber's Poultry relevant to the prevention of accidental releases of hazardous materials.  \n\nGerber's Poultry has made a determined effort to develop a plan to prevent releases of extremely  hazardous substances.  In the development of this plan, Gerber has used numerous resources both inside and outside the Kidron facility.  EPA's Risk Management Program and OSHA's Process Safety Management Program provided the guidelines in the development of the Prevention Plan.  \n\nIn the event of an accidental release, Gerber has developed and implemented an Emergency Response Plan.  The Emergency Plan provides guidance for responding to, containing and reporting accidental releases.  The Emergency Response Plan includes an incident command system for decision-making authority for each stage of an accidental release.  The facility will coordinate with public responders and emergency services, boosting public safety.\n\nFacility Description and the Regulated Substance \n\nCurrently, Gerber processes approximately 200,000 chickens per week.  Ammonia refrigeration is used to chill the chicken deterring harmful bacteria growth and to refrigerate or freeze the market ready chickens.  The refrigeration system is a closed loop system, meaning the ammonia is continually reused. \n\nRelease Prevention Program\n\nGerber's Poultry has set forth in its policies the importance of operating safely.  The Company has aggressively developed programs, policies and materials requirements to minimize the possibility of releases.  These programs include compliance with appropriate OSHA and EPA regulations and sound safety practices.  Stringent material and contractor requirements have been deve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35505,
      "SummaryText": "loped to assure that materials and work conform to recognized standards.  Periodic inspection and maintenance of process equipment is accomplished to system integrity.   Training for employees is conducted to maintain a high level awareness when working with hazardous materials.\n\nAs part of the Prevention Program, Gerber's Poultry has developed a method to evaluate the Risk Management Program.  This method includes periodic evaluation of the Program utilizing a Process Hazard Analysis, and Compliance Audits.\n\nFive Year Accident History\n\nGerber's has not had a reportable accident within the past five years.  A reportable accident is defined as an accidental release of ammonia that resulted in deaths, injuries of significant property damage.\n\nEmergency Response Plan\n\nGerber's Poultry realizes no system is fail-proof and from time-to-time, despite the most comprehensive Process Safety Management and Risk Management Program, unwanted or unplanned releases may occur.  Based on this realization, Gerber's has developed an Emergency Action and Response Plans.  The Emergency Plans detail how Gerber's will deal with accidental releases should they occur.  Routine practice drills have been and will continue to be conducted to evaluated response and organizational effectiveness. \n\nPersonnel involved with the Emergency Plans are trained in accordance with local, state, and Federal regulations.  Refresher training for each employee will be as stated in Gerber's Process Safety Management Program  and shall focus on improving the skills of emergency response personnel.\n\nSafety Improvements\n\nFuture changes to improve release prevention include:  improved maintenance procedures and periodicity; addition of new technology as it becomes available; and continual training of plant and response personnel."
    }
  ]
}