{
  "FacilityID": 35613,
  "FacilityName": "PFIZER GLOBAL MANUFACTURING - HOLLAND, MI",
  "FacilityStr1": "188 HOWARD AVENUE",
  "FacilityStr2": null,
  "FacilityCity": "HOLLAND",
  "FacilityState": "MI",
  "FacilityZipCode": "49424",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26139",
  "LEPC": "Ottawa County LEPC",
  "FacilityLatDecDegs": "42.799444",
  "FacilityLongDecDegs": "-086.115833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "HTTP:\\\\WWW.PFIZER.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39135264,
  "ParentCompanyName": "PFIZER, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PFIZER GLOBAL MANF. - HOLLAND, MI",
  "OperatorStr1": "188 HOWARD AVENUE",
  "OperatorStr2": null,
  "OperatorCity": "HOLLAND",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49424",
  "OperatorZipCodeExt": null,
  "RMPContact": "MARK KELLER",
  "RMPTitle": "DIRECTOR, EHS",
  "FTE": 341,
  "OtherEPAFacilityID": "MID 006  013643",
  "EPAFacilityID": "100000100473",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-04-23 00:00:00",
  "SafetyInspectionBy": "STATE OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "2004 - 3rd Revision",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-07-13 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-12 00:00:00",
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.80071,
  "FRS_Long": -86.11464,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51343,
      "AltID": "PHOSGENE PROCESS",
      "FacilityID": 35613,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52508,
          "ProcessID": 51343,
          "NAICSCode": "32541",
          "_desc": {
            "NAICS_CODE": "32541",
            "NAICS_DESCRIPTION": "Pharmaceutical and Medicine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67781,
          "ProcessID": 51343,
          "ChemicalID": 10,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 10,
            "ChemicalName": "Phosgene  [Carbonic dichloride]",
            "CASNumber": "75-44-5",
            "Threshold": 500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567781,
          "ProcessID": 51343,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 51344,
      "AltID": "600 LB. AHCL CYL. STORAGE",
      "FacilityID": 35613,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52509,
          "ProcessID": 51344,
          "NAICSCode": "32541",
          "_desc": {
            "NAICS_CODE": "32541",
            "NAICS_DESCRIPTION": "Pharmaceutical and Medicine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67782,
          "ProcessID": 51344,
          "ChemicalID": 54,
          "Quantity": 75000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567782,
          "ProcessID": 51344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 51345,
      "AltID": "BULK HYDROGEN CHLORIDE",
      "FacilityID": 35613,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52510,
          "ProcessID": 51345,
          "NAICSCode": "32541",
          "_desc": {
            "NAICS_CODE": "32541",
            "NAICS_DESCRIPTION": "Pharmaceutical and Medicine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 67783,
          "ProcessID": 51345,
          "ChemicalID": 54,
          "Quantity": 84000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 567783,
          "ProcessID": 51345,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35613,
      "SummaryText": "REGISTRATION INFORMATION\n\nThe Pfizer Global Manufacturing (Pfizer), Holland Site, manufactures a variety of life-saving and life-enhancing pharmaceuticals at its facility located at 188 Howard Avenue, Holland, Michigan.  Pfizer uses two chemicals that are regulated by the EPA Risk Management Plan (RMP) rules (40 CFR Part 68) to manufacture several pharmaceutical products.  These chemicals are phosgene and anhydrous hydrogen chloride, and they are also regulated by the OSHA Process Safety Management (PSM) standard (29 CFR Part 1910.119).\n\nThis Executive Summary reviews the key components of the Pfizer risk management program including a description of the regulated substances, hazard assessments, accident prevention program, and emergency response program.  Specific elements of the Pfizer risk management program are presented in the attached Risk Management Plan.\n\nPfizer has always acknowledged its civic responsibility to provide its colleagues and the residents of the Holland community with a safe facility.  Pfizer strives to meet or exceed applicable EPA and OSHA rules and regulations, and periodically evaluates the quality of its environmental and safety programs.  The facility?s accident prevention and emergency response procedures have been designed to protect our colleagues, the community and environment, and Pfizer properties, to the greatest extent possible.  Pfizer maintains extensive on-site emergency response equipment and trained personnel, and has integrated its emergency response procedures with those of the Holland Township Fire Department and the Ottawa County Local Emergency Planning Committee.\n\nThe designated representative and contact person for environmental matters and this Risk Management Plan at the Pfizer facility is Mr. Mark Keller, Director of Environmental, Health & Safety.  He can be contacted at the facility at (616) 392-2375.\n\nSUBSTANCE PROPERTIES\n\nPhosgene and anhydrous hydrogen chloride are critical to the manufacture of several pharma"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35613,
      "SummaryText": "ceutical products at the Holland, Michigan facility. Both chemicals require careful storage and handling due to their potential toxic hazards.  \n\nPhosgene is a toxic and corrosive liquid.  Phosgene evaporates to form a gas at temperatures above the boiling point.  Exposure may cause severe irritation to the respiratory system, skin and eyes.  Inhalation of high concentrations of phosgene may cause headache, olfactory fatigue, respiratory irritation, difficulty breathing, lung congestion and, under extreme conditions, death.  In addition, symptoms may be delayed for a period of from 24 to 48 hours after exposure.  It is critical that persons exposed to phosgene seek immediate medical attention for prompt treatment. \n\nHydrogen chloride is a corrosive gas.  Exposure may cause severe irritation to the respiratory system, skin and eyes.  Inhalation of high concentrations of hydrogen chloride can cause respiratory irritation and corrosive burns, lung congestion, lung damage and, under extreme conditions, death.\n \nRELEASE SCENARIOS\n\nThe EPA rules required the development of worst-case release scenarios that assume the entire contents of the largest container of a highly hazardous chemical are released in ten minutes under adverse weather conditions.  Pfizer developed a worst case release scenario for phosgene based on the maximum quantity contained within one cylinder.  The worst case modeling was conducted using the EPA approved SLAB model for dense gases.  Model results are contained in the checklist portion of this plan.\n \nPublic and environmental receptors are located within the radius of the worst-case release scenario.  These receptors include homes; small businesses; commercial, office and industrial areas; schools; a hospital; a jail, churches; public parks and recreational areas.   Pfizer believes that the EPA defined worst case phosgene scenario can not occur due to the high level of phosgene process safety and the associated Pfizer process safety management and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35613,
      "SummaryText": "emergency response programs . \n\nThe described alternative release scenarios are extremely conservative.  Pfizer believes that the defined scenarios for phosgene and hydrogen chloride are highly unlikely to occur due to the high level of process safety and the associated Pfizer process safety management and emergency response programs. Pfizer believes that any phosgene or hydrogen chloride release would have substantially less impact on potential environmental and public receptors than the described alternative scenarios.  \n\nThe alternative case modeling was conducted using the EPA approved SLAB model for dense gases. Model results are contained in the checklist portion of this plan.  Public and environmental receptors are located within the radius of the alternative release scenario.  These receptors include homes; small businesses; commercial, office and industrial areas; schools; churches; public parks and recreational areas.   \n\nACCIDENT HISTORY\n\nPfizer has not experienced any accident from a regulated process in the last five years that resulted in on-site deaths, injuries, or significant property damage, or known off-site deaths, injuries, evacuations, sheltering in place, property or environmental damage.  \n\nLEVEL 3 PREVENTION PROGRAM\n\nPfizer maintains a Process Safety Management program that contains all OSHA required elements including process hazards analysis, colleague training, contractor qualification and control, preventative maintenance, and change control.  \n\nEMERGENCY RESPONSE PROGRAM \n\nPfizer maintains a comprehensive emergency response program that includes colleague response to fire, hazardous materials release, colleague rescue and first aid.  Pfizer maintains a written Emergency Response Plan describing facility evacuation and emergency response programs and procedures.  Specific emergency response actions have been defined for phosgene and hydrogen chloride. \n\nPfizer maintains a good relationship with the Holland Township fire department and wo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35613,
      "SummaryText": "rks closely with the Ottawa County Local Emergency Planning Committee (LEPC).  The LEPC has an emergency response plan for the Pfizer site."
    }
  ]
}