{
  "FacilityID": 35728,
  "FacilityName": "Nestle Ice Cream Company, LLC",
  "FacilityStr1": "970 Continental Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tulare",
  "FacilityState": "CA",
  "FacilityZipCode": "93274",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Tulare Co Env Health Services",
  "FacilityLatDecDegs": "36.187500",
  "FacilityLongDecDegs": "-119.336111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115083131,
  "ParentCompanyName": "Dreyer's Grand Ice Cream Holdings",
  "Company2Name": null,
  "CompanyDUNS": 66563859,
  "Company2DUNS": 0,
  "OperatorName": "Nestle Ice Cream Company, LLC",
  "OperatorStr1": "970 Continental Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tulare",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93274",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric Borges",
  "RMPTitle": "Plant Engineering Manager",
  "FTE": 330,
  "OtherEPAFacilityID": "CAD982041485",
  "EPAFacilityID": "100000020611",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-25 00:00:00",
  "SafetyInspectionBy": "Tulare County Envr. Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "5 Year Update",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 36.18574,
  "FRS_Long": -119.33224,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51499,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 35728,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52673,
          "ProcessID": 51499,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68014,
          "ProcessID": 51499,
          "ChemicalID": 56,
          "Quantity": 83832.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568014,
          "ProcessID": 51499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35728,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies\n\nNestle Ice Cream Company, LLC utilizes anhydrous ammonia in refrigeration systems at their ice cream and frozen dessert productions facility in Tulare, California.  Since the main refrigeration system handles more than 10,000 pounds of anhydrous ammonia, Nestle Ice Cream Company, LLC has developed and implemented a process safety management (PSM) program for the ammonia based refrigeration processes.  \n\nAs part of the PSM program, Nestle Ice Cream Company, LLC has completed process hazard analyses, developed written operating procedures, trained employees on the refrigeration systems, conducted a pre-startup safety review, and developed a mechanical integrity program for the ammonia equipment.  In addition to plant personnel monitoring the operation of the refrigeration systems on a daily basis, Nestle Ice Cream Company, LLC has implemented a preventative maintenance program to ensure that the refrigeration system is maintained in good operating condition.  Properly maintained equipment reduces the risk of an accidental release.\n\nAdditionally, Nestle Ice Cream Company, LLC emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific and process specific training, operators and maintenance personnel receive training in fire prevention, fire control, accident prevention, safety, and first aid.  \n\nAn emergency action plan has been prepared for the Nestle Ice Cream Company, LLC facility and a chain of command to respond to emergencies has been established.  In the event of an ammonia release, Nestle Ice Cream Company, LLC has personnel trained in emergency response procedures.  \n\nNestle Ice Cream Company, LLC has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the PSM and RMP regulations.  At least every three years, Nestle Ice Cream Company, LLC audits these pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35728,
      "SummaryText": "grams and any findings of noncompliance are documented and responded to and the deficiencies are corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nThe Nestle Ice Cream Company, LLC?s Tulare Operations Center (TOC) is located at 970 Continental Avenue in Tulare, California.  The ammonia based refrigeration system at Nestle Ice Cream Company, LLC provides cooling for the process equipment and finished product storage and handling areas.  The plant began operation in April, 1985.  A series of expansion projects involving the main refrigeration system were completed during the late 1980s and 1990s.  \n\nAn additional refrigeration system was installed in 1999 to supply process cooling to a new freezer line.  This second refrigeration system does not handle anhydrous ammonia in quantities greater than the threshold quantity of 10,000 pounds.  \n\nIn the main system, the booster compressors draw low pressure ammonia vapors from the suction accumulators and compress the vapors.  The compressed ammonia vapors flow through the flash intercooler prior to entering the high stage compressors.  The high stage compressors increase the pressure of the ammonia vapor stream.  Some of the heat of compression from the high stage compressors is removed via a shell and tube heat exchanger (to generate hot water for sanitation purposes) with the balance of the high stage compressor discharge being condensed in the evaporative condensers.  \n\nCondensed ammonia flows by gravity from the evaporative condensers to the receivers where the liquid ammonia is stored until process cooling demand requires more liquid ammonia.  When process cooling demand requires additional liquid ammonia, the ammonia flows from the receiver through an evaporative condenser (de-superheater) to subcool the liquid ammonia.  As needed, the subcooled liquid ammonia flows to the following process vessels:\n\n? Mix, raw, and yogurt storage tanks\n? Glycol heat exchangers\n? Flash intercooler\n? Water chi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35728,
      "SummaryText": "ller\n? Loading dock and cold storage evaporators\n? Ice cream freezers\n\nThe flash intercooler supplies chilled liquid ammonia to the suction accumulators.  \nLiquid ammonia pumps on the suction accumulators circulate cold liquid ammonia to the blast freezers, glacier freezers, storage freezers and other production line equipment for process cooling.  \n\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the entire refrigeration system can be ?pumped down? to evacuate the ammonia from the system and store it in the controlled pressure receiver.  The maximum quantity of ammonia that can be stored in the main refrigeration system high pressure receiver is approximately 83,832 pounds.\n\nFor purposes of the offsite consequence analyses, 40 CFR Part 68 and the CalARP regulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA PSM program, which meets the requirements of the general accidental release prevention program, is being implemented at Nestle Ice Cream Company, LLC to address the anhydrous ammonia system.  The PSM program includes the following chemical-specific prevention steps:\n\n? Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\n? Process Hazard Analyses (PHA) have been completed and will be updated and revalidated at least every five years.\n\n? Written operating procedures have been developed and will be reviewed at least annually.\n\n? Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility have been developed and implemented.\n\n? Each employee involved in operating the ammonia system has received initial training and refresher training at least"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35728,
      "SummaryText": " every three years.\n\n? Written mechanical integrity procedures have been established and implemented.\n\n? A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n? Pre-startup safety reviews will be performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\n? Audits will be conducted at least every three years to evaluate compliance with the RMP regulations.\n\n? Incident investigation procedures have been established.\n\n? A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n? Hot work permits are issued for all hot work operations conducted on or near the ammonia system.\n\n? A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Nestle Ice Cream Company, LLC has assigned overall responsibility for the RMP elements to the Plant Engineering Manager.  The Plant Engineering Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nThe Nestle Ice Cream Company, LLC facility in Tulare, California has not had any accidental releases in the last five years that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEmergency Response Program\n\nNestle Ice Cream Company, LLC has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  Nestle Ice Cream Company, LLC has personnel trained in emergency response procedures and has established an emergency response program (ERP) that includes procedures for plant evacuations an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35728,
      "SummaryText": "d notifying response agencies and adjacent businesses.  The ERP also contains an emergency equipment list with a maintenance schedule and includes first aid procedures for toxic exposures to ammonia.  The ERP is coordinated with the Tulare Fire Department and the Tulare County Environmental Health Services.                                  Planned Changes To Improve Safety\n\nThrough the accidental release prevention program, Nestle Ice Cream Company, LLC regularly evaluates the need for any changes to improve safety.  Currently, Nestle Ice Cream Company, LLC does not have any changes planned for the anhydrous ammonia-based refrigeration processes to improve safety."
    }
  ]
}