{
  "FacilityID": 35738,
  "FacilityName": "AMERICAN REFFUEL OF ESSEX COUNTY",
  "FacilityStr1": "183 RAYMOND BOULEVARD",
  "FacilityStr2": null,
  "FacilityCity": "NEWARK",
  "FacilityState": "NJ",
  "FacilityZipCode": "07105",
  "Facility4DigitZipExt": "4978",
  "FacilityCountyFIPS": "34013",
  "LEPC": "Newark City LEPC",
  "FacilityLatDecDegs": "40.739778",
  "FacilityLongDecDegs": "-074.126167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "HTTP://WWW.REF-FUEL.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 185308678,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AMERICAN REFFUEL",
  "OperatorStr1": "183 RAYMOND BOULEVARD",
  "OperatorStr2": null,
  "OperatorCity": "NEWARK",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07105",
  "OperatorZipCodeExt": "4978",
  "FTE": 86,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132616",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "07736",
  "SafetyInspectionDate": "2003-02-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-07-19 00:00:00",
  "DeRegistrationEffectiveDate": "2005-03-30 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.73437,
  "FRS_Long": -74.1276,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51516,
      "AltID": "AMMONIA DENOX",
      "FacilityID": 35738,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 68032,
          "ProcessID": 51516,
          "ChemicalID": 57,
          "Quantity": 142000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 52690,
          "ProcessID": 51516,
          "NAICSCode": "562213",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 19712,
              "Process_NAICS_ID": 52690,
              "SafetyReviewDate": "2003-12-04 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "BOCA, Company Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2001-07-30 00:00:00",
              "ChangeCompletionDate": "2002-09-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-07-18 00:00:00",
              "TrainingReviewDate": "2003-11-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "COMPUTER BASED TRAINING",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-08-15 00:00:00",
              "EquipmentInspectionDate": "2004-05-12 00:00:00",
              "EquipmentTested": "Ammonia Storage Tank",
              "ComplianceAuditDate": "2002-09-19 00:00:00",
              "AuditCompletionDate": "2002-10-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2003-07-18 00:00:00",
              "CBI_Flag": 0,
              "Description": "The AMMONIA DENOX system has a program of engineering controls, work practices, protective equipment and gear which coupled with a training program, preventive maintence program and an emergency response program, reduce the probability of a system failure and release of the ammonia solution which could subsequently evaporate and impact the environment.  All physical receipts of material are monitored by trained personnel in addition to the driver of the vehicle.  The vessel is equiped with local and remote monitoring and alarms to protect from overfill or overpressure.  Pumping and piping is provided with overpressure and high flow protection which can be operated locally or remotely from the control room.  Potentially released material is provided with containment allowing for proper control, neutraliztion and disposal.  A Preventive Maintenance program assures that the equipment is in good condition at all times.",
              "_chemicals": [
                {
                  "PrimaryKey": 20615,
                  "PreventionProgram2ID": 19712,
                  "ProcessChemicalID": 68032
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35738,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-11-19 00:00:00",
    "ERTrainingDate": "2003-11-19 00:00:00",
    "CoordinatingAgencyName": "NEWARK OEM",
    "CoordinatingAgencyPhone": "9737333660",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35738,
      "SummaryText": "American RefFuel of Essex County operates three mass burn combusters and associated pollution control equipment to process up to 985,500 tons annually of municipal solid waste.  The facility generates approximately 500 million kilowatt hours per year of electricity for internal use and export to PSE&G.\nAmerican RefFuel meets or exceeds environmental regulations as required, including local, state and federal laws, by applying \"top-down\" management responsibility for compliance.  This includes systems engineered to control and prevent the potential contamination of surfacewater, groundwater, and soil; the development of plans which detail the actions to be taken in the event of a spill incident; and regularly scheduled inspections and drills to ensure all control systems, equipment and plans are properly implemented and functioning.  \nThe facility uses a DeNOx system to lower the emissions of nitrogen oxides formed during the combustion of waste.  In the thermal DeNOx process, nitrogen oxide (NOx) emissions are reduced by a chemical reaction with ammonia, whereby NOx is transformed into harmless nitrogen and water.  A small amount of ammonia vapor is injected into the boiler using steam as a carrier, which then mixes with the hot flue gases.\nA carbon steel 20,000-gallon, 27.4 % aqueous ammonia storage tank is located adjacent to the tipping bay exit ramp. The tank can be filled to a maximum fill capacity of 90% of the gross capacity of 20,000 gallons, or to an amount of 18,000 gallons total of aqueous ammonia.  The design and construction of the tank is governed by the ASME Pressure Vessel Code.  The maximum allowable working pressure for this tank is 25 psig.  The ammonia storage tank is equipped with instrumentation to indicate temperature and pressure locally.  A level transmitter sends a signal to the Control Room so that level can be determined remotely.  All connections to the tank that require valves utilize globe valves.  Due to a low boiling point (~91?F) at"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35738,
      "SummaryText": " ambient pressure, aqueous ammonia needs to be stored in a vessel that can easily relieve any pressure buildup due to boiling.  For the above reason the tank is fitted with redundant pressure relief/vacuum breakers, which protect the tank from any over pressure or vacuum condition due to pump suction, tank filling or tank heat up.  There are local audible alarms/warning lights and a remote visual indicator that alarms when 90% capacity is reached during filling operations. \nA roofed, concrete containment dike with a capacity equal to 140% of the tank capacity, and designed to capture leaks, surrounds the aqueous ammonia storage tank. The secondary containment drains to the plant's low quality water reuse system. Accidental spills (ammonia or precipitation) are promptly removed from the secondary containment structure. In the event of a leak, the aqueous ammonia would be contained within the containment structure until trained personnel can properly neutralize or remove it.\nThe tank is filled via a 2-inch top fill truck connection line, which allows connection to an ammonia tank truck.  The truck fill station is located between lime silos A & B. The tanker truck unloading area is concrete paved.  All piping used to transfer aqueous ammonia from the storage tank to its usage location are marked by lettering, color banding, and/or color coding to indicate the substance it conveys. All pipes entering tank below level of liquid are equipped with valves, which are close to the tank and are easily accessible to personnel. All overfill lines are directed into the secondary containment structure.  The local truck fill connection station has visual and  audio-alarmed level indication and an automatic shut-off valve to stop filling the tank if the tank pressure rises.\nThe storm drain in the area has been desiged to act as a collection basin for material. Positioning of a three way valve allows routing to either 1) the storm water system, 2) the low quality sump (internal to th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35738,
      "SummaryText": "e Facility) or 3) immediate containment by positioning of a three way valve. An open contract exists with a Discharge Cleanup Organization to respond and to properly contain and remediate discharges.\nDuring delivery of aqueous ammonia, an American RefFuel Company operator, following the aqueous ammonia unloading SOP, monitors the transfer to verity that proper procedures are followed and that the available volume in the tank is greater than the volume of aqueous ammonia being transferred. The driver of the tanker truck will also assist in monitoring the transfer of aqueous ammonia. \nA spill response locker is located at the aqueous ammonia unloading area. The locker contains, absorbent booms, shovels (non-spark), absorbent pads, neutralizing agents, squeegees, rainsuits, faceshields, Tyvek ? suits, rubber gloves, goggles, rubber boots and caution tape.\nThe ammonia flows from the tank through a 1 inch line, a double block and bleed arrangement and a strainer to one of two positive displacement gear pumps located in the diked tank area.  A local pump discharge pressure gauge is located immediately after the pump.  On the pumps common discharge line is a pressure transmitter, which sends a signal to the Control Room.  The pumps are controlled locally at the tank with a hand-off-auto switch or remotely from the control room.  There is an automatic shut-down to prevent pumping ammonia in the event of a catastrophic line failure.\nThe ammonia flows from the pump station to the 70-foot elevation vaporizer skids through a one-inch line. The vaporizers evaporate the ammonia and mix it with carrier steam.  The steam/ammonia vapor mixture is then directed to one of three injection zones where it is injected into the boiler.\nScheduled integrity testing, maintenance, and reconstruction of the system including the tank and piping is performed in accordance with a New Jersey Department of Environmental Protection approved Discharge Prevention Containment Countermeasure (DPCC) Plan."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35738,
      "SummaryText": "  \nThe Worst Case Scenario evaluated utilizing the EPA RMP*Comp? software is the catastrophic failure of the ammonia stoage tank assuming no mitigating circumstances and the evaporation of the ammonia which is subsequently carried down wind for a maximum distance of 1.1 miles before reaching a concentration lower than the toxic end point.  The alternative case analyzed was a vessel leak allowing complete drainage of the tank (withou mitigation) and the evaporation of the ammonia which is subsequently carried down wind for a maximum distance of 0.6 miles before reaching the toxic end point.  Analysis of the possible causes for such  failures have indicated that because of the diked enclosure which limits the exposed surface area and reduces the rate of evaporation, inspection, presence of trained operators during any materials receipt, testing and preventative maintenance of the vessel and piping systems, failure of the tank is a remote possibility.  In the event of such a failure, passive and active mitigation including efforts by both on and off site responders could safely contain, dilute and or neutralize a release before it there would be a major offsite impact.\nThe facility has an Integrated Emergency Response Plan, which meets or exceeds the mandates of the multiple regulatory programs at the site.  In the event of an emergency, trained personnel are prepared to respond and mitigate the conditions at the site.  Procedures to notify the local authorities, neighboring industrial facilities and the public are in place.  Arrangements have been made with an outside Discharge Cleanup Organization (DCO) to supplement the in house personnel.  The plan has been reviewed with the Newark Fire Department and the Newark Office of Emergency Management.  Drills have been conducted on a regular frequency to evaluate the implementation of the Plan with the Newark and DCO responders in attendance.\nThe DeNOx system for the Essex facility began operation in November 1994. Since t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35738,
      "SummaryText": "hat time, no accident has occurred which has impacted public health or the environment."
    }
  ]
}