{
  "FacilityID": 35737,
  "FacilityName": "Key West Wastewater Treatment Plant",
  "FacilityStr1": "OMI Trumbo Point Annex Fleming Key",
  "FacilityStr2": null,
  "FacilityCity": "Key West Florida",
  "FacilityState": "FL",
  "FacilityZipCode": "33041",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12087",
  "LEPC": "Key West Fire Department",
  "FacilityLatDecDegs": "24.569167",
  "FacilityLongDecDegs": "-081.797500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.keywestwastewater.com",
  "FacilityEmailAddress": "omikey@omiinc.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Key West",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Key West (owner)",
  "OperatorStr1": "1409 Simonton",
  "OperatorStr2": null,
  "OperatorCity": "Key West",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33040",
  "OperatorZipCodeExt": null,
  "RMPContact": "E. David Fernandez",
  "RMPTitle": "Utilities Director",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000058938",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1993-10-27 00:00:00",
  "SafetyInspectionBy": "Navy Air Facility Key West Fire Dept",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-06-01 00:00:00",
  "DeRegistrationEffectiveDate": "2007-05-23 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 24.5555,
  "FRS_Long": -81.8052,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "reduced storage of chloirine gas to <1500 lbs",
  "_processes": [
    {
      "ProcessID": 51515,
      "AltID": "Chlorine System",
      "FacilityID": 35737,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52689,
          "ProcessID": 51515,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68031,
          "ProcessID": 51515,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568031,
          "ProcessID": 51515,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35737,
      "SummaryText": "Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nOMI believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment. Accordingly, OMI has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support. This same proactive philosophy was employed in the development and implementation of the Key West WWTP Risk Management Plan for the chlorine system. OMI has determined that the OSHA Process Safety Management standard also applies to the personnel at the Key West WWTP and therefore has prepared this RMP to comply with the RMP Program 3 requirements. By doing so, OMI affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\nThe RMP prevention program is arguably the most important element of the rule. Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of regulated chemicals. If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur. Accordingly, a well-developed and properly implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\nOMI takes an active role in preventing accidental releases at all of the facilities it operates by ensuring that its employees are well informed regarding the hazards associated with the regulated processes (e.g., chlorine at the Key West WWTP) and actively participated in comprehensive process hazard analyses. The employees that work on the chlorine system are properly trained in the safe operation of the covered process and the safe handling of treatment chemicals. They are aided in this work"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35737,
      "SummaryText": " by complete, understandable system operating procedures.\n\nOMI management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community. This understanding is reflected in procedures described and referenced in the Key West WWTP RMP procedures and policies.\n\nAs for emergency response, OMI has established and maintained procedures for emergency notification and response. These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\nStationary Source and Regulated Substances\n\nThe Key West WWTP is located at OMI Trumbo Point Annex Fleming Key, in Key West, Monroe County, Florida. The Key West WWTP treats wastewater through a series of physical and chemical treatment operations. The plant is a 10-MGD extended aeration activated sludge plant. \n\nThe Key west WWTP utilizes chlorine as a biocide in the treatment of wastewater. The chlorine is stored in 1-ton containers with a maximum intended inventory of 10 containers (20,000 pounds) onsite. Therefore, the Key West WWTP is regulated under the RMP rule due to the chlorine stored and used at the facility.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe prevention program and chemical-specific prevention steps are described in detail in the Key West WWTP RMP manual. The prevention program includes the following elements:\n\nProcess safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment\n\nProcess hazard analysis (PHA), which includes a systematic evaluation (by an employee team) of the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35737,
      "SummaryText": "of controls\n\nOperating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions\n\nTraining for each Key West WWTP employee involved in operating the chlorine system\n\nMechanical integrity procedures to maintain the ongoing integrity of the chorine process equipment\n\nManagement of change procedures to manage changes (other than ?replacements in kind?) to the chlorine system\n\nPre-startup safety review for additions or significant modifications to the chlorine process, or any new regulated chemical process\n\nCompliance audits at least every 3 years from 1999 to evaluate Key West WWTP RMP compliance\n\nIncident investigation to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of chlorine from the Key West WWTP\n\nEmployee participation in the development and implementation of the Key West WWTP RMP, and employee access to RMP information\n\nHot work prohibition policy on or near the chlorine system when chlorine is present in the effected section of the process\n\nContractor management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the Key West WWTP emergency evacuation plan, limited access to the chlorine process, and evaluation of contractor performance\n\nIn addition to these elements, the chlorine storage area and chlorine feed room at the Key West WWTP are equipped with chlorine leak detection devices that continuously monitor the air for chlorine gas. If the chlorine sensor detects a specified level, audio and visual alarms will be activated and a high rate ventilation system can be activated in the chlorine feed room. The ventilation system withdraws chlorine and air from a low elevation in the chlorine storage room to a safe outdoor location. The alarm systems"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35737,
      "SummaryText": " are maintained and tested on a regular basis to ensure proper operation should there be a chlorine release. Management of change procedures will be used for the upgrades to the chlorine system.\n\nFive-Year Accident History\n\nWithin the 5-year period prior to the submittal of this RMP, there were no accidental releases of chlorine meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\n\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies, including the Naval Air Station Fire Department. The program is described in detail in the Key West WWTP RMP manual and meets the requirements of 40 CFR 68.95, which include facility notification of emergency responders and evacuation. The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public. The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\nPlanned Changes to Improve Safety\n\nIdeas for changes to improve safety are actively sought from employees. Employee meetings that focus on safety issues are held regularly at the Key West WWTP. Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\nAs part of the development of the Key West WWTP program, process hazard analyses were conducted in 1999 and 2004. During the 1999 session, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  No additional recommendations were made as a result of the 2004 PHA revalidation."
    }
  ]
}