{
  "FacilityID": 3573,
  "FacilityName": "Beaumont Methanol L. P.",
  "FacilityStr1": "Highway 347",
  "FacilityStr2": null,
  "FacilityCity": "Beaumont",
  "FacilityState": "TX",
  "FacilityZipCode": "77705",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "30.016389",
  "FacilityLongDecDegs": "-94.048333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 926882705,
  "ParentCompanyName": "Terra Industries",
  "Company2Name": "N/A",
  "CompanyDUNS": 101123578,
  "Company2DUNS": 0,
  "OperatorName": "Beaumont Methanol L.P.",
  "OperatorStr1": "P. O. Box 20339",
  "OperatorStr2": null,
  "OperatorCity": "Beaumont",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77720",
  "OperatorZipCodeExt": "0339",
  "FTE": 46,
  "OtherEPAFacilityID": "77720BMNTMHWY34",
  "EPAFacilityID": "100000043142",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-06-29 00:00:00",
  "DeRegistrationEffectiveDate": "2007-06-25 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.01639,
  "FRS_Long": -94.04833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4123,
      "AltID": "Basic Organic Chemical Ma",
      "FacilityID": 3573,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 4392,
          "ProcessID": 4123,
          "ChemicalID": 149,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4205,
          "ProcessID": 4123,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1461,
              "Process_NAICS_ID": 4205,
              "SafetyReviewDate": "1999-06-16 00:00:00",
              "PHA_Date": "1999-05-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-24 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-16 00:00:00",
              "TrainingReviewDate": "1999-06-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-16 00:00:00",
              "EquipmentInspectionDate": "1997-05-01 00:00:00",
              "EquipmentTested": "process vessels and equipment in methanol, synthesis, and refining areas",
              "ChangeMgmtDate": "1999-05-05 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-16 00:00:00",
              "PreStartupReviewDate": "1998-11-18 00:00:00",
              "ComplianceAuditDate": "1998-02-23 00:00:00",
              "AuditCompletionDate": "1998-12-08 00:00:00",
              "IncidentInvestigationDate": "1999-05-21 00:00:00",
              "InvestigationChangeDate": "1999-05-21 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-16 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "Beaumont Methanol L.P. facility has a comprehensive Process Safety Management (PSM) Program and is subject to the Occupational Safety and Health Administration's standard for process safety management of highly hazardous chemicals found at 29 CFR Part 1910.119.\n\nKey elements of the PSM program include: \n\n1) Stringent design standards of equipment which incorporate substantial safety factors and include state-of-the-art monitoring and control instrumentation. \n\n2) Extensive process safety information that is accurate and up-to-date.  \n\n3) Well trained operating, maintenance, and contractor personnel.  \n\n4) Written safety, operating, and maintenance procedures.  \n\n5) Mechanical Integrity procedures for process equipment inspections and quality control.  \n\n6) Management of change and pre-startup review procedures.  \n\n7) Periodic, detailed evaluation of each process area by a team utilizing HAZOP methodology.  \n\n8) Regular PSM program audits.\n\n9) Employee participation in every element of the PSM program.",
              "_chemicals": [
                {
                  "PrimaryKey": 1624,
                  "PreventionProgram3ID": 1461,
                  "ProcessChemicalID": 4392
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3573,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-16 00:00:00",
    "ERTrainingDate": "1999-03-04 00:00:00",
    "CoordinatingAgencyName": "Emergency Planning Committee",
    "CoordinatingAgencyPhone": "4097224371",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3573,
      "SummaryText": "I.   EXECUTIVE SUMMARY\n\nIntroduction\nThe Terra Nitrogen Beaumont Methanol facility located in Beaumont, TX manufactures methanol.  In the process of manufacturing methanol, the first step is to produce a Synthesis Gas.  Hydrogen, a highly flammable gas and an RMP listed chemical, is the primary constituent of synthesis gas.  Synthesis gas also contains the RMP listed flammable gas methane.  Because Beaumont Methanol has less than the 10,000 pound threshold quantity of flammable gas containing hydrogen and methane within the plant process the facility is not subject to the RMP requirements.  However, Terra has elected to prepare a Risk Management Plan for Beaumont Methanol to inform its employees and community neighbors of potential risks posed by its operations.\n\nAdditionally, Beaumont Methanol is participating with nineteen other facilities in Jefferson County in an effort to share risk management information among facilities, with our neighbors, and with our employees.\n\nIt is Terra Nitrogen's policy to prevent accidental releases from the Beaumont Methanol facility by effective Process Safety Management programs and procedures.  This includes the following:\n\n*Participation by all plant employees in every element of PSM.\n\n*Conduct regular scheduled process hazards analysis.\n\n*Utilize current and accurate process safety information.\n\n*Maintain current and accurate written operating procedures.\n\n*Provide timely and comprehensive training for all employees involved in operating and maintaining process equipment.\n\n*Oversee the activities of contractors and ensuring that they are trained to perform their job safely.\n\n*Follow established pre-startup safety review and management of change procedures to ensure that modifications are adequately evaluated for safety.\n\n*Administer a comprehensive mechanical integrity program to ensure that process equipment is maintained in accordance with good engineering practice and accepted industry standards.\n\n*Investigating incidents wh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3573,
      "SummaryText": "en they do occur to promptly correct deficiencies and learn from the experience.\n\n*Audit the entire PSM program on a regular basis to verify that elements, procedures, and systems are in place and adequate.\n\n*Maintain a current and accurate written emergency response plan, as well as participating in a well trained and equipped onsite emergency response team.\n\n*A system to notify facility neighbors in the event of a release, and to coordinate emergency response planning with local authorities and exercise those plans annually.\n\nOffsite Consequence Analysis\nBeaumont Methanol has developed and analyzed a worst-case scenario and an alternative release scenario in accordance with the RMP Offsite Consequence Analysis Guidance.  The two scenarios are as follows:\n\nWorst Case - If the facility had a major failure of all reforming and synthesis loop equipment and piping simultaneously with a failure of active mitigation systems, the result would be the release of an estimated 3,900 pounds of a flammable gas mixture containing hydrogen and methane.  This quantity is less than the 10,000 pound minimum for consequence--determinations using the RMP Offsite Consequence Analysis Guidance (Reference Table 9 and Section 5.2 Flammable Mixtures).  Therefore, Beaumont Methanol has elected to use as the worst case scenario a 10,000 pound release of synthesis gas and assume that it is all hydrogen (the predominant component of synthesis gas with the highest heat of combustion).  Based upon the Offsite Consequence Analysis Guidance, the resulting vapor cloud explosion is predicted to create a 1 PSI overpressure at a maximum distance of 0.24 miles.  The area potentially impacted by this worst case scenario is limited to Beaumont Industrial Park property.  \n\nAlternate Release Scenario - Alternate release cases are those that present a realistic hazard at the Beaumont Methanol facility and that are the basis for emergency response planning and training.  The alternate case included in the RM"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3573,
      "SummaryText": "P was chosen as it represents a realistic level of exposure based upon process hazards analysis.  A 1\" valve break containing synthesis gas at 1500 psia and 420 degree F would release approximately 54.32 lb/min of hydrogen to the atmosphere.  Based upon the RMP Offsite Consequence Analysis Guidance using:  (1) Table C-2 to find the LFL (mg/l) for hydrogen, and (2) Table 19 to find the distance to the LFL by using a factor determined by dividing the release rate by the LFL, the resulting release would reach a maximum distance of 0.06 miles.  The area potentially impacted by this alternate release is limited to the BMLP facility and approximately 20 feet on the adjacent DuPont Ammonia Facility.\n\nAccidental Release Prevention Program\nThe Beaumont facility has a comprehensive Process Safety Management (PSM) Program and is subject to the Occupational Safety and Health Administration's standard for process safety management of highly hazardous chemicals found at 29 CFR Part 1910.119.  Key elements of the PSM program include: 1) stringent design standards of equipment which incorporate substantial safety factors and include state of the art monitoring and control instrumentation; 2) extensive process safety information that is accurate and up to date; 3)  well trained operating, maintenance, and contractor personnel; 4) written operating, maintenance, and safe work procedures; 5) mechanical integrity procedures for process equipment inspections and quality control; 6)  management of change and pre-startup review procedures; 7)  periodic, detailed evaluation of each process area by a team utilizing HAZOP methodology;  8)  regular PSM  program audits; and 9) employee participation in every element of the PSM Program. \n\nFive-Year Accident History\nThere have been no accidental releases from covered processes at the Beaumont facility within the past five years that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3573,
      "SummaryText": "ns, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program\nThe Beaumont facility also has a comprehensive Emergency Response Program which includes a written plan that is coordinated with local authorities.  The Beaumont facility is a participant in the Beaumont Industrial Park Emergency Response Team.  Beaumont facility personnel are active members of the Jefferson County Local Emergency Planning Committee (LEPC).  The plant exercises its emergency response plan annually and also participates in county-wide drills that are staged by the LEPC and other local emergency response authorities."
    }
  ]
}