{
  "FacilityID": 35780,
  "FacilityName": "Otisco Lake Metering Station",
  "FacilityStr1": "2760 Otisco Valley Road",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "NY",
  "FacilityZipCode": "13110",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36067",
  "LEPC": "Onondaga County LEPC",
  "FacilityLatDecDegs": "42.904444",
  "FacilityLongDecDegs": "-076.313333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ocwa.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 70860432,
  "ParentCompanyName": "Onondaga County Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Onondaga County Water Authority",
  "OperatorStr1": "Northern Concourse",
  "OperatorStr2": null,
  "OperatorCity": "Syracuse",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13211",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Michael E. Hooker",
  "RMPTitle": "Executive Director",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060541",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-15 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.90453,
  "FRS_Long": -76.31171,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51576,
      "AltID": "Water Disinfection",
      "FacilityID": 35780,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52751,
          "ProcessID": 51576,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68115,
          "ProcessID": 51576,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568115,
          "ProcessID": 51576,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35780,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES AT FACILITY - The Ondaga County Water Authority (OCWA) has prepared this submittal under the requirements of the Risk Management Planning (RMP) Program (40 CFR 68).  OCWA is committed to ensuring the safety of their employees, local residents, and potential environmental receptors through the implementation of safe chlorine utilization practices, procedures and measures.\n\nFACILITY DESCRIPTION AND REGULATED SUBSTANCES HANDLED -OCWA utilizes chlorine in bulk (1-ton chlorine cylinders) at their Otisco Lake Metering Station for preliminary disinfection and zebra mussel control.  Water from Otisca Lake is initially chlorinated at Otisco Lake Metering Station and conveyed (via gravity-flow through separate 24-inch and 36-inch pipelines) to the Marcellus Water Treatment Plant.  Chlorine is utilized at the Otisco Lake Metering Station for the following reasons: provide zebra mussel control (chlorine is injected at the water intake of both the 24-inch and 36-inch pipelines) and for preliminary disinfections (OCWA has a number of customers who obtain their water supply directly from the 24-inch pipeline).\n      The Otisco Lake Metering Station operates 24-hours a day, seven days a week.  The Otisco Lake Metering Station is unmanned (personnel routinely inspect the facility and are present during each chlorine cylinder delivery/change-out).  Alarms at the facility are connected to an autodialer system and/or the Supervisory Concourse operation (OCWA's Northern Concourse facility is manned 24-hours a day).  Access to the facility is restricted by fencing.\n       The only RMP-\"regulated\" substance utilized at the facility is gaseous chlorine.  The facility maintains a maximum of 14,000 pounds (seven 1-ton cylinders) on hand at any given time.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION SYSTEMS - OCWA has implemented a number of passive and active mitigation measures in an effort to r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35780,
      "SummaryText": "educe the probablility or minimize the impacts of a gaseous chlorine release.  These measures include: (1) chlorine cylinders are maintained in a building which would contain minor releases and dramatically reduce the impacts of a catostrophic release; (2) OCWA has developed and implemented standard operating procedures (SOPs) for the delivery of chlorine cylinders and the testing and hook-up of chlorine cylinders; (3) OCWA has installed a leak detection system in the Chlorine Storage Room (the chlorine \"sniffers\" are tested on a routine basis, using hypochlorite); (4) OCWA maintains emergency response equipment at the facility (equipment includes: air pack; chlorine cylinder repair kit; and, fire extinguisher; (5) chlorine cylinders have a number of design considerations aimed at reducing the likelihood of a significant, uncontrolled release (these include protective dome covers over the cylinder valve and fusible plugs to protect from overpressurization due to exposure to heat); (6) the Chlorine Storage Room is a non-smoking area (in addition, no flammable materials are maintained in the Chlorine Storage Room); (7) the Marcellus Fire Department has been notified of the presence of chlorine cylinders (OCWA has a coordination agreement with the Fire Department); (8) OCWA has developed and implemented a Process Safety Management (PSM) Program which aims at reducing the potential for a significant chlorine release; (9) the facility maintains a back-up generator with automatic switchover capabilities (ensures uninterrupted electrical service of chlorine protective equipment); (10) the facility maintains a portable chlorine detector which can be utilized to define the extent of a plume in the event of a chlorine release; (11) all facility operators are certified and are familiar with the operation of the chlorine system and the use of the health and safety equipment; (12) OCWA has incorporated certain design and operational procedures to limit the potential for a chlori"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35780,
      "SummaryText": "ne release (e.g., all chlorine piping is chemically-compatible and properly supported; rotameters in the chlorinators are recessed to avoid damage due to impact; a vacuum eduction system is in-place to prevent the escape of chlorine gas; pigtail connections are replaced reguarly; etc.); (13) facility alarms sound at OCWA's Northern Concourse facility (which is manned 24-hours per day); (14) OCWA has implemented a Preventive Maintenance program for major equipment components (generator,pumps, etc.); and, (15) chlorine cylinders are maintained in cradles in the Chlorine Room to limit the potential for impact/damage.\n       The protective measures limit the potential for significant impact to the local population/environment.\n\nFIVE YEAR ACCIDENT HISTORY - OCWA has not had any accidents from their Otisco Lake Metering Station operation which would be \"reportable\" under 40 CFR 68.42 (\"reportable\" accidents are incidents which have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage).\n\nEMERGENCY RESPONSE PROGRAM - -OCWA has established a coordination agreement with the Town of Marcellus Fire Department (Fire Department has agreed to respond to any incidents and provide notifications, as applicable, to local residents).  In addition to the coordination agreement, OCWA has developed a formal \"Emergency Response Plan\" as an element of their Process Safety Management Program.  The following major elements are addressed in the \"Emergency Response Plan\": (a) escape routes and procedures; (b) procedures for post-evacuation employee accounting; ( c) preferred means to report emergencies; (d) emergency coordinators; (e) outside clean-up contractors; (f) emergency equipment; (g) coordination agreement; (h) alarm systems; and, (i) reporting requirements.\n       In addition, facility personnel conduct spill response drills/training in accordance with the req"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35780,
      "SummaryText": "uirements specified under 29 CFR 1910.119.\n\nPLANNED CHANGES ON CHLORINATION SYSTEM - Through the implementation of the PSM program, OCWA has identified a number of modifications (both equipment and procedural) aimed at providing additional safety of the chlorine system at the Otisco Lake Metering Station.  These modifications have been/are currently being implemented."
    }
  ]
}