{
  "FacilityID": 35794,
  "FacilityName": "Frez-N-Stor Inc.",
  "FacilityStr1": "311 West Sunset, Suite A",
  "FacilityStr2": "P. O. Box 88",
  "FacilityCity": "Springdale",
  "FacilityState": "AR",
  "FacilityZipCode": "72764",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05143",
  "LEPC": "Washington LEPC",
  "FacilityLatDecDegs": "36.174167",
  "FacilityLongDecDegs": "-094.134167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7807324,
  "ParentCompanyName": "Frez-N-Stor Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Evans",
  "OperatorStr1": "311 West Sunset, Suite A",
  "OperatorStr2": "P. O. Box 88",
  "OperatorCity": "Springdale",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72764",
  "OperatorZipCodeExt": null,
  "RMPContact": "Barry Bridges",
  "RMPTitle": "Dir. of Safety & Compliance",
  "FTE": 84,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000125134",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Springdale, AR",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 36.17448,
  "FRS_Long": -94.13577,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51591,
      "AltID": null,
      "FacilityID": 35794,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 52766,
          "ProcessID": 51591,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 68131,
          "ProcessID": 51591,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 568131,
          "ProcessID": 51591,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35794,
      "SummaryText": "FREZ-N-STOR\nSpringdale, Arkansas\n\nRISK MANAGMENT PLAN \nExecutive Summary\n\n\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Frez-N-Stor, we utilize anhydrous ammonia which is considered hazardous by the Environmental Protection Agency (EPA).  The properties which make ammonia valuable as a refrigerant also necessitate certain safety precautions.  Frez-N-Stor strives to protect all its valuable resources and assets - both personnel and property.  We live and have families in this community.  We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment.  It is our policy to comply with Federal, State, and Local regulations.  Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases.\n\nOur emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies.  We work in conjunction with the Springdale Fire Department and the Washington County Local Emergency Planning Committee (LEPC) to prepare for necessary notification of all affected neighbors.\n\n\n2.  THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe primary purpose of our facility is the temporary storage of refrigerated and frozen foods.  We utilize anhydrous ammonia as the primary means for refrigeration and freezing.  An outside company is used to fill our main receiver tanks.  Piping then carries the ammonia to the needed refrigeration or freezing units.  Access to the site is restricted to facility employees, authorized management personnel and authorized contractors.\n\nThe regulated substance used at our facility is anhydrous ammonia.  The maximum amount of ammonia stored at this facility is 36,000 pounds.  We have the capacity for more but our policy is not to exceed IIAR recommendations of 80%.\n\n\n3.  THE WORST CASE RELEASE SCENARIO(S) AND THE ALTERNATIVE RELEASE SCENARIO(S),"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35794,
      "SummaryText": " INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\nWorst Case Scenario\nThe worst case scenario would be a release of 9,094 pounds pf ammonia.  It is assumed that the entire contents are released as a two phase flow (gas and aerosol-ALOHA).\nDistance to endpoint: 1.1 miles\n\nAlternative Scenario\nThe alternative scenario would be a release of approximately 1,957 pounds of ammonia.  \nDistance to endpoint:  0.09 miles (160 yards)\n \n\n4.  FIVE-YEAR ACCIDENT HISTORY\n\nTo date, this Frez-N-Stor facility has not had a reportable release.  \n\n\n5.  THE RMP MANAGEMENT PROGRAM\n\nThe management of the RMP program will be handled by Mr. Barry Bridges, Director of Safety & Compliance and by Dave Tucker, Maintenance Manager.  Mr. Bridges and Mr. Tucker will administrate in conjunction with the Frez-N-Stor management and personnel.  Other entities or organizations that will be coordinated with include the Springdale Fire Department and HAZMAT team and the Washington County LEPC.\n\n\n6.  THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\n\nThe Frez-N-Stor facility complies with all applicable Federal, State and Local regulations including the EPA?s Accidental Release Prevention Rule.  Our personnel are trained about this during our Hazard Communications Training and through access to our Written Programs.  Our Refrigeration Maintenance operators receive On-The-Job training (OJT).  They are given written and oral tests and are observed by senior maintenance in order to demonstrate proper job skills and knowledge.  Also, the ammonia system is operated, tested and maintained to the standard of International Institute of Ammonia Refrigeration, the most stringent standards of the industry.\n\n\n7.  THE EMERGENCY RESPONSE PROGRAM\n\nWe work very closely with the Springdale Fire Department and HAZMAT team on emergency preparedness.  We meet periodically with representatives of each to address any changes in the fa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35794,
      "SummaryText": "cility or any new concerns.\n\n\n8.  PLANNED CHANGES TO IMPROVE SAFETY\n\nCurrently, Frez-N-Stor trains and tests all refrigeration technicians. Our preventative maintenance program is above standard and our total ammonia Process Safety Program is reviewed annually and updated periodically. Our program is improved continuously through annual updates of our written program and annual training of our technicians.  We also take advantage of new technologies when safer and more economical alternatives are available."
    }
  ]
}