{
  "FacilityID": 35901,
  "FacilityName": "Spokane Regional Waste-to-Energy Facility",
  "FacilityStr1": "2900 South Geiger Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Spokane",
  "FacilityState": "WA",
  "FacilityZipCode": "99224",
  "Facility4DigitZipExt": "5400",
  "FacilityCountyFIPS": "53063",
  "LEPC": "Spokane County LEPC",
  "FacilityLatDecDegs": "47.626389",
  "FacilityLongDecDegs": "-117.504444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.solidwaste.org",
  "FacilityEmailAddress": "dtaam@spokanecity.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Spokane",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Spokane",
  "OperatorStr1": "808 W Spokane Falls Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Spokane",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99201",
  "OperatorZipCodeExt": null,
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000091615",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AOP-3",
  "SafetyInspectionDate": "2004-04-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2009-05-20 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 47.626529,
  "FRS_Long": -117.504278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51748,
      "AltID": "Thermal DeNOx",
      "FacilityID": 35901,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 68389,
          "ProcessID": 51748,
          "ChemicalID": 56,
          "Quantity": 54453.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 52923,
          "ProcessID": 51748,
          "NAICSCode": "562213",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 29760,
              "Process_NAICS_ID": 52923,
              "SafetyReviewDate": "2002-06-04 00:00:00",
              "PHA_Date": "2004-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-06-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Freezing Conditions, Over Temperature",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Control System",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Remote Control Shutdown Device",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Video camera with monitor in control room",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Increased storage tank security, Windsocks, Improved PM & Testing",
              "OpProceduresReviewDate": "2003-11-30 00:00:00",
              "TrainingReviewDate": "2004-03-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "CD ROM",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-04-04 00:00:00",
              "EquipmentInspectionDate": "2004-06-15 00:00:00",
              "EquipmentTested": "All instrumentation, valves and heaters (during scheduled outage)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-12-13 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2002-06-21 00:00:00",
              "AuditCompletionDate": "2004-06-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-12-13 00:00:00",
              "HotWorkPermitReviewDate": "2004-02-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-05-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 43226,
                  "PreventionProgram3ID": 29760,
                  "ProcessChemicalID": 68389
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35901,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-02 00:00:00",
    "ERTrainingDate": "2004-06-14 00:00:00",
    "CoordinatingAgencyName": "Fire District 10",
    "CoordinatingAgencyPhone": "5092442425",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35901,
      "SummaryText": "EXECUTIVE SUMMARY\nRisk Management Plan Executive Summary\nThermal DeNOx (Anhydrous Ammonia) System Risk Management Plan\nSpokane Regional Solid Waste Disposal  - Waste to Energy Facility\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nThe Spokane Regional  Waste-to-Energy (WTE) Facility, owned by the City of Spokane and operated by Wheelabrator Spokane Inc., is strongly committed to employee, public, and environmental safety.  The facility has just recently had its VPP STAR on-site evaluation and has been recommended to VPP STAR.  The facility has followed the requirements of WISHA¿s Safety Standards for Process Safety Management of Highly Hazardous Chemical regulations (Chapter 296-67 WAC, the Washington State rule implementing 29 CFR 1910.119) since their promulgation in 1992.\n\nAll employees are trained in the potential hazards of facility operations and the chemicals used at the facility.  In addition, the facility has an employee safety program which includes a facility safety committee to address safety in a timely and on-going manner.\n\nThe public is welcome to visit the WTE Facility, with public tours provided on a weekly basis.\n\nThe facility works closely with the Local Emergency Planning Committee (LEPC) and Spokane County Fire District 10 to coordinate emergency response preparedness and ensure a safe operating environment.\n\n2.  The Stationary Source and the Regulated Substance Handled\n\nThe WTE Facility consists of two 400-ton per day refuse fired steam boilers, generating a total of about 26 megawatts of electricity per hour when operating at full load.  \n\nNitrogen oxides are generated during the combustion of refuse due to the oxidation of the nitrogen contained in the refuse and/or in the combustion air.  The Thermal DeNOx process reduces the amount of NOx in the flue gas utilizing a reagent, ammonia.  The gaseous ammonia reacts with NOx and forms nitrogen gas and water.  \n\nThe Thermal DeNOx process includes an above-ground anhydrous am"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35901,
      "SummaryText": "monia storage tank and process piping that leads to the injection nozzles in the furnace.  The ammonia is injected into the furnace using a carrier such as steam or compressed air.\n\n3.  ¿Worst-Case¿ and Alternative Release Scenarios\n\n¿Worst-Case¿ and alternate release scenarios have been calculated following the procedures, equations, and reference tables contained in the EPA¿s Risk Management Program (RMP) Guidance for Offsite Consequence Analysis, dated April 1999.\n\nThe ¿worst-case¿ release scenario followed EPA guidance for toxic substances handled as a gas or liquid under pressure and assumed that the maximum total tank capacity was released over a 10-minute period.  The maximum tank capacity takes into account administrative controls that restrict tank fill to 80% plus 5%. \n\nThe alternative release scenario was selected as a failure in the piping between the outside ammonia storage tank and where the piping enters the building.  Maximum release duration would be less than 10 minutes due to an electronic data control system that monitors ammonia injection and NOx emissions and alerts system operators to deviations from normal system parameters.  The ammonia system has automatic as well as operator-initiated electronic and manual shutoff valves.\n\nIt should be noted that any release of ammonia from the facility impacting offsite receptors is highly unlikely due to extensive employee training and operating procedures, and the protected orientation of the anhydrous ammonia storage tank and piping.\n\n4.  The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe WTE Facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  The facility has followed the requirements of WISHA¿s Process Safety Management of Highly Hazardous Chemical (PSM) regulations (Chapter 296-67 WAC, implementing 29 CFR 1910.119 in the state of Washington) since their promulgation in 1992."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35901,
      "SummaryText": "As the RMP prevention program requirements virtually mirror the requirements of WISHA¿s PSM regulation, the facility has had prevention program systems in place for several years.  The following sections briefly describe the prevention program elements in place at the WTE facility:\n\nSafety Information:  The facility maintains a detailed record of written safety information, which describes the chemical hazards, operating parameters, and equipment design associated with all aspects of the Thermal DeNOx process.\n\nHazard Review:  The most recent hazard review of the Thermal DeNOx process was conducted using the Whatif/Checklist and HAZOP methods.  The hazard analysis is updated and revalidated (at a minimum) every five years.  All hazard review findings are addressed in a timely manner and documented.\n\nOperating Procedures:  For the purpose of safely and efficiently conducting activities associated with the Thermal DeNOx process, the facility maintains written operating procedures.  These procedures address various modes of operation such as  normal operations, tank filling, line breaking, emergency shutdown, emergency operations, and normal shutdown and startup after turnaround.  The information is reviewed and certified at least annually and is readily accessible to operators involved with the process.\n\nTraining:  The facility has a comprehensive training program in place to ensure that employees who are operating the facility are completely competent in the operating procedures associated with the process.  New employees receive basic training in process operations and hazards followed by on-the-job training and supervision until they are deemed competent to work independently.  Refresher training is provided at least every three years and more frequently as needed.\n\nMaintenance:  The facility carries out regular maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with previous traini"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35901,
      "SummaryText": "ng in these practices.  Furthermore, personnel are offered specialized training as needed.  Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits:  Compliance audits are conducted on a regular basis to determine whether the provisions set out under the RMP and PSM regulations are being implemented.  These audits will be carried out at least every 3 years and any corrective actions required as a result of the audits will be completed in a safe and timely manner and documented.\n\nIncident Investigation:  Historically there have been no incidents involving the Thermal DeNOx process.  However, in the event of a release of ammonia, the facility has in place a program that promptly investigates any incident that has resulted in, or could have reasonable resulted in, a catastrophic release of ammonia.  These investigations are undertaken to identify the situation leading to the incident, as well as to identify any corrective actions to prevent the incident from recurring.  All investigations are documented in incident investigation report.\n\n5.  Five-Year Accident History\n\nThe WTE Facility, has had an excellent record for preventing accidental releases since it¿s opening in 1990.  Due to the facility¿s stringent release prevention policies, there have been no accidental release of ammonia impacting offsite receptors in the past five years or since operations began.\n\n6.  Emergency Response Program\n\nAll employees are trained in the facility¿s emergency response procedures.  Emergency response procedures are contained in Emergency Action Plan, which specifically address procedures for a release of ammonia.  Other than responding to a minor release of ammonia that can be addressed by on-site personnel, all major releases will be handled by calling emergency services at 911.\n\nIn addition, the facility has coordinated emergency response efforts with the LEPC, and is included in the community emergency response pla"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35901,
      "SummaryText": "n.\n\n7.  Planned Changes to Improve Safety\n\nThe facility is planning to replace the ammonia Thermal DeNOx process with a urea based system within the next 12 months.  The existing ammonia based system will remain in place for a period of time until the urea system's reliability is demonstrated."
    }
  ]
}