{
  "FacilityID": 35915,
  "FacilityName": "George T. Lohmeyer Wastewater Treatment Plant",
  "FacilityStr1": "1765 S.E. 18th Street",
  "FacilityStr2": null,
  "FacilityCity": "Fort Lauderdale",
  "FacilityState": "FL",
  "FacilityZipCode": "33316",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12011",
  "LEPC": null,
  "FacilityLatDecDegs": "26.099167",
  "FacilityLongDecDegs": "-080.125000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.ftlaud.fl.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Fort Lauderdale",
  "Company2Name": "Public Service Department",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Fort Lauderdale",
  "OperatorStr1": "100 N. Andrews Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Fort Lauderdale",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33301",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050721",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 26.09952,
  "FRS_Long": -80.12476,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51778,
      "AltID": "Chlorine system",
      "FacilityID": 35915,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 68422,
          "ProcessID": 51778,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 52953,
          "ProcessID": 51778,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 29788,
              "Process_NAICS_ID": 52953,
              "SafetyReviewDate": "2004-04-19 00:00:00",
              "PHA_Date": "2004-04-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Awarded contract for installation of chlorine scrubber",
              "OpProceduresReviewDate": "2004-04-19 00:00:00",
              "TrainingReviewDate": "2004-04-19 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Certification",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": "Certification",
              "MaintenanceReviewDate": "2004-04-19 00:00:00",
              "EquipmentInspectionDate": "2004-06-03 00:00:00",
              "EquipmentTested": "Leak detector and chlorinators",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-05-28 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-28 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-11 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-05-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 43256,
                  "PreventionProgram3ID": 29788,
                  "ProcessChemicalID": 68422
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35915,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "District 11 LEPC",
    "CoordinatingAgencyPhone": "9549854416",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35915,
      "SummaryText": "INTRUDUCTION\n    At the turn of this century water borne diseases were a leading cause of death in the United States.  Epidemics of typhoid, cholera, dysentery and other water-borne diseases occurred.  After chlorine¿s introduction into public water supplies and into wastewater treatment systems, deaths from typhoid in the U.S. dropped dramatically from 25,000 in 1900 to less than 20 in 1960.  Water-borne disease is even still a leading cause of infant mortality in many countries throughout Asia, Africa, and Latin America where infant mortality rates are 10 to 20 times greater than in the U.S.  In the U.S., however, water-borne disease has been virtually eliminated due to an effective public health strategy of utilizing chlorine for drinking water and wastewater disinfection.  Chlorine disinfection is arguably one of the greatest achievements for public health worldwide in the last hundred years and is credited with increasing the life expectancy of Americans by more than 50 percent.\n    The use of chlorine is not risk free, however.  Historically it is clear that utilities have recognized the risks and have been successful in developing procedures to handle chlorine safely and to protect the off-site public and the environment from potential accidental releases.\n    As an added layer of protection, the United States Environmental Protection Agency promulgated Hazardous Chemical Risk Management Program regulations to further ensure that facility owners understand the risks and take proactive efforts to reduce risk through comprehensive training programs, procedures, and risk mitigation measures.  Additionally, EPA wanted the public to be informed regarding these issues.\n    The City of Fort Lauderdale Public Services Department has always understood these risks and has maintained a well-trained staff and a safely operated and maintained facility.  The City¿s track record is exemplary with respect to handling hazardous chemicals.  Furthermore, the City has taken a co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35915,
      "SummaryText": "mprehensive approach to be in full compliance with the RMP regulation by June 21, 2004, and a proactive approach to a public information program which is above and beyond the requirements of the regulation.\n                                                                                                                                                                                 FACILITY BACKGROUND  \n   The City owns and operates the George T. Lohmeyer Wastewater Treatment Plant (G.T.L. WWTP).  The facility¿s mission is to protect public health by efficiently treating and properly disposing of the community¿s wastewater.  Approximately 1,500 pounds per day of chlorine gas is used to disinfect the wastewater prior to disposal.  A maximum of 40,000 pounds of chlorine are stored on-site.  The chlorine is stored as a gas that is liquefied under pressure in containers that contain 2,000 pounds each. \nChlorine Process and Safety Equipment\n    The G.T. Lohmeyer WWTP chlorine system is a liquid chlorine feed system.  The system consists of an enclosed chlorine storage and handling area and an adjacent enclosed room containing the evaporators, chlorinators, and injector assemblies.  Eight containers are hooked up in four banks, two containers per bank.  The four banks feed to a common manifold.\nOne bank is in service at any one time and feeds liquid chlorine to the evaporators.  The liquid chlorine in the evaporator is contained in a pressure vessel.  A hot water bath surrounding the pressure vessel transfers heat to the chlorine, which in turn vaporizes into a gas.  Chlorine gas flows under pressure from the evaporator to the chlorinator.  As the gas enters the chlorinator, a regulator reduces the gas pressure to a slight vacuum.  The vacuum created in the injector assemblies pulls the chlorine gas through the chlorinators (which control the flowrate of gas) and into the injectors.  The chlorine gas is mixed with water in the injectors to form a chlorine solution.  The ch"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35915,
      "SummaryText": "lorine solution is then fed to the various application points.\n    The chlorine storage and handling area, as well as the evaporator/chlorinator room, are equipped with chlorine leak detectors.  The detectors will activate audible and visual alarms throughout the facility to give warning to plant staff.\n                                                                                                                                                                                        RISK MANAGEMENT AND PROCESS SAFERY MANAGEMENT PROGRAM OVERVIEW\n    Chlorine is subject to the Environmental Protection Agency¿s (EPA's) Risk Management Program (RMP) regulation which can be found in 40 CFR 68 and the Occupational Safety and Health Administration¿s (OSHA¿s) Process Safety Management Program (PSMP) regulation which can be found in 29 CFR 1910.119.\n    The primary components of the RMP are as follows:\n* A five-year accident history\n* An off-site consequence analysis for a worst-case and alternative release scenario\n* A comprehensive prevention program to minimize risks (i.e. minimize the potential for a release)\n* An emergency response program to ensure that an accidental release is appropriately handled\n* An overall management program to supervise the implementation of the RMP\n    Following development of the RMP submitted in year 1999, the facility must submit a RMP Update to the EPA by June 21, 2004.  The RMP update, which is presented every five years, reports any process changes or if a new process is added.  The OSHA PSM regulation has basically the same requirements as the prevention program element of the EPA RMP.  The G.T. Lohmeyer WWTP RMP meets the requirements of both regulations.\nThe following sections briefly summarize the elements of the RMP.\n                                                                                                                                                                                     FIVE-YEAR ACCIDENT HISTORY\n    The G.T"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35915,
      "SummaryText": ", when combined with operator training, are instrumental in ensuring safe operation of the system and in preventing accidental releases.\n    The purpose of the mechanical integrity program is to ensure the continued integrity of the process equipment.  An effective mechanical integrity program is integral to preventing accidental chlorine releases that may result from mechanical failure of improperly maintained equipment.  The G.T. Lohmeyer WWTP¿s mechanical integrity program includes maintenance, inspection, and testing procedures and schedules along with maintenance personnel training.\n    Knowledgeable well-trained personnel are essential to preventing and mitigating the effects of accidental chemical releases. The G.T. Lohmeyer WWTP¿s training program ensures that personnel working on or near the chlorine system are adequately trained in operation and maintenance procedures and the appropriate response actions to an accidental chlorine release.\nThe process hazard analysis is a valuable risk reduction tool that outlines deficiencies in equipment and procedures, identifies potential system failure modes, and provides recommendations for system and operational improvements.\n                                                                                                                                                                               EMERGENCY RESPONSE PROGRAM\n    A comprehensive emergency response program has been prepared which outlines the procedures and lines of communication that are necessary to effectively respond to and mitigate a potential chlorine gas release.\n    In the event of a chlorine gas release, leak detectors located in the storage area and evaporator/chlorinator room, will detect the presence of chlorine gas.  The detector will activate audible and visual alarms throughout the facility to give warning to plant staff.  The facility emergency response program includes procedures for notifying the local hazardous materials (hazmat) team"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35915,
      "SummaryText": ". Lohmeyer WWTP has used chlorine to disinfect wastewater for 30 years.  In the last five years, the facility has had no accidental releases, which were required to be reported under the RMP regulation.\n                                                                                                                                                                                   WORST-CASE RELEASE SCENARIO\n    The results of this scenario are not being reported for security reasons.\n                                                                                                                                                                             ALTERNATIVE RELEASE SCENARIO\n    The results of this scenario are not being reported for security reasons.\n                                                                                                                                                                             PREVENTION PROGRAM\n    There are always inherent risks associated with handling and using chlorine.  These risks include the potential inhalation of chlorine gas if it is accidentally released.  The prevention program is a key component to reducing the risk associated with a potential chlorine gas release.  Key elements of the prevention program include:\n* Employee participation\n* Process safety information\n* Process hazard analysis\n* Incident investigation\n* Standard operating procedures\n* Mechanical integrity\n* Management of change\n* Pre-startup review\n* Training\n* Contractors\n* Compliance audits\n* Hot work permits\n* Trade secrets\n    The following briefly states the benefits of the following prevention program elements: standard operating procedures, mechanical integrity program, employee training and the process hazard analysis.\n    The facility staff has developed up-to-date and accurate written standard operating procedures (SOPs)  to ensure that operators have clear instructions for safe operation of the chlorine system.  Effective SOPs"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 35915,
      "SummaryText": "s of the incident and procedures for evacuating the facility.  There are four local hazmat teams in Broward County that can respond to mitigate a chlorine leak.  Facility staff have coordinated with the local fire department to ensure that they are fully trained and equipped to quickly respond to an incident.\n                                                                                                                                                                               PLANNED CHANGES TO IMPROVE SAFETY\n    The City of Fort Lauderdale has undertaken a study to review the costs and qualitative issues of changing to an alternative (i.e., safer) disinfection system.  The alternatives evaluated include switching to on-site generation of sodium hypochlorite (at 0.8% concentration) and purchasing bulk hypochlorite (at 12% concentration).  In addition, these alternatives were compared to staying with chlorine gas and enclosing the existing facilities (to contain a chlorine leak) and adding an emergency chlorine scrubber.  The installation of an emergency chlorine scrubber was selected as the most appropriate for the G. T. Lohmeyer WWTP. A contract has been awarded for this job. It is estimated that the emergency chlorine scrubber will start operations in June 2005."
    }
  ]
}