{
  "FacilityID": 35971,
  "FacilityName": "Chester Water Authority - Octoraro WTP",
  "FacilityStr1": "100 Ashville Road",
  "FacilityStr2": null,
  "FacilityCity": "Little Britain",
  "FacilityState": "PA",
  "FacilityZipCode": "19362",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42071",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "39.795000",
  "FacilityLongDecDegs": "-076.045833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "rwnaef@chesterwater.com",
  "FacilityDUNS": 7910219,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Chester Water Authority",
  "OperatorStr1": "100 Ashville Road",
  "OperatorStr2": null,
  "OperatorCity": "Nottingham",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19362",
  "OperatorZipCodeExt": null,
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107868",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-10-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 39.795,
  "FRS_Long": -76.04583,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "240000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 51841,
      "AltID": "Chlorination",
      "FacilityID": 35971,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 68494,
          "ProcessID": 51841,
          "ChemicalID": 62,
          "Quantity": 46000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53016,
          "ProcessID": 51841,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 19783,
              "Process_NAICS_ID": 53016,
              "SafetyReviewDate": "2004-06-18 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": "Process equipment purchased for chlorine use complies with applicable Chlorine Institute standards.",
              "HazardReviewDate": "2004-06-09 00:00:00",
              "ChangeCompletionDate": "2004-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Vacuum feed system for chlorine gas for all chlorine process piping and equipment external to chlorine storage building",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Remotely activated emergency shutoff on ton container valve",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-14 00:00:00",
              "TrainingReviewDate": "2004-06-18 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-18 00:00:00",
              "EquipmentInspectionDate": "2004-06-09 00:00:00",
              "EquipmentTested": "Chlorine leak detector tested",
              "ComplianceAuditDate": "2002-04-16 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2004-05-24 00:00:00",
              "InvestigationChangeDate": "2004-07-21 00:00:00",
              "MostRecentChangeDate": "2003-06-20 00:00:00",
              "CBI_Flag": 0,
              "Description": "Process 1 Chlorination",
              "_chemicals": [
                {
                  "PrimaryKey": 20693,
                  "PreventionProgram2ID": 19783,
                  "ProcessChemicalID": 68494
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 35971,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lancaster County EMA",
    "CoordinatingAgencyPhone": "7176641200",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 35971,
      "SummaryText": "1. INTRODUCTION\n\nThe Chester Water Authority (CWA) operates the Octoraro Water Treatment Plant in Little Britain Township, Lancaster County, Pennsylvania. Water from Octoraro Reservoir, and the Susquehanna River, is treated by conventional physical and chemical processes to meet drinking water standards.  These processes include disinfection with chlorine.\n\nCWA carefully stores and handles chlorine to prevent its accidental release.  This Risk Management Plan (RMPlan) describes the chemical hazards and explains what CWA is doing to prevent an accidental release.  It has been developed and implemented in accordance with the U.S. Environmental Protection Agency (EPA) Accidental Release Prevention Provisions (40 CFR 68) and guidelines specifically created for water treatment plants (WTPs).\n\nCWA purchases chlorine (CAS Number 7782-50-5) as a compressed liquefied gas from commercial suppliers.  In the disinfection process, liquid chlorine is fed to a vaporizer where the liquid is converted to a gas and then injected under vacuum into the treated drinking water. CWA?s chlorine inventory exceeds the threshold quantity of 2,500 pounds established under the RMP regulations. The Octoraro WTP also uses ammonia, but the maximum inventory is below the RMP threshold quantity of 10,000 pounds; therefore, CWA?s ammonia use is not regulated under RMP. \n\nCWA?s Policies, Release Prevention, and Emergency Response programs for chlorine are described in the following subsections. \n\n2. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Chester Water Authority has a policy that addresses its commitment to accident prevention and risk management. This policy reads as follows:\n\n?The Chester Water Authority is committed to protecting its employees, the public, and the environment from any accidental releases of hazardous materials used at its facilities.  CWA will implement safety, environmental protection, and risk management programs to minimize the risks presented by hazar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 35971,
      "SummaryText": "dous materials used at its facilities.  If there is an accidental release, CWA will either provide, or request from others, immediate emergency response to minimize the effect of the release. CWA will also immediately notify the public, through county emergency management agencies, of any actions necessary to ensure public protection.?\n\n3. FIVE-YEAR ACCIDENT HISTORY\n\nWithin the past five years, CWA?s Octoraro Water Treatment Plant has not had any accidental releases that resulted in injuries or damages. Under the RMP regulations, all accidental releases of a regulated substance that ?resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage? within the past 5 years must be reported.  \n\n4. PREVENTION PROGRAM\n\nUnder the EPA RMP regulations, three levels of prevention program requirements have been established to roughly match the level of effort to the risk of off-site impacts.  Because the offsite consequence analysis showed that the worst-case release scenario could impact offsite public receptors, and because the OSHA PSM standard (29 CFR 1910.119) is not applicable at this facility, CWA?s Octoraro WTP must meet RMP Program 2 Prevention Program requirements for its chlorination process.  CWA?s Prevention Program is summarized below.\n\nA.  Management System:\n\nCWA has developed a management program that assigns overall responsibility for the development and implementation of the Risk Management Program to the Chief of Treatment and Pumping at the Octoraro WTP. The management program also clearly delineates accountability and responsibility for each of the prevention program elements.\n\nB.  Safety Information:\n\nUp-to-date safety information related to the chlorination process is maintained at the plant and is used by plant operators who are responsible for operating the chlorination system.  It includes the following:\n\n? Material Safety Data Sheets "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 35971,
      "SummaryText": "(MSDSs) for chlorine that meet the requirements of 29 CFR 1910.1200(g).  \n? A summary of the maximum intended inventory of the equipment in which the chlorine is stored or processed.\n? Safe upper and lower operating limits (i.e., temperatures, pressures, flows, and compositions) for the chlorination system.\n? Equipment specifications for the chlorination system.\n? A list of the codes and standards used to design, build, and operate the chlorination equipment.\n? A process flow diagram of the chlorination process.\n\nThe chlorination equipment at the Octoraro WTP has been reviewed against recognized and accepted good engineering practices and is designed, maintained, inspected, tested, and operated in a safe manner.  The safety information is updated any time a major change is made to the process that renders the original information inaccurate.\n\nC. Hazard Review:  \n\nCWA performed an initial hazard review of its chlorination system using the WTP Hazard Review Checklist for Simple Chlorine Feed Systems found in the Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  CWA recently conducted another Hazard Review on 9 June 2004 using a Review Checklist for Chlorine Vaporizers (based in part on The Chlorine Institute?s Pamphlet 9, Chlorine Vaporizer Systems) and a Review Checklist for Chlorine Systems from the Chlorine Institute Chlorine Manual. These checklists satisfy the requirements of 40 CFR 68.50.  Any safety issues identified during this review were documented and a schedule has been developed for their resolution.  A copy of the completed hazard review checklists is maintained with the safety information for the Octoraro WTP chlorination system.  \n\nIn the future, CWA will update this review checklist at least every five years or after any major modification to the chlorination process.  \n\nPrior to CWA?s first hazard review (in 1999), a formal safety inspection of the chlorination system was conducted by a representative of the EPA Regio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 35971,
      "SummaryText": "n 3 on 15 December 1994.  The EPA recommended several modifications to improve the safety of the chlorination process and CWA quickly acted to implement the recommended modifications.  A follow-up inspection was conducted by the EPA on 31 May 1996, and soon after, CWA received a letter from the EPA commending the facility for its commitment to accidental release prevention and mitigation. A subsequent EPA visit on 29 October 1999 achieved similar results.\n\nD.  Operating Procedures: \n\nDetailed and up-to-date operating procedures (OPs) have been developed and are maintained for the chlorination process at the Octoraro WTP in accordance with 40 CFR 68.52.  These OPs provide clear step-by-step instructions for safely conducting activities involving the chlorination process in a manner consistent with the chlorine safety information, and are readily available to all employees responsible for working with the chlorination process.  These OPs are reviewed and updated as necessary prior to startup following any major modifications to the chlorination process.\n\nThese OPs cover each operating phase of the chlorination process including normal operations, temporary operations, temporary shutdown, emergency shutdown, and startup following an emergency or temporary shutdown.  The OPs contain special warnings and precautions for any procedures that could be dangerous if performed incorrectly.  Where appropriate, the OPs identify the consequences of deviating from the standard procedure, and also provide instructions on how to correct or avoid such deviations.  \n\nE.  Training  \n\nAll new employees who work with the chlorination system at the Octoraro WTP receive initial training in accordance with 40 CFR 68.54.  The training includes an overview of the chlorination process and equipment and emphasizes standard operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown.  \n\nRefresher training is provided at a minimum of every 3 y"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 35971,
      "SummaryText": "ears to all employees involved in working with a regulated process.  Employees were consulted when determining the appropriate frequency of refresher training.  Documentation is maintained for each employee to ensure he or she has received and understood the required training.\n\nF.  Maintenance:\n\nA maintenance program for the chlorination system at the Octoraro WTP has been developed in accordance with 40 CFR 68.56.  Employees responsible for the maintenance of the chlorination equipment receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure they can perform the job in a safe manner.\n\nWritten procedures and checklists are used to ensure that the chlorination equipment is properly maintained, tested, and inspected at regularly scheduled intervals and that these activities are thoroughly documented.  Maintenance, inspection, and testing procedures and frequencies are consistent with manufacturer?s recommendations and follow accepted engineering practices.  Any equipment deficiencies identified during maintenance, inspection, and testing are corrected in a safe and timely manner.\n\nG.  Compliance Audits:\n\nThe continued compliance of the Risk Management Program for the chlorination system at the Octoraro WTP is ensured through compliance audits that are performed at least once every three years in accordance with 40 CFR 68.58.  The audits are completed by the plant?s Chief of Treatment and Pumping with the assistance of those who operate and maintain the chlorination process and an individual outside the Octoraro WTP.  A report of the findings is generated following the audit and all deficiencies and/or recommendations are promptly addressed and the resolution is documented.  The two most recent compliance audit reports are maintained at the facility.\n\nH.  Incident Investigation:\n\nSpecific incident investigation, reporting, and documentation procedures have been implemented and are adhered to, in accordance"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 35971,
      "SummaryText": " with 40 CFR 68.60, in response to any incident involving a regulated process that did or could have reasonably resulted in a catastrophic release of a regulated substance.  Under EPA RMP, a catastrophic release is defined as a major uncontrolled emission, fire, or explosion, involving one or more regulated substances that present imminent and substantial endangerment to public health and the environment.\n\nThe incident investigation procedure is initiated as soon as possible and no later than 48 hours following any incident.  A team is then established to perform the incident investigation and always includes at least one person knowledgeable in the process; a contract employee if the incident involved the work of a contractor; and other persons with appropriate qualifications to investigate an accident.  Following the investigation, a written report is prepared summarizing the following information at a minimum:  date of the incident; date the investigation began; description of the incident and any contributing factors; and any recommendations resulting from the investigation.  When completed, the report is reviewed by all affected personnel (i.e., those that operate or maintain the process) including affected contract employees.  Incident investigation reports are maintained at the facility for a minimum of 5 years. \n\n5.  EMERGENCY RESPONSE PROGRAM\n\nCWA takes every precaution to prevent an emergency from occurring, including training and equipping its employees to abate a potential release in its initial stages before it can become an emergency. CWA relies on Lancaster County Emergency Management Agency to provide emergency response personnel and equipment.\n\nCWA?s emergency action plan contains:\n\n? Emergency notifications required by the facility?s SARA Title III Off-Site Response Plan, developed by Lancaster County LEPC.  Agencies notified directly by CWA include the Lancaster County Emergency Management Agency, Pennsylvania Emergency Management Agency and the N"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 35971,
      "SummaryText": "ational Response Center. \n? Evacuating of non essential plant personnel from the immediate plant area and sheltering at another plant location that is at a higher elevation and  normally upwind from the chlorine building\n? Coordination with emergency responders by qualified plant personnel.\n\n6. SAFETY IMPROVEMENTS\n\nIn CWA?s ongoing effort to improve safety and reduce the risk of accidental releases at the Octoraro WTP, the following changes to the RM Program and the facility have been implemented or are currently planned.  These improvements were identified as risk reduction measures during the hazard review or EPA inspection of the WTP chlorination system, or were the result of CWA?s desire to develop an improved RM Program and an inherently safer process. Implementation dates are shown in parenthesis.\n\n? Converted the pressurized-feed chlorination system to an intrinsically safer vacuum-feed system. (October 1983)\n? Installed bollards in front of electrical poles next to the chlorine storage and hook-up room. (January 1995)\n? Upgraded chlorine and ammonia placards consistent with NFPA 704. (May 1995)\n? Labeled the ventilation switches with an identification placard. (May 1995 and June 1996)\n? Installed new chlorine detectors. (July 1995)\n? Mounted a wind sock and incorporated its use into the emergency response plan.  (July 1995)\n? Installed additional air intake to the chlorine storage and hook-up room. (August 1995)\n? Chlorine storage intrusion alarm installed. (March 1996)\n? Developed process diagrams to accompany written procedures. (April 1996)\n? Acquired supplied air system with escape canisters and incorporated their use into evaporator maintenance. (October 1998)\n? Improved plant phone system to include paging with external speakers for reaching personnel in the event of a chlorine leak. (January 1999)\n? Installed emergency dialer for after hour &weekend notification of plant supervisors (March 1999)\n? Installed placards identifying alarm lights. (Septembe"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 35971,
      "SummaryText": "r 1999) and added more alarm lights at another location (June 2002)\n? Acquired additional masks and required routine use of supplied air system by operators when making and breaking connections  (March 2000)\n? Installed emergency shutoff valve for remote and local shutoff of ton cylinder valve (August 1999) \n? Installed outside monorail to improve cylinder unloading (June 2000)\n? Upgraded electrical equipment and wiring in chlorine storage building, relocating critical components from storage area to separate room. (July 2001)\n? Replaced liquid chlorine post-treatment chlorination feed lines with a vacuum chlorine gas line fed by the chlorine vaporizers. (April 2004)\n? Install a dry scrubber system to mitigate an accidental chlorine release in the chlorine storage building. (In progress, expect completion by April 2005)"
    }
  ]
}