{
  "FacilityID": 3608,
  "FacilityName": "Magnablend, Inc.",
  "FacilityStr1": "100 WEST STERRETT ROAD",
  "FacilityStr2": null,
  "FacilityCity": "WAXAHACHIE",
  "FacilityState": "TX",
  "FacilityZipCode": "75165",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48139",
  "LEPC": "Ellis LEPC",
  "FacilityLatDecDegs": "32.457778",
  "FacilityLongDecDegs": "-96.833333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "info@magnablend.com",
  "FacilityDUNS": 32454357,
  "ParentCompanyName": "Magnablend, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Pendery",
  "OperatorStr1": "P.O. Box 62",
  "OperatorStr2": null,
  "OperatorCity": "DeSoto",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75123",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Pendery",
  "RMPTitle": "Operations Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "75165MGNBLI35EA",
  "EPAFacilityID": "100000043758",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-04-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.47404,
  "FRS_Long": -96.86493,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4157,
      "AltID": " Tank Storage of Ammonia",
      "FacilityID": 3608,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4241,
          "ProcessID": 4157,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4428,
          "ProcessID": 4157,
          "ChemicalID": 56,
          "Quantity": 36680.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504428,
          "ProcessID": 4157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 4158,
      "AltID": "Storage of HF",
      "FacilityID": 3608,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4242,
          "ProcessID": 4158,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4429,
          "ProcessID": 4158,
          "ChemicalID": 55,
          "Quantity": 2200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504429,
          "ProcessID": 4158,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3608,
      "SummaryText": "Magnablend, Inc. is a small, privately held chemical blending and repackaging facility located on Sterrett Road in Waxahachie, Texas.  At this facility, large volumes of products are often mixed or packaged for shipment to retailers or end-line users.  Magnablend, Inc. specializes in blending agricultural micro nutrients, oil field specialties, buffering agents, and cleaning agents (glass cleaner, laundry detergents and car wash powders).  None of the blending procedures include conducting chemical reactions except for simple neutraliztions.  A few of the many products that are generated at Magnablend, Inc. require the addition of hazardous chemicals such as Anhydrous Ammonia or Hydrofluoric Acid, both of which require the implementation of a Risk Management Program to ensure that all proper safety techniques are being followed to prevent accidents from occurring and to protect the environment and community around the facility in the case of an accident.  The primary hazards at Magnablend, Inc. include the storage of Anhydrous Ammonia in a pressurized aboveground tank on the West Side of the facility and the storage of 70% Hydrofluoric Acid in drums inside the facility.  The Anhydrous Ammonia tank has a 12,000 gallon capacity, but rarely does it ever contain more than 36,000 pounds of liquified ammonia.  There are also no more than four drums, each weighing 550 pounds, of Hydrofluoric Acid on site.  These drums are handled with extreme care, and employees and contractors must attend an annual safety class, given by the manufacturer of the acid, in order to continue to purchase this chemical.  This class teaches the employees of Magnablend, Inc. how to properly handle the chemical, what to do in case of a spill, the effects of exposure, and first aid responses.  The employees of Magnablend, Inc. and the environmental consultants both attended the class on August 4, 1998.\nBecause employees of Magablend, Inc. sometimes handle large volumes of chemicals, it is extremely"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3608,
      "SummaryText": " important for the company to have strict policies with regard to safety when handling these chemicals.  Over the past few years, Magnablend, Inc. has made extraordinary strides to achieve the safest work environment possible.  Newer tanks have been purchased and installed to ensure the longterm stability of the large volume containers on site.  The entire facility has an 8-foot chain link fence around the perimeter to keep unauthorized people from entering the premises.  A 2-foot retaining wall has been installed inside the facility and around all of the mixing tanks in case an accidental spill occurs.  If so, all of the chemicals and product will be contained inside the building and will easily be cleaned up without exposure to the environment and surrounding areas.  Magnablend, Inc. performed contractor safety training on February 24, 1999 for hot work (welding) to be performed at the facility.  Due to the amount of chemicals on site and the potential hazards of these chemicals, Magnablend, Inc.  trained the contractors on the location of hazardous chemicals, where to perform the hot work, and what to do in case of an emergency.  Although there are many chemicals on site at Magnablend, Inc., only the storage of 70% Hydrofluoric acid and the outside storage of Anydrous Ammonia exceed the threshold quantities that warrant reporting under the Risk Management Rules of the the Clean Air Act 112 (r).  Due to the amount of various chemicals present at the facility, Magnablend, Inc. has developed a management policy that mandates all employees working with chemicals must use the buddy system.  The management of Magnablend, Inc. is committed to ensuring a safe work environment for its employees and the community around the facility.  Because of this committment, Magnablend, Inc. has maintained a longterm relationship with an environmental, health, and safety consulting company to oversee that all safety and environmental issues are remedied as they surface.  \nFor both che"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3608,
      "SummaryText": "micals mentioned above, Magnablend, Inc. has developed both worst-case scenarios and alternative scenarios using the Environmental Protection Agency's RMP Comp (Risk Management Program Computation).  Magnablend, Inc. has determined that the worst-case scenario with regard to the Anhydrous Ammonia would be the release of the entire contents of the outside storage tank due to some sort of failure or physical accident.  Based on the information generated by the EPA's RMP Comp, a release would last for approximately 10 minutes, releasing 3,670 pounds of Anhydrous Ammonia per minute.  Assuming that the mitigation efforts installed by Magnabeld, Inc. did not work, the estimated distance to the toxic endpoint of the chemical would be 3.6 miles.  The terrain around Magnablend, Inc. is generally flat and unobstructed, the wind speed is assumed to be 1.5 meters/second in a stability class F with air temperature of 77 degrees Fahrenheit.  The constant for the toxic endpoint calculations is 0.14 mg/L based on the ERPG-2 guidleines.  Because the estimated distance to endpoint is 3.6 miles, Magnablend, Inc. has determined that a worst-case release might have offsite impact.  There is a residential population of approximately 400 people within this distance and a Baptist community college is also located approximately 3 miles from the facility.  For these reasons Magnablend, Inc. has implemented and installed many safety features on this tank.  Magnablend, Inc. has installed 6\" diameter concrete filled bollards cemented into the ground to prevent any trucks or vehicular traffic from accidentally hitting the tank.  Magnablend, Inc. has also installed a water spray system above the tank designed by a chemical engineer consultant.  This water spray system is turned on in the event of a release to produce a spray of water to trap the releasing vapors of Anhydrous Ammonia and cause them to mix with the water and fall to the ground where there is a collection pit.  The water spray is ex"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3608,
      "SummaryText": "pected to knock down all of the releasing vapors.  After the vapors are in liquid form from mixing with the water cloud, the resulting solution can be collected and disposed of properly.  The ammonia pipes inside the buildings are also fitted with pressure sensitive valves that automatically shut off if a drop in pressure occurs.  A drop in pressure could result from a leak in a line or an open valve.  Magnablend, Inc. maintains a level A chemical retardant suit and SCBA equipment to shut off and clean up any chemical spills or leaks in the event of an emergency.  The valves on the tank are always in a locked out and tagged out condition unless being used by authorized employees.  Although only a few individuals will work with the anhydrous ammonia, all will be trained and tested on proper handling and safety procedures regarding the anhydrous ammonia.  The tank is inspected weekly for leaks or damage and an annual integrity test is performed by an independent inspector.\nStandard procedures for using the anhydrous ammonia, include always filling the mixing tanks with water first.  Once the correct amount of water has been added, then the other chemicals in the product are added, and finally the anhydrous ammonia is added last.  The anhydrous ammonia is transferred from the outside storage tank to the blending tank through a one inch carbon steel schedule 80 piping system.  There is a gate valve at the storage tank and a gate valve at the mixing tank.  The valve at the mixing tank is attached to a sparger line that introduces the anhydrous ammonia at the bottom of the mixing tank eliminating any ammonia gas emissions to the atmosphere.  There is no anhydrous ammonia in the mixing tank at this time, it is all aqueous ammonia.  Magnablend, Inc. has established a company policy that ensures at least one employee trained in proper handling of anhydrous ammonia will be present to supervise the loading of the storage tank.  The employees of Magnablend, Inc. were last train"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3608,
      "SummaryText": "ed on the safe handling and use of anhydrous ammonia on April 9, 1998.  A refresher training date is scheduled in the near future.\nBecause of the potential for accidental discharges to occur, Magnablend, Inc. has accepted the following best available control technologies.  The proper storage vessel and materials of construction have been utilized.  The storage vessel is painted white to protect the storage vessel from possible overheating due to the sun.  External corrosion is also reduced by the paint.  Two spring loaded emergency relief valves are present should an accidental release occur.  Defined procedures have been implemented for loading storage vessel, transfer to blending tanks, and emergency awareness and actions.  Any ruptured storage tank of anhydrous ammonia will be deemed an emergency, the Local Emergency Planning committee and the local fire department will be notified imediately.  All policies involving anhydrous ammonia are reviewed on at least an annual basis.  An alternative scenario for a possible spill of anhydrous ammonia was also considered by Magnablend, Inc.  Because all piping systems are connected to an automatic pressure detection and shut off mechanism, the alternative scenario considered was the puncture of the tank or a faulty valve on the tank, both of which will result in an outside release of anhydrous ammonia to the environment.  In this situation, a hole or puncture area of 5 square inches at a height of 24 inches below the top of the liquid column was considered for the alternative release scenario.  The duration of the release was calculated at 30 minutes and the anhydrous ammonia would be released at a rate of 1200 pounds per minute.  For the alternative scenario of this consequence analysis,  the active mitigation efforts of Magnablend, Inc would be used and the water spray system would be turned on.  The effectiveness of this system is estimated to have a 90% efficiency rating resulting in an estimated distance to toxic endp"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3608,
      "SummaryText": "oint of 0.6 miles.\nBoth of the consequence analysis results for the worst case and alternative release scenarios for hydrofluoric acid were performed by using the EPA's RMP Comp program also.  All of the hydrofluoric acid is stored inside the building and inside secondary containment areas.  Magnablend, Inc. maintains spill kits to handle elementary neutralization of acids and also keeps Calcium Gluconate or Sodium Gluconate on site in case of employee exposure to hydrofluoric acid.  The toxic endpoint constant used in the calculations for hydrofluoric is 0.016 mg/L which used the ERPG-2.  For the worst case scenario, Magnablend, Inc. assumed that one full drum of hydrofluoric acid was accidentally released into the building.  Since one 55-gallon drum weighs 550 pounds, this is the amount of material spilled.  Hydrofluoric acid is stored at the ambient temperature of the building which is 77 degrees Fahrenheit.  Wind speed was 1.5 meters/second and the stability class F was used.  Since the drums are stored inside a containment area of 600 square feet and a height of 1.5 feet in a building of 21,000 square feet, the release rate to the outside air was calculated to be 0.33 pounds per minute and the estimated distance to toxic endpoint was calculated to be 0.2 miles.  Due to the characteristics of hydrofluoric acid and the conditions that the chemical is stored under, Magnablend, Inc. has determined that the offsite impact from a release of hydrofluoric acid is minimal.  The most extreme hazards associated with this chemical are the inhalation of the vapors and contact of the chemical with the skin.  Inhalation is extremely difficult because of the pain associated with this action.   Because all of the free liquids will be kept in containment, contact with the chemical from anyone outside of the facility is extremely unlikely.  The alternative scenario is similar to the worst case scenario except that the quantity of the chemical released is minimized.  Instead of sp"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 3608,
      "SummaryText": "illing an entire drum of the chemical, Magnablend, Inc. has determined that a more likely accident would be puncturing the drum and releasing only the amount of chemical that is above the puncture mark in the drum.  With a release duration of 20 minutes and a release rate of 10 pounds per minute, Magnablend, Inc. has determined that approximately 200 pounds of hydrofluoric acid would be released in the alternative release scenario.  Under similar storage conditions, the estimated distance to toxic endpoint is less than 0.1 miles when the wind speed is 3 meters/second and the stabiilty class is D.  To prevent accidental puncture of drums from forklifts, the drums are stored inside containment walls and forklifts are not able to come in contact with the drums.  All employees are trained in the operation of forklifts and have received safe handling instruction for the hydrofluoric acid.\nBecause of the processes performed at Magnablend, Inc., this facility must comply with OSHA regulations from 29 CFR 1910.38, 29 CFR 1910.120, and state EPCRA rules.  All of these regulations ensure the proper safety precautions and plans are in place at the facility, the proper emergency response plans are in place at the facility, and the proper regulatory agencies and public committees have been notified of the dangerous chemicals that are present at the facility.  Annual TIER II reports are prepared for the facility and forwarded to the Local Emergency Planning Committee.  Hydrofluoric acid and anhydrous ammonia are both included in this document.  The LEPC contact for Ellis County is Mr. Danny Woodruff at (972) 923-5199.  To help comply with all of the regulatory needs, Magnablend, Inc. has hired a full-time environmental consulting company. The management of Magnablend, Inc. ensures that all of the employees are trained in the safe handling practices of all the chemicals on site and that the facility is kept clean and orderly to prevent accidents.  There have not been any accidenta"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 3608,
      "SummaryText": "l releases of any chemical in the past five years or in the history of the company and Magnablend, Inc. is actively pursuing measures to make sure that there are not any accidents in the future.  Magnablend, Inc. has developed a contingency plan that is kept on site in case of an emergency.  This plan has been prepared to use as a guidance document in the event of an emergency.  The plan addresses many issues including those such as large and small chemical spills, electrical power failure, tornados, and fire.  This plan was forwarded to the police department, fire department, hospital, and local emergency planning committee.  The plan identifies the emergency coordinator for the facility and lists different phone numbers of who and which agencies to contact for different situations.  On October 19, 1998 Magnablend, Inc. hired a new Quality Control specialist who is responsible for many of the safety features at the facility.  On November 20, 1998 this employee completed a new manual for quality control that directly influences the management of chemicals and products at Magnablend, Inc.  Upon completion of the manual, a review of the maintenance procedures was coordinated with management on 12/15/98 to ensure safe working conditions in the the tank systems and product quality.  Employees receive training on the emergency procedures, contingency plan, and chemical safety at least annually.  The last training offered to employees on Hazard Communication of chemicals was on July 7, 1998.  Magnablend, Inc. is continuously searching for new ways to reduce the chemical inventory so that chemicals are stored at the facility only on an as needed basis.  Magnablend, Inc. is also rebuilding the containment walls in the facility to include all of the mixing and blending tanks.  Although Magnablend, Inc. maintains the storage of hydrofluoric acid and anhydrous ammonia on site, the employees are trained and knowledgeable about the chemicals and their hazards and the facility is"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 3608,
      "SummaryText": " equipped to handle an accidental release so that if such an event occurs it will not pose a threat to any offsite receptors and will not have any offsite impacts."
    }
  ]
}