{
  "FacilityID": 36274,
  "FacilityName": "Pioneer Americas LLC",
  "FacilityStr1": "8000 West Lake Mead Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Henderson",
  "FacilityState": "NV",
  "FacilityZipCode": "89015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.040556",
  "FacilityLongDecDegs": "-115.007222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "caweb.com",
  "FacilityEmailAddress": "cbyrns@olin.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Olin Corporation",
  "Company2Name": null,
  "CompanyDUNS": 33419032,
  "Company2DUNS": 0,
  "OperatorName": "Gary L. Sulik",
  "OperatorStr1": "POB 86",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89009",
  "OperatorZipCodeExt": "7001",
  "RMPContact": "Cindi Byrns",
  "RMPTitle": "Environmental",
  "FTE": 110,
  "OtherEPAFacilityID": "nvd062081500",
  "EPAFacilityID": "100000121094",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 36.04111,
  "FRS_Long": -115.00889,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52287,
      "AltID": "Chlorine Manufacturing",
      "FacilityID": 36274,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 53477,
          "ProcessID": 52287,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 69147,
          "ProcessID": 52287,
          "ChemicalID": 62,
          "Quantity": 1400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 569147,
          "ProcessID": 52287,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36274,
      "SummaryText": "\nPioneer Chlor Alkali Company Inc. - Henderson, Henderson, NV 89009\n\n\n\nIntroduction \n\n\n\nPioneer Americas LLC in Henderson, Nevada, is a wholly owned subsidiary of Pioneer Companies of Houston Texas. Pioneer Companies is a major producer of Chlor-alkali products in the United States. The Henderson Plant is a medium sized manufacturing facility that presently produces sodium hydroxide (caustic soda), chlorine, muriatic acid (HCL) and sodium hypochlorite (bleach). The raw materials and resources consumed manufacturing in the operation are salt (sodium chloride), water, and electricity. The technology employed to convert these materials into finished products is the Diamond Shamrock's modified diaphragm cell for making caustic soda and chlorine. The second is Union Carbide's graphite equipment train for making muriatic acid, and the third is Swenson's Quadruple Effect Evaporation unit for evaporating the caustic soda to a 50 percent solution.\n\n\n\nFacility History \n\n\n\nPioneer purchased the Henderson Facility in October 1988 from a subsidiary of ICI Americas, Inc. (ICI). ICI acquired the facility in connection with the purchase of Stauffer Chemical Company (Stauffer), which bought the facility from the State of Nevada in 1952, after having leased and operated the facility since 1945. \n\n\n\nDemographic Profile \n\n\n\nThe Pioneer facility is located in the southeastern corner of the Las Vegas Valley within the city of Henderson. A 10-mile radius circle surrounding the facility includes all of Henderson, a portion of southern and eastern Las Vegas, and the western portion of Boulder City. The area encompassed by the circle contains most types of urban land use, as well as large areas of undeveloped and mountainous terrain.\n\n\n\nThe following land use categories and approximate percentages are represented within the 314 square mile circle centered on the Pioneer facility:\n\n\n\n* Undeveloped land in the Lake Mead National Recreation Area (NRA), about 7% of the total, is located along th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36274,
      "SummaryText": "e eastern and northeastern edges of the circle;\n\n\n\n* Undeveloped Bureau of Land Management and Bureau of Reclamation Land, about 35% of the total, comprises most of the southern half of the circle outside of the Las Vegas Valley and also an area along the eastern part of the circle between Las Vegas Valley and Lake Mead NRA;\n\n\n\n* Residential development, about 40% is present over wide areas to the east, west, northwest, and southeast of Pioneer, and includes a small part of Boulder City on the extreme southeast;\n\n\n\n* Undeveloped private land, about 6%, is mainly located in the southern and eastern portions of Las Vegas Valley;\n\n\n\n* Commercial, retail, and tourist development, about 18% are found in numerous areas throughout Las Vegas Valley, along with a small portion of Boulder City;\n\n\n\n* Open space such as parks, golf courses, and greenbelts, about 2%, are located at widely scattered areas within Las Vegas Valley;\n\n\n\n* McCarran International Airport, about 1.5%, is located approximately 7 miles west-northwest of the facility; and \n\n\n\n* University of Nevada at Las Vegas, 0.5%, is located 8 miles northwest of the facility.\n\n\n\nPrevailing winds in the Las Vegas Valley are generally from the southwest during the months of February through September, and from the west during the months of October through January. The prevailing winds average 7-11 miles per hour. In the absence of storms and regional atmospheric circulation patterns, there is a diurnal wind flow. The typical diurnal flow system occurs when cool, dense air in the mountains moves downslope into the valleys during the night, and then reverses to flow upslope during the day as the valley heats up relative to the mountains.\n\n\n\n\n\nRegulated Substances At The Henderson Plant\n\n\n\nChlorine is the only chemical at the Henderson Plant that which falls under the RMP regulations although Pioneer has practiced risk management and prevention for many years throughout all areas of the facility. Chlorine is classified by E"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36274,
      "SummaryText": "PA as a Highly Hazardous Material (HHM) thus subject to RMP.\n\n\n\nHHM\n\nNAME CHEMICAL FORMULA CAS NUMBER USAGE CATEGORY QUANTITY LBS \n\nCHLORINE         CL2                    7782-50-5             PRODUCT                   1,130,000\n\n\n\nThe Chlorine Process has many safeguards (design features, procedures, and policies) in place to improve process safety. Many of these safeguards relate to (1) preventing releases of hazardous material from the process equipment and (2) limiting the quantity of hazardous material that could be released if any accident occurs.\n\n\n\n\n\n\n\nPrevention Program\n\n\n\nPioneer, as a subscriber to the Chemical Manufacturers Association (CMA's) \"Responsible Care\" program and in compliance with OSHA 29 CFR 1910.119, NRS 459.30-459.3874 regulations, has developed a comprehensive accidental release prevention program based on elements of OSHA's Process Safety Management (PSM) Program. Additional, Pioneer strives to improve the safety and environmental stewardship by continuously improving our performance based on the Responsible Care principles and codes.\n\n\n\nEach of the PSM elements is fully implemented and integrated into the standard operating practices of the Plant. A brief description of each element is discussed below, however you can request more detailed information or make inquiries at our web site at http://www.piona.com . \n\n\n\nProcess Safety Information\n\nCritical information on chlorine properties, chlorine production techniques, and chlorine handling is made readily available to facility personnel through Material Safety Data Sheets, current drawings, and comprehensive operations manuals. Additionally, the Chlorine Institute provides information and guidelines in the form of regularly updated technical pamphlets. This information is used as the basis for our operating procedures and chemical process systems.\n\n\n\n\n\nProcess Hazard Analysis\n\nThe facility performs extensive Process Hazard Analyses on an established schedule. A trained team rigorously s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36274,
      "SummaryText": "crutinizes the operating processes and makes recommendations for safety enhancements. The recommendations are then prioritized and implemented accordingly.\n\n\n\nOperating Procedures\n\nClear and concise instructions have been developed by teams of experienced personnel for all facility operations. The operating instructions are kept current by regularly scheduled annual review, and by integrating the Management of Change procedures.\n\n\n\nTraining\n\nWe have a thorough training program in place that is designed to train operations personnel on the technical aspects of the processes as well as leading them step by step through the operating instructions for each job. The program also provides ongoing training and refresher courses to continually enhance the capabilities of all plant employees. All training is documented to ensure completion.\n\n\n\nMechanical Integrity\n\nThe Mechanical Integrity program in place at the plant is specifically designed to keep our equipment in viable condition. Trained maintenance technicians ensure that all pipes, tanks, valves, and other equipment involved in chlorine service are maintained and rigorously inspected on an established schedule. Recommendations from equipment inspections are then prioritized and implemented accordingly.\n\n\n\nManagement of Change\n\nWritten procedures are in place to ensure that all process changes at the plant undergo several levels of review at the planning stage. No changes are made without review by a team that includes operations and maintenance personnel. Once a process change has been made, systems are in place to make sure that communication of the change will be made to any who may be affected.\n\n\n\nPre Start Up Reviews\n\nBefore being placed into service, any new or modified system is thoroughly reviewed by a team composed of a cross section of plant employees. This review is designed to ensure appropriate design, adequate safety systems, and sufficient training. All recommendations from the review are then completed"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 36274,
      "SummaryText": " before start up.\n\n\n\nCompliance Audits\n\nAs a CMA Member Company Henderson subjected to a annual self-evaluations. Also compliance audits are conducted on a three year cycle. Recommendations from the audits are promptly converted into action plans.\n\n\n\nIncident Investigation\n\nSignificant environmental, safety, or health incidents at the facility are fully investigated by appropriate teams to determine root cause and to put in place action plans designed to prevent recurrence. The findings are documented and communicated to facility personnel.\n\n\n\nEmployee Participation\n\nEmployee participation is the cornerstone of our safety philosophy . Plant operators, maintenance technicians, and engineers, as well as supervisors and managers participate fully in Hazard and Operability Studies and incident investigations. All findings and recommendations are made available. A broad range of facility personnel also make up the safety committee and participate in a wide range of safety related activities.\n\n\n\n\n\nHot Work\n\nThe facility's Hot Work procedure requires that detailed permitting activities take place before, during, and after any job that has the potential to provide a source of ignition.\n\n\n\nContractor Safety\n\nThe contractor safety program in place at the plant places stringent qualification requirements on contracting firms. To become qualified to work at the facility, contractors must provide proof of training that matches our tough requirements. Additional facility specific training is then required before any contract work can take place. Contractor safety performance and compliance with facility safety requirement are monitored closely during all contract projects.\n\n\n\nEmergency Response Program\n\n\n\nA comprehensive written Plan for emergency preparedness has been established for the Henderson facility, which provides continuous around the clock onsite coverage. The purpose of the Plan is provide guidance to the Plant's response team to mitigate any potentially hazardous sit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 36274,
      "SummaryText": "uations in a safe and timely manner. The plan also specifies rigorous training and exercise schedules for all responders. All personnel are required to be properly equipped and qualified before they are allowed to perform critical response procedures.\n\n\n\nAs part of the ongoing training program for responders, we regularly perform readiness exercises. These include both tabletop planning sessions as well as full field responses to simulated incidents in the plant. Additionally, we conduct joint exercises with the County and City Emergency Response Agencies and work closely to coordinate emergency response actions with them. Pioneer is also an active member Clark County Local Emergency Planning Committee that provides resources for emergency response to other area facilities.\n\n\n\nThe plant is equipped with a facility-wide alarm system. As soon as the alarm system is triggered, response teams assemble immediately; including those assigned the task of making critical notifications. Current emergency phone numbers are maintained in the control room of the facility and also in the Emergency Action Plan, which is immediately available in several critical areas of the plant, so that timely notifications can be made.\n\n\n\nAnother key safety feature at the plant is the facility-wide chlorine-monitoring network that can detect chlorine at very low concentrations. Operations personnel monitor the real-time readings from the chlorine sensors and will respond immediately to any detection. Additionally, the facility utilizes a computer modeling system that can help to plan potential scenarios and develop appropriate responses.\n\n\n\n\n\nHypothetical Models\n\n\n\nThe Environmental Protection Agency has defined the Worst Case Scenario as the hypothetical rupture and full release of all contents of the facility's largest storage tank, assuming all safeguards have failed, during extremely stable weather conditions. While the probability of this scenario coming to pass at any facility is extremel"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 36274,
      "SummaryText": "y low, it does provide a template for emergency response planning. The computer generated model for our largest chlorine tank results in a planning zone of up to 18 miles.\n\n\n\nThe EPA has specified in the RMP rule that each facility must define a specific Alternate Scenario that could have an off site impact, based on plant operations. This scenario is to be modeled using the actual safeguards that are in place, during typical weather conditions. After a thorough review of our facility, we have selected the hypothetical rupture of a loading line while actively loading a chlorine rail car. It should be noted at this point that this facility has never experienced chlorine loading hose rupture.\n\n\n\nOur loading system includes two sets of automatic valves that are specifically designed for this application, which would close immediately if a loading hose were to rupture. The computer generated model for this hypothetical scenario results in a possible impact of up to 0.6 miles from the loading station.\n\n\n\nFive Year Release History\n\n\n\nWith no incidents to report on its Five-Year Accident History the Henderson facility is proud of it's record. EPA has set a strict criteria for reporting accidents as follows any incidents resulted in offsite impact such as evacuation, sheltering in place, or an injury are required to be reported in five year history. The fact that the Henderson Plant has not had any such incidents is confirmation of our commitment to safety. \n\n\n\nSafety Improvements\n\nOur philosophy is simple, we believe that the key to continuous improvement in safety is put safety and environmental protection into every decision we make. This is especially true in the safety, health and environmental areas where we to continuously look for opportunities to improve our abilities in protecting our people and our community. We actively solicit and implement safety and process improvement suggestions through our safety committee or our employee suggestion program\n\n\n\nA few recent"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 36274,
      "SummaryText": " examples of our ongoing safety improvement efforts include:\n\n* Installation of a SAP computer based maintenance system to ensure the mechanical integrity of critical processes.\n\n* Installation of an air emissions control system that employs Best Available Control Technology (BACT)\n\n* Installation of remotely activated valves on our loading system with near instantaneous shut down the system in the event of an emergency response \n\n\n\nWe aim to further enhance our partnerships with regulatory agencies and local responders, as well as with other industrial facilities in the common goal of protecting our employees, our communities, and our futures. Pioneer has been an active member of the Henderson Community Advisory Panel and the Local Emergency Planning Committee (LEPC) and will continue to be so in the future.\n\n\n\n\n\n\n\nPioneer Americas LLC\n\nHenderson Nevada\n\n\n\n\n\n"
    }
  ]
}