{
  "FacilityID": 36413,
  "FacilityName": "Farmers Coop Association, Stockport, IA",
  "FacilityStr1": "13794 Route W 30",
  "FacilityStr2": null,
  "FacilityCity": "Stockport",
  "FacilityState": "IA",
  "FacilityZipCode": "52651",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19177",
  "LEPC": "Van Buren County LEPC",
  "FacilityLatDecDegs": "40.861194",
  "FacilityLongDecDegs": "-091.831944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Farmers Coop Association",
  "OperatorStr1": "13794 Route W 30",
  "OperatorStr2": null,
  "OperatorCity": "Stockport",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52651",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Deardorff",
  "RMPTitle": "Safety Coordinator",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155208",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-08-28 00:00:00",
  "SafetyInspectionBy": "Iowa State Dept. of Ag.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.86119,
  "FRS_Long": -91.83194,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52486,
      "AltID": "ammonia",
      "FacilityID": 36413,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 53679,
          "ProcessID": 52486,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 69401,
          "ProcessID": 52486,
          "ChemicalID": 56,
          "Quantity": 363000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 569401,
          "ProcessID": 52486,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36413,
      "SummaryText": "Risk Management Plan - Executive Summary\n\nFacility:      Farmers Coop Association, Stockport, IA\nContact:    Terry King\nPhone:       888-796-4388\n\n1.  Facility Policy. \n\n     The owners, management and employees of Farmers Coop Association (Stockport) are\n     committed to providing a safe workplace free of accidental releases of anhydrous ammonia and\n     propane.  Health, safety, and environmental compliance are a fundamental part of every employee's\n     job.  It is facility protocol to adhere to applicable Federal, State, and local laws and to implement\n     appropriate controls to prevent accidental releases of anhydrous ammonia.  If an accidental release \n     were to occur, the facility would respond in accordance with its Emergency Action Plan and is \n     prepared to work with local fire department, the Local Emergency Planning Committee and other \n     authorities to control and mitigate the release and minimize the impact of the release to employees, \n     the environment, and general public.\n\n2.  Facility Information.\n\n     The primary activity at the facility is the storage and handling of fertilizers for direct sale to\n     farmers.  Anhydrous ammonia is received, stored and distributed for direct application.  Anhydrous\n     ammonia is stored in two storage tanks of 18,000 gal and 26,000 gal.  These tanks are located in\n     the Northeast corner of the facility.  Anhydrous Ammonia is also stored in Thirty-1000 gal wagons\n     and six-1450 gal wagons.  These wagons are stored next to the storage tanks.  The maximum\n     quantity of Anhydrous ammonia would be 363,000 pounds.  \n\n3.  Worst-Case Scenario and Alternate Release Scenario.\n\n     a.     The worst-case scenario would be the release of the total contents of a storage\n             tank released as gas over a period of 10 minutes. The maximum quanitity released \n             would be 112,710 pounds, which represents the volume of the largest storage tank \n             at 85 percent capacity as limi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36413,
      "SummaryText": "ted by design standards.  The distance to the end \n             point (point of dispersion to 200 parts per millon, or ppm) is 2.4 miles.\n\n     b.     The alternate release scenerio, based on the five-year accident history (or the most\n             likely potential incident), is as follows:  The alternate release scenario is a release \n             from a break in a  3 - inch transfer hose followed by release of ammonia for 2 \n             minutes before automatic or manual shut-off intervenes and stops the flow of \n             ammonia.  The maximum quantity released would be 26,600 pounds.  The distance \n             to the endpoint (point of dispersion to 200 ppm) is 1.6 miles.\n\n4.  Accidental Release Prevention Program.\n\n     1) Safety Information: The facility was designed and constructed in accordance with applicable\n     Federal and State of Iowa requlations.  All plans and procedures maintained at the facility are\n     periodically reviewed by facility management for safety updates and changes.  Material Safety \n     Data Sheets, equipment specifications and the codes and standards used to build and operate\n     the anhydrous ammonia equipment are maintained at the facility.\n\n     2) Hazard Review: Facility management conducts reviews of the hazards associated with the\n     handling and storage of anhydrous ammonia.  The reviews identify the opportunity\n     for equipment malfunctions or human errors that could cause an accidental release, the safeguards\n     used to control hazards and prevent releases, and the steps used to detect or monitor releases.\n     The results of the reviews are documented and porblems identified are addressed in a timely manner.\n\n     3) Operating Procedures: The facility maintains written procedures for the handling and storage of\n     anhydrous ammonia.  The procedures generally follow the provisions of the Occupational\n     Safety and Health Administration (OSHA) standard, 29 CFR 1910.111, \"Storage and Handling of\n     Anhydrou"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36413,
      "SummaryText": "s Ammonia\".  The ANSI Standard has been adopted by reference by Iowa Administrative\n     Code Part 21-Chapter43-Rule 43.6(200)-Standard for the storage and handling of anhydrous ammonia.\n     The written procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n     4) Training: All employees at the facility that handle anhydrous ammonia participate in a training\n     program.  Training of all employees consists of classroom type instruction (e.g. reading safety\n     information, operating procedures, response measures followed by a written test) and on-the-job\n     supervision.  All employees are trained annually.  The training program is reviewed by facility\n     management on a regular basis and revised as necessary. \n\n     5) Maintenance: The facility maintains written equipment inspection and maintenance procedures.\n     Storage and transfer/process equipment inspections are preformed by qualified personnel on\n     an annual basis and are documented.  Equipment maintenance procedures follow either instructions\n     furnished by the equipment vendors, Federal or State regulations, or Industry Codes.  The written\n     procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n     6) Compliance Audits: As required by the RMP rule, compliance audits will be performed at least\n     every three (3) years.  The audit will be documented and conducted by a person knowledgeable\n     in the safe handling and storage of anhydrous ammonia.  Corrective actions required\n     as a result of each compliance audit will be performed and documented.\n\n     7) Incident Investigation: Facility management will investigate each incident that results, or could have\n     reasonably resulted in a catastrophic release of anhydrous ammonia.  The investigation\n     will be performed to identify the situation leading to the incident as well as corrective actions to\n     prevent the release from reoccuring.  Investigation re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36413,
      "SummaryText": "ports will be maintained for five years.\n\n5.  Five-Year Accident History.\n\n     There have been no accidental releases of anhydrous ammonia in the past five\n     years that;  have caused any deaths, injuries or significant property damage at the facility,\n     nor to our knowledge, have resulted in off-site deaths, injuries, evacuations, sheltering in\n     place, property damage, or environmental damage.\n\n6.  Emergency Response Program.\n\n     The facility has:\n\n     a.     a written action plan, in accordance with OSHA standard 29 CFR 1910.38;\n             In the event of an emergency, it is facility protocol to notifiy the local fire department and\n             other emergency responders and request that they respond to the emergency.  Facility\n             employees will not respond to accidental releases except for those that are small or incidental,\n             can be controlled at the time of the release by employees in the immediate release area\n             (e.g. shutting a valve), and do not appear to pose an immediate safety or health hazard.\n             This protocol has been discussed with the local fire department and other emergency\n             responders and the facility has appropriate mechanisms in place to notify the emergency\n             responders when there is a need for a response.\n\n     b.     provided state and local authorities with the emergency planning and community\n             right-to-know information as required under SARA Title III (EPCRA).  The facility is included\n             in the written community emergency response plan.\n\n7.  Planned Changes to Improve Safety.\n\n     Safety improvement is an on-going process at the facitity.  Periodic evaluations are\n     performed to assess the maintenance of safe conditions.  There are no additional specific\n     safety recommendations regarding storage or use of anhydrous ammonia for\n     implementation at this time."
    }
  ]
}