{
  "FacilityID": 36484,
  "FacilityName": "Koch Nitrogen Company - Pekin Terminal",
  "FacilityStr1": "1141 Wesley Road",
  "FacilityStr2": null,
  "FacilityCity": "Creve Coeur",
  "FacilityState": "IL",
  "FacilityZipCode": "61610",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17179",
  "LEPC": "Tazewell County LEPC",
  "FacilityLatDecDegs": "40.632500",
  "FacilityLongDecDegs": "-089.622778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "UN",
  "FacilityURL": "kochind.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 602084618,
  "ParentCompanyName": "Koch Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": null,
  "OperatorName": "Koch Nitrogen Company",
  "OperatorStr1": "4111 E. 37th Street North",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67220",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": "ILD984848390",
  "EPAFacilityID": "100000044757",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-04-04 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-10-08 00:00:00",
  "DeRegistrationEffectiveDate": "2004-10-06 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 40.62932,
  "FRS_Long": -89.61827,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52608,
      "AltID": "Farm Supplies, Merchant W",
      "FacilityID": 36484,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 69624,
          "ProcessID": 52608,
          "ChemicalID": 56,
          "Quantity": 61000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53803,
          "ProcessID": 52608,
          "NAICSCode": "42491",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30337,
              "Process_NAICS_ID": 53803,
              "SafetyReviewDate": "2004-02-16 00:00:00",
              "PHA_Date": "1999-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-02-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-13 00:00:00",
              "TrainingReviewDate": "1998-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-16 00:00:00",
              "EquipmentInspectionDate": "2003-09-19 00:00:00",
              "EquipmentTested": "Ammonia Heater, ammonia sensor calibrations, carsealed valve,condenser, controls & interlocks, piping & vessel, rotating equipment, under tank heating, valve functionality test",
              "ChangeMgmtDate": "2004-02-10 00:00:00",
              "ChangeMgmtReviewDate": "2001-02-20 00:00:00",
              "PreStartupReviewDate": "2002-10-02 00:00:00",
              "ComplianceAuditDate": "2003-09-25 00:00:00",
              "AuditCompletionDate": "2004-07-31 00:00:00",
              "IncidentInvestigationDate": "2003-07-21 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-07-20 00:00:00",
              "HotWorkPermitReviewDate": "2001-08-20 00:00:00",
              "ContractorSafetyReviewDate": "2003-08-28 00:00:00",
              "ContractorSafetyEvalDate": "2001-12-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44135,
                  "PreventionProgram3ID": 30337,
                  "ProcessChemicalID": 69624
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 36484,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-09-29 00:00:00",
    "ERTrainingDate": "2003-02-27 00:00:00",
    "CoordinatingAgencyName": "Creve Coeur, IL Fire Dept., Pekin F",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36484,
      "SummaryText": "KOCH NITROGEN COMPANY\n\nPekin Terminal \nCreve Coeur, IL\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nKoch Nitrogen Company (KNC) is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors and the public while fully complying with applicable laws and regulations.  KNC¿s management philosophy goals are achieved through the implementation of the Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators. \n\nThe purpose of this Risk Management Plan is to provide information about operations at the terminal, programs to prevent accidental chemical releases, emergency response plans in the event an accidental release should occur, the five-year accident history of the terminal and planned changes to improve safety at the terminal.\n\n\nStationary Source and Regulated Substance\n\nThe Pekin Terminal is one of many facilities owned and operated by KNC that supply anhydrous ammonia to the Midwest farming area where it is used primarily as a fertilizer. At the terminal, anhydrous ammonia is received by barges and railcars and stored until it is loaded on to trucks or railcars for distribution.  \n\nAnhydrous ammonia is the only toxic substance regulated under the Risk Management Program (RMP) that is present at the Pekin Terminal in amounts above threshold quantity.  The terminal is classified as Program Level 3 under the regulation. \n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards striven for by KNC.  These high standards include:\n\n·Operating in compliance with required environmental permits and regulations. \n·Operating and maintaining the assets in such a manner that unintentional releases are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36484,
      "SummaryText": "minimized.\n·Operating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\n·Correcting non-compliance found by regular audits of the facility.\n\n\nPrevention Program\n\nThe Pekin Terminal is operating under the guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program.  Ongoing analysis of the potential hazards of the process, detailed training of employees, and emphasis on safety has helped avoid any serious chemical release accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the prevention features implemented at this facility include: \n\n·Minimizing the possibility that flare combustion of ammonia vapors would be interrupted by having continuous pilots. \n·Minimizing the possibility that combustion of ammonia vapors would be interrupted by having a backup flare in the unlikely event of the main flare going out.\n·Level alarms on bullets to help prevent overfilling.\n·Minimizing the possibility of an interruption in power supply to the process control system and the flare system by having a connection to a secondary power grid.\n·Preventive maintenance and testing of vessels through the Mechanical Integrity program helps to ensure that structural failures do not occur in process equipment.\n·Providing emergency shutdown buttons at the truck loading area that can be activated by KNC personnel in case of an ammonia release.\n·Requiring trucks to have a brake interlock system that helps prevent a truck driver from driving away before the loading arm is properly disconnected.\n·Ammonia sensors in the process areas and on the property to detect ammonia and activate the Supervisory Control and Data Acquisition (SCADA) monitoring system if the threshold for ammonia is exceeded.\n·Monitoring level alarms and pressur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36484,
      "SummaryText": "e in process vessels through SCADA to help prevent a release of ammonia.\n·Providing annual truck loading training to ensure driver safety.\n·Minimizing the possibility of overfilling the bullet with relief valves, reverse check valves, and an overfill protection valve on the inlet pipe to the bullet that closes automatically.\n·The  pressure in the storage tank is monitored on a continuous basis through a pipeline control.\n·Loading of trucks occurs only when KNC personnel are on site and can monitor activities.\n·Security guards are on duty monitoring the terminal, during unmanned hours.\n\n\nFive-Year Accident History \n\nWithin the last five years there have been no chemical release accidents that resulted in onsite injuries, death or property damage or offsite impacts.\n\n\nEmergency Response Program\n\nThe terminal will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Pekin Terminal with the Creve Coeur Volunteer Fire Department, the Creve Coeur Police Department and the Pekin Fire Department HAZMAT team.  Also involved in emergency response for the facility would be the Tazwell County Sheriff and, as appropriate, the Pekin Hospital, the Ameren/CILCO, the U.S. Coast Guard, and the Illinois State Highway Patrol.  The Pekin Terminal Manager is responsible for coordinating the emergency actions.  A specific Emergency Response Plan for the terminal is in place and that plan has been coordinate with local officials.  The Emergency Response Program provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\nCompliance with the RMP Prevention Program, coupled with the Environmental Health and Safety Management Systems, forms the framework for continuous safety improvement.  Some of the key components of the safety program are:\n\n·The Management of Change provisions ensure that the potential safety and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36484,
      "SummaryText": "health impacts of any change made to process chemicals, technology, equipment or procedures are considered.\n·The Process Hazard Analysis (PHA) provisions serve as a tool to ensure timely evaluation of potential hazards, thereby leading to continual improvements in safety standards.\n·The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program. \n\nSpecific actions that will be taken in the future to improve the level of safety at the terminal include:\n\n·Internal and third party compliance audits will ensure that the level of safety protection at the terminal is periodically evaluated for improvements.\n·An ongoing dialogue with the Tazwell County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops. \n\nAll interested citizens or community organizations are encouraged to contact the Tazwell County Emergency Management Director for the latest information on emergency response for the county.  The terminal coordinates its response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}