{
  "FacilityID": 36543,
  "FacilityName": "Genpak, LLC - Middletown, NY",
  "FacilityStr1": "Republic Plaza",
  "FacilityStr2": null,
  "FacilityCity": "Middletown",
  "FacilityState": "NY",
  "FacilityZipCode": "10940",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36071",
  "LEPC": "Orange County LEPC",
  "FacilityLatDecDegs": "41.438889",
  "FacilityLongDecDegs": "-074.431389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Genpak LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Genpak LLC",
  "OperatorStr1": "68 Warren Street",
  "OperatorStr2": null,
  "OperatorCity": "Glens Falls",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12801",
  "OperatorZipCodeExt": null,
  "FTE": 170,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109401",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "DEC 333090064",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 41.43095,
  "FRS_Long": -74.42,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2640",
  "RMPSubmissionReasonCode": "R01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 52681,
      "AltID": "Polystryene production",
      "FacilityID": 36543,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 69728,
          "ProcessID": 52681,
          "ChemicalID": 115,
          "Quantity": 130000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 53877,
          "ProcessID": 52681,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 30385,
              "Process_NAICS_ID": 53877,
              "SafetyReviewDate": "2001-10-21 00:00:00",
              "PHA_Date": "2001-10-12 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2001-10-21 00:00:00",
              "TrainingReviewDate": "2001-10-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-10-21 00:00:00",
              "EquipmentInspectionDate": "2001-10-21 00:00:00",
              "EquipmentTested": "fire supression system, leak detection system, high level alarm, pump room",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-10-21 00:00:00",
              "PreStartupReviewDate": "2001-10-21 00:00:00",
              "ComplianceAuditDate": "2001-10-21 00:00:00",
              "AuditCompletionDate": "2004-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-10-21 00:00:00",
              "HotWorkPermitReviewDate": "2001-10-21 00:00:00",
              "ContractorSafetyReviewDate": "2001-10-21 00:00:00",
              "ContractorSafetyEvalDate": "2001-10-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 44211,
                  "PreventionProgram3ID": 30385,
                  "ProcessChemicalID": 69728
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 36543,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Middlwtown Fire Department",
    "CoordinatingAgencyPhone": "8453434169",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36543,
      "SummaryText": "RMP Executive Summary below:\n \nA.     Description of Stationary Source and Regulated Substances Handled\n\nGenpak LLC (Genpak) produces foamed polystyrene food trays and containers using a single screw and tandem system of extruding expanded polystyrene foam sheets.  The process takes polystyrene pellets through an extrusion process where a nuclient and blowing agent (isopentane) are added.  The sheets are then thermoformed and cut to produce the final product. \n\nIsopentane is delivered to the Genpak - Middletown, New York facility via a 7,000-gallon tanker truck.  The truck is unloaded into an underground storage tank using a transfer pump.  A vapor recovery system prevents the release of isopentane vapors to the atmosphere during the transfer.  Isopentane is pumped from the storage tank to the isopentane pump room where the pressure is increased so it can be injected into one of the 4 extruders.\n\nAs a result of the manufacturing process, isopentane is stored at the facility in quantities that exceed the threshold quantity specified by EPA regulations.  Genpak - Middletown has one covered process that requires compliance with Program 3 of the EPA Risk Management Program (RMP) regulation.\n\nB.     Accidental Release Prevention & Emergency Response Policies of Genpak\n\nGenpak - Middletown is committed to protecting facility personnel, the public and the environment from any workplace and accidental release hazards.  Appropriate responses to releases of regulated chemicals are documented in the Plant Emergency Evacuation Plan.\n\nSafety, environmental protection and risk management programs are fully implemented and coordinated with community emergency responders for emergency planning and response efforts.\n\nC.     Five-year Accident History\n\nUnder the EPA RMP regulations, an accidental release is defined as a release of a regulated substance that \"resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, shelterin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36543,
      "SummaryText": "g in place, property damage, or environmental damage.\"  Within the past five years, the Genpak - Middletown, NY facility has had no accidents that meet these requirements.\n\nD.     Prevention Program Elements\n\nManagement System - Genpak has a management program in place that assigns overall responsibility for the development and implementation of the Risk Management Program (RMProgram) to a qualified individual or position of responsibility.  It clearly delineates accountability and responsibilities for any elements where responsibilities are delegated.\n\nProcess Safety Information - Up-to-date process safety information is maintained for use by employees operating the covered process in accordance with 40 CFR Part 68.65, including the following:\n\n- MSDS for isopentane that contains toxicity information, permissible exposure limits, physical data, reactivity data, thermal and chemical stability data and synergistic effects from mixing process flows.\n- Block flow diagrams for the covered process.\n- Process chemistry and maximum intended inventory data for the covered process.\n- Safe operating limits and evaluation of consequences of deviations from these limits for the covered process.\n- Covered process equipment information consisting of materials of construction; piping and instrumentation diagrams (P&IDs); electrical classification; relief system design and design basis; ventilation system design; design codes and standards employed; and safety systems (interlocks, detection or suppression systems).\n\nProcess Hazard Analysis (PHA) - A PHA has been performed for the Program 3 covered process at Genpak in accordance with 40 CFR Part 68.67.  The PHA was performed using the What-If/Checklist method.  The PHA identified the hazards associated with isopentane and the covered process; causes of potential accidental release scenarios; safeguards used to prevent accidental releases; and methods used to detect, monitor or control accidental releases.  Any issues identified dur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36543,
      "SummaryText": "ing the PHA were documented and resolved in a timely manner.  The PHA will be revalidated and updated once every five years following completion of the initial PHA.\n\nOperating Procedures - Detailed and up-to-date process operating procedures have been developed and are maintained for the isopentane process in accordance with 40 CFR Part 68.69.  Operating procedures provide clear instructions for safely conducting activities involving a covered process in a manner consistent with process safety information and are readily accessible to employees involved in a covered process.  Operating procedures are reviewed annually to ensure that they remain current and accurate.\n\nOperating procedures cover each operating phase of the covered process including initial system startup, normal operation, temporary operations, emergency shutdown and conditions when required, emergency operations, normal shutdown and startup following a turnaround or emergency shutdown.  Operating procedures also incorporate or reference relevant process safety information including the following:\n\n- Process Operating Limits (including consequences of deviations and steps to correct or avoid such deviations).\n- Safety and health considerations (including properties and hazards of covered chemicals, precautions necessary to prevent exposure, control measures to be taken upon physical contact or airborne exposure, quality control for raw materials, and control of regulated substance inventories).\n- Safety systems and their functions.\n\nTraining - New employees working with a covered process receive initial training in accordance with 40 Part CFR 68.71.  The training includes an overview of the process and emphasizes process operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown.  Those employees already involved in operating or maintaining a covered process prior to 21 June 1999 have been certified in writing as having \"the required knowledge, sk"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 36543,
      "SummaryText": "ills, and abilities to safely carry out the duties and responsibilities as specified in the operating procedures.\"\n\nRefresher training is provided at a minimum of once every three years to all employees involved in working with a covered process.  Documentation is maintained for each employee to ensure that he or she received and understood the required training.\n\nMechanical Integrity - A mechanical integrity program has been developed in accordance with 40 CFR Part 68.73 for covered process equipment.  Employees involved in the maintenance of the covered process receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure that the employee can perform the job in a safe manner.\n\nWritten procedures have been developed to ensure that covered process equipment is properly maintained, tested, and inspected at regular, scheduled intervals and that such activities are thoroughly documented.  Maintenance, inspection and testing procedures and frequencies are consistent with applicable manufacturer's recommendations and follow accepted engineering practices.  Any equipment deficiencies identified during maintenance, inspection or testing are corrected in a safe and timely manner.  The mechanical integrity program also includes a quality assurance program.\n\nManagement of Change (MOC) - A written MOC procedure has been implemented to manage changes in process chemicals, technology, equipment and operating procedures for the covered process in accordance with 40 CFR Part 68.75.  The MOC procedure does not apply to \"replacements in kind\" which are defined as replacements that satisfy the original design specifications (e.g., replace a pressure reducing valve with a new identical valve supplied by the original equipment manufacturer).\n\nPrior to introducing a change, the MOC procedure is implemented to ensure the following:\n\n- The technical basis for the change and its impact on health and safety have been fully evaluate"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 36543,
      "SummaryText": "d;\n- Affected operating procedures and applicable process safety information have been updated accordingly; and\n- The schedule for implementing the change has been developed and required authorizations have been obtained.\n\nAll employees involved in operating or maintaining the modified process are informed of the change and trained accordingly prior to startup of the modified process.\n\nPre-Startup Safety Review (PSSR) - PSSRs are performed in accordance with 40 CFR Part 68.77 for new covered processes and for modified covered processes when the modification is significant enough to require a change in the process safety information.  The PSSR confirms the following prior to introducing a regulated substance into a process:\n\n- Equipment and construction satisfy design specifications;\n- Safety, operation, maintenance, and emergency procedures have been developed and are adequate;\n- A PHA has been performed for new covered processes, and all recommendations have been resolved or implemented prior to startup;\n- The MOC procedure has been completed for the process modifications; and \n- Training of all employees involved in operating or maintaining the new or modified process has been performed.\n\nCompliance Safety Audits - RMProgram compliance is confirmed through safety audits that are performed at least once every three years in accordance with 40 CFR Part 68.79.  The audits are completed by at least one person knowledgeable in the process.  A report of the findings is generated following the audit, and all deficiencies and/or recommendations are promptly addressed and the resolution is documented.  The two most recent safety audit reports are maintained at the facility.\n\nIncident Investigation - Specific incident investigation, reporting, and documentation procedures have been implemented and are followed in accordance with 40 CFR Part 68.81 in response to any incident involving a covered process that did or could have reasonably resulted in a catastrophic release of a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 36543,
      "SummaryText": "regulated substance.  Under EPA RMP, a catastrophic release is defined as a major uncontrolled emission, fire, or explosion involving one or more regulated substances that presents imminent and substantial endangerment to public health and the environment.  \n\nThe incident investigation procedure is initiated as soon as possible and no later than 48 hours following any incident.  A team is established to perform the incident investigation and always includes at least one person knowledgeable in the process, a contract employee if the incident involves work by a contractor, and other persons with appropriate qualifications to investigate an accident.\n\nFollowing the investigation, a written report is prepared summarizing the following information at a minimum: date of the incident; date the investigation began; description of the incident and any contributing factors; and any recommendations resulting from the investigation.  When completed, all affected personnel including contract employees review the report.  Incident investigation reports are maintained at the facility for a minimum of five years.\n\nEmployee Participation - A written employee participation plan has been implemented that provides employees with access to PHA and all other information developed under the RMP regulation in accordance with 40 CFR Part 68.83.  The employee participation plan describes employee participation in conducting PHA and in implementing all other RMP elements.\n\nHot Work Permit - An authorization and permit program for hot-work operations has been prepared and implemented for hot-work conducted on or near a covered process in accordance with 40 CFR Part 68.85.  The permit is used to document that fire prevention and protection standards in 29 CFR Part 1910.252(a) have been implemented prior to beginning the hot-work operations.  Also, the permit lists the date(s) authorized for the hot-work and identifies the equipment to be worked on or near.\n\nContractors - A contractor safety p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 36543,
      "SummaryText": "rogram in accordance with 40 CFR Part 68.87 covers all contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process. The safety performance of each contractor is evaluated prior to selection.   Each contractor employee is informed of the known potential fire, explosion hazards related to work on a covered process as well as the relevant provisions of the emergency response program.  Procedures are in place to control the entrance, presence, and exit of contract employees in covered process areas.  Periodically, the performance of the contract owner or operator is evaluated while working in or adjacent to a covered process.\n\nE.     Emergency Response Program\n\nGenpak will only respond to incidental releases of isopentane where the release can be absorbed, neutralized, or otherwise controlled at the time of release by employees in the immediate release area, or by maintenance personnel.  For non-incidental releases Genpak will rely on outside responders.  Therefore, Genpak has coordinated response actions with the local fire department and ensured that appropriate mechanisms are in place to notify emergency responders when there is a need for response.\n\nF.     Planned Changes to Improve Safety\n\nGenpak - Middletown believes that the existing safety program is adequate"
    }
  ]
}