{
  "FacilityID": 3658,
  "FacilityName": "Americana Foods",
  "FacilityStr1": "3333 Dan Morton Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75236",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.705139",
  "FacilityLongDecDegs": "-96.919611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 32508434,
  "ParentCompanyName": "TCBY",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TCBY",
  "OperatorStr1": "1200 TCBY Tower",
  "OperatorStr2": "425 West Capitol Avenue",
  "OperatorCity": "Little Rock",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Courtney Halbrook",
  "RMPTitle": "Quality Systems Engineer",
  "FTE": 200,
  "OtherEPAFacilityID": "TXD05533819",
  "EPAFacilityID": "100000046522",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-04 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-03-27 00:00:00",
  "DeRegistrationEffectiveDate": "2007-03-15 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.70389,
  "FRS_Long": -96.9187,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4246,
      "AltID": "ammonia refrigeration",
      "FacilityID": 3658,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4336,
          "ProcessID": 4246,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4523,
          "ProcessID": 4246,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504523,
          "ProcessID": 4246,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3658,
      "SummaryText": "Risk Management Plan\nExecutive Summary\n\nStationary Source and Regulated Substances Handled\n\nThe stationary source is a frozen dairy dessert manufacturing plant that utilizes anhydrous ammonia as a refrigerant.  \n\nAccidental Release Policy\n\nWith regard to the refrigeration system that utilizes anhydrous ammonia, Americana Foods reviews its maintenance programs and schedules to see if there are areas where \"breakdown\" maintenance is used rather than the more preferable on-going mechanical integrity (preventative maintenance) program.  Maintaining the preventative maintenance program is key to Process Safety Management and the Risk Management Plan.  Equipment used to process, store or handle anhydrous ammonia is to be designed, constructed, installed and maintained to minimize the risk of such chemicals and is frequently inspected by trained personnel.\n\nThe first line of defense for Americana Foods is the quality of its employees and management systems.  Employees are responsible and motivated in safe operations of company equipment and systems.  They are trained to utilize appropriate work practices to operate and maintain the refrigeration system as designed and to contain all forms of anhydrous ammonia.  We also operate with an open line of vertical communication so that operational problems observed by first line operators and maintenance personnel can be openly communicated to the level of management within the company that can allocate necessary company resources and ensure prompt response.  \n\nIt is our goal to provide training to every associate about the hazards of anhydrous ammonia and the safeguards built into the refrigeration system.  This will ensure that  even an employee who does not work near the refrigeration system will be aware of the possible danger and know how to react to any incident that may occur.\n\nSenior management is committed to the implementation of safe operating procedures and maintenance of the refrigeration system.  The Process Safety /"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3658,
      "SummaryText": " Risk Management Team will provide regular progress reports to Senior Management regarding the maintenance of these plans and the operating systems.\n\nWorst Case Release Scenario\n\nThe worst case release scenario involves the release of the entire capacity of the high pressure receiver which is located on the roof of the building.  The high pressure receiver has the capacity to hold 25,250 pounds of ammonia.  The distance to the  toxic endpoint was  calculated using RMP*Comp software.  The distance to toxic endpoint was found to be 1.9 miles with no mitigation measures taken into consideration.  Estimated population within the 1.9 mile radius is 10, 980 persons.  Public receptors are residences, schools and major commercial and industrial areas. There are no environmental receptors within the reaches of the toxic endpoint. \n\nThe worst case scenario is considered highly unlikely for several reasons.  Because the high pressure receiver is located on the roof of the building, access  is restricted to authorized employees only and there is little activity in the area that might lead to an accidental release.  Also, the high pressure receiver is rarely if ever full to capacity and a release involving this vessel would likely be of a much smaller quantity.  \n\nAlternative Release Scenario\n\nThe alternative release scenario involves the release of ammonia from a break in a pipe inside the building.  Using RMP*Comp the release rate was estimated to be 745 pounds per minute.   Mitigation measures were taken into consideration in that the release would likely occur inside the building,  in a refrigerated environment.  This would allow for faster isolation and repair of the leak and faster containment and neutralization of the ammonia before vaporization.  Distance to the toxic endpoint for the alternative scenario was estimated to be 0.2 miles and would impact an estimated population of 30 persons. \n \nAffected population for both the worst case and the alternative release scenari"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3658,
      "SummaryText": "os were estimated using Landview . \n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAll refrigeration systems operate with integral safety features (failsafe regulators, pressure relief valves, high temperature cut-offs, pressure switches, robust construction, check valves, vents, etc.) so that failure to perform any operating procedure should not result in equipment damage or destruction enabling the release anhydrous ammonia.  For general operations, the facility simply shuts off recirculator pumps and supporting compressors throttle back and shut down - a consequence of reduced refrigeration load.  For refrigerated storage, compressor rooms remain on or in standby mode to maintain temperature set points.  \n\nEach compressor is equipped with check valves to prevent backflow due to system pressure when that unit is shut down.  Compressors are operationally sequenced so that in the event a single unit trips-out due to electrical / mechanical failure other units in that engine room pick up the lost load. In the event the system load exceeds the capacity of the available compressors, no mechanical damage occurs as only refrigerator set points are not maintained.  '\n\nThe only exception to the inherently safe design of the system are vents from overpressure safety valves.  Compressor pressure reliefs, pressure switches and temperature cutouts are internal thus an anhydrous ammonia release is not expected.  However, vessel overpressure safety relief valves (primarily holding tanks, recirculators, separators and heat exchangers) must vent to the atmosphere in the event one or more internal pressure reliefs or safety switches fail. This type of release is minimized by the preventive maintenance program and regular system inspections.\n\nFive Year Accident History\nAmericana Foods has had no accidents or reportable releases of anhydrous ammonia within the last five years.\n\nEmergency Response Program\nIt is the responsibility of the individu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3658,
      "SummaryText": "al who witnessed the incident to protect him/herself and immediately notify a supervisor or designated Emergency Coordinator of the emergency condition and activate appropriate warning systems for all facility personnel.  If the witness to the incident is properly trained they can take appropriate action to  control the incident. Employees who are trained to provide this type of response are trained only to respond to small leaks that can be attended to with the use of cartridge respirator.  Any large releases are to be attended to only by Emergency Service Personnel (Fire Department).\n\nThe notified Emergency  Coordinator should then do the following:\n\n-determine the character of the emergency (source, amount discharged, appropriate response\n-assess the present and potential hazards (likelihood of fires, explosions, personnel exposure, etc.)\n-activate appropriate internal facility alarms / communication systems if not already done\n-contact emergency services as needed and appoint plant personnel to direct emergency vehicles to the scene of  the emergency when they arrive at the plant.\n-provide emergency services on scene with any information that improve their safety and effectiveness.\n-activate all appropriate corrective actions to remediate the emergency, and invoke all other company provisions related to environmental controls.\n-evacuate any non-essential people from the vicinity of the release\n-notify private, local, state and national agencies with designated response roles as needed.\n-monitor the facility operations for possible leaks, pressure build-up, gas generation, etc., in the event the facility undergoes an emergency stoppage\n-oversee site remediation as necessary after the release.\n\nIt is the goal of our Emergency Response Plan to react quickly to any emergency in order to determine the safest type of response that will best protect our employees, the community and the environment.  Because our employees will not be trained to provide emergency respons"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3658,
      "SummaryText": "e for large releases of anhydrous ammonia that require SCBA equipment, we will be relying on the available Emergency Services in our area.  In order to aid the Emergency Services with their response we will provide them with as much information as possible about our facility layout and the ammonia system.  \n\n\nPlanned Changes to Improve Safety\n\nAmericana Foods is dedicated to maintaining this Risk Management Plan along with the Process Safety Management Plan currently in place in order to protect our personnel, the surrounding community and the environment.\n\nIt is our goal to continuously improve safety at our facility by stringently monitoring our systems and upgrading them as needed.  We will also continue to provide our associates with thorough training and emergency response preparation. \n\nWe also intend to thoroughly evaluate and audit our existing Risk Management and Process Safety Management programs on a regular basis so that we can diligently manage any changes and communicate these throughout the organization."
    }
  ]
}