{
  "FacilityID": 3681,
  "FacilityName": "Green Meadows Water Treatment Plant",
  "FacilityStr1": "13001 Alico Road",
  "FacilityStr2": null,
  "FacilityCity": "Fort Myers",
  "FacilityState": "FL",
  "FacilityZipCode": "33913",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12071",
  "LEPC": null,
  "FacilityLatDecDegs": "26.5125",
  "FacilityLongDecDegs": "-81.775",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "http://www.co.lee.fl.us/utilities/",
  "FacilityEmailAddress": "greerag@bocc.co.lee.fl.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lee County Utilities",
  "OperatorStr1": "13001 Alico Road",
  "OperatorStr2": null,
  "OperatorCity": "Fort Myers",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33913",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045266",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-09-17 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-22 00:00:00",
  "DeRegistrationEffectiveDate": "2005-07-15 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 26.4934,
  "FRS_Long": -81.74027,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "No longer stores chlorine gas; has been replaced with hypochlorite.",
  "_processes": [
    {
      "ProcessID": 4271,
      "AltID": "Chlorine",
      "FacilityID": 3681,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 4549,
          "ProcessID": 4271,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4363,
          "ProcessID": 4271,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1553,
              "Process_NAICS_ID": 4363,
              "SafetyReviewDate": "1998-11-01 00:00:00",
              "PHA_Date": "1999-05-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1996-12-01 00:00:00",
              "TrainingReviewDate": "1998-11-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-12 00:00:00",
              "EquipmentInspectionDate": "1999-06-09 00:00:00",
              "EquipmentTested": "chlorinators, regulators",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Green Meadows WTP has an OSHA Process Safety Management (PSM) program (codified in 29CFR Part 1910.119) for the chlorine process.  The scope of the PSM program encompasses various facets of accident release prevention, e.g., it engenders employee participation, increases employee awareness about the hazards of handling chlorine, establishes safe standard operating procedures and enhances access to process safety information. In May, 1999, The Green Meadows WTP performed a PSM audit and a hazard and operability (HAZOP) process hazards analysis (PHA) on the chlorine system with the help of outside consultants in order to review existing operating procedures, equipment maintenance schedules, operational safeguards and identify some action items to render the process safer.No urgent action items were identified; the Green Meadows WTP management has already initiated activities to implement recommended minor action items.  Following the PHA, the Green Meadows WTP complemented the written PSM program with some additional information along with updates of O&M (Operations and Maintenance) information with the help of outside consultants and facility employees.  The written PSM program provides the procedural backbone for various safe operability functions (i.e., continual review of safe operating procedures, review of mechanical integrity of equipment, improved maintenance schedules, increased training, better access to process safety information and hazard awareness for both employees and onsite contractors, and effective emergency response planning), creates a paper trail of accountability, and thereby, allows the Green Meadows WTP to maintain, review and evaluate the program on a periodic basis.",
              "_chemicals": [
                {
                  "PrimaryKey": 1721,
                  "PreventionProgram3ID": 1553,
                  "ProcessChemicalID": 4549
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3681,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1998-09-29 00:00:00",
    "CoordinatingAgencyName": "San Carlos Fire Department",
    "CoordinatingAgencyPhone": "9412677525",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3681,
      "SummaryText": "CHLORINE RISK MANAGEMENT PROGRAM (RMP)\nLEE COUNTY\nDEPARTMENT OF PUBLIC UTILITIES\n\nGreen Meadows Water Treatment Plant (WTP)\nEXECUTIVE SUMMARY\n\nIntroduction\nThe Green Meadows Water Treatment Plant (WTP) treats water to potable drinking standards for Lee County.  The plant utilizes chlorine in order to disinfect the groundwater obtained from Lee County.  Since the WTP stores more than the threshold quantity of 2,500 lbs of chlorine onsite, the chlorination process is subject to USEPA Risk Management Program (RMP) regulations which are codified in 40CFR Part 68. Chlorine is an easily liquefiable greenish-yellow gas with a pungent, irritating odor that is listed by the USEPA as a regulated toxic substance for accidental release prevention.  Chlorine is a powerful disinfectant and can be safely utilized under regular plant conditions if handled appropriately with care.\n\nGreen Meadows WTP Chlorine Process\nLiquid chlorine is brought into the plant by trucks in 1-ton (2,000 lbs) pressurized containers from an outside vendor.  The containers are unloaded and stored in a covered open-air area prior to use.  Two banks of chlorine containers (one operating and one standby) are used to feed the vacuum chlorinators that comprise the chlorination system.  There are five containers connected to each bank.  The chlorination system is the all-vacuum type.  The chlorine gas that is contained under pressure in the storage containers is withdrawn by a vacuum regulator that is directly mounted on the container outlet.  The vacuum regulator reduces the chlorine gas pressure to a vacuum so that any damage to the chlorination system equipment or piping will typically result in air being drawn into the chlorination system rather than chlorine escaping to the outside air. Chlorine gas is mixed under vacuum conditions with water by the chlorination equipment.  This chlorine solution is then piped to different application points in the WTP in order to disinfect the ground water as part of the w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3681,
      "SummaryText": "ater treatment process.\n\nGreen Meadows WTP Accidental Release Prevention and Emergency Response Policy\nLee County in concert with the Green Meadows WTP management is committed to manage and operate the plant in accordance with relevant USEPA regulations and general good operating practices to ensure minimization of the risk of an accidental release of chlorine from the water treatment chlorination process.  The Lee County Utilities Department has an OSHA (Occupational Safety and Health Administration) Process Safety Management (PSM) program for the Green Meadows WTP chlorine process.  The RMP/PSM program includes periodic monitoring and continual evaluation of the RMP/PSM program elements being implemented at Green Meadows WTP.  \n\nWorst-case Release Scenario\nThe worst-case release scenario was assumed to be the complete loss of contents of a 1-ton chlorine container during unloading operations.  The USEPA guidance for defining a worst-case release scenario for unmitigated release of gas is to estimate the release rate over a 10-minute period of the largest quantity resulting from a pipe or vessel failure.  Thus, the chlorine emission rate from the worst-case release scenario was given as the loss of 2,000 lbs of chlorine averaged over a 10-minute period, i.e., 200 lbs./min.  The regulation requires analysis of this scenario, although historical data on chlorine accidents in the country indicates that this type of release is unlikely.  The worst-case accidental release was modeled using the RMP*Comp software that was developed and approved for use by the USEPA for determining the distance to the toxic endpoint of 0.0087 mg/liter (or 3 ppm).  This airborne concentration is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual=s ability to take protective action. The toxic endp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3681,
      "SummaryText": "oint distance extends beyond the water treatment facility site boundaries. \n\nIt should also be noted that Green Meadows WTP employees thoroughly inspect every chlorine container for potential leaks and overall structural integrity upon delivery and prior to hookup to the chlorination system.  In addition, the plant has chlorine sensors with emergency alarm at the chlorine process which initiate emergency response by the WTP operational staff and the County Emergency Response (HAZMAT) team should the operators request assistance through the County 911 system. This minimizes the chance that a container would fully discharge its contents in an accidental release that would result in an offsite impact.\n\nAlternative Release Scenario\nThe most likely alternative scenario was identified as a failure of a container valve that would result in chlorine gas being discharged through the valve opening. The alternative release was modeled using the RMP*Comp software that was developed and approved for use by the USEPA for determining chlorine release consequences to determine the distance to the toxic endpoint of 0.0087 mg/liter (or 3 ppm).  The toxic endpoint distance for the alternative release scenario does go beyond the currently developed WTP site, but has a much less area of potential impact than does the worst case scenario. \n\nIt should also be noted that Green Meadows WTP employees thoroughly inspect every container valve, vacuum regulator connection to the chlorine container and vacuum piping flexible connection from the vacuum regulator to the vacuum gas header for potential leaks and overall structural integrity with every container change out before and after hookup.  As indicated earlier, the plant has chlorine sensors and alarm at the chlorine process which initiate emergency actions if required.  This minimizes the chance that a faulty container valve or connection would result in significant accidental release of chlorine and result in an offsite impact.\n\nAccidenta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3681,
      "SummaryText": "l Release Prevention Program\nThe Green Meadows WTP has an OSHA Process Safety Management (PSM) program (codified in 29CFR Part 1910.119) for the chlorine process.  The scope of the PSM program encompasses various facets of accident release prevention, e.g., it engenders employee participation, increases employee awareness about the hazards of handling chlorine, establishes safe standard operating procedures and enhances access to process safety information. In May, 1999, The Green Meadows WTP performed a PSM audit and a hazard and operability (HAZOP) process hazards analysis (PHA) on the chlorine system with the help of outside consultants in order to review existing operating procedures, equipment maintenance schedules, operational safeguards and identify some action items to render the process safer.  No urgent action items were identified; the Green Meadows WTP management has already initiated activities to implement recommended minor action items.  Following the PHA, the Green Meadows WTP complemented the written PSM program with some additional information along with updates of O&M (Operations and Maintenance) information with the help of outside consultants and facility employees.  The written PSM program provides the procedural backbone for various safe operability functions (i.e., continual review of safe operating procedures, review of mechanical integrity of equipment, improved maintenance schedules, increased training, better access to process safety information and hazard awareness for both employees and onsite contractors, and effective emergency response planning), creates a paper trail of accountability, and thereby, allows the Green Meadows WTP to maintain, review and evaluate the program on a periodic basis.\n\nFive-year Accident History\nThe Green Meadows WTP has had no accidental chlorine releases over the past five years.\n\nEmergency Response Program\nLee County has a comprehensive County-wide Emergency Response program that has been in force since Ma"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3681,
      "SummaryText": "rch, 1992.  The County's Hazardous Materials Emergency Plan defines the emergency response organization and responsibilities, notification actions, emergency communications, and protective actions.  Although this program involves many entities, responsibility for emergency response to releases of hazardous materials is given to the County Fire Department.  The Fire Department HAZMAT emergency response team is responsible for mitigating the effects of any chlorine leak at the facility.  The HAZMAT team regularly trains and has performed training for chlorine releases at water facilities.  County ER team members are regularly appraised, receive updated training and conduct practice emergency response drills on a scheduled basis. \n\nThe Green Meadows WTP has also developed evacuation procedures for the plant in the event of an accidental release of chlorine that requires notification of the County ER teams.  Evacuation procedures for both on-site employees and contractors are included in this plan. \n\nChanges to Improve Safety\nLee County and the Green Meadows WTP management and staff are committed to supporting the Process Safety Management (PSM) improvements to reduce likelihood of an accidental release and County emergency response (ER) organization and its prescribed functions in the event of an accidental release. Ultimately, any safe operation is a grassroots movement that must be nurtured within the plant perimeter with the employees themselves.  The safe record of the facility in the use of chlorine and the safety improvements implemented as part of the PSM and RMP shows the commitment to safety that the County and the Green Meadows WTP management and staff have made to both plant employees and the surrounding community."
    }
  ]
}