{
  "FacilityID": 36864,
  "FacilityName": "District Energy Corporation 9th & K Thermal Plant",
  "FacilityStr1": "503 South 9th Street",
  "FacilityStr2": null,
  "FacilityCity": "Lincoln",
  "FacilityState": "NE",
  "FacilityZipCode": "68508",
  "Facility4DigitZipExt": "2806",
  "FacilityCountyFIPS": "31109",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "40.808861",
  "FacilityLongDecDegs": "-096.708944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "PP",
  "FacilityURL": "www.les.com",
  "FacilityEmailAddress": "mlandis@les.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "District Energy Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lincoln Electric System",
  "OperatorStr1": "1040 \"O\" Street",
  "OperatorStr2": null,
  "OperatorCity": "Lincoln",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68501",
  "OperatorZipCodeExt": "0869",
  "RMPContact": "Melissa Landis",
  "RMPTitle": "Environmental Specialist",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147628",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2015-11-11 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.80886,
  "FRS_Long": -96.70894,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "6.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53178,
      "AltID": "Steam and Cooling Supply",
      "FacilityID": 36864,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54392,
          "ProcessID": 53178,
          "NAICSCode": "22133",
          "_desc": {
            "NAICS_CODE": "22133",
            "NAICS_DESCRIPTION": "Steam and Air-Conditioning Supply"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70318,
          "ProcessID": 53178,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570318,
          "ProcessID": 53178,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 36864,
      "SummaryText": "1.Accidental release prevention and emergency response policies.\nThe policy of District Energy Corporation (DEC is to comply with federal Chemical Accident Prevention Provisions (40 CFR Part 68) and the Risk Management Program defined in it. DEC is committed to the prevention of accidental releases.\n\nDEC has a thorough detailed Emergency Response plan designed specifically for an ammonia release for the 9th & K Thermal Plant facility. The City of Lincoln Fire Department is located nearby and responds to 9th & K Thermal Plant within 5 minutes under normal circumstances. DEC has provided training for the Fire Department at the facility including the order in which valves should be closed and on other possible responses. \n\n2.The stationery source and regulated substances handled.\nThe DEC stationery source is a building in downtown Lincoln that provides heating and  cooling for the County0City Building (Lancaster County and City of Lincoln) and for the adjacent Lancaster County Jail. District Energy Corporation was incorporated by the county and city in 1989 as a nonprofit entity. The objectives were to install and operate large commercial heat pumps as the most efficient heating-cooling alternative.\n\nThe Lincoln Electric System (LES) provides technical management for the 9th & K Thermal Plant. LES is a municipally-owned and operated electric utility with sole service responsibility in and around Lincoln, Nebraska. As a publicly owned utility, LES operates and maintains all of the equipment in its system in a manner representing prudent utility practices and in conformance with LES? customer/owner expectations. LES strives for excellence in the operations of all facilities, and for full compliance with all local, state, and federal laws and regulations. \n\n9th & K Thermal Plant has a thermal energy storage system so that the large heat pumps can be turned off during peak electricity usage periods during hot weather. This system utilizes ammonia refrigeration to make ice "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 36864,
      "SummaryText": "that is stored in large tanks next to the building. The 9th & K Thermal Plant is normally unmanned but can be remotely monitored. \n\n3.The worst-case release scenario and the alternative release scenario including administrative controls and mitigation measures to limit the distances for each reported scenario.\nThe worst-case release scenario is the loss of 3,900 lbs of ammonia represents a failure of the refrigeration system High Pressure Receiver Tank. The worst-case scenario reflects the entire contents of the receiver being released in 10 minute period resulting in a release rate of 390 lbs/minute. The toxic endpoint of the worst-case release scenario in 2004 (0.24 miles) differs from the ALOHA model run in 1999. The difference being attributable to the modification in 2004 of the wind speed and atmospheric stability classification to more accurately represent site conditions. \n\nThe alternative release scenario reflects a release from a 2? hole in the ice maker. ALOHA predicted a 7 minute release which resulted in a release of 2,710 lbs of refrigerated anhydrous ammonia being released at a rate of 549 lbs/min. The toxic footprint of the release is predicted to be 0.54 miles. This toxic endpoint, again, differs from the estimate made in 1999 due to the revised wind speed in 2004 calculations to more accurately reflect conditions at the site.\n\n4.The general accidental release program and the specific prevention steps.\nDEC intends to comply fully with Risk Management Program requirements as outlined in Chemical Accident Prevention Provisions.\n\nEach area of the recently completed Risk Management Program includes recommendations. DEC will follow-up on recommendations in a timely manner. \n\n5.Five-year accident history.\n9th & K Thermal Plant has had no releases nor accidents related to ammonia in the last 5 years. \n\n6.The emergency response program.\nDEC has a thoroughly detailed Emergency Response Plan designated specifically for an ammonia release for 9th & K Thermal P"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 36864,
      "SummaryText": "lant. DEC is committed to being a good neighbor in the community and a responsible one. \n\n7.Planned changes to improve safety.\nEach area of the Risk Management Program includes recommendations. There are a few of these recommendations so they will not be listed in this summary. DEC will follow up on the recommendations in a timely manner."
    }
  ]
}