{
  "FacilityID": 3704,
  "FacilityName": "ANNISTON ARMY DEPOT",
  "FacilityStr1": "7 FRANKFORD AVENUE",
  "FacilityStr2": null,
  "FacilityCity": "ANNISTON",
  "FacilityState": "AL",
  "FacilityZipCode": "36201",
  "Facility4DigitZipExt": "4199",
  "FacilityCountyFIPS": "01015",
  "LEPC": "Calhoun Cty. Emer. Mgmt. Agcy.",
  "FacilityLatDecDegs": "33.624",
  "FacilityLongDecDegs": "-85.968",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www-anad.army.mil",
  "FacilityEmailAddress": "gustafsonj@anad.army.mil",
  "FacilityDUNS": null,
  "ParentCompanyName": "U.S. DEPARTMENT OF DEFENSE",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "COLONEL GREGORY F. POTTS, CMDR.",
  "OperatorStr1": "7 FRANKFORD AVENUE",
  "OperatorStr2": null,
  "OperatorCity": "ANNISTON",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36201",
  "OperatorZipCodeExt": "4199",
  "FTE": 3149,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044828",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Pending",
  "SafetyInspectionDate": "1999-04-02 00:00:00",
  "SafetyInspectionBy": "Defense Ammo. Center., Log. Rev. & Tech. Assist.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-07-28 00:00:00",
  "DeRegistrationEffectiveDate": "2015-02-17 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.659439,
  "FRS_Long": -85.969439,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4299,
      "AltID": "IGLOO A",
      "FacilityID": 3704,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 4579,
          "ProcessID": 4299,
          "ChemicalID": 58,
          "Quantity": 44280.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4580,
          "ProcessID": 4299,
          "ChemicalID": 2,
          "Quantity": 15024.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4399,
          "ProcessID": 4299,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 4300,
      "AltID": "IGLOO B",
      "FacilityID": 3704,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 4581,
          "ProcessID": 4300,
          "ChemicalID": 58,
          "Quantity": 39852.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4400,
          "ProcessID": 4300,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3704,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-03-01 00:00:00",
    "ERTrainingDate": "1999-03-10 00:00:00",
    "CoordinatingAgencyName": "Calhoun Cty. Emerg. Mangmt. Agency",
    "CoordinatingAgencyPhone": "2564350543",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3704,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe activities identified in this Risk Management Program (RMP) submission involve storage of Lance Missile Motor Assemblies (MMA's) at two locations on the Anniston Army Depot (ANAD).  The two hazardous chemicals have been present for many years.  About twenty years ago they were frequently used in defueling and refueling operations on a regular basis.  For the last ten years they have only been stored in a remote area and inspected on a monthly basis, without being removed from storage except to transport off the Depot.\n\nANAD's emergency response personnel work hard at preventing releases envisioned by the Clean Air Act, Section 112(r), (that is, non-chemical agent releases) and have established a successful track record in safe operations.  Response plans are exercised regularly and show contingencies will be met with timely and decisive action that will avoid off-Depot consequences.\n\nThis document does not address chemical agent storage or disposal activities at ANAD, which are not subject to the RMP Rule.  Release prevention and emergency action regarding chemical agents are thoroughly addressed by the Chemical Accident/Incident Response and Assistance (CAIRA) plan.\n\n1. The Accidental Release Prevention and Emergency Response Policies at the Stationary Source\n\nThe ANAD accidental release policy involves a unified approach that integrates technologies, procedures and management practices.  All applicable portions of the U.S. Environmental Protection Agency (EPA) Risk Management Program Rule will be followed.  The ANAD emergency response policy addresses events occurring in the entire Depot area, and is integrated with emergency services available in the surrounding communities.  This policy complies with the applicable EPA Emergency Response Program requirements.  The plan to implement this policy, now  The Hazardous Waste Guidance & Emergency Response Plan, was last revised in March 1997.  It is currently under periodic review, and a revisi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3704,
      "SummaryText": "on will be completed not later than 30 September 1999.\n\n2. The Stationary Source and Regulated Substances Handled\n\nANAD has two processes that are subject to the RMP Rule.  MMA's, exclusive of warheads, are stored in two concrete structures, referred to as igloos, within ANAD's ammunition area.  Each MMA contains 375.6 lb. of dimethylhydrazine and 1107 lb. of nitric acid.  Both chemicals have an RMP Rule threshold of 15,000 lb.  Igloo A contains up to 40 MMA's, and is subject to the RMP Rule for both dimethylhydrazine and nitric acid.  Igloo B contains 36 MMA's, and is subject to the rule for nitric acid only.\n\n3. The Worst-Case Release Scenario\n\nThe U.S. EPA's RMP Offsite Consequence Analysis Guidance Document was used to define worst-case impacts from both MMA storage igloos covered by the RMP Rule.  Law requires this analysis, although the preventive measures in place make such a release very unlikely.  It is assumed that the entire chemical contents of a single MMA are released instantaneously, forming a liquid pool that releases chemicals into the air via evaporation.  Worst-case meteorological conditions are also assumed.  The U.S. EPA's toxic endpoint for dimethylhydrazine, 0.012 mg/liter, was calculated to occur at a distance of 1.30 miles.  The toxic end-point for nitric acid, 0.026 mg/liter, was projected at a distance of 0.59 miles.  None of the applicable impact areas associated with these covered processes contain public or environmental receptors, such as schools, residences, hospitals, office buildings, or designated natural areas.  The impact areas fall almost entirely within the boundaries of the Anniston Army Depot and the adjacent Fort McClellan Firing Range, in regions with highly restricted public access.\n\n4. The General Accident Release Prevention Program and Chemical-Specific Prevention Steps\n\nBecause the projected impact areas do not contain public or environmental receptors, both of ANAD's covered processes are categorized as Program Level"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3704,
      "SummaryText": "1, and no prevention program is required.  Nevertheless, the Anniston Army Depot is committed to safe operations, and has several programs in place to minimize the chance of an accidental release, including:\n\nMMA's\n\nMMA Construction and Storage - The MMA shell is constructed as an airtight, triple containment to minimize the opportunity for leakage.  The dimethylhydrazine and nitric acid are contained separately within each MMA, and the MMA's are stored in concrete structures (igloos) with a minimum wall thickness of 12 inches.  Additionally, each igloo contains two small vents that fuse shut in case of fire; the small vent size also restricts the amount of evaporation that could occur should a leak develop during storage.\n\nInspection Program - Each storage igloo is inspected monthly by certified personnel for signs of leakage.  Indicating tubes that change color in the presence of nitric acid and dimethylhydrazine are used to check for signs of leakage at the vents; if none are found, the inspectors proceed inside the igloo and examine the MMAs individually.  Each MMA has its own leak indicator on the outside of the casing.  If a leak is suspected, ANAD personnel are trained and equipped to take immediate action to contain a leak.\n\nCertification of Inspection Procedures - ANAD's igloo inspection procedures, as well as all other ANAD procedures pertaining to ammunition, are reviewed and approved by the U.S. Army's Defense Ammunition Center in McAlester, OK.  The Defense Ammunition Center also provides initial training to new inspectors and certification to all inspectors.\n\nPhysical Security - ANAD is a physically secure facility; all entrants must pass through a security gate and be recognized.  The ammunition area, where the igloos are located, is behind a second level of security.  All entrants must have formal approval to visit these sites.  Persons entering the area must have a special badge, which requires an additional background check, or be escorted by a pe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3704,
      "SummaryText": "Regulation 420-90, Fire and Emergency Services.  Additionally, the ANAD Medical Clinic is available for treatment of non-critical situations, and victims can be transferred to any of three local full-service hospitals via ambulance or airlift in serious cases.  ANAD is a physically secure facility, and any or all of it can be cordoned off in the event of an emergency.  The Calhoun County EMA, using pre-planned zones, under the direction of the Calhoun County Sheriff's office, can evacuate off-Depot lands that might be involved in unsafe chemical releases and resultant vapors.\n\n7.  Planned Changes to Improve Safety\n\nAs shown in Section 3 of this Executive Summary, analysis of worst-case scenarios associated with these processes shows no potential impacts to public or environmental receptors.  Additionally, the MMA's are not in the active inventory of the U.S. Army and are being phased out.  The stockpile at ANAD is expected to decrease over time; a significant inventory reduction was made in February 1999.  As more reductions are made, the likelihood of an accidental release will decrease even further."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3704,
      "SummaryText": "rson with the Restricted Area badge.  Furthermore, privately owned vehicles are not allowed into the area.  Government and contractor vehicles are searched upon entry and exit.  Strike anywhere matches and cigarette lighters are prohibited in the area.  The entire area is surrounded by a chain link fence and patrolled by armed security personnel.\n\n5. The Five-Year Accident History\n\nNo accidental releases associated with these processes have occurred over the past five years.\n\n6. The Emergency Response Program\n\nThe covered processes at ANAD are classified as Program Level 1, because of the perfect five-year safety record, and the absence of potential impacts to public or environmental receptors.  Therefore, they are not subject to the emergency response requirements specified by 40 CFR Part 68.95.  Nevertheless, a comprehensive emergency response plan addresses these, and all other, chemical releases.\n\nThe ANAD Fire Department is the first responder for any incident involving these chemicals, and has an effective program to ensure quick action in the event of any release, including the dimethylhydrazine and nitric acid.  The ANAD Fire Department is under the installation's Risk Management Directorate, and includes a staff of 11 people per shift, with fire stations located in both the eastern and western ends of the depot.  The Fire Department also employs a full-time inspector.  Six firemen are certified paramedics, while the others are certified emergency medical technicians.  All responders have been trained in spill response procedures.  The department has two pumper trucks, a ladder truck, HAZ-MAT truck, two ambulances and three utility trucks.  The ANAD Fire Department coordinates with resources under the Calhoun County Emergency Management Agency (EMA) Community Response Plan.  These resources include the Anniston, Oxford, and Talladega City fire departments and the Oxford Rescue Squad.  All ANAD Fire Department operations are conducted in accordance with Army"
    }
  ]
}