{
  "FacilityID": 37127,
  "FacilityName": "Kanapaha Water Reclamation Facility",
  "FacilityStr1": "3901 Southwest 63rd Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Gainesville",
  "FacilityState": "FL",
  "FacilityZipCode": "32608",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12001",
  "LEPC": "District 3 LEPC",
  "FacilityLatDecDegs": "29.620833",
  "FacilityLongDecDegs": "-082.412500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.gru.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Gainesville Regional Utilities",
  "Company2Name": null,
  "CompanyDUNS": 82635004,
  "Company2DUNS": 0,
  "OperatorName": "Kanapaha Water Reclamation Facility",
  "OperatorStr1": "3901 Southwest 63rd Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Gainesville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32608",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jamie Hope",
  "RMPTitle": "Director Water Reclamation",
  "FTE": 20,
  "OtherEPAFacilityID": "FLD982108235",
  "EPAFacilityID": "100000102961",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Chlorine process",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-04-01 00:00:00",
  "DeRegistrationEffectiveDate": "2009-12-15 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 29.61425,
  "FRS_Long": -82.41214,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 53521,
      "AltID": "Disinfection Process",
      "FacilityID": 37127,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 54751,
          "ProcessID": 53521,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 70738,
          "ProcessID": 53521,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 570738,
          "ProcessID": 53521,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37127,
      "SummaryText": "EXECUTIVE SUMMARY\n\nGainesville Regional Utilities (GRU) owns and operates the Kanapaha Water Reclamation Facility (WRF), located at 3901 Southwest 63rd Boulevard in Gainesville, Florida.  \n\nThe Kanapaha WTF began operation in the mid-1970s.  In 1984, the plant was upgraded to treat 10 million gallons of wastewater by the addition of two clarifiers and two anoxic basins.  Additional upgrades occurred in 1990, including construction of a new sludge thickening facility, a new digester and a new sludge loading station.  Current plans will increase capacity to 14 million gallons per day by the year 2000.\n\nLike the majority of municipal wastewater treatment plants in the United States, gaseous chlorine is used at the Kanapaha plant as a disinfectant to destroy pathogenic organisms in the treated wastewater.  The popularity of chlorine as a wastewater disinfectant is mainly due to its effectiveness and relatively low cost compared to other disinfection technologies.\n\nThe same properties that make chlorine valuable as a disinfectant also make it necessary to observe certain safety precautions in handling chlorine as a safeguard to our workers, our community, and the environment.  Chlorine is notably irritating to the eyes, nose, throat and lungs.  More serious human health effects could result from much higher chlorine exposure, such as intense coughing, chest pains, and in extreme cases, death.\n\nGRU's commitment at the Kanapaha plant is to store, handle and use chlorine in a manner that achieves the needed benefits of disinfection while minimizing both onsite and offsite risks.  This is accomplished by designing a safe process, maintaining the process in optimum working condition, operating safely through documented procedures and extensive training, and providing an emergency response capability to minimize the consequences of a chlorine release, should a process accident ever occur.  Our commitment to employee and community protection is demonstrated in the fact that ove"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37127,
      "SummaryText": "r Kanapaha's 25-year history, there have been no chlorine accidents that resulted in death, serious employee injury or offsite consequences.\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is GRU's policy to adhere to all applicable Federal, State of Florida and local rules and regulations.  This specifically includes compliance with the Occupational Safety and Health Administration (OSHA) and Environmental Protection Agency (EPA) rules for chlorine accidental release prevention and emergency response.\n\nThe primary measures for accidental chlorine release prevention are contained in the document Process Safety Management/Risk Management Program for the Kanapaha Water Reclamation Facility.  This process safety management (PSM) document was prepared in conformance with the OSHA and EPA risk management rules, as well as industry-specific guidelines and best management practices relevant to release prevention.  Kanapaha's Plant Manager has the responsibility for ensuring that this program is implemented in the workplace as written.\n\nGRU's emergency response program is based upon the Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  The Kanapaha emergency response plan relies on a team of onsite trained personnel and, as necessary, offsite mutual-aid groups such as fire and rescue services.  The emergency response plans at Kanapaha are based on the Incident Command system, where onsite responders work in coordination with local hazardous materials response teams to implement the Kanapaha and regional response plans.  Kanapaha's personnel receive annual chlorine emergency response training, which includes the donning of protective equipment and hands-on application of the chlorine cylinder repair kits kept at the plant.  The training program was recently expanded to include liquid chlorine leak response using Class A equipment.\n\nStationary Source and Regulated Substances Handled\n\nChlorine is received by the facility by"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37127,
      "SummaryText": " truck and is stored in one-ton chlorine cylinders fabricated to Department of Transportation (DOT) specifications.  Upon arrival at the site, all chlorine cylinders are thoroughly inspected and if there is any doubt about the integrity of the cylinder, it is promptly refused.  Once accepted, the cylinders are stored inside an enclosed building equipped with a chlorine detector that immediately notifies the operators of a release should a leak occur.  Six cylinders are connected to the disinfection process: three are in-use, and three are as standby.  The standby cylinders will automatically switchover when the in-use cylinders become empty, ensuring continuous disinfection.  The maximum intended chlorine inventory at Kanapaha is 14 cylinders, or 28,000 pounds of chlorine.\n\nThe Worst-Case and Alternative Chlorine Release Scenarios\n\nThe distance to endpoint calculations were performed using EPA's RMP*Comp model.  The RMP*Comp model was developed specifically for compliance with the accidental release prevention requirement for predicting the travel distance of an accidental release.        \n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nGRU's PSM document contains 13 essential release prevention elements.  Some of the key accidental release prevention elements of the PSM program are as follows:  \n\n* Process hazard analysis: This analysis was performed for each step in the chlorine process, to identify potential process failure scenarios and the appropriate prevention or response measures.  The process hazard analysis will be updated every 5 years.\n\n* Operating procedures review: The review was conducted to ensure that operators are given clear, written instructions for safely operating the chlorine process.\n\n* Training programs: Training is given to each employee assigned to the process with continuing operator training thereafter, with an emphasis on safe chlorine handling and emergency response.  GRU has been on the forefront among ut"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37127,
      "SummaryText": "ilities in chlorine safety training.  GRU's Utility Training Officer, for example, helped in the preparation of the training manual entitled Chlorine Handling, Containment and Emergency Response.\n\n* Contractors:   GRU ensures through its contract provisions that contractors supplying or working with chlorine are held to a standard of safety performance that complies with GRU's safety goals and objectives, and also meets relevant agency requirements.  For example, GRU personnel make unannounced visits to the supplier's site to ensure that rules and guidelines concerning chlorine and cylinder integrity are being followed.\n\n* Mechanical integrity: The integrity and reliability of the process is maintained by implementing preventive maintenance and routine inspection and testing procedures.\n\n* Management of Change: The management of change procedures provide a systematic approach to evaluate and control the safety and health aspects of any significant change to the process chemicals, technology, equipment and operating procedures.\n\n* Incident Investigation: GRU investigates within 48 hours any accidents or \"near misses\" that could have resulted in a chlorine release, in order to develop measures to prevent a recurrence.\n\nThe above elements are only part of GRU's aggressive safety program.  In addition to the 13 PSM elements, GRU has established related OSHA safety programs such as hot work and confined space.  These OSHA safety programs apply to both GRU and contractor employees. \n\nFive-year Accident History\n\nThere have been no accidents involving chlorine at the Kanapaha plant in the past five years.  \n\nEmergency Response Program\n\nKanapaha plant operators are provided with annual chlorine safety training that includes hands-on practice of assessing and repairing a chlorine leak with a leaking cylinder simulator.  Plant personnel also review the emergency response flow diagram and emergency plan on an annual basis.  The emergency response plan covers all aspects of emer"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37127,
      "SummaryText": "gency response including escape procedures and routes, procedures for post-evacuation employee accounting, notification procedures, rescue and medical duties, and response procedures for spills or leaks.  If a major chlorine leak were to occur, the emergency plan requires immediate notification of the regional hazardous materials response teams for assistance, including orderly evacuation or sheltering-in-place of the surrounding community.\n\nPlanned Changes to Improve Safety\n\nGRU is committed to continuously improving the safety of its operations for the benefit of its personnel, the citizens of Gainesville and the environment.  GRU is planning to enclose the chlorine storage area and add a scrubber."
    }
  ]
}