{
  "FacilityID": 3727,
  "FacilityName": "Miramar Water Treatment Plant",
  "FacilityStr1": "1021 Miramar Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Claremont",
  "FacilityState": "CA",
  "FacilityZipCode": "91711",
  "Facility4DigitZipExt": "1300",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.129778",
  "FacilityLongDecDegs": "-117.696556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "tvmwd@tvmwd.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Three Valleys Municipal Water Dist.",
  "OperatorStr1": "1021 Miramar Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Claremont",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91711",
  "OperatorZipCodeExt": "1300",
  "RMPContact": "Gerry Stube",
  "RMPTitle": "Operations Superintendent",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044524",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.12862,
  "FRS_Long": -117.69783,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4324,
      "AltID": "Chlorine",
      "FacilityID": 3727,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4424,
          "ProcessID": 4324,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4605,
          "ProcessID": 4324,
          "ChemicalID": 62,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504605,
          "ProcessID": 4324,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 4325,
      "AltID": "Ammonia",
      "FacilityID": 3727,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4425,
          "ProcessID": 4325,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4606,
          "ProcessID": 4325,
          "ChemicalID": 56,
          "Quantity": 4400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504606,
          "ProcessID": 4325,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3727,
      "SummaryText": "Executive Summary\n\nThe Risk Management Program includes an Executive Summary as required by Section 2745.3 of Title 19, California Code of Regulations and the Federal RMP Guidance. The Executive Summary provides a discussion of the various Risk Management Program elements as follows:\n\n1. Accidental Release Prevention and Emergency Response Policies\n2. Stationary Source Activities\n3. Regulated Substances Handled\n4. Worst-Case and Alternative Release Scenarios\n5. Prevention Program\n6. Five-Year Accident History\n7. Emergency Response Program\n8. Planned Changes to Improve Safety\n9. Summary\n\n\n1.     Accidental Release Prevention and Emergency Response Policies\n\nIt is the Three Valleys policy to comply with the all of the regulatory requirements of the California Accidental Release Prevention Program (Cal-ARP). The Miramar facility has developed a RMP and Cal-ARP Manual that documents the Three Valleys policies pertaining to the prevention of accidental releases and emergency response. Included in the RMP/Cal-ARP Manual is the Management System that includes the applicable operating, maintenance and response procedures, and technical studies such as the Process Hazards Analysis and Offsite Consequence Analysis. \n\n\n2.     Stationary Source Activities\n\nThe Plant is located at 1021 Miramar Avenue, Claremont, CA  91711 \n\nChlorine gas is used in the process for disinfection of drinking water.\n\n\n3.     Regulated Substances Handled\n\nThe purpose of chlorination is to disinfect water that is used by the general public (water facilities). Disinfection involves the addition of chlorine gas to the water to destroy bacteria, viruses, and other pathogens that may cause harm to the public health. \n\nThe chlorine gas system at the Miramar Water Treatment facility uses a vacuum regulator installed at the container to reduce the gas to a vacuum. The vacuum is produced by an injector placed in the water flow that draws in the gas. If the vacuum is interrupted, the vacuum regulator will autom"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3727,
      "SummaryText": "atically close, thereby greatly enhancing the inherent safety of the system. \n\nChlorine is delivered by a truck from the vendor and is offloaded from the truck to the chlorine area. The chlorine containers are stored inside the chlorine building. \n\nThe process consists of the following major equipment and facilities:\n\n7 Up to four chlorine containers (2,000 lbs chlorine each)\n7 Vacuum valves\n7 Chlorinators\n7 Injectors\n\nAll chlorine equipment is located within the chlorine building. Plastic tubing delivers the chlorine vapor to the chlorinators. The injector injects the chlorine gas at three locations; two for the water to effluent and one to the pond. \n\nThe chlorine building is equipped with a chlorine detector made by Capital Controls. The chlorine detector alarms in the control room. The plant operator monitors the chlorine system from the control room on a continuous basis. Operator rounds are also made every two hours. \n\nThe operator monitors the following variables:\n\n7 Chlorine flow\n7 Status of chlorinators\n7 Status of chlorine detectors\n7 Chlorine scales\n\n\n4.     Offsite Consequence Analysis Results Summary\n\nIn developing the OCA, the approach followed the overall guidance provided by EPA in the RMP OCA Guidance (EPA Guidance) document (June 1996). The worst-case release scenario and the alternative cases were evaluated using lookup tables in the American Water Works Association RMP Guidance document. The lookup tables are based on modeling runs using ALOHA and the EPA RMP Offsite Consequence Guidance Document.\n\nFor chlorine, the worst-case scenario was defined to be the entire vessel contents over ten minutes with a no passive mitigation. This gave rise to a worst-case release rate of 200 lb/minute and a hazard distance of 3.0 miles (rural). There are approximately 458 people within the worst-case hazard zone circle around the Plant. The alternative release scenario was chosen as a release from a 5/16\" tubing. This would result in an average release rate of 1"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3727,
      "SummaryText": "0.5 lb/minute over 60 minutes and a hazard distance of 2,953 ft (0.56 miles). There are an estimated 16 people within the alternate case hazard zone.\n\nIt is important to emphasize that the worst-case release is extremely unlikely to occur, and it takes no account of the many safety features inherent in the design and operation of the plant that prevent such a release from happening. For the worst-case release of chlorine ever to occur, the following sequence of events would have to take place:\n\n7 A complete rupture of a chlorine container would have to occur.\n\n7 The entire contents of the vessel would have to be released within a time period of ten minutes.\n\n7 No operators would respond at any time to close off valves.\n\n7 The release would have to occur during the night or early morning at a time when the weather conditions would favor maximum downwind dispersion (Stability Class F and wind speed of 1.5 m/s).\n\nIt is extremely unlikely that this combination of events would ever occur in practice. On the other hand, the alternative release scenario is based on more credible assumptions. The alternative scenario was selected from a number of possible scenarios, based on their potential to reach offsite. In reality, it is likely that any release that does occur would be less than that evaluated in the alternative scenario analysis. For example:\n\n7 It is more likely that the release would be a small leak from an orifice - such as a valve packing - rather than a 5/16 inch hole with pressure.\n\n7 The system is vacuum based. Therefore, in order to get a release from a pressurized hole would require either a tank failure/cracking or tank valve failure or a vacuum regulator failure.\n\n7 The release could be terminated quickly if the operators respond quickly. The actual time could be less than the 60 minutes assumed.\n\n\n4.     Prevention Program Summary\n\nImplementation of the Miramar Plant Prevention Program is another important consideration that helps to prevent a release or t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3727,
      "SummaryText": "o minimize the impacts of a release that does occur. Some of the key elements that are incorporated into the Plant RMP/CalARP Prevention Program are summarized below. The prevention program is described in more detail in the Plant RMP/CalARP Manual Prevention Program section\n\nProcess Safety Information. A comprehensive set of process safety information has been compiled for the chlorine system. The PSI includes data on the chemicals, the equipment and the technology of the process.\n\nProcess Hazards Analysis. A PHA study was conducted on the chlorine system to evaluate potential hazards with the systems as designed. Recommendations were made by the PHA team to improve the safety of the systems. All safety recommendations are currently being implemented and records are being kept. \n\nOperating Procedures. An Operations and Maintenance Manual provides detailed written operating procedures for the chlorine system. Additional procedures are written for unloading chlorine.\n\nTraining. Training is provided to each operator and maintenance person before they are certified to operate the system. \n\nMaintenance. All chlorine systems are included in the Plant maintenance program. Equipment inspections, testing and preventive maintenance activities are performed following a structured schedule. \n\nCompliance Audits. A compliance audit procedure was developed for the CalARP program. It will be used every three years to verify compliance with Cal-ARP regulations. \n\nIncident Investigation. Three Valleys routinely investigates any incident or accident that occurs at the Plant. The Plant has an IIPP in place which defines how accidents and incidents are prevented at the Plant. The program addresses roles and responsibilities, safety inspections and audits, and safety training programs.\n\nExternal Events Analysis. External events were considered in the Process Hazards Analysis. Each external event with the potential to initiate a release was investigated in detail. A separate seismic stud"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3727,
      "SummaryText": "y was also conducted and is included in the CalARP Manual.\n\n\n6.     Five-Year Accident History Summary\n\nThe chlorine systems are 10 years old. During the past five years, there have been no accidents related to the chlorine system.\n\n\n7.     Emergency Response Program Summary\n\nThe Plant emergency response program is described in the Emergency Response Plan for hazardous materials. The plan uses a systematic approach for the response based on the following two incident/emergency levels: \n\nIncidental Release - A minor leak which occurs during normal operation and maintenance activities. \nSuch leaks can occur from a faulty gasket setting, a container valve packing gland problem, or a valve that is not seated properly. With this level of incident an operator or maintenance technician would be on hand to attend to the leak. Incidental releases are those that can be stopped quickly with routine O&M actions such as closing a valve or tightening a connection. For this reason, incidental releases are called \"controlled releases.\"\n\nEmergency Release - An uncontrolled leak that occurs within the chlorine system. \nA emergency release is an \"uncontrolled release\" that occurs within the chlorine system. This may occur when no staff is in the building, or perhaps when a leak gets out of control. If an operator is present, the appropriate action would be to leave the area and initiate the emergency response plan notifications. \n\nThis plan includes procedures for evacuations, notifying response agencies and adjacent businesses, emergency equipment list with maintenance schedule, and also for responding to each release level. The plan also includes first aid procedures for exposures to chlorine.\n\n\n8.     Planned Changes to Improve Safety\n\nNearly all PHA recommendations are currently being implemented prior to submission of this RMP. It is Plant policy to review operating, maintenance and emergency response procedures on a routine basis to ensure applicability. This continuous review p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3727,
      "SummaryText": "rocess will generate further recommendations for improved safety during the course of operating the chlorine systems. \n\n\n9.     Summary\n\nThe design of the Plant chlorine facilities and the implementation of the Federal RMP and California Accidental Release Prevention Program provide a high level of assurance that the hazards and risks associated with the use of chlorine at the Plant are being managed in an appropriate manner. The likelihood of a release is minimized through the Plant Risk Management Program."
    }
  ]
}