{
  "FacilityID": 3753,
  "FacilityName": "Lake Mary Water Treatment Plant",
  "FacilityStr1": "Lake Mary Road",
  "FacilityStr2": null,
  "FacilityCity": "Mammoth Lakes",
  "FacilityState": "CA",
  "FacilityZipCode": "93546",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06051",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "37.610278",
  "FacilityLongDecDegs": "119",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "OT",
  "LatLongDescription": "OT",
  "FacilityURL": "www.mcwd.dst.ca.us",
  "FacilityEmailAddress": "jstapp@mcdw.dst.ca.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mammoth Community Water District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dennis Erdman",
  "OperatorStr1": "Box 597",
  "OperatorStr2": null,
  "OperatorCity": "Mammoth Lakes",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93546",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Sisson",
  "RMPTitle": "Assistant Manager",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045809",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.6665,
  "FRS_Long": -118.9342,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4353,
      "AltID": "Chlorine",
      "FacilityID": 3753,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4453,
          "ProcessID": 4353,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4639,
          "ProcessID": 4353,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504639,
          "ProcessID": 4353,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3753,
      "SummaryText": " Mammoth Community Water District Accidental Release Prevention and Emergency Response Policies\n\nThe Mammoth Community Water District provides water service to the Town of Mammoth Lakes, California.  The service area is located at an elevation of approximately 8,000 feet on the eastern side of the Sierra Nevada mountain range.  The town is surrounded by the United States Forest Service lands and is heavily utilized as a recreational area.\n\nThe District has instituted a Risk Management Program to ensure that its facilities utilizing regulated hazardous chemical substances are operated according to the rules established the United States Environmental Protection Agency.\n\nThrough its risk management program, the District has performed a hazard assessment to asssess the potential effects of an accidental release of a hazardous substance.  This assessment includes performing an off-site consequence analysis including analysis of a worst-case scenario and one alternative release scenario.\n\nThe District has established a prevention program to prevent accidental releases of regulated hazardous substances.  This program includes safety precautions and maintenance, monitoring, and employee safety training.\n\nA response program has also been established that requires specific action to be taken in emergency situations.  This includes procedures for notifying public and local agencies responsible for responding to accidental releases, information on emergency health care, and employee response training measures.\n\n                         Description of Facilities and Regulated Substances Handled\n\nThe District utilizes one regulated substance in its water treatment operations.  This substance is chlorine gas, which is utilized for disinfection purposes.\n\nThe water treatment facility where chlorine gas is used is located near Lake Mary west of the town.  Treatment processes at the facility include filtration through multi-media filter vessels and disinfection of the filtered water"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3753,
      "SummaryText": " through injection of chlorine gas.  Water is then distributed to the community for domestic use.  Chlorine is stored at this facility in steel cylinders, each containing 2,000 pounds of gas.  Four cylinders are stored at the facility at any one time.\n\n\n                     Worst Case Release Scenario\n\nA worst-case release scenario at the water treatment facility would involve a forest fire condition where intense heat could cause melting of fusible plugs on the chlorine gas cylinder.   This would result in a release of chlorine gas from the container.  Under these conditions, a cylinder containing 2,000 pounds of chlorine gas could release gas a 200 pounds per minute.  The release of gas would last for ten mjnutes, which could result in toxic gas extending over a distance of 1.3 miles.  This distance would affect surrounding campgrounds, hiking trails, various cabins and lodges and a horseback riding facility.\n\n                               Alternative Release Scenario\n\nThe alternative release scenario represents a condition where a leak occurs at the valve of a new gas cylinder being connected into the disinfection system.  Using the \"offsite consequence analysis model\" the release rate of chlorine gas would be one pound per minute.  this would result in toxic gas extending over a distance of 0.1 miles.  The only affected area would include the horseback riding facility located immediately nearby.  Under this scenario, it is unlikely that the entire contents of a chlorine gas cylinder would be released due to the fact that personnel would be available to respond immediately and stop the leak.\n\n                Additional Release Scenario of Concern To the Community\n\nIn addressing the earthquake disaster potential, the one ton containers are cradled on engineered blocks embedded to the floor along with the use of straps around the cylinders that prevent movement.   The connecting lines from the cylinders to the system are made of flexible material.  This proved a  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3753,
      "SummaryText": "very effective method during the early 1980's series of earthquakes experienced, the largest of which was 6.7 magnitude.  The Plant went through this without incident of a chlorine release.\n\n                     General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe District is currently in compliance with the Occupational Safey and health Administration rule for Process Safety Management and with the Risk management Plant rule.\n\nSpecific prevention steps that the District has taken include a computerized alarm system that immediately notifies emergency personnel of potential chemical release situations.  Minimal amounts of chlorine gas in the atmosphere will trigger on-site alarms and provide notification.  District personnel also receive specific training in the handling of chlorine cylinders and apparatus and in emergency repair.  Only the necessary amount of chlorine required for use in the treatment processes is stored at the water facility to minimize the potential hazards.\n\n                            Five-Year Accident History\n\nThe District has experienced no accidental releases of chlorine gas during the last five years and, in fact, has not experienced any accidental releases since it began using chlorine at this site 1979.\n\n                          Emergency Response Program\n\nThe District has developed and trained an emergency response team that is qualified to respond to and make repairs necessary to stop an accidental release of chlorine gas.  Other District employees have also been trained in the first responder, awareness level and first responder, operations level response to accidental releases of chlorine.  The District has also coordinated with the Mammoth Lakes Fire Department and Mammoth Lakes Police Department in responding to an accidental release of chlorine.\n\n                          Planned Changes to Improve Safety\n\nThe District plans to focus on training in the future to refiine its response capabilite"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3753,
      "SummaryText": "s. Full scale emergency response to actual scenarios will be practiced on a quarterly basis.  Monthly meetings are scheduled for the emergency response team to review the needs and objectives of the team.  Annual re-certification training will be porvided as requried by OSHA.  New training equipment will be purchased during the upcoming year."
    }
  ]
}