{
  "FacilityID": 37534,
  "FacilityName": "Agrium, Reese Operations",
  "FacilityStr1": "2405 W. Vassar Road (M-15)",
  "FacilityStr2": null,
  "FacilityCity": "Reese",
  "FacilityState": "MI",
  "FacilityZipCode": "48757",
  "Facility4DigitZipExt": "0383",
  "FacilityCountyFIPS": "26145",
  "LEPC": "Saginaw County LEPC",
  "FacilityLatDecDegs": "43.441111",
  "FacilityLongDecDegs": "-083.752778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.agriumat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 72768500,
  "ParentCompanyName": "Agrium Advanced Technologies (U.S.) Inc.",
  "Company2Name": null,
  "CompanyDUNS": 249568056,
  "Company2DUNS": 0,
  "OperatorName": "Ron Restum",
  "OperatorStr1": "2405 W. Vassar Road (M-15)",
  "OperatorStr2": null,
  "OperatorCity": "Reese",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48757",
  "OperatorZipCodeExt": "0383",
  "RMPContact": "Ron Restum",
  "RMPTitle": "Manager, Micronutrient Operations",
  "FTE": 25,
  "OtherEPAFacilityID": "MID061895090",
  "EPAFacilityID": "100000112585",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-02-26 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-03-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 43.44171,
  "FRS_Long": -83.75048,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54043,
      "AltID": "Fertilizer Blending",
      "FacilityID": 37534,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55288,
          "ProcessID": 54043,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71485,
          "ProcessID": 54043,
          "ChemicalID": 56,
          "Quantity": 73440.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571485,
          "ProcessID": 54043,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37534,
      "SummaryText": "Executive Summary\nReese Operations\n\n1.    Corporate Prevention and Emergency Response Approach\n\nAgrium Reese Operations is committed to employee and public safety as well as environmental stewardship.  The operation has implemented measures intended to prevent possible releases of regulated substances.  In the unlikely event of a release, Reese operations have an emergency response plan in place to minimize the potential effects of a release.\n\n2.    Description of Stationary Source \n\nThe facility's primary activities encompass Manufacturing and blending of Nitrogen, Phosphate and Potash Fertilizers.  Ammonia (anhydrous) is used for blending with Phosphate Fertilizers.  The maximum inventory of Ammonia (anhydrous) at our facility is 73,440lb.\n\n3. Prevention Program   \n \nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information:\nAgrium, Reese Operations maintains a detailed record of safety information associated with the covered process.\n\nProcess Hazard Analysis:\nThe facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled.  The methodology used to carry out these analyses is the HAZOP methodology.  The studies are undertaken by a team of qualified personnel with expertise in process operations. \n\nOperating Procedures:\nFor the purposes of safely conducting activities within our covered processes, Agrium, Reese Operations maintains written operating procedures.  The information is readily accessible to operators involved in the processes.\n\nTraining:\nAgrium, Reese Operations has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. \n\nMechanical Integrity\nAgrium"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37534,
      "SummaryText": ", Reese Operations carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\nWritten procedures are in place at Agrium, Reese Operations to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are made aware of and offered training to deal with the modification.\n\nPre-startup Reviews:\nPre-start up safety reviews will be conducted as a regular practice as new processes are implemented and as modifications are made within established processes. These reviews are to be conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits:\nAgrium, Reese Operations conducts audits at least every three years to determine whether the provisions set out under the RMP rule are being implemented.  \n\nIncident Investigation\nAgrium, Reese Operations investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation:\nCompany employees are encouraged to express their views concerning accident prevention issues and to recommend improvemen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37534,
      "SummaryText": "ts.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors:\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Agrium, Reese Operations has a policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n4. Accident History\n\nAgrium, Reese Operations has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release that resulted in on-site or off-site injuries during this period.\n\n5.    Emergency Response Plan\n\nAgrium, Reese Operations carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response plan.\n\nSaginaw County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified."
    }
  ]
}