{
  "FacilityID": 37564,
  "FacilityName": "Sea-3, Inc.",
  "FacilityStr1": "103 Old Dover Road",
  "FacilityStr2": null,
  "FacilityCity": "Newington",
  "FacilityState": "NH",
  "FacilityZipCode": "03801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Newington LEPC",
  "FacilityLatDecDegs": "43.104722",
  "FacilityLongDecDegs": "-070.802500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "LF",
  "FacilityURL": "www.transammonia.com",
  "FacilityEmailAddress": "sea3ops@aol.com",
  "FacilityDUNS": 37226180,
  "ParentCompanyName": "Transammonia, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 41909466,
  "Company2DUNS": 0,
  "OperatorName": "Sea-3, Inc.",
  "OperatorStr1": "103 Old Dover Road",
  "OperatorStr2": null,
  "OperatorCity": "Newington",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03801",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": "NHD 986468197",
  "EPAFacilityID": "100000165368",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-06-06 00:00:00",
  "SafetyInspectionBy": "US Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 43.10069,
  "FRS_Long": -70.80526,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54076,
      "AltID": "LPG Storage/ Distribution",
      "FacilityID": 37564,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 71518,
          "ProcessID": 54076,
          "ChemicalID": 98,
          "Quantity": 110000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 71519,
          "ProcessID": 54076,
          "ChemicalID": 105,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55323,
          "ProcessID": 54076,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31090,
              "Process_NAICS_ID": 55323,
              "SafetyReviewDate": "2004-05-20 00:00:00",
              "PHA_Date": "2001-04-20 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-08-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Results of identified hazards wre fire or explosion or personal injury.",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "process alarms",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Remote control fire water monitors; Halon extinguishing",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "CCTV",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-06 00:00:00",
              "TrainingReviewDate": "2004-06-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Massachusetts Firefighting Academy",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-04 00:00:00",
              "EquipmentTested": "Truck skids, valve logic switches, safety equipment",
              "ChangeMgmtDate": "2000-08-04 00:00:00",
              "ChangeMgmtReviewDate": "2004-02-01 00:00:00",
              "PreStartupReviewDate": "2004-06-09 00:00:00",
              "ComplianceAuditDate": "2001-04-20 00:00:00",
              "AuditCompletionDate": "2001-04-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-03-07 00:00:00",
              "HotWorkPermitReviewDate": "2003-10-06 00:00:00",
              "ContractorSafetyReviewDate": "2003-10-06 00:00:00",
              "ContractorSafetyEvalDate": "2003-10-06 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 45273,
                  "PreventionProgram3ID": 31090,
                  "ProcessChemicalID": 71518
                },
                {
                  "PrimaryKey": 45274,
                  "PreventionProgram3ID": 31090,
                  "ProcessChemicalID": 71519
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 37564,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Newington Fire Department",
    "CoordinatingAgencyPhone": "6034369441",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37564,
      "SummaryText": "Risk Management Plan Executive Summary\nSea-3, Inc. Wholesale Propane (LPG) Import and Distribution Terminal\n\n\n1. Accidental Release Prevention and Response Policies\n\nConstructed in 1974-75, the Sea-3 Newington LPG Terminal provides a vital energy service to homeowners, commercial businesses, and industry.  The facility has an excellent safety record, and its employees are key players in achieving that safety record.\n\nSea-3 is committed to safe and reliable operation for the protection of its employees, the community, and the environment.  Sea-3 is proud of its 30 year operating record, during which there has never been an incident that resulted in any off-site impacts to neighboring industries, residents or the community at large. This record has been achieved through consistent attention and total dedication by management and staff to safe operating practices and preventive maintenance.  Sea-3 has constantly made new investments in the latest technology in operating and maintaining the facility.  These practices form the backbone of Sea-3's dedication to keeping the facility and its community safe.\n\n\n2. Description of the source and regulated substances handled.\n\nThe Sea-3 Terminal in Newington, NH imports and stores fully refrigerated liquid propane (also called liquefied petroleum gas or LPG) at -45?F.  The terminal processes this product by heating it to +40?F for shipment to its customers by truck and rail.  Ethyl mercaptan, an odorizing agent, is added to the LPG being distributed from the terminal.  Both propane and ethyl mercaptan are regulated flammable substances.  The terminal has no RMP listed toxic chemicals in threshold quantities.\n\n\n3. Release Prevention Program\n\nThe terminal was designed and built in accordance with provisions of the following three recognized standards for LPG facilities:\n\n*  NFPA 58, Standard for the Storage and Handling of Liquefied Petroleum Gases, (National Fire Protection Association).\n\n*  API 2510, Design and Construction of L"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37564,
      "SummaryText": "iquefied Petroleum Gas (LPG) Installations, (American Petroleum Institute).\n\n*  API 620, Design and Construction of Large, Welded, Low-Pressure Storage Tanks, (American Petroleum Institute).\n\nOperating areas of the plant are monitored by combustible vapor detectors to quickly detect any leaks.  Ultraviolet flame detectors monitor the plant to detect fires.  The plant is attended by at least two operators at all times.  They log field operating data at two-hour intervals and monitor plant equipment using the following monitoring and control systems:\n\n*  The main control panel, located in the central control room, displays pressures, temperatures, valve positions, and flow rates and provides for remote operation and manual or automatic shutdown of valves and equipment.\n\n*  The emergency control panel, also located in the central control room, displays readings of combustible vapor detectors and fire detectors.  It provides fire department notification and manual and automatic activation of water deluge and emergency shutdown systems.\n\n*  A closed circuit television (CCTV) system, with displays located in the central control room, is used for surveillance and security of all portions of the terminal.\n\nWritten policies and procedures for safe operation are contained in the following Sea-3 manuals:\n\n*  \"Sea-3 Standard Operating Procedures Manual,\" covering normal startup, operation, and shutdown of plant systems and equipment.\n\n*  \"Sea-3 Safety Standards and Procedures Manual,\" covering safe handling of the product and other materials used in the plant.  It covers safe work practices and permitting requirements for such activities as hot work, electrical work, confined space and vessel entry, excavation, and other hazardous activities.  Plant security and visitor policies are covered.\n\n*  \"Sea-3 US Coast Guard Operating and Emergency Procedures Manual,\" covering operation of the marine transfer portion of the terminal as required by 33 CFR 127. \n\n*  \"Sea-3 Contingency Pl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37564,
      "SummaryText": "an,\" covering responses by facility employees, the Newington Fire and Police Departments, and the US Coast Guard.  Its purpose is to minimize the effects of an incident at the terminal and to provide protection for persons and property in the area.  It includes plans for sounding an alarm, initial response, determination of need for additional assistance, flammable vapor control, firefighting, evacuation of personnel and nearby residents, mutual aid support and propane industry group response.\n\n*  \"Sea-3 Mooring Policy and Procedure Manual,\" covering the safe mooring of LPG carriers at the berth during cargo transfers. \n\n*  A draft Facility Security Plan, currently awaiting US Department of Homeland Security approval.\n\n*  \"Sea-3 Process Safety Management Manual,\" covering the elements of Process Safety Management, including employee participation, process safety information, process hazard analysis, operating procedures, training, contractor evaluation and training, truck driver (non-employee) evaluation and training, pre-startup safety reviews, equipment mechanical integrity, safe work permit system, management of change, incident investigation, and emergency preparedness.\n\n\n4. Five Year Accident History\n\nIn the five-year reporting period, there have been no propane or mercaptan releases that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n5. Emergency Response Program\n\nEmergency planning and preparedness are covered in the \"Sea-3 Contingency Plan,\" which details responses by facility employees, the Newington Fire and Police Departments, and the US Coast Guard.  These agencies were involved in the development of the plan, which is available to all cognizant officials in the pamphlet \"Sea-3 Emergency Procedures.\"  The sections involving facility employees were developed by Sea-3 management in conjunction with the operating staff and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37564,
      "SummaryText": "outside consultants.  All new employees are given initial training in operating and emergency procedures.  Employees receive refresher training on an ongoing basis.  This training is documented in accordance with the training records requirements of OSHA's Process Safety Management program and EPA's Risk Management Program.\n\nIn addition to the Sea-3 Emergency Procedures noted above, emergency response is also covered in the \"Sea-3 US Coast Guard Operating and Emergency Procedures Manual.\"  The US Coast Guard also maintains its own written operating and emergency plan, \"Liquefied Petroleum Gas (LPG) Contingency Plan,\" issued by the USCG Marine Safety Office in Portland, Maine.\n\n\n6. Planned Changes to Improve Safety\n\nThe facility has been in operation since 1975.  Safety reviews have been undertaken periodically since that time.  Many recommendations arising from these reviews have been implemented through equipment and procedural changes.\n\nThe most recent review was a process hazard analysis (PHA) completed in April 2001.  All issues identified during that review were dealt with by the end of that year.  Sea-3 will update the PHA by April 2006 and will deal promptly with any recommended improvements that result from that review."
    }
  ]
}