{
  "FacilityID": 37608,
  "FacilityName": "OSRAM SYLVANIA Products Inc.",
  "FacilityStr1": "131 Portsmouth Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Exeter",
  "FacilityState": "NH",
  "FacilityZipCode": "03833",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Exeter LEPC",
  "FacilityLatDecDegs": "42.986667",
  "FacilityLongDecDegs": "-070.929444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3941655,
  "ParentCompanyName": "Siemens Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1495928,
  "Company2DUNS": 0,
  "OperatorName": "OSRAM SYLVANIA Products Inc.",
  "OperatorStr1": "131 Portsmouth Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Exeter",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03833",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gerald (Chip) Darby",
  "RMPTitle": "Env., Health & Safety Specialist",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144612",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-24 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-24 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.986,
  "FRS_Long": -70.93,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54128,
      "AltID": "Hydrogen TLH18150",
      "FacilityID": 37608,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55376,
          "ProcessID": 54128,
          "NAICSCode": "327212",
          "_desc": {
            "NAICS_CODE": "327212",
            "NAICS_DESCRIPTION": "Other Pressed and Blown Glass and Glassware Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71587,
          "ProcessID": 54128,
          "ChemicalID": 149,
          "Quantity": 9720.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571587,
          "ProcessID": 54128,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 54129,
      "AltID": "Hydrofluoric Acid",
      "FacilityID": 37608,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55377,
          "ProcessID": 54129,
          "NAICSCode": "327212",
          "_desc": {
            "NAICS_CODE": "327212",
            "NAICS_DESCRIPTION": "Other Pressed and Blown Glass and Glassware Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71588,
          "ProcessID": 54129,
          "ChemicalID": 55,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571588,
          "ProcessID": 54129,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 54130,
      "AltID": "Hydrogen TLH9000",
      "FacilityID": 37608,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55378,
          "ProcessID": 54130,
          "NAICSCode": "327999",
          "_desc": {
            "NAICS_CODE": "327999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Nonmetallic Mineral Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71589,
          "ProcessID": 54130,
          "ChemicalID": 149,
          "Quantity": 5210.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571589,
          "ProcessID": 54130,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37608,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY\n\nIt is the policy of OSRAM SYLVANIA Products Inc. (OSPI) to adhere to all applicable federal, State, and local laws.  The hydrofluoric acid process at OSPI (process) has been designed and operated in compliance with EPA?s Accidental Release Prevention rule and applicable State and local codes and regulations.  OSPI has also voluntarily elected to include hydrogen in its RMP, even though the facility has determined that the RMP rule does not apply to its two separate hydrogen systems. OSPI has qualified engineering operations, and maintenance personnel knowledgeable in the safe operation of these two systems who are in direct responsibility of the process.  \n\nThrough its Emergency Response Plan, and through close communication with the Exeter Fire Department, OSPI has emergency response procedures in place which comply with the risk management planning requirements of 40 CFR 68.\n\nDESCRIPTION OF YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nOSPI?s Exeter, New Hampshire facility, located at 131 Portsmouth Avenue, produces fused quartz tubing, polycrystalline alumina (PCA) products, and heating products, and serves as headquarters for the company?s glass technologies business. The facility maintains approximately 44,000 pounds of 70% hydrofluoric acid in one, 5,000 gallon storage tank for use in the quartz tubing process.   The RMP applicability threshold for hydrofluoric acid (50% concentration or greater) is 10,000 pounds.  The facility is subject to the RMP requirements since the quantity of hydrofluoric acid in OSPI?s hydrofluoric acid system exceeds the RMP applicability threshold.  OSPI also stores hydrogen in two separate storage tank systems, one 18,150-gallon tank (9,720 pounds) for use in quartz tubing manufacturing and one 9,000-gallon tank (5,210 pounds) for use in the PCA processes.  As confirmed by independent consultants, it is OSPI?s belief that neither hydrogen system i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37608,
      "SummaryText": "s covered under the RMP standard as each tank comprises a separate system and each is below the 10,000-pound applicability threshold.  Even though OSPI has concluded that RMP does not apply, OSPI has voluntarily elected to include hydrogen in its Program Level 2 RMP. \n\nThe hydrofluoric acid process is subject to Risk Management Program Level 2 because it is not among the listed Program Level 3 NAICS codes in 40 CFR ?68.10(d)(1), is not subject to OSHA-PSM provisions, and is not eligible for Program 1.\n\nAs described in a June 4, 2003 letter from OSPI to Ray Dinardo of USEPA, Region I, OSPI has documented that its hydrogen storage and distribution equipment do not constitute a covered process under the RMP rule.  Despite this conclusion that RMP does not apply to OSPI's hydrogen systems, OSPI has voluntarily elected to include its hydrogen processes in its Program Level 2 RMP.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nOSPI?s processes are currently designed and maintained in compliance with current industry guidance and standards.  Process verification takes place through design audits by qualified consultants.  The schedule for such verifications are at least once every three years.  \n\nPreventative maintenance (PM) is an active part of OSPI?s daily operations.  PM is performed on a predetermined schedule in accordance with industry standards and manufacturer recommendations.  A hydrogen detection system is in place in the PCA kiln area.  The system is tested every six months.  PM on the hydrogen storage system is performed by Praxair, Inc. in accordance with the OSPI?s Hydrogen supply contracts.\n\nHydrogen Design Codes, Standards, and Guidelines\n\nThe following design codes and industry guidelines apply to the hydrogen system:\n\n-ANSI/ASME B31.3, Process Piping Code\n-ASME Boiler and Pressure Vessel Code, Section VIII, Rules for Construction of Pressure Vessels\n-NFPA 50B Standard for Liquefied Hydrogen Systems and Consumer"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37608,
      "SummaryText": " Sites\n-NFPA 70, National Electrical Code\n-CGA G-5, Hydrogen\n-CGA C-5.4, Standard for Hydrogen Piping at Consumer Locations\n-CGA C-5.5, Hydrogen Vent Systems\n-CGA S-1.3, Pressure Relief Device Standards ? Part 3 ? Stationary Storage Containers for Compressed Gases\n-CGA PS-8, Protection of Cryogenic Storage tanks from Overpressure During Operator-attended Refill.\n\nHydrofluoric Acid Design Codes, Standards, and Guidelines\n\nThe following design codes, standards and guidelines apply to the 70% hydrofluoric acid system:\n\n-ANSI/ASME B31.3, Process Piping Code\n-ASME Boiler and Pressure Vessel Code, Section VIII, Rules for Construction of Pressure Vessels\n-Hydrogen Fluoride Industry Practices Institute (HFIPI), Guideline for the Bulk Storage and Handling of 70% Hydrofluoric Acid\n-HFIPI, Materials of Construction Guideline for Hydrofluoric Acid Solution (Aqueous)\n-HFIPI, Inspection / Evaluation Guideline for Hydrogen Fluoride / Hydrofluoric Acid Storage and Transportation Vessels\n-HFIPI, Tank Truck Unloading Guideline for 70% Hydrofluoric Acid Solution (Aqueous)\n\nFIVE-YEAR ACCIDENT HISTORY\n\nIn the last five years, there have been no deaths, injuries, or significant property damage on site as a result of accidental releases from covered processes, nor have there been deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage off-site as a result of accidental releases from those processes.  \n\nOn May 13, 2003, the facility suffered a release of HF that did not rise to the level of significance requiring mention in this summary.  The facility investigated the causes of the release and made process changes to address the root cause to prevent such releases in the future.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nA process release would be detected by process operators, delivery personnel, or, in the case of the PCA kilns, the hydrogen detection system.  Facility evacuation is initiated by either the facility fire alarm or by the facility paging system.\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37608,
      "SummaryText": "In the event of a process release, the facility Emergency Coordinator (or alternate) is notified to determine what internal and external notifications and requests for emergency assistance are required.  OSPI will request emergency response assistance and notify the appropriate regulatory agencies in the following circumstances:\n\n?Upon investigating the incident, OSPI determines, based upon the criteria outlined in its Emergency Response Plan that the release is severe enough to require response assistance; \n?Reportable quantities of hydrofluoric acid are released; or\n?A potential for fire or explosion exists.\n\nThe Seacoast Technical Assistance Response Team and ENPRO Services, Inc. (the facility?s emergency response contractor) are trained and equipped to respond to releases at OSPI.\n\nPlease note that there are three processes listed under Section 1.17, numbered Process 1, Process 2, and Process 4.  There is no Process 3."
    }
  ]
}