{
  "FacilityID": 37807,
  "FacilityName": "Wyoming Refining Company",
  "FacilityStr1": "740 West Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Newcastle",
  "FacilityState": "WY",
  "FacilityZipCode": "82701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56045",
  "LEPC": "Weston County LEPC",
  "FacilityLatDecDegs": "43.850833",
  "FacilityLongDecDegs": "-104.215278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 72549538,
  "ParentCompanyName": "HERMES CONSOLIDATED, INC.",
  "Company2Name": null,
  "CompanyDUNS": 58129099,
  "Company2DUNS": null,
  "OperatorName": "Wyoming Refing Company",
  "OperatorStr1": "P.O Box 820",
  "OperatorStr2": null,
  "OperatorCity": "Newcastle",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82701",
  "OperatorZipCodeExt": "0820",
  "FTE": 75,
  "OtherEPAFacilityID": "82701WYMNG740WE",
  "EPAFacilityID": "100000127445",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "30-136",
  "SafetyInspectionDate": "2004-04-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 43.85126,
  "FRS_Long": -104.21486,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54351,
      "AltID": "Petroleum Refinery",
      "FacilityID": 37807,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 71838,
          "ProcessID": 54351,
          "ChemicalID": 55,
          "Quantity": 58000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 71839,
          "ProcessID": 54351,
          "ChemicalID": 98,
          "Quantity": 294400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 71840,
          "ProcessID": 54351,
          "ChemicalID": 118,
          "Quantity": 533600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 71841,
          "ProcessID": 54351,
          "ChemicalID": 107,
          "Quantity": 367000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 71842,
          "ProcessID": 54351,
          "ChemicalID": 119,
          "Quantity": 336000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55602,
          "ProcessID": 54351,
          "NAICSCode": "32411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31196,
              "Process_NAICS_ID": 55602,
              "SafetyReviewDate": "2004-06-02 00:00:00",
              "PHA_Date": "2005-06-02 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-17 00:00:00",
              "TrainingReviewDate": "2004-06-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-17 00:00:00",
              "EquipmentInspectionDate": "2004-04-18 00:00:00",
              "EquipmentTested": "FCC Riser",
              "ChangeMgmtDate": "2004-06-17 00:00:00",
              "ChangeMgmtReviewDate": "2003-04-01 00:00:00",
              "PreStartupReviewDate": "2004-04-17 00:00:00",
              "ComplianceAuditDate": "2004-04-26 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2002-06-13 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2001-11-21 00:00:00",
              "HotWorkPermitReviewDate": "2002-01-08 00:00:00",
              "ContractorSafetyReviewDate": "2003-01-06 00:00:00",
              "ContractorSafetyEvalDate": "2003-01-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 45416,
                  "PreventionProgram3ID": 31196,
                  "ProcessChemicalID": 71838
                },
                {
                  "PrimaryKey": 45417,
                  "PreventionProgram3ID": 31196,
                  "ProcessChemicalID": 71839
                },
                {
                  "PrimaryKey": 45418,
                  "PreventionProgram3ID": 31196,
                  "ProcessChemicalID": 71840
                },
                {
                  "PrimaryKey": 45419,
                  "PreventionProgram3ID": 31196,
                  "ProcessChemicalID": 71841
                },
                {
                  "PrimaryKey": 45420,
                  "PreventionProgram3ID": 31196,
                  "ProcessChemicalID": 71842
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 37807,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-04 00:00:00",
    "ERTrainingDate": "2004-04-22 00:00:00",
    "CoordinatingAgencyName": "Newcastle Emergency Planning Comm",
    "CoordinatingAgencyPhone": "3077464444",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NRC, DOT, SPCC"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37807,
      "SummaryText": "Risk Management Plan Executive Summary\n\nAccident Release Prevention and Emergency Response Policy\n\nWyoming Refining Company protects the public, its employees, and the environment from exposure to toxic and hazardous chemicals used in the production of petroleum fuels with programs to minimize the possibility of an accidental release to the environment.  In order to maintain safe operations, the Refinery has had long-term control programs and procedures that are reviewed on a regular basis and updated to be current with facility operations and regulatory requirements.  The Refinery uses both management controls and engineering controls to eliminate or reduce the risk of an accidental release.   Management controls are work procedures, safety policies, rules, supervision, and training implemented with the goal of reducing the possibility of an accidental release.  Engineering controls eliminate or reduce the possibility of an accidental release through the use or substitution of engineered machinery or equipment.  The Refinery has the following management and engineering controls in place to minimize the possibility of an accidental release.\n\nManagement Controls\n\n  \tEmployee Training and Certification for Compliance with Environmental, Safety, and Operations Regulations and Requirements \n  \tEmergency Response, Public Notification, and First Aid Training\n  \tDevelopment of Standard and Emergency Operating Procedures\n  \tContractor Training and Certification\n  \tAnnual Audits of Programs and Procedures to Prevent Releases of Hazardous Materials\n      \tHazards Analyses of Process Equipment and Facilities\n      \tStandard and Emergency Operating Procedures\n      \tOperator Training Programs\n      \tMaintenance Procedures\n\tInvestment in Environmental Control and Safety Equipment and Systems\n      \tProcess Controls to Ensure Proper Equipment Operation\n      \tProcess Safety Systems to Prevent Uncontrolled Emissions of Hazardous Materials\n      \tEmergency Response Equipment to Con"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37807,
      "SummaryText": "trol Fires and Emissions of Hazardous Materials\n      \tEmissions Monitoring Equipment\n      \tRFCC Permit Adds Regular Equipment Leak Detection and Repair to Entire Refinery\n\nEngineering Controls\n\n\tEquipment Design by Qualified Engineers and Contractors\n\tProcess Hazards Analyses to Detect and Correct Equipment Design and Operating Deficiencies\n\tAnalysis of Processes to Determine Safe Operating Limits and Eliminate Unsafe Operating Conditions\n\tProcedures to Ensure Appropriate Materials Used in Equipment and Processes\n\tInspection of Equipment and Processes to Find and Correct Deficiencies\n\tFormal Review of Equipment, Materials, and Process Operation Changes to Verify Safe Design and Operation\n\nIn the event of an accidental release the Refinery has programs and procedures to respond to a release, investigate the cause and take corrective actions.  To improve emergency response the Refinery has developed an Integrated Contingency Plan (ICP) that conforms to the National Response Teams Integrated Contingency Plan Guidance.  The ICP is designed to minimize hazards to human health, property and the environment from fires, explosions, or any unplanned sudden on non-sudden release of hazardous waste or hazardous constituents at the Refinery.   \n\nStationary Sources and RMP Regulated Substances\n\nThis submission treats the Refinery as a single stationary source process for the production of petroleum fuels.  In the past 5 years the only change to the refinery processes was the addition of a Fluid Catalytic Cracking Unit (FCCU).  The addition of the FCCU did not change the RMP chemicals used onsite or the refineries storage amounts for toxic or flammable RMP regulated substances.\n\nToxic Materials at Wyoming Refining Company\n\nThe Refinery uses several potentially toxic chemicals in its facilities.  None of the toxic materials is in a quantity sufficient to be considered by OSHA and EPA as a concern to the public from an accidental release except for hydrofluoric acid (HF) used to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37807,
      "SummaryText": "produce high-octane gasoline.  Hydrofluoric acid is the single toxic substance in excess of RMP reporting thresholds.  Anhydrous hydrogen fluoride is used as a catalytic agent in the HF Alkylation process for the production of gasoline from isobutane and olefins.  \n\nWyoming Refining has never had a significant release of hydrogen fluoride from the Alkylation unit and has had no reportable incidents or accidents involving the Alkylation unit during the last five years. The Alkylation unit is equipped with a water deluge system, which can be activated in the event that a release of hydrogen fluoride is detected.  This emergency system mitigates the toxic effects of hydrogen fluoride gas by dissolving and diluting the hydrogen fluoride in sufficient water to prevent dispersion of the gas to the atmosphere. This system is tested monthly in summer months to assure its reliable operation.\n\n\nFlammable Materials at Wyoming Refining Company\n\nThe Refinery processes flammable materials as a matter of course.  However, most equipment does not contain flammable material sufficient to pose a hazard to the public. The Refinery has four flammable materials in excess of RMP reporting thresholds: propane (C3H6), normal butane (C4H10), isobutane (iC4H10), butylenes (C4H8).  All four flammable materials are liquids in pressure storage, but will evaporate into the atmosphere in the event of a leak presenting possible fire and explosion hazards.  None of these compounds are toxic, but all can cause asphyxiation from oxygen displacement. \n\nPrevention Program\n\nThis Risk Management Plan 2004 re-submission for Wyoming Refining, Inc., Newcastle, Wyoming complies with the EPA Risk Management Program (RMP) 40 CFR 68 as well as the OSHA Process Safety Management Program (PSM) 29 CFR 1910.119.  This submission treats the Refinery as a single process.  The Risk Management and Process Safety Management Programs for the Refinery are applied uniformly to each operating unit as refinery-wide accidenta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37807,
      "SummaryText": "l release prevention programs.  \n\nThe Refinery is in compliance with both the RMP and PSM prevention programs and conducts reviews and updates of each program in order to certify and assure continuing compliance.  Both programs require the Refinery to implement practices and procedures for accidental release prevention. These procedures include operator training and certification, standard operating and emergency operating procedures, emergency notifications, equipment maintenance and inspection procedures, process hazards analysis and hazards mitigation in equipment design and operation, management of changes to equipment, operating and maintenance procedures, emergency procedures, and emergency notification for additional public risk reduction. The Refinery must also adhere to recognized safe equipment design, materials design, and engineering standards. All of these elements of the Refinery risk management and release prevention programs are designed to limit the possibility of accidental releases of toxic or flammable materials and minimize effects of Refinery operations on the general public and its employees from injuries, fatalities, and property damages.\n\nRMP 5-year Accident History\n\nIn the past 5 years WRC has had no RMP accidental releases of RMP chemicals stored on-site above the threshold quantity from a covered process unit as defined by 40 CFR part 68.42(a).  On March 24, 2002 WRC did have a release of 40,000 pounds of solid FCCU catalyst from a petroleum refining process unit as the result of a valve failure.  WRC conducted an accident investigation and has implemented both management and engineering controls to mitigate the causes of the FCCU catalyst release.  While RMP procedures were applied as a result of this release, the FCCU catalyst is not an RMP regulated substance under 40 CRF part 68.130.   EPA guidance defines a RMP reportable accidental release to be, ¿The release must be from a covered process and involve a regulated substance held abov"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37807,
      "SummaryText": "e its threshold quantity in the process.¿  As the FCCU catalyst is not an RMP regulated chemical, it should not be reported as an RMP accidental release.\n\nEmergency Response Program\n\nThe refinery has developed an integrated contingency plan that addresses all of the RMP pubic emergency response plan requirements for a release of toxic or flammable materials.  This plan was developed with the local emergency planning committee and includes Weston County/Newcastle and Upton Hazardous Material Plan.  Both the Refinery and the LEPC develop plans for a public response to such an emergency.  Emergency responses include public emergency notification, public evacuation or sequestration, as appropriate, and training of local police, fire, medical, and other emergency officials in handling, with trained Refinery personnel, a significant public emergency.  The Refinery also trains and equips its personnel to handle leaks and fires that can affect employees and the public. Refinery personnel are considered the most important element in controlling and mitigating the effects of a process release. The Refinery has also conducting public awareness meetings to bring the potential for an emergency to their attention.\n\nPlanned Changes to Improve Safety\n\nThe Refinery has not had a RMP accidental release during the last 5 years.  Further, in the past 5 years there have been no changes to the facility processes that effect the RMP regulated chemical storage or new RMP chemicals held onsite above the threshold value onsite.  The refinery will continue with its current programs and procedures to minimize the possibility of and accidental release to the environment."
    }
  ]
}