{
  "FacilityID": 37847,
  "FacilityName": "Tree Top, Inc.",
  "FacilityStr1": "2780 Lee Road",
  "FacilityStr2": null,
  "FacilityCity": "Prosser",
  "FacilityState": "WA",
  "FacilityZipCode": "99350",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.218806",
  "FacilityLongDecDegs": "-119.734111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.treetop.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tree Top, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9268319,
  "Company2DUNS": 0,
  "OperatorName": "Tree Top, Inc.",
  "OperatorStr1": "2780 Lee Road",
  "OperatorStr2": null,
  "OperatorCity": "Prosser",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99350",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ron Malecha",
  "RMPTitle": "Plant Manager",
  "FTE": 163,
  "OtherEPAFacilityID": "WAD041969585",
  "EPAFacilityID": "100000097959",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Ammonia Refrigeration System",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 46.21881,
  "FRS_Long": -119.73411,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54404,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 37847,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 55658,
          "ProcessID": 54404,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 71908,
          "ProcessID": 54404,
          "ChemicalID": 56,
          "Quantity": 12500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 571908,
          "ProcessID": 54404,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37847,
      "SummaryText": "Executive Summary\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nThe Tree Top, Inc. ammonia refrigeration system uses pure Ammonia (anhydrous) as the refrigerant.  Given the quantity handled, Ammonia (anhydrous) is considered a hazardous substance by the EPA.  Many of the properties that make ammonia valuable as a refrigerant, also require that policies and procedures be implemented to protect employee and public health and safety in the event of a chemical emergency.  It is the policy of Tree Top, Inc. to be in compliance with all applicable Federal, State and local rules and regulations.\n\nSafety at our facility is dependent on the safe handling of Ammonia (anhydrous).  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with the appropriate training of our personnel and contractors are key requirements to maintain safety at our facility.\n\nWe have a written Process Safety Management (PSM) plan that comlies with the regulations stipulated by WAC 296-67-017.  A critical component of this plan is the Emergency Response Plan that was developed for compliance with the emergency response provisions of WAC 296-62-3112.  The Emergency Response Plan includes pre-emergency planning and coordination activities with outside response agencies.  This enables those who manage emergencies to have a course of action to effectively deal with unplanned events.\n\n2.  Facility Description And Substances Handled:\n\nTree Top, Inc. is a juice and fruit product manufacturing and storage facility.  Manufacturing and storage requires the use of a refrigeration system to preserve the processed products prior to their distribution to the customers.  The refrigeration process used Ammonia (anhydrous) as a refrigerant.  Access to the facility is restricted to authorized and trained employees, visitors, vendors and contractors.  \n\nThe regulated substance handled at this facility is Ammonia (anhydrous).\n\nThe ammonia ref"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37847,
      "SummaryText": "rigeration system maximum inventory is 12,500 pounds of Ammonia (anhydrous).  There is no standby or backup inventory of Ammonia (anhydrous) kept on site.\n\n3.  General Accidental Release Prevention Program And Chemical-Specific Prevention Steps:\n\nTree Top, Inc. complies with EPA's Accidental Release Prevention regulation and with all applicable State and local regulations.  The design and construction of this facility was in accordance with published standards, tests, industry standards and all applicable regulations at the time of construction.\n\nTree Top, Inc.'s written Process Safety Management Plan incorporates many policies, procedures and plans to ensure the safe operation and maintenance of this facility.  Plan elements essential to the safe operation of the refrigeration system include employee participation, process hazard information, process hazard an alysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits.  This plan will be reviewed at least annually and updated as required to comply with Federal, State and local regulations.\n\nTraining is provided to ensure that each employee or contractor involved in operating the Ammonia (anhydrous) refrigeration system has been trained in an overview of the process, operating and maintenance procedures, and safety considerations.  This training uses guidelines developed by the International Institute of Ammonia Refrigeration (IIAR) and the Refrigerating Engineers and Technician's Association (RETA).  Only qualified maintenance and contractor personnel operate and/or maintain the Ammonia (anhydrous) refrigeration system.  This minimizes the chances of inadvertent error in the operation or maintenance that could lead to a release of Ammonia (anhydrous).  \n\n4.  5-Year Accident History:\n\nThere have been no reportable accidents or incidents involving the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37847,
      "SummaryText": "Ammonia (anhydrous) rfefrigeration system during the past 5 years.\n\n5.  Emergency Response Program:\n\nTree Top, Inc. has a written Emergency Response Plan that was developed to ensure that precautions and procedures are in place to protect employee and public health and safety in the event of an accidental release of Ammonia (anhydrous).  This plan complies with the provisions of the WISHA Emergency Response Regulation WAC 296-62-3112.  The Emergency Response Plan includes pre-emergency planning and coordination with outside response agencies.  This enables those who would respond to emergencies at this facility to plan and train together prior to an emergency response.  This plan has been reviewed with the Prosser Fire Department.\n\nPre-planning has identified potential accidental release scenarios for the Ammonia (anhydrous) for this facility.  These scenarios are used by the Prosser Fire Department, and the facility Hazmat Team, to prepare for the unlikely event of a release of Ammonia (anhydrous).  The refrigeration system has backup prevention systems to keep process upset conditions from becoming Ammonia (anhydrous) emergencies.  If an emergency should occur, the following response personnel, equipment, facilities and systems are in place:\n\nUnified Incident Command \nEmergency Notification, Evacuation and Accountability\nSite Hazardous Materials Team\nPersonal Protective Equipment and Training\nCoodination With The Prosser Fire Department \n\nThe procedures for obtaining external emergency assistance have been formally established with the Prosser Fire Department.  The Emergency Response Plan also includes procedures for the notification of any potentially affected businesses and neighbors to this facility.\n\nAll Tree Top, Inc. personnel will be trained to fulfill their designated responsibilities in the event of a facility emergency.  Mock emergency drills will be held periodically to maintain familiarity with response procedures and identify any continuous improvemen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37847,
      "SummaryText": "t requirements.\n\n6.  Planned Changes To Improve Safety:\n\nThis facility expanded the Ammonia (anhydrous) refrigeration system in 1985.  All system components met the design specifications in ANSI/IIAR, equipment, design, and installation of Ammonia (anhydrous) mechanical refrigeration systems.  All pressure vessels were built to comply with the American Society of Mechanical Engineers (ASME), ASME Boliler and Pressure Vessel, and Pressure Vessel Codes.  Any future modifications to the design, installation, maintenance or operation of the Ammonia (anhydrous) refrigeration system will be made compliant with the applicable Federal, State and local regulations.\n\nAll Tree Top, Inc. personnel are trained to fulfill their designated roles and responsibilities in an emergency.  Mock Emergency drills will be held periodically to maintain familiarity with potential emergency scenarios involving the Ammonia (anhydrous) refrigeration system."
    }
  ]
}