{
  "FacilityID": 37851,
  "FacilityName": "NeoResins Inc. - FRANKFORT PLANT",
  "FacilityStr1": "3110 WEST STATE ROAD 28",
  "FacilityStr2": null,
  "FacilityCity": "FRANKFORT",
  "FacilityState": "IN",
  "FacilityZipCode": "46041",
  "Facility4DigitZipExt": "8776",
  "FacilityCountyFIPS": "18023",
  "LEPC": "Clinton County LEPC",
  "FacilityLatDecDegs": "40.279722",
  "FacilityLongDecDegs": "-086.562778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.neoresins.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Avecia INC.",
  "Company2Name": "NA",
  "CompanyDUNS": 74726402,
  "Company2DUNS": 0,
  "OperatorName": "NeoResins INC.",
  "OperatorStr1": "3110 WEST STATE ROAD 28",
  "OperatorStr2": null,
  "OperatorCity": "FRANKFORT",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46041",
  "OperatorZipCodeExt": "8776",
  "FTE": 25,
  "OtherEPAFacilityID": "46041CRSNSSTRT2",
  "EPAFacilityID": "100000083624",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.27898,
  "FRS_Long": -86.56669,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1500",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54409,
      "AltID": "ACN STORAGE AND USE",
      "FacilityID": 37851,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 71913,
          "ProcessID": 54409,
          "ChemicalID": 25,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55663,
          "ProcessID": 54409,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31232,
              "Process_NAICS_ID": 55663,
              "SafetyReviewDate": "2002-03-15 00:00:00",
              "PHA_Date": "2002-03-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "FOAM OVER TANK W/ CATOX CONNECTION, VAPOR- FOAM SUPPRESSION SYSTEM",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-06-10 00:00:00",
              "TrainingReviewDate": "2002-06-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-17 00:00:00",
              "EquipmentInspectionDate": "2004-04-15 00:00:00",
              "EquipmentTested": "HIGH LEVEL SWITCHES/ALARMS ON TANK FARM LEVEL PROBES",
              "ChangeMgmtDate": "2004-05-24 00:00:00",
              "ChangeMgmtReviewDate": "2002-11-14 00:00:00",
              "PreStartupReviewDate": "2004-05-25 00:00:00",
              "ComplianceAuditDate": "2002-03-15 00:00:00",
              "AuditCompletionDate": "2002-12-31 00:00:00",
              "IncidentInvestigationDate": "2004-03-30 00:00:00",
              "InvestigationChangeDate": "2004-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2002-01-17 00:00:00",
              "HotWorkPermitReviewDate": "2001-12-10 00:00:00",
              "ContractorSafetyReviewDate": "2002-04-04 00:00:00",
              "ContractorSafetyEvalDate": "2004-06-14 00:00:00",
              "CBI_Flag": 0,
              "Description": "PREVENTION PROGRAM DESCRIPTION\n\nNeoResins Frankfort Plant personnel have taken great care to identify potential hazards which could lead to a catastrophic release of acrylonitrile, install protective systems to prevent such a release, implement measures to mitigate any release which may occur, and maintain the integrity of installed protection systems and mitigation measures. The covered process includes two operating areas: the acrylonitrile storage area and the acrylonitrile reaction area.  Everything in this prevention program applies to both areas, with the following exceptions:\n? Process hazard analysis reviews were last completed on March 15, 2002 for the acrylonitrile reaction area and September 10, 2003 for the acrylonitrile storage area.\n? Relief valves, check valves, and quench system are used as process controls only in the acrylonitrile storage area.\n? Keyed bypass and rupture disks are used as process controls only in the acrylonitrile reaction area.\n? Dikes are used as mitigation systems only in the acrylonitrile storage area.\n* Foam suppression system is in place for use in the Acrylonoitrile storage tank and unloading areas only. \n? Sprinkler system, fire walls, enclosure, and foam over tank with connection to the catalytic oxidizer are used as mitigation systems only in the acrylonitrile reaction area.\n? Process area detectors are present only in the acrylonitrile reaction area.\n\nSafety information has been gathered on the covered process in order to ensure maximum effectiveness of process hazard assessments and a system is in place to maintain the currency and retrievability of this information.  Process hazard analyses have been conducted which have identified major hazards, process controls intended to prevent a release, mitigation systems designed to limit the extent and effect of any release, and needed improvements in the above systems.  Significant hazards have been thoroughly considered and are generally well controlled.  Where improvements have been deemed appropriate, these improvements have been documented, ranked by risk, and a robust system is in place to ensure that actions are addressed.  Written operating and maintenance procedures and an effective hot work program are in place as well as a comprehensive operator training program.  These procedures and training modules are kept current through a periodic review process as well as through active solicitation of feedback from process operators.  In order to ensure continued systems integrity, a comprehensive mechanical integrity program is in place along with an effective, formal management of change program.  All incidents involving the covered process, regardless of potential consequences, are promptly identified, investigated, and actions agreed.  Contractors working on or affecting the covered process are thoroughly screened, trained in appropriate procedures, and their performance on site is monitored.",
              "_chemicals": [
                {
                  "PrimaryKey": 45469,
                  "PreventionProgram3ID": 31232,
                  "ProcessChemicalID": 71913
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 37851,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-09-23 00:00:00",
    "ERTrainingDate": "2004-03-26 00:00:00",
    "CoordinatingAgencyName": "CLINTON COUNTY LEPC",
    "CoordinatingAgencyPhone": "7656547212",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37851,
      "SummaryText": "NeoResins Frankfort, IN plant manufactures polymer products such as acrylic resins that are used in paints and other products. Acrylonitrile (AN) is a raw material used in making acrylic products, and it is stored in an aboveground storage tank with a containment dike. In case of a release of AN, the containment dike is large enough to contain all the contents of the storage tank, thereby preventing it from forming a large pool on the ground.  During the manufacture of certain products, AN is transferred from the storage tank into the manufacturing area through steel pipes. Because of the amount of AN that is stored at the facility, NeoResins is required to comply with the Environmental Protection Agency's Risk Management Program (RMP) standard.\n\nAs required by RMP, facilities like NeoResins that store certain chemicals in large quantities must develop \"worst-case\" scenarios that describe possible releases and their impact to the surrounding community. In addition, the facilities must develop alternate scenarios that describe possible, less extreme releases. The analysis of the community impacts is called the offsite consequence analysis (OCA).  Also, the facilities must provide information regarding reportable releases that have occurred within the past 5 years. Neoresins has never had a single reportable release involving the AN process in the plant history (1987). \nEPA's OCA Guidance dated May 24, 1996 was used to perform the off-site consequence analysis. Following the Guidance document, it was assumed that the entire contents of the storage tank are released into the containment dike in the worst-case scenario involving this material. The dike not only contains the entire spill but also limits the surface area from which the AN evaporates. The impact of this worst-case scenario reaches 1.2 miles from the tank. The area within this distance includes some receptors. \n\nTwo alternate scenarios were analyzed. The first alternate scenario assumes a release during off"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37851,
      "SummaryText": "-loading from a delivery tanker truck. The release occurs at a flange in the delivery pipe and the entire contents of the truck are spilled. The flange is located above the storage tank's containment dike and the spill is, therefore, contained as it is in the worst case scenario. Because, using the Guidance document, the release rate and duration of this scenario are different from the worst-case scenario, the impact only reaches 0.2 miles and only includes industrial receptors. The second alternate scenario is a release from the piping that delivers AN from the storage tank to the manufacturing area. The amount spilled is equal to the quantity contained in the pipe from the storage tank to the manufacturing area. Unlike the previous scenarios, this spill is not contained but instead forms a pool on the ground. Because the quantity and release rate are much smaller than the worst-case and first alternate scenario, the impact from this scenario reaches only 0.11 miles and does not include receptors of any kind.  The OCA's were performed using the Guidance document's procedures and lookup tables.\n\nBecause the impact from the worst-case release scenario includes receptors, this RMP is submitted under Program 3.\n\nA process hazard analysis was conducted for AN and protective systems have been installed to minimize the chances of a release, mitigate any release that may occur, and maintain the integrity of these systems. Written operating and maintenance procedures and operator training programs are in place and are kept current through a systematic review process. All incidents involving the covered process are promptly identified and investigated. The NeoResins Frankfort plant has never had a reportable accident involving the covered process. \n\nNeoResins management is deeply committed to the safe, efficient operation of its processes and actively solicits suggestions for improvement from employees, contractors, vendors, and the public. In accordance with other governmen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37851,
      "SummaryText": "tal regulations, and as a best management practice, NeoResins has instituted several environmental, health and safety (EHS) programs and corporate policies. These include a Contingency Plan, Emergency Action Plan, and Fire Prevention Plan. \n\nPer the Occupational Health and Safety Administration's (OSHA) Process Safety Management standard, NeoResins has performed a Process Safety Analysis of its manufacturing equipment, and has trained its employees on established safety procedures for working with chemicals including AN.  Safety controls and modern safety devices are installed on various process equipment to further reduce the likelihood of a release. Per corporate management policy, any proposed process change must be approved by several management staff prior to instituting that change. This policy requires that personnel responsible for EHS matters be included in the approval process.\n\nThe facility has voluntarily formed an in-plant Emergency Response Team and Incident Command System, and maintains spill control equipment on site. Members of the team are trained annually per OSHA regulations. The most recent training was conducted in March 2004. Additionally, the facility has purchased a foam suppression system. This system was installed and fully operational on 12/31/99 and Team members were trained on its use at that time. The facility has designed specific response procedures in cooperation with Clinton County LEPC, who is frequently invited into the plant and participates in periodic drills. In addition, NeoResins has coordinated its response efforts with the local Hazardous Materials (HAZ-MAT) Team, who has also toured the facility. The Frankfort facliity has also dedicated the resources of two current employees, to attend and participate in the local LEPC program. Through other EHS regulations, NeoResins has communicated with the Local Emergency Planning Committee, and the State Emergency Response Commission."
    }
  ]
}