{
  "FacilityID": 37932,
  "FacilityName": "Sacramento Logistics LLC",
  "FacilityStr1": "3771 Channel Drive",
  "FacilityStr2": null,
  "FacilityCity": "West Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95691",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06113",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.561333",
  "FacilityLongDecDegs": "-121.571333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6943773,
  "ParentCompanyName": "CNS Wholesale",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jaxier Hurtado",
  "OperatorStr1": "3771 Channel Drive",
  "OperatorStr2": null,
  "OperatorCity": "West Sacramento",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95691",
  "OperatorZipCodeExt": null,
  "FTE": 447,
  "OtherEPAFacilityID": "CAD981623549",
  "EPAFacilityID": "100000187898",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-19 00:00:00",
  "ErrorReportDate": "2004-08-19 00:00:00",
  "ReceiptDate": "2004-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2010-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2009-09-30 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54519,
      "AltID": "Ammonia",
      "FacilityID": 37932,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 72097,
          "ProcessID": 54519,
          "ChemicalID": 56,
          "Quantity": 11300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55773,
          "ProcessID": 54519,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31300,
              "Process_NAICS_ID": 55773,
              "SafetyReviewDate": "1997-08-11 00:00:00",
              "PHA_Date": "1996-03-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "seismic detection emergency dump",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "seismic detection and shutdown",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-08-11 00:00:00",
              "TrainingReviewDate": "1998-08-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-08-13 00:00:00",
              "EquipmentInspectionDate": "1998-08-13 00:00:00",
              "EquipmentTested": "none",
              "ChangeMgmtDate": "1996-03-01 00:00:00",
              "ChangeMgmtReviewDate": "1996-03-01 00:00:00",
              "PreStartupReviewDate": "1998-08-01 00:00:00",
              "ComplianceAuditDate": "1997-11-12 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1992-07-11 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-08-13 00:00:00",
              "HotWorkPermitReviewDate": "1998-08-06 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-07 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Anhydrous Ammonia",
              "_chemicals": [
                {
                  "PrimaryKey": 45607,
                  "PreventionProgram3ID": 31300,
                  "ProcessChemicalID": 72097
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 37932,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1996-03-01 00:00:00",
    "ERTrainingDate": "1996-03-01 00:00:00",
    "CoordinatingAgencyName": "West Sacramento Fire Department",
    "CoordinatingAgencyPhone": "9163756474",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 37932,
      "SummaryText": "\nThe Fleming Foods Northern California Product Supply Center in West Sacramento, \n\nCalifornia was purchased by CNS Wholesale and re-named, Sacramento Logistics LLC.  The facility \n\nutilizes approximately 11,300 pounds of anhydrous ammonia in to refrigerate warehoused \n\nfood prior to distribution.  This exceeds U.S. EPA's Risk Management Program (RMP) \n\nthreshold quantity (TQ) for preparing an RMP.  Because the facility's utilization of this \n\nquantity of ammonia also exceeds the TQ established by U.S. OSHA for preparing a \n\nProcess Safety Management (PSM) Plan (completed for the facility in March 1996 and \n\nrevised in June 1999), the facility is subject to Program 3 of the RMP regulations.  \n\n\n\nIn 1994, the refrigeration facility was expanded by 87,900 square feet and the ammonia \n\nrefrigeration system was upgraded to state-of-the-art technology.  Ammonia is used in a \n\nclosed-loop refrigeration system to provide cooling and freezing of food products prior to \n\ndistribution to various retail outlets.  This warehouse-like facility uses approximately \n\n11,300 pounds (lbs) of ammonia in the system to keep food products at refrigeration and \n\nfreezer temperatures.  This is the only covered process as determined by U.S. EPA and \n\nCalARP regulations.\n\n\n\nSeveral safety devices are installed on the ammonia refrigeration system.  A seismic \n\ndetection system was installed that will automatically close all control valves and electrical \n\noutputs in the event of an earthquake.  A total of 16 ammonia detectors are located in \n\nrefrigerated and mechanical rooms throughout the facility.  These detectors are connected \n\nto a control system that will either sound an alarm to facility maintenance personnel in the \n\nevent of a low-level detection, between 100 and 400 parts-per-million (ppm), or will \n\nautomatically shut down the system, notify the fire department, close motorized butterfly \n\nvalves to isolate pressure vessels, and sound an alarm in the mechanical room and guard \n\nhou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 37932,
      "SummaryText": "se in the event that greater than 400 ppm of ammonia is detected.  The refrigeration \n\nsystem is controlled by a computer monitoring system that will display any malfunctions to \n\nthe plant operator and has the capability of shutting down any component or the entire \n\nsystem should any system temperature or pressure exceed the normal design range.  In the \n\nevent of an emergency that may affect the refrigeration system, an ammonia dump system \n\nis installed which will safely reduce refrigeration system pressure by discharging ammonia \n\nfrom each pressure vessel in the system and routing it through a diffuser that dilutes the \n\nammonia with water and discharges the mixture into a 25,000 gallon underground retention \n\ntank.\n\n\n\nThe principal element of the Program 3 RMP is the Offsite Consequence Analysis.  This \n\ninvolves developing and modeling one worst-case and one alternative theoretical release \n\nscenario to estimate the impact an accidental release may have on the public in the \n\nsurrounding area.  The worst-case release assumes that the entire ammonia charge is \n\nreleased into the atmosphere during pessimistic meteorological conditions.  This scenario is \n\nintended as a basis of comparison with other facilities, but it is not realistic to expect such a \n\nscenario to actually occur.  The requirements for the alternative release include that it be \n\nmore likely to occur than the worst case scenario and that it be substantial enough to reach \n\noffsite.  The alternative release scenario assumes average daily atmospheric conditions for \n\nthe area, which were mandated by the local Administering Agency (AA).  \n\n\n\nAll release scenarios were modeled using the air dispersion model Areal Location of \n\nHazardous Atmospheres (ALOHA) version 5.2.2.  Because ammonia can exist in both \n\nneutrally bouyant and heavy gas states under the conditions examined, both the Gaussian \n\nand heavy gas Algorithms were used.  The more conservative of the two toxic endpoint \n\ncalculations wer"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 37932,
      "SummaryText": "e used for assessing each release scenario's impact.  The toxic endpoint is \n\ngiven as 0.14 milligrams-per-liter by the American Industrial Hygiene Association's \n\nEmergency Response Planning Guidelines for Level 2. \n\n\n\nThe worst-case release scenario incorporated passive mitigation provided by the enclosure \n\nof the refrigeration mechanical room, which would facilitate the impingement of released \n\nammonia causing liquid rainout, and reducing the release rate of ammonia vapor.  \n\nTherefore, the total amount of ammonia released over 10 minutes would be 11,300 pounds, \n\nbut the release rate to the atmosphere is 452 pounds/per minute over the 10 minutes  The \n\nworst-case release is predicted to reach the toxic endpoint at a distance of 0.8 miles from \n\nthe facility.  Although the width of the area affected by ammonia concentrations of this \n\nmagnitude, or footprint, is limited and will only be present downwind from the source, a \n\ncircle with a 0.8 mile radius is drawn to examine offsite impacts.  Using interpolation of \n\ncensus block groups that fall within this circle it is estimated that 196 people live within \n\nthis radius, however this number most likely represents a substantial over-count, as the  \n\nFleming facility is surrounded by waterways and other industrial facilities.  There are no \n\npublic schools, hospitals, or other institutions within this radius, and therefore the only \n\npublic receptors are major commercial and industrial buildings. There are no environmental \n\nreceptors within the worst-case radius as defined by the regulations, although there are \n\nseveral waterways.\n\n\n\nThe alternative release scenario chosen was identified in the Hazards and Operability study \n\nprepared for the PSM as posing the greatest risk (i.e. highest likelihood of occurrence and \n\nseverest consequences) out of several release scenarios considered.  It consists of a slow \n\nleak from valve packing failure in the portion of the system designated as the High Pressure \n\nLiquid N"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 37932,
      "SummaryText": "ode. A total of 985 pounds of ammonia is released over ten minutes, after which \n\ntime it is reasonable to assume that the leak would have been isolated through the \n\nactivation of the motor-operated isolation valves and ammonia would have been removed \n\nfrom the affected node via an emergency dump system.  This release's endpoint extends \n\n0.24 miles from the facility.  Because the area immediately surrounding the facility is \n\nstrictly industrial, there are no residents or environmental receptors within this radius, nor \n\ndoes it encompass any waterways.\n\n\n\nThe Fleming Foods (Sacramento Logistics LLC) facility has not had any accidental \n\nreleases of ammonia that resulted in deaths, injuries, or significant property damage onsite, \n\nor known offsite deaths, injuries, evacuations, sheltering in place, property damage, or \n\nenvironmental damage within the past five years.\n\n\n\nThe prevention program requirements for Program 3 RMPs are taken verbatim from \n\napplicable sections of the PSM regulations.  This is a result of U.S. EPA's recognition \n\nthat measures taken to reduce and mitigate hazards to facility workers will also serve the \n\nsame purpose for the surrounding community and environment.  Thus, in order to \n\neliminate redundancy, the PSM is  referenced in the RMP.  The PSM consists of several \n\nelements that contain or describe procedures that must be implemented on an ongoing \n\nbasis, including ammonia and process safety information,  process hazard analysis, \n\noperating procedures, employee training, contractor qualification, pre-startup safety \n\nreviews, mechanical integrity of equipment, management of change, incident \n\ninvestigation, and injury and illness prevention. \n\n\n\nThe intent of the Process Safety Information (PSI) section is to compile system \n\ninformation for use in conducting the Process Hazard Analysis and to help facility \n\noperators to identify and understand the hazards posed by those processes involving \n\nhighly hazardous chemicals.   PSI mu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 37932,
      "SummaryText": "st include information on the hazards of the highly \n\nhazardous chemicals used in the process, information on the technology of the process, \n\nand information on the equipment in the process.  This information must be kept up-to-\n\ndate as process changes or upgrades are made.  It should also be made available to all \n\nemployees and be included, as necessary, in employee training programs.\n\n\n\nThe PSI for the facility includes physical chemical properties of ammonia, ammonia \n\ntoxicity information, information regarding the refrigeration system design and operation, \n\nand equipment standards and chemical usage.  Fleming (Sacramento Logistics) has also \n\ndeveloped an ammonia information notebook that contains essential information about \n\nammonia and the refrigeration system in an easy-to-understand format appropriate for \n\nfacility visitors, contractors, and personnel not involved with operating the refrigeration \n\nsystem. \n\n\n\nThe purpose of the operating procedures portion of the PSM program is to develop, \n\nimplement, and maintain clearly written, detailed procedures, guidelines, rules and \n\npractices for the safe operation of the refrigeration process during all operating phases.  A \n\ncopy of the operating procedures must be readily accessible to all employees who work \n\non or near the refrigeration system.  All employees involved in the daily operation and \n\nmaintenance of the refrigeration process should have a full understanding of every \n\noperating phase.  This is to include an overview of the process, principles of using \n\nammonia in refrigeration systems, operating characteristics of the components of the \n\nsystem and the associated safety hazards, and the proper steps to be taken to execute all \n\nsystem-related tasks in a safe manner.  Standard Operating Procedures (SOPs) have been \n\ndeveloped that include all pertinent procedures involved with the refrigeration system, \n\nincluding those mandated by the PSM regulation.  A certification form is also provided "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 37932,
      "SummaryText": "in \n\nthe PSM for annual review of all SOPs.\n\n\n\nAll employees involved with the refrigeration system must understand the safety and \n\nhealth hazards associated with the use of ammonia in the process.  Therefore, Fleming \n\n(Sacramento Logistics) has developed a written training program for all employees \n\ninvolved in the operation, maintenance, and supervision of the refrigeration system.  Each \n\nemployee involved with the refrigeration system operation will, at a minimum, receive \n\ntraining in understanding MSDS's, routine system operation, emergency system \n\noperation, normal and emergency ammonia safety and handling procedures, and the \n\nindividual's role in emergency response.  This program includes the identity of \n\nemployees to be trained, the training program technical content, competency \n\nrequirements, documentation requirements for demonstration of competence, schedule \n\nfor initial training and refresher training, and training for change.  In addition, contract \n\nand maintenance personnel also receive training as provided for in the Contractor \n\nQualification Program.  The PSM includes a form for documenting all training provided \n\nto employees.\n\nThe purpose of the Contractor Qualification Program is to help ensure that contractors \n\nand their employees are fully aware of the potential dangers involved in the use of \n\nammonia and the refrigeration system.  This awareness should lead to reduced risk of \n\naccidents, and thus improved safety for both contractor employees and the company's \n\nemployees.  It applies to all contractors performing any type of work (e.g. maintenance, \n\nrenovation) on or in the vicinity of the refrigeration system.  The Contractor Qualification \n\nProgram consists of a five part procedure to be used during the procurement of a \n\ncontractor in order to verify that their employees are adequately informed and trained, \n\nand includes several forms to facilitate and document the process.  \n\n\n\nThe purpose for the pre-startup safety review i"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 37932,
      "SummaryText": "s to help ensure that certain important \n\nconsiderations have been addressed prior to startup of a new or modified process involving \n\nammonia.  Pre-startup safety reviews are required for all new facilities and for all \n\nmodifications that result in a change to the process safety information.  The PSM includes a \n\nprocedure and documentation form for conducting the pre-startup safety review.  The \n\nreview consists of verifying that all written process safety information is updated, that the \n\nrequirements for Management of Change have been completed, that all safety, operating, \n\nmaintenance and emergency procedures are updated, implemented, and adequate, that \n\nconstruction and new equipment is in accordance with the design specifications, and that \n\ntraining for each employee involved in operating or maintaining the new equipment in the \n\nprocess has been completed.\n\n\n\nIt is essential to maintain the mechanical integrity of critical process equipment to ensure it \n\nis designed and installed correctly, and operates properly.  The mechanical integrity \n\nprogram helps ensure that proper procedures are adequate and are being followed, such that \n\nall equipment used to process, store and handle ammonia is maintained properly.  The \n\nmechanical integrity program includes an inventory of all refrigeration system equipment, \n\nincluding the date on which it was installed and its life expectancy, a list of scheduled \n\nmaintenance tasks and inspections and a description of the preventative maintenance \n\nprogram for process equipment. \n\n\n\nA PSM compliance audit must be completed at least every three years.  The principal \n\nobjective of the audit is determine whether the procedures and practices that have been \n\ndeveloped to comply with the PSM regulation are adequate and are being followed.  The \n\naudit is to include an evaluation of the design and effectiveness of the PSM program and \n\na field inspection of the safety and health conditions and practices to verify that the P"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 37932,
      "SummaryText": "SM \n\nelements are effectively implemented. \n\nThe facility manager selects a trained team of people to audit the PSM program.  The audit \n\nincludes a review of the relevant documentation and process safety information, an \n\ninspection of the facility, and interviews with all levels of facility personnel.  The PSM \n\nincludes forms to facilitate and document the compliance audit.  A PSM compliance audit \n\nwas just completed in June of 1999.\n\n\n\nAny facility or process is continually undergoing change in order to improve the efficiency, \n\noperability, or safety of the operation, or to replace mechanical equipment.  In order to \n\nfacilitate necessary changes, while ensuring that unrecognized and/or unacceptable hazards \n\nare not introduced, the management of change (MOC) procedure has been developed.  The \n\nobjective of the MOC procedure is to help ensure that all changes are properly reviewed, \n\nand that any hazards introduced by the implementation of the change are identified and \n\ncontrolled, prior to placing the change in operation.  The MOC procedure is intended to \n\napply to all equipment and procedures involving the refrigeration system, and to any \n\nchange in procedures regardless of whether the change is considered major or minor, or is \n\nof a temporary or permanent nature.  As part of the PSM, definitions, procedures, and \n\ndocumentation forms were developed to accomplish the MOC.\n\n\n\nA procedure has been developed to investigate serious incidents or near-misses in order to \n\nunderstand what happened (or could have happened) and to prevent any recurrence of \n\nsimilar incidents, thereby improving the safety of the process.  Formal incident \n\ninvestigations will be performed any time there is an incident which resulted in, or which \n\ncould reasonably have resulted in (near-miss), a catastrophic release of ammonia.  The \n\nprocedure includes initial incident response, establishing an investigation team, \n\ndetermining the facts and cause of the incident, recommending "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 37932,
      "SummaryText": "corrective and preventive \n\nactions, communicating the results, and follow-up.\n\n\n\nCalifornia mandates that the facility develop an Injury and Illness Prevention Program \n\n(IIPP), which is designed to identify hazardous workplace conditions, and to develop \n\ncontrols, procedures, and work practices to insure these hazards have been identified and \n\ncorrected.  Portions of IIPP that cover the use of hazardous materials have been integrated \n\ninto the PSM in order to ensure consistency and eliminate redundancy and overlap between \n\nthe documents.\n\n\n\nAn Emergency Response Program (ERP) for the Fleming Foods facility (Sacramento \n\nLogistics) was completed in 1996 as part of the OSHA PSM.  The ERP includes an \n\nEmergency Response Plan and procedures for training, testing, and using emergency \n\nresponse equipment.  The ERP was prepared in cooperation with City of West Sacramento \n\nFire Department, Sacramento Fire Department, and Yolo County Office of Emergency \n\nServices.  Fleming Foods (Sacramento Logistics) has assembled a fully certified, \n\nHAZWOPER trained emergency response team made up of Fleming (Sacramento \n\nLogistics)  personnel, as well as the necessary emergency response equipment, such that \n\nFleming (Sacramento Logistics)  personnel will respond to accidental release emergencies\n\n\n\nThe same management system developed for the PSM Plan will be used to implement the \n\nprovisions of the RMP. \n\n\n\nBased on the results of the process hazard analysis and the facility's up-to-date \n\ncompliance with all applicable design codes, industry standards, and regulations, \n\nincluding California's former Risk Management Prevention Program and the OSHA PSM \n\nProgram, no improvements to insure the public's safety are recommended at this time.\n\n"
    }
  ]
}