{
  "FacilityID": 38015,
  "FacilityName": "City of Alice",
  "FacilityStr1": "1151 Commerce Road",
  "FacilityStr2": null,
  "FacilityCity": "Alice",
  "FacilityState": "TX",
  "FacilityZipCode": "78333",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48249",
  "LEPC": "Jim Wells County LEPC",
  "FacilityLatDecDegs": "27.776944",
  "FacilityLongDecDegs": "-098.073333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Alice",
  "OperatorStr1": "PO Box 3229",
  "OperatorStr2": null,
  "OperatorCity": "Alice",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78333",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120521",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 27.679,
  "FRS_Long": -98.1049,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54645,
      "AltID": "Chlorination of raw water",
      "FacilityID": 38015,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 72230,
          "ProcessID": 54645,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55900,
          "ProcessID": 54645,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 20905,
              "Process_NAICS_ID": 55900,
              "SafetyReviewDate": "2004-06-10 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-10 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-10 00:00:00",
              "TrainingReviewDate": "2004-06-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-10 00:00:00",
              "EquipmentInspectionDate": "2003-02-01 00:00:00",
              "EquipmentTested": "Chlorinators",
              "ComplianceAuditDate": "2004-06-10 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 21848,
                  "PreventionProgram2ID": 20905,
                  "ProcessChemicalID": 72230
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38015,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-10 00:00:00",
    "ERTrainingDate": "1999-06-16 00:00:00",
    "CoordinatingAgencyName": "Local Fire Department",
    "CoordinatingAgencyPhone": "3616643111",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38015,
      "SummaryText": "The City of Alice is dedicated to protecting it's employees, the community, and the environment from chemicals accidents through safely operating our Drinking Water Treatment Plant (DWTP).  To ensure efficient and effective management of our operations, we have developed a risk management program.  Our risk management program manual, in its entirety, describes the specific responsibilities and activities for implementing the risk management program.\n\nThe DWTP stores and uses chlorine to disinfect the community water supply.  The DWTP maintains approximately 12,000 pounds (six 1-ton containers) of chlorine on-site for use in its chlorination process.\n\nThe DWTP has not had any accidental releases of chlorine since it began operation in 1986.  The DWTP regularly conducts safety meetings to review and reinforce the proper management of our chlorine and chlorination system.\n\nWhile the DWTP does not have any history of accidents, the most likely cause of chlorine leaks is container valve leaks and piping leak.  DWTP takes precautions to minimize the occurrence of chlorine leaks.  Container valve leaks occur as a result of faulty container valves or poorly mated connections.  The DWTP examines all chlorine containers upon arrival for leaking valves and has procedures in-place for repairing the valve packing, which is typically the cause of leaking vales.  Poor connections are typically a result of deteriorated gaskets, which cause the connection to improperly seat.  To minimize poor connections, every time a container connection is made, the DWTP uses new lead gaskets.    \n\nWorst-case release scenarios and alternate release scenarios were evaluated and distances to endpoints were determined, public and environmental receptors were identified, and potentially affect populations were estimated.  The DWTP used the EPA's Offsite Consequence Analysis Guidance to determine the distances to endpoints. \n\nThe City of Alice believes that a comprehensive prevention program is essenti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38015,
      "SummaryText": "al to the prevention of accidental releases of hazardous chemicals.  The DWTP includes seven basic elements in its prevention program: a safety program, a hazard review program, written operating and maintenance procedures, a training program, incident investigation procedures, and a compliance audit program to ensure effectiveness of the risk management program.\n\nThe DWTP maintains complete and accurate written information concerning process chemicals, process technology, and process equipment, which is essential to an effective RMP.  The safety program consists of written information complied for the chlorination process and up-to-date safety information, enabling the DWTP operators to identify and understand the potential hazards involved in the covered process. \n\nThe City of Alice believes that a thorough hazard review is key to understanding how to operate safely on a continual basis.  The DWTP has a hazard review process is to determine, identify, and evaluate the types of hazards or potential failures associated with the chlorination process.  The chlorination process is carefully managed and consistently conducted in a safe manner.\n\nWritten operating procedures developed for the DWTP provide the safest and most appropriate step-by-step method for conducting safe operations.  The written operating procedures give operator clear instructions for safely conducting activities involving the chlorination process.  These operating procedures include guidance from manufacturers, suppliers, and vendors of the chlorination process equipment. \n\nIn addition, the DWTP has implemented a maintenance procedures program that includes written procedures and schedules for maintenance and equipment inspections and tests to ensure that maintenance operations are conducted in a safe manner and implemented to maintain the mechanical integrity of the chlorination equipment.  Preventative maintenance and inspection of equipment is critical to safe operations. \n\nThe DWTP's training p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38015,
      "SummaryText": "rogram is in-place to ensure that its operators understand how to safely operate the chlorination equipment and to understand why safe operations are necessary.  The objective of this training is to train operators so that fewer accidents occur, equipment damage is minimized, and operational efficiency is improved.  The City of Alice believes that its training program is the key to ensuring that the rest of the Prevention Program is effective.\n\nEvery employee working with the chlorine will be adequately trained to ensure safe handling, storage, and use of the chlorine.  All personnel working at the DWTP receive training on the operation and maintenance procedures of the chlorination process.  Training consists of one-on-one training, on-the-job training, and classroom training.  Competency tests are used to ensure that each operator trained has understood the training and is competent to operate the process safely. \n\nThe DWTP has developed incident investigation procedures to investigate major and minor accidents that occur within the plant or across the fenceline that resulted in or could have resulted in a chemical release, personnel injury, property damage, or environmental damage.  Incident investigation procedures are used to assist in understanding the obvious incident causes, as well as the underlying causes, which provides valuable information identifying and solving the problem and preventing similar incidents from occurring.\n\nThe DWTP has implemented a compliance audit program to periodically assess compliance with its risk management program, monitor the risk management program and respond promptly to any deviations.  The DWTP uses the compliance audit program to verify that the practices and procedures developed are adequate and are being followed.\n\nThe City of Alice's DWTP has an Emergency Action Plan to ensure that system for notifying employees, the surrounding community, and the proper response authorities of in the event of an accidental releases of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38015,
      "SummaryText": " hazardous chemicals in effective and in-place.  The DWTP operators are not trained nor equipped to respond, other than minor response, to a hazardous chemical release.  However, in the event that a release occurs that requires any response other than a minor response, which can be safely performed by the City of Alice operators, the proper emergency response crews will be contacted. \n\nThe DWTP has implemented a management program, which describes the management responsibilities for implementing the risk management program.  The management program was developed to ensures that the elements of the risk management plan are integrated, implemented, continuously improved, and that the responsibility for the overall program and for each RMP requirement is clearly defined.\n\nThe City of Alice's DWTP takes a very responsible attitude towards safety.  The DWTP has rigorously implemented the risk management program.  The DWTP has continued its commitment to ongoing safety through the implementation of revised and updated operating and maintenance procedures, increased training schedules, and installation of updated release detection equipment and emergency response equipment."
    }
  ]
}