{
  "FacilityID": 38025,
  "FacilityName": "COLGATE-PALMOLIVE JEFFERSONVILLE, INDIANA PLANT",
  "FacilityStr1": "1410 SOUTH CLARK BLVD.",
  "FacilityStr2": null,
  "FacilityCity": "CLARKSVILLE",
  "FacilityState": "IN",
  "FacilityZipCode": "47129",
  "Facility4DigitZipExt": "7009",
  "FacilityCountyFIPS": "18019",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "38.276944",
  "FacilityLongDecDegs": "-085.754444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "WWW.COLGATE.COM",
  "FacilityEmailAddress": "VALERIE_THOMAS@COLPAL.COM",
  "FacilityDUNS": 6383590,
  "ParentCompanyName": "COLGATE-PALMOLIVE COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 1344381,
  "Company2DUNS": null,
  "OperatorName": "COLGATE-PALMOLIVE COMPANY",
  "OperatorStr1": "1410 SOUTH CLARK STREET",
  "OperatorStr2": "P.O. BOX CS9",
  "OperatorCity": "JEFFERSONVILLE",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47129",
  "OperatorZipCodeExt": "7009",
  "FTE": 500,
  "OtherEPAFacilityID": "47130CLGTP1400S",
  "EPAFacilityID": "100000144783",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-06 00:00:00",
  "SafetyInspectionBy": "INDIANA DEPT OF ENVIR MGMT, OFFICE OF AIR MGMT",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 38.279278,
  "FRS_Long": -85.765694,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54662,
      "AltID": "LIQ PETROLEUM GAS SYSTEM",
      "FacilityID": 38025,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 72252,
          "ProcessID": 54662,
          "ChemicalID": 155,
          "Quantity": 71000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 53877,
              "ProcessChemicalID": 72252,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 53878,
              "ProcessChemicalID": 72252,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 55917,
          "ProcessID": 54662,
          "NAICSCode": "325611",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31389,
              "Process_NAICS_ID": 55917,
              "SafetyReviewDate": "2004-05-14 00:00:00",
              "PHA_Date": "2000-04-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-07-14 00:00:00",
              "TrainingReviewDate": "2004-03-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-14 00:00:00",
              "EquipmentInspectionDate": "2004-05-12 00:00:00",
              "EquipmentTested": "HYDROCARBON DETECTORS (CALIBRATION)",
              "ChangeMgmtDate": "2000-09-08 00:00:00",
              "ChangeMgmtReviewDate": "1998-09-08 00:00:00",
              "PreStartupReviewDate": "1999-01-28 00:00:00",
              "ComplianceAuditDate": "2004-05-14 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-14 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-14 00:00:00",
              "ContractorSafetyReviewDate": "2004-03-25 00:00:00",
              "ContractorSafetyEvalDate": "2004-03-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 45706,
                  "PreventionProgram3ID": 31389,
                  "ProcessChemicalID": 72252
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38025,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-04-30 00:00:00",
    "ERTrainingDate": "2004-04-22 00:00:00",
    "CoordinatingAgencyName": "CLARK COUNTY LEPC",
    "CoordinatingAgencyPhone": "8122566981",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 38025,
      "SummaryText": "tions\n· Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs\n4. Training.  We train employees to safely and effectively perform their assigned tasks.  Our training program includes both initial and refresher training that covers (a) a general overview of the process, (b) the properties and hazards of LPG, and (c) a detailed review of the process operating procedures and safe work practices.  Demonstrations are used to help train employees.  Oral reviews and demonstrations are used to verify that an employee understands the training material before the employee can begin or resume work in the process.\n5. Mechanical integrity.  We maintain our process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  Our mechanical integrity (preventive maintenance) program includes (a) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (b) a quality assurance function to help ensure that new and replacement equipment meet the strict design standards required for service in our process.\n6. Management of change.  We have a written procedure to review and approve all proposed changes to the process, including chemicals, equipment, technology, and procedures to help ensure that the change does not negatively affect safe operations. All changes other than replacement-in-kind (e.g., replacing a valve with an identical valve) must be approved through the full management of change program.  This helps ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n7. Pre-startup safety review.  We perform safety reviews of new or modified processes before placing them into service to help ens"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38025,
      "SummaryText": "ure their safe operation.  This review confirms that:\n· Construction and equipment are in accordance with design specifications;\n· Adequate safety, operating, maintenance, and emergency procedures are in place;\n· Employee training has been completed; and\n· For a covered process, a process hazard analysis has been performed if the process is new, or management of change requirements have been completed if an existing process has been modified.\n8. Compliance audit.  One of the cornerstones of an effective prevention program is a regular, thorough assessment.  We have a program to perform compliance audits of our covered process every 3 years to be certain our prevention program is effectively addressing safety issues of the process.  This audit is performed by an audit team that includes personnel knowledgeable in the PSM and RMP regulations and in our process designs, and this team evaluates whether the prevention program satisfies the requirements of these two regulations and whether it is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n9. Incident investigation.  We have a program to investigate any incidents or near misses that could reasonably result in serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future.  We communicate to our employees the requirement to identify and report any incident requiring investigation.  In the event of an incident, an investigation team would be assembled, and the investigation would be initiated as soon as possible, but always within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process improvements are implemented.\n10. Employee participation.  We have a written employee participation program for our covered process to help ensure that the safety"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 38025,
      "SummaryText": "concerns of our employees are addressed.  We encourage active participation of personnel in the prevention program activities of all processes at the plant.  Employees are consulted on and informed about all aspects of our accidental release prevention program.\n11. Hot work permits.  We have a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions in our plant.  We reviewed OSHA's fire prevention and protection requirements and created a hot work permit form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the form, and the appropriate supervisor reviews the completed form before work can begin.  Training on hot work activities and on the requirements of the hot work permit program is included in our safe work practices orientation.\n12. Contractors.  We have a program in place to help ensure that contractor activities related to the process are performed in a safe manner.  We explain to the contract supervisors the hazards of the processes on which they and their employees will work, our safe work practices, and our emergency response procedures. Contractors are required to ensure that training has been performed for each of their employees who will work at the plant before that worker begins work at our plant.  We routinely verify that this training has been provided.\n3.2  Chemical-specific Prevention Steps\nIn addition to the required prevention program elements, we have implemented safety features specific to LPG.  The LPG is delivered in tank trucks that must be approved by the Department of Transportation. The LPG storage tank and equipment are designed and maintained to standards established by the federal government (e.g., NFPA 58) and by industry.  We have installed hydrocarbon detectors in the area of the storage tank and inside the plant near likely release points to alert operators of a release of the hazardous material and have equipped the system w"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 38025,
      "SummaryText": "ith automatic isolation valves that close when the detectors indicate that a release has occurred.  Low pressure detectors and interlocks, manual shutoff valves, and excess flow devices in the storage tank and in the lines are also provided as process controls that are in place to help prevent or mitigate releases of LPG from the system.\n4.  FIVE-YEAR ACCIDENT HISTORY\nOur accident history demonstrates the continuous safe operation of our LPG process over the last 5 years. There have been no accidental releases of LPG from the system that resulted in exposure to employees, contractors, the public, or the environment.\n5.  EMERGENCY RESPONSE PROGRAMS\nWe have established a written emergency response program to help ensure the safety of personnel who could be called on to respond to any accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n· Informing the Clark County LEPC about accidental releases that could reasonably result in offsite consequences\n· Providing proper first aid and emergency medical treatment for accidental human exposure to hazardous substances\n· Obtaining outside assistance to control and contain accidental releases of hazardous substances, including the use of emergency response equipment\n· Inspecting and maintaining emergency response equipment\n· Reviewing and updating the emergency response plan\n We have trained our employees to recognize and report emergency situations.  All of our personnel and contractors are trained in evacuation procedures.  The Clark County LEPC is responsible for notifying the public of the emergency situation, if necessary.\n The written emergency response plan complies with other federal contingency plan regulations [e.g., the OSHA regulation 29 CFR 1910.38(a)], and a copy of the plan has been provided to the local fire department. Also, a hazardous material inventory has been provided to the Clark County LEPC and local fire department, as required by the Emergency Planning and C"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 38025,
      "SummaryText": "ommunity Right-To-Know Act.  C-P personnel from the Jeffersonville plant maintain a regular dialogue with local emergency planners.\n 6.  PLANNED CHANGES TO IMPROVE SAFETY\n We constantly strive to improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.  All recommendations received by plant management are evaluated and implemented if safety can be improved. Standard operating and safety procedures for the covered process are reviewed periodically to ensure that they are correct, and we provide training to our employees and contractors on a wide variety of safety and operations topics.  The LPG system at C-P Jeffersonville is not a complicated system, and it has been operating safely since its inception in 1956.  However, C-P Jeffersonville has implemented OSHA PSM and EPA RMP required improvements for this system and has improved the operation and maintenance of the system to help maintain the high standard of safety that has been achieved in the past."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38025,
      "SummaryText": "tractors, and the public, and the preservation of the environment, through the prevention of accidental releases of regulated substances.  We take appropriate steps to prevent foreseeable releases of regulated substances.  These steps include (1) training programs for personnel, (2) programs to help ensure safety in the design, installation, operation, and maintenance of our process, and (3) programs to evaluate the hazards of our process.\nIn the event of an accidental release, we will strive to control and contain the release in a manner that will be safe for workers and will help prevent injury to the public or damage to the environment.  We provide response training to our personnel, including working with the Clark County LEPC for executing emergency response actions, so that they are well prepared to respond in the event of an emergency situation.\n2.  REGULATED SUBSTANCES USED BY THE C-P JEFFERSONVILLE PLANT\nThe C-P Jeffersonville plant is a manufacturer of consumer products, such as dental cream, shaving cream, and cleaning products.  As part of the shaving cream manufacturing processes, we handle one substance (liquefied petroleum gas [LPG]) in sufficient quantity to be regulated by the RMP rule.  The LPG used at the plant is a mixture of isobutane (80.9 wt. %) and propane (19.1 wt. %), and it is covered as a hazardous flammable material by the RMP rule.  This hydrocarbon gas is used as a propellant in the shaving cream cans.\n3. ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nWe have developed a comprehensive prevention program that complies with the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) regulation.  For the Jeffersonville plant, the prevention program requirements of EPA's RMP rule are also satisfied by this PSM program. The following sections briefly describe the elements of our prevention program that address the RMP rule requirements. \n3.1  Prevention Program\nOur accident prev"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 38025,
      "SummaryText": "EXECUTIVE SUMMARY FOR \nCOLGATE-PALMOLIVE COMPANY'S\nJEFFERSONVILLE, INDIANA, PLANT\n\nThe Colgate-Palmolive Company's (C-P's) Jeffersonville plant is committed to operating our plant in a manner that is safe for our workers, contractors, the community, and the environment.  To meet this commitment, we have established systems to help ensure safe operation of the processes at this plant.  One component of these systems is a risk management program (RMP) that helps manage the risks involved with using hazardous substances at our plant and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit an executive summary in the risk management plan (RMPlan) describing the RMP at the Jeffersonville plant.  This document is intended to satisfy the executive summary requirement of the RMP rule and to provide the public with a description of our RMPlan.  Section 2 of this executive summary describes the one substance currently used at the Jeffersonville Plant in sufficient quantity to be regulated by the RMP rule.\nOur risk management program consists of three elements:\n1. A hazard assessment designed to help us understand (a) the potential offsite consequences of hypothetical accidental releases of the covered substance at the plant and (b) accidents that have occurred during the last 5 years associated with the substances regulated by the RMP rule - see Sections 2 and 4 of this executive summary\n2. A prevention program to help maintain and safely operate processes containing significant quantities of substances regulated by the RMP rule - see Section 3 of this executive summary\n3. An emergency response program to help respond to accidental releases of regulated substances from processes covered by the RMP rule - see Section 5 of this executive summary\nAlthough our RMPlan helps ensure that our"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38025,
      "SummaryText": "plant is maintained and operated in a safe manner, it is only one component of the safety program.  In fact, we have a comprehensive safety program that establishes many levels of safeguards against accidental releases and against the injuries and damage that could occur from accidental releases.\n - Limited use of substances regulated by the RMP rule.  Before using a substance regulated by the RMP rule (regulated substance), we consider less hazardous alternatives.  In the rare instance when we must use a regulated substance, we consider the potential for this substance to adversely affect our workers, contractors, the public, and the environment and take steps to prevent any such effects.\n - Preventing releases of the regulated substance used at the plant.  When a regulated substance is used, the equipment used to contain it is carefully designed, built, and operated to reduce the likelihood of an accidental release. Government and corporate standards are closely adhered to in the design, construction, and operation of the equipment.\n - Limiting damage from a release, if such a release occurs.  We work to prevent accidental releases from occurring.  However, we also train our workforce to recognize accidental releases, quickly assess the severity of a release, and respond to isolate or minimize the release, including contacting the local agency responsible for responding to accidental releases (Clark County Local Emergency Planning Committee [LEPC]) if emergency response actions are necessary. We work closely with the Clark County LEPC to ensure appropriate plans are in place to minimize the impact of the release on our workers and the community.\n Our safety program consists of a number of elements, only some of which are required by the RMP rule.  This RMPlan is primarily intended to describe those parts of the safety program required by the RMP rule.\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nWe are committed to the safety of workers, con"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38025,
      "SummaryText": "ention program for LPG consists of the following 12 elements:\n1. Process safety information.  We maintain a variety of technical documents, including an emergency preparedness plan, to help ensure that our employees and local emergency responders know about the hazards associated with our plant.  These documents address (a) physical properties of the LPG, (b) operating parameters for our equipment, and (c) design basis and configuration for our equipment.  We ensure that this process safety information is available to our employees.\n2. Process hazard analysis.  We perform and periodically update a process hazard analysis of our LPG process to help identify process hazards and make recommendations that will improve the safe operation of the process.  A multidisciplinary team is assembled to analyze the hazards of the LPG process.  This team includes personnel with engineering and process operating experience and a leader with process hazard analysis experience. The team systematically addresses the hazards associated with operation of the equipment in the LPG process area. The team then prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility for resolving the recommendations is assigned to area personnel, and, when appropriate, changes to enhance the safety of the process are implemented.  This analysis is revisited at least every 5 years to ensure it is current.\n3. Operating procedures.  Our process engineers, operators, and managers work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n· Steps for safely conducting activities\n· Applicable process safety information, such as safe operating limits and consequences of process devia"
    }
  ]
}