{
  "FacilityID": 38121,
  "FacilityName": "US Army XVIII Airborne Corps & Fort Bragg",
  "FacilityStr1": "AFZA-PW",
  "FacilityStr2": "3-1631 Butner Road",
  "FacilityCity": "Fort Bragg",
  "FacilityState": "NC",
  "FacilityZipCode": "28310",
  "Facility4DigitZipExt": "5000",
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "35.159167",
  "FacilityLongDecDegs": "-079.003056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.bragg.army.mil/pwbc",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Public Works BusinessCenter",
  "OperatorStr1": "AFZA-PW",
  "OperatorStr2": "Building 3-1631 Butner Road",
  "OperatorCity": "Fort Bragg",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28310",
  "OperatorZipCodeExt": "5000",
  "RMPContact": "Joe Stancar",
  "RMPTitle": "Air Program Manager",
  "FTE": 49000,
  "OtherEPAFacilityID": "28307DPTFRDIREC",
  "EPAFacilityID": "100000113254",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "04379T23",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "2004 RMP Update",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-03-04 00:00:00",
  "DeRegistrationEffectiveDate": "2013-01-17 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 35.19111,
  "FRS_Long": -79.01,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54812,
      "AltID": "Water Treatment",
      "FacilityID": 38121,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56068,
          "ProcessID": 54812,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72494,
          "ProcessID": 54812,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572494,
          "ProcessID": 54812,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 54813,
      "AltID": "Wastewater Treatment",
      "FacilityID": 38121,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56069,
          "ProcessID": 54813,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72495,
          "ProcessID": 54813,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572495,
          "ProcessID": 54813,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38121,
      "SummaryText": "This document summarizes the Risk Management Program at Fort Bragg that complies with the amended Clean Air Act Section 112(r).  The regulations to enforce Section 112(r) are laid out by the U.S. Environmental Protection Agency (EPA) in the Risk Management Program Rule (40 CFR, Part 68).  The regulations were established to reduce industrial and toxic materials accidents, enhance public and worker safety, and provide additional protection to the environment.  Military installations, as well as municipalities and private companies, must comply with these regulations and update and resubmit their existing risk management plan to EPA by June 21, 2004.\n\nThe Risk Management Program Rule applies to stationary sources that use or store large quantities of regulated substances, such as chlorine and ammonia.  On Fort Bragg, the drinking water and wastewater treatment plants are subject to the Risk Management Program Rule because of the amount of chlorine they store and use to disinfect the drinking water supply and treat the wastewater.  \n\nFort Bragg, home of the VXIII Airborne, is a U.S. Army installation that covers an area of 180,000 acres and employs approximately 50,000 soldiers and civilians.  Fort Bragg is located 10 miles northwest of downtown Fayetteville, North Carolina.  It interacts regularly with its neighboring jurisdictions:  Cumberland County, the town of Spring Lake, the city of Fayetteville, Harnett County, Hoke County, Scottland County, Richmond County, Moore County, Pope Air Force Base, and Eureka Springs.  The Fort Bragg drinking water plant has been in operation since 1918 and provides water to military personnel, civilian employees, residents, and facilities on Ft. Bragg and Pope Air Force Base.  The wastewater treatment plant has been in operation since 1940 and treats the wastewater from Fort Bragg and Pope Air Force Base.  Fort Bragg's drinking water and wastewater treatment facilities have a good safety record: there have been no reportable release"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38121,
      "SummaryText": "s of chlorine within the last five years from either of the water treatment plants. The operators at both facilities maintain state certification, and are well trained in the proper handling procedures for chlorine use.  \n\nTo comply with the initial Risk Management Program Rule, environmental and safety personnel at Fort Bragg reviewed, documented, and in some cases enhanced the installation's integrated accident prevention program, its emergency response program, and its overall management system.  Fort Bragg submitted its initial Risk Management Plan (RMP) to the EPA in June 1999.  As part of this process and in the course of subsequent Risk Management Program evaluations, Fort Bragg personnel re-analyzed the hazards associated with the storage and use of chlorine at the drinking water and wastewater treatment plants and reviewed the training of personnel and contractors who handle the chlorine, operate the water treatment facilities, and respond to emergencies, spills, or releases.  This analysis built upon an extensive 1997 Process Safety Management Program review of the equipment and procedures associated with the storage and use of chlorine at the drinking water and wastewater treatment plants.  \n\nFort Bragg's Fire and Emergency Services Department participated in the review of the installation's emergency response program and preparation of the Risk Management Plan.  In the case of an accidental chlorine release, well-trained emergency response teams will immediately be notified.  Installation fire department personnel will secure the area and provide assistance while personnel trained in the handling of hazardous materials and operation of the plants contain and clean-up the spill.  Procedures are in place for Fort Bragg's emergency response staff to notify, and work with, local officials, area medical centers, and community emergency response units in the surrounding areas to notify the public, provide instructions about what to do, and to provide assistanc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38121,
      "SummaryText": "e.  Additionally, the Fort Bragg Fire Department has established a Chlorine Incident Response Procedure that will be activated in the event of a release of chlorine from either plant or from a transportation accident.  Responding to chlorine releases is integrated into the Hazardous Materials Technician and Incident Commander training provided to the Fort Bragg Fire Department personnel.  In fact, Fort Bragg and the surrounding emergency response agencies, as part of the semiannual Orbit-Comet emergency response training program, staged a chlorine cylinder transportation accident exercise in October 2002.\n \nThis RMP resubmittal serves as a 5-year update to the original Fort Bragg RMP.  There have been no reportable accidents at either plant in the last 5 years.  Since the original RMP submittal, Fort Bragg has installed additional safety equipment, enhanced security measures, conducted safety inspections, and provided a variety of safety and on-the-job training to plant personnel in order to ensure the continued safe operation of these plants.  As part of its ongoing assessment of facility operations, Fort Bragg has been in the process of evaluating the feasibility of replacing the use of chlorine gas in the drinking water plant system with an alternative disinfectant.  A study and pilot field test was initiated in 2004 to evaluate the effectiveness of three alternative disinfectants- mixed oxidants, chlorine dioxide, and sodium hypochlorite.  In addition, preventive maintenance of chlorine handling equipment and calibration of alarms in the storage buildings are performed routinely.  As any changes to the plants? operation are made, the Risk Management Plan and accompanying documentation will be updated accordingly.\n\nIf you have questions or would simply like more information about Fort Bragg's Risk Management Plan, please contact Mr. Joe Stancar, Air Program Manager at 1-910-432-8464."
    }
  ]
}