{
  "FacilityID": 3814,
  "FacilityName": "Perry's Ice Cream Company, Inc.",
  "FacilityStr1": "One Ice Cream Plaza",
  "FacilityStr2": null,
  "FacilityCity": "Akron",
  "FacilityState": "NY",
  "FacilityZipCode": "14001",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": null,
  "FacilityLatDecDegs": "43.026194",
  "FacilityLongDecDegs": "-78.499278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Perry's Ice Cream Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Perry's Ice Cream, Inc.",
  "OperatorStr1": "One Ice Cream Plaza",
  "OperatorStr2": null,
  "OperatorCity": "Akron",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14001",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Brewster, Timothy Gominiak",
  "RMPTitle": "Eng, Safe., & Envr Dir, Maint. Dir",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000046568",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.02646,
  "FRS_Long": -78.50084,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4423,
      "AltID": null,
      "FacilityID": 3814,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4524,
          "ProcessID": 4423,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4711,
          "ProcessID": 4423,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504711,
          "ProcessID": 4423,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3814,
      "SummaryText": "Executive Summary for Perry's Ice Cream Company, Inc.\n\nAccidental Release Prevention Policy: Perry's Ice Cream will take every reasonable action to prevent all accidental releases.   We will accomplish this by using the most current design, training, and inspecting processes available.  \n\nEmergency Response Policy (ERP).   The Perry's Ice Cream facility will respond to any emergency in a manner best suited to protecting our employees, the public, and the environment.  Trained on-site responders will access the emergency, and decide on a coarse of action.  For emergencies within their training level they will respond.  For any emergency not included in their training, off-site emergency response agencies will be called.     \n\nThe Stationary Source.  The stationary source is the ammonia refrigeration system at this ice cream producing facility.  Anhydrous Ammonia (CAS No. 7664-41-7) is the regulated substance handled at this facility.   The refrigeration system has a maximum ammonia inventory of 80,000 pounds.  This quantity qualifies the refrigeration system as a Program 3 process.\n\nThe Worst-case Scenario.  The worst-case scenario for the Akron facility is the rupture of the largest ammonia storage holding tank.  The volume of the storage tank would allow a maximum of 15,400 pounds of liquid ammonia to be stored.  In the worst case scenario this tank would rupture and spill its entire contents onto the ground in ten minutes.  Using the EPA look-up tables for this release, the distance to the toxic endpoint is 1.60 miles.    \n\nThe Alternative Release Scenario.  The alternative release scenario is the discharge of all the ammonia from the largest compressor in the equipment room.  This compressor has a capacity to release 140 pounds of ammonia per minute.  In the alternative scenario the ammonia is vented to the roof by the automatic ventilation equipment installed in the equipment room. Using the EPA look-up tables for this release, the distance to the toxic endpoint"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3814,
      "SummaryText": " is 0.1 miles. \n\nAccidental Release Prevention Program.  We are currently in compliance with the OSHA PSM rule.  The accidental release prevention program includes a combination of design, training, and inspecting.  The refrigeration system was designed according to current codes and specifications, and adheres to good operating practice.  The operators and contractors who work in and around the refrigeration equipment have been trained in both safety and proper operating procedures.  We have a detailed monitoring and inspection program that maintains the mechanical integrity of the refrigeration equipment.  These programs are described in more detail in the full RMP program\n\nFive Year Accident History.     No reportable accidnets involving the ammonia system occured in the last 5 years.      \n\nEmergency Response Program.  The Perry's Ice Cream facility has a written ERP that includes specific actions to be taken in response to an accidental release of anhydrous ammonia from the refrigeration system.  On-site responders will respond to small accidental releases.  Any large or uncontrolled release will require assistance from off-site responding agencies.  The ERP plan states the specific procedures for informing the public and local agencies responsible for responding to an accidental release.  The ERP also includes information on emergency health care for exposure to anhydrous ammonia.  The ERP was last reviewed on October 21, 1998.  ERP training for all employees was last conducted on May 24, 1999.  The ERP is coordinated with the Clarence HAZMAT unit.  The contact is the Battalion Chief, at telephone (716) 759-8919.  The facility is also subject  to OSHA 1910.120.    \n\nPlanned Changes to improve Safety.  None outstanding."
    }
  ]
}