{
  "FacilityID": 38152,
  "FacilityName": "Nestle Prepared Foods Company",
  "FacilityStr1": "P.O. Box 1419",
  "FacilityStr2": "2132 Old Georgia Hwy.",
  "FacilityCity": "Gaffney",
  "FacilityState": "SC",
  "FacilityZipCode": "29342",
  "Facility4DigitZipExt": "1419",
  "FacilityCountyFIPS": "45021",
  "LEPC": "Cherokee County LEPC",
  "FacilityLatDecDegs": "35.053056",
  "FacilityLongDecDegs": "-081.695278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Frozen Food Division, Nestle USA - Food Group, Inc",
  "Company2Name": "Nestle USA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nestle USA - Food Division",
  "OperatorStr1": "30003 Bainbridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Solon",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44139",
  "OperatorZipCodeExt": null,
  "RMPContact": "Asa W. Albritton",
  "RMPTitle": "Facilities/Refrigeration Supv.",
  "FTE": 1550,
  "OtherEPAFacilityID": "SCD982087546",
  "EPAFacilityID": "100000046639",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 35.04895,
  "FRS_Long": -81.69643,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54874,
      "AltID": null,
      "FacilityID": 38152,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56130,
          "ProcessID": 54874,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72565,
          "ProcessID": 54874,
          "ChemicalID": 56,
          "Quantity": 301831.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572565,
          "ProcessID": 54874,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38152,
      "SummaryText": "\n\n\n\n\nEXECUTIVE SUMMARY\n\n\n\n\n\n1.    Accidental release prevention and emergency response policies:\n\n\n\nAt Nestle Prepared Foods Company Gaffney, South Carolina we handle ammonia, which is considered hazardous by EPA.  The same properties that make ammonia valuable as a refrigerant also make it necessary to observe certain safety precautions in handling ammonia to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle ammonia combined with the safety devices inherent in the design of this facility combined with the safe operating procedures that we use and the training of our personnel.\n\n\n\n2.    The stationary source and regulated substances handled:\n\n\n\nThe primary purpose of the Nestle Prepared Foods Company Gaffney, South Carolina facility is the manufacture, packaging and distribution of frozen food products.  Ammonia is used by the facilities refrigeration system to maintain various temperature levels required by production.  Ammonia is contained within a closed refrigeration system and brought into the facility only to facilitate charging the refrigeration system when required.  Access to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.  The regulated substance handled at the Nestle Prepared Foods Gaffney, South Carolina facility is anhydrous ammonia.\n\n\n\nThe maximum amount of ammonia that can be retained in the ammonia refrigeration system is 301,831 pounds.\n\n\n\n3.    The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\n\n\nWorst-Case Scenario - Failure of the largest ammonia storage tank when filled to the greatest amount allowe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38152,
      "SummaryText": "d would release 73,105 pounds of ammonia.  It is assumed that the entire contents are released as has liquefied by pressure that is assumed to participate in resulting toxic exposure.\n\n\n\nThe distance to the endpoint for the worst-case scenario is 4.90 miles.  This release could have off-site consequences.\n\n\n\nAlternative Scenario - A pipe leak in the ammonia refrigeration piping system.  An ammonia leak forms in a part of the piping system at a release rate of 109.5 pounds per minute for 60 minutes.  A total quantity released would be approximately 6,570 pounds.  A wind speed of 3 meters per second was used for the scenario and it is assumed the contents released to participate in resulting toxic exposure.\n\n\n\nThe distance to the endpoint for toxic exposure for the alternative scenario is less than .21 miles.  This release has the possibility of extending beyond the facility boundary.\n\n\n\n4.    The general accidental release prevention program and the specific prevention steps.\n\n\n\nThe Nestle Prepared Foods Company Gaffney, South Carolina facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility was designed and constructed in accordance with industry accepted practice and is in compliance with the International Institute of Ammonia Refrigeration ANSI/IIAR 2 Standard for \"Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems\".  All of our Engineers, Operators and Technicians have been thoroughly trained using the International Institute of Ammonia Refrigeration R1 \"Guide to Good Practices for the Operation of an Ammonia Refrigeration System.\"\n\n\n\n5.    Five-year accident history.\n\n\n\nThere have not been any ammonia related incidents at the Gaffney Plant during the previous five years that resulted in significant on-site or off-site consequences.\n\n\n\n\n\n\n\n6.    The emergency response program.\n\n\n\nAn emergency response program has been implemented at the Gaffney Plant.  This program cont"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38152,
      "SummaryText": "ains procedures describing how the facility will respond to fires, ammonia leaks, and other emergencies, including evacuation procedures.\n\n\n\nThe emergency response program includes the following elements:\n\n\n\n* Evacuation Plan\n\n* Procedures to Address Serious Accidents\n\n* Ammonia Leak Procedures\n\n* Emergency Medical Procedures\n\n\n\nThe program has been coordinated with the Gaffney City Fire Department.\n\n\n\n7.    Planned changes to improve safety.\n\n\n\nThe Nestle Prepared Foods Company Gaffney, South Carolina Facility system for managing risk and process safety was revised in 1998 into a formal fully integrated system including administrative controls to ensure the effective implementation of programs developed and continuous improvement of all risk and process safety processes.  The new management system is to be formally implemented in 1999.  In 2000, we plan to measure performance and upgrade the system to improve risk and process safety practice.\n\n\n\nRMP Validation Errors --- No Data To Report\n\n\n\n\n\n\n\n"
    }
  ]
}