{
  "FacilityID": 38175,
  "FacilityName": "G.S. Robins and Company (01 Lombard)",
  "FacilityStr1": "101 Lombard Street",
  "FacilityStr2": null,
  "FacilityCity": "St. Louis",
  "FacilityState": "MO",
  "FacilityZipCode": "63102",
  "Facility4DigitZipExt": "2415",
  "FacilityCountyFIPS": "29510",
  "LEPC": "St. Louis City LEPC",
  "FacilityLatDecDegs": "38.617111",
  "FacilityLongDecDegs": "-090.189278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8908907,
  "ParentCompanyName": "G.S. Robins and Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "G. Stephen Robins",
  "OperatorStr1": "126 Chouteau Avenue",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63102",
  "OperatorZipCodeExt": "2490",
  "RMPContact": "Charles Wisdom",
  "RMPTitle": "EHS Manager",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133063",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-07-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-07-10 00:00:00",
  "DeRegistrationEffectiveDate": "2005-07-31 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 38.61649,
  "FRS_Long": -90.18858,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 54902,
      "AltID": "Warehouse chemical storag",
      "FacilityID": 38175,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56158,
          "ProcessID": 54902,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72602,
          "ProcessID": 54902,
          "ChemicalID": 62,
          "Quantity": 13750.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 72603,
          "ProcessID": 54902,
          "ChemicalID": 57,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572602,
          "ProcessID": 54902,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572603,
          "ProcessID": 54902,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38175,
      "SummaryText": "G.S. ROBINS AND COMPANY\n\nG.S. Robins and Company is a St. Louis-based chemical distribution company with branch locations throughout the Midwest.  The branch located in St. Louis is located within a short distance of the Home Office.  G.S. Robins has specialized in serving the unique chemical needs of the Midwest.  The Lombard branch is involved with chemical storage and transportation.  Employees at the branch location work with the chemical containers, but do not open any of the containers.\n\nG.S. Robins and Company is a long time member of the National Association of Chemical Distributors (NACD).  Through the NACD, G.S. Robins has committed and pledged to constantly improve the management and handling of chemicals by following NACD?s Responsible Distribution Process (RDP).  RDP is a system that promotes continuous improvement in the health, safety, and environmental performance of all member companies.  G.S. Robins? implementation of the RDP includes a commitment to comply with relevant environmental, health, and safety regulations.  The senior management at G.S. Robins has formally accepted these guiding principles.  \n\nRDP includes guiding principles for all aspects of environmental, health, and safety.  These include: communication with emergency response officials, operating our facilities in a safe manner, responding to community concerns about chemicals, and to make health, safety and environment a priority.  In order to verify that G.S. Robins has complied with the guiding principles of RDP, the NACD conducts a third party verification.  The on-site verification is conducted by a third party.  The third party audits G.S. Robins every three years.\n\nThe primary activities at the Lombard branch consist of the following: drum and tote storage, material loading and unloading, and transportation.  The GSR-Lombard facility has two RMP chemicals at or above the threshold value.  These chemicals are:  chlorine and aqua ammonia.\n\nThe worst-case scenario for the GSR-Lo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38175,
      "SummaryText": "mbard facility involves chlorine.  Chlorine is stored on-site in three different types of containers.  These containers are: 2,000 lb cylinder, 1490 lb cylinder, and the 150 lb cylinder.  The worst-case scenario demonstrates all of the chlorine on-site being released at one time.  The maximum amount on-site is 13750 lbs.  The scenario would either be a fire or explosion causing a complete release of all material at one time.  The scenario has an offsite impact radius of 17 miles (estimated distance to Toxic Endpoint).  The modeling was done using the EPA COMP program.  The likelihood of this scenario taking place is remote.  The chlorine is stored in the facilities outside storage area.  G.S. Robins does not have the maximum amount of inventory on-site at all times.  \n\nThe alternative scenarios at GSR-Lombard consist of problems that are more likely to happen.  As a chemical distributor, we move a large quantity of chemicals each year.  During the moving or storage of a chemical, there is always the chance that a containers could begin leaking.  The leaking could be caused by several factors.  These factors include:  jostling during transportation, or just a leak.  G.S. Robins? employees are all trained on safe material handling and how to properly handle spills and leaks.  All chemicals reported are stored in the outdoor chemical storage area.  The following are the alternative scenarios at GSR-Lombard.  These alternative scenarios were completed using the EPA COMP modeling program.\n\nALTERNATIVE SCENARIOS FOR OUTDOOR CHEMICAL STORAGE\nThe outdoor chemical storage consists of different cylinders.  The cylinders are stored on-site and ship to outlying GSR branches or directly to customers.  The Alternative Scenarios represent incidents that are more likely to occur than the worst-case scenario.  G.S. Robins moves a large amount of material through the facility each year.  The types of incidents that are likely to occur are:  drum leaks, tote leaks, and leaks associate"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38175,
      "SummaryText": "d with tote valves.\nRelease of sulfur dioxide from a 150 lb cylinder/Leak in cylinder/Toxic Endpoint = 0.1 miles\nRelease of sulfur dioxide from a 2000 lb cylinder/Leak in cylinder/Toxic Endpoint = 0.2 miles \nRelease of chlorine from a 2000 lb cylinder/Leak in cylinder/Toxic Endpoint = 0.2 miles\nRelease of chlorine from a 150 lb cylinder/Leak in cylinder/Toxic Endpoint = 0.1 miles\nRelease of chlorine from a 1490 lb cylinder/Leak in cylinder/Toxic Endpoint = 0.2 miles\n\nFIVE YEAR ACCIDENT HISTORY\nG.S. Robins and Company-Lombard has NOT had a reportable accidental release in the past five years.\n\nEMERGENCY REPSONSE PROGRAM\nThe G.S. Robins and Company Emergency Action Plan consists of guidance for evacuation, fires, spills, tornadoes and bomb threats.  In addition, the plan contains information on emergency contacts, plant layouts, and emergency reporting requirements.\n\nCHANGES TO IMPROVE SAFETY\nG.S. Robins and Company is committed to improving safety and sustaining the environment.  This is a continuous process and we are constantly seeking input.  We audit our companies and have third parties audit periodically.  We constantly train our employees in all aspects of safety and will continue to do so."
    }
  ]
}