{
  "FacilityID": 3827,
  "FacilityName": "City of Sunbury Wastewater Treatment Facility",
  "FacilityStr1": "South Fourth Street/Fawn Lane",
  "FacilityStr2": null,
  "FacilityCity": "Sunbury",
  "FacilityState": "PA",
  "FacilityZipCode": "17801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42097",
  "LEPC": "Northumberland County LEPC",
  "FacilityLatDecDegs": "40.8525",
  "FacilityLongDecDegs": "-76.796167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mbrock@ptd.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Municipal Authority of the City",
  "OperatorStr1": "225 Market Street",
  "OperatorStr2": null,
  "OperatorCity": "Sunbury",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17801",
  "OperatorZipCodeExt": null,
  "RMPContact": "D. Michael Brockman",
  "RMPTitle": "Sewer Deparment Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000046924",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-01-01 00:00:00",
  "SafetyInspectionBy": "Northumberland EMA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-01-25 00:00:00",
  "DeRegistrationEffectiveDate": "2003-10-08 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.8525,
  "FRS_Long": -76.79617,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4436,
      "AltID": null,
      "FacilityID": 3827,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4538,
          "ProcessID": 4436,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4731,
          "ProcessID": 4436,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504731,
          "ProcessID": 4436,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3827,
      "SummaryText": "Facility Description - The Municipal Authority of the City of Sunbury owns and operates the Sunbury Wastewater Treatment Facility which was constructed in the 1970s.  The plant is currently designed to treat an average 3.5 million gallons per day (MGD) of wastewater from the City of Sunbury and portions of Upper Augusta Township.  The facility falls under EPA's Risk Management Plan Program 2 rules due to the use of chlorine in its disinfection process.   A maximum inventory of 10,000 pounds (lbs) is kept on site and up to 4,000 lbs (two one-ton containers) of chlorine are connected to the facility's wastewater treatment system at any one time.  Because this facility is owned by a Pennsylvania municipal authority, it does not fall under OSHA regulations and,  therefore, is not a Program 3 facility.\n\nAccidental Release Prevention and Emergency Response Policies -  A chlorine leak detection system is in place which sets off warning lights at the facility in the event of a detected leak.  The room is equipped with a fan which turns on when the light to the room is turned on.  There are wall-mounted vacuum regulators/chlorinators in place which contain the chlorine in the event of a leak in the lines after the regulator/chlorinator.  These regulators/chlorinators are inspected and maintained monthly through a service contract with an outside company.  Self-contained breathing apparatuses are available for the changing of the ton containers.  These apparatuses are also available in the event of a leak along with a \"B Kit\" which contains equipment necessary to stop a leak.  In the event of a leak, the 911 Center would be contacted through which coordination with Sunbury Hazmat, Fire, Police and Ambulance would be accomplished.  The facility is included in the Northumberland County Emergency Response Plan.  Employees are available 24 hours a day via pager including the Sewer Department Manager, the Chief Operator and the Plant Foreman.  Employees last received training in e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3827,
      "SummaryText": "arly 1998 regarding chlorine handling safety procedures.\n\nWorst-Case Release Scenario - The EPA's OCA guide was used to determine the worst-case chlorine release scenario.  An impact area with a 3.5 mile radius was determined for a release of 2,000 lbs of chlorine over ten minutes time in urban topography.  The only mitigation considered in this scenario was that the chlorine facilty is contained in an enclosure.  This scenario is estimated to impact an off-site residential population of 20,400 people. \n\nAlternate Release Scenario - For the alternate release scenario, the melting of a fusible plug due to exposure to excessive heat was considered.  This situation is more likely to occur than the worst case scenario.  Active mitigation in the form of emergency response procedures was considered as part of the scenario.  Passive mitigation was also a factor since the chlorine facilties are contained within an enclosure.  An impact area with a 0.3 mile radius was determined for a release of 690 lbs of chlorine over an hour in urban topography.  This scenario is estimated to impact an off-site residential population of 800 people.\n\nAccidental Release Program and Emergency Response Program - The wastewater treatment facility was designed and constructed in the 1970s according to the required standards of the Pennsylvania Department of Environmental Protection at that time .  These design standards help to minimize the risk of accidental release.  Additionally, the wastewater treatment facility follows the State Emergency Planning and Community Right-To-Know Rules as part of its accidental release and emergency response programs.  Coordination with local emergency reponse agencies (Hazmat, Fire, Police, Ambulance) is coordinated through the 911 system.  The facility is included in the Northumberland County Emergency Response Plan.\n\nFive Year Accident History - No accidents have occurred within the last five years.\n\nPlanned Changes - The Municipal Authority is in the planni"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3827,
      "SummaryText": "ng stages of an upgrade to the facility which would eliminate the use of chlorine on site and replace it with ultraviolet light disinfection.  This is projected to be accomplished by September 2002.  No equipment changes are planned before the aforementioned upgrade.  Implementation of the risk management plan will instigate a more efficient system of record keeping regarding the chlorine facilities.\n\nIn addition, the Authority is currently working on a written emergency response plan."
    }
  ]
}