{
  "FacilityID": 38298,
  "FacilityName": "Midwest Farmers Coop/Nebraska City",
  "FacilityStr1": "5811 G Road",
  "FacilityStr2": null,
  "FacilityCity": "Nebraska City",
  "FacilityState": "NE",
  "FacilityZipCode": "68410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31131",
  "LEPC": "Otoe LEPC",
  "FacilityLatDecDegs": "40.689750",
  "FacilityLongDecDegs": "-095.871972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 35089192,
  "ParentCompanyName": "Midwest Farmers Coop",
  "Company2Name": null,
  "CompanyDUNS": 35090570,
  "Company2DUNS": 0,
  "OperatorName": "Midwest Farmers Coop",
  "OperatorStr1": "304 S. 3rd",
  "OperatorStr2": null,
  "OperatorCity": "Elmwood",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68349",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Webb",
  "RMPTitle": "Compliance Director",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000073403",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-15 00:00:00",
  "SafetyInspectionBy": "Coop Mutual Insurance Co.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.68776,
  "FRS_Long": -95.85492,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55088,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 38298,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56353,
          "ProcessID": 55088,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 72861,
          "ProcessID": 55088,
          "ChemicalID": 56,
          "Quantity": 525300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 572861,
          "ProcessID": 55088,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38298,
      "SummaryText": "Midwest Farmers Coop\n5811 G Rd.\nNebraska City, NE  68410\n\nRisk Management Plan  - EXECUTIVE SUMMARY\n\nFacility Policy:\n\nThe management and employees operating each of our facilities are committed to the prevention of any accidental release of hazardous material transported or stored on our locations.  In the event an accidental release should occur, we are prepared to work with our Local Fire Company(s), Emergency Response Personnel, and other appropriate authorities deemed applicable depending on the specific incident, to best mitigate any release and to minimize the impact of the release to people and the environment.\n\nFacility Information:\n\nThis faiclity is in the business of selling anhydrous ammonia to farm customers as a form of nitrogen fertilizer.  The storage tanks, several anhydrous ammonia nurse tanks, risers for filling nurse tanks, electrical panels, lighting, and safety equipment are all parts of this facility's anhydrous ammonia operation.  The facility is manned during the season and is operational through normal business hours. \n\n\nWorst-case release scenario:\n\nThe \"worst-case release scenario\" is considered to be the release of the total contents of our largest Anhydrous Ammonia tank.  The maximum quantity released would be based on 85% tank capacity as limited by design standards.   The distance to the endpoint (point of dispersion to 200 ppm) is based on EPA's RMP -Comp Program (Version 1.06).  Possible public and\nenvironmental receptors within the area has been provided to the County LEPC (Local Emergency Planning Committee) for their consideration.   \n\nAlternative release scenario:\n\nThere has not been an actual release of Anhydrous Ammonia during the last 5-years at the site.  We believe the most likely release would be caused by a break in a transfer hose.  Transfer hoses are protected by manual,  self closing excess flow , and \"pull away\" valves so our alternative release scenario is based on the loss of contents from the largest hose used (off"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38298,
      "SummaryText": " loading transportation equipment).  The distance to the endpoint (point of dispersion to 200 ppm) is calculated per instructions by EPA guidance.\n\nAccidental Release Program:\n\nOur Anhydrous Ammonia accidental release program is based on guidelines found in the American National Standards Institute, Inc. (ANSI) standard K-61.1 \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia; and the U.S. Occupational Safety and Health Administration (OSHA) standard 29CFR 1910.111 \"Storage and Handling of Anhydrous Ammonia\".   We conduct annual employee training on the safe handling, transportation and distribution of Anhydrous\nAmmonia, and have installed safety equipment including, but not limited to: Excess flow valves, Shut-off valves,  Barriers to avoid damage by trucks or other vehicles, and Lock outs to prevent tampering when the site is unattended.   We also maintain routine contact with our local fire department and emergency response personnel; and have provided and/or participated in safety training exercises on Anhydrous Ammonia.  We have developed an emergency Action Plan for employees, customers, and visitor protection in event of fire, explosion, tornado, and other acts of God that initiates evacuation, emergency medical care, contacts for assistance, etc. for all areas of our company including the Anhydrous Ammonia facility included in this plan.  The primary emergency coordinator is listed in the Registration Section of this document.6    \n \nFive Year Accident History:\n\nThere has not been a release of Anhydrous Ammonia within the past five years that has caused any death, injuries, or significant property damage at the facility; nor to our knowledge have resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\nEmergency Response Program:\n\nThis facility is included in the written Community Emergency Response Plan as prepared by  the Local Emergency Planning Committee (LEPC), and the Nebra"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38298,
      "SummaryText": "ska Emergency Management Agency (NEMA) (former Nebraska State Civil Defense Agency).  We also include these materials in our own Emergency Action Plan in accordance with OSHA Standard 29CFR 1910.38.   We have provided State and Local authorities all Community Right-to-Know information requested as well as that required under SARA Title III  (EPCRA).  Our written employee safety programs include pre-emergency planning and employee training in accordance with OSHA standards, and are offered for review at any time by our Local Emergency Planning Committee (LEPC) to ensure they conform to the community plan(s).  We actively encourage participation in our Anhydrous Ammonia and\nPropane training programs by the local fire department(s), local emergency response team, community planners, etc. that may be expected to respond to an incident at our site.  \n\nPlanned changes to improve safety:\n\nSafety improvement is an on-going process at all of our facilities.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no additional specific recommendations for implementation at this time."
    }
  ]
}