{
  "FacilityID": 38325,
  "FacilityName": "Greeneville Water Treatment Plant",
  "FacilityStr1": "2815 Buckingham Road",
  "FacilityStr2": null,
  "FacilityCity": "Greeneville",
  "FacilityState": "TN",
  "FacilityZipCode": "37745",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47059",
  "LEPC": null,
  "FacilityLatDecDegs": "36.145528",
  "FacilityLongDecDegs": "-082.789917",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.greenevillewater.com",
  "FacilityEmailAddress": "dshelton@greenevillewater.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "Greeneville Water Commission",
  "Company2Name": null,
  "CompanyDUNS": 161759824,
  "Company2DUNS": null,
  "OperatorName": "Greeneville Water Commission",
  "OperatorStr1": "P.O. Box 368",
  "OperatorStr2": "516 North Main Street",
  "OperatorCity": "Greeneville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37744",
  "OperatorZipCodeExt": "0368",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047914",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-07-25 00:00:00",
  "DeRegistrationEffectiveDate": "2017-07-11 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 36.14529,
  "FRS_Long": -82.78996,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55126,
      "AltID": "Chlorine",
      "FacilityID": 38325,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 72908,
          "ProcessID": 55126,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56393,
          "ProcessID": 55126,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31681,
              "Process_NAICS_ID": 56393,
              "SafetyReviewDate": "2004-06-17 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-17 00:00:00",
              "TrainingReviewDate": "2004-06-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-17 00:00:00",
              "EquipmentInspectionDate": "2004-06-17 00:00:00",
              "EquipmentTested": "Post and Pre-Chlorine Feeders, Chlorine Alarms, Automatic Switch-Over Valves.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-06-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2003-08-14 00:00:00",
              "AuditCompletionDate": "2003-09-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-06-17 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-17 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-17 00:00:00",
              "ContractorSafetyEvalDate": "2004-06-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 46177,
                  "PreventionProgram3ID": 31681,
                  "ProcessChemicalID": 72908
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38325,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-17 00:00:00",
    "ERTrainingDate": "2004-06-17 00:00:00",
    "CoordinatingAgencyName": "911",
    "CoordinatingAgencyPhone": "4236388663",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 38325,
      "SummaryText": "lve and replace the lead washer and then recheck for leaks.  When there is no leakage detected the container can be placed into service.\n\nThe response plan at the Greeneville Water Treatment Plant consists of the following components.  The first is the Emergence Response Plan for the Water Treatment Plant which spells out what action(s) are to be taken in the event of a chlorine leak and who is to take the action(s).  If any leaks are detected we have a two man Emergency Response Team designated to respond.  The two members of the Emergency Response Team will perform any needed repairs while their back-up, which will consist of a two member team from the Greeneville Fire Department are on stand-by outside the chlorine room.  The Emergency Response Plans are included in the written response plan of the Town of Greeneville's Emergency Management Agency.  Training and drills for all Water Treatment Plant employees are arranged and provided by the Greeneville Water Commission to ensure that leaks will not occur, but in the event one should occur, employees would be able to respond to it, both efficiently and safely, to better protect the public.  This training consists of the proper fitting, use, care,and maintenance of respirators and protective clothing that might be needed during an actual chlorine leak.  This training and drills are both classroom and hands-on, and also invloves training in the use of any repair tools that might be needed to repair a faulty chlorine tank.  Public notifications and alert systems will be handled by the Emergency Management Agency."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 38325,
      "SummaryText": "The Greeneville Water Treatment Plant is located about one mile outside the corporate limits of the Town of Greeneville at 2815 Buckingham Road.  There are currently seven full time employees working three shifts at the plant.  The water treatment plant has an operator on duty at all times day ot night, seven days per week, 52 weeks per year.\n\nThe water source for the Town of Greeneville is the Nolichuckey River.  The pump house that contains the pumps that are used to transport the raw water to the Greeneville Water Treatment Plant is located at mile 57.2 on the Nolichuckey River.  Water enters the pump house pumpwell through sluice gates located in the wall of the pump house.  The sluice gates are the means by which the amount of water entering the pumpwell is regulated.  After entering the sluice gates the water goes through a traveling bar screen where trash and debris are removed.  Once the raw water is in the pumpwell, potassium permanganate is fed into the water to improve taste and control odors.  We are presently feeding approximately 3 pounds of potassium permanganate to treat one million gallons of raw water.\n\nThe pump house contains three pumps that are used to transport the raw water to the water treatment plant.  The pumping rates of these three pumps are, one at 8 million gallons per day (MGD), one at 10 MGD, and one at 12 MGD.  After leaving the pump(s) the water travels to the raw water resevoir located at Greeneville's Water Treatment Plant through either a 24 inch in diameter or a 30 inch in diameter pipe.\n\nThe raw water resevoir at the water treatment plant is a large, man-made, pond type structure that holds approximately 32 million gallons of water.  In addition to being used for the presettling of solids out of the water, it is also an emergency backup water source.  This means that, if we were to be notified that the river had a contaminant in it, the water treatment plant could, in order to prevent any contaminated water from entering our"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38325,
      "SummaryText": "system, shut off the pumping station at the river to allow the contaminant to clear-up or pass-by, while still being able to meet the water demands of the Town of Greeneville because of the four (4) day supply of water contained in the resevoir.\n\nThe resevoir has a structure in it known as the tower where water can be drawn from the resevoir from any of three different levels.  Water flows from the tower into a 24 inch line that allows the water to flow to the flash mix tanks.  In the flash mix tanks chlorine is added (approximately 200 lbs./7.5 MG of water) to prohibit bacteria growth, and polyaluminum chloride is added (approximately 115 lbs./MG of water) as a coagulant to help any solids in the water settle out at a faster rate.  The water then leaves the flash mix tanks by way of a 20 inch and a 30 inch pipe to the mixing basins.  In the mixing basins the chemicals, that were added in the flash mix tanks, are further mixed with the water by a baffling system.\n\nThe water then flows into the sedimentation basins where the polyaluminum chloride collests the dirt and sand and causes it to settle to the bottom.  These solids are flushed out of the sedimentation basins twice yearly and placed into one of two holding lagoons.  In the holding the solids are allowed to continue to settle.  Only one holding lagoon is used each year while the other is drained and the solids that have accumulated removed.  The water from the sedimentation basins flows over weirs into filters located inside the water treatment plant building.  These filters are designed to remove any sediment that did not settle out in the sedimentation basins.\n\nThere are ten filters in the water treatment building.  These filters contain anthracite coal, sand, filter gravel, and granulated activated carbon.  Each filter is designed to filter up to 2 million gallons of water daily.  Combined, this makes the total filtering ability of the water treatment plant approximately 20 MGD.\n\nOnce filtered, and as th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38325,
      "SummaryText": "e water flows into the tanks called clearwells, chlorine is once again added to destroy any pathogenic organisms, at a rate of approximately 140 lbs. / 7.5 MG of water.  In addition, approximately 6 pounds of fluoride is added per each million gallons of water to aid in the development of children's teeth, caustic soda is added for the adjustment of the water's pH at a rate of approximately 38 pounds per million gallons of water, and approximately 16 pounds of zinc orthophospate is added per million gallons of water to help prevent corrosion in the distribution system.  These clearwells are designed as holding tanks in order that the chlorine will have ample time to destroy bacteria which may be present in the water before allowing the water to enter the distribution system.\n\nFrom the clearwells, the finished water then enters into pumpwells.  Upon entering the pumpwells the water is considered safe for public consumption and is ready to enter the distribution system.  The water is pumped into the distribution system by using one, or any combination of, five different pumps that are located at the water treatment plant.  These pumps are rated as follows: two at 3 MGD, one at 6 MGD, one at 8 MGD, and one at 12 MGD.  These pumps, in addition to pumping water directly to the customers, pump water to storage tanks located in different areas of Greeneville.\n\nThese tanks, in addition to storage, are used to ensure that ample water pressure is provided to the customers and for fire protection.  The Greeneville Water Commission currently have seven water tanks with a combined storage capacity of 7 million gallons of water.  This represents a reserve of 7 million gallons that would be available, in the event of a main line break, to ensure that water service to the Greeneville area would not be interrupted.\n\nThere is instrumentation located at the water treatment plant to continuously monitor the water for pH levels, turbidity (clarity), chlorine residual, the flow enterin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38325,
      "SummaryText": "g the treatment plant as well as the flow leaving the treatment plant, and the water level in each of the seven water storage tanks.  This instrumentation is calibrated on a regular basis by authorized personnel to insure its accuracy.\n\nOne of the most important control measures to ensure that the water is being treated efficiently and effectively is the use of laboratory sampling.  Laboratory sampling is extensive, with laboratory tests being performed both on site at the water treatment plant and at qualified, state approved, private laboratories.  The operator on duty runs a turbidity (clarity) test on both the raw and finished water, a chlorine residual test on the sedimentation basin and the finished water, pH on the raw and finished water, and fluoride on the finished water every four hours, 24 hours per day.\n\nLaboratory tests are also performed for the following parameters as well: trihalomethanes (Thm's) which are by-products of chlorination caused by chlorine mixing with organic compounds in the water, synthetic organic chemicals (SOC's) to check for any man-made chemicals such as insecticides and pesticides, volatile organic chemicals (VOC's) to check for any man-made chemicals such as paint thinners and fuel products, radionnuclides to check for any by-products of the nuclear industry, lead and copper, sodium, and asbestos.  The frequency of these tests are determined by the State of Tennessee, Department of Environment and Conservation.\n\nEach month we collect and analyze samples from 40 different locations throughout the water treatment plant's distribution system.  These samples are tested for chlorine residual, iron, and total coliform.  Although the number of samples required to be caught each month in our distribution system is less, we continue to collect and analyze 40 each month to ensure the water quality throughout the entire distribution system.  We do this in order to have a better understanding of what is going on within the distribution syst"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38325,
      "SummaryText": "em at all times.\n\nThe minimum amount of chlorine residual in the water that is pumped into the distribution system is between 2.0 and 2.5 mg/l.  This is the minimum that is needed to maintain a chlorine residual of at least 0.2 mg/l at any location in the entire distribution system.  This amount is required by out current Public Water System Identification PWSID Permit.  When translated into pounds, approximately 340 pounds of chlorine is used per day to treat a daily flow of 7.5 million gallons of water.\n\nBecause of the chlorine cylinders which are used at the water treatment plant are located inside the building, we are considered to have passive mitigation.  This means that in the event of a chlorine leak, only approximately 55 percent of the chlorine that leaks out would be able to reach the outside atmosphere.\n\nThe worse-case scenerio for the Greeneville Water Treatment Plant would be to have a tank rupture and release 2,000 pounds of chlorine.  Because of the mitigation, being inside of an enclosure, only 55 percent or 1,100 pounds of chlorine would be released into the atmosphere.  If this kind of situation were to happen, the chlorine alarm in the chlorine room would sound and alert the operator on duty.  Once alerted the operator would immediately go to the chlorine room to visually confirm a leak.  If the operator determines that there is a chlorine leak he/she would follow the Greeneville Water Treatment Plant's Emergency Response Plan for the correct action(s) to take.\n\nIn the event of a worse-case release scenerio, everyone within a radius of 0.9 miles of the water treatment plant would need to be evacuated.  This action would be handled by the Emergency Management Agency for the Town of Greeneville and would mean that approximately 500 people would need to be evacuated.\n\nThe alternative release scenerio for a chlorine leak at the water treatment plant would mean a release of 200 pounds or less of chlorine.  Again, because of the mitigation, being ins"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38325,
      "SummaryText": "ide an enclosure, the amounbt of actual pounds of chlorine leaked to the outside atmosphere would be 110 pounds or less.  If this situation were to occur, the chlorine alarm in the chlorine room would sound and alert the operator on duty.  Once alerted the operator would immediately go to the chlorine room to visually confirm a chlorine leak.  If the operator determines that there is a chlorine leak, he/she would follow the Greeneville Water Treatment Plant's Emergency Response Plan for the correct action(s) to take.\n\nIn the event of an alternative release scenerio everyone within a radius of 0.2 miles of the water treatment plant would have to be evacuated.  This action would be handled by the Town of Greeneville's Emergency Management Agency and would mean that approximately 50 people would need to be evacuated.\n\nThe Greeneville Water Treatment Plant complies with the OSHA Process Safety Management rule which outlines the correct procedures to follow for any circumstance that may occur.  The Greeneville Water Treatment Plant has a written Emergency Response Plan as required by the Environmental Protection Agency and is included in the written plans of the Town of Greeneville's Emergency Management Agency.  The personnel at the Water Treatment Plant are trained in the latest and most up-to-date procedures concerning chlorine safety and handling.  This training is updated annually to guarantee that all employees know the correct action(s) to take in any situation that might arise.\n\nThere has not been a major chlorine gas leak at the Greeneville Water Treatment Plant during the last five years.  Occasionally, when hooking up a full container of chlorine, a lead washer will not seal properly and when the operator turns the valve on to check for leaks a small amount of chlorine gas will escape.  The amount is so small that it will not trigger the alarm and will not leave the confines of the chlorine room.  When this happens the operator will immediately shut off the va"
    }
  ]
}