{
  "FacilityID": 38453,
  "FacilityName": "A. B. Jewell Water Treatment Plant",
  "FacilityStr1": "18707 E. 21st Street",
  "FacilityStr2": null,
  "FacilityCity": "Tulsa",
  "FacilityState": "OK",
  "FacilityZipCode": "74134",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "36.135158",
  "FacilityLongDecDegs": "-095.765560",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cityoftulsa.org",
  "FacilityEmailAddress": "rbrownwood@ci.tulsa.ok.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Tulsa",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Tulsa",
  "OperatorStr1": "707 S. Houston",
  "OperatorStr2": "Room 405",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74127",
  "OperatorZipCodeExt": null,
  "RMPContact": "Phillip Demoret",
  "RMPTitle": "Superintendent, AB Jewell WTP",
  "FTE": 35,
  "OtherEPAFacilityID": "1021307",
  "EPAFacilityID": "100000036356",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-31 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-01-22 00:00:00",
  "ErrorReportDate": "2008-01-22 00:00:00",
  "ReceiptDate": "2004-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 36.1334,
  "FRS_Long": -95.76811,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55304,
      "AltID": "Chlorine Feed system",
      "FacilityID": 38453,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 56575,
          "ProcessID": 55304,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 73171,
          "ProcessID": 55304,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 573171,
          "ProcessID": 55304,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38453,
      "SummaryText": "\nExecutive Summary\n\n\n\nThe accident release prevention and emergency response policy: The City of Tulsa stores liquid \n\nchlorine in two 25-ton aboveground storage tanks at the AB Jewell Water Treatment Plant (WTP).  \n\nChlorine is provided for primary disinfection and filter cleansing. It is the City of Tulsa's policy to adhere \n\nto all applicable federal, state, and local laws.  If an emergency were to occur and the City of Tulsa was \n\nnot able to contain the release, the City will notify the Tulsa Fire Department HAZMAT Team and \n\nBrenntag Southwest, Inc. to request assistance in responding to the emergency.\n\n\n\nFacility description and the regulated substances handled: Chlorine is a toxic gas stored as a liquid \n\nunder pressure.  Chlorine vapors are irritating and corrosive to eyes, skin, and the respiratory tract and \n\nreact violently with easily oxidized materials.  Chlorine gas is heavier than air and will tend to travel \n\nalong the ground and collect in low areas and fill below ground areas such as pits and sumps.   \n\n\n\nThe chlorine storage tanks are located inside the chemical feed building on the east side of the AB Jewell \n\nWTP.  The bulk storage tanks were designed, constructed, tested, and marked in accordance with the \n\nASME Boiler and Pressure Vessel Code, Section VIII, Division 1, Rules for Construction of Pressure \n\nVessels.  Chlorine is fed to the process using evaporators and vacuum chlorinators.  In addition, the \n\nstorage room is equipped with an air collection system and packed tower scrubber to minimize the impact \n\nof a potential release.  The chlorine scrubber system is designed to withdraw air containing chlorine from \n\nthe building.  The contaminated air passes through a weak caustic solution to neutralize the chlorine \n\nbefore discharge to the atmosphere.  The scrubber system was designed in accordance with the Uniform \n\nFire Code and is large enough to treat the contents of one 25-ton storage tank.  The storage tanks, relief \n\nvalves, piping"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38453,
      "SummaryText": ", and appurtenances were designed in accordance with Chlorine Institute Standards.\n\n\n\nThe general accidental release prevention and chemical-specific prevention steps: \n\nThe AB Jewell WTP complies with EPA's accident prevention rule and all applicable state and local \n\nregulations.  The chlorine bulk storage tanks, scrubber system, piping, evaporators, and associated \n\nequipment are design, manufactured, installed, and maintained in accordance with applicable ASTM, \n\nChlorine Institute, and Uniform Fire Code Standards.  The City of Tulsa has completed a hazard review \n\nof the chlorine system and documented the findings.  Operations and maintenance procedures have been \n\ndeveloped and implemented.  All employees responsible for the operation of the chlorine system have \n\nbeen trained and a training certification is provided in the Risk Management Plan.  \n\n\n\nFive-year accident history:  The A.B. Jewell WTP has not experienced a chlorine release during the last \n\n5 years.\n\n\n\nThe Emergency Response Program: The City of Tulsa has prepared and implemented an Emergency \n\nResponse Plan (ERP) for chlorine releases.  The purpose of the ERP is to protect employees and the \n\npublic in the event of the accident release of chlorine from the facility.  City of Tulsa personnel will \n\ninitiate the emergency response plan and will provide the initial response to a chlorine emergency.  \n\nResponsible personnel have been trained in accordance with the City Health and Safety procedures and \n\nthe RMP in the use of personnel protective equipment and required emergency response equipment.  If \n\nAB Jewell personnel are unable to contain a chlorine release with an emergency repair kit, outside \n\nassistance will be requested.  The City of Tulsa Fire Department, HAZMAT Team, Police Department, \n\nand, Brenntag Southwest, Inc. (the chlorine supplier) will provide outside assistance.  The responsibilities \n\nof each outside agency are provided in the RMP.  \n\n\n\nThe 2004 revision includes updating th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38453,
      "SummaryText": "e Risk Management Plan from Program 2 to Program 3:\n\nThe Program 3 prevention plan includes the requirements of the OSHA Process Safety Management \n\n(PSM).  The goal of the PSM is to reduce the risk of injury or death to employees and the public from the \n\naccidental release of chlorine at the A.B. Jewell Water Treatment Plant.\n\n"
    }
  ]
}