{
  "FacilityID": 3847,
  "FacilityName": "PFRWTA TREATMENT PLANT",
  "FacilityStr1": "7797 Mason Street",
  "FacilityStr2": "PO BOX 2950",
  "FacilityCity": "Radford",
  "FacilityState": "VA",
  "FacilityZipCode": "24143",
  "Facility4DigitZipExt": "2950",
  "FacilityCountyFIPS": "51155",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "37.166389",
  "FacilityLongDecDegs": "-80.5625",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "cmaus@bellatlantic.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pepper's Ferry Regional Wastewater Treatment Auth.",
  "Company2Name": null,
  "CompanyDUNS": 181823766,
  "Company2DUNS": 0,
  "OperatorName": "Pepper's Ferry Regional WTA",
  "OperatorStr1": "7797 Mason Street",
  "OperatorStr2": "PO BOX 2950",
  "OperatorCity": "Radford",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24143",
  "OperatorZipCodeExt": "2950",
  "RMPContact": "Curtis Jones",
  "RMPTitle": "Chief Operator",
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056743",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-08-21 00:00:00",
  "DeRegistrationEffectiveDate": "2012-08-13 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.18306,
  "FRS_Long": -80.56194,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4460,
      "AltID": "waste water disinfection",
      "FacilityID": 3847,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4562,
          "ProcessID": 4460,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4755,
          "ProcessID": 4460,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504755,
          "ProcessID": 4460,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 4461,
      "AltID": "chlorine distruction",
      "FacilityID": 3847,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4563,
          "ProcessID": 4461,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4756,
          "ProcessID": 4461,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504756,
          "ProcessID": 4461,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3847,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nThe Pepper's Ferry Regional Wastewater Treatment Authority (PFRWTA) accidental release prevention policy involves a unified approach that integrates technologies, authority and local emergency services,  procedures, and management practices.  All applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to.  The emergency response policy involves the preparation of response plans which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.  This executing summary is for both the treatment plant and the New River Pump Station's RMP.  Separate RMP's will be filed to EPA.\n\nThe New River Pump Station has up to six (6), one (1)-ton cylinders of liquified gas in the chlorination room of the chlorination/emergency generator building.  Up to four (4) cylinders can be connected to gas manifolds.  An off-site analysis of \"worst case release\" evaluating the release of a full cylinder in ten (10) minutes using EPA's atmospheric dispersion model determines a release exposure area of 0.9 miles.  The are has an estimated population of 1,153 based on uniform census data analysis.  Areas effected by the worst case release include the down town section of East Radford, a small portion (non-resident buildings) of Radford University and a portion of the Community of Fairlawn.  The analysis assumes the release of the largest cylinder, in an urban area with a toxic end point of 0.0087 mg/L in accordance with Emergency Response Guideline as defined by the American Industrial Hygiene Association (AIHA).  This level is a level that individuals could experience one (1) hour of exposure without serious health effects or symptoms that could impair the ability to take protective actions.  Based on the nature of chlorine (3.2 mg/L, density), the terrain and population distribution, it is believed that a release would"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3847,
      "SummaryText": " contact less than the projected population and that population with potential exposure would have adequate time to be evacuated.  The plan development also includes an alternative analysis of a type of release that is more likely to occur.  The alternative analysis showed the area to be effected to be 1100 feet radius which would expose a portion of the Community of Fairlawn for a population estimate of 60 persons based on a house count.\n\nThe Treatment Plant Chlorination Building can have up to eight (8), one (1) ton cylinders of liquified chlorine gas in the chlorine cylinder room of the Chlorination Building.  This two room building is dedicated to the storage and handling of chlorine with the second room dedicated to the preparation of the aqueous chlorine solution used in the disinfection process.  Release analysis similars to that of the New River Pump Station were conducted.  The worst case analysis for area effected (0.9 - miles) was the same as with the New River Pump Station, but because of the lesser population density it is estimated (by house count) that less than 100 persons would be effected.  Areas effected by the worst case release would be RAAP staff village and a few houses in the State Route 114 and New River area.  Alternative analysis indicates that probable release  range (1100 feet) would extend beyond the plant site but would not effect any area population.\n\n\nThe Treatment Plant Sulfur Dioxide Storage Pad can have up to six (6), one (1) ton cylinders of liquified sulfur dioxide gas.  These cylinders are not contained in a mitigating building.  Thus, presenting a greater potential to disperse higher concentrations for a greater distance than the previously analyzed chlorine gas.  Worst case and alternative case analysis for the sulfur dioxide at a toxic gas end point of 0.0078 mg/L was 1.3 miles radius and 0.2 miles respectively.  Population effected for the worst case analysis based on census unified index is estimated at 743.  The area effe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3847,
      "SummaryText": "cted by the alternative analysis extends beyond the plant property, but does not effect any populated area.\n\nThe \"Worse Case\" and \"Alternative\" analysis for the plant and the New River Pump Station were conducted by Olver, Inc. and Draper Aden Assoc., respectively using EPA models and default conditions appropriate for the area.  Using the above noted toxic end point concentrations the models were conducted using stability factor \"F\" and wind speed of 1.5 meters/second for the worst case analysis and a stability factor \"D\" and a wind speed of 3 meters/second for the alternative analysis.  The engineers models used uniform population densities which have been modified where appropriate adjustment due to land use is believed to be appropriate.\n\nThe \"Alternative\" analysis considered leaks of  < - inch in diameter.  Probable leaks with the current vacuum feed system are believed to be those of minor nature involving a cracked valve, leaking/stripped connections, cracked pig-tails, broken gauge stems, etc.  Failures resulting in leaks greater than < - inch leaks but less than \"worst case\" would be of the nature of blown valves, temperature release plugs and major cylinder deterioration.  These are not believed to be very probable.  None of the systems have had a leak of reportable portion ( 10 pounds or greater) in their twelve year history.\n\nChlorine gas release potential is mitigated by having the cylinder stored indoors.  In addition, all gas handling systems are vacuum regulating systems after the common manifold so that the probable leak (alternative analysis) sources are at the cylinders/pig-tail connection areas.  Chlorine and sulfur dioxide systems are equipped with gas leak detection systems with alarms.  Alarms are not only actuated in the immediate area but also at the operations control room.\n\nPFRWTA general accident prevention plan is based on the key elements of:\no operator training\no preventative maintenance\no \"state of art\" process and safety equipment\no "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3847,
      "SummaryText": "safety inspections and hazard review analysis and audits\n\nIn addition to normal safety equipment and processes the toxic gas handling program includes:\no rescue air mask to be used when routinely changing cylinder connection\no self-contained breathing apparatus (SCBA) to be used in fixing minor connection leaks and removal of personnel\no cylinder repair kit and tools for LES use\n\nPFRWTA emergency response program for significant toxic gas leaks is basically to secure the area and depend on local emergency services to repair the leak and evacuate any areas deemed necessary.  This course of action pertains to most situations in which the emission of gas can not readily be stopped by valving and/or capping the gas source to readily stop the emission.  Equipment is on site and key personnel are basically trained to plug tanks, install secondary valves, etc. that may be necessary if Local Emergency Services can not respond.\n\nIn March 1998, USEPA - III staff inspected PFRWTA toxic gas handling facilities.  A number of recommendations were made.  These recommendations have been evaluated and implemented as deem appropriate."
    }
  ]
}