{
  "FacilityID": 3853,
  "FacilityName": "Pillsbury Bakeries and Foodservice",
  "FacilityStr1": "6800 McDivitt Drive",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93313",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.314722",
  "FacilityLongDecDegs": "-119.079444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 783435258,
  "ParentCompanyName": "Pillsbury Company",
  "Company2Name": null,
  "CompanyDUNS": 1326438,
  "Company2DUNS": 0,
  "OperatorName": "The Pillsbury Company",
  "OperatorStr1": "200 South Sixth Street",
  "OperatorStr2": null,
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55402",
  "OperatorZipCodeExt": "1464",
  "FTE": 84,
  "OtherEPAFacilityID": "CAL920915127",
  "EPAFacilityID": "100000057163",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-07 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.31454,
  "FRS_Long": -119.07868,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4469,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 3853,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 4764,
          "ProcessID": 4469,
          "ChemicalID": 56,
          "Quantity": 17700.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4571,
          "ProcessID": 4469,
          "NAICSCode": "311822",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1657,
              "Process_NAICS_ID": 4571,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1999-06-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "All vessels and pipelines",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-29 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia refrigeration system",
              "_chemicals": [
                {
                  "PrimaryKey": 1841,
                  "PreventionProgram3ID": 1657,
                  "ProcessChemicalID": 4764
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3853,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Bakersfield City Fire Department",
    "CoordinatingAgencyPhone": "6613263979",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3853,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nPillsbury Bakeries and Foodservice (Pillsbury) utilizes anhydrous ammonia in the refrigeration system at their Bakersfield production facility.  It is Pillsbury's policy to comply with all applicable governmental regulations.  Further, it is Pillsbury's objective to be a responsible citizen of the community in all of its business activities.\n\nPillsbury emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific training, operators and maintenance personnel receive training in accident prevention, safety, and first aid.  Additionally, an emergency action plan has been prepared for Pillsbury and a chain of command to respond to emergencies has been established.\n\nPillsbury has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the Process Safety Management (PSM) and 40 CFR Part 68 (RMP regulations).  At least every three years, Pillsbury will audit these programs and any findings of noncompliance will be documented and responded to and the deficiencies will be corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nPillsbury owns and operates a bakery products production facility located at 6800 McDivitt Drive in Bakersfield, California.  The plant began operation in July, 1991.  The refrigeration system was upgraded in 1992.\n\nThe ammonia based refrigeration system at Pillsbury provides cooling for the process equipment and finished product storage and handling areas.  The major components of the refrigeration system are the booster compressors, intercooler, high stage compressors, evaporative condensers, thermosyphon receiver, controlled pressure receiver, glycol chiller, process water chiller, evaporators, and a suction accumulator.  The system is also equipped with an air purger, oil drain pot, emergency ventilation system, and an emergenc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3853,
      "SummaryText": "y refrigeration control box which discharges to a scrubber tank. \n\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the entire refrigeration system can be \"pumped down\" to evacuate the ammonia from the system and store it in the controlled pressure receiver.  The maximum quantity of ammonia that can be stored in the controlled pressure receiver is approximately 17,700 pounds. \n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  This concentration has been established by the American Industrial Hygiene Association as the Emergency Response Planning Guideline Level 2 (ERPG-2). \n \nERPG-2 is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools to assist in emergency response planning.  The RMP regulations require the owner or operator of a stationary source to analyze the offsite impacts due to an accidental release of a regulated substance.  The offsite consequence analysis for a Program 3 process must analyze the worst-case release scenario and an alternative release scenario.  Since Pillsbury's ammonia-based refrigeration system is considered a Program 3 process, both release scenarios were evaluated in the offsite consequence analysis.\n\nThe offsite consequence analysis must include an estimate of the residential population within an area potentially affected by the accidental release scenario.  This area is defined as a circle with a radius equivalent to the distance the release would travel with concentrations at or above the endpoint.  The "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3853,
      "SummaryText": "circle also defines the area in which potential environmental receptors must be identified.\n\nThe worst case release is defined by the U.S. EPA as the total release of the contents of the single largest vessel or pipe within 10 minutes.  For liquefied gases stored under pressure, the entire contents of the vessel or pipe are assumed to be released as a vapor.  A total vapor release is highly unlikely.  However, this standardized worst case scenario was developed for emergency response agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the worst-case release scenario.  For Pillsbury, the alternative release scenario was selected based on the results of the Process Hazard Analyses (PHAs) for the ammonia-based refrigeration system.  A credible release event with a high discharge rate would potentially have the greatest offsite impact.  A leak from a valve packing was identified in the PHAs as having a medium probability of occurrence with a discharge rate high enough to cause an offsite impact, and therefore, was chosen as the alternative release scenario.    \n\nPillsbury has analyzed the offsite consequences of the worst-case and alternative release scenarios.  For the worst-case release scenario, the release of approximately 17,700 lbs. of ammonia over a 10 minute period within the engine room, the plume would travel 1.2 miles at concentrations at or above the endpoint.  Sensitive receptor information is provided in the RMP*Submit.  Using 1990 Census data, the population potentially affected within the worst-case release scenario circle is 13,000 people.  There are no environmental receptors within the worst case release scenario circle.\n\nIn the alternative release scenario, a packing leak from an isolation valve located outdoors on the roof was modeled as a release of liquefied ammonia stored under pressure.  For a release of 22 lb/min of anhydrous ammonia, the model calculated that the plume would tr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 3853,
      "SummaryText": "avel less than 0.1 mile at concentrations at or above the endpoint.  The alternative release scenario circle includes the nearby industrial facilities and roadways.\n\nNo residences are located within the 0.1 mile radius of the location of the alternative release at the Pillsbury facility.  As such, there would be no population impacts from the alternative release scenario.  There were also no sensitive receptors or environmental receptors within the alternative release scenario circle. \n\nThe ammonia refrigeration equipment is located within buildings except for a few pipelines and isolation valves located on the roof.  Even without consideration of the emergency ventilation and scrubbing systems, the potential impact from a release within a building would be greatly reduced according to EPA's Offsite Consequence Analysis Guidance.   If a release were to occur in the engine room, the emergency ventilation and scrubbing systems would further reduce any potential offsite impacts.  The modeling performed for the worst-case release scenario includes a mitigation factor which assumes that the release is within an enclosed space, in direct contact with the outside air.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been developed at Pillsbury to address the anhydrous ammonia system.  The PSM program includes the following chemical-specific prevention steps:\n\n    Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\n    An initial Process Hazard Analysis (PHA) was performed and will be updated and revalidated at least every five years.\n\n    Written operating procedures have been developed and implemented, and are reviewed at least annually.\n\n    Safe work practices, such as lockout/tagout, confined space entry, opening "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 3853,
      "SummaryText": "process equipment or piping, and control over entrance into the facility have been developed and implemented.\n\n    Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\n    Written mechanical integrity procedures have been established and implemented.\n\n    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n    Pre-startup safety reviews are performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\n    Audits are conducted at least every three years to evaluate compliance with the PSM and RMP regulations.\n\n    Incident investigation procedures have been established.\n\n    A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n    Hot work permits are issued for all hot work operations conducted on or near the ammonia system.\n\n    A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Pillsbury has assigned overall responsibility for the RMP elements to the Plant Manager.  The Plant Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nPillsbury has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nPillsbury has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response progr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 3853,
      "SummaryText": "am does not need to be developed for the facility since Pillsbury employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n\nPlanned Changes To Improve Safety\n\nBased on the PHA revalidation performed in June, 1999, no changes were recommended.\n\nThrough the accidental release prevention program, Pillsbury regularly evaluates the need for any changes to improve safety.  Currently, Pillsbury does not have any additional changes planned to improve safety.  \n\n        \n\n"
    }
  ]
}