{
  "FacilityID": 38609,
  "FacilityName": "Ventura Foods LLC - Albert Lea Division",
  "FacilityStr1": "919 East 14th Street",
  "FacilityStr2": null,
  "FacilityCity": "Albert Lea",
  "FacilityState": "MN",
  "FacilityZipCode": "56007",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27047",
  "LEPC": "Albert Lea Fire Department",
  "FacilityLatDecDegs": "43.625278",
  "FacilityLongDecDegs": "-093.351944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.venturafoods.com",
  "FacilityEmailAddress": "cbrown@venturafoods.com",
  "FacilityDUNS": 956044879,
  "ParentCompanyName": "Ventura Foods LLC",
  "Company2Name": null,
  "CompanyDUNS": 956044879,
  "Company2DUNS": null,
  "OperatorName": "Ventura Foods LLC",
  "OperatorStr1": "919 East 14th Street",
  "OperatorStr2": null,
  "OperatorCity": "Albert Lea",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56007",
  "OperatorZipCodeExt": null,
  "FTE": 185,
  "OtherEPAFacilityID": "MNG250024",
  "EPAFacilityID": "100000185266",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-12-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 43.62349,
  "FRS_Long": -93.35129,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55569,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 38609,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 73492,
          "ProcessID": 55569,
          "ChemicalID": 56,
          "Quantity": 18500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 56841,
          "ProcessID": 55569,
          "NAICSCode": "311222",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 56842,
          "ProcessID": 55569,
          "NAICSCode": "311223",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 56843,
          "ProcessID": 55569,
          "NAICSCode": "311225",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 31969,
              "Process_NAICS_ID": 56843,
              "SafetyReviewDate": "2004-06-17 00:00:00",
              "PHA_Date": "2003-10-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-10-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "NA",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "NA",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "NA",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "change in required information by EPA",
              "OpProceduresReviewDate": "2003-09-09 00:00:00",
              "TrainingReviewDate": "2003-09-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "NA",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "walk through and walk down of process.",
              "MaintenanceReviewDate": "2003-09-09 00:00:00",
              "EquipmentInspectionDate": "2003-09-09 00:00:00",
              "EquipmentTested": "condensor/piping",
              "ChangeMgmtDate": "2003-09-09 00:00:00",
              "ChangeMgmtReviewDate": "2003-10-07 00:00:00",
              "PreStartupReviewDate": "2003-09-09 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-09-09 00:00:00",
              "HotWorkPermitReviewDate": "2003-10-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-10-04 00:00:00",
              "ContractorSafetyEvalDate": "2003-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 46594,
                  "PreventionProgram3ID": 31969,
                  "ProcessChemicalID": 73492
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 56844,
          "ProcessID": 55569,
          "NAICSCode": "311613",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38609,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-02-26 00:00:00",
    "ERTrainingDate": "2003-10-11 00:00:00",
    "CoordinatingAgencyName": "Albert Lea Fire Department",
    "CoordinatingAgencyPhone": "5073374340",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 38609,
      "SummaryText": "10,000 lbs of ammonia.  With the planned expansion of facility and installation of new refrigeration equipment, Ventura estimates that they will increase ammonia inventory to a level below the maximum system capacity of 18,500 pounds.  \n\nSynopsis of Worst-Case and Alternate Release Scenarios\nThe Risk Management rule requires a hazard analysis for worst-case and alternate release scenarios for regulated substances present in threshold quantities at the site.  For this facility Ammonia Anhydrous is the only regulated hazardous substance.  \n\nThe Risk Management rule requires that the largest amount in a single vessel be considered the release quantity for the worst-case event, unless smaller quantities handled at different conditions result in a greater distance to the regulated endpoint of consideration.  This is a requirement of the rule regardless of whether the event is likely, or, could even reasonably occur.   It should be emphasized that the possibility of such an event as described by the worst-case scenario is extremely low. \n \nAlternate scenarios, for each regulated toxic and flammable substance, which are more likely events, must also be presented.  More likely release events tend to concentrate in areas such as failure of smaller valves, lines, and hoses. Significantly lower quantities are involved and operator intervention would tend to mitigate and limit the consequences of such failures.\n\nWorst-Case Toxic Release - Ammonia\nThe largest vessel, located indoors, has a maximum capacity of  8,710 pounds.  The worst case scenario assumes that this entire amount would release in 10 minutes, as a result of a catastrophic failure of the tank.  The worst-case scenario would reach offsite endpoints, including public and environmental receptors.\n\nAlternate Release Toxics - Ammonia\nThis alternate release scenario consists of a pipe leak, which discharges 1,300 pounds of ammonia in 60 minutes prior to the operator stopping the leak.  This scenario would reach offsite"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38609,
      "SummaryText": "endpoints and would affect public and environmental receptors.\n\nPrevention Program\nThe ammonia refrigeration at this plant is currently subject to the OSHA Process Safety Management rule, 29 CFR 1910.119.  The facility falls under the EPA Risk Management Rule, these are Program Level 3 processes with the completion of the facility expansion.  The OSHA Process Safety Management Programs are in place for this process, which constitute the Program Level 3 Prevention Programs,  \n\nThe OSHA Process Safety Management /EPA Prevention Program consists of facility management policies and procedures which promotes and recognizes process safety and the prevention of accidents in plants that handle, use, store, and process hazardous chemical materials. \n\nThe plant adheres to the requirements of Process Safety Management and has written policies and procedures addressing all aspects of Process Safety Management and EPA Prevention Programs.  \n\nThe Prevention Programs consist of several elements and policies listed below:\n\n1.\tEmployee Participation\t\t8.   Mechanical Integrity\n2.\tProcess Safety Information\t9.   Hot Work Permits\n3.\tProcess Hazard Analysis\t10. Management of Change\n4.\tOperating Procedures\t\t11. Incident Investigation\n5.\tOperator Training \t\t \t12. Emergency Planning\t\n6.\tContractors\t\t\t\t13. Compliance Audits\n7.\tPre-startup Safety Review\n\nEmergency Response Plan\nThe Ventura Foods plant has a written Emergency Response Program as required by the Risk Management rule and other Environmental Protection Agency and OSHA rules.  This Plan is coordinated with the local community response plan and is available to those responding agencies.  Emergency planning and Community Right-To-Know information as required under SARA Title III has been provided to the State Emergency Response Commission, Local Emergency Planning Committee, and other appropriate agencies such as the local fire department.  The facility is an active participant in the local emergency responders and interacts with v"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38609,
      "SummaryText": "arious local agencies in its emergency planning such as fire departments, law enforcement agencies, and hospitals.  Employees receive annual training in the response plan and also receive various safety training, both in general, and in the competencies relative to their required roles in the plan.  Periodically, the plan is practiced in a table top, classroom type setting, and also drilled in mock emergencies including participation by outside responding agencies.\n\n5-Year Accident History\nThe Risk Management rule requires inclusion of the five-year accident history of the facility for all accidental releases that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  \nThe Ventura Albert Lea facility has had no incidents in the past five years.\n\nPlanned Changes for Safety Improvements\nSafety improvements are a continual and ongoing process at the plant, facilitated by the EPA Prevention Program/OSHA Process Safety Management Program.  Formal process hazard analysis is conducted at least every five years, but review is constant through management of change procedures, operator training, incident investigation, and mechanical integrity programs.  Ventura Foods has contracted with third party contractors to implement Process Safety Management and Risk Management Programs.  As a result, changes relevant to safety occur continuously, as needs are identified through these procedures and policies."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 38609,
      "SummaryText": "Risk Management Plan\nExecutive Summary\n\nVentura Foods LLC\nAlbert Lea, MN\n\nVentura Foods, LLC processing plant is located on the south end of community, in the City of Albert Lea, MN. The plant processes vegetable and animal oils that provide consumers with high-quality margarine, spreads, cooking oil and lard products. This facility is not currently subject to the Environmental Protection Agency¿s Risk Management Program rules under the Clean Air Act Amendments of 1990.  However, Ventura is near completion of a planned 80,000 sq ft addition they will exceed the threshold RQ for ammonia.\n\nThe Risk Management Program rules require facilities handling threshold amounts of certain chemical substances to submit Risk Management Plans for the prevention of accidental releases of these substances.  The plan submission to include hazard assessments defining possible off-site impacts of certain regulated substance release scenarios, a five-year accident history, description of the facilities accidental release prevention program, and an emergency response program. \n\nThe following is the Executive Summary of the Risk Management Plan for Ventura Foods, LLC, Albert Lea, MN.\n\nFacility Snapshot\nThis facility, was constructed in 1965, was owned and operated by Miami Margarine and Holsum Foods prior to Ventura¿s acquisition of the plant in 1997.  The plant produces over 350 million pounds of product annually.\n\nImpact on the community\n·\tVentura employs 185 area residents at a combined annual salary of approximately $4 million.\n·\tVentura supports Albert Lea and the state of Minnesota with state and local taxes.\n·\tThe facility purchases more than $1,000,000 million of local services; electricity, natural gas, water, wastewater treatment, and other miscellaneous items.\n\nEmployee snapshot\nVentura employees are involved in community activities.  The facility supports United Way and other community support organizations.   \n\nAccidental Release Prevention and Emergency Response Policy\nThe m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38609,
      "SummaryText": "anagement and employees of this facility are committed to the prevention of any accidental releases of hazardous and regulated substances and to minimize the effects of any such releases that may occur.  Prevention of accidental releases is critical to the safe operation of this plant, to the safety of its employees, and to the safety of the general public.\n\nTo achieve its goals of accident and accidental release prevention, the facility is committed to the following:\n·\tA knowledgeable and highly trained and motivated employee group\n·\tA well designed facility that is maintained and operated in a superior manner\n·\tImprovements that enhance safety and accident prevention where appropriate\n·\tExcellence in safety programs and practices; a superior safety and accident record\n·\tPreparation and training for emergency response and mitigation\n\nThe plant has a written Emergency Response Plan in effect.  Ventura Foods, LLC. is committed to responding to and mitigating any accidental releases to minimize the impact to employees, the community, and environment.  The response plan is coordinated with the Emergency Response Agencies and the plant has interacted with possible responding agencies for many years regarding the plan and activities at the plant.  Employees are trained in the implementation of the plan and in possible response activities that could be required in the event of an emergency.  The plant has developed a Hazmat Team made up of plant employees who are trained to respond in the event of an ammonia release on site.\n\nStationary Source and Regulated Substances\nAmmonia refrigeration is covered by the EPA Risk Management Plan rule.\n\nThe facility currently has in excess of 10,000 pounds of ammonia on site which is used as a refrigerant in its ammonia refrigeration system.  This is a closed, contained system, in which the ammonia is re-circulated to refrigerate processing and storage areas in the plant.  The threshold limit for regulatory implementation of program is"
    }
  ]
}