{
  "FacilityID": 3861,
  "FacilityName": "James De Young Generating Station",
  "FacilityStr1": "64 Pine Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Holland",
  "FacilityState": "MI",
  "FacilityZipCode": "49423",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26139",
  "LEPC": "Ottawa County LEPC",
  "FacilityLatDecDegs": "42.789167",
  "FacilityLongDecDegs": "-86.113056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Holland, Holland Board of Public Works",
  "Company2Name": null,
  "CompanyDUNS": 197965643,
  "Company2DUNS": 0,
  "OperatorName": "Holland Board of Public Works",
  "OperatorStr1": "625 Hastings Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Holland",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49423",
  "OperatorZipCodeExt": null,
  "FTE": 41,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047362",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-07-01 00:00:00",
  "DeRegistrationEffectiveDate": "2001-11-01 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.79691,
  "FRS_Long": -86.11221,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4477,
      "AltID": "Chlorination of water",
      "FacilityID": 3861,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 4772,
          "ProcessID": 4477,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4579,
          "ProcessID": 4477,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1661,
              "Process_NAICS_ID": 4579,
              "SafetyReviewDate": "1999-03-17 00:00:00",
              "PHA_Date": "1996-10-21 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Additional inspection requirements, training, and process specific procedures",
              "OpProceduresReviewDate": "1997-02-21 00:00:00",
              "TrainingReviewDate": "1997-11-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-02-21 00:00:00",
              "EquipmentInspectionDate": "1999-06-05 00:00:00",
              "EquipmentTested": "piping systems, pressurized vessels, controls, vent, regulators, scale, crane",
              "ChangeMgmtDate": "1996-10-21 00:00:00",
              "ChangeMgmtReviewDate": "1996-10-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1996-10-21 00:00:00",
              "AuditCompletionDate": "1999-03-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-17 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "Chlorine Release Prevention Program for the\nJames De Young Generating Station\n\nThe Holland Board of Public Works (HBPW), James De Young Generating Station (JDY Plant) Chlorine Release Prevention Program specifically deals with preventing a release from the chlorination room and/or process of chlorination of the plant's intake water.\n\nThe JDY Plant has implemented a Process Safety Management Program for the handling of chlorine.  The Process Safety Management Program was a team effort of plant personnel and included a detailed review of the entire system.  Each piece of equipment and procedure was evaluated for potential failure, the consequences of a failure, and preventative measures taken to reduce the potential.  A preventative maintenance program was developed and put in place to maintain the integrity of the system.  There are basically three key components to the prevention program: procedures, inspection, and training.  \n\nProcedures:\n\nSite specific procedures have been developed on most every aspect of the chlorination system.  The procedures specifically list every step or act that an individual is required to complete when dealing with the chlorine system.   The procedures are an excellent means of release prevention because they reduce the amount of human error by providing a step by step guide.  For example, one such procedure requires that two individuals complete the changing of chlorine tanks.  Such a program reduces human errors, because it acts as a check and balance type system.\n\nInspection:\n\nInspection is another key component to the release prevention program.  A comprehensive inspection of the chlorine system is completed on a daily basis.  The comprehensive inspection is designed to discover problems before they occur by looking specifically at items like seals, valves, pipe fittings and other key components of the system.  \n\nMore frequent inspections are often completed as operators make their daily rounds.  These inspections tend to be brief in nature, and specifically check for operation of the chlorine release monitor system and for anything out of the ordinary.\n\nTraining:\n\nTraining is an important part of the release prevention program, because the more informed an individual is, the more careful, conscious, and responsible the individual is.    In depth training on the chlorine system is required for any employee who becomes involved in the operation or maintenance of the system.  The individuals are trained in proper procedures, conducting inspections, handling techniques, and the dangers of chlorine.  Trainees are required to a pass a written exam.  In addition, operators are also trained in emergency response procedures, and HAZWOPER response.  \n\nAnother part of the training program that begins sufficiently before an individual is exposed to the chlorine system is a preliminary and continual screening.  The HBPW completes background checks on all prospective employees and requires random drug testing on a continual basis.\n\nBesides procedures, inspection, and training the JDY Plant has worked and continues to work very closely with the Local Emergency Planning Committee (LEPC) and other emergency response organizations to develop detailed emergency response plans. The emergency response plans are a good means of release prevention, because they require management and staff to focus on possible sources of release and how to prevent or eliminate them in the future.",
              "_chemicals": [
                {
                  "PrimaryKey": 1845,
                  "PreventionProgram3ID": 1661,
                  "ProcessChemicalID": 4772
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 3861,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-03-30 00:00:00",
    "ERTrainingDate": "1998-02-17 00:00:00",
    "CoordinatingAgencyName": "Ottawa Co. Emergency Services/LEPC",
    "CoordinatingAgencyPhone": "6167384050",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3861,
      "SummaryText": "Risk Management Plan Executive Summary for the\nJames De Young Generating Station\n\nThe Holland Board of Public Works (HBPW), James De Young Generating Station (JDY Plant) is made up of 3 coal-fired steam generating units capable of producing up to 60 MW of electricity for residential, industrial, and commercial customers in the Holland area.  The plant, located at 64 Pine Avenue, is just within the city limits and is located on Lake Macatawa.\n\nThe use of chemicals is relatively limited at the JDY Plant, however liquefied chlorine gas is utilized to chlorinate water entering the plant so that bacteria and other biological fouling agents do not build up within the plant's critical cooling systems.  The chlorine plays an important role in keeping the plant in an efficient and effective operating condition.  \n\nChlorine gas is a required submission of 40 CFR Part 68 - Chemical Accident Prevention Provisions (Risk Management Plan) because of its' potential health threat if released into the atmosphere under uncontrolled conditions.  The JDY Plant is a closed system, free from exposure to the atmosphere under normal conditions.  Chlorine gas is handled in 1 ton steel pressurized cylinders, which is fed under a vacuum to a chlorinator that generates a nonhazardous solution with the gas and intake water.  Because the system is closed, under vacuum, and is not open to the atmosphere the release scenarios are minimal.  The release scenarios developed were based on the puncture or intentional release of the steel 1 ton chlorine cylinder (worst case scenario), and a leak around an attached pipe or apparatus (alternate case scenario).   \n\nThe worst case scenario of a puncture to the steel cylinder is very unlikely, because the outer walls of the cylinder are approximately 1 inch thick steel, and a release would require that an individual intentionally puncture the cylinder.  An individual could also intentionally remove the plugs on the cylinder, which would create the same worst "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3861,
      "SummaryText": "case scenario.  To avoid such a situation the HBPW completes background checks on all prospective employees, requires random drug testing on a continual basis, and has training and supervisory programs and procedures to foresee and prevent problems of this nature.\n\nThe alternate case scenario of a leak around an attached pipe or apparatus is a more conceivable scenario, but training programs and operational procedures have been developed to prevent this type of scenario.   One such procedure requires that two individuals complete the changing of chlorine tanks.  Such a program reduces human errors, because it acts as a check and balance type system.  Operators are also trained in the proper handling techniques and the dangers of chlorine so that they are consciously aware of their responsibilities. \n\nThe threat of a chlorine release is also minimized by the use of chlorine gas monitors that sound immediately if a leak occurs.  Should this occur, operators, trained in proper handling techniques, emergency response measures, and in HAZWOPER response techniques are fully prepared to handle any potential release. \n\nThe JDY Plant has taken significant steps to develop an accidental release prevention and emergency response program, as well as training and procedure guidelines for chlorine storage and use.  The JDY Plant has implemented a Process Safety Management Program for the handling of chlorine.  The Process Safety Management Program was a team effort of plant personnel and included a detailed review of the entire system.  Each piece of equipment and procedure was evaluated for potential failure, the consequences of a failure, and preventative measures taken to reduce the potential.  A preventative maintenance program was put in place to maintain the integrity of the system.  Training on the chlorine system is required for any employee who becomes involved in the operation or maintenance of the system.\n\nIn addition, the JDY Plant has worked and continues to work ver"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3861,
      "SummaryText": "y closely with the Local Emergency Planning Committee (LEPC) and other emergency response organizations to develop detailed emergency response plans, should a release occur.  Both the LEPC and the JDY Plant have written two coinciding emergency response manuals to deal with emergency situations.  In addition, on an annual basis the JDY Plant submits the updated amount of chemicals, including chlorine, located at the plant so that the LEPC's records are kept up to date.\n\nThe Holland Board of Public Works and its employees at the James De Young Generating Station are very proud to say that no accidents or releases of chlorine have ever occurred.  However, the HBPW and the JDY Plant are consciously aware of the possibility of a release to the atmosphere.  To mitigate this threat the JDY Plant is currently in the engineering stages of substituting liquid bleach for chlorine gas. The liquid bleach is safer because it remains in liquid state under normal conditions and represents a significantly less widespread hazard to human health and the environment.  The substitution is expected to be completed by the fall of 1999.  All use of chlorine gas would be eliminated at that time."
    }
  ]
}