{
  "FacilityID": 38762,
  "FacilityName": "City of Toccoa Water Treatment Facility",
  "FacilityStr1": "Highway 17, Alternate North",
  "FacilityStr2": null,
  "FacilityCity": "Toccoa",
  "FacilityState": "GA",
  "FacilityZipCode": "30577",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13257",
  "LEPC": "Stephens Co Emer Mngmnt Agncy",
  "FacilityLatDecDegs": "34.610139",
  "FacilityLongDecDegs": "-083.356472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "PG",
  "FacilityURL": "cityoftoccoa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Toccoa Utilities Department",
  "OperatorStr1": "Muncipal Building",
  "OperatorStr2": "203 N. Alexander Street",
  "OperatorCity": "Toccoa",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30577",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155538",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-11-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 34.610236,
  "FRS_Long": -83.356358,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55803,
      "AltID": "Liquid chlorine storage",
      "FacilityID": 38762,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 73829,
          "ProcessID": 55803,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57087,
          "ProcessID": 55803,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21256,
              "Process_NAICS_ID": 57087,
              "SafetyReviewDate": "1999-04-06 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "NEC 1996, NFPA 70, The Chlorine Institute, AWWA, NFPA 820, Material Handling Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-17 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-10-06 00:00:00",
              "TrainingReviewDate": "2003-11-12 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-10-07 00:00:00",
              "EquipmentInspectionDate": "2004-01-06 00:00:00",
              "EquipmentTested": "chlorinators",
              "ComplianceAuditDate": "2002-08-02 00:00:00",
              "AuditCompletionDate": "2002-08-02 00:00:00",
              "IncidentInvestigationDate": "2003-10-02 00:00:00",
              "InvestigationChangeDate": "2003-10-02 00:00:00",
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22214,
                  "PreventionProgram2ID": 21256,
                  "ProcessChemicalID": 73829
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38762,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-15 00:00:00",
    "ERTrainingDate": "2001-04-09 00:00:00",
    "CoordinatingAgencyName": "Stephens Co Emer Mngmnt Agncy",
    "CoordinatingAgencyPhone": "7068868711",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38762,
      "SummaryText": "Executive Summary for City of Toccoa Water Treatment Facility\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at the City of Toccoa Water and Wastewater System are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our water treatment facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nChlorine is the only regulated substance present at our facility.  Chlorine is used for disinfection purposes in the treatment of potable water.  Chlorine is stored as a liquified gas under pressure.  The vapor pressure of stored chlorine is 6.8 atmospheres (99.89 psi - pounds per square inch).  Chlorine gas is non-flammable, but it is a strong oxidizer that can support combustion of other materials.  Chlorine is a toxic gas that is considered by the National Institute of Occupational Safety and Health (NIOSH) to be immediately dangerous to life and health at concentrations exceeding 10 parts per million (ppm).\n\nThe maximum inventory of chlorine at our facility is 18,000 lbs. (pounds) or nine 2,000-lb. cylinders.  The largest single vessel of chlorine at our facility is a 2,000-lb. cylinder.  The chlorine cylinders are equipped with a fusible plug that is designed to fail if the temperature of the cylinder reaches approximately 158 ( F (Fahrenheit).  The purpose of the fusible plug is to prevent cylinder failure in the event of an extended, hot fire by allowing a controlled release of the cylinder contents.  All of the chlorine cylinders in our facility are located in the chlorine room, which is of fire-proof construction in accordance with the Chlorine Institute specification for chlorine storage facilitie"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38762,
      "SummaryText": "s.\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our water treatment facility.\n\nProcess Safety Information\nThe staff of the water treatment facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur water treatment facility personnel conduct studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is through the use of checklists.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years and whenever a major change is made to the covered process.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, the water treatment facility maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nThe water treatment facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least annually and more frequently as needed.\n\nMechanical Integrity\nThe water tr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38762,
      "SummaryText": "eatment facility carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; piping systems, ventilation systems, emergency shutdown systems, and controls.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the water treatment facility to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of, and offered training to deal with, the modification.\n\nPre-start Up Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the water treatment facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe water treatment facility personnel conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe water treatment facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nThe City of Tocc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38762,
      "SummaryText": "oa  truly believes that process safety management and accident prevention is a team effort.  Water treatment facility employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our City hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, an evaluation of safety performance of the contractor is carried out.  The City of Toccoa has a  policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n4.    Five-year Accident History\nThe water treatment facility has had an excellent record of preventing accidental releases over the last 5 years. There have been no accidental releases during this period.\n\n\n5.    Emergency Response Plan\nThe water treatment facility carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n6.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  I"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38762,
      "SummaryText": "nstallation of chlorine leak detectors, posting of new warning signs and increased security measures are some of the major steps we want to take to improve safety at our facility.  All currently recommended changes are expected to be implemented by January 1, 2000.\n\n7.    Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nSignature:\nTitle:\nDate signed:\n\n2113-051/cl2program/execsum"
    }
  ]
}