{
  "FacilityID": 38798,
  "FacilityName": "Central Wastewater Treatment Plant",
  "FacilityStr1": "2443 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Baton Rouge",
  "FacilityState": "LA",
  "FacilityZipCode": "70802",
  "Facility4DigitZipExt": "8074",
  "FacilityCountyFIPS": "22033",
  "LEPC": "East Baton Rouge LEPC",
  "FacilityLatDecDegs": "30.424444",
  "FacilityLongDecDegs": "-091.190833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Baton Rouge - East Baton Rouge Parish",
  "Company2Name": null,
  "CompanyDUNS": 71948301,
  "Company2DUNS": 0,
  "OperatorName": "City of Baton Rouge - EBR Parish",
  "OperatorStr1": "2443 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Baton Rouge",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70802",
  "OperatorZipCodeExt": "8074",
  "FTE": 63,
  "OtherEPAFacilityID": "20122",
  "EPAFacilityID": "100000045355",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2018-01-16 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 30.42443,
  "FRS_Long": -91.19226,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 55844,
      "AltID": "Chlorination System",
      "FacilityID": 38798,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 73879,
          "ProcessID": 55844,
          "ChemicalID": 62,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 73880,
          "ProcessID": 55844,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57134,
          "ProcessID": 55844,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21270,
              "Process_NAICS_ID": 57134,
              "SafetyReviewDate": "2000-08-03 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute Recommendations and Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-11 00:00:00",
              "ChangeCompletionDate": "2006-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Door alarms, CC TV cameras, eye wash/safety shower station alarms, emergency alarms (visual & Auditory)",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Revalidate Hazard Review 6/11/04",
              "OpProceduresReviewDate": "2000-08-03 00:00:00",
              "TrainingReviewDate": "2002-11-19 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-04-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-04 00:00:00",
              "EquipmentTested": "Cl2 and SO2 Mechanical Integrity",
              "ComplianceAuditDate": "2003-05-31 00:00:00",
              "AuditCompletionDate": "2006-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2001-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Prevention Program at the Central Wastewater Treatment Plant (CWWTP) consists of policies, procedures and Hazard and Operability Studies designed to operate, modify and maintain the CWWTP in a site status consistent with accepted engineering and safety standards and personnel proficiency.  The procedures included in this program consist of the following: Process safety information, process hazard analysis, personnel training, operating procedures, mechanical integrity procedures, incident investigations, management of change and pre-start up reviews.",
              "_chemicals": [
                {
                  "PrimaryKey": 22228,
                  "PreventionProgram2ID": 21270,
                  "ProcessChemicalID": 73879
                },
                {
                  "PrimaryKey": 22229,
                  "PreventionProgram2ID": 21270,
                  "ProcessChemicalID": 73880
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38798,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2001-03-31 00:00:00",
    "ERTrainingDate": "2003-04-15 00:00:00",
    "CoordinatingAgencyName": "Baton Rouge Fire Dept/HazMat",
    "CoordinatingAgencyPhone": "2253894617",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38798,
      "SummaryText": "See Attached File\nEXECUTIVE SUMMARY\n\nCity of Baton Rouge\n\nCentral Wastewater Treatment Plant\n\n\n\nLADEQ Facility Number 20122\n\n\n\nUSEPA Facility Identifier Number 1000 0004 5355\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nThe City of Baton Rouge continues its commitment to maintaining full compliance with all federal, state and local regulations.  Pursuant to this commitment, the City makes every effort to operate the wastewater treatment facilities in a safe manner, in accordance with all applicable rules and regulations and according to established good engineering and management principles.  \n\n\n\nThe Baton Rouge Central Wastewater Treatment Plant (CWWTP) was designed by qualified and experienced engineers and all operating personnel received the necessary training for the safe operation of the plant.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES.\n\n\n\nThe CWWTP receives domestic wastewater from the central area of the City?s urban perimeter including the Louisiana State University campus, and provides secondary treatment to this wastewater.  Before being discharged into the Mississippi River, the treated effluent is disinfected with chlorine and further treated with sulfur dioxide for removal of the residual chlorine.  The use of these two chemicals makes the CWWTP subject to the provisions and requirements of Section 112(r) of the Clean Air Act and the related accident prevention (Risk Management Program) regulations, as enacted by the USEPA at 40 CFR Part 68.\n\n\n\nChlorine.  The CWWTP has two 5,000-gallon storage tanks (nominal size) to satisfy the chlorine needs of the wastewater disinfection process.  Each tank?s working capacity is limited, by means of administrative controls, to a maximum of approximately 4,000 gallons, or no more than 50,000 lb. of  liquid chlorine.  This chemical is delivered on the plant site by dedicated tanker trucks operated by the chlorine supplier.  All of the chlorine storage and handling facilities are e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38798,
      "SummaryText": "nclosed inside a steel-frame and concrete building.\n\n\n\nSulfur Dioxide.  The CWWTP receives sulfur dioxide in one-ton cylinders which are delivered by truck.  The cylinders are stored inside the sulfur dioxide building, a steel-frame and concrete structure that also houses all of the major components of the dechlorination system.\n\n\n\n\n\nHAZARD ASSESSMENT RESULTS\n\n\n\nThe requirements of 40 CFR Part 68 includes, among other items, the development of a Worst-Case Scenario (WCS) and an Alternative Release Scenario (ARS) for the possible release of significant quantities of the regulated toxic substances (chlorine and sulfur dioxide).  Originally, these requirements also called for the Executive Summary (ES) to include a discussion of the WSC and ARS for each toxic chemical.\n\n\n\nPer the above, the ES of the original RMP submitted to the USEPA in 1999 presented and discussed these scenarios and the hypothetical offsite consequences in some detail.  Considering that the operation of these systems have not undergone any changes that would affect the scenarios or their underlying assumptions, these scenarios are still valid. However, they will not be discussed further here.  In accordance with the 2004 revisions to 40 CFR Part 68 (69 FR 18819-18837, April 9, 2004), a discussion of the WCS?s and ARS?s is no longer required for inclusion in the ES.\n\n\n\n\n\nPREVENTION PROGRAM\n\n\n\n1.0    Safety Information\n\n\n\nThe Central Wastewater Treatment plant of the city of Baton Rouge keeps on site the necessary documents related to the operation and maintenance of the plant in a safe manner.  Documentation kept on site provides information regarding the chemical properties and chemical hazards associated with the regulated chemicals (not only chlorine and sulfur dioxide but sodium hydroxide solution - caustic - as well); operating limits for all key process parameters; record of the current inventory of these chemicals; and data on equipment design and specifications.\n\n\n\nThese documents include, but "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38798,
      "SummaryText": "are not limited to the following:\n\n\n\n* Copies of current Material Safety Data Sheets (MSDS?s) for the chemicals involved\n\n* Vendor?s Operation and Maintenance (O&M) manuals for each major component of the chlorination and dechlorination systems.\n\n* A complete set of construction drawings and specifications\n\n* A copy of the plant?s Emergency Response Plan\n\n* Copies of Shop Drawings and assembly instructions for all major components\n\n* Copies of the Operator?s daily log sheets are kept on file.  They show material inventories and a record of the shipments of chemicals delivered on site.\n\n\n\nThe above records are updated as applicable and necessary.\n\n\n\n2.0     Hazard Review\n\n\n\nA detailed review of the hazards associated with the operation of the chlorination and dechlorination systems at the CWWTP was performed in the late Winter and early Spring of 1999.  The Process Hazard and Operability (HAZOP) review technique was used to identify any hazards and ensure that the necessary controls are in place to manage such hazards.\n\n\n\nA team of individuals representing the operations, maintenance, safety, engineering and management departments conducted the HAZOP review and issued a report that presented and discussed the ?Action Items? identified.  This report was submitted to management for resolution.  The corrective action(s) identified for each action item were  documented and most were addressed and resolved, although a few outstanding items remain.  \n\n\n\nFurther, since there have not been any significant changes to the chlorination and sulfur dioxide systems in the last 5 years, it was only necessary to perform a revalidation of the original HAZOP study, with the major focus being aimed at a detailed evaluation of the changes that were made to the Cl2 and SO2 systems within this time frame.\n\n\n\n3.0     Operating Procedures\n\n\n\nThe CWWTP keeps on site copies of all operating and maintenance procedures that were prepared and submitted to the city by the plant design firm.  These proc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38798,
      "SummaryText": "edures address not only normal plant operations but other operating modes such as start-up, normal shut-down, emergency shut-downs, start-up following emergency shut-downs, etc.  These procedures also address the removal of individual components from the process for inspection and/or maintenance and they discuss the consequences of deviations from the normal operating conditions and the steps to be followed to correct such deviations.\n\n\n\nThe plant?s operating and maintenance procedures are reviewed and updated any time that the process undergoes a significant modification or improvement.\n\n\n\n4.0    Training\n\n\n\nAll of the employees involved in the operation of the chlorination and dechlorination systems at the CWWTP underwent initial class-room and hands-on training provided by the design consulting firm.  As a part of this training, the employees were given written tests to verify their understanding of the process, the operating conditions, the hazards inherent in the materials being handled and the appropriate responses to alarm conditions and emergencies.  \n\n\n\nAny time that the process undergoes modifications, changes or improvements, all operators affected by such changes will be provided with the necessary training.  In addition, periodic refresher training sessions are held with the participation of all operating and maintenance personnel.\n\n\n\n5.0    Maintenance\n\n\n\nThe CWWTP has in place procedures for the periodic inspection and maintenance of the major components of the chlorination and dechlorination systems.  The operator performs daily rounds, during which he/she visually inspects all process equipment, instruments and piping and also verifies that the system is operating according to design.  The operator will enter his/her comments and observations on the daily log, when and as applicable.  Any condition that requires the maintenance department?s attention will be called to the maintenance supervisor?s attention, via the submittal of a work order request.\n\n\n\nAl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38798,
      "SummaryText": "l members of the maintenance department staff have undergone training and have hands-on experience in the repair and maintenance of process equipment.  In the case of specialized equipment such as the chlorinators, sulfonators and evaporators, the City has contracted for the maintenance and repairs of this equipment with an outside contracting firm that specializes in this kind of work. \n\n\n\n6.0    Compliance Audits\n\n\n\nThe CWWTP has in place compliance safety audit procedures that call for periodic audits to be performed on the plant?s Risk Management Program (RMP) at least every three years.  These audits will determine how effectively the policies and procedures of the RMP have been implemented.  The audit findings are submitted to management for resolution and corrective action as necessary and applicable.  Documentation of the audits, findings and resolutions are  maintained as part of the prevention program.\n\n\n\nThe last compliance audit was performed in May of 2003.  The audit team included members of the operation, maintenance and management staffs of the wastewater treatment department.\n\n\n\n7.0    Incident Investigation\n\n\n\nThe CWWTP has established procedures to promptly investigate all incidents which result, or could reasonably have resulted, in a significant release of one or more of the regulated chemicals.  The objectives of such investigations are:\n\n\n\n* to establish the facts relating to the incident, \n\n* to determine the factors causing or contributing, directly or indirectly, to the incident and\n\n* to define what corrective actions, if any, are necessary to prevent such incidents from occurring in the future.\n\n\n\nThe incident investigation team includes members of the staff who are familiar with the process involved in the incident and also includes personnel from the operations, maintenance and management departments.\n\n\n\nThe investigating team submits its findings and recommendations to plant management for resolution.  Corrective actions taken in response to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38798,
      "SummaryText": " the investigation report are tracked until completed.  The final resolution of each finding or recommendation is documented and the investigation results are reviewed with all employees, including contractors, who could be affected by said findings.  Incident investigation reports are kept on file for a minimum of 5 years. \n\n\n\n\n\n5-YEAR ACCIDENT HISTORY\n\n\n\nThe Chlorine and Sulfur Dioxide storage and supply facilities at the Central Wastewater Treatment Plant have not had any reportable accidental releases of chlorine or of sulfur dioxide as defined in 40 CFR ?68.42(a), in the last five years.  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Central WWTP has in place a written Emergency Preparedness and Response Plan for the Chlorine and Sulfur Dioxide Systems. Major sections of the Plan are as follows:\n\n* Description of the uses of Chlorine and Sulfur dioxide within the plant\n\n* Physical Properties of Chlorine and Sulfur Dioxide\n\n* Safety measures that must be taken before working in a Chlorine or Sulfur dioxide environment\n\n* Description of monitoring, warning and alarm systems in place at the Chlorine and Sulfur Dioxide buildings\n\n* Description of Leak-containing features of the chlorine and sulfur dioxide storage systems\n\n* Description of safety features and measures provided at the chlorine and sulfur dioxide facilities.\n\n* Accessibility restrictions in the chlorine and sulfur dioxide areas\n\n* Personnel responsibilities during a chlorine or sulfur dioxide emergency, including local and evacuation alarms.\n\n* List of emergency call numbers to be contacted (local agencies and public)\n\n* Communications with the media and with the public\n\n* Emergencies requiring public action\n\n* Emergency medical treatments\n\n* Closure of emergency condition\n\n* Plant evacuation checklist\n\n* Chlorine and sulfur dioxide system design specification summary\n\n\n\nThe final version of the Emergency Preparedness and Response Plan was issued in 1997, at approximately the time that the chlorine and sulfur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 38798,
      "SummaryText": " dioxide systems were installed. This plan was revised and updated in March, 2,001.\n\n\n\nAt the State of Louisiana?s (LDEQ?s) request, the full text of the emergency response plan was submitted in 2001 as part of a few minor corrections made to the RMP at that time. There have not been any significant changes made to this plan since.  The emergency response plan is periodically reviewed and verified for completeness and correctness.\n\n\n\nEmergency preparedness and response drills are held periodically with participation of personnel from all three of Baton Rouge?s wastewater treatment plants.  These drills also involve the participation of and are executed under the guidance of the Baton Rouge HazMat team and the Baton Rouge Fire Department.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThere were some action items identified during the original HAZOP analysis that were directly or indirectly related to safety.  As a result of one such item, the CWWTP has already switched both the chlorination and dechlorination (sulfur dioxide) systems from liquid to vapor feed.  This change has virtually eliminated all pressurized liquid chemical lines from these two systems, with the sole exception of the liquid chlorine unloading line, which is full of liquid chlorine only while a chlorine truckload is being unloaded into the storage tank..\n\n \n\nThe new vapor feed lines are temporary at present to allow these systems to continue to operate, but the preparatory activities are already under way for the replacement of these lines with permanent ones.  These final changes will be completed within the near future.\n\n\n\nVjs - H:\\My Documents\\BTNROUGE\\5-yr RMP\\CWWTP\\rmp04exec-CWWTP.doc    Page 1 of 6 \n\n\n\n"
    }
  ]
}