{
  "FacilityID": 38806,
  "FacilityName": "Abbott Laboratories - Puerto Rico Operations",
  "FacilityStr1": "Km 58.0  Road No. 2",
  "FacilityStr2": null,
  "FacilityCity": "Barceloneta",
  "FacilityState": "PR",
  "FacilityZipCode": "00617",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72017",
  "LEPC": "LEPC Zone II",
  "FacilityLatDecDegs": "18.440278",
  "FacilityLongDecDegs": "-066.566944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.abbott.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 607076387,
  "ParentCompanyName": "Abbott Laboratories Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1307602,
  "Company2DUNS": null,
  "OperatorName": "Eng. Harry Rodriguez",
  "OperatorStr1": "Km 58.0  Road No. 2",
  "OperatorStr2": null,
  "OperatorCity": "Barceloneta",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00617",
  "OperatorZipCodeExt": null,
  "FTE": 2300,
  "OtherEPAFacilityID": "00617BBTTCROADN",
  "EPAFacilityID": "100000066714",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-22 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-10-25 00:00:00",
  "DeRegistrationEffectiveDate": "2006-05-22 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 18.433237,
  "FRS_Long": -66.570509,
  "FRS_Description": null,
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "has replaced chlorine use and storage for a compound which is non-listed",
  "_processes": [
    {
      "ProcessID": 55854,
      "AltID": "Waste Water Treatment Pla",
      "FacilityID": 38806,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 73890,
          "ProcessID": 55854,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57145,
          "ProcessID": 55854,
          "NAICSCode": "56221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32165,
              "Process_NAICS_ID": 57145,
              "SafetyReviewDate": "2004-06-17 00:00:00",
              "PHA_Date": "2003-04-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Chlorine sensor tied to interlock system activates extractor",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Extractor",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Relocation of process detection system and expansion of extraction area",
              "OpProceduresReviewDate": "2003-09-11 00:00:00",
              "TrainingReviewDate": "2004-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "2004-03-30 00:00:00",
              "EquipmentTested": "Tubing, fittings, and chlorine sensors",
              "ChangeMgmtDate": "2003-06-16 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-04 00:00:00",
              "PreStartupReviewDate": "2004-06-17 00:00:00",
              "ComplianceAuditDate": "2002-06-19 00:00:00",
              "AuditCompletionDate": "2004-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-12 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-18 00:00:00",
              "ContractorSafetyEvalDate": "2003-09-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 46870,
                  "PreventionProgram3ID": 32165,
                  "ProcessChemicalID": 73890
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38806,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-03-20 00:00:00",
    "ERTrainingDate": "2004-06-17 00:00:00",
    "CoordinatingAgencyName": "LEPC Zone II",
    "CoordinatingAgencyPhone": "7878805140",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "EQB Rule 107",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38806,
      "SummaryText": "Abbott Laboratories operates a pharmaceutical manufacturing complex in Barceloneta, Puerto Rico.  The Abbott facility is divided into four manufacturing plants in addition to support operations, including the waste water treatment plant (WWTP), utilities and the cogeneration facility.   In the course of producing these pharmaceuticals, Abbott uses one of the compounds which appear on the list of Risk Management Planning chemicals and which is stored in greater-than-threshold quantities.  Specifically, at the wastewater treatment plant chlorine is injected into the waste water to disinfect treated water; used at the absorbing media in the air pollution control equipment (i.e., scrubbers); and for the WWTP tertiary water system.  The chlorine system at the WWTP includes a total of five 1 ton cylinders and an injection system.\n\n? Abbott has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in process safety and accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the processes.  Abbott's policy is to implement reasonable controls to prevent foreseeable releases of hazardous chemicals.   In addition, Abbott has established strong programs in its operation which have led and will continue to lead to reductions in the use of hazardous chemicals.  For example, Abbott has instituted a basic operating procedure (BOP) to ensure that on-site quantities of another chemical (i.e., monomethylamine) that appears on the RMP list of regulated substances, remains below the threshold quantity.  The storage of chemicals in less-than-threshold quantities results in a safer process and ensures that public and offsite consequences will be minimized.  Another example is the Management of Change program implemented by Abbott.  Under this BOP established by Abbott,  all proposed changes to process chemicals, technology, equipment, and procedures must b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38806,
      "SummaryText": "e reviewed for impacts on safety and health.  Numerous other programs have also been established and are documented in Abbott's prevention program.\n\n? Abbott currently operates a number of safety systems at the WWTP to mitigate any release of chlorine.  Specifically, the chlorine storage area is equipped with an interlock system that will activate an extractor and alarms in the event of high chlorine concentrations in the storage area, and the chlorine transfer line is equipped with vacuum regulators that will shut down the chlorine supply if the vacuum line is broken.  \n\n? Prevention Program - Because the WWTP is a Program 3 covered process, Abbott is required to comply with the Program 3 Prevention Program requirements in Subpart D of the Part 68 regulations.  As documented below, Abbott has fully complied with each requirement.\n\n? Process Safety Information - Abbott has written process safety information on the hazards of chlorine, the technology of the process, and the equipment utilized in the process.  This information is continually updated as part of the Management of Change Procedure.\n\n? Process Hazard Analysis - Abbott has written procedures that document a comprehensive program to ensure that hazards associated with the WWTP are identified and controlled.  In addition, following these procedures, Abbott has updated its process hazard analysis of the chorine system at the WWTP.\n\n? Operating Procedures  - Abbott has developed written operating procedures that provide clear instructions for safely operating the chlorination system at the wastewater treatment plant.  These operating procedures are readily accessible to employees who work in the treatment plant and are reviewed as often as necessary to assure that they reflect current operating practices.   Abbott has also developed and implemented safe work practices for lockout/tagout; confined space entry; opening of process equipment; and entrance into the facility.\n\n? Training - Abbott has provided traini"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38806,
      "SummaryText": "ng on a periodical basis to all current employees and is committed to providing training to each new employee who will be directly involved in the operation of the WWTP chlorine injection process. Abbott has also documented that each employee involved in the operation of the WWTP chlorine injection process has received and understands the subject training. \n\n? Mechanical Integrity Program - Abbott has established and implemented written procedures for maintaining the mechanical integrity of all equipment involved in the WWTP chlorine injection process, including related equipment such as chlorine sensors and alarms.  Each employee involved in the maintaining the on-going integrity of the equipment has been trained in an overview of the process and its hazards.  \n\n? Management of Change - Abbott has established written procedures to manage changes to process chemicals, technology, equipment, and procedures.  \n\n? Pre-Startup Safety Review - Abbott is committed to performing a pre-start-up safety review for new and modified WWTP chlorine injection process equipment,  when the modification is significant enough to require a change in the process safety information.    Reinforcing this commitment are the procedures that Abbott has in place to ensure safety features, procedures, personnel, and equipment are appropriately prepared for start-up prior to placing any new or modified equipment into service.\n\n? Compliance Audits - Abbott has developed and implemented procedures and conducted a compliance audit accordingly.  Abbott is committed to to resolve any recommendations identified in the compliance audit, and conduct such audits at least every three years.\n\n? Incident Investigation - Abbott is committed to investigate each incident which resulted in, or could reasonably have resulted in a catastrophic chlorine release.  Abbott has procedures in place that document Abbott's approach to investigating each incident and documenting and resolving all incident report findings."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38806,
      "SummaryText": "In the past 5 years, no incidents related to the chlorine handling and use at the WWTP have been experienced.\n\n? Employee Participation - Abbott consults with all WWTP employees regarding the conduct and development of process hazards analysis and other elements of the prevention program.  Employees are encouraged to participate in the conduct and development of all program elements.\n\n? Hot Work Permits - Abbott has implemented procedures that address the requirement to issue permits for hot work conducted on or near a covered process.  \n \n? Contractor Procedures - Abbott has procedures in place that document the steps that Abbott will follow in hiring contractors to work in or adjacent to the chlorination system at the WWTP.  These procedures also address the evaluation of contractor performance with respect to complying with their obligations under the RMP program as well as the procedures for controlling contractor access.                                                                                                                                                                                                 \n? No accidental releases of chlorine from the WWTP have occurred in the last five years that have resulted in deaths, injuries, or significant property damage or known off-site death, injuries, evacuations, or sheltering in place.\n\n? Emergency Response Program -  Since Abbott has elected to rely upon outside personnel to respond to an accidental release and Abbott is included in the community emergency response plan, Abbott's emergency response plan consists of notifying the emergency responders when an accidental release has occurred.  Abbott is an active member of the Local Emergency Planning Committee (LEPC) Zone II and also is a member of a private organization known as the Chemical Awareness and Emergency Response (CAER).  Both entities are prepared to respond to an emergency with on-site and off-site impacts.  The specific procedures that Abbott f"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38806,
      "SummaryText": "ollows to notify internal and external resources in the event of an emergency (including hurricanes, riots, chemical spills, etc.)  are included in Abbott's Disaster Control Manual."
    }
  ]
}