{
  "FacilityID": 38944,
  "FacilityName": "Holland Plant",
  "FacilityStr1": "3 mi. N of Strawn TX on Hwy 16",
  "FacilityStr2": null,
  "FacilityCity": "Strawn",
  "FacilityState": "TX",
  "FacilityZipCode": "76475",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48363",
  "LEPC": "Palo Pinto  LEPC",
  "FacilityLatDecDegs": "32.585833",
  "FacilityLongDecDegs": "-098.491667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Upham Oil & Gas Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Upham Oil & Gas Company",
  "OperatorStr1": "P.O. Box 940",
  "OperatorStr2": null,
  "OperatorCity": "Mineral Wells",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76068",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000008136",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-05 00:00:00",
  "DeRegistrationEffectiveDate": "2000-05-29 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 32.585833,
  "FRS_Long": -98.491667,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56019,
      "AltID": "Remove Nat. Gas Liquids",
      "FacilityID": 38944,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 74081,
          "ProcessID": 56019,
          "ChemicalID": 98,
          "Quantity": 52000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 74082,
          "ProcessID": 56019,
          "ChemicalID": 118,
          "Quantity": 43000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 74083,
          "ProcessID": 56019,
          "ChemicalID": 94,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57318,
          "ProcessID": 56019,
          "NAICSCode": "32411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 57319,
          "ProcessID": 56019,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38944,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-01-01 00:00:00",
    "ERTrainingDate": "2001-08-09 00:00:00",
    "CoordinatingAgencyName": "Mineral Wells, TX Fire Dept",
    "CoordinatingAgencyPhone": "9403250350",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38944,
      "SummaryText": "1. The stationary source and regulated substances handled.\n\nThe primary function of this facility is twofold.  The Holland Plant serves as a compression station for natural gas gathered from surrounding leases.  The second function is the removal of liquid hydrocarbons from the gas stream through the use of a ¿Mixed Refrigeration Plant¿.  The liquids removed include ethane, propane, butane and natural gasolene.  The primary storage vessel is a pressurized 42,000-gallon horizontal tank.  A 12,000 gallon pressurized tank and non-pressurized 8,820-gallon steel tank also serve as temporary storage for the process.  Liquids removed and stored are transported from the site via pressurized transports.  The dry gas is moved by pipeline from the plant site.  Access to this site is restricted to company employees and authorized contractors.\n\nThe maximum amount of propane/butane mix stored on site is limited to 136,000 pounds.\n\n2. Accidental release prevention and emergency response policies.\n\nIn this separation and compression facility, we handle both propane and butane which are considered hazardous by EPA.  The same properties that make propane and butane valuable as a fuel also make it necessary to observe certain safety precautions in handling propane and butane to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and state rules and regulations.  Safety depends upon on several factors: 1) the manner in which we handle the product, 2) the safety devices inherent in the design of this facility, 3) the safe handling procedures that we use, and 4) the training of our personnel and contractors.\n\nOur emergency response plan considers the safety of our employees, contractors and the public. Preservation of the plant equipment is secondary.  We, therefore, are prepared to isolate and abandon the plant site"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38944,
      "SummaryText": "in the event of a major release or fire.  Minor leaks or spills will be handled as required by our employees.  Provisions have been made to sever the flow of natural gas and associated liquids to the plant from safe remote locations.  A lack of firefighting water limits the ability of emergency responders.\n\n3. The worst-case release scenario and the alternate release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWorst-case scenario - Failure of the largest storage tank when filled to the greatest amount allowed would release 32,000 gallons of propane/butane/gasolene mix.  Approximately 68 percent of the mix is propane and butane.  Of the 68 percent, the tables indicate that 38 percent, or 35,143 pounds would immediately flash into vapor.  A certain amount of the propane, butane, gasolene mix would be included as aerosol and spray.  In order to include the aerosol and spray, the 35,142 pounds is doubled and 70,284 pounds are considered in the vapor cloud explosion calculations.  The distance to a 1-psi overpressure is .33 miles or 1760 feet.  There are no public receptors within the calculated 1-psi overpressure distance.\n\nAlternative scenario - A more realistic scenario would be the rupture of a loading hose during truck loading (contents in the hose released after shut-off).  Fisher Type N550 Emergency Shutoff Valves with remote actuators are present on the lines.  These valves will contain the release to the gas contents in the loading hose, and self-closing valves protect the transport trailers.  The emergency shut off actuators are located approximately 30 feet south of the fuel islands and mounted near the chain link fence.  A red and white emergency sign marks the actuator location.  Bulkheads have been installed at the fuel islands to insure that a hose will part above the emergency valves.  The remote operator site was chosen in order to provide any employee, plant operator or truck d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38944,
      "SummaryText": "river a safe area from which he/she may remotely close any or all of the above listed valves.  A simple push of the valve handle will instantly close the ¿Snappy Joe¿ valve at the Fuel Island.  This safety feature will protect both personnel and equipment if a truck fails to disconnect and drives away or if a hose should rupture from other causes.  In the event of a fire at the fuel island, a fusible link will melt at 212 degrees or the poly tubing providing pneumatic pressure to the valves will melt resulting in automatic closure of the Snappy Joe valve.  Again containing the release to the contents in the hose.  Should a vapor cloud explosion occur, the maximum distance to a 1-psi overpressure would not exceed .1 mile or 572 feet.\n\n4. The general accidental release prevention program and the specific prevention steps.\n\nThis liquid separation facility complies with EPA¿s Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility was designed and constructed in accordance with good engineering practices.  Plant operators have been trained in the operation of the plant to insure that design parameters are not exceeded.\n\n5. Five Year History\n\nThe Holland Plant was constructed and came on line in 1991 and has operated since that time without an accidental release of a regulated substance where exposure to the substance, its reaction products, overpressure generated by and explosion involving the substance, or radiant heat generated by a fire involving the substance led to any of the following offsite:\n(i) Death\n(ii)Injury or\n(iii) Response or restoration activities for an exposure of an environmental receptor\n\n6. The emergency response program.\n\nThis facility¿s emergency response program is based on prior HAZMAT training and discussion with the emergency responders from the town of Gordon, Strawn and the City of Mineral Wells.\n\n7. Changes to improve safety.\n\nTraining has been extended to all company employees who operate in t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38944,
      "SummaryText": "he Holland Plant area.  Training centers on steps necessary to isolate and restrict the flow of gas and liquids to the plant.  Operating parameters have been discussed.  This will enable an employee to immediately recognize an unsafe situation and react accordingly.  Additional dikes have been constructed to better contain the heavy liquids on location."
    }
  ]
}