{
  "FacilityID": 38950,
  "FacilityName": "Oviedo Water Plant",
  "FacilityStr1": "707 South Central Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oviedo",
  "FacilityState": "FL",
  "FacilityZipCode": "32765",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12117",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "28.660250",
  "FacilityLongDecDegs": "-081.208333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ci.oviedo.fl.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Oviedo",
  "Company2Name": null,
  "CompanyDUNS": 39564844,
  "Company2DUNS": null,
  "OperatorName": "City of Oviedo",
  "OperatorStr1": "400 Alexandria Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Oviedo",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32765",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061737",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-01 00:00:00",
  "SafetyInspectionBy": "DCA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-25 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2008-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2006-12-27 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 28.66025,
  "FRS_Long": -81.208333,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "10",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "removed all one ton containers of chlorine gas",
  "_processes": [
    {
      "ProcessID": 56025,
      "AltID": null,
      "FacilityID": 38950,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 74092,
          "ProcessID": 56025,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57325,
          "ProcessID": 56025,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32266,
              "Process_NAICS_ID": 57325,
              "SafetyReviewDate": "2004-04-21 00:00:00",
              "PHA_Date": "1999-05-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "tied into SCADA Alarm System",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Conducted Vulnerability Assessment",
              "OpProceduresReviewDate": "2004-05-21 00:00:00",
              "TrainingReviewDate": "2004-05-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Safety review meetings and procedures",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "certification",
              "MaintenanceReviewDate": "2004-05-21 00:00:00",
              "EquipmentInspectionDate": "2004-06-07 00:00:00",
              "EquipmentTested": "chlorine regulations",
              "ChangeMgmtDate": "1999-04-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2004-05-21 00:00:00",
              "AuditCompletionDate": "2004-09-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-05-21 00:00:00",
              "HotWorkPermitReviewDate": "2004-05-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-05-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 46992,
                  "PreventionProgram3ID": 32266,
                  "ProcessChemicalID": 74092
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 38950,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-21 00:00:00",
    "ERTrainingDate": "2004-06-15 00:00:00",
    "CoordinatingAgencyName": "LEPC and Fire Department-Regional",
    "CoordinatingAgencyPhone": "4079776100",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Florida State Emergency Responbse Commission",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 38950,
      "SummaryText": "CITY OF OVIEDO\nOVIEDO WATER TREATMENT PLANT\nRISK MANAGEMENT PROGRAM RE-SUBMITTAL\nEXECUTIVE SUMMARY\n\n1.\tEXECUTIVE SUMMARY INTRODUCTION 68.155                                                                        \nThe City of Oviedo Utilities Department operates the City of Oviedo¿s Water Treatment Plant at 707 South Central Ave, Oviedo, Seminole County, Florida.  This plant is one of two water plants operated by the City.  The Oviedo water plant and the A. M. Jones water plant have quantities of regulated hazardous chemicals above the EPA threshold.  The City has a unified Risk Management Program which applies to each plant.  Only the Oviedo Water Treatment Plant operations and policies are presented in this Plan.\n1.1.\tACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE POLICIES     (A)\nThe City of Oviedo Water Treatment Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures and management practices.  The plant prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68 Prevention Program under the Clean Air Act Amendments of 1990.\n1.2.\tMANAGEMENT SYSTEMS (A) (1)\nThe City of Oviedo has a management system in place which is lead by the City¿s Manager, who oversees the implementation and on-going use of the RMP elements.  This program, along with other City-wide and plant-specific policies, eliminates and /or reduces the likelihood of a hazardous chemical release at the plant.  An organizational chart defining the lines of authority and responsible staff is included in the plants RMP Process Safety Information.\n1.3.\tPREVENTION PROGRAM LEVEL 3 (A) (2)\nThe City of Oviedo maintains policies, procedures and systems as part of their prevention program.  These are applied to each treatment plant and specifically the Water Treatment Plant.  The program addresses each of the EPA Program Level 3-listed 12 elements, plus RMP elements nee"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 38950,
      "SummaryText": "ded to implement the program, and the like elements in place in the plants¿ OSHA PSM program which the City is exempt from compliance with.  These are maintained City of Oviedo¿s water plant Document Management System (DMS).\n1.4.\tSTATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED AT CITY OF OVIEDO, FLORIDA SITE (B)  \nThe City of Oviedo Water Treatment Plant employs eight (8) full-time employees engaged in water treatment plant and field operations.  Chlorine is used as part of the treatment process.\n1.5.\tSITE DESCRIPTION (B) (1)\t\nThe site is owned and operated by The City of Oviedo and managed by its Utilities Department.  The site is located at 707 South Central Ave, Oviedo, Seminole County, Florida.   The site is located in an area, boarded by South Central Ave. on the east, housing on the west, Sandalwood Ct on the north and a public park on the south.\nThe Plant includes a separate chlorine storage area and adjacent control room plus injection feed distribution system that is contained in a separate process room as well as at various injector points¿ cabinets.\nThe boundaries of the chlorine system subject to the RMP regulation include the Bulk Chlorine Storage Room, Feed Control room, associated vent makeup, exhaust systems and chlorine injection cabinets at various injection points.  These are detailed in the Process and Instrument Drawings (P&ID) which are part of the plant Process Safety Information (PSI).  All drawings are maintained in the plants RMP Process Safety Information.\n1.5.1.\tREGULATED SUBSTANCE (b) (2)\nChlorine is the only regulated substance on site which exceeds the EPA 40 CFR-68 rule threshold quantity of 2500 pounds.  The City of Oviedo chlorine process was installed as part of the process of purifying water for public consumption.  It operates under permit from the State of Florida Department of Environmental Protection (FL DEP).  The chlorine is received, stored and distributed to two process control systems. \nChlorine is an EPA and OSHA-liste"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 38950,
      "SummaryText": "d toxic chemical.  It is an irritant and it is corrosive.  Chlorine is a halogen with the formula Cl2.  It is a chlorinating or oxidizing agent that is not flammable.  It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 4, severe; with immediate and delayed health hazards.  Chlorine is not a carcinogen.\nThe maximum threshold quantity stored on site is 15 each one ton containers.  This equals 30,000 pounds.\n2.\tHAZARD ASSESSMENT\nA hazard assessment was performed to determine the effects a release would have on the public. For chlorine, the distance a set endpoint concentration of the gas would travel must be determined.  In addition, an estimate of the population that could be affected by a release of chlorine was determined, and sensitive receptors such as hospitals, schools, and nursing homes were identified. The hazard assessment considers two release scenarios-a \"worst case\" and an \"alternative case\" and also compiles the five-year accident history for the WTP chlorine system (see section 4 below: five year accident history).\nTwo offsite consequence analyses were conducted which include two chlorine release scenarios.  The first is a ¿worst case release¿.  The second is a more probable ¿alternative release scenario¿.  The first scenario is defined by EPA, which states that ¿the operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes¿ due to an unspecified failure.  The alternative scenario is defined as ¿more likely to occur than the worst-case scenario¿.\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine released before its concentration decreases to the ¿toxic endpoint.¿  The EPA specified endpoint for chlorine is 0.0087 mg/l which equals 3 ppm. The 3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the ¿maximum airborne concentrat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 38950,
      "SummaryText": "ion below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual¿s ability to take protective action.¿  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, ¿to estimate the population potentially affected.¿\n2.1.\tWORST CASE   (C) (1)\nAtmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions and EPA¿s RMP Comp Program.  Assumptions used were: \n¿\tliquefied under pressure, \n¿\tlb release, urban surroundings, \n¿\tno mitigation measure.  \nResults demonstrate a distance to the toxic endpoint of 1.3 miles containing 5.3 square miles of area assuming an urban topography without an enclosure.  The residential population that could potentially be affected by the release is 7,936 individuals based on the U. S. Census 2000 demographic data.  There is one residence and industry included in that release area (schools, commercial facilities and parks).\n2.2.\tALTERNATIVE CASE   (C) (2)\nThe alternative release scenario involves the failure of the regulator of the pressure system or the wip on pipes/valves connected to one of the one-ton containers.  This failure was defined during the recent Process Hazards Analysis.  This failure is equal to creating a 0.03 square inch hole in the wip tube, a pipe, or even the container itself.  Modeling using the EPA/RMP Comp and EPA¿s water guidance demonstrated the rate of chlorine release is 60.0 lb. /minutes for a period of 33 minutes releasing a total of 2,000 pounds of chlorine.  The toxic endpoint distances determined using the following assumptions:\n¿\tliquefied under pressure, \n¿\t60 lb/min release, \n¿\turban surroundings, \n¿\t33 minute duration\n?\tno mitigation measure \nand is 0.20 miles and in the process safety information.  The residential population that would be impacted by this release"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 38950,
      "SummaryText": "is 411 and is recorded in the process safety information.  Receptors in this area were identified as residences, schools, recreational areas, etc.\n3.\tACCIDENTAL RELEASE PREVENTION PROGRAM (D)\nThe City of Oviedo accidental release prevention program is based on OSHA¿s PSM program and EPA¿s RMP Level 3 prevention program.  The PSM programs have been in place and effectively used for many years.  It is part of the plants operating culture.  There are two parts to the program.  The first is the general overall water division wide program and the Water Treatment Plant site program.  The second is the chlorine-specific actions within the site program.  Both are coordinated with the Seminole County Fire/Rescue Department (including the Haz Mat Team) and the Regional LEPC.\n3.1.\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM   (D) (1)\nPlant-wide, many elements of the prevention program are used for all operations.  An overview of the generally written programs is listed below:\nThe City of Oviedo has detailed process safety information on each of its operations. \nThe document maintenance system is integral to the management of change for all operations on site control.  \nTraining is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used. \nMaintenance and preventive maintenance are used for all operations making mechanical integrity a part of each piece of equipment. \nIncident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident. \nEmployees participate in all aspects of the plant as listed below under emergency response. \nSafe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical Lines. \nContractors must meet The City of O"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 38950,
      "SummaryText": "viedo¿s high safety and technical standards as part of selection and ongoing evaluations.  Plus, City of Oviedo demands training of contractors to our standards. \n3.2.\tCHLORINE SPECIFIC RESPONSE PROGRAM (D) (2)\n3.2.1.\tChlorine-Specific Operating Safety Information\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the chlorine specific program.  These include:\n3.2.2.\tSpecific procedures for the management of the chlorine process. \nCompletion of a Pre-startup Safety Review prior to startup of the modified chlorine system.   \nSpecific emergency response procedures for chlorine releases as outlined below under both operating procedures and in the emergency response procedures. See the Emergency Response Program book. \nSpecific training in the properties, hazards, handling requirements, and leak repair for chlorine. \nFinally, the details of both facility and equipment design are key to the safe operations of the chlorine system.\n3.2.3.\tFacility Design\nThe chlorine storage area is located in an open air area.  The plant and support equipment of the chlorine storage building and adjacent control room meet and exceed design codes standards and good engineering practices.  The storage area and control building room is equipped with natural and forced ventilation system respectively.  There is a chlorine area monitor inside the storage building and three remote monitors around the perimeter of the chlorine feed area.  If chlorine is detected, the monitor alarms.  The control room also has a chlorine monitor.  Both monitors alarm in their local area as well as in the water plant control room. The alarm system is tied into the security system which alerts management. \n3.2.4.\tEquipment Design\nThere are two types of chlorine pipe systems, high pressure and low (vacuum) pressure.  The high pressure chlorine piping system is very short as it only includes the control valve and vacuum pressure regulator. It is made of c"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 38950,
      "SummaryText": "hlorine compatible materials; steel, copper or chlorine compatible non-metallic compound (not corroded by chlorine) rated to 500 psig.  The maximum pressure of the chlorine in the high pressure system is only 150 psig giving a 3 to 1 safety factor.  Each one of the two ton containers are on line, two full ones are on standby.  There is an automatic switch over a vacuum pressure regulator. One bank is in service and the other is on standby. \nThe low pressure system operates under a vacuum pressure of 13 inches of mercury.  There is a pressure relief valve which vents if the pressure in the line reaches above atmospheric pressure.  All the pipe, tubes, and equipment are also chlorine compatible.  The system is designed to 150 psig or complete vacuum giving it a large safety factor over the typical vacuum or positive pressure in it.  There are two chlorine monitors who detects the presence of chlorine in the ton storage area and a third monitor in the chlorine control room. \n4.\tFIVE YEAR ACCIDENT HISTORY (E)\nThe plant has been chlorine reportable and release free since 1992 to the present, 14 year.\n5.\tEMERGENCY RESPONSE PROGRAM (F)\nEmergency response procedures are contained both the Plant Emergency Response Policy and is coordinated with the Seminole County Contingency Plan (Emergency Response Plan).  The plan includes an emergency response ¿decision tree¿ and a notification plan.  The Plant also has site specific emergency actions defined in the plants operating procedures.  Emergency response drills and drill evacuations are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed annually.\nThe emergency response program (contingency plan) is coordinated (reviewed by) with the water plant Safety Committee, the City Fire and Police Departments. The Water Plant and Fire Department coordinates with Local Seminole County Emergency Response Planning Committee (LEPC) and the Seminole County HazMat Team.  All are locate"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 38950,
      "SummaryText": "d in Seminole County, Florida.  Copies of the program are given to key local agencies including: fire, medical, rescue, management, and police departments.  Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the City water plant.\nThe Contingency Plan procedures detail the actions and responses to chlorine spills (releases).  The plan includes training of all chlorine-area operators. The primary response team includes the Seminole County Fire and Rescue, and county Haz Mat Teams.  All of these respond to severe chlorine leak situations.  Actions include catastrophic, severe, and moderate leaks.  A Chlorine ¿B¿ Leak Repair Kit is maintained at the chlorine storage area to aid in stopping leaks.  Public notification is facilitated through the City Police and County Sheriff¿s Office, which has an automated emergency dialing message system for public notification.\n6.\tPERSONNEL (F) (1)\nPersonnel are the key resource of the City of Oviedo¿s prevention program. City employees make up the operators and emergency first response teams.  The City of Oviedo fosters a high level of involvement in every aspect of the chlorine system operations including participation in:\n¿\tPSM/RMP safety teams, \n¿\tDevelopment of the operation procedures, \n¿\tHazard evaluations and \n¿\tOn-going training of the operators and other involved staff.\n7.\tCHANGES TO IMPROVE SAFETY (G)\nChanges to improve safety (recommended actions) were identified in the internal safety HazOp, tour, and audit of the RMP program to meet requirements of the Risk Management Prevention Program.  These recommended actions have now been evaluated and implemented as required.  An Audit was conducted to review the RMP program.  The key safety action items were completed.  See the ¿Update¿ Section 6 of this report.  The City of Oviedo continually reviews implemented operating procedures for potential safety improvements for all of its operations.  Cur"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 38950,
      "SummaryText": "rently, the City of Oviedo management team and process safety team are reviewing potential upgrades to the existing design of the chlorine operations to make the system even safer to prevent a release and minimize consequences in the event of a release of chlorine.\nThe City of Oviedo Water Treatment Plant recently compiled the EPA required Vulnerability Assessment.  Recommendations from the VA Report improve site security and safety over all including that of the chlorine system."
    }
  ]
}