{
  "FacilityID": 3901,
  "FacilityName": "City of Ennis Wastewater Treatment Plant",
  "FacilityStr1": "401 W. Plant Road",
  "FacilityStr2": "N/A",
  "FacilityCity": "Ennis",
  "FacilityState": "TX",
  "FacilityZipCode": "75119",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48139",
  "LEPC": "Ellis LEPC",
  "FacilityLatDecDegs": "32.303889",
  "FacilityLongDecDegs": "-96.615",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "ennis-texas.com",
  "FacilityEmailAddress": "gsh01@ennis-texas.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Ennis, Texas",
  "Company2Name": "N/A",
  "CompanyDUNS": 144445814,
  "Company2DUNS": 0,
  "OperatorName": "City of Ennis, Texas",
  "OperatorStr1": "115 W. Brown St",
  "OperatorStr2": "P.O. Box 220",
  "OperatorCity": "Ennis",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75120",
  "OperatorZipCodeExt": "0220",
  "RMPContact": "David O. Luther",
  "RMPTitle": "Wastewater Plant Foreman",
  "FTE": 8,
  "OtherEPAFacilityID": "TX0047261",
  "EPAFacilityID": "100000055343",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.29972,
  "FRS_Long": -96.61806,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4517,
      "AltID": null,
      "FacilityID": 3901,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4619,
          "ProcessID": 4517,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 4815,
          "ProcessID": 4517,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 4816,
          "ProcessID": 4517,
          "ChemicalID": 49,
          "Quantity": 2400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504815,
          "ProcessID": 4517,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 504816,
          "ProcessID": 4517,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 3901,
      "SummaryText": "\nThe City of Ennis, Texas is committed to provide a safe working environment for all employees through implementation of approved practices, design engineered equipment and materials.  Also, the City of Ennis, Texas is committed to provide a continuous supply of safe water that is free of contaminants which cause diseases or be toxic to consumers or the environment.  All city personnel are committed to following strenuous written safety procedures and are provided the needed equipment, tools, and training mecessary to enforce safety procedures.\n\nThe City of Ennis, Texas Water Treatment Plant is located at 4400 Beach Road, Ennis, Texas on a twenty acre site east of Lake Bardwell.   The plant is designed to treat up to six million gallons of water per day.  The raw water source is pumped from Lake Bardwell and treated by rapid mixing flocculation, sedimentation, filtration, and disinfection.  Liquid chlorine is used for pre-disinfection at the rapid mix, and liquid chlorine and anhydrous ammonia are used for final disinfection after filtration.  Maximum on site storage of liquid chlorine is 8000 pounds and maximum on site storage of anhydrous ammonia is 4000 pounds.\n\nThe City of Ennis, Texas Wastewater Treatment Plant is located at 401 West Plant Road, Ennis, Texas on a fifteen acre site on the south side of the city.   The effluent treatment plant capacity is two and one-half million gallons per day.   The treatment process consist of clarification, aeration, sludge disposal, and final effluent disinfection.   The final effluent is disinfected with liquid chlorine and sulfur dioxide dosage is applied for the purpose of dechlorination.   The maximum on site storage of liquid chlorine is 8000 pounds and the maximum on site storage of sulfur dioxide is 2100 pounds.\n\nIn order to avoid accidential release of regulated substances, operating personnel are required to study and follow written procedures as outlined in each designated hazardous work place.   Chlorine feed sys"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 3901,
      "SummaryText": "tems are designed with in line back-up systems.   Professional maintenance personnel services are used if needed.   All start up and shut down operating procedures are performed in accordance with written safety guidelines.   An important practice includes having two qualified operators to change out or move chlorine cylinders, including use of safety equipment and following written safety proceduresas specified in the safety program.\n\nThere have been no accidential release episodes at either plant during the last five years, a record for which we are proud and a sign of the dedicated effort by our personnel.\n\nIn response to an accidential release of a regulated substance, operators are trained to identify and locate the source release, mitigate if possible, notify city emergency personnel, prepare emergency equipment and material for use, summon all utility department personnel, determine the overall impact, follow the instructions of emergency personnel, take corrective actions, follow through, and document all incurred actions by time and date.    Emergency response to an accidential release will be made by the Ennis Fire Department.   The Ennis Fire Department is a combination department (31 career/25 volunteer) staffed 24 hours per day.   The Ennis Fire Department has an ISO Class 4 Public Protection Classification.   Fire department personnel are trained and have the capability to respond to and mitigate hazards from an accidential release at either plant.\n\nThe \"Toxic Worst Case\" scenarios were chosen based upon the most real release that would take place at the plants.   The safety record at both plants is excellent and the plant personnel understand that safety is the first action.   All scenarios are based upon line leaks relative to configuration of valves.   All tanks and lines are provided with excess flow valves, therefore, the leak would be between the tank and the excess flow valve.   All scenario releases would involve line fractures and release of g"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 3901,
      "SummaryText": "as.   The wind is 1.5 lps; tempature 85 degrees F, unsheltered facil                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             "
    }
  ]
}