{
  "FacilityID": 39017,
  "FacilityName": "City of Nederland Water Treatment Plant",
  "FacilityStr1": "1700 Canal Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Nederland",
  "FacilityState": "TX",
  "FacilityZipCode": "77627",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.980000",
  "FacilityLongDecDegs": "-094.005806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Nederland",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Nederland",
  "OperatorStr1": "P O Box 967",
  "OperatorStr2": null,
  "OperatorCity": "Nederland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77627",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Hamilton",
  "RMPTitle": "Public Works Director",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000041661",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 29.98001,
  "FRS_Long": -94.00548,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56116,
      "AltID": "Chlorine",
      "FacilityID": 39017,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57419,
          "ProcessID": 56116,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74196,
          "ProcessID": 56116,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574196,
          "ProcessID": 56116,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39017,
      "SummaryText": "The City of Nederland Water Treatment Plant handles several hazardous chemicals.  Ammonia, chlorine, sodium hydroxide and fluoride.  All personnel are trained to observe all proper safety precautions when handling any of these chemicals.  The Citiy of Nederland is committed to the safety of its employees and the health and welfare of the surrounding community that it serves.  It is the policy of the City of Nederland to comply with all applicable Federal and State rules and regulations.\n\nThe primary purpose of this facility is to treat and transport safe clean drinking water that exceeds the Federal and State standards to the citizens of Nederland.  Raw water is pumped into the plant and a polymer is added to remove the solids.  The water is then disinfected with chlorine and filtered.  Ammonia is added to control the formation of disinfection by-products.  The treated water then goes into ground storage tanks before it is pumped into the distribution system and to the community.  Access to the treatment plant is restricted to authorized employees, authorized management personnel and authorized contractors.  Chlorine is the only regulated substance over the threshold quantity that is used at this facility.  The chlorine is brought in by truck and delivered in ton containers.  The ton containers are then hooked up to a vacuum assited chlorination system.  The total inventory of chlorine at this facility is 6,000 pounds.\n\nThe worst-case release scenario would be the faillure of a one ton cylinder.  It would release 2,000 pounds of chlorine.  It is assumed that the entire contents would be released as vapor, which is heavier than air.  The distance to the toxic endpoint of 0.0087 mg/l is 0.9 miles.  A release of this kind would have an offsite impact.  A chlorine leak detector is mounted in the chlorine storage area and sends an alarm to the operator interface in the operations office.\n\nThe alternative release scenario assumes a filure of the transfer connection hose. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39017,
      "SummaryText": "The chlorine would have to release through a 0.25 inch opening.  The release rate would be 41.7 pounds per minute.  The distance to the toxic endpoint is 0.1 miles.  A release of this kind would have an offsite impact.  The leak detector mounted in the chlorine storage area would detect any chlorine leak.  This scenario was selected because it was the most plausible.                                       \n\nThe modeling program used to calculate the endpoint distances is the RMP*Comp provided by the EPA.  This was used for both the worst-case scenario and the alternative release scenario.\n\nBecause the City of Nederland is a municipality it does not fall directly under any OSHA rules.  However, it is the City of Nederland's policy to adhere as closely as possible to OSHA regulations.  The City of Nederland has an active safety program.  This program includes regular safety inspections of all facilities and equipment by the safety department.  There is also a safety review board that reviews all accidents that occur in the workplace and make recommendations on preventing future accidents.\n\nAll treatment plant operators on duty are required to make a visual inspection of the plant three times per shift.  The SCADA system at the plant is set up with numerous alarms that will alert the operator on duty of potential problems.  All operators are trained in the use of SCBA's (self-contained breathing apparatus) that can be used in the event of an emergency.\n\nThe City of Nederland Water Treatment Plant has not had any accidental releases of chlorine in the past five years.  The current treatment plant has been in operation approximately four years.\n\nThe Cityof Nederland's emergency response plan is designed to insure the safety of employees and the surrounding community.  The plant operators will not try to repair or stop a major leak.  The operator on duty will notify the Nederland Fire Department by calling 911.  The Nederland Fire Department will be the lead agency and wil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39017,
      "SummaryText": "l determine what procedures need to be followed."
    }
  ]
}