{
  "FacilityID": 39021,
  "FacilityName": "Gordon Food Service - Brighton",
  "FacilityStr1": "7770 Kensington Court",
  "FacilityStr2": null,
  "FacilityCity": "Brighton",
  "FacilityState": "MI",
  "FacilityZipCode": "48116",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26093",
  "LEPC": "Livingston County LEPC",
  "FacilityLatDecDegs": "42.500139",
  "FacilityLongDecDegs": "-083.692500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gordon Food Service",
  "OperatorStr1": "333 50th Street",
  "OperatorStr2": null,
  "OperatorCity": "Grand Rapids",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49501",
  "OperatorZipCodeExt": null,
  "FTE": 325,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127301",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.50098,
  "FRS_Long": -83.68926,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56120,
      "AltID": "Refrigerated Warehouse",
      "FacilityID": 39021,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74200,
          "ProcessID": 56120,
          "ChemicalID": 56,
          "Quantity": 23000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57423,
          "ProcessID": 56120,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32309,
              "Process_NAICS_ID": 57423,
              "SafetyReviewDate": "2004-01-21 00:00:00",
              "PHA_Date": "2004-01-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-20 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Evaporator units hav been moved out of the traffic flow of the powered industrial vehicle.  Additional guard placed around ammonia piping to prevent powered industrial vehicle contact",
              "OpProceduresReviewDate": "2004-01-12 00:00:00",
              "TrainingReviewDate": "2004-11-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-12 00:00:00",
              "EquipmentInspectionDate": "2004-06-01 00:00:00",
              "EquipmentTested": "Frick Compressors, Vilter Compressors, Glycol Pump, Condenser Water Treatment control panel, Ammonia pumps, System Guages, Air compressors, Main Control Panel",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-01-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-15 00:00:00",
              "HotWorkPermitReviewDate": "2004-03-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Wqhen the ammonia system becomes over pressurized (200 psi) an alarm will sound.  Once the pressure reaches 225 psi or greater, a relief valve activates to relieve the pressure in the ammonia system.  Once shutdown, the system will equalibirate the ammonia throughout the system.  Additionally, the compressors will alarm and shut down once the pressure drops below 10 inches of mercury to minimize losses of ammonia from systems failures.",
              "_chemicals": [
                {
                  "PrimaryKey": 47044,
                  "PreventionProgram3ID": 32309,
                  "ProcessChemicalID": 74200
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39021,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-03-15 00:00:00",
    "ERTrainingDate": "2004-04-21 00:00:00",
    "CoordinatingAgencyName": "Green Oaks Fire Department",
    "CoordinatingAgencyPhone": "8102313663",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39021,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\nIn accordance with section 112(r) of the Clean Air Act and 40 CFR part 68, this report fulfills the requirements of the Risk Management Plan (RMP) program for Gordon Food Service, Grand Rapids, Michigan.  Envirologic Technologies, Inc. (Envirologic) completed this RMP, on behalf of Gordon Food Service's facility located in Brighton, Michigan.  A brief summary of the RMP developed for GFS is presented below and in the attached computer file. \n\nAccidental Release Prevention and Emergency Response Policies at GFS\n\nGFS has established policies and developed emergency response teams to protect the safety of their workers and the public.  Their Environmental Policy Statement describes GFS's commitment to release prevention in the following phrases:  \n\n\"Gordon Food Service is committed to excellence and leadership in protecting the environment.  We strive to minimize adverse impact on the air, water, and land through pollution prevention and energy conservation.  ...Gordon Food Service seeks to demonstrate its responsible corporate citizenship by adhering to all environmental regulations.  We promote cooperation and coordination between industry, government, and the public toward the shared goal of preventing pollution at its source.\"\n\n\n\nAdditionally, GFS's Corporate Safety Policy defines GFS's commitment to the safety of its workers and surrounding community in the following phrases.\n\nThe protection of human life is one of our most important objectives in the course of conducting business.  The safety of all those associated with GFS, including the general public, cannot be compromised.  It is our goal to operate in both a safe and productive manner. ...The preservation of people, equipment, and merchandise will enable us to be a quality supplier.  ...These unwanted events can be prevented through \"know-how\" and a willingness to do our jobs in a safe manner.  These responsibilities rest with every one of us, and will be a part of our performance object"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39021,
      "SummaryText": "ives.\n\n\n\nGFS demonstrates their commitment to preventing releases to the environment by being actively involved with the Livingston County Local Emergency Planning Commission (LEPC).  GFS has developed in conjunction with the Livingston County LEPC a Chemical Emergency Response Plan & Standard Operating Procedures (Emergency Response Plan) for GFS's Brighton Distribution Center.  The stated purpose of this Emergency Response Plan is:\n\n* To ensure the safety of Emergency Response Team Personnel during a hazardous materials emergency.\n\n* To provide adequate safety precautions in protecting Gordon Food Service employees and the public from harm caused by a chemical release.\n\n* To provide the Emergency Response Team with management direction during all operations directly related to a hazardous material emergency.\n\n\n\nGFS has developed and trained a HAZMAT team, in accordance with all applicable OSHA regulations; to implement their established policies and the procedures established in this Emergency Response Plan.  The HAZMAT team is supported and sufficient resources have been provided to this HAZMAT team by GFS's upper management.\n\nSite Description and Substances Handled\n\nGordon Food Service (GFS) distributes general grocery items to restaurants, cafeterias, and Marketplace stores throughout the Midwest.  GFS utilizes refrigerated warehouses (Distribution Centers) to receive product from venders, which is then distributed to Marketplace stores and clients within a 250-mile radius.  The Brighton Distribution Center for GFS is located in an industrial park east of the City of Brighton, Michigan. \n\n\n\nThe structure of the Brighton Distribution Center consists of a warehouse building subdivided to house building maintenance; administration; dry, refrigerated, and frozen product inventory; and unloading and loading dock areas.  Refrigerated and frozen inventory cooling at the Brighton Distribution Center is provided by an anhydrous ammonia refrigeration system located withi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39021,
      "SummaryText": "n the Distribution Center.  The storage and use of the anhydrous ammonia is the only substance used by GFS that is subject to the Risk Management Plan (RMP) requirements.  The refrigeration system at the Distribution Center contains approximately 23,000 pounds of anhydrous ammonia.  The refrigeration system consist of the following basic elements:\n\n* compressor,\n\n* high pressure receiver,\n\n* liquid pump,\n\n* evaporator,\n\n* condenser, and \n\n* associated piping and valves.\n\n\n\nRefer to the attached process flow diagram for further design of the refrigeration system at the Brighton Distribution Center.  This refrigeration system is a closed loop system that requires minimal amounts of additional anhydrous ammonia on a yearly basis.  \n\nAmmonia System Design \n\nThe major components of the refrigeration system including the high-pressure receiver at the Brighton Distribution Center are within the warehouse facility itself in an enclosed concrete block room (compressor room).  The chillers are suspended from the ceiling of the warehouse throughout the refrigerated and frozen food product areas.  The only exterior components (outside of the Distribution Center building itself) of the refrigeration system is the condenser and associated piping and valves.  The compressor room has only two access points.  One access point is a door that opens into the warehouse itself and the second access point is a door that leads directly to the outside of the facility that remains continuously locked from the inside. \n\nWorst-Case Release Scenario \n\nThe Environmental Protection Agency (EPA) has defined a worst-case release as \"the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint\".  Basically, a worst-case release is a catastrophic event that destroys the process and/or storage vessels and causes and immediate release of all stored materials.  In order to determine the impact of a worst "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39021,
      "SummaryText": "case accidental release of ammonia to off-site receptors (public), an off-site consequence analysis was conducted.  RMP*Comp(tm), developed by the National Oceanic and Atmospheric Administration (NOAA) and the Environmental Protection Agency (EPA), was the model utilized to perform the calculations for the offsite consequence analysis. The following site-specific parameters and required default parameters were utilized to conduct the offsite consequence analysis for the Brighton Distribution Center:\n\n* Quantity of ammonia liquefied under pressure: 12,114 pounds (present in the largest single vessel - high-pressure receiver (site-specific value)\n\n* Height of Release:  ground level (default value)\n\n* Release Duration: 10 minutes (default value)\n\n* Mitigation Measures:  Release in enclosed space in direct contact with outside air due to the presence of two doors one of which leads outside (default value)\n\n* Topography: Urban Surroundings (site-specific value)\n\n* Wind Speed: 1.5 meters/second (default value)\n\n* Stability Class: F (default value)\n\n* Air Temperature: 77 degrees Fahrenheit (default value)\n\n* Compressor Room volume:  59,616 ft3 (site-specific value)\n\n\n\nSince the High Pressure Receiver is located within the warehouse, a calculation was performed to assess if the building would fail as a result of the release.  The following equation was utilized to determine the building strength as recommended by the EPA:\n\nCompressor Room Volume/Quantity of ammonia \n\n59,616 ft3/12,114 pounds = 4.92 ft3/pounds\n\n\n\nSince the answer is greater than 0.1ft3/pound, then the building will be able to sustain and contain an ammonia release.  Therefore, the default values for a Mitigated Release will be able to be utilized for calculating the estimated distance to the Toxic Endpoint.  Next, site specific values and default values were input into the RMP*Comp(tm) model to calculate the estimated distance to the Toxic Endpoint.  The calculated result is 1.0 miles.  \n\n\n\nIn order for a re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39021,
      "SummaryText": "lease of this magnitude to occur, all automated and engineered fail-safe mechanisms would have to have been destroyed.  Basically, a catastrophic event like a tornado, earthquake, or explosion would have to destroy the High Pressure Receiver located inside the warehouse instantaneously to meet the assumptions required by a worst case scenario.  Since the High Pressure Receiver is located in the Compressor Room that has limited access and has no vehicle traffic it is highly unlikely that a catastrophe of this magnitude would occur damaging this vessel.  \n\n\n\nAdditionally, the compressor room has only one door that leads to the outside of the facility and it is locked from the inside.  This door is only used for emergency purposes.  Therefore, there are no direct outlets present for a release of anhydrous ammonia to impact outdoor air.  \n\nAlternate Release Scenario\n\nGFS has reviewed their ammonia refrigeration system to determine a more likely release scenario.  The Process Hazard Analysis conducted in accordance with OSHA's Process Safety Management Standard 29 CFR 1910.119 indicated that a release caused by a hole in piping caused by corrosion or a leaking valve along the piping run located on the roof of the warehouse is a more plausible release scenario.  Under normal operating conditions, the rooftop piping and associated valves are operating under 175 psig.  The alternate release scenario was calculated assuming a valve was damaged creating a 1.5 inch hole (diameter of the valve).  The release rate was calculated utilizing the Bernoulli Equation:\n\nQR = HA x (203)(Pg)1/2\n\nWhere:    QR = Release rate (pounds/minute)\n\n    HA = Hole area (square inches)\n\n    Pg = Gauge pressure (psig)\n\n\n\nUsing this equation, the release rate was calculated to be 4,972 pounds of anhydrous ammonia per minute could be released if the valve was damaged.  Inputting the calculated release rate of 4,972 pounds/minute and the default release duration of 60 minutes into the RMP*Comp(tm) model, an esti"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39021,
      "SummaryText": "mated distance to the Toxic Endpoint was calculated to be 0.5 miles.  This radius of impact is significantly smaller than the worst case scenario however, it does meet the requirement for off-site impact.  \n\n\n\nThe alternate release scenario model assumes that all of the engineered fail safe measures present in the ammonia refrigeration system at GFS including automatic and manual alarms and shutoff mechanisms fail.  Therefore, the odds of the alternate release scenario described above occurring are still very low.  Additionally, that ammonia vapor cloud that would form when a release occurred would dissipate in the direction of the wind predominantly west-southwest.  This would significantly reduce the ammonia radius of impact by only affecting the public located immediately downwind of the release.  \n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nTo prevent the accident release scenarios described above and others outlined in GFS's Process Hazard Analysis at the Brighton Distribution Center, GFS has implemented an aggressive prevention program within the last four years.  GFS has made a commitment to understand the environmental aspects and safety aspects of the refrigeration system operations.  In response to this increased knowledge and awareness, GFS has devoted much time and effort to insuring the refrigeration system at the Distribution Center is working efficiently, effectively, and safely for not only on-site employees but also the residents and public areas surrounding the Distribution Center.  \n\n\n\nGFS is subject to the OSHA Process Safety management (PSM) requirements.  Therefore, the PSM GFS has instituted is in compliance with these standards, at minimum.  GFS's prevention program includes the following:\n\n* Daily manual and automated pressure checks of temperature and pressures in engine room.\n\n* Weekly inspection of exterior insulation, valve stations, and piping runs.\n\n* Bi-weekly leak checks of all valves and valve stat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 39021,
      "SummaryText": "ions.\n\n* Preventative maintenance program based on observations from inspections.\n\n* Inspections of Preventative Maintenance Work Orders and daily/weekly inspections to ensure they are completed properly and in a timely fashion.\n\n* Utilization of a software system (Maximo) to assist GFS in monitoring the preventative maintenance program for both Distribution Centers.\n\n* Systematically upgrading refrigeration system equipment and components.\n\n* Installation of Industrial Refrigeration Thermal Insulation as a vapor barrier system to all refrigeration vessels, valves, piping, and fittings including hot gas lines to the system and defrost/condensing temperature.\n\n* Equipping each refrigeration system with alarms, and automated activation of relief valves and automated shutdown once the system reaches dangerously high levels of pressure.\n\n* Development of a HAZMAT team and an Emergency Action Plan to effectively respond to any potential accidents and leaks specifically relating to the refrigeration system in accordance with OSHA Standard 29 CFR 1910.120 and 29 CFR 1910.38(a), respectively.  \n\n* Emergency response training for all HAZMAT team members.\n\n* All necessary communication equipment and personal protective equipment to respond to an anhydrous ammonia release are provided and maintained by GFS.\n\n\n\nIn addition to these measures, GFS has implemented an Employee Training Program for Refrigeration Technicians.  The Training Program includes both on-site and off-site training seminars through the University of Wisconsin, the Manufacturer (Vilter and Frick) and training modules and competency tests developed and supplied by the International Institute of Ammonia Refrigeration (IIAR).  Training is completed by each Refrigeration Technician on an annual basis.  \n\nFive-Year Accident History\n\nAn accidental release of anhydrous ammonia has never occurred at the Brighton Distribution Center and this system has been in operation for over 10 years. \n\nEmergency Response Program\n"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 39021,
      "SummaryText": "\nGFS has developed an extensive Emergency Response Program to respond to a chemical release from the anhydrous ammonia refrigeration systems at the Brighton Distribution Center.  GFS has developed in conjunction with the Livingston County LEPC an Emergency Response Plan for the Brighton Distribution Center.  The Emergency Response Plan details:\n\n* pre-emergency planning procedures, \n\n* GFS's Emergency Response Team organizational structure, \n\n* training requirements, \n\n* emergency recognition and prevention procedures, \n\n* emergency alerting procedures, \n\n* evacuation procedures, \n\n* emergency medical services, \n\n* emergency response procedures, \n\n* medical surveillance procedures, and\n\n* post emergency response critique procedures. \n\n\n\nEmergency response personnel are available to respond to a release 24 hours per day seven days per week.  GFS has provided not only employee training but all necessary resources needed to adequately, quickly, and safely respond to and mitigate a release of anhydrous ammonia.  All HAZMAT team members are provided personal protective equipment, first aid equipment, and two-way radios.  All Emergency Response Equipment is maintained in \"ready\" condition at all times.  \n\n\n\nAdditionally, GFS has coordinated with the Green Oak Fire Department, the Green Oak Township Police Department, area hospitals and local emergency response companies to ensure all parties are aware of their roles and responsibilities in the event a release does occur. GFS has established protocol to bring in the local authorities and inform the surrounding public when an accidental release of anhydrous ammonia exceeds 100 pounds.  By the direction of the Livingston County LEPC, off-site notification comes from the Local Fire Department.  Upon their contact they assume the leadership role for emergency response and make all off-site evacuation and sheltering communications to the community.\n\n\n\nGFS employees required to do work in and around the anhydrous ammonia refrige"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 39021,
      "SummaryText": "ration system, are trained and annually updated in accordance with the MIOSHA Hazardous Waste Operations and Emergency Response Standard, Michigan Administrative Code R325.52101et seq.  These training programs include:\n\n* First Responders at the Awareness Levels\n\n* Hazardous Materials Technicians, \n\n* On Scene Incident Commander\n\n* First Aid Training, and\n\n* Cardiac Pulmonary Recitation (CPR) Training.\n\n\n\nTo ensure response procedures and employee training is complete and up to date, GFS conducts mock emergency response scenarios on a quarterly basis.  After completing each mock emergency response scenario the HAZMAT Team reviews the methods and procedures followed to coordinate the response effort and mitigate a release to assess their effectiveness and to determine if changes to response procedures are necessary.  \n\n\n\nIn any event, GFS is fully prepared to respond to an accidental release of anhydrous ammonia and more importantly protect GFS employees, and people living and working around the Brighton Distribution Center.  \n\nPlanned Changes to Improve Safety\n\nIn the last four years, GFS has made many improvements in employee training, operations and procedures that involve the refrigeration system at the Brighton Distribution Center.  These changes have increased the safety for all on-site employees and significantly reduced the risk of a release of anhydrous ammonia from not only occurring but also from migrating off-site and impacting the surrounding residences and businesses.  GFS is committed to continually improve the operations of the refrigeration system to continue to reduce the threat of a release occurring.  As part of GFS's continual improvement commitment, several changes are proposed for the immediate future.  These changes include but are not limited to:\n\n* Continually enhancing the Employee Training Program to allow GFS to obtain the best available information and technology for improving refrigeration system efficiency and safety,\n\n* Expanding the "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 39021,
      "SummaryText": "management system developed to address anhydrous ammonia as required by the OSHA Process Safety Management Standard and the RMP to include all chemicals that pose a risk by developing an Integrated Contingency Plan.\n\n\n\nGFS is considering adopting the principles and management characteristics of an ISO 14000 Environmental Management System to manage environmental, health and safety compliance issues consistently throughout GFS's diversified organization.  An Environmental Management System is a proactive voluntary initiative that a company commits itself to going beyond compliance.  This system will allow Gordon Food Service to seek improvements in their effort to manage, control and potentially eliminate the risks associated with GFS's daily operational tasks.  \n\n\n\n"
    }
  ]
}