{
  "FacilityID": 39061,
  "FacilityName": "United Cooperative/Stratford",
  "FacilityStr1": "719 Commercial Street",
  "FacilityStr2": null,
  "FacilityCity": "Stratford",
  "FacilityState": "IA",
  "FacilityZipCode": "50249",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19079",
  "LEPC": "Region 5 LEPC",
  "FacilityLatDecDegs": "42.268833",
  "FacilityLongDecDegs": "-093.924389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 878043462,
  "ParentCompanyName": "United Cooperative/Webster City",
  "Company2Name": null,
  "CompanyDUNS": 87270070,
  "Company2DUNS": 0,
  "OperatorName": "United Cooperative",
  "OperatorStr1": "1932 West 2nd Street",
  "OperatorStr2": null,
  "OperatorCity": "Webster City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50595",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jack McGonegle",
  "RMPTitle": "Assistant Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071691",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-02 00:00:00",
  "SafetyInspectionBy": "Iowa Department of Ag",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.26885,
  "FRS_Long": -93.92856,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56163,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 39061,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57466,
          "ProcessID": 56163,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74249,
          "ProcessID": 56163,
          "ChemicalID": 56,
          "Quantity": 452414.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574249,
          "ProcessID": 56163,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39061,
      "SummaryText": "The accidental release prevention policy at United Cooperative involves, but is not limited to technologies, procedures, and management practices.  All applicable procedures of the ANSI K-61.1 - 1989 revision of the \"Safe Requirements for the Storage and Handling of Anhydrous Ammonia,\"  as adopted by the Iowa Department of Agriculture and Land Stewardship (IDALS) are adhered to.  Our emergency response policy involves the preparation of response plans that are tailored to our facility and to the emergency response service available in our community, and is in compliance with the EPA Emergency Response Program requirements.\n\nThis facility is in the business of selling anhydrous ammonia to farm customers as a form of nitrogen fertilizer.  The facility has two anhydrous ammonia storage tanks, one with 26,000 gallons water capacity, the other with 12,000 gallons water capacity, 43 nurse tanks at 1,450 gallon capacity, and 3 nurse tanks at 1,000 gallon tanks.  The storage tanks, several anhydrous ammonia nurse tanks, risers for filling nurse tanks, electrical panels, lighting, and safety equipment are all parts of this facility's anhydrous ammonia operation.  The facility is manned during the season and is operational through normal business hours.\n\nThe off-site consequences analysis includes two anhydrous ammonia release scenarios, identified as \"worst-case\" release and \"alternative\" release scenario.  The first scenario is defined by EPA and shall assume the maximum quantity of one vessel is released as a gas in 10 minutes due to a catastrophic break.  The alternative release scenario is defined as a more likely accidental release of anhydrous ammonia caused by a transfer hose failure.\n\nThe \"worst-case\" release scenario involves a catastrophic failure of the largest tank, releasing the entire 113,815 pounds of anhydrous ammonia.  The off site consequences were calculated using \"TFI's RMP Guidance for Ammonia Retailers\".  The worst case scenario used EPA's recommended w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39061,
      "SummaryText": "ind speed of 1.5 meters per second with a \"F\" atmosphere stability class.  A rural topography was selected as typical.  The distance to the endpoint was 2.43 miles.  It is estimated that 1290 people would be affected by this release.\n\nThe \"alternative release\" scenario assumed a hose breaks and leaks 7,200 pounds of anhydrous ammonia.  The EPA recommended wind speed of 3.0 meters per second with a \"D\" atmospheric stability class was used in this scenario.  Using urban topography and \"TFI's RMP Guidance for Ammonia Retailers\" the toxic endpoint is .46 mile.  The population with in that area is estimated to be 1,215 people.  The assumption is that the duration of the release is 2 minutes because equipment, excess flow valves, and human intervention will stop the leak.\n\nUnited Cooperative coordinates annual visits with the local fire department to review the systems and procedures for response to a leak.\n\nUnited Cooperative has several key elements in it's accident prevention plan:\n1. The anhydrous ammonia sytem adheres to the laws and regulations that are based on the 1989 revision of the ANSI K61.1 adopted in 1990 by the State of Iowa.\n2. Annual training is required of all personnel on handling, transferring, or transporting anhydrous ammonia.  The training includes properties of ammonia, safe handling practices, first aid, and emergency response.\n3. Use of good management practices as specified by industry standards and training aids.\n4. Frequent site inspections by management and safety consultants.\n5. Annual inspections by IDALS fertilizer inspectors include safety equipment, tanks, and handling equipment.\n6. Use of proper anhdyrous ammonia personal protective equipment and safety equipment.\n\nChanges are made in the system when necessary or when required by regulation change.  Periodic evaluation of the procedures help to determine whether or not a change in operation should be made to provide increased safety to the operators and to the community."
    }
  ]
}