{
  "FacilityID": 39143,
  "FacilityName": "Red Cedar Gathering  Company, Coyote Gulch Plant",
  "FacilityStr1": "Sec 17, T32N, R11W",
  "FacilityStr2": "Rural La Plata County",
  "FacilityCity": "Durnago",
  "FacilityState": "CO",
  "FacilityZipCode": "81303",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08067",
  "LEPC": "Region IX LEPC",
  "FacilityLatDecDegs": "37.014580",
  "FacilityLongDecDegs": "-108.060880",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 872966460,
  "ParentCompanyName": "Southern Ute Indian Tribe",
  "Company2Name": "Kinder Morgan Energy Partners",
  "CompanyDUNS": 123600046,
  "Company2DUNS": 123600046,
  "OperatorName": "Red Cedar Gathering Company",
  "OperatorStr1": "125 Mercado St., Suite 201",
  "OperatorStr2": null,
  "OperatorCity": "Durango",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81301",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188325",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "V-SU-0012-05.03",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-10-29 00:00:00",
  "DeRegistrationEffectiveDate": "2017-01-31 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56287,
      "AltID": null,
      "FacilityID": 39143,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74390,
          "ProcessID": 56287,
          "ChemicalID": 93,
          "Quantity": 31989.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 57594,
          "ProcessID": 56287,
          "NAICSCode": "211111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39143,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-03-23 00:00:00",
    "ERTrainingDate": "2009-05-12 00:00:00",
    "CoordinatingAgencyName": "Fort Lewis Mesa",
    "CoordinatingAgencyPhone": "9705883400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39143,
      "SummaryText": "Executive Summary\n\n1. Accidental release prevention and emergency response policies:\nRed Cedar Gathering Company's Coyote Gulch treating plant removes water and carbon dioxide from coal bed methane gas.  RCGC Coyote has implemented the elements of a Program 1 Risk Management Plan (RMP) and all the elements of OSHA's Process Safety Management (PSM) program.\nRed Cedar Coyote Emergency Response Plan is site-specific. It includes required actions by plant employees as well as required notification and coordination with local responders and agencies. All employees are trained in the execution of the Emergency Response Plan and drills are conducted annually.\n\n2. The regulated substance handled by this facility is methane.  The purpose of this treating facility is to remove impurities from the methane gas (water and carbon dioxide) and compress the gas into transportation pipelines.  Methane gas is not stored at this facility.\n\n3. The general accidental release prevention program and specific steps.\nThe RCGC Coyote has implemented all the elements of a Program 1 Risk Management Plan (RMP) and all the elements of OSHA's Process Safety Management (PSM) program. Key element of these programs include:\n\nProcess Safety Information: Technical information and documents are used to help maintain safe operation of the process, make decisions and perform process hazard analysis.  \n\nProcess Hazard Analysis (PHA): A systematic examination of the plant to identify possible hazards and ensure that adequate controls are in place to manage these hazards.  \n\nOperating Procedures: RCGC Coyote maintains written procedures that address all modes of operation, including a) initial start-up, b) normal operations, c) temporary operations, d) emergency shutdown, e) emergency operations, f) normal shutdown, and g) start-up after turnaround.  \n\nContractors: RCGC Coyote uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  The RCGC Coyote ha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39143,
      "SummaryText": "s procedures in place to ensure that contractors, a) perform their work in a safe manner, b) are aware of any hazards in the workplace, c) are aware of what they should do in the event of an emergency, d) understand and follow site safety rules, and e) inform plant personnel of any hazards that they find during their work.\n\nPre-startup Safety Reviews (PSSR's): The RCGC Coyote has implemented the use of PSSR's is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to being placed in service.  \n\nMechanical Integrity: The RCGC has developed practices and procedures to maintain the integrity of process equipment, piping and emergency shutdown systems.  \n\nSafe Work Practices and Procedures: The RCGC Coyote has developed safe work practices including a) controlling personnel entering the plant, b) ensuring isolation of energy sources for equipment undergoing maintenance through lock out and tag out, c) Safe Work a procedure used by RCGC operated under the control of its management, to provide for the safety and health of its employees, contractors and the public and to protect the environment against harm d) hot work procedures and permits for work with the potential for generating ignition sources, and e) confined space entry permits and procedures.   \n\nTraining: The RCGC Coyote has developed training programs for all personnel operating or maintaining the processes.  The training programs include classroom, OJT, demonstration and computer-based training. Employees are tested to demonstrate competency.\n\nManagement of Change: The RCGC Coyote uses MOC to manage changes by performing reviews to ensure that adequate controls are in place for any new processes or changes to processes.  \n\nIncident Investigation:  The RCGC Coyote has developed an incident investigation program to determine the causes an incident or near miss and to take actions to prevent recurrence.\n\nCompliance Audits: Audits are conducted in accord"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39143,
      "SummaryText": "ance with the requirements of PSM and RMP regulations.\n\n4. Five-year accident history:\nNo release of a regulated substance as defined in the EPA Risk Management Plan (RMP) regulation has occurred in the past 5 years. \n\n5. Emergency Response:\nThe facility's emergency response is based on OSHA's 1910.38 (Employee emergency plans and fire prevention).  Employees have been instructed / trained to activate the Emergency Shut Down System and evacuate the facility in an emergency.  The Fort Lewis Mesa fire district personnel will not enter this facility in a fire or explosion emergency but may be summoned to control the public and any grass or shrub fires on surrounding property.  Fire district personnel will assist in caring for any resulting injuries.\n\n6.  Planned changes to improve safety:\nThis facility was constructed in 1995 and has had no major safety up-grades.  Being an OSHA 1910.119 Process Safety Management facility constantly places all elements of the process under scrutiny.  Safety issues are continuously addressed.\n"
    }
  ]
}