{
  "FacilityID": 39181,
  "FacilityName": "Daniel Electric Generating Plant",
  "FacilityStr1": "Hwy 63 N",
  "FacilityStr2": null,
  "FacilityCity": "Escatawpa",
  "FacilityState": "MS",
  "FacilityZipCode": "39552",
  "Facility4DigitZipExt": "0950",
  "FacilityCountyFIPS": "28059",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "30.531944",
  "FacilityLongDecDegs": "-088.556667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mississippi Power Company",
  "Company2Name": "Southern Company",
  "CompanyDUNS": 6964118,
  "Company2DUNS": 6925341,
  "OperatorName": "Mississippi Power Company",
  "OperatorStr1": "2992 West Beach Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Gulfport",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39502",
  "OperatorZipCodeExt": "4079",
  "RMPContact": "C. R. Berry",
  "RMPTitle": "Manager Environmental Quality",
  "FTE": 211,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136186",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1280-00090",
  "SafetyInspectionDate": "2000-05-15 00:00:00",
  "SafetyInspectionBy": "Insurance Carrier",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 30.53444,
  "FRS_Long": -88.55556,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56336,
      "AltID": null,
      "FacilityID": 39181,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57645,
          "ProcessID": 56336,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74440,
          "ProcessID": 56336,
          "ChemicalID": 56,
          "Quantity": 80400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574440,
          "ProcessID": 56336,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39181,
      "SummaryText": "Mississippi Power Company's Daniel Electric Generating Plant, located near Escatawpa, Mississippi, is a 2 Unit steam electric generating plant.  The new gas fired CTs  under construction will add approximately 1000 megawatts (MW) of electric power.  There will be two (2) identical nominal 500 mw \"blocks\"  of electric generating equipment.  The arrangements for each \"block\" are referred to as a two-on-one configuration.  Each \"block\" is comprised of two combustion turbines (CTs) each with a supplementary fired (duct burner) heat recovery steam generator (HRSG) that will supply steam to a single steam turbine.  Each \"block\" will also include two (2) Selective Catalytic Reduction (SCR) Systems for post combustion NOx control which utilize ammonia.  The first delivery of Anhydrous Ammonia is scheduled for February 16, 2001.\n\nIt is the policy of the facility to provide and maintain safe and healthful working conditions and to implement and adhere to operating practices that will safeguard all employees and result in safe working conditions and an efficient and environmentally safe operation.  The facility has a safety program designed to ensure that the employees' working environment is safe.  The program includes training and instructions.\n\nThe process at the natural gas fired CTs subject to the RMP regulations is the ammonia storage and dilution system.  This system is part of the Selective Catalytic Reductions system used to control emissions of nitrogen oxides generated from burning natural gas.  Ammonia will also be used in the treatment of the boiler water used in the facility.  \n\nBased on the EPA criteria, the worst-case release scenario at the facility is the catastrophic failure of the 18,000 gallon ammonia storage  tanks.  These tanks will be maintained at 85% capacity through administrative procedures.  This would result in the ammonia gas traveling a distance of 1.60 miles before it reached the endpoint.  However, this type failure is extremely unlikely due t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39181,
      "SummaryText": "o the safeguards described in the prevention program.  \n\nThe alternative release scenario utilized in the review was the release of ammonia due to a pressure relief valve operation and with incomplete closure.  A failure of this type would result in ammonia gas traveling 0.06 miles before reaching its endpoint.  There are numerous mechanical and procedural safeguards at the plant designed to prevent this from occurring.  However, for emergency response planning purposes, they were not considered in the alternative release scenario. \n\nThe accidental release prevention program at the Daniel Combined Cycle Facility is focused on the safe management of ammonia used in the ammonia storage and dilution system.  The first step in the prevention program at the plant was the establishment of a management system to assign overall responsiblity and responsiblity of the individual program elements.  Additional steps include:  ensuring process safety information on the ammonia storage and dilution system is accurate, complete, and up to date; ensuring the system is designed and modified safely by periodically conducting process hazard analyses; ensuring the system is operated and maintained in a safe manner by developing, maintaining, and implementing Standard Operating and Preventive Maintenance Procedures; ensuring contractors are qualified and oriented to the site hazards; and conducting periodic Compliance Audits and Incident Investigations including resolution of recommendations made during these investigations/reviews.\n\nPlant Daniel has not had any spills in the past five years.\n\nThe Daniel Combined Cycle Facility Emergency Plans are coordinated with Jackson County LEPC.  In addition, the plant has in place an emergency action plan that includes procedures to be followed in the event of an accidental release of ammonia.  The procedures cover the following:  evacuation plan; recognizing emergencies; emergency action procedures; coordinating personnel; first aid procedures; "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39181,
      "SummaryText": "notifying the public and local emergency response agencies; emergency response contacts; emergency reponse equipment; reportable release quantities and documenting releases; emergency alarm system; training; and pre-emergency coordination with the Jackson County LEPC."
    }
  ]
}