{
  "FacilityID": 39197,
  "FacilityName": "Ecusta Business Development Center, LLC",
  "FacilityStr1": "1 Ecusta Road",
  "FacilityStr2": null,
  "FacilityCity": "Pisgah Forest",
  "FacilityState": "NC",
  "FacilityZipCode": "28768",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37175",
  "LEPC": "Transylvania County LEPC",
  "FacilityLatDecDegs": "35.266689",
  "FacilityLongDecDegs": "-082.705588",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.nappcollc.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ecusta Business Development Center",
  "OperatorStr1": "P. O. Box 1119",
  "OperatorStr2": "1 Ecusta Road",
  "OperatorCity": "Pisgah Forest",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28768",
  "OperatorZipCodeExt": null,
  "RMPContact": "Devon McCall",
  "RMPTitle": "Manager of EBDC",
  "FTE": 74,
  "OtherEPAFacilityID": "28768CSTDVECUST",
  "EPAFacilityID": "100000033643",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "3644T18",
  "SafetyInspectionDate": "1998-09-30 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-04-04 00:00:00",
  "DeRegistrationEffectiveDate": "2008-03-31 00:00:00",
  "AnniversaryDate": "2009-06-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 35.25083,
  "FRS_Long": -82.69278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56363,
      "AltID": "Chlorine Tank Car",
      "FacilityID": 39197,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57672,
          "ProcessID": 56363,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74467,
          "ProcessID": 56363,
          "ChemicalID": 62,
          "Quantity": 220000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574467,
          "ProcessID": 56363,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 56364,
      "AltID": "Water Treatment Plant",
      "FacilityID": 39197,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57673,
          "ProcessID": 56364,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74468,
          "ProcessID": 56364,
          "ChemicalID": 62,
          "Quantity": 14600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574468,
          "ProcessID": 56364,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39197,
      "SummaryText": "The Ecusta Business Development Center (EBDC) is located in Pisgah Forest, North Carolina. It started operation at this site in 1939 and currently has approximately 1,200 employees. EBDC manufacturers dry-furnish pulp from non-wood products, primarily flax.\n                                                                                                                       \nThis facility at Pisgah Forest has a long history of cooperating with local response agencies, in particular, the Brevard Rescue Squad, the Brevard Fire Department and, more recently, the Transylvania Local Emergency Planning Committee.\n\nThis facility pledges to operate in a manner that is safe for our workers, the public, and the environment. As part of this commitment, the EBDC facility has established a system to help insure safe operation of the processes at this facility. One component of this system is a Risk Management Program that helps manage the risks in our chlorine use areas and that comply with the requirements of EPA?s 40 CFR 68 \"Accidental Release Prevention Requirements: Risk Management Programs\" and OSHA?s 29 CFR 1910.119 \"Process Safety Management of Highly Hazardous Chemicals.\"\n\n A. Accidental Release Prevention and Emergency Response Policies\n\nEBDC is committed to the safety of our workers and the public, and to the preservation of the environment through the prevention of accidental releases of hazardous substances. We implement reasonable controls to prevent foreseeable releases of hazardous substances. In the event of an accidental release, EBDC controls and contains the release in a manner that will be safe for workers and will help prevent injury to the public or the environment.\n\n B. EBDC Facility and Regulated Substances\n\nThe EBDC facility is a non-wood pulp mill that produces dry-furnish pulp.  The pulp is beached in either a chlorine based process or in a totally chlorine free (TCF) process. This facility handles only one substance regulated by RMP rule in sufficient"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39197,
      "SummaryText": " quantities to be covered.\n\n       As a result of the use of this regulated substance, the following two processes are covered by the RMP                                                                                                                                                                                                              Program                  Regulated               Process Quantity\n        Process                       Level                    Substance                    (Pounds)\nChlorine Tank Car                  3                         Chlorine                        220,000\nUnloading\n\nWater Treatment Plant           3                          Chlorine                        14,650\n\n C. Off-Site Consequence Analysis\n\nThe RMP rule requires that an off-site consequence analysis be conducted for a worst-case and alternate release scenario for the toxic substance chlorine.\n\nThe worst-case release scenario for chlorine is a failure of a 180,000-pound railroad tank car of chlorine at the chlorine railcar unloading area. The maximum distance to the toxic end point concentration is 21.6 miles. The residential population in this area is approximately 180,000 people and includes schools, residences, hospitals, prisons, recreation areas, and industrial areas. It would also include national or state parks, forests or monuments, wildlife sanctuaries, and federal wilderness areas. Although required by regulation, the worst case scenario is a scenario that will probably never happen. The Company has been in contact with the Chlorine Institute. According to their records, there has never been a catastrophic failure of a railcar at a user site or even at a producer's site.\n\nThe alternate release scenario for chlorine is a failure of the vaporizer gasket adjacent to the chlorine tank car unloading area. This scenario assumes that 20 pounds/minute of chlorine is released through a hole for thirty minutes before workers detect the release and isolate the va"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39197,
      "SummaryText": "porizer. The maximum distance to the toxic end point is 0.19 mile. Several houses are located within this distance with a total population of less than 140 people. No environmental receptors are within this distance.\n\n  D. Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe RMP rule requires a Program 3 prevention program for the chlorine tank car loading area and the Water Treatment Plant.\n\nThe prevention program is summarized in Chapter 18 \"Prevention Program\" of Volume 2 of the Process Safety Management Manual. Full details are given in the following chapters of Volume 1 of the Process Safety Management Manual:\n \n\n                                      PROCESS SAFETY MANAGEMENT\n         Program 3 Item             Chapter            Title\n\n        Hazard Review                   3                  Process Hazard Analysis\n\n        Operating Procedures         4                  Operating Procedures\n\n        Training                             5                  Training\n\n         Maintenance                     8                  Mechanical Integrity\n  \n         Incident Investigation         11                 Incident Investigation\n\n         Compliance Audit              13                Compliance With Safety Audits\n\n         Management Of Change    10                 Management Of Change\n\n         Pre-Startup Review            7                  Pre-Startup Safety Review\n\n         Contractors                       6                  Contractors\n\n         Employee Participation      1                  Employee Participation\n\n         Hot Work Permit               9                  Hot Work Permit\n\n   Industry standards are followed at the EBDC facility to help insure the safe handling of chlorine. The chlorine vendor supplies chlorine in a U.S. Department of Transportation approved railroad tank car. This railroad tank car is then used as an on-site supply for chlorine in the process. All piping, valves, vaporizers, etc. are consi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39197,
      "SummaryText": "stent with the Chlorine Institute standards. Workers who perform operations involving chlorine receive training emphasizing industry accepted handling procedures that are consistent with the Chlorine Institute and OSHA?s guidelines.\n\n E. Five-year Accident History\n\n   The EBDC facility maintains a five-year accident history that fulfills the requirements of the RMP rule. No releases of regulated substances have occurred from any of the chlorine areas in the last five years that have resulted in consequences of interest (such as, deaths, injuries, or significant property damage on-site; or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site).\n\n F. Emergency Response Programs\n   The EBDC facility has established a written emergency response plan that complies with the RMP rule and with other federal contingency plan regulations. The plan is described in detail in Chapter 12 of Volume 1 of the Process Safety Management Manual. This plan has been communicated to local emergency response officials through the local Emergency Planning Committee. Notifications have been made to all counties in North Carolina and South Carolina that may be affected under the worst-case modeling scenario. Regular dialogue is maintained between EBDC and the local Emergency Planning Committee, the local fire department, and the local rescue squad. Periodically, tours of the facility with representatives from these organizations are conducted emphasizing areas in which hazardous or toxic chemicals are stored or used.\n\n  G. Planned Changes To Improve Safety\n\nEBDC constantly strives to improve the safety of the processes through both an Incident Investigation Program and a program to reduce chlorine usage. The following change to improve process safety is planned or being seriously considered:\n\n1.  Various alternative bleaching sequences that will reduce or eliminate the use of chlorine in the pulp mill area are being investigated. This coul"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39197,
      "SummaryText": "d substantially reduce the area impacted under a worst-case scenario."
    }
  ]
}