{
  "FacilityID": 39413,
  "FacilityName": "Prairie Farms Dairy- Battle Creek",
  "FacilityStr1": "126 Brady Road",
  "FacilityStr2": null,
  "FacilityCity": "Battle Creek",
  "FacilityState": "MI",
  "FacilityZipCode": "49015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26025",
  "LEPC": "Calhoun County LEPC",
  "FacilityLatDecDegs": "42.337778",
  "FacilityLongDecDegs": "-085.275000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Prairie Farms Dairy, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6312995,
  "Company2DUNS": 0,
  "OperatorName": "Prairie Farms Dairy - Battle Creek",
  "OperatorStr1": "126 Brady Road",
  "OperatorStr2": null,
  "OperatorCity": "Battle Creek",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49015",
  "OperatorZipCodeExt": null,
  "RMPContact": "Terry Wuthrich",
  "RMPTitle": "Operations Manager",
  "FTE": 90,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188539",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56640,
      "AltID": "NH3 Refrigeration System",
      "FacilityID": 39413,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 57956,
          "ProcessID": 56640,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 74802,
          "ProcessID": 56640,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 574802,
          "ProcessID": 56640,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39413,
      "SummaryText": "\n1.0    SOURCE AND PROCESS DESCRIPTION\n\n1.1    SOURCE\n\nThe Prairie Farms Dairy in Battle Creek, Michigan is submitting this Plan \n\nto address the USEPA's Risk Management Program (RMP) for Accidental \n\nChemical Release regulation (40 CFR 68) because its refrigeration system, \n\nwhich contains anhydrous ammonia (CAS Number 7664-41-7) will exceed \n\nthe 10,000-lb. threshold in the future.  Anhydrous ammonia (NH3), is a \n\ngas at ambient conditions.  The anhydrous ammonia (ammonia) \n\nrefrigeration system is used to manufacture and store milk and related \n\ndairy products.  It is a closed system that may contain as much as 15,000 \n\npounds of ammonia in various physical states (gas, liquid, and saturated \n\nvapor) when fully charged.  The largest vessel is the high pressure \n\nreceiver that operates at approximately 150 psig and can contain as much \n\nas 11,760 pounds of liquid ammonia (at its maximum fill volume of \n\napproximately 75%).  However, during typical operation, the vessel \n\ncontains about 3,000 pounds of ammonia.  Most of the ammonia \n\nequipment is located indoors.  The condensing towers, receiver, and some \n\npiping runs are located outdoors.  The Battle Creek plant is located in a \n\nrural setting.\n\n\n\nAmmonia is the oldest and most common refrigerant in general industrial \n\nuse throughout the world.  It is a high capacity refrigerant that operates at \n\nreasonable pressure.  Although exposure to ammonia is irritating and \n\npotentially toxic in large doses, personnel exposure to more than a small \n\nleak is rare because ammonia operates within a closed system of vessels, \n\npiping, and equipment.  In addition, ammonia can be easily detected by \n\nsmell at levels well below its toxic endpoint.\n\n\n\n1.2    PROCESS DESCRIPTION\n\nThe anhydrous ammonia refrigeration system at the Battle Creek plant is \n\na single-stage system consisting of a discharge (high pressure) side and a \n\nsuction side.  Three screw compressors and one reciprocating compressor \n\ndraw suction from the suction accumul"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39413,
      "SummaryText": "ator (trap) at about 25 psig.  This \n\naccumulator receives suction gas from the ice water chiller, cooler units, \n\nglycol chillers, and refrigerated tanks and silos. Ammonia liquid which \n\ncollects in the accumulator is returned to the liquid line by a pumper \n\ndrum.  The major discharge from the high side compressors (hot gas) \n\n\n\n\n\nenters a roof-mounted condenser.  A portion of the hot gas is also used for \n\ndefrosting and for operation of the pumper drum.  The condensed liquid \n\nis returned to the high pressure receiver where it is fed to the refrigeration \n\nequipment.\n\n\n\nVarious safety systems are part of the anhydrous ammonia refrigeration \n\nsystem.   These include pressure relief valves and safety interlocks.  \n\nPressure relief valves protect the compressor discharge, condensers, \n\npumper drum, suction accumulators and other pressure vessels, and \n\nsuction lines from overpressurization.  Safety interlocks include high \n\npressure, low pressure, and oil pressure cut-outs for the compressors, as \n\nwell as high level floats for the accumulator.  The high level float turns off \n\nthe king valve to reduce the amount of liquid going to the system, sounds \n\nan alarm in the control room and shuts off the compressors.  The high \n\npressure cut-out for each compressor is set 190 to 200 psig.\n\n2.0    PREVENTION PROGRAM\n\nThe facility has carefully considered the potential for accidental releases \n\nof ammonia, such as the occurrence of the worst-case and alternative-\n\nrelease scenarios described in Section 2.0.  To help minimize the \n\nprobability and severity of an ammonia release, a prevention program \n\nthat satisfies the Occupational Safety and Health Administration (OSHA), \n\nProcess Safety Management (PSM) of Highly Hazardous Chemicals \n\nstandard (29 CFR 1910.119) has been implemented.  The key components \n\nof the prevention program are summarized below:\n\n\n\n?    The development, documentation, and operator availability of critical \n\nprocess safety information regarding the hazar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39413,
      "SummaryText": "ds of ammonia, the \n\ndesign basis of the system, and the equipment.  This information is \n\nused to fully understand and safely operate the ammonia refrigeration \n\nsystem.\n\n\n\n?    The development of an extensive employee participation program, \n\nwhich includes employees from all levels of the organization and from \n\nall areas within the plant (i.e., production and maintenance).  This \n\nprogram also assures that employees that utilize the ammonia system \n\nand are most knowledgeable about it are best able to easily, \n\neffectively, and regularly recommend changes or improvements which \n\nenhance safety.\n\n\n\n?    The performance of a formal process hazard analysis (PHA), using the \n\n\"What-if...\" technique.  A team with expertise in engineering, \n\noperations, maintenance, and safety evaluated the existing \n\nrefrigeration system in depth and developed recommendations to \n\nimprove the safety and operability of the system.  The PHA addressed:  \n\n(1) process hazards; (2) previous incidents; (3) engineering and \n\nadministrative controls applicable to the hazards; (4) the consequence \n\nof control failure; (5) facility siting; (6) human factors; and (7) a \n\nqualitative evaluation of possible safety and health effects of control \n\nsystem failures.  The PHA will be updated and revalidated every five \n\nyears.\n\n\n\n?    Written operating procedures (OPs) were prepared to provide the \n\nbasis for proper and safe operation of the ammonia refrigeration \n\nsystem.  The OPs include procedures for normal operation, startup, \n\nshutdown, emergency operation, and emergency shutdown.  They \n\nalso \n\ndescribe safe operating limits for temperature and pressure, the \n\n\n\n\n\nconsequences of operating outside these safe operating limits, and a \n\ndescription of safety systems and how they operate. \n\n\n\n?    Formal authorization systems (i.e., management of change procedure, \n\npre-startup safety review) are in place to ensure that system changes \n\nor expansions are as safe as the original design and that an \n\nindependent"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39413,
      "SummaryText": " recheck, prior to start-up, confirms that the changes are \n\nconsistent with the engineering design and safety requirements.  \n\n\n\n?    Events that might (or did) cause an accidental or unexpected release of \n\nammonia are subjected to a formal investigation.  The objective of the \n\ninvestigation is to correct deficiencies in such a way as to prevent \n\nrecurrence.\n\n\n\n?    Contractors that are hired to work on, or adjacent to, the refrigeration \n\nsystem are \"pre-qualified\" based upon their knowledge of ammonia \n\nrefrigeration, understanding of applicable codes and standards, and \n\ntheir demonstrated ability to work safely.  \n\n\n\n?    Prior to the performance of any hot work (i.e., spark or flame \n\nproducing operations such as welding, cutting, brazing, grinding), \n\nmanagement must approve the work by executing a written hot work \n\nauthorization permit to verify that precautions to prevent fire have \n\nbeen implemented.\n\n\n\n?    Periodic formal walk-throughs occur to find unusual or increasing \n\nvibration, incipient leaks, or other indications of potential upsets or \n\nfailures that could lead to a release.\n\n\n\n?    Replacement of all pressure relief valves is scheduled every five years.\n\n\n\n?    Numerous safety systems, including pressure relief valves, ammonia \n\nvessel level controls, and safety interlocks are used in the refrigeration \n\nsystem.\n\n\n\n?    Periodic inspection and calibration is performed on liquid level \n\nsensors, temperature and pressure instruments, switches and \n\nshutdown devices that have safety implications.\n\n\n\n?    Periodic inspections are performed for major powered equipment, \n\nincluding compressors, pumps and large fans, bearings, couplings, \n\nshaft seals, mountings, etc., for vibration or incipient mechanical \n\nfailure.\n\n\n\n?    Proper design, including adherence to recognized safety codes.\n\n\n\n?    Adherence to fire codes and preparation for fires, storms, or events \n\nwhich could impact the ammonia system.\n\n\n\n?    Planning with the local fire department to ensure a rapid response to "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39413,
      "SummaryText": "\n\npotential incidents involving the system or external events, such as \n\nstorms or tornadoes.\n\n\n\n?    Prevention program compliance audits are performed every three \n\nyears to verify that the elements are being properly implemented.  \n\nAny deficiency found in an audit is corrected.\n\n3.0    ACCIDENT HISTORY\n\nThe facility is new and there have been no accidental releases of ammonia \n\nat the facility (or at the operation's previous location) in the last five years \n\nthat have resulted in death, injury, or significant property damage on-site \n\nor off-site death, injury, evacuation, sheltering in place, property damage, \n\nor environmental damage.\n\n4.0    EMERGENCY RESPONSE PROGRAM\n\nThe facility has implemented a detailed written Emergency Action Plan \n\n(EAP).  The EAP is intended to address all emergencies at the facility, in \n\naddition to incidents related to a release of ammonia.\n\n\n\nThe EAP includes awareness and response training for employees, \n\ncoordination with the local fire department, and evacuation of the facility.  \n\nThe plan details what personal protective equipment and spill response \n\nequipment is available; identifies specific individuals, their 24-hour \n\ntelephone numbers, and their responsibilities; identifies procedures for \n\nemergency medical care; and refers to other pertinent elements of the \n\nmanagement system (i.e., standard operating procedures).\n\n\n\n\n\n\n\n\n\nENVIRONMENTAL RESOURCES MANAGEMENT    7    RMP FOR ANHYDROUS AMMONIA\n\n        EXECUTIVE SUMMARY AND DATA ELEMENTS\n\ns:\\prairief\\0008825\\xxxx\\reports\\rmp\\exec_sum_rev.doc        PRAIRIE FARMS DAIRY ? BATTLE CREEK, MICHIGAN\n\n        November 12, 2003\n\n\n\n\n\n"
    }
  ]
}