{
  "FacilityID": 39436,
  "FacilityName": "Growers Ice Company",
  "FacilityStr1": "1060 Growers",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.652778",
  "FacilityLongDecDegs": "-121.627778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dstephens1@growersice.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Donald Wells",
  "OperatorStr1": "1060 Growers",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 39,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166438",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "10335PTO",
  "SafetyInspectionDate": "2003-11-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 36.65356,
  "FRS_Long": -121.63015,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56688,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 39436,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 74873,
          "ProcessID": 56688,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58004,
          "ProcessID": 56688,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32613,
              "Process_NAICS_ID": 58004,
              "SafetyReviewDate": "2004-05-06 00:00:00",
              "PHA_Date": "2004-05-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-07-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-07 00:00:00",
              "TrainingReviewDate": "2002-05-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "MONTEREY COUNTY HEALTH DEPT. SAFETY TRAINING",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-01 00:00:00",
              "EquipmentInspectionDate": "2004-01-01 00:00:00",
              "EquipmentTested": "High side/Lowside Ice Generator",
              "ChangeMgmtDate": "2004-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-01-01 00:00:00",
              "PreStartupReviewDate": "2004-04-04 00:00:00",
              "ComplianceAuditDate": "2003-06-06 00:00:00",
              "AuditCompletionDate": "2003-08-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-12 00:00:00",
              "HotWorkPermitReviewDate": "2004-02-02 00:00:00",
              "ContractorSafetyReviewDate": "2004-02-02 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "PREVENTION PROGRAM DESCRIPTION",
              "_chemicals": [
                {
                  "PrimaryKey": 47403,
                  "PreventionProgram3ID": 32613,
                  "ProcessChemicalID": 74873
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 58005,
          "ProcessID": 56688,
          "NAICSCode": "312113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39436,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-07-23 00:00:00",
    "ERTrainingDate": "2002-05-02 00:00:00",
    "CoordinatingAgencyName": "Monterey County Health Dept.",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39436,
      "SummaryText": "GROWES ICE COMPANY\n1060 Growers Street\nSalinas, CA 93901\n\nFACILITY DESCRIPTION\n\nHistory of the Business\n\nGrowers Ice Company has been operating in the Salinas Valley since 1936.  Growers Ice Company considers safe operations to be a serious matter, for our employees benefit, as well as for the continued well being of the community in which we operate.  \n\nGrowers Ice Company has led the industry by requiring all of its Refrigeration Operating Engineer?s and Refrigeration Technician?s be RETA (Refrigeration Engineers and Technicians Association) certified.  Our operators are trained in safe operational procedures, set-up and safe maintenance procedures.  All Refrigeration Operating Engineer?s are trained in hazardous response training.  Training is updated yearly.\n\nThe maintenance department (typical mechanical maintenance) is trained in company hazardous response. Policies are written and maintained in the employee handbook and the business response plan.\n\nIn addition to the general response procedures, specific personnel are assigned certain duties to perform in the event of a spill or release.  Examples of such assignments are, evacuation and employee accountability, emergency vent fan location, relocation, radio or cell phone communication, etc.\n\nNATURE OF BUSINESS\n\nGrowers Ice Company is an industrial refrigeration and ice manufacturing company specializing in the manufacturing of ice and providing refrigeration for process cooling of fresh fruits and vegetables.\n\nThe post harvest cooling processes that are utilized include vacuum cooling, pressure cooling, hydro cooling, hydro vac cooling, ice making and ice injection. \n\nGrowers Ice Company also provides refrigeration for TWENTY FOUR (24) cold storage rooms within NINE (9) facility groupings (buildings) that are used for fresh vegetable processing and storage for various customers.\n\n\n\n\n\n\n\n\n\nNATURE OF HAZARD\n\nGrowers Ice Company, Salinas, CA , produce cooling and shipping facility uses anhydrous ammonia as a refr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39436,
      "SummaryText": "igerant for their produce pre-cooling, ice making and pressure cooling operations.  Anhydrous ammonia (NH3) is a gas in its natural state and attacks mucous membranes and lung tissue.  The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled.  Prolonged inhalation of high concentrations may cause bronchitis and or pneumonia, with some residual reduction in pulmonary functions.  Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frost bite, redness, pain and serious skin burn.\n\nTHRESHOLD DETERMINATION (40 CFT 68 115/CALARP 2780.2)\n\n1.    This facility is required to comply with Program 3 requirements since it exceeds the state threshold limit of 500 lbs and exceeds the federal threshold limit of 10,000 lbs. in one of the on-site fixed systems.\n\n2.    Public receptors are also located within the worst-case accidental release toxic end point area.\n\n\nACUTELY HAZARDOUS MATERIAL USES\n\nAnhydrous ammonia is used as the refrigerant in the cooling systems.  The cooling system consists of a single stage ammonia refrigeration system with a central plant and a piping loop distributing refrigerant throughout the site.  \n\nThis system contains approximately 140,000 lbs. of ammonia.  This is an engineering estimate based on calculations of the system volume.  The exact ammonia volume is not known due to the system?s age and the fact that the ammonia was not measured into the system.  The TPQ for ammonia is 500 lbs.\n\nThe main engine room is located at 1040 Growers Street.  The main condensers and receivers and the main liquid shutoff valve (King Valve) are located at 1140 Meeks Street.  The emergency ammonia diffuser system is located at 1140 Meeks Street and is only to be used in an absolute catastrophic emergency to relieve excess pressure.  There are wind socks located around the facility as an aid for evacuation.  A facility-wide computer system manufactured by Andover Corporation controls the tempe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39436,
      "SummaryText": "rature of the cold rooms, and operation of evaporators, compressors, and condensers.  Safeties are monitored on a real time basis and the computer will call the appropriate company responder.  In the event of an ammonia leak or related safety hazards, the ammonia detectors sense the leak, the computer monitoring system notifies the OPERATOR ON DUTY and ASSOCIATED PERSONNEL; the computer uses a phone pager routine to notify COMPANY RESPONDERS.  The location of the leak, parts per million concentrations information is displayed on the pagers or on the main engine room computers screen, and of the main office computer screen.  A third party (Sentry Alarm) monitors 2/3's of the facility 24 hours a day seven days a week.  In the event of a release of ammonia NH3 detectors located at several locations will activate and automatic call to the fire department and to responding parties at Growers Ice Co.  The remaining facility will eventually be monitored as well.\n\nPresently there are two (2) locations where portable compressor/condenser refrigeration trailer units are tied into the Growers Ice main refrigeration piping loop; 1166 Growers Street and 1101 Merrill Street.\n\nEquipment located at these addresses are local PLC and computer (Andover) controlled.\n\nRefrigeration Operating Engineers monitor and operate the equipment based on site cooling loads and seasonal demand.  Operational logs are taken and cooling issues resolved based on production demands.\n\nGROWERS ICE COMPANY RMP\n\nTABLE OF BINDERS\n\nThe Growers Ice Company facility is very large.  The Growers Ice Company RMP has a total of twelve (12) binders.  There is one RMP GENERAL BINDER for the whole facility, which has sections that apply to all the unique addresses.  All information in this RMP GENERAL BINDER applies to all the other site-specific addresses as if printed in each binder.  There are different site-specific binders for each of the TEN-(10) different addresses at the Growers Ice Company facility.\n\nThese bi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39436,
      "SummaryText": "nders contain information that is site-specific to each address.  This information includes equipment drawings, equipment information and process safety information.  The BUSINESS RESPONSE PLAN relates to all addresses.\n\nLIST OF BINDERS:\n\n    RMP General Binder\n\nGENERAL BINDER\n\n?    1060 Growers Street\n\nTHE SITE-SPECIFIC BINDERS ARE:\n\n?    1040 Meeks Street\n\n?    1055 Merrill Street\n\n?    1067 Merrill Street\n\n?    1069Merrill Street\n\n?    1080/1100 Growers Street\n\n?    1101 Merrill Street\n\n?    1107 Merrill Street\n\n?    1155 Merrill Street\n\n?    1166 Growers Street\n\n?    Business Response Plan\n \nACCIDENTAL RELEASE PREVENTION\n\nIn addition to the mandated prevention program elements listed in the RMP:\n\nThe Growers Ice Company facility utilizes visual inspection procedures prior to startup and shutdown of on-line cooling equipment.  This equipment includes compressors, condensers, and evaporation equipment as well as icemakers, vacuum coolers and air handling equipment.\n\nGeneral visual inspections are done throughout the day as starting or stopping of the equipment is required.\n\nInspections identify potential sources of problems and potential releases of ammonia.  Equipment corrections are then resolved by on-site personnel, registered engineers and refrigeration contractors as required. \n\nAs described above, Accidental Release Prevention is a continuing on-going process involving system inspection, emergency response program reviews and employee hazardous response training (performed yearly).   All new operating technicians are trained in safety and operational safeties specific to the operation of the refrigeration equipment.\n\nBusiness Response Procedures, and Emergency Response Procedures are updated yearly.\n\nPortable equipment, new to the site, is tested for operational safeties at the time of specific installation, typically at least once a year.\n\nAll ammonia refrigeration maintenance and operations personnel are required to be trained and become familiar with the company?s Safety and Operational Pr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39436,
      "SummaryText": "ocedures and Emergency Response Plan.  Regular safety meetings with recorded employee participation are required.  Records of attendance are in the main office.  Yearly local community hazards response training is made available to all refrigeration employees, refrigeration personnel are required to attend.  Air Pak Training (self-contained breathing apparatus) is conducted yearly and an updated fit test is done yearly, records are maintained in the main office.\n\nRETA certified personnel are trained in safe operating practices of the basic engine rooms and refrigeration systems.  Certificate of Achievement copies are maintained in employee files.\n\n \n\nEMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nEmergency Response policies are specifically noted in the RMP, with respect to a general overview; initial response is provided by on-site personnel.  On-site personnel will make a preliminary assessment in the event of a release and will provide first response (Growers Ice personnel are trained in response).  First response may include emergency shut down of equipment, system isolation, controlled operations, such as pump down to prevent or reduce an off-site release.\n\nEmergency response for a major release event will be provided by local fire and police departments with mutual aid from Growers Ice response employees.\n\nEmergency Response notification phone numbers are found in detail in the RMP, reporting Procedures.  Detailed phone numbers are updated yearly.  Evacuation maps are provided, windsocks are strategically located on the property to aid in determining prevailing wind and escape routes.\n\nAmmonia detection systems consist of detectors located throughout the property.  These detectors are monitored by a computerized monitoring system.  An automatic dialing system notifies Growers Ice Company personnel and supervisors depending on the severity of the leak.  A complete location of leak detectors is found in the RMP with appropriate maps and location detail.\n\n"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39436,
      "SummaryText": "A third party (Sentry Alarm) monitors 2/3's of the facility 24 hours a day seven days a week.  In the event of a release of ammonia NH3 detectors located at several locations will activate and automatic call to the fire department and to responding parties at Growers Ice Co.  The remaining facility will eventually be monitored as well.\n\n\n\n \n\n\nALTERNATIVE RELEASE SCENARIO ANALYSIS\n\nThis scenario considers the release of high-pressure gas from a ? inch pressure relief valve with a 250 psig set point.  Per the manufacturers data, a ? inch high capacity pressure relief valve, Henry Model No. 5602, has a relief rate of 43.3 lbs/min NH3 at 250 psig.  The total release is expected to be constant over a ten minute period.\n\nThe maximum extent of the release is 316 feet (0.06 miles) offsite.  This release can occur in any direction offsite from the facility.\n\nThe result of the release scenario analysis shows that no populations are impacted by this release.  This release is limited to this facility and immediately surrounding businesses and areas.\n\nThe release is assumed to occur at 0 feet elevation.  In reality, the pressure relief valves are typically \nlocated 12 feet off the ground or higher.  This will result in dispersion of ammonia at higher elevations.\n\n \n\nGENERAL ACCIDENTAL RELEASE PREVENTION\n\nThe Grower Ice company facility utilizes visual inspections procedures prior to starting and stopping of on-line cooling equipment.  This equipment includes compressors, condensers, and evaporation equipment as well as ice-makers, vacuum coolers and air handling equipment.\n\nGeneral visual inspections are done throughout the work day as the starting/stopping of the equipment is required.\n\nInspections identify potential sources of problems and potential releases of ammonia.  Equipment corrections are then resolved by on-site personnel, registered engineers and refrigeration contractors as required.\n\nRefrigeration equipment will be reviewed for updates and changes when changes occu"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 39436,
      "SummaryText": "r or when new equipment is brought on site.\n\nAs described above, Accidental Release Prevention is a continuing ? on-going process involving system inspection emergency response program and employee hazardous response training is also performed yearly.  All new hires are trained in safety and operational safeties specific to the operation of the refrigeration equipment.\n\nBusiness Response Procedures, and Emergency Response Procedures are updated yearly.\n\nPortable equipment, new to the site, is tested for operational safeties at the time of specific installation, typically at least once a year.\n\nAll ammonia refrigeration maintenance and operations personnel are required to be trained and become familiar with the company?s Safety and Operational Procedures and Emergency response Plan.  Regular safety meetings with recorded employee participation is required, attendance records are maintained n the main office.  Yearly local community hazardous response training is made available to all employees, refrigeration personnel are required to attend.  Records of attendance are in the main office.  Air Pak Training (self contained breathing apparatus) is conducted yearly and an updated fit test is done yearly, records maintained in the main office.\n\nRETA certified operations personnel are trained in safe operating practices of the basic engine rooms and refrigeration systems.  Certificates of Achievement copies are maintained in the employee files.  \n\n \n\nFIVE YEAR ACCIDENT HISTORY\n\nNo reportable releases or accidents relating to the release of ammonia refrigerant have occurred in the last five years.\n\nReleases of ammonia, should they occur, will be responded to in accordance with company policy and procedures outlined in the RMP.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Growers Ice facility has implemented the state and county mandated ?Emergency Response Plan? (a.k.a. \"Business Response Plan\").  This plan outlines procedures for emergency ammonia release response as well as general f"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 39436,
      "SummaryText": "acility response.  Local community and business notification phone numbers are also found in the Emergency Response Plan.\n\n \n\nPLANNED SAFETY IMPROVEMENTS\n\nContinued response training, safety policy reviews and safety procedure reviews provide ?re-enforced? safe work practices.  Employee?s participation through on hands training ultimately makes the workplace and the community a safe place to be.\n\nBeing aware of potential problems and responding to a problem prior to emergency status is the preferred method of safety planning.  Pro-active mechanical maintenance of the ?system? includes a five-year relief valve change-out program, yearly compressor inspections, bearing replacements, paint and cleaning of equipment, etc.\n\nThe ?System? is also monitored by a computerized operating system.  The system safeties and alarms are recognized and responded to in a timely manner.\n\nAmmonia detectors (strategically placed) are being used in conjunction with automatic paging to key personnel.   The ?Operator on Duty?, received the page, the alarm is noted and responded to, emergency shut down buttons (switches) are strategically located to safely stop the engine room and related equipment.  A third party (Sentry Alarm) monitors 2/3's of the facility 24 hours a day seven days a week.  In the event of a release of ammonia NH3 detectors located at several locations will activate and automatic call to the fire department and to responding parties at Growers Ice Co.  The remaining facility will eventually be monitored as well.\n\nWe are currently developing a computer assisted first response information system   This system will give the Operator on Duty, data that will aid the ?first responder? in a safe approach to the ?alarm? site.  Wind direction, air speed, and in the case of an ammonia release, parts per million concentrations will be invaluable for the first response.  Key supervisors are also paged with the system key information, aiding hazardous response communication and respon"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 39436,
      "SummaryText": "ders.\n\nALTERNATIVE RELEASE SCENARIO ANALYSIS\n\nThis scenario considers the release of high-pressure gas from a ? inch pressure relief valve with a 250-psig set point.  Per the manufacturers data, a ? inch high capacity pressure relief valve, Henry Model No. 5602, has a relief rate of 43.3 lbs/min NH3 at 250 psig.  The total release is expected to be constant over a ten-minute period.\n\nThe maximum extent of the release is 316 feet (0.06 miles) offsite.  This release can occur in any direction offsite from the facility.\n\nThe result of the release scenario analysis shows that no populations are impacted by this release.  This release is limited to this facility and immediate surrounding businesses and areas.\n\nThe release is assumed to occur at 0 feet elevation.  In reality, the pressure relief valves are typically \nlocated 12 feet off the ground or higher.  This will result in dispersion of ammonia at higher elevations.\n\nadministrator"
    }
  ]
}