{
  "FacilityID": 39578,
  "FacilityName": "DEFS NGL Services, LP - Auburn Terminal",
  "FacilityStr1": "47 Kittyhawk Drive",
  "FacilityStr2": null,
  "FacilityCity": "Auburn",
  "FacilityState": "ME",
  "FacilityZipCode": "04210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23001",
  "LEPC": "Androscoggin County LEPC",
  "FacilityLatDecDegs": "44.046111",
  "FacilityLongDecDegs": "-070.296389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.defs.com",
  "FacilityEmailAddress": "gvrhoadarmer@duke-energy.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Duke Energy Field Services, LP",
  "Company2Name": null,
  "CompanyDUNS": 7118276,
  "Company2DUNS": 0,
  "OperatorName": "Duke Energy Field Services, LP",
  "OperatorStr1": "370  17th Street",
  "OperatorStr2": "Suite 2500",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": "5609",
  "RMPContact": "Gary Rhoadarmer",
  "RMPTitle": "Corp. RMP/PSM",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170496",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "07/22/04- Level 3 - Re-Sub(all 9 sec)-Ann.07/22/09",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 44.04661,
  "FRS_Long": -70.29642,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56914,
      "AltID": "Propane Wholesale Storage",
      "FacilityID": 39578,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58234,
          "ProcessID": 56914,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75184,
          "ProcessID": 56914,
          "ChemicalID": 98,
          "Quantity": 443520.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575184,
          "ProcessID": 56914,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39578,
      "SummaryText": "\nRMP ? Level III Propane Storage Facility\nDuke Energy Field Services, LP\nDEFS NGL Services, LP - Auburn Terminal\nEXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies:\n\nDEFS NGL Services, LP - Auburn Terminal is strongly committed to employee, public, and environmental safety.   This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our process.  Our emergency response program is based upon the NFPA 58 Requirements for LP-Gas Storage and NPGA's LP-Gas Safety Handbook/ Guidelines for Developing Plant Emergency Procedures/ How to Control LP-Gas Leaks and Fires.  In addition, if a release were to occur, we have coordinated a response plan with the Auburn Fire Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release..\n\nThe Stationary Source and The Regulated Substance Handled:\n\nThe primary purpose of this facility is to repackage and distribute propane to wholesale customers for use as a fuel.  Propane arrives at our facility via rail car and is stored in two (2) storage tanks.  This facility has equipment for unloading rail cars and transports and for loading transports.  Access to this site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.\nThe regulated substance handled at this facility is propane.  The maximum amount of propane that can be stored at this facility is 443,520 lbs.\n\nThe General Accidental Release Prevention Program and The Chemical-Specific Prevention Steps:\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1995 Edition and NFPA-70, 1993 Edition.  The following sections briefly describe the r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39578,
      "SummaryText": "elease prevention program that is in place at our stationary sources.\n\nSafety Information:\n\nAuburn Terminal maintains a detailed record of written safety information, which describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.\n\n\nHazard Review:\n\nA visual inspection methodology is used to carry out hazard reviews at our facility.  The reviews focus on operating procedures, equipment functions, and handling practices to identify possible hazards.  Any finding related to the hazard reviews are addressed in a safe and timely manner.\n\nOperating Procedures:\n\nFor the purposes of conducting safety activities within our covered processes, Auburn Terminal maintains written operating procedures.  These procedures address various modes of operation such as emergency shutdown system/ startup procedures, pre-operational visual inspection procedures, rail car unloading procedures, transport loading procedures, transport unloading procedures, and emergency shutdown system/ shutdown procedures.  The information is regularly reviewed and readily accessible to operators involved with the processes.\n\nTraining:\n\nAuburn Terminal has a comprehensive training program in place to ensure that employees are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently and have passed a written proficiency test.  Refresher training is provided yearly.\n\nMaintenance:\n\nAuburn Terminal carries out documented maintenance checks on process equipment to ensure proper functioning.  Maintenance activities are carried out by qualified personnel with previous training in these practices.  Furthermore, personnel are offered specialized training as needed. \nAny equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39578,
      "SummaryText": " \n\nCompliance Audits:\n\nAuburn Terminal conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective action required as a result of the audits is undertaken in a safe and prompt manner.\n\nIncident Investigation:\n\nAuburn Terminal promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of propane.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  All reports are retained for a minimum of 5 years.\n\nFive-year Accident History:\n\nThe Auburn Terminal has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\nEmergency Response Plan:\n\nAuburn Terminal has a written emergency response plan to deal with accidental release of propane.  The plan includes all aspects of emergency response including evacuations and notification of local emergency response agencies.  Our facility's emergency response plan is based upon the MPGA's LP-Gas Handbook/Guidelines for Developing Plant Emergency Response Procedures/How to Control LP-Gas Leaks and Fires.\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nPlanned Changes to Improve Safety:\n\nSeveral developments and findings have resulted in the implementation of the various elements of our accidental release prevention program.  Continued operator training, employee CTEP certification, and operational reviews are some of the major steps we want to take to improve safety at our facility.  These changes shall be imp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39578,
      "SummaryText": "lemented on an ongoing basis."
    }
  ]
}