{
  "FacilityID": 39577,
  "FacilityName": "Union Carbide Corporation - UCAR Emulsion Systems",
  "FacilityStr1": "12840 South Pulaski Road",
  "FacilityStr2": null,
  "FacilityCity": "Alsip",
  "FacilityState": "IL",
  "FacilityZipCode": "60803",
  "Facility4DigitZipExt": "1999",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.666389",
  "FacilityLongDecDegs": "-087.716667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.unioncarbide.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 157004144,
  "ParentCompanyName": "Union Carbide Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1289008,
  "Company2DUNS": null,
  "OperatorName": "Union Carbide Corporation",
  "OperatorStr1": "12840 South Pulaski Road",
  "OperatorStr2": null,
  "OperatorCity": "Alsip",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60803",
  "OperatorZipCodeExt": "1999",
  "FTE": 56,
  "OtherEPAFacilityID": "ILD069998078",
  "EPAFacilityID": "100000120139",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "031003AAF",
  "SafetyInspectionDate": "1999-06-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-02 00:00:00",
  "ErrorReportDate": "2004-09-02 00:00:00",
  "ReceiptDate": "2004-07-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMPlanner",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-07-13 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 41.666457,
  "FRS_Long": -87.716767,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 56913,
      "AltID": "UES Alsip Facility",
      "FacilityID": 39577,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75182,
          "ProcessID": 56913,
          "ChemicalID": 25,
          "Quantity": 67600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 75183,
          "ProcessID": 56913,
          "ChemicalID": 29,
          "Quantity": 312800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58233,
          "ProcessID": 56913,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32750,
              "Process_NAICS_ID": 58233,
              "SafetyReviewDate": "1998-07-10 00:00:00",
              "PHA_Date": "1999-10-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "Yes",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1995-09-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Catalytic Oxidizer",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-07 00:00:00",
              "TrainingReviewDate": "1999-02-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Certification Required",
              "MaintenanceReviewDate": "1999-05-27 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "Tested Monomer Mix Tank 5",
              "ChangeMgmtDate": "1999-06-05 00:00:00",
              "ChangeMgmtReviewDate": "1998-07-01 00:00:00",
              "PreStartupReviewDate": "1999-06-05 00:00:00",
              "ComplianceAuditDate": "1997-04-04 00:00:00",
              "AuditCompletionDate": "1998-01-16 00:00:00",
              "IncidentInvestigationDate": "1999-05-12 00:00:00",
              "InvestigationChangeDate": "1999-06-15 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-24 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-14 00:00:00",
              "ContractorSafetyEvalDate": "1998-03-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 47617,
                  "PreventionProgram3ID": 32750,
                  "ProcessChemicalID": 75182
                },
                {
                  "PrimaryKey": 47618,
                  "PreventionProgram3ID": 32750,
                  "ProcessChemicalID": 75183
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39577,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-15 00:00:00",
    "ERTrainingDate": "1999-04-28 00:00:00",
    "CoordinatingAgencyName": "Alsip Fire Department",
    "CoordinatingAgencyPhone": "7083856902",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39577,
      "SummaryText": "UNION CARBIDE CORPORATION\nUES ALSIP, IL PLANT\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n1. Accidental Release Prevention and Emergency Response\n     Policies\n\nThe Union Carbide UCAR Emulsion Systems Alsip Plant is committed to operating and maintaining all of our processes in a safe and responsible manner.  We have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include both Union Carbide's Responsible CareÒ requirements and governmental requirements, such as the Environmental Protection Agency's (EPA) Risk Management Program (RMP) rule and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.\n\n2. Description of the Facility and Regulated Substances\n\nThe Union Carbide UES Alsip Plant is a manufacturing facility that produces synthetic latex  polymer products, which are sold to customers that convert them into finished products such as latex paint, caulk and adhesives.  The RMP rule requires that if a facility, such as the UES Alsip Plant, has a specific amount (threshold) or more of any one of 140 toxic and flammable chemicals, the facility must follow the RMP rule requirements for that chemical.  The Union Carbide UES Alsip Plant has the following RMP-regulated toxic substances at levels above threshold quantities: \n\n· Acrylonitrile (2-Propenenitrile)\n· Vinyl Acetate Monomer (Acetic acid ethenyl ester)\nThe Alsip Plant has no RMP-regulated flammable substances.\n\n3. Key Offsite Consequence Analysis Scenarios\n\nEPA¿s RMP rule requires that we provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these hypothetical scenarios.  Unless otherwise specified, no credit was taken for administrative controls or mitigation measures in evaluating the off-site impac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39577,
      "SummaryText": "t of the scenarios.  Chemical-specific steps to prevent these scenarios from occurring, and to mitigate their effects should they occur, are shown immediately after the scenario description.  The plant's general accident prevention program is described in Section 4.\n\n\nA)  Regulated Toxic Chemicals \n\nWorst-Case Release Scenario ¿\n\n· Vinyl Acetate:  This scenario assumes a rail car ruptures, releasing instantaneously 195,000 pounds of vinyl acetate as a liquid to the graveled surface beneath the rail car.  According to EPA¿s Offsite Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.  \n\nSpecific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n\n· Fire Water Monitors:  Area fire water spray monitors can be used to help suppress Vinyl Acetate vapors and to keep a fire from causing a tank car explosion.\n\n· Inhibitor:  The vinyl acetate contains an inhibitor that prevents reactions from occurring in a rail car that could lead to over pressure.\n\n· Rail Traffic Control:  To prevent possible collision and rupture of the rail car with rail equipment derailers are used to prevent unexpected moves and collisions.  Additionally, the railcars in the graveled area are parked at the end of the rail line thus accidental collisions are minimized.\n\nAlternative Release Scenarios ¿\n\nVinyl Acetate:  This scenario assumes a drain valve is open on the transfer pump moving vinyl acetate to a process preparation tank. The ¾ drain valve releases 3,800 lb. of vinyl acetate into a containment basin over 25 minutes which is the time it takes to complete the entire transfer from storage to the intermediate mix tank.  According to the OCA Guidance Table, this release could impact off-site public receptors. The following active mitigation measures are used in this analysis:\n\n· Secondary Containment:  The tank is located in a concrete secondary containment structure and is connected to the spill contai"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39577,
      "SummaryText": "nment basin.  This containment basin reduces evaporation from the spill.\n· Emergency Shutdown System:  A manual emergency shutdown system is designed to shut down the pumps and put the transfer valves in a fail-safe position.  This system can be actuated if a spill is detected. \n· Surveillance: Operators and maintenance employees monitor the work area while the pump is in use. \n\n\nOther specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n\n· Fire Water Monitors:  Area fire water spray monitors can be used to help suppress vinyl acetate vapors using inducted foam.\n· Control Devices: Each drain valve is equipped and checked for a solid valve plug in case the primary valve leaks.\n· Vapor Suppression:  Vapor-suppressing foam can be applied to the contents of the spill basin described above to reduce the amount of vapors released to the atmosphere.\n\nAcrylonitrile:  This scenario assumes a drain valve is open on the transfer pump moving acrlyonitrile to a process preparation tank. The ¾ drain valve releases 1,450 pounds of acrylonitrile into a containment basin over 10 minutes which is the time it takes to complete the entire transfer from storage to the intermediate mix tank.  According to the OCA Guidance Table, this release could impact off-site public receptors. The following active mitigation measures are used in this analysis:\n\n· Secondary Containment:  The tank is located in a concrete secondary containment structure and is connected to the spill containment basin.  This containment basin reduces evaporation from the spill.\n· Emergency Shutdown System:  A manual emergency shutdown system is designed to shut down the pumps and put the transfer valves in a fail-safe position. This system can be actuated if a spill is detected. \n· Surveillance: Operators and maintenance employees monitor the work area while the pump is in use. \n\n\nOther specific steps to prevent this scenario from occurring, and to mitigate its"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39577,
      "SummaryText": "effects should they occur, include:\n\n· Fire Water Monitors:  Area fire water spray monitors can be used to help suppress acrylonitrile vapors using inducted foam.\n· Control Devices: Each drain valve is equipped and checked for a solid valve plug in case the primary valve leaks.\n· Vapor Suppression:  Vapor suppressing foam can be applied to the contents of the spill basin described above to reduce the amount of vapors released to the atmosphere.\n\n\n\n\n\n4. General Accidental Release Prevention Program \n\nOur general accident prevention program consists of compliance with the EPA RMP rule and OSHA's PSM standard and implementation of Union Carbide's Operational Safety Program and Episodic Risk Management System.  Key elements include:\n\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\n\nProcess Safety Information: Chemical hazard, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\n\nProcess Hazard Analysis:  Process hazard analyses are conducted every five years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\nEpisodic Risk Management:  Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\n\nOperational Safety Standards:  Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in operational safety standards.\n\nOperating Procedures:  Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\n\nOperator Training/Certification Program:  The plant has a training and testing program which provides operators with the proper skills"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39577,
      "SummaryText": "and knowledge prior to allowing them to independently operate a process.\n\nTechnical Staff Training and Support:  Trained technical staff employees are available 24 hours a day to support operations.\n\nMaintenance Procedures:  The plant has specific procedures for maintaining process equipment so that it operates safely.\n\nMaintenance Training:  The plant trains persons who perform routine or complex maintenance tasks on process equipment.\n\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\n\nManagement of Change:  The plant has a management system to ensure that modified facilities and processes will be safe to operate.\n\nPre-startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\n\nIncident Investigation:  The plant has a program to ensure that accidents and incidents are properly investigated to determine the cause(s) and to implement corrective action(s) that are needed to prevent the event from reoccurring.\n\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\n\nHot Work Permit:  The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.\n\nCompliance Audits:  Periodic Corporate and plant-led audits are conducted to ensure that process operations comply with governmental  and Union Carbide requirements.\n\nOperational Safety Program:  Union Carbide has a comprehensive program to ensure that all the elements listed above are implemented at every Union Carbide location.  This Pro"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39577,
      "SummaryText": "gram includes accountabilities for timely and proper implementation of the program elements.\n\nThese general prevention elements and the chemical-specific steps discussed in the previous section are parts of an overall management system to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n5. FIVE-YEAR ACCIDENT HISTORY\n\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical at the Union Carbide UES Alsip Plant that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelter-in-place, property damage or environmental damage.\n\n\n\n6. EMERGENCY RESPONSE PROGRAM\n\nThe UES Alsip Plant maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to  releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including:\n\n· Proper first-aid and medical treatment for exposures.\n\n· Evacuation plans and accounting for personnel after an evacuation.\n\n· Notification of local emergency response agencies and the public if a release occurs.\n\n· Post-incident cleanup and decontamination requirements.\n\n· Inspecting, testing, maintaining, and using emergency response equipment.\n\nThe emergency response program is updated when necessary based on modifications made to facility processes. \n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nOn-going programs, such as process hazard analysis reevaluations, continually aim to improve process safety.  The following is a list of specific improvements that we are planning to implement at the Alsip UES Plant to help prevent and/or b"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 39577,
      "SummaryText": "etter respond to accidental chemical releases:\n\n· A new Corporate program that uses semi-quantitative assessment techniques in process hazard analyses to ensure that controls used for prevention or mitigation of hazards provide adequate protection.\n\n· A new Corporate program designed to ensure that process safety information is kept up-to-date.\n\n· The vapor monitoring system in the monomer storage area will be expanded to include the spill basin."
    }
  ]
}