{
  "FacilityID": 39683,
  "FacilityName": "Baker Petrlite Corporation - Bowman",
  "FacilityStr1": "Highway 12 West",
  "FacilityStr2": null,
  "FacilityCity": "Bowman",
  "FacilityState": "ND",
  "FacilityZipCode": "58623",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38011",
  "LEPC": "Bowman County LEPC",
  "FacilityLatDecDegs": "46.180000",
  "FacilityLongDecDegs": "-103.417778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bakerpetrolite.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Baker Hughes, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": 0,
  "OperatorName": "Baker Petrolite Corporation",
  "OperatorStr1": "P.O. Box 316",
  "OperatorStr2": null,
  "OperatorCity": "Bowman",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58623",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jesse Smyle",
  "RMPTitle": "Service Representative",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000172751",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "none",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-07-10 00:00:00",
  "DeRegistrationEffectiveDate": "2009-07-06 00:00:00",
  "AnniversaryDate": "2009-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 46.18106,
  "FRS_Long": -103.42369,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57027,
      "AltID": "Acrolein Storage",
      "FacilityID": 39683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58351,
          "ProcessID": 57027,
          "NAICSCode": "213112",
          "_desc": {
            "NAICS_CODE": "213112",
            "NAICS_DESCRIPTION": "Support Activities for Oil and Gas Operations"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75307,
          "ProcessID": 57027,
          "ChemicalID": 22,
          "Quantity": 26750.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 22,
            "ChemicalName": "Acrolein  [2-Propenal]",
            "CASNumber": "107-02-8",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575307,
          "ProcessID": 57027,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39683,
      "SummaryText": "General Executive Summary for Baker Petrolite Corporation\nBaker Petrolite Corporation Bowman, ND\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Baker Petrolite - Bowman are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with the Bowman Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility?s primary activities are a distribution center for oil-field customers.  We have one (1) regulated substances present at our facility.  This substance is Acrolein [2-Propenal].    The regulated substance at our facility is stored and distributed to our oil-field customers.  Acrolein is stored in pressurized vessel to minimize emissions during storage.  There is no material handling of acrolein except moving containers.\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nBaker Petrolite ? Bowman maintains a detailed record of safety information that "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39683,
      "SummaryText": "describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Baker Petrolite ? Bowman maintains written operating procedures.  These procedures address unloading, movement, and loading of acrolein cylinders and skids.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nBaker Petrolite ? Bowman has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three year and more frequently as needed.\n\nMechanical Integrity\nBaker Petrolite - Bowman carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, and emergency shutdown systems.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Baker Petrolite - Bowman to manage changes in process chemicals, technology, equipment and proced"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39683,
      "SummaryText": "ures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Baker Petrolite - Bowman.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nBaker Petrolite - Bowman conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nBaker Petrolite - Bowman promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five (5) years.\n\nEmployee Participation\nBaker Petrolite - Bowman truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility?s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contracto"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39683,
      "SummaryText": "r is carried out.  Baker Petrolite - Bowman has a strict policy of informing the contractors of known potential hazards related the contractor?s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n4.    Five-year Accident History\nThe Baker Petrolite Corporation in Bowman, North Dakota has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n5.    Emergency Response Plan\nBaker Petrolite - Bowman carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n6.    Planned Changes to Improve Safety\nBaker Petrolite - Bowman has reviewed many of our processes to ensure compliance with this regulation.  During this process, our Bowman, North Dakota facility has identified several steps to improve the safety of our operations.  These steps have included, and continue to include, providing concrete containment and lockable security for our acrolein.  We have also increased the amount of neutralizer on site, and have increased the amount of training our employee?s receive in emergency response and emergency response coordination wit outside agencies, as well as training and coordination with local emergency responders and our neighbors.  Some of these issues have been completed, and will be reviewed for further improvements as needed."
    }
  ]
}