{
  "FacilityID": 39695,
  "FacilityName": "Roquette America, Inc. (Keokuk Refinery C)",
  "FacilityStr1": "1003 S. 5th. Street",
  "FacilityStr2": null,
  "FacilityCity": "Keokuk",
  "FacilityState": "IA",
  "FacilityZipCode": "52632",
  "Facility4DigitZipExt": "6643",
  "FacilityCountyFIPS": "19111",
  "LEPC": "Lee County LEPC",
  "FacilityLatDecDegs": "40.388889",
  "FacilityLongDecDegs": "-091.392500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.Roquette.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627984446,
  "ParentCompanyName": "Roquette America, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Roquette America, Inc.",
  "OperatorStr1": "1003 S. 5th. Street",
  "OperatorStr2": null,
  "OperatorCity": "Keokuk",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52632",
  "OperatorZipCodeExt": "6643",
  "RMPContact": "Eugene Taylor",
  "RMPTitle": "Manager Environmental Affairs",
  "FTE": 300,
  "OtherEPAFacilityID": "52632THHBNone",
  "EPAFacilityID": "100000130823",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not isued yet",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-07-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-07-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 40.38897,
  "FRS_Long": -91.39426,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57057,
      "AltID": "Wet Corn Milling",
      "FacilityID": 39695,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58381,
          "ProcessID": 57057,
          "NAICSCode": "311221",
          "_desc": {
            "NAICS_CODE": "311221",
            "NAICS_DESCRIPTION": "Wet Corn Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75441,
          "ProcessID": 57057,
          "ChemicalID": 56,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575441,
          "ProcessID": 57057,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39695,
      "SummaryText": "INTRODUCTION:  Roquette Ammerica, Inc is committed to the Safe Operation of its facilities and to full compliance with all regulatory requirements including the OSHA PROCESS SAFETY MANAGEMENT Regulation and the EPA RISK MANAGEMENT PROGRAM.  The Ammonia Process in the high fructose corn syrup refinery (Refinery C) has been in successful, safe and continuous operation since before the OSHA PSM regulation became law in 1992.  Process Hazard Analyses were performed in both 1994 and 1999.  The audit review conducted in 2004 has identified documentation as an area of PSM/RMP concern.  Roquette has adopted a Web-Based PSM/RMP technology to reduce the \"Paperwork\" cost of PSM/RMP compliance.  At the same time the Safety of the Ammonia Process has been enhanced  by managing and documenting PSM/RMP Compliance electronically.  The Risk Management program described below will dramatically improve the the \"Hard Copy\" program that has been in effect at Roquette, America.\n\nI.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY POLICIES\n\n     Roquette America, Inc recognizes management's responsibility in protecting it's employees, equipment, property, and the environment. The safety and health of all personnel are very important.  The control of ammonia release incidents has been and will continue to be the basic responsibility of all Roquette America, Inc personnel who Manage and operate the Ammonia Storage and Use Process at Refinery C.\n\n     The Roquette America, Inc PSM/RMP program assigns and documents the specific responsibilities for developing, implementing and integrating the OSHA PSM and the EPA RMP standards into its Ammonia Management and Operating Systems.  The Roquette America, Inc PSM/RMP program focuses attention on \"Making PSM/RMP the way we manage our ammonia process.  PSM/RMP at Roquette is not a project to complete and put on the shelf when the filing date has passed.\n\n     Roquette America, Inc believes that Employee Participation is the key to a successful PSM/RMP pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39695,
      "SummaryText": "ogram.  Operating level employees \"Team with Management\"  to operate the ammonia process safely.  Managers and Operators together assume major responsibility for operating the Hazardous Material process safely.\n\n     The Roquette America, Inc Emergency Response Program has been developed in cooperation, and with the support of the local Public Emergency Response Agency.  All Roquette America, Inc employees have received emergency response training.\n\nII.  STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n     Roquette America, Inc operates an Ammonia Storage and Use System.  Ammonia is a common industrial chemical with applications in a large number of industries such as Agriculture, Water Treatment, Food Storage Warehouses, Pharmaceuticals, Heat Treating and many, many more.  Ammonia has been listed by both EPA and OSHA as an Extreemly Hazardous Substance.\n\nIII.  SUMMARY OF WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nDispersion cloud modeling studies have been performed as required by PSM/RMP regulations and the information developed has been used in the preparation of the Technical Studies and Reports that are also required.  \n\nIV.   DESCRIPTION OF THE Roquette America, Inc ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n      Roquette America, Inc conducts an annual PSM/RMP progress audit of their PSM/RMP program to identify strengths and weaknesses and make improvements. Roquette America, Inc considers the PSM/RMP manuals to be a \"living\" documents that must be updated and revised regularly to maintain their viability and usefulness.\n\n     Roquette conducts a regular PROCESS HAZARD ANALYSIS  and PROCESS HAZARD ANALYSIS REVALIDATION of its Ammonia Process to assure the continued safe operation of facility equipment. \n\n     Roquette is developing a Web-Based System for their STANDARD OPERATING PROCEDURES.  Procedures will be reviewed and certified annually to be current and correct.  Ammonia Operators will participate in the development and the SOP's.\n\n     Roquette Ame"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39695,
      "SummaryText": "rica, Inc emphasizes and insists on EMPLOYEE PARTICIPATION from their ammonia process operators in all aspects of the development, implementation, and integration of their PSM/RMP program.\n\n    Roquette America, Inc provides a comprehensive, computer based, user friendly TRAINING AND TRAINING MANAGEMENT System with \"one-on-one\" teacher involvement in specific training modules for each ammonia process employee.\n\n     Roquette has developed a PREVENTIVE MAINTENANCE Inspection system to identify potential mechanical hazards and to prevent or mitigate an ammonia release that may develop from poorly maintained ammonia process equipment.  Roquette has this year implemented a SAP Maintenance  Module into their maintenance Management System.  Ammonia Inspections and maintenance Procedures will be integrated into the new system.\n\n\nV.  FIVE YEAR ACCIDENTAL RELEASE HISTORY\n\n     There have been no reportable releases of ammonia during the past five years.\n\nI.  EMERGENCY RESPONSE PROGRAM\n\n     Roquette maintains and trains an Emergency Response team and coordinates its training activities with Local Public Emergency Response Units.  Ammonia Facility employees have been trained to respond to accidental ammonia releases in a defensive manner and assist the Plant Emergency Response Team.\n\nVII.  PLANNED CHANGES TO IMPROVE SAFETY\n\n      Roquette America, Inc recognizes that even good PSM/RMP Programs require constant attention and improvement.  The PSM/RMP program is considered to be a set of \"living\" documents and procedures that will require constant attention, development, and revision before \"Safety\" truly becomes \"second nature\".\n\n     Roquette America, Inc expects to improve PSM/RMP and safety performance by emphasizing the following elements of their PSM/RMP Program:\n\n (1)   EMPLOYEE PARTICIPATION:  Employee Participation is the \"Key\" to a successful program. Ammonia Process Managers and Operators have been deeply involved in Verifying P&ID's, Developing and updating the Stan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39695,
      "SummaryText": "dard Operating Procedures, and performing the documented Preventive Maintenance Inspections.\n\n(2)    EXPANCED USE OF THEIR PSM/RMP WEB-SITE:  The Roquette America, Inc PSM/RMP Program is:  (a) computer based,  (b)user friendly,  (c) includes \"one-on-one\" involvement with specified and qualified trainers,  (d) written to minimize paperwork and maximize documentation, and  (e) written to be understood and used by both Ammonia Managers and Process Operators.  The web-site makes all information developed by the PSM/RMP Program available to all employees who have a User Name and Password.  All Roquette Refinery C employees who operate the ammonia system have an assigned User Name and Password. \n\n(3)  PROCESS HAZARDS ANALYSIS: All recommendations developed during the Process Hazards Analysis (PHA) were designed to improve the safety performance of the Ammonia Storage and Use System.  Roquette America has evaluated each PHA recommendation.  Each recommendation has been installed and will reduce the possibility of a release and/or mitigate the consequences of an unintentional release.\n\n(4) AUDITS:   Programs are audited Tri-Annually as required by the OSHA PSM to improve Safety Performance as well as to verify compliance with the PSM/RMP Regulations. \n\n(5)  STANDARD OPERATING PROCEDURES:  SOP's are certified annually to be current and correct.  They are revised as often as necessary to keep them current and correct.\n\n(6)  TRAINING:  Orientation Training (both classroom and On-the-Job) is provided employees before Ammonia related work assignments are given.  Renewal training, including documented training tests are provided annually.\n\n(7)  PREVENTIVE MAINTENANCE INSPECTIONS:  Critical Ammonia Equipment is routinely inspected and maintained according to manufacturer?s recommendations.  The newly installed SAP Maintenanc program will facilitate maintenance inspection procedure and practice."
    }
  ]
}