{
  "FacilityID": 39709,
  "FacilityName": "City of Allentown Wastewater Treatment Plant",
  "FacilityStr1": "112 Union Street",
  "FacilityStr2": null,
  "FacilityCity": "Allentown",
  "FacilityState": "PA",
  "FacilityZipCode": "18102",
  "Facility4DigitZipExt": "4912",
  "FacilityCountyFIPS": "42077",
  "LEPC": "Lehigh County LEPC",
  "FacilityLatDecDegs": "40.601667",
  "FacilityLongDecDegs": "-075.453333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 834426249,
  "ParentCompanyName": "City of Allentown",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Allentown",
  "OperatorStr1": "435 Hamilton Street",
  "OperatorStr2": null,
  "OperatorCity": "Allentown",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18101",
  "OperatorZipCodeExt": "1699",
  "FTE": 55,
  "OtherEPAFacilityID": "13618",
  "EPAFacilityID": "100000056565",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "NM-00035",
  "SafetyInspectionDate": "1995-06-28 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Allentown WWTP-Chlorine",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-07-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-07-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 40.601667,
  "FRS_Long": -75.453333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57071,
      "AltID": "Chlorine System",
      "FacilityID": 39709,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75461,
          "ProcessID": 57071,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58395,
          "ProcessID": 57071,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21735,
              "Process_NAICS_ID": 58395,
              "SafetyReviewDate": "2004-06-17 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "BOCA, Chlorine Institue, NEMA",
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-17 00:00:00",
              "ChangeCompletionDate": "2004-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-26 00:00:00",
              "TrainingReviewDate": "2004-04-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "2004-06-17 00:00:00",
              "EquipmentTested": "Chlorinators, evaporators, relief system, scrubber",
              "ComplianceAuditDate": "2002-06-03 00:00:00",
              "AuditCompletionDate": "2002-06-03 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22713,
                  "PreventionProgram2ID": 21735,
                  "ProcessChemicalID": 75461
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39709,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2004-06-16 00:00:00",
    "CoordinatingAgencyName": "City of Allentown Fire Department",
    "CoordinatingAgencyPhone": "6104377751",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39709,
      "SummaryText": "Executive Summary\r\nIntroduction \r\nMany chemicals, although considered hazardous, provide very beneficial uses to industry and to the individual; usage of these chemicals is commonplace.  They are transported on roads, waterways, and railways and stored in substantial quantities at their point of use.  The City of Allentown's Wastewater Treatment Plant (WWTP) uses chlorine, a strong bactericidal agent, to disinfect treated wastewater prior to discharge to the Lehigh River, which protects the river's downstream uses and public health.  Allentown has a firm commitment to the safety obligations and responsibilities associated with storing and using chlorine.  The seriousness and effectiveness of Allentown's commitment has been demonstrated in both its unblemished safety record and stellar environmental compliance record.  As required by the U.S. Environmental Protection Agency (USEPA) Risk Management Program (RMP), the following document describes the steps Allentown takes routinely to ensure the safety within the treatment plant, what could happen if there were an accident, and what procedures would be followed in the event of an emergency. \r\nAccidental Release Prevention and Emergency Response Policies\r\nThe City of Allentown's (COA) accidental release prevention policy involves a unified approach that integrates proven technology, trains staff on operation and maintenance practices, and uses tested management system practices.  All applicable procedures of the U.S. Environmental Protection Agency (USEPA) Prevention Program are adhered to, including key elements such as training recommendations, systems management approaches, and emergency response procedures.  The central focus of Allentown's response policy has always been and will continue to be proactive prevention.  The absence of any emergency due to a chlorine leak at the WWTP demonstrates the success of this approach.\r\nThis document summarizes Allentown's existing health and safety programs, the internal man"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39709,
      "SummaryText": "agement response team approach to emergencies, the associated policies and procedures governing the team's responsibilities, and the on-going activities that are designed to prevent or minimize impacts of accidental releases of chlorine to the environment.  The WWTP has prepared a detailed and comprehensive emergency response plan (ERP) to handle any potential accidental releases; the ERP is designed to safeguard both individuals on-site and off-site.\r\nAs a result of the detailed development of the areas noted, this document complies with the U.S. Environmental Protection Agency's (USEPA's) Risk Management Program, under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68. \r\nGeneral Facility and Regulated Substances Information\r\nThe WWTP, operating since 1928, is located at 112 Union Street in the City of Allentown.  Wastewater treated at the WWTP is disinfected with chlorine prior to discharge to the Lehigh River.  The treated wastewater meets all permitted standards. The facility is designated as an advanced secondary treatment plant.  The wastewater treatment process train includes preliminary screening, grit removal, comminution, primary settling, 2-stage biological treatment, intermediate settling, final settling, and chlorination before final discharge.  The WWTP is permitted to treat 40 million gallons per day (MGD) with a current average flow of 30 to 32 MGD. The facility currently stores chlorine, which is a regulated toxic substance under 40 CFR Part 68 - RMP.  The Plant's chlorine storage exceeds the listed threshold quantity of 2,500 pounds in the RMP Regulations.\r\nLiquid chlorine is brought to the plant via delivery trucks that drop off the ton containers at the chlorine loading/unloading area. The containers are unloaded with a specifically designed lifting hoist.  The ton containers are stored in a dedicated storage room adjacent to separate rooms housing chlorine delivery systems. Chlorine leak"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39709,
      "SummaryText": "detectors continuously monitor for leaks in the storage area, evaporator room, and chlorinator room. There are additional alarms monitoring pressure, temperature, and other parameters.  These alarms are annunciated at the local control panels; and more importantly, at the main operators' control station. In the case of a leak, the storage area has an audible alarm and red flashing warning light on top of the building.  In addition, evaporator shut-off and pressure reducing valves are designed to close if low evaporator gas temperature is detected; thus preventing liquid chlorine from reaching the gas piping system. The chlorination system also includes factory-set pressure relief valves and rupture disks to protect the integrity of the equipment should pressure rise. There is a sodium hydroxide based scrubbing system on-site designed to neutralize any accidental releases of chlorine.  \r\nFor the protection and safety of operational personnel, emergency showers and eye wash stations are provided at two locations near entrances to the chlorine building.  The chlorine building has Self-Contained Breathing Apparatus (SCBAs) mounted in a separate non-process room so they are easily accessible in an emergency.  The facility also includes other design features such as vision panels and panic bar doors to ensure safety of employees.\r\nThe chlorine building is equipped with a normal ventilation system that is controlled by operators at a switch at each entrance. Operational SOPs require initiation prior to entry. When the chlorine leak detector detects 2 ppm of chlorine in the room, the ventilator shuts down and a supplemental ventilation system activates, which removes air from the floor level (chlorine is heavier than air) and delivers it to the scrubber.\r\nEntrance to the WWTP is controlled at the driveway off of Union Street by a gate that is only open during normal working hours.  During those hours, visitors and contractors must check-in at the administration building and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39709,
      "SummaryText": "be approved by WWTP staff prior to going elsewhere in the facility.  The plant is manned 24-hours a day, year round, and there is a centralized alarm system which notifies staff of any problems or situations that indicate an atypical situation that might require follow-up investigations.      \r\n\r\nFive-year Accident History Summary\r\nNo chlorine releases that could have caused safety or health hazards to any individuals at on-site or off-site locations (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the WWTP during the last five years. \r\nSummary of the Accidental Release Prevention Program and Chemical-specific Prevention Steps \r\nCity of Allentown WWTP is in compliance with Federal Risk Management Planning  requirements.  Chemical-specific prevention steps include availability of self-contained escape breathing apparatus, worn by the operators during connection and disconnection of the chlorine supply, awareness of the hazardous and toxic properties of chlorine, and the presence of chlorine detectors and alarms.\r\nCity of Allentown WWTP's accidental release prevention program is based on the following key elements:\r\n* Detailed management system and clear levels of responsibilities and team member roles\r\n* Comprehensive safety process information that is readily available to staff, emergency responders, and contractors\r\n* Comprehensive preventive maintenance program \r\n* Completion of a hazard review of equipment and procedures with operation and maintenance staff participation and review.\r\n* Use of state-of-the-art process and safety equipment\r\n* Use of accurate and effective operating procedures, written with operations and maintenance staff participation and updated regularly\r\n* High level of training of operators and maintenance staff, including emergency responders on a periodic basis\r\n* Implementation of an incident investigation, inspection, and auditing program using qualified staff.\r\n\r\nSafety Information"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39709,
      "SummaryText": "Comprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of each regulated substance.  This information was compiled from numerous sources and is intended to be a one-stop source for the reader seeking data about these substances.  This information includes chlorine background information, material safety data sheets (MSDS), and chlorine reaction chemistry.\r\nEquipment safety information was meticulously compiled on the chlorine process.  Specifications for the process are collected in one place for easy reference.  Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes are on file at the facility.\r\nProcedures are in place to trigger updates to safety information if there is a change in the process or operating parameters that makes existing information inaccurate.\r\nHazard Analysis \r\nIn 1999, a detailed hazard analysis (HA) was conducted with plant staff, engineering, and administrative staff for the regulated process.  The team consisted of process operating and maintenance experts and process design engineers.  The HA technique used was process checklist procedure, per acceptable approach guidance from EPA. The HA was lead by knowledgeable persons on the type of process being reviewed.  This review was updated within the required  five-year period (2004), or whenever there is major change in the process.  A list of actions to resolve any significant hazard review findings was prepared, and staff has implemented and documented these recommendations.   In 2004, during the required 5-year review, the HA was reviewed and discussed with plant staff.  The HA is still applicable since no major process changes have occurred with the chlorine system.\r\nOperating Procedures\r\nCity of Allentown WWTP maintains up-to-d"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39709,
      "SummaryText": "ate, accurate, written operating procedures that give clear instructions for the chlorine process. City of Allentown WWTP ensures effective operating practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine system.  Procedures include startup, shutdown, and normal, alternate, and emergency operation.  Also included are maintenance and troubleshooting procedures, including consequences of deviation and the steps to avoid and correct deviations.  City of Allentown WWTP updates procedures whenever a change occurs that alters the steps needed to operate safely.  Operating procedures have been developed and in place prior to any new process equipment coming on line or a changed process starting back up. Operating procedures are regularly reviewed by operating staff to ensure they reflect current practice at the WWTP.\r\nOperations and Maintenance Training Program\r\nEach WWTP employee presently involved in operating or maintaining the chlorine process is trained in an overview of the process and detailed, applicable operating and maintenance procedures.  In fact, the WWTP helps their employees understand, through training, the nature and cause of problems arising from operations involving chlorine on site, and to increase their employees' awareness with respect to their hazards. The WWTP's training program includes both initial and refresher training that covers 1) a general overview of the processes, 2) the properties and hazards of the substances in the process, and 3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and written self-evaluations are used to verify that an employee understands the training material before the process work can be resumed. Other plant personnel not directly involved with the chlorine system are periodically trained on the"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 39709,
      "SummaryText": "dangers of chlorine, the RMP program, and emergency alarms and evacuation procedures.\r\nTraining documentation includes: date of most recent review or revision to the training program, type of training required, and the type of competency testing used to ensure staff understands the training.  \r\nMaintenance Program\r\nCity of Allentown WWTP maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. WWTP believes that this program is the primary line of defense against a release, and addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The WWTP's maintenance program includes the following:\r\n* Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\r\n* Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals\r\n* Training of maintenance personnel in procedures for safe work practices, such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions\r\nSome periodic maintenance is performed by outside contractors.  These personnel are factory trained to perform specified maintenance on the Wallace and Tiernan chlorinators and evaporators.  These contractors are also knowledgeable on the COA procedures and protocols for chlorine system operations and proper response protocols in case of a chlorine leak.\r\nInternal Compliance Audits\r\nInternal compliance audits are conducted every three years to verify compliance with the programs and procedures contained in the RMP.  The WWTP and COA assembled an audit team in June 2002 that includes personnel knowledgeable in the Risk Management Program rule and in the process, and this team evaluated whether the prevention program satisfies the requirements of th"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 39709,
      "SummaryText": "e Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit were documented and recommendations have been tracked and implemented.\r\nIncident Investigation\r\nCity of Allentown WWTP investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  The WWTP trains employees to identify and report any incident that requires investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff, added or used to revise operating and maintenance procedures, and passed on to the training unit for their inclusion in existing training programs, if warranted, to prevent a future event.  The WWTP has not had any incidents since the inception of the RMP in 1999 that required a formal incident investigation.\r\nEmergency Response Program Summary\r\nCity of Allentown WWTP has established a written emergency response program that is followed by the employees to help safely respond to accidental releases of chlorine.  This program has been coordinated with the City of Allentown Fire Department, which is a member of the Local Emergency Response Planning Committee (LEPC).  This program includes emergency response procedures and a notification plan.  Emergency response drills and drill evaluations are conducted at a minimum frequency of every 12 months; emergency operation and response procedures are also reviewed at that time.\r\nPlanned Changes to Improve Safety\r\nA few minor changes to improve safety (recommended actions) were identified for the chlorine process in 1999 during the hazard review process.  These recommended actions have been eva"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 39709,
      "SummaryText": "luated and implemented.  Recommendations from the June 2002 compliance audit have also been implemented.  Any recommendations made in the June 2004 RMP update and review will be evaluated, documented, and any items selected for implementation expect to be completed by August 2004.  The implementation of these sets of recommendations will further improve the safety of the covered processes. \r\nCITY OF ALLENTOWN  WWTP\t\r\nEXECUTIVE SUMMARY\tRISK MANAGEMENT PROGRAM\r\n\r\n\r\n\r\n\r\nALTWN_04.DOC\tES-6\r\n\r\nALTWN_04.DOC\r\n06/17/04\tES-1"
    }
  ]
}