{
  "FacilityID": 39779,
  "FacilityName": "Five Mile Creek Treatment Plant",
  "FacilityStr1": "5601 East 54th",
  "FacilityStr2": null,
  "FacilityCity": "North Little Rock",
  "FacilityState": "AR",
  "FacilityZipCode": "72231",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05119",
  "LEPC": "North Little Rock LEPC",
  "FacilityLatDecDegs": "34.803889",
  "FacilityLongDecDegs": "-092.201111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "North Little Rock Waste Water Utility",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NLR Waste Water Utility",
  "OperatorStr1": "P. O. Box 17898",
  "OperatorStr2": "7400 Baucum Pike",
  "OperatorCity": "North Little Rock",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72117",
  "OperatorZipCodeExt": "0898",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145835",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "*Public Wastewater Treatment Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-05-09 00:00:00",
  "DeRegistrationEffectiveDate": "2005-03-01 00:00:00",
  "AnniversaryDate": "2009-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.80333,
  "FRS_Long": -92.18444,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57198,
      "AltID": "Chlorination",
      "FacilityID": 39779,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 75698,
          "ProcessID": 57198,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58526,
          "ProcessID": 57198,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21763,
              "Process_NAICS_ID": 58526,
              "SafetyReviewDate": "2004-06-07 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2004-06-10 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vandalism and terroristic acts.",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-06-12 00:00:00",
              "TrainingReviewDate": "2004-06-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-10 00:00:00",
              "EquipmentInspectionDate": "2004-06-11 00:00:00",
              "EquipmentTested": "Chlorination process equipment is inspect each day according to Normal Operations procedures.",
              "ComplianceAuditDate": "2002-06-19 00:00:00",
              "AuditCompletionDate": "2002-09-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Chlorination Process",
              "_chemicals": [
                {
                  "PrimaryKey": 22743,
                  "PreventionProgram2ID": 21763,
                  "ProcessChemicalID": 75698
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39779,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-06-10 00:00:00",
    "ERTrainingDate": "2003-11-05 00:00:00",
    "CoordinatingAgencyName": "North Little Rock OES",
    "CoordinatingAgencyPhone": "5013405365",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39779,
      "SummaryText": "1.0    Accidental Release Prevention and Emergency     Response Policies\n\n\nNorth Little Rock Waste Water Utility is committed to the safety of our workers, the public, and the environment.  This commitment is demonstrated by the resources invested in the prevention of accidental releases of hazardous substances.  The North Little Rock Waste Water Utility's Five Mile Creek Treatment Plant implements reasonable controls, such as training of personnel and the safe design, installation, operation and maintenance of our processes.  Our policy is to make every effort to prevent the release of hazardous substance but in the event of a release, our trained personnel and local emergency response agencies will respond to control and contain the release in a manner that will be safe for workers and will help prevent injuries to the public or the environment.\n\n\n2.0    Description of the North Little Rock Waste Water Utility's Five Mile Creek Treatment Plant and Regulated Substances\n\n\nThe Five Mile Creek Treatment Plant is located within the city limits of North Little Rock, Arkansas.  The facility is part of the North Little Rock Waste Water Utility wastewater collection and treatment system which services an area with a population of over 60,000 people and has a design wastewater flow of 4.9 million gallons per day.  The Five Mile Creek Treatment Plant handles one substance regulated by the Risk Management Program Rule (RMP Rule) in quantities above the Threshold Quantity.  This substance is:\n\n* Chlorine - stored in 1 ton cylinders and used for the disinfection of the wastewater prior to releasing to the receiving stream.\n\n\n3.0    Hazard Assessment\n\n\nThe RMP Rule requires the Five Mile Creek Treatment Plant to perform a Hazard Assessment of the chlorine stored and used in the chlorination process at the facility.  This Hazard Assessment includes an offsite consequence analysis for the following scenarios:\n\n* One worst-case and one alternative release scenario for the toxic substance chlor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39779,
      "SummaryText": "ine for the chlorination process unit at the facility.\n\nThe results of this Hazard Assessment has been appropriately communicated with the local emergency response agencies.\n\n\n4.0    Accidental Release Prevention Program and\n    Chemical-Specific Prevention Steps\n\n\nThe Risk Management Program rule (RMP rule) requires that a prevention program be established for the Five Mile Creek Treatment Plant chlorination process.  The following details the prevention program elements at the Five Mile Creek Treatment Plant that apply to these processes.\n\n4.1    Safety Information\n\nThe Five Mile Creek Treatment Plant maintains a variety of technical documents that are used to help ensure safe operation of the Five Mile Creek Treatment Plant processes.  Material safety data sheets (MSDSs) document the physical and chemical properties of hazardous substances handled at the Five Mile Creek Treatment Plant, including the chlorine in the covered processes.\n\n4.2    Hazard Review\n\nThe Five Mile Creek Treatment Plant has performed a Hazard Review of the chlorination process; an additional Hazard Review is scheduled to ensure the critical elements for safely storing and handling chlorine are in place in the process. This Hazard Review has been recently updated.\n\n4.3    Operating Procedures\n\nThe Five Mile Creek Treatment Plant has experienced employees operating the chlorination process at the facility.  These operators have been certified as being knowledgeable in the procedures required to safely operate the chlorination process.  Written operating procedures are being prepared which will be used to:\n\n1. train employees and contractors, and\n2. serve as reference guides for appropriate actions to take during normal and abnormal process conditions.\n\n\n\n4.4    Training\n\nThe Five Mile Creek Treatment Plant trains personnel in the operating procedures to help ensure safe and effective performance of their assigned tasks.  A formal training program is being developed to ensure a record of all training is maintai"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39779,
      "SummaryText": "ned and refresher training is provided on a timely basis.\n\n4.5    Maintenance\n\nThe Five Mile Creek Treatment Plant properly maintains the equipment in our processes.  A formal Preventive Maintenance program is being developed which includes:\n\n1. procedures to safely guide workers in their maintenance tasks,\n2. worker training in the maintenance procedures, and\n3. an inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\n4.6    Compliance Audits\n\nThe Five Mile Creek Treatment Plant performs periodic (at least every three years) audits of covered processes to verify the processes are operating in compliance with the requirements of the RMP Rule.  A compliance audit report is prepared after each audit, and any deficiencies noted by the audit are corrected in a timely manner. The most recent audit was conducted in June of 2002.\n\n4.7    Incident Investigations\n\nThe Five Mile Creek Treatment Plant will investigate all incidents that could reasonably result in a serious injury to personnel, the public, or the environment.  The Five Mile Creek Treatment Plant is developing an incident investigation program which encourages employees to identify and report any and all incidents requiring investigation.  An investigation team will be assembled, and the investigation will be initiated within 48 hours of the incident.  The results of the investigation will be documented, recommendations resolved, and appropriate process enhancements implemented.\n\n4.8    Chemical-specific Prevention Steps - Chlorine\n\nIndustry standards are followed at The Five Mile Creek Treatment Plant to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The chlorination process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39779,
      "SummaryText": " ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by the Five Mile Creek Treatment Plant.\n\n\n5.0    Five Year Accident History\n\n\nThe Five Mile Creek Treatment Plant compiled a five-year accident history that fulfills the requirements of the RMP Rule.  This history indicates a good record of accidental release prevention over the past five years.  No releases of regulated substances have occurred from the Five Mile Creek Treatment Plant that have resulted in offsite consequences, injuries to the public, or impacts on the environment.  Minor releases have occurred during maintenance activities with no injuries occurring to the Five Mile Creek Treatment Plant employees.\n\n\n6.0    Emergency Response Programs\n\n\nThe Five Mile Creek Treatment Plant has prepared a written emergency response plan.  This plan will be communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  The Five Mile Creek Treatment Plant will periodically conduct emergency drills to test our emergency plan and coordinate these drills with the local fire department.\n\n\n7.0    Planned Changes to Improve Safety\n\n\nThe Five Mile Creek Treatment Plant continuously attempts to improve the safety of our processes to protect our employees, the public, and the environment.  The Five Mile Creek Treatment Plant incident investigations, employee suggestions, and improvements in technology will be utilized to update the safety aspects of the process.  \n\n\n\nJune 7, 2004"
    }
  ]
}