{
  "FacilityID": 39770,
  "FacilityName": "Good Humor Corporation Framingham",
  "FacilityStr1": "490 Old Connecticut Path",
  "FacilityStr2": null,
  "FacilityCity": "Framingham",
  "FacilityState": "MA",
  "FacilityZipCode": "01701",
  "Facility4DigitZipExt": "4578",
  "FacilityCountyFIPS": "25017",
  "LEPC": "Framingham LEPC",
  "FacilityLatDecDegs": "42.313056",
  "FacilityLongDecDegs": "-071.394722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "michael.mentzel@unilever.com",
  "FacilityDUNS": 14575179,
  "ParentCompanyName": "Conopco",
  "Company2Name": "Unilever",
  "CompanyDUNS": 1375088,
  "Company2DUNS": 0,
  "OperatorName": "Steve Rosemary",
  "OperatorStr1": "490 Old Connecticut Path",
  "OperatorStr2": null,
  "OperatorCity": "Framingham",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01701",
  "OperatorZipCodeExt": "4578",
  "FTE": 240,
  "OtherEPAFacilityID": "01701KRFTC4900L",
  "EPAFacilityID": "100000053782",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-22 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "revision 1 7-29-04",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-08-22 00:00:00",
  "DeRegistrationEffectiveDate": "2011-05-31 00:00:00",
  "AnniversaryDate": "2009-08-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 42.312,
  "FRS_Long": -71.39284,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57187,
      "AltID": "Refrigeration",
      "FacilityID": 39770,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 75687,
          "ProcessID": 57187,
          "ChemicalID": 56,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58515,
          "ProcessID": 57187,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 32922,
              "Process_NAICS_ID": 58515,
              "SafetyReviewDate": "2004-04-07 00:00:00",
              "PHA_Date": "2003-11-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Hand-held ammonia detector",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-15 00:00:00",
              "TrainingReviewDate": "2003-09-24 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Drills and exercises for emergency evacuation and response",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-15 00:00:00",
              "EquipmentInspectionDate": "2004-04-04 00:00:00",
              "EquipmentTested": "Compressors, condensers, evaporators, pumps, temperature and pressure gauges (daily inspection)",
              "ChangeMgmtDate": "2004-02-11 00:00:00",
              "ChangeMgmtReviewDate": "2004-02-11 00:00:00",
              "PreStartupReviewDate": "2004-02-11 00:00:00",
              "ComplianceAuditDate": "2004-02-10 00:00:00",
              "AuditCompletionDate": "2004-09-30 00:00:00",
              "IncidentInvestigationDate": "1998-06-02 00:00:00",
              "InvestigationChangeDate": "1998-06-06 00:00:00",
              "ParticipationPlansReviewDate": "2004-02-11 00:00:00",
              "HotWorkPermitReviewDate": "2004-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-08 00:00:00",
              "ContractorSafetyEvalDate": "2004-04-22 00:00:00",
              "CBI_Flag": 0,
              "Description": "Good Humor Breyers closely follows all requirements of the OSHA Process Safety Management (PSM) program to prevent the accidental release of ammonia.",
              "_chemicals": [
                {
                  "PrimaryKey": 47964,
                  "PreventionProgram3ID": 32922,
                  "ProcessChemicalID": 75687
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39770,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-19 00:00:00",
    "ERTrainingDate": "2004-05-19 00:00:00",
    "CoordinatingAgencyName": "Framingham Fire Department",
    "CoordinatingAgencyPhone": "5086204951",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Massachusetts Toxics Use Reduction Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39770,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis report contains the Risk Management Plan (RMP) for the ammonia refrigeration system located at the Good Humor-Breyers Ice Cream facility in Framingham MA.  This revised RMP was prepared in accordance with the requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RM Program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).  The original was prepared with assistance of Primatech Inc.  This revision is being prepared due to the timely revalidation of the ammonia Process Hazard Analysis.\n\nThe information presented in this report reflects the data element requirements of the final EPA RMP submission.  \n\nA. Accidental Release Prevention and Emergency Response Policies\n\nGood Humor recognizes management's responsibility in protecting its employees, equipment, property, and the environment.  The safety and health of all personnel are very important.  The control of accidents has been and will continue to be a basic responsibility of all personnel in the Framingham facility.  \n\nTo accomplish the Company's goal in controlling accidental losses, the facility has established a Plant Safety Program and a Plant Safety Team.  The objectives of the Plant Safety Program are to:  achieve maximum efficiency and safety performance, reduce losses associated with damage of property, and the economic burden resulting from injuries and accidents.  \n\nOne of the activities associated with the Plant Safety Program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with OSHA's Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119), and EPA's Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).  The Engineering Services Manager, is responsible for implementation of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39770,
      "SummaryText": " the Risk Management Program. \n\nThe purpose of the accidental released prevention and emergency response programs is to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nThe accidental release prevention and emergency response programs help prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.  \n\nB. Stationary Source and Regulated Substances Handled\n\nGood Humor operates an ice cream production facility in Framingham, MA.  The facility operates an ammonia refrigeration system to provide cooling and freezing capabilities.  The amount of anhydrous ammonia (CAS #7662-41-7) contained in the system is in excess of 10,000 pounds.  Since an ammonia release from the system could pose a risk of offsite public impact and the system is regulated under the OSHA PSM standard (29 CFR 1910.119), the system is subject to the Program 3 requirements of the EPA's RM program.\n\nIn the ammonia refrigeration system, liquid ammonia (High Pressure Liquid:  HPL) is fed to the Silos, Glycol Chillers, Ice Cream Freezers, King Units, Compressors, and Intercooler from the High Pressure Vessel.\n\nC. Description of the Accidental Release Prevention Program\n\nThe prevention program consists of the following elements:\n\n? Employee Participation:  This program involves the employees in establishing and implementing the program.  Employees are also to be involved when a process hazard analysis is conducted.  The program also ensures that all employees have completed access to the program.\n? Process Safety Information:  Written information has been col"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39770,
      "SummaryText": "lected which enables the employees to identify and understand the potential hazards in the system.  The written information includes the ammonia MSDS and a description of the design of the ammonia refrigeration system.\n? Process Hazard Analysis:  Formal studies using the What-If Technique have been conducted to look at that system and identify potential hazards.\n? Operating Procedures:  Written, detailed procedures have been developed which describe the steps which should be followed to safely operate the ammonia refrigeration system.\n? Training:  A training program has been developed which ensures that employees are trained on all aspects of the system and on the duties which they should perform to ensure the safe operation of the ammonia refrigeration system.\n? Contractors:  All contractors are screened and evaluated before they perform work on or near the ammonia refrigeration system.  The contractors are also periodically evaluated to ensure that they perform work by following safe work practices.\n? Pre-Startup Safety Review:  A pre-startup safety review is completed for all new ammonia projects to verify that all safety programs are in place, training has been performed, and construction has been completed according to design standards before the project is put into use.\n? Mechanical Integrity:  This program ensures that the ammonia refrigeration systems are built and maintained using preventive maintenance procedures to minimize unexpected breakdowns or failures.\n? Hot-Work Permit:  These procedures ensure that a signed permit is obtained prior to any cutting, welding, or burning.\n? Management of Change:  The procedures are designed to ensure that all changes made to the ammonia refrigeration system are properly reviewed.  \n? Incident Investigation:  The procedures ensure that any incidents (and near misses) are investigated, reviewed, and documented using an investigation team.\n? Compliance Audits:  There are procedures to conduct regular audits of the progra"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39770,
      "SummaryText": "m to ensure that the program is in place and working properly.\n\nD. Five-Year Accident History\n\nNo accidents meeting the definitions contained in 40 CFR 68 were reported in the past 5 year period.\n\nE. Description of the Emergency Response Program\n\nAn emergency response program has been implemented at the Framingham facility.  This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures.  The program has been coordinated with the Framingham Fire Department and the Town of Framingham LEPC.\n\nThe emergency response program consists of the following elements:\n\n? Organization Plan and Responsibilities\n? Communications Procedures\n? Detailed Action Plans\n? First Aid Procedures\n? Emergency Medical Treatment Procedures \n? Evacuation Plans \n? Description of Outside Assistance Available\n? Site Re-Entry Procedures\n? Training Programs and Drills\n\nF. Planned Changes to Improve Safety\n\nThree changes to improve safety were recommended to the equipment (hardware recommendations) when the ammonia refrigeration system was most recently analyzed during revalidation of the process hazard analysis (PHA) finalized in December 2003.  Recommended changes will be evaluated and implemented as required."
    }
  ]
}