{
  "FacilityID": 39925,
  "FacilityName": "Sara Lee Foods - Florence",
  "FacilityStr1": "700 South Wood Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Florence",
  "FacilityState": "AL",
  "FacilityZipCode": "35630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01077",
  "LEPC": "Lauderdale County LEPC",
  "FacilityLatDecDegs": "34.796389",
  "FacilityLongDecDegs": "-087.668611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.saralee.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Sara Lee Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": null,
  "OperatorName": "Sara Lee Foods - Florence",
  "OperatorStr1": "700 South Wood Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Florence",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35630",
  "OperatorZipCodeExt": null,
  "FTE": 1050,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000081877",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-04-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-05-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-08-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-02-26 00:00:00",
  "DeRegistrationEffectiveDate": "2015-02-06 00:00:00",
  "AnniversaryDate": "2009-08-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 34.79475,
  "FRS_Long": -87.66912,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "61",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "NH3 removed from system.",
  "_processes": [
    {
      "ProcessID": 57387,
      "AltID": "Anhydrous Ammonia Refrig.",
      "FacilityID": 39925,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 75924,
          "ProcessID": 57387,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 58716,
          "ProcessID": 57387,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33057,
              "Process_NAICS_ID": 58716,
              "SafetyReviewDate": "2004-04-28 00:00:00",
              "PHA_Date": "2005-07-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-08-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Gas detectors",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-24 00:00:00",
              "TrainingReviewDate": "2004-04-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Off-site training by third party",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-03-01 00:00:00",
              "EquipmentInspectionDate": "2004-03-30 00:00:00",
              "EquipmentTested": "Compressors, vessels, condensers, levels, roof control groups, piping",
              "ChangeMgmtDate": "2004-04-28 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-30 00:00:00",
              "PreStartupReviewDate": "2004-04-28 00:00:00",
              "ComplianceAuditDate": "2001-12-12 00:00:00",
              "AuditCompletionDate": "2005-07-01 00:00:00",
              "IncidentInvestigationDate": "2003-07-07 00:00:00",
              "InvestigationChangeDate": "2003-08-01 00:00:00",
              "ParticipationPlansReviewDate": "2004-04-30 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-30 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-04-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 48132,
                  "PreventionProgram3ID": 33057,
                  "ProcessChemicalID": 75924
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 39925,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-01 00:00:00",
    "ERTrainingDate": "2004-04-07 00:00:00",
    "CoordinatingAgencyName": "Florence Fire Department",
    "CoordinatingAgencyPhone": "2567606475",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39925,
      "SummaryText": "Executive Summary\nSara Lee Corporation ¿ Florence Facility\n\n1   Corporate Commitment\n\nSara Lee Corporation has a basic and long-standing commitment to responsible stewardship of the environment, protection of the community, protection of employee health, and assurance of product safety.  This commitment extends to the processes covered by the requirements of EPA¿s Risk Management Plan (RMP).  The Florence, Alabama facility of Sara Lee Foods (Sara Lee Florence) has developed management systems to prevent the release of regulated substances, especially in locations that may cause detrimental effects to employees, the community, or the environment. These management systems comply with the various applicable governmental regulations. The systems were developed through systematic evaluation of process design, process technology, operational procedures, maintenance activities, non-routine procedures, emergency preparedness, training, and several other factors.\n\nSara Lee Florence has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, our trained personnel will respond to control and contain the release.\n\nSara Lee Florence plans to meet or surpass all regulatory requirements.  In the attempt to accomplish this goal, management systems at the Florence facility have been developed in such a way that the hazards are identified, understood, and controlled to prevent accidents.  \n\n2   Background Data\n\nSara Lee Florence manufactures pork sausage and a variety of other meat products marketed under familiar brand names such as Jimmy Dean, Bryan and State Fair.  Raw pork is received from offsite slaughterhouses, cooked and packaged in bo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39925,
      "SummaryText": "ver the 10,000 pound threshold. This process is a Program 3 process as defined by the risk management program rule (40 CFR Part 68).\n\n5   Release Scenarios\n\nIn accordance with 40 CFR Subpart B, SLF evaluated off-site consequences for releases of anhydrous ammonia.  Both a worst-case scenario and an alternate-case scenario were developed.\n\n6   Accidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, SLF has implemented precautionary measures. These precautionary measures comply with OSHA¿s PSM regulations and were evaluated and engineered for potential anhydrous ammonia releases.   Examples of some of the controls installed to prevent catastrophic releases of ammonia are vents, pressure relief valves, backup pumps, manual and automatic shutoffs, ammonia leak detection system, and electrical distribution system grounding.  In addition, SLF has trained approximately 35 employees to respond to potential ammonia releases.  These trained employees comprise the facility¿s Process Safety Team.\n\nSLF has developed Standard Operating Procedures (SOP) for all employees and contractors that have contact with the ammonia refrigeration system.  These procedures incorporate safety measures.  Safety procedures were developed by refrigeration system operators and are reviewed annually by a highly qualified SOP review team. \n\nSLF encourages employee participation in development of the control measures used at the plant by means of monthly Process Safety Team meetings.  Any changes to the operating procedures are communicated to affected employees following written management of change procedures established by SLF.\n\nSLF understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases. Therefore, SLF has implemented a preventative maintenance program.  The preventative maintenance program is managed and documented to ensure that regular maintenance occurs on the system.  Also, to e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39925,
      "SummaryText": "th bulk and consumer quantities. Total plant production is about two million pounds of product per week.  The site is located on about seventeen acres within the Florence City limits.  There are about 300,000 square feet under roof.  This facility has been in operation for over 50 years and currently provides more than 1000 jobs to the local community.\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Sara Lee Florence (SLF) submits this Risk Management Plan (RMP) for operations at their Florence, Alabama facility.\n\n3   Accidental Release Prevention and Emergency Response Policy\n\nSLF is committed to protecting the health of its employees, the surrounding community, and the environment. Therefore, it is SLF¿s policy to maintain compliance with 40 CFR 68 as well as Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA¿s Hazardous Operations and Emergency Response regulations (29 CFR 1910.120). \n\n4    Stationary Sources and Regulated Substances\n\nThe Florence facility operates one process that has more than a threshold quantity of a regulated substance.  That process is the plant-wide ammonia refrigeration process. Low temperatures are required in the food processing areas of the plant within standards required by the United States Department of Agriculture (USDA).  These low temperatures ensure quality in the final products.  Anhydrous ammonia, an industry-standard refrigerant for meat processing plants, is utilized as refrigerant to maintain the food processing areas of the facility within the required range of operating temperatures. \n\nAnhydrous ammonia is the RMP regulated chemical. The refrigeration system, consisting of receivers, compressors, evaporators, condensers, recirculators, and piping, can contain quantities o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 39925,
      "SummaryText": "nsure the mechanical integrity of critical refrigeration system components, ultra-sonic testing on piping, headers and vessels is conducted.\n\nTo ensure that SLF¿s control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n    ¿ In accordance with the Process Safety Management (PSM) program, SLF conducts detailed PSM compliance audits every   three years.  Each audit incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures. hot work permit procedures, and contractor safety procedures.\n    ¿ The following audits by outside agencies are conducted:\n              - The local fire department audits SLF on an annual basis.\n              - The USDA on a daily basis audits SLF.\n              - The facility¿s insurance carrier conducts independent audits on a semi-annual basis.\n\n7   Five-year Accident History\n\nSara Lee Florence has an outstanding record of accident prevention. This good record is demonstrated by the fact that over the past five years there have been no accidental releases of anhydrous ammonia that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n8   Emergency Response Program\n\nSara Lee Florence maintains a comprehensive written emergency response program to protect plant workers, the general public and the environment.  The program includes plans and procedures for responding to a wide range of events caused either naturally or accidentally that have the potential to result in a release of a regulated substance.  The SLF emergency respo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 39925,
      "SummaryText": "nse program utilizes the Incident Command System (ICS) which parallels the National Interagency ICS.  This is an ¿all risk¿ system developed for on-scene management of any emergency event.  The functional design of the ICS minimizes the impact of personnel changes upon the emergency plan. The emergency response program is updated when necessary, based on modifications made to the plant processes or facilities.  In addition, the plant has an emergency preparedness program that addresses maintenance; inspection and testing of response equipment as well as instructions and training that govern use of this equipment.\n\nThe overall emergency response program is coordinated with the Local Emergency Planning Committee (LEPC).  This coordination consists of periodic meetings of the committee. The committee is comprised of emergency response officials from the public sector, local government officials, and industry representatives.  SLF has around-the-clock communications with the LEPC to ensure notification in event of an incident as well as facilitating a quick response.\n\nSLF¿s emergency response program is contained in a written plan.  This plan is communicated to affected employees and to appropriate off-site agencies.\n\nSLF has trained approximately 35 employees to respond to accidental ammonia releases.  These employees are trained in accordance with 29 CFR 1910.120, OSHA¿s Hazardous Operations and Emergency Response regulations according to their duties and function.  They receive initial training and annual update training thereafter. \n\nAs backup measures, SLF has arranged emergency response assistance with the local Fire Department.\n\n9   Planned Changes to Improve Safety\n\nAmmonia refrigeration is a mature industry employing known technology.  Yet, the plant remains abreast of current innovations that improve safety.  To this end, the Sara Lee Corporation is an active member of International Institute of Ammonia Refrigeration (IIAR) and the Refrigeration Engineers Trai"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 39925,
      "SummaryText": "ning Association (RETA).  This involvement enables the facility to learn and implement the most modern safety system improvements as they emerge within the ammonia refrigeration industry.  Recently installed computer maintenance management systems enhance reliable operation of the RMP covered process. Some of the most recent planned improvements include location of ammonia alarm systems and improved ventilation systems in remote engine rooms."
    }
  ]
}