{
  "FacilityID": 39966,
  "FacilityName": "Mayfield Dairy Farms, Inc.",
  "FacilityStr1": "1160 Broadway Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Braselton",
  "FacilityState": "GA",
  "FacilityZipCode": "30517",
  "Facility4DigitZipExt": "0400",
  "FacilityCountyFIPS": "13157",
  "LEPC": null,
  "FacilityLatDecDegs": "34.104444",
  "FacilityLongDecDegs": "-083.784167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.deanfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3337268,
  "ParentCompanyName": "Deans Southeast II, LLC",
  "Company2Name": null,
  "CompanyDUNS": 5104815,
  "Company2DUNS": 0,
  "OperatorName": "Mark W. Howard",
  "OperatorStr1": "P.O. Box 400",
  "OperatorStr2": null,
  "OperatorCity": "Braselton",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30517",
  "OperatorZipCodeExt": "0400",
  "RMPContact": "Mark W. Howard",
  "RMPTitle": "Plant Manager",
  "FTE": 204,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040074",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-08-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-01-11 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-07 00:00:00",
  "AnniversaryDate": "2009-08-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.10404,
  "FRS_Long": -83.78127,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57440,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 39966,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58770,
          "ProcessID": 57440,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 75985,
          "ProcessID": 57440,
          "ChemicalID": 56,
          "Quantity": 16626.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 575985,
          "ProcessID": 57440,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 39966,
      "SummaryText": "Executive Summary\n\nDescription Of Facility and Regulated Substance Handled: Mayfield Dairy Farms, Inc. processes fluid milk. The facility utilizes anhydrous ammonia as a refrigerant to maintain the storage temperature of the product at the facility. Anhydrous ammonia is an effective refrigerant that has been used for many years by most food processing facilities. Ammonia is normally a gas at ambient temperatures but is handled as a gas liquefied under pressure. The refrigeration system consists of a high pressure receiver, evaporators, compressors, piping, and valves.\n\nAccidental Release Prevention and Emergency Response Policies: Mayfield Dairy Farms, Inc. is committed to promoting safety for the plant, its employees and the surrounding area. The facility is complying with OSHA?s Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA?s Risk Management Program Regulations (RMP), Title 40 CFR Part 68. The purpose of these programs is to ensure that the refrigeration system is operated safely in order to prevent releases of ammonia from the system. In addition, these programs serve to develop procedures to minimize releases in the event that they do occur and to outline appropriate emergency response steps to take in the event of a release.\n\nWorst Case Scenario: EPA?s ?General Risk Management Program Guidance, Appendix E - Guidance for Ammonia Refrigeration? (April 2004) and the International Institute of Ammonia refrigeration?s IIAR Risk Management Guidelines (1998) were the primary documents used to develop the worst case scenario. The worst case release is one that is unlikely to occur. The purpose of the worst case release analysis is to support a dialogue with the community on release prevention. It is a conservative analysis and is not to serve as a rational basis for actual emergency response planning.\n\nThe worst case release scenario (as identified by EPA) is the release of the largest quantity of ammonia from a "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 39966,
      "SummaryText": "vessel or process line failure that results in the greatest distance to a toxic endpoint. The worst case scenario for the refrigeration process is assumed to be a case where the total quantity of ammonia in the largest vessel is released. The release scenario was performed assuming that the vessel was filled to 100% capacity. The receiver, however, is normally filled to 25% capacity. There were passive mitigation systems (dikes, berms, drains, sumps, or enclosures) considered in the analysis since the receiver is located indoors.\n\n The toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. This endpoint is a concentration below which nearly all individuals could be exposed to for one hour without serious health effects. Based on exhibit E-2 in EPA?s guidance, a release from the receiver would result in a situation where public receptors would be within the distance to the toxic endpoint.\n\nAlternative Case Scenario: The alternative case release scenario selected is one in which premature lifting of a relief valve causes a release to the atmosphere. EPA?s ?General Risk Management Program Guidance, Appendix E - Guidance for Ammonia Refrigeration? (April 2004) and the International Institute of Ammonia refrigeration?s IIAR Risk Management Guidelines (1998) were the primary documents used to develop the alternative case scenario. The alternative case release scenario is one that is more likely to occur than the worst case release scenario.\nThe alternative case scenario must meet two criteria:\n1)    Must be more likely to occur than the worst case scenario; and\n2)    Must reach an endpoint off site, unless no such criteria exist.\n\nA possible release scenario is one in which a relief valve lifts prematurely. The alternate release was performed assuming that a 250 pound rated relief valve for the condensers lifted at 180 pounds of pressure. The ammonia detection system samples from eight ports throughout the facility and sen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 39966,
      "SummaryText": "ds an alarm if the concentration in any area exceeds the setpoint.\n\nThe toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. Based on EPA?s guidance, the alternative release scenario would result in a situation where public receptors would be within the distance to the toxic endpoint.\n\nAccidental Release Prevention Program and Chemical Specific Prevention Steps:\nAs a part of its PSM Program Mayfield Dairy Farms, Inc. has established numerous programs that serve to prevent accidental releases of ammonia. These programs include: Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Mechanical Integrity, Management of Change, Pre-Startup Safety Review, Compliance Audits, Incident Investigation, Employee Participation, Hot Work Permit System, and Contractor Safety.\n\nEmergency Response Information: As part of the PSM Program, the facility maintains an Emergency Response Plan that was prepared in order to improve responsiveness to an emergency incident, and to increase the reliability of actions taken during an incident. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies as well as the public.\n\nIn the event of an emergency involving the ammonia refrigeration system, it is the policy of the facility to request assistance as necessary by calling 911, which will notify the Jackson County Emergency Services. \n\nFive Year Accident History: Mayfield Dairy Farms, Inc. has had an excellent record of preventing accidental release over the last five years. Due to our stringent release prevention policies, there has been no accidental release meeting the criteria during this period.\n\nSteps to Improve Safety: The facility will continue to operate and maintain the system in accordance with IIAR Guidance and will continue to implement its OSHA PSM Program in conjunction with the RMP."
    }
  ]
}