{
  "FacilityID": 40030,
  "FacilityName": "Delta and Pine Land Company - Aiken, Texas",
  "FacilityStr1": "251 U.S. Highway 70",
  "FacilityStr2": null,
  "FacilityCity": "Aiken",
  "FacilityState": "TX",
  "FacilityZipCode": "79221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48153",
  "LEPC": "Floyd County LEPC",
  "FacilityLatDecDegs": "34.142900",
  "FacilityLongDecDegs": "-101.526500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Delta and Pine Land Company",
  "Company2Name": null,
  "CompanyDUNS": 6964845,
  "Company2DUNS": 0,
  "OperatorName": "Byron Hannabas",
  "OperatorStr1": "251 U.S. Highway 70",
  "OperatorStr2": null,
  "OperatorCity": "Aiken",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79221",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryon Hannabus",
  "RMPTitle": "Plant Manager",
  "FTE": 44,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164163",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-02126",
  "SafetyInspectionDate": "2003-07-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-06-20 00:00:00",
  "DeRegistrationEffectiveDate": "2018-06-07 00:00:00",
  "AnniversaryDate": "2009-08-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 34.14331,
  "FRS_Long": -101.52561,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57552,
      "AltID": "Cotton Seed Delinting",
      "FacilityID": 40030,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 58885,
          "ProcessID": 57552,
          "NAICSCode": "11192",
          "_desc": {
            "NAICS_CODE": "11192",
            "NAICS_DESCRIPTION": "Cotton Farming"
          }
        },
        {
          "Process_NAICS_ID": 58886,
          "ProcessID": 57552,
          "NAICSCode": "11511",
          "_desc": {
            "NAICS_CODE": "11511",
            "NAICS_DESCRIPTION": "Support Activities for Crop Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76120,
          "ProcessID": 57552,
          "ChemicalID": 54,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576120,
          "ProcessID": 57552,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40030,
      "SummaryText": "Delta and Pine Land Company performs agricultural research and prepares cotton seed for planting at the facility located in Aiken, Texas.  Cotton seed is prepared for planting by chemically removing lint from the seed using anhydrous hydrogen chloride (HCl) gas.  The delinted seed is treated with preservatives and other treatment chemicals and packaged for distribution.  Delta and Pine Land Company is dedicated to performing these activities safely and complying with all regulations regarding use of HCl, including requirements of the OSHA Process Safety Management Program and the EPA Risk Management Program.\n\nA maximum of 42,000 pounds of anhydrous hydrogen chloride gas is kept on-site for use in delinting cotton seed.  The HCl is delivered in and stored in two trailers containing 7 compressed gas cylinders, each containing a maximum of 3,500 pounds.  Only one tube is used at a time to supply HCl to the delinting process. The Aiken facility operates from September through May of each year and shut down for the summer months.\n\nDelta and Pine Land Company has conducted off-site consequence analyses for HCl releases from the process.  Both a \"worst-case\" scenario and an alternative release scenario were considered.  The worst-case scenario considered the release of an entire cylinder containing 3,500 pounds of HCl over a 10 minute period.  The alternative release scenario considered a slow release of a 3,500 pound cylinder over a 60 minute period.  The EPA RMP COMP release modeling software, used with published EPA guidance, predicted that a toxic plume could affect off-site receptors under both release scenarios.\n\nDelta and Pine Land Company has not had an accidental release of HCl in over 10 years.  To protect employees and the local community from any future HCL release, Delta and Pine Land Company has developed an incident prevention program.  Elements of the prevention program include: hazard analysis and identification, engineering design of the HCl system, opera"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40030,
      "SummaryText": "ting procedures, emergency response procedures, employee training, preventive maintenance, and incident investigation.  Hazard analysis identified piping leaks as the most probable cause of HCl releases.  The use of only one cylinder at a time from the 7 cyinder trailer limits the potential release amount.  The engineering design of the HCl piping system includes excess flow detection and automatic shutoff valves.  Check valves are also installed between critical points in the HCL system to prevent backflow in case of a line rupture.  These automatic systems are backed up by manual shutoff valves.\n\nAlthough the engineering design of the system will reduce or eliminate any accidental releases of HCl, administrative controls are also used to prevent releases.  Specific personnel are trained to follow the operating procedures developed for the delinting system and on-the-job training is used to assure their competence.  Emergency response procedures and equipment are maintained for use in the unlikely event of a significant accidental release.\n\nIf a release should occur, Delta and Pine Land Company will immediately notify and coordinate with local emergency personnel. Local wind speed and direction from monitors at the facility would be used to plan any off-site protective measures necessary and local emergency response personnel would notify the affected residents and implement responses."
    }
  ]
}