{
  "FacilityID": 4015,
  "FacilityName": "US Foodservice - La Mirada",
  "FacilityStr1": "15155 Northam Street",
  "FacilityStr2": null,
  "FacilityCity": "La Mirada",
  "FacilityState": "CA",
  "FacilityZipCode": "90638",
  "Facility4DigitZipExt": "5754",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.887306",
  "FacilityLongDecDegs": "-118.013389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.usfoodservice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 926581737,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "US Foodservice",
  "OperatorStr1": "15155 Northam Street",
  "OperatorStr2": null,
  "OperatorCity": "La Mirada",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90638",
  "OperatorZipCodeExt": "5754",
  "FTE": 290,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049413",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-23 00:00:00",
  "SafetyInspectionBy": "ASI",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.88288,
  "FRS_Long": -118.00806,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4663,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 4015,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 4979,
          "ProcessID": 4663,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4767,
          "ProcessID": 4663,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1744,
              "Process_NAICS_ID": 4767,
              "SafetyReviewDate": "1995-06-14 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-13 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "25,000 gallon water diffusion tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "revision of maintenance and operating procedures",
              "OpProceduresReviewDate": "1995-06-14 00:00:00",
              "TrainingReviewDate": "1999-02-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-05 00:00:00",
              "EquipmentInspectionDate": "1999-06-03 00:00:00",
              "EquipmentTested": "compressors, vessels, oil pots, evaporators",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-02-05 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-05 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-02-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1938,
                  "PreventionProgram3ID": 1744,
                  "ProcessChemicalID": 4979
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4015,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "La Mirada Fire Department",
    "CoordinatingAgencyPhone": "5629435512",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4015,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe US Foodservice facility has an emergency response plan in effect.  The Emergency Evacuation and Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nUS Foodservice maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\nUS Foodservice has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of US Foodservice to evacuate and to allow the fire department and the refrigeration contractors to respond to the emergency.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nConstruction of the ammonia refrigeration system at US Foodservice was completed in 1995.  The facility is located at 15155 Northam Street, La Mirada, California 90638.  The system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe US Foodservice facility receives and distributes food and food products to local vendors.  The ammonia refrigeration system uses 19,000 pounds of ammonia for dock operations, warehouse cold storage, an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4015,
      "SummaryText": "d freezer storage.  The majority of the system is located in the ammonia engine room including vessels and compressors.  The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas.\n\n\nHAZARD ASSESSMENT SUMMARY\n\n*  Worst Case Release Result Summary\n\n      Scenario Description:  Release of the maximum quantity of ammonia that can be stored in a vessel (Controlled Pressure Receiver) - 19,000 pounds in 10 minutes.  The most pessimistic meteorological conditions were used: 1.5 meters per second wind speed, and F stability.  Since the largest vessel is located inside the engine room, the enclosure was considered a passive mitigation.  The Risk Management Program Guidance for Ammonia Refrigeration reference tables were used to determine the maximum distance to the toxic endpoint of 200 ppm.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n*  Alternative Release Result Summary\n\n     Scenario Description: A release of ammonia from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of ammonia due to the pressure of the tank is 134 pounds per minute.  This release could occur outside, therefore no passive mitigation measures were taken into account.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  The Risk Management Program Guidance for Ammonia Refrigeration reference tables were used to determine the maximum distance to the toxic endpoint of 200 ppm.  This release reaches off site and may impact population receptors.  No environmental receptors were affected by this potential release.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe US Foodservice ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  F"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4015,
      "SummaryText": "or example, the US Foodservice facility operates in accordance with OSHA's Process Safety Management regulation.\n\nThe US Foodservice facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in selected cold storage areas, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the machine room (condensers).  All pressure vessels are equipped with pressure relief valves that are commonly piped to the water diffusion tank.\n\nA 400 kW backup generator is maintained on site to power certain systems in the facility during a loss of electrical services.  These systems include: the ammonia detection and alarm systems, ammonia scrubber and diffuser equipment, building management system computer, telephone/public address system, emergency lighting, and fire monitoring and alarm systems.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThis facility including the ammonia refrigeration system has been in operation since 1995.  There have been no ammonia accidents at the facility.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe US Foodservice has an emergency response plan in effect at the facility.  The Emergency Evacuation and Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4015,
      "SummaryText": "ment.\n  4.)  To minimize property damage.\n\nUS Foodservice maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\nUS Foodservice has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of US Foodservice to evacuate and to allow the fire department and the refrigeration contractors to respond to the emergency.  All employees at US Foodservice will be given emergency response training during New Employee Orientation and Department Safety Meetings.  At least annual emergency evacuation drills are held at the facility.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA Process Hazard Analysis (PHA) was completed prior to startup of the ammonia refrigeration system in 1995 based on the requirements of California's RMPP regulation.  As part of the RMP, US Foodservice conducted a revalidation of the original PHA on January 13, 1999.  A majority of the original recommendations were determined to be complete at this time.  The additional recommendations generated during the Revalidation are scheduled to be complete in June 1999.\n\n*  Revalidation Recommendations\n\nR01    Establish a policy to replace/recertify all relief valves in the system every five years or any time one is used.\n\nR02    Consider adding a visual inspection of the ammonia emergency dump box to the daily check list.\n\nR03    Place wind socks (or other wind"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4015,
      "SummaryText": "direction indicators) in locations that can be seen from all potential emergency exits.\n\nR04    Perform a manual test of the high level shut down switches associated with the HSA and the LSA on an annual basis.\n\nR05    Ensure that the compressors safety cutouts are tested and verified according to manufacturer recommendations.\n\nR06    Inspect, test, and calibrate all ammonia sensors in the system according to manufacturer recommendations.\n\nR07    Ensure that all employees are given basic familiarity training regarding ammonia.  Document the training with a certification form."
    }
  ]
}