{
  "FacilityID": 40198,
  "FacilityName": "Nisseki Chemical Texas Inc",
  "FacilityStr1": "10500 Bay Area Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Pasadena  LEPC",
  "FacilityLatDecDegs": "29.608333",
  "FacilityLongDecDegs": "-095.051667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 625141825,
  "ParentCompanyName": "Nippon Petrochemical Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nisseki Chemical Texas Inc",
  "OperatorStr1": "10500 Bay Area Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77507",
  "OperatorZipCodeExt": null,
  "RMPContact": "R.B. Herrscher",
  "RMPTitle": "Vice President operations",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000140581",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-02571",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 29.60833,
  "FRS_Long": -95.05556,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "PUBLIC LAND SURVEY - FOOTING",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57790,
      "AltID": "ENB Process",
      "FacilityID": 40198,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59130,
          "ProcessID": 57790,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76392,
          "ProcessID": 57790,
          "ChemicalID": 120,
          "Quantity": 538136.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 120,
            "ChemicalName": "1,3-Butadiene",
            "CASNumber": "106-99-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 76393,
          "ProcessID": 57790,
          "ChemicalID": 129,
          "Quantity": 133442.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576392,
          "ProcessID": 57790,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576393,
          "ProcessID": 57790,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 57791,
      "AltID": "SAS Process",
      "FacilityID": 40198,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59131,
          "ProcessID": 57791,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76394,
          "ProcessID": 57791,
          "ChemicalID": 129,
          "Quantity": 133442.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 76395,
          "ProcessID": 57791,
          "ChemicalID": 119,
          "Quantity": 98872.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 119,
            "ChemicalName": "1-Butene",
            "CASNumber": "106-98-9",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576394,
          "ProcessID": 57791,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576395,
          "ProcessID": 57791,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40198,
      "SummaryText": "Executive Summary\n\nNisseki Chemical Texas Inc.; 10500 Bay Area Blvd.; Pasadena, Texas 77507\n\n1    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Nisseki Chemical Texas Inc. we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n    A description of our facility and the storage and transfer of substances regulated     by EPA?s RMP regulation\n    A summary of results from our assessment of the potential offsite consequences from     accidental chemical releases\n    An overview of our accidental release prevention programs\n    A five-year accident history for accidental releases of chemicals regulated by EPA?s     RMP rule\n    An overview of our emergency response program\n    An overview of planned improvements at the facility to help prevent accidental     chemical releases from occurring and adversely affecting our employees, the public,     and the environment\n\n2    STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nNisseki Chemical Texas Inc is a chemical manufacturing facility located in Harris County, Texas.  The plant consists of reactors, distillation columns, storage tanks and shipping and receiving facilities for bulk tank trucks as well as rail.  Nisseki primarily manufactures chemicals used in the carbonless copy paper, electrical capacitor and EPDM rubber industries.  As a result of the processes some by-products are produced and are sold as fuels and solvents.\n\nThe majority of the chemicals handled at Nisseki are non-hazardous.  However, Nisseki does have three regulated flammable chemicals under the Risk Management Program.  These three chemicals are Bu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40198,
      "SummaryText": "tadiene, Propylene and Butene-1.  Nisseki does not store or process any of the listed toxic chemicals. \n\nThese two chemicals have been identified to have the potential to cause offsite consequences in the event of a substantial release.  Off site consequences were determined assuming maximum possible inventory even though the inventory of these chemicals is often reduced or removed.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment in the storage and transfer of these chemicals.\n\n3    KEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPA?s RMP rule requires that we provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the systems to limit the exposure distances for each scenario:\n\n\nWorst-case Release Scenario (WCS)-Flammables\n\nThe WCS would be a Butadiene explosion.  Butadiene can be stored in greater volume and has a higher vapor pressure than Propylene or Butene-1 and therefore has the potential for greater offsite consequences.  This scenario would require the instantaneous failure of the tank walls, the failure of all active safety systems, worse case weather conditions, a maximum inventory and total release of the contents of the tank.  There would also need to be an ignition source available to ignite the vapors resulting in the explosion of all vapors.  The true potential for this to occur is nil.  Assuming that it did occur the offsite pressure wave would not reach any public or environmental receptors.  \n\n\nAlternative Release Scenarios (ARS?s)-Flammables\n\nNisseki identified the greatest potential for a release scenario to be a leak.  Nisseki Chemical receives Butadiene via bulk rail cars that is off loaded by a compressor into a storage tank.  This scenario assumed the rupture of a two-inch u"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40198,
      "SummaryText": "nloading hose.  The unloading area is not contained and the leak was assumed to last for ten minutes.  The escaping vapor could be ignited by an unknown source causing an explosion.  In this scenario an overpressure of 1 psi would barely leave one corner of the plant.  Again no public or environmental receptors would be affected.  \n\n4    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\nProcess safety information, process hazard analysis, operating procedures, training, mechanical integrity, management of change, pre-startup review, compliance audits, incident investigation, employee participation, hot work permit procedure and contractor safety.\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps:\n\n1. All tanks are pressurized with pressure relief to a control device.\n2.  Pressure, temperature and level instrumentation including alarms.\n3. All key parameters are monitored in a central control room\n4. Systems are pressure tested before chemicals are introduced\n5. Tanks are built and installed per ASME and NFPA Codes\n6. Automatic Shutdown\n7. Area leak detectors\n8. All components are dedicated to Propylene and Butene-1 service\n9. Storage tank for Propylene has fireproof insulation for passive protection in a fire event.\n10. Propylene compressor system has automatic shutdowns on high temperature, high level and high or low pressure.\n11. Seal less pumps are used to eliminate leakage due to seal failures\n12. Remote valves to isolate and limit the release are in place.\n13. Plant wide modern Fire Water System\n14. Nisseki maintains trained emergency response personnel\n15. Nisseki has Mutual Aid agreement with other industrial neighbors (CIMA).\n\nThese individual elements of our prevention prog"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40198,
      "SummaryText": "ram work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n5    FIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  There have been no releases since our original start up of operation in June of 1994.\n\n\n6    EMERGENCY RESPONSE PROGRAM\n\nWe maintain an emergency response and contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan and we are members of the local Mutual Aid Association.  Elements of our emergency response plan that reduce the impact on the defined receptors are: Fire protection equipment, community alert system, water curtain capabilities to minimize releases, alarm systems, trained responders and communication links to off site responders.\n\n7    PLANNED CHANGES TO IMPROVE SAFETY\n\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:  Upgrading of process control system (DCS), installation of sophisticated flow meters to prevent contamination and leaks.  New personnel have been added to assist in the on going review and updating of procedures and programs. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNisseki Chemical Texas Inc\n\nCertification Letter\n                                \nCertification Statement for Program Level 2 & 3 Processes\n\n\nTo the best of the undersigned's knowledge, information, and \nbelief formed after reasonab"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40198,
      "SummaryText": "le inquiry, the information submitted\nis true, accurate, and complete.\n\n\n_________________________________       _________________________\nSignature                                       Print Name               \n\n_________________________________       _____________\nTitle                                               Date\n\nID Number:    1000 0014 0581"
    }
  ]
}