{
  "FacilityID": 40288,
  "FacilityName": "Scott Air Force Base",
  "FacilityStr1": "375 CES/CEV",
  "FacilityStr2": "702 Hangar Road",
  "FacilityCity": "Scott AFB",
  "FacilityState": "IL",
  "FacilityZipCode": "62225",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17163",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "38.323000",
  "FacilityLongDecDegs": "-089.514500",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22559418,
  "ParentCompanyName": "HQ Air Mobility Command",
  "Company2Name": "HQ USAF",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "U.S. Air Force",
  "OperatorStr1": "375 CES/CEV",
  "OperatorStr2": "702 Hangar Road",
  "OperatorCity": "Scott Air Force Bas",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62225",
  "OperatorZipCodeExt": "5035",
  "FTE": 12000,
  "OtherEPAFacilityID": "IL7570024177",
  "EPAFacilityID": "100000056663",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-09-16 00:00:00",
  "ErrorReportDate": "2004-09-16 00:00:00",
  "ReceiptDate": "2004-09-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-08-31 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2016-11-14 00:00:00",
  "DeRegistrationEffectiveDate": "2016-11-09 00:00:00",
  "AnniversaryDate": "2009-08-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 38.543888,
  "FRS_Long": -89.852301,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57891,
      "AltID": "1",
      "FacilityID": 40288,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 76499,
          "ProcessID": 57891,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59231,
          "ProcessID": 57891,
          "NAICSCode": "56221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33381,
              "Process_NAICS_ID": 59231,
              "SafetyReviewDate": "2004-02-20 00:00:00",
              "PHA_Date": "2004-02-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-02-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-20 00:00:00",
              "TrainingReviewDate": "2004-02-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-02-20 00:00:00",
              "EquipmentInspectionDate": "2004-02-20 00:00:00",
              "EquipmentTested": "WWTP Chlorine Cylinders",
              "ChangeMgmtDate": "2004-02-20 00:00:00",
              "ChangeMgmtReviewDate": "2004-02-20 00:00:00",
              "PreStartupReviewDate": "2004-02-27 00:00:00",
              "ComplianceAuditDate": "2004-02-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-02-20 00:00:00",
              "HotWorkPermitReviewDate": "2004-02-20 00:00:00",
              "ContractorSafetyReviewDate": "2004-02-20 00:00:00",
              "ContractorSafetyEvalDate": "2004-02-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 48502,
                  "PreventionProgram3ID": 33381,
                  "ProcessChemicalID": 76499
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40288,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-20 00:00:00",
    "ERTrainingDate": "2004-01-16 00:00:00",
    "CoordinatingAgencyName": "St. Clair County LEPC",
    "CoordinatingAgencyPhone": "6182773012",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40288,
      "SummaryText": "1.0\tOVERVIEW\r\n\r\nInstallation Background\r\n\r\nScott Air Force Base (SAFB) is located in St. Clair County, in the southwest portion of Illinois. To the northeast of the base is the community of Lebanon, to the southeast is Mascoutah, to the west are Belleville and Shiloh, and to the northwest is O'Fallon. MidAmerica Airport lies adjacent to the base to the north and east, and the remaining areas surrounding the base consists of some of the finest farmland within the state. The City of St. Louis is located only 20 miles to the west. Springfield, the capital of Illinois, is just over 100 miles north of the installation.\r\n\r\nThe total SAFB community is made up of more than 30,900 military and civilian personnel and their families living on and off base. SAFB employs nearly 12,000 persons; of whom 8,100 are military and 2,800 are civilian. In addition, there are also about 8,500 military retirees that the base serves.\r\n\r\nThe 375 Airlift Wing (AW) is the host unit at SAFB, fulfilling three primary missions:\r\n\r\nManaging a domestic aeromedical evacuation system;\r\nCommanding and supervising all operational support airlift within the United States; and\r\nConducting all Air Force C-9A aircraft qualification and instructor training.\r\n\r\nSAFB is also the home of five headquarters, which are all supported by the 375 AW. These headquarters include: the United States Transportation Command, Air Mobility Command (18th Air Force), Air Force Communications Agency, Defense Information Technology Contracting Office, and Air Force Office of Special Investigations 3rd Field Investigations Region. In wartime or during other contingencies, the 375 AW is responsible for managing the aeromedical evacuation system that is designed to evacuate battle causalities from combat areas anywhere in the world. Major groups under the 375 AW include the 375 Operations Group, 375 Logistics Group, 375 Support Group, and the 375 Medical Group.\r\n\r\nThe 375 AW is also host to more than 40 on-base tenant units and a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40288,
      "SummaryText": "nother 30 units located off base. These organizations represent a variety of critical Department of Defense (DOD) activities. \r\n\r\nThere are a total of 1,426 permanent military family housing units at SAFB. Of these units, 304 are designated for officers and 1,122 units are for enlisted personnel. Over 75-percent of the family housing units have been renovated, improved, or are new. \r\n\r\nRisk Management Background\r\n\r\nA Risk Management Program (RMP) has been implemented at Scott AFB for the reduction of accidental releases of hazardous materials. The RMP summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to the community from hazardous chemical releases. The Risk Management Plan is organized to correspond with specific U.S. Environmental Protection Agency (US EPA) RMP definitions and requirements (Chemical Accident Prevention Program, 40 CFR 68), including:\r\n\r\nScott AFB policies to protect health, environment, and safety;\r\nFacility identification and regulated substances covered processes;\r\nHazard Assessment;\r\nPrevention Program;\r\nFive-Year Accident History;\r\nEmergency Response Plan; and\r\nPlanned changes to improve safety.\r\n\r\nScott AFB's wastewater treatment plant (chlorine storage/use) is subject to US EPA's Risk Management Program regulations. The Risk Management Program regulations require facilities that store certain chemicals in excess of a threshold amount to prepare a comprehensive Risk Management Program. The Risk Management Program requires facilities to evaluate the consequences of certain accidents involving hazardous chemicals, to prepare a comprehensive program to prevent accidental releases, and to have an emergency response program for taking action in the event of a release. Scott AFB's RMP currently covers the chlorine storage at the WWTP, the only location where hazardous chemicals are stored in excess of the RMP threshold. Scott AFB also stores large quantities of propane, which"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40288,
      "SummaryText": "does not exceed the RMP threshold. Chlorine is the only chemical that will be addressed in the RMP. \r\n\r\nScott AFB is currently investigating the elimination of chlorine gas as a disinfection method at the WWTP.\r\n\r\n2.0\tRMP APPLICABILITY\r\n\r\nChlorine is the sole hazardous  chemical at Scott AFB that requires Scott AFB to maintain a Risk Management Plan and meet stringent reporting requirements. Chlorine is stored and used at the base Wastewater Treatment Plant (WWTP) (Building 3292) for disinfection of wastewater discharges. Scott AFB stores six 2,000 lb. cylinders of chlorine gas at the wastewater treatment plant (Building 3292). A pair of 2,000 lb. cylinders is used for disinfection of the normal discharge from the WWTP, while a second pair is used for disinfection of by-pass wastewater during periods of excess flow. Therefore, a total of four 2,000-lb. cylinders are typically stored and used. All four cylinders are stored inside Building 3292. The significant quantity of chlorine stored in this process exceeds the RMP threshold for chlorine of 2,500 lbs. The cylinders are pigtailed together in pairs, with each pair of cylinders sharing a common control valve. This valve switches over automatically when the flow from one cylinder drops below a specified level. During normal operation, the main valves on all four cylinders remain open.\r\n\r\n3.0\tHAZARD (OFF-SITE ANALYSIS)\r\n\r\nWorst-Case Release Scenario Analysis\r\n\r\nThis section summarizes the worst-case release scenario and public receptors associated with the chlorine process at the WWTP. Chlorine is stored at the WWTP near the southeast corner of the base property. Although the WWTP is located away from a majority of the base population, there are several public access areas nearby which would be of concern during a worst case scenario.\r\n\r\nThe RMP regulations define a worst-case release scenario or circle of concern as the release of the largest quantity of a regulated substance from a vessel or process line failure tha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40288,
      "SummaryText": "t results in the greatest distance to an endpoint. The worst case release scenario for toxic gases is assumed to be the total release of the single largest container in the process over a 10-minute duration. The worst case release scenario for the WWTP chlorine storage at Scott AFB would involve the failure of a chlorine cylinder containing 2,000 lbs. of chlorine. The chlorine would be released as a gas, and would form a vapor cloud that would travel in a downwind direction. If 2,000 lbs of chlorine gas were released over a 10-minute duration the endpoint would be 1.3 miles from the site of chlorine storage. \r\n\r\nA chlorine gas release from the chlorine storage area at the WWTP would affect public receptors during a worst-case release scenario. A public receptor is defined as off-site residences, institutions (e.g., schools, hospitals) industrial, commercial, and office buildings, parks, or recreational areas inhabited or occupied by the public at any time without restriction by the stationary source where members of the public could be exposed to toxic concentrations, radiant heat, or overpressure, as a result of an accidental release (40 CFR 68.3). For the purposes of this RMP, any building or area on Base where public access is allowed on an unrestricted basis was considered a public receptor. Public receptors at Scott AFB would include residences, recreational areas and a school. \r\n\r\nRMP regulations require an estimate of the residential population within the circle of concern for the worst-case scenario.  For chlorine, approximately 250 households would be impacted (980 persons) as a result of a worst-case scenario impacting the public areas listed in Table 3-1. The most sensitive receptor is the Southern Illinois University Research Center.\r\n\r\nAlternative Release Scenario Analysis (ARS)\r\n\r\nAn ARS event is more probable than a worst-case scenario. The RMP Guidance for Wastewater Treatment Plants provides a standard table for an unmitigated release rate. The WW"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40288,
      "SummaryText": "TP chlorine storage area is enclosed by a permanent structure. The release of a liquefied gas from a 1-ton cylinder (under 98.5 psig) due to a sheered valve or line would result in a release rate of 30 lbs/min over a 10-minute period. The release would travel a distance of 0.10 and would reach the base jogging trail and the nearby playground.\r\n\r\n4.0\tPROGRAM LEVEL DETERMINATION\r\n\r\nThe EPA outlines three program levels for the RMP Prevention Program. Scott AFB's chlorine storage and usage at the WWTP qualifies as a Program Level 3 (the most strict) due to potentially impact to a number of public receptors. The chlorine process at the WWTP is also subject to OSHA's PSM (29 CFR 1910.119) with a threshold of 1,500 lbs.\r\n\r\nScott AFB also stores large amounts of propane. The maximum amount of propane stored at any one propane process is 37,000 lbs (Fire Training Facility). The amount of propane in this process does not exceed the 67,000-lbs. threshold and therefore the RMP rule does not apply to this source. \r\n\r\n5.0\tPREVENTION PROGRAM\r\n\r\nScott AFB currently maintains a Prevention Program for this Program Level 3 process (chlorine) contained in a separate document entitled Accident Prevention and Process Safety Management Program. This prevention program ensures that:\r\n\r\nProcess safety information is provided to all employees\r\nHazard analyses are completed every five years\r\nWritten operating procedures are followed by employees and kept up-to-date.\r\nInitial and refresher training is provided to all employees\r\nPre-startup safety reviews are conducted\r\nMechanical integrity assurance program is in place\r\nHot work is permitted\r\nIncidents are investigated\r\n\r\n6.0\tEMERGENCY RESPONSE PROGRAM\r\n\r\nIn addition to the prevention program, Scott AFB maintains a Spill Prevention Control and Countermeasure Plan (SPCC) to mitigate the effects of accidental releases should they occur. The Scott AFB Fire Department is staffed 24 hours per day, 365 days per year.\r\n\r\n7.0\tFIVE-YEAR HISTORY\r\n\r\nS"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 40288,
      "SummaryText": "cott AFB has not experienced an accidental release of chlorine during the past five years. Scott AFB reports all releases of hazardous chemicals, regardless of size, to local and state regulatory agencies.\r\n\r\n8.0\tPLANNED CHANGES TO ELIMINATE CHLORINE STORAGE/USE\r\n\r\nScott AFB currently employs a safety checklist when changing chlorine gas cylinders at the WWTP. \r\n\r\nIn an effort to eliminate RMP requirements and reduce risk of chlorine release, Scott AFB conducted a study to determine alternatives to chlorine disinfection at the WWTP. Three alternatives were developed with a focus on eliminating chlorine storage: (1) changing chlorine storage cylinder size to reduce storage capacity to under the 2,500-lbs threshold, (2) utilize a substitute disinfection chemical and (3) utilize a non-chemical disinfection technology. \r\n\r\nSAIC interviewed several WWTP personnel to identify any solutions to reducing chlorine storage cylinder size. SAIC also contact gas supply vendors to inquire into the availability of smaller storage cylinders. Chlorine gas is supplied commercially in K-size and 1-ton cylinders. The K-size cylinders were considered inappropriate in capacity to handle large flows of wastewater at the WWTP.\r\n\r\nSAIC also investigated alternative chemicals for wastewater disinfection. Substitute chemicals were costly and would require costly infrastructure investments. Such chemicals included ozone, peroxone and others.\r\n\r\nThe preferred cost-effective solution to eliminate chlorine use at the WWTP is the implementation of ultra-violet (UV) disinfection technology. The UV study is attached to the Applicability Determination Statement (SAIC, 2004) as an appendix and is under review by the 375th CES/CEV for implementation. If this alternative were implemented, Scott AFB would no longer be subject to RMP regulatory requirements.\r\n\r\nScott AFB 375th CES/CEV will program/budget the appropriate alternative approach to eliminate chlorine as a pollution prevention project.\r\n\r\nScot"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 40288,
      "SummaryText": "t AFB has no future plans to introduce additional chemicals that would require sustainment of a RMP.\r\n\r\n9.0\tRMP MANAGEMENT PLAN\r\n\r\nA RMP management structure must be established to successfully implement  and sustain the RMP. In addition, a primary point of contact with overall authority for RMP implementation must be assigned. This primary POC will report to the 375th CES/CEV as required.\r\n\r\nThe RMP Team will be responsible for implementing, overseeing and updating the RMP. Updates will be conducted whenever:\r\n\r\n* A newly regulated substance is first listed by the EPA,\r\n* A regulated substance is above its threshold for the first time,\r\n* A revised PHA, hazard review or consequence analysis due to a changed process,\r\n* Program Level changes,\r\n* The facility is no longer subject to RMP requirements (de-registration).\r\n\r\nThe RMP Team would assume responsibility for meeting RMP requirements until use and storage of chlorine liquefied gas has been eliminated at the WWTP.\r\n\r\n\r\n??"
    }
  ]
}