{
  "FacilityID": 40341,
  "FacilityName": "GOLD COAST PACKING",
  "FacilityStr1": "840 W. Boone St.",
  "FacilityStr2": null,
  "FacilityCity": "Santa Maria",
  "FacilityState": "CA",
  "FacilityZipCode": "93455",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": null,
  "FacilityLatDecDegs": "34.946389",
  "FacilityLongDecDegs": "-120.445556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "GOLD COAST PACKING",
  "Company2Name": null,
  "CompanyDUNS": 21849443,
  "Company2DUNS": 0,
  "OperatorName": "Gold Coast Packing",
  "OperatorStr1": "123 N. Depot St.",
  "OperatorStr2": "PO Box 1023",
  "OperatorCity": "Santa Maria",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93455",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rick Spalding",
  "RMPTitle": "Director of Operations",
  "FTE": 80,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000189191",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "2004      Santa Maria",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-10-25 00:00:00",
  "DeRegistrationEffectiveDate": "2010-10-19 00:00:00",
  "AnniversaryDate": "2009-09-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "100",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57978,
      "AltID": "Refrigeration",
      "FacilityID": 40341,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59320,
          "ProcessID": 57978,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76622,
          "ProcessID": 57978,
          "ChemicalID": 56,
          "Quantity": 1320.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576622,
          "ProcessID": 57978,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40341,
      "SummaryText": "Executive Summary\n\nIn response to the Santa Barbara County Environmental Health Services Department directive, and as stipulated in sections 25531 to 25543.3 of the Health and Safety code, this Risk Management Plan (RMP), as outlined in the CalARP (California Accidental Release Prevention Program) Emergency Regulations, has been developed for Gold Coast Packing?s produce cooling and shipping facility in Santa Maria, California.   The purpose of this RMP is to:\n\n?Increase the protection of public health and the environment by ensuring proper emergency response and mitigation procedures when handling an acutely hazardous material (AHM).\n\n?Assist Gold Coast Packing and the local governmental agencies in their communication and coordination efforts to improve facility safety while handling an AHM.\n\nThis document addresses the existing AHM system used for the produce refrigeration process at the Gold Coast Packing facility.  The AHM used at the facility and for the focus of this study is anhydrous ammonia.  The devices that circulate and store the ammonia will be the subject of investigation throughout this RMP document.\n\nGold Coast Packing is located within the city limits of Santa Maria, California, in a predominately industrial/residential area, and is a produce pre-cooling, processing, cold storage, and shipping facility.   The facility was first constructed on this site in the mid 1990's and has been in continuous operation since that time.   Anhydrous ammonia is used as the closed-loop system refrigerant for the single pre-cooling vacuum tube equipment in an amount of approximately 1320 lbs., and is the only acutely hazardous chemical on the site.   The balance of the facility located on the 2.4 acre site consists of approximately 20,000 sq ft of Freon cooled cold storage warehouse, which is not required to be addressed in the RMP, and related office and storage space.   \n\nThe risks to the community from this facility would come from an incident in which the ammoni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40341,
      "SummaryText": "a normally contained within the vacuum tube refrigeration system was allowed to escape into the atmosphere.   In the worst-case scenario the toxic end point is located off the property within the community, the alternate release scenario was selected as the most likely event that could have a toxic endpoint located off of the subject property.   Events, which were considered possible and able to cause a release of ammonia for the purposes of the Hazard Review were:  equipment failure, operator error, design deficiency, vehicular accident, and acts of sabotage/vandalism, fire and earthquake.   It is expected that other specific events would have similar results as those listed above.   Direct contact with the released ammonia vapor by people inside the toxic endpoint is the main area of concern.\n\nThe worst-case release scenario considered was as required, specifically being the release of 100% of the ammonia contained within the largest vessel over a 10-minute period.   The analytical results of this scenario show a distance to the toxic endpoint of approximately .37 miles, which includes industrial development and residential area.   The alternative release scenario chosen as the most likely event involves the release of 300 lbs. of ammonia over a 30-minute period from a leaking valve or cracked pipe.   The distance to the toxic endpoint would be less than .1 miles in this case, however, CalARP requires the alternate release map to be developed to show a radius of vulnerability of at least .5 miles   Both scenarios can result in off-site impacts.\n\nPrevention of accidental ammonia releases is addressed by the following:\n               1.   System design and construction\n               2.   Administrative controls\n               3.   Trained operators on-site daily\n\nAdministrative controls and policies to be used in the event of a release are contained in the existing ?Hazardous Materials Unified Program - 2004\", and the included \"Emergency Response Plan\"   The major "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40341,
      "SummaryText": "topics covered by this document are:\n\n               1.   Emergency Contact List\n               2.   Emergency Action Team\n               3.   Notification Procedures\n               4.   Hazardous Material Inventory\n               5.   Site Plan, Facility Layout\n               6.   Personnel Responsibilities\n               7.   Evacuation Plan and Procedures\n               8.   Employee Training\n\nRisk reduction steps have been and are continuing to be implemented by Gold Coast Packing to: minimize the possibility of an accidental release of ammonia, and in the event of an accidental release, to minimize the effects upon the community.  The essential risk reduction steps now in effect at this facility are:\n               1.   Regular daily equipment observations\n               2.   Maintaining equipment maintenance records\n               3.   Maintaining records of previous releases/causes           \n               4.   Proper training of operators\n               5.   Mechanical and electrical system controls automatically maintain the correct system temperatures and  \n                    pressures, and provide safety shut-down and pressure relief to a diffusion tank in the event that the system\n                    operates out of the design limits\n               6.   All equipment and system components are designed for ammonia service\n               7.   The system appears to have been designed and installed in accordance with applicable Federal, State and local   \n                     codes.\n               8.   This facility currently operates under an Emergency Response Plan  which:\n                        a. Identifies the Emergency Coordinator and Emergency Contacts\n                        b. Details the Emergency Notification Procedures\n                        c. Contains procedures for hazardous material incidents\n                        d. Details reporting procedures\n                        e. Contains the evacuation plan\n                        f. Shows the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40341,
      "SummaryText": " locations of all acutely hazardous materials on-site\n                        g. Shows the locations of emergency response and mitigation equipment on  site\n               9.  This facility has not experienced an ammonia release within the last five years which resulted in the evacuation \n                        and/or sheltering in place of neighboring residents and/or properties.\n\nMitigation of Ammonia Releases is Addressed by the Following:\n  a. System Design and Construction\n  b. Administrative Controls\n  c. Maintenance Procedures\n  d. Refrigeration System Control Hardware\n\nRecommended plant improvements to increase safety.            \n1.   Provide pipe labeling as per UMC and ANSI/ASHRAE standards for the vacuum tube.\n\nUtility System:\nThis facility is connected to a public utility and is subject to possible power failures.  The failure of a refrigeration system to operate during a power outage poses no risk of an ammonia release since loss of power simply stops the flow of ammonia within the system.   In the event of a post-earthquake fire at the site, water for firefighting and/or ammonia dilution is drawn from the city water system.  The post-earthquake functionality of the water system thus depends on the vulnerability of the utility system and the city water system to earthquake induced failure, which is unknown."
    }
  ]
}