{
  "FacilityID": 40353,
  "FacilityName": "Lake Lewisville Water Treatment Plant",
  "FacilityStr1": "1701-B Spencer Road",
  "FacilityStr2": null,
  "FacilityCity": "Denton",
  "FacilityState": "TX",
  "FacilityZipCode": "76205",
  "Facility4DigitZipExt": "5103",
  "FacilityCountyFIPS": "48121",
  "LEPC": "Denton County LEPC",
  "FacilityLatDecDegs": "33.199168",
  "FacilityLongDecDegs": "-097.104172",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cityofdenton.com",
  "FacilityEmailAddress": "custserv@cityofdenton.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Denton",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Denton",
  "OperatorStr1": "215 E. McKinney",
  "OperatorStr2": null,
  "OperatorCity": "Denton",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76201",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000143873",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-12-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-12-11 00:00:00",
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 33.19747,
  "FRS_Long": -97.10846,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C03",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 57995,
      "AltID": null,
      "FacilityID": 40353,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 76649,
          "ProcessID": 57995,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59337,
          "ProcessID": 57995,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 21998,
              "Process_NAICS_ID": 59337,
              "SafetyReviewDate": "2008-04-29 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Crane Manufactoring  Association  of America (CMMA)",
              "FR_Comments": null,
              "HazardReviewDate": "2009-06-02 00:00:00",
              "ChangeCompletionDate": "2011-10-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-08-01 00:00:00",
              "TrainingReviewDate": "2009-01-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-09-01 00:00:00",
              "EquipmentInspectionDate": "2008-10-30 00:00:00",
              "EquipmentTested": "supply lines, high pressure manifold piping, manifold valves, automatic switchover valve, vacuum regulators, hoist/crane, exhaust fans, detection equipment, vacuum piping, chlorinators, ejectors,",
              "ComplianceAuditDate": "2007-09-11 00:00:00",
              "AuditCompletionDate": "2009-05-19 00:00:00",
              "IncidentInvestigationDate": "1995-02-02 00:00:00",
              "InvestigationChangeDate": "1995-02-03 00:00:00",
              "MostRecentChangeDate": "2008-10-08 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 22990,
                  "PreventionProgram2ID": 21998,
                  "ProcessChemicalID": 76649
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40353,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-03-01 00:00:00",
    "ERTrainingDate": "2006-03-28 00:00:00",
    "CoordinatingAgencyName": "Denton Fire Department",
    "CoordinatingAgencyPhone": "9403498101",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40353,
      "SummaryText": "Risk Management Plan\nExecutive Summary\n\nThe Lake Lewisville Water Production Plant is a water treatment plant that \nprovides drinking water to customers in the area of the City of Denton, Texas.  To \nensure that our water remains safe throughout the distribution system to every \ntap, the plant adds a small amount of chlorine as a disinfection agent.  \nThe concentrated form of chlorine is liquefied and stored in one-ton containers. \nBefore it is mixed with water, chlorine can be extremely hazardous if released to \nthe air all at once.  \nThe accidental release prevention and emergency response \npolicies at your facility.\n\nThe Lake Lewisville Water Production Plant is committed to protecting its \nemployees, the public, and the environment from any accidental releases of \nhazardous materials used at its facilities.  We have implemented safety, \nenvironmental protection, and risk management programs to prevent hazardous \nmaterials releases.  If there is an accidental release, we will immediately call for \nemergency response, Denton Fire Department, to minimize the effect of the \nrelease and notify the public of any actions necessary to ensure public \nprotection, through emergency management agencies.  The water utility \nmanagement along with its employees is always looking for ways to improve \nsafety regarding the handling and use of chemicals.  In addition to safety, we \ncontinuously review operational and maintenance procedures to ensure the \nprocess is maintained as safe as possible.\nFive-Year Accident History\nWithin the past five years, the Lake Lewisville Water Production Plant has not \nhad any accidental releases that resulted in injuries or property damage. The \nplant has maintained an excellent safety record throughout its operating history \nand has never had a major chlorine release that could have had adverse effects \non the public.\nEmergency Response\n    \n    \"In the event that a chlorine release does occur, the Lake Lewisville Water \nProduction Plant has an emergen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40353,
      "SummaryText": "cy response program that includes trained \nonsite emergency responders and coordinates emergency response with the \nregional response organizations and LEPC. If an emergency did occur, plant \npersonnel would contact the Denton Fire Department response team and notify \nthe regional response organizations who would assist if offsite actions were \nneeded or to help address the chlorine release. \"\n    \nThe City of Denton installed a siren system in 2000 that warns the general public \nof emergencies.  This includes severe weather like hail, high winds and tornadoes \nand hazardous material spills, that could occur anywhere in the city.  When the \ngeneral public hears the alarms, they either tune their radio to station 88.1 FM \nKNTU or tune their television to the City of Denton's cable station, Channel 26 for \ninformation on the emergency and what actions they should take.\n    \n    All Lake Lewisville Water Production Plant employees are trained for \nhazard material awareness for first responders.  This course is designed \nto make people aware of their environment and the steps to take if a \nhazardous material is spilled.  Employees at the plant are trained to \nrespond to hazardous material spills to correct problems.  If the Lake \nLewisville Water Production Plant had an accidental leak, these \nemployees would assist the Denton Fire Department with technical \ninformation to correct major leaks.  A chlorine container, specifically \ndesigned for training, was purchased and setup to match our system.  The \nwater plant employees trained for emergency response along with the \nDenton Fire Department take part in training exercises once or twice a \nyear.  This training covers all leak scenarios on a chlorine container.  \nOnce a year, all water production employees receive training on our \nchlorine system and the Risk Management Program.\nMaintaining A Safe Operation\n    The Lake Lewisville Water Production Plant continually works to safely manage \nthe hazards of chlorine to protect employee"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40353,
      "SummaryText": "s, the community and the \nenvironment. The Risk Management Program will be maintained to reduce the \nrisk of accidental releases and each year we will conduct training, review \nprocedures, maintain the equipment and follow safe work practices. Periodically, \nwe will audit our program, review our Process Hazard Analysis and coordinate \nwith the community emergency response organization. We will also be assessing \nfurther safety enhancements to the facility over the next few years.\n\nChlorine system of the past\nSafety improvements for the chlorine system began in 1987.  A new facility was \nbuilt that included both inside and outside on-site storage of chlorine containers \nwith an overhead hoist for moving the containers.  The new chlorine system is \nvacuum controlled; this reduced the amount of pressurized pipe.  Another safety \nimprovement was the addition of chlorine gas detector equipment with audible \nand visual alarms.\n\nSince 1987, additional improvements have occurred to increase chlorine safety.  \nMost of the safety improvements are changes in operational and preventive \nmaintenance procedures.  Through safety meetings, independent chlorine safety \naudits, and general discussions, all of the pressure piping and suspect \ncomponents were scheduled for replacement every five years.\n\nOperators became more aware of potential weaknesses of the system and \nbegan to perform routine system checks around the clock.   All doors leading \nfrom the chlorine system were reconfigured for easy evacuation.  A windsock \nwas installed to direct personnel in the event of an accidental leak.  In 1995, the \nchlorine gas detection system was replaced with a more reliable system that is \nprecisely calibrated.\nCurrent system\nThe current chlorine system is still going through changes to improve safety. With \nthe intense effort to develop and implement a risk management plan, we have \nfound areas that were improved.  Procedures that were verbally handed down \nwere written down with improve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40353,
      "SummaryText": "ments.  Vital equipment often overlooked was \ngiven attention.  And training for all personnel on all processes was documented, \nperformed and scheduled.\n\nAs a part of the Risk Management Program, we wanted to examine the risks \nassociated with the current chlorine feed system or eliminate the risks totally by \nusing non-hazardous chemicals for the disinfection processes.  The City of \nDenton was assisted by Carollo Engineering to determine if our system could \nreduce or eliminate any hazards associated with its use of gaseous chlorine.  \n\nThe risks associated with storage and uses of hazardous chemicals are \ndiscussed throughout the RMP.  The safety record of the water treatment \nindustry relative to the use of hazardous chemicals has been very good \nhistorically.  In some cases, risks can be eliminated; however, usually it is a case \nof offsetting other risks. There are many different types of risks associated with \nthe storage and use of hazardous chemicals.  For purposes of the RMP, they \nwere divided into the following:\n?    Transportation to the site\n?    Unloading of the chemical at the delivery site\n?    Storage of a chemical\n?    Operational procedures for moving containers\n?    Metering and conveying of a hazardous chemical to the application \npoint\nMetering and conveying risks are by far the most significant associated with the \ntreatment plant.  The failure of the flexible connections and lead gaskets seals \nare the most common cause of chlorine releases followed by valve packing \nfailure and equipment failure.  \n\nCarollo Engineering concluded that the alternatives to gaseous chlorine all \ninvolve significantly greater cost on a present-worth analysis without any risk \nreduction.  Carollo recommended that we should continue using chlorine in the \ngaseous form.  They also recommended that we purchase emergency shutoff \nvalves for each chlorine container connected to the manifold as a quick means to \nreduce accidental chlorine leaks.  The emergency shutoff valves can qui"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40353,
      "SummaryText": "ckly \nclose the chlorine container valve in the advent of a leak, thus shutting off the \nsupply of chlorine to the system.  These shutoff devices were installed in \nSeptember of 1999.\n\nThe Self-Contained Breathing Apparatus's (SCBA) at the water production plant \nwere replaced with the same brand used by the Denton Fire Department.  Since \nthat time, the Fire Department has switched to another brand of SCBA.  As a part \nof the risk management plan, all personnel at the water production plant have \ntaken an 8-hour hazard awareness class, facilitated by the Governor's office of \nthe State of Texas to learn about the hazards around the plant and out in the \nenvironment.  In addition to the hazard awareness course, several water production employees have been trained in a 40-hour hazard material \ntraining course and received certification as Hazard Material Technicians.  They \nreceived this training to respond to chlorine leaks at the plant as technical \nadvisors to our primary responders, the Denton Fire Department.  For incipient \nchlorine releases, these employees are the primary responders.\n\nPlanned changes to improve safety\nBefore the hazard reduction/elimination study by Carollo Engineers, the water \nproduction plant had planed to retrofit the current chlorine facility with a chlorine \ngas scrubber system, during fiscal year 2000.  A chlorine gas scrubber system \npulls the air and chlorine gases from a room and neutralizes it, converting it into a \nbrine solution.  Carollo recommended building a new chlorine facility instead of a \nretrofit because the cost of getting the current facility up to the current building \nand fire codes was slightly less than the cost of a new facility.\n\nThe new facility will be built to the current building codes and will include many \nsafety improvements over the current facility.  Some of these improvements \ninclude increasing chlorine feed capacity, enclosing all containers, switching from \none-ton containers to bulk containers, addi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 40353,
      "SummaryText": "ng a scrubber system, intruder alarms, \ngas detectors with alarms, and emergency backup power.  The building of this \nfacility is scheduled to begin during fiscal year 2010 and be completed during fiscal year 2011.\nCity of Denton Lake Lewisville Water Production Plant     Page 1 of 4\nC:\\Documents and Settings\\kagault\\Desktop\\RMP\\ll\\2004\\Executive Summary.doc\n\n"
    }
  ]
}