{
  "FacilityID": 40406,
  "FacilityName": "Allegheny Ludlum Corporation Brackenridge Facility",
  "FacilityStr1": "100 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Brackenridge",
  "FacilityState": "PA",
  "FacilityZipCode": "15014",
  "Facility4DigitZipExt": "1597",
  "FacilityCountyFIPS": "42003",
  "LEPC": "Allegheny County LEPC",
  "FacilityLatDecDegs": "40.607778",
  "FacilityLongDecDegs": "-079.729167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": "dcalderazzo@alleghenyludlum.com",
  "FacilityDUNS": 4335154,
  "ParentCompanyName": "Allegheny Technologies Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Allegheny Ludlum Corporation",
  "OperatorStr1": "100 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Brackenridge",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15014",
  "OperatorZipCodeExt": "1597",
  "RMPContact": "Deborah L. Calderazzo",
  "RMPTitle": "Director, Environmental Affairs",
  "FTE": 1632,
  "OtherEPAFacilityID": "15014LLGHNRIVER",
  "EPAFacilityID": "100000124518",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "#0059",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-01-26 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-09 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 40.60833,
  "FRS_Long": -79.72972,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58054,
      "AltID": "Acid bath for processing",
      "FacilityID": 40406,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59396,
          "ProcessID": 58054,
          "NAICSCode": "331111",
          "_desc": {
            "NAICS_CODE": "331111",
            "NAICS_DESCRIPTION": "Iron and Steel Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76720,
          "ProcessID": 58054,
          "ChemicalID": 55,
          "Quantity": 110915.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576720,
          "ProcessID": 58054,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40406,
      "SummaryText": "This Risk Management Plan (RMP) has been developed by Earth Sciences Consultants, Inc. (Earth Sciences) for Allegheny Ludlum Corporation's Brackenridge facility located at 100 River Road, Brackenridge, Pennsylvania, and is pursuant to the requirements of 40 Code of Federal Regulations (CFR) Part 68.  The Brackenridge RMP was reviewed and, where applicable, updated in May 2004.\n\nProcess Description and Regulated Substances.\nThe Brackenridge facility has designed and operates a process for the storage and transfer of 70 percent hydrofluoric acid (HF) into process tubs.  The process includes a 12,000-gallon storage tank located in a designated acid storage area and piping used to supply 70 percent HF to the process tubs.  This process is located in a part of the Brackenridge Plant that is designed for the storage, handling and use of Hydrofluoric acid.  The storage, handling, and use of 70 percent HF at the plant is hereafter referred to as \"Process No. 1\" in the remainder of this document.  The North American Industrial Classification System code for the facility is 331111.  The Brackenridge facility process is classified as a Tier II program since the facility is not subject to Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) requirements under 29 CFR 1910.119.  \n\nAccident Release Prevention and Emergency Response Policies\nThe Brackenridge Facility has an excellent record in preventing and minimizing releases of hydrofluoric acid.  The Brackenridge Facility remains committed to the prevention of releases of hydrofluoric acid.  In the event of a release, the Brackenridge Facility is committed to a timely response in accordance with their Emergency Response Plan and the applicable components of this RMP.  Accident prevention and emergency response programs are described in this RMP.  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nThe Brackenridge facility has safe job procedures (SJP) in place:"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40406,
      "SummaryText": "\n? to evaluate the HF tank capacity and volume already in place before unloading begins;\n? to describe the use of HF in the facility's manufacturing operations; and\n? for the inspection of process equipment including the HF tank, piping, and isolation valves.\n\nIn addition, the Brackenridge Facility trains employees regarding safe job procedures, safe work practices, emergency evacuation and response, and routine and nonroutine work authorization.  Finally, the Facility maintains the ongoing mechanical integrity of the process equipment.\n\nFive-Year Accident History\nThere have been no accidental releases associated with these processes in the last 5 years that have resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  \n\nEmergency Response Program\nThe Brackenridge Facility maintains a PPC Plan/Spill Prevention Response/(SPR) Plan and an Emergency Response Plan.  The  Brackenridge Facility has trained employees for an initial response team.  This team will don personal protective equipment (PPE) and be dispatched to control or stop a minor emergency or an accidental release or help move any employee(s) that has been affected by a 70 percent HF release.  If necessary, employees will be evacuated to a safe zone.\n\nIn the event of an emergency where off-site response is appropriate, it will be the policy of the Brackenridge Facility to notify the Brackenridge Fire Department and/or the Local Emergency Planning Committee (LEPC) and request that they respond to the emergency.  A fire, explosion, or other occurrence with the potential to create a release of the regulated substance (HF) from the process may pose a danger to public emergency responders.   Public emergency responders will not be permitted to enter this area except as previously arranged with the Primary Emergency Coordinator (PEC) or other designated personnel, as identified within this"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40406,
      "SummaryText": " RMP.\n\nFinally, the  Brackenridge Facility has an equipped emergency control center.  The emergency control center is sited in a safe zone and serves as the major communication link between the PEC and plant or corporate management as well as with local community officials.\n\nPlanned Changes to Improve Safety\nNo additional measures to prevent off-site impacts from accidental releases have been identified or are required at this time.  If reasonable measures are subsequently identified that would lower the risk of an off-site release, such measures will be implemented.\n\nResponsible Person\nI, Deborah L. Calderazzo, Director, Environmental Affairs, have been assigned as the qualified person with the overall responsibility for the development, implementation, and integration of the RMP and subsequent program elements for the Brackenridge Facility of the Allegheny Ludlum Corporation.\n\nCurrently, I have the responsibility for implementing the individual requirements of this RMP.  Should this responsibility be assigned to another person (or persons) other than myself, the names and positions of these people will be documented and the lines of authority will be defined through an organization chart or similar document. \n\nI certify that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted here is true, accurate, and complete.\n\nName:  Deborah L. Calderazzo\nSignature:   ____________________\nTitle:  Director, Environmental Affairs\nDate:  7 May 2004"
    }
  ]
}