{
  "FacilityID": 40479,
  "FacilityName": "Foothills Water Treatment Plant",
  "FacilityStr1": "6730 North Rampart Range Road",
  "FacilityStr2": null,
  "FacilityCity": "Littleton",
  "FacilityState": "CO",
  "FacilityZipCode": "80125",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08035",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "39.459444",
  "FacilityLongDecDegs": "-105.072778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.denverwater.org",
  "FacilityEmailAddress": "joseph.sloan@denverwater.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Denver Water",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Denver Water",
  "OperatorStr1": "1600 West 12th Ave",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80204",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": "COR000013599",
  "EPAFacilityID": "100000112291",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 39.45954,
  "FRS_Long": -105.07304,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58149,
      "AltID": "Water Treatment",
      "FacilityID": 40479,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 76830,
          "ProcessID": 58149,
          "ChemicalID": 62,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59492,
          "ProcessID": 58149,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 22056,
              "Process_NAICS_ID": 59492,
              "SafetyReviewDate": "2004-02-22 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute or Industry Standards",
              "FR_Comments": "Complied with standards at time of construction",
              "HazardReviewDate": "2002-06-12 00:00:00",
              "ChangeCompletionDate": "2002-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Computerized process control",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "scrubber",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-04-22 00:00:00",
              "TrainingReviewDate": "2004-09-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-06-02 00:00:00",
              "EquipmentInspectionDate": "2004-07-30 00:00:00",
              "EquipmentTested": "chlorine receiving fittings",
              "ComplianceAuditDate": "2002-04-25 00:00:00",
              "AuditCompletionDate": "2002-08-01 00:00:00",
              "IncidentInvestigationDate": "2004-02-19 00:00:00",
              "InvestigationChangeDate": "2004-02-19 00:00:00",
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Water Treatment chlorine system",
              "_chemicals": [
                {
                  "PrimaryKey": 23050,
                  "PreventionProgram2ID": 22056,
                  "ProcessChemicalID": 76830
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40479,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-09-07 00:00:00",
    "ERTrainingDate": "2004-03-14 00:00:00",
    "CoordinatingAgencyName": "West Metro fire Department",
    "CoordinatingAgencyPhone": "3039894307",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40479,
      "SummaryText": "Foothills Water Treatment Plant\nRMP Plan Executive Summary\n\nExecutive Summary\nThis executive summary is a brief overview of the Risk Management Program (RMP) and the associated policies at the Denver Water Foothills Water Treatment Plant.  \nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are presented in the Emergency Planning and Response Sections of the Foothills Water Treatment Plant RMP manual. Denver Water takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are properly trained in the safe operation of systems using hazardous substances, and the safe handling of water treatment chemicals. \nDenver Water has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\nDenver Water management, as a public utility, recognizes the importance of providing a safe working environment, and taking all reasonable measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in the design of the facilities, the commitment to training and the procedures described and referenced in the RMP manuals.\nApplicable Sources and Regulated Substances\nFoothills Water Treatment Plant treats up to 300 million gallons per day.  The regulated hazardous substances stored at this facility include chlorine and aqua ammonia.  Both chemicals are used in the treatment process to ensure the water we serve to our customers is safe to drink. The chlorine is stored on site in three 20-ton tanks.  The maximum intended inventory is 120,000 pounds.  Aqua ammonia is also stored on site.  Two 4,500-gallon steel tanks are used to store the mixture containing water and 29% (by weight) ammonia.  This quantity of actual ammonia (18,000 lbs) is below the threshold quantity established by the RMP program of 20,00"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40479,
      "SummaryText": "0 lbs. of ammonia.\nWorst-case and alternative release scenarios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For the worst-case release scenario, the regulation is clear.  The assumption is that the single largest container of a regulated substance (one 20-ton tank containing chlorine) is released over a ten-minute period.  No active mitigation may be considered.  Worst-case meteorological conditions are also assumed to be present.  The RMP*Comp program was used to determine distances to toxic endpoints.  For chlorine, a distance of 4.4 miles to the toxic endpoint was calculated for a release of the entire contents of an 20-ton tank in ten minutes.\nThe alternative release scenario for chlorine consists of a release of the contents of a ? inch pipe of chlorine over a 30 minute period due to a severed pipe or broken pipe.  Due to protective measures taken, the release was anticipated to occur indoors, and no active mitigation devices were considered to influence the release scenario.  A distance of 0.2 miles to the toxic endpoint was calculated.\nPrevention Steps for Chlorine and Aqua Ammonia Systems\nThe prevention program and chemical-specific prevention steps are described in detail in the Foothills Water Treatment Plant RMP manual.  The prevention programs include the following elements:\n?    Employee participation, which includes provisions for active participation by plant employees in the development and implementation of the plant RMP programs, as well as ready access to program information.\n?    Process safety information, which has been collated into the RMP manual located in the Foothills Water Treatment Plant Control Room.\n?    Process hazard analyses (PHAs) ? The PHA for both the chlorine system and ammonia system was conducted in August of 1999 and reviewed in June of 2002 and September of 2004.  All recommendations from the PHAs have been addressed.\n?    Operating procedures for ap"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40479,
      "SummaryText": "plicable processes are maintained at the plant.\n?    Training for all personnel involved in the operation and maintenance of the chlorine and ammonia systems.\n?    Contractor management which includes provisions for the evaluation and selection of contractors to work on the regulated processes, exchange of hazard information, system access control, and oversight during work activities on site.\n?    Pre-startup safety review procedure for significant system changes to ensure that:\n1.    the construction and equipment installation is according to design specifications, \n2.    appropriate procedures are in place and accurate, \n3.    a PHA has been completed and the recommendations resolved, and \n4.    employees are trained prior to startup of the modified system\n?    Mechanical integrity program to ensure that the chlorine and ammonia systems equipment is maintained in good and safe working condition\n?    Hot work procedures to prevent hot work on active portions of the chlorine or ammonia system.\n?    Management of change program to ensure that proposed system changes are comprehensively evaluated before implementing the change\n?    Incident investigation procedures for the investigation of any catastrophic (or potentially catastrophic) incident associated with the chlorine or ammonia system, using the Denver Water Incident Investigation Report procedures.\n?    Compliance audits to be conducted at least once every three years to ensure the continued compliance of the Foothills Water Treatment Plant RMP programs.\nAccident History\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of chlorine or aqua ammonia meeting the requirements of 40 CFR 68.42 (i.e. deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage).\nEmergency Response Program\nThis facility has established and maintains an emergency response program that is coordinated with local response"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40479,
      "SummaryText": " agencies.  The program is described in detail in the Emergency Planning and Response section of the RMP compliance manual and meets the requirement of 40 CFR 68.95.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\nPlanned Changes for Improved Safety\nSignificant modifications to the plant systems including both chlorine and aqua ammonia are not anticipated to be undertaken in the next few years.  Ideas for changes to improve safety are actively sought from employees.  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\nDuring the development of the Foothills Water Treatment Plant RMP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been considered for implementation.  Though not all recommendations may have been implemented, all were considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered processes."
    }
  ]
}