{
  "FacilityID": 40562,
  "FacilityName": "ETHOX CHEMICALS LLC.",
  "FacilityStr1": "1801 PERIMETER ROAD",
  "FacilityStr2": null,
  "FacilityCity": "GREENVILLE",
  "FacilityState": "SC",
  "FacilityZipCode": "29605",
  "Facility4DigitZipExt": "5260",
  "FacilityCountyFIPS": "45045",
  "LEPC": "Greenville County LEPC",
  "FacilityLatDecDegs": "34.733056",
  "FacilityLongDecDegs": "-082.374444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ethox.com",
  "FacilityEmailAddress": "cbristow@ethox.com",
  "FacilityDUNS": 55063077,
  "ParentCompanyName": "PIEDMONT CHEMICAL INDUSTRIES, INC.",
  "Company2Name": null,
  "CompanyDUNS": 3215779,
  "Company2DUNS": 0,
  "OperatorName": "FRED WILSON",
  "OperatorStr1": "331 BURTON AVE.",
  "OperatorStr2": null,
  "OperatorCity": "HIGH POINT",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27260",
  "OperatorZipCodeExt": "8071",
  "FTE": 150,
  "OtherEPAFacilityID": "SCD055063077",
  "EPAFacilityID": "100000030236",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1200-0171",
  "SafetyInspectionDate": "2006-02-09 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 34.73304,
  "FRS_Long": -82.3743,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58265,
      "AltID": "ETHOXYLATION",
      "FacilityID": 40562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 76968,
          "ProcessID": 58265,
          "ChemicalID": 9,
          "Quantity": 510000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59610,
          "ProcessID": 58265,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33641,
              "Process_NAICS_ID": 59610,
              "SafetyReviewDate": "2004-03-03 00:00:00",
              "PHA_Date": "2004-03-03 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-11-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-01-05 00:00:00",
              "TrainingReviewDate": "2003-09-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Technical College Certifications",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-04-24 00:00:00",
              "EquipmentInspectionDate": "2004-03-10 00:00:00",
              "EquipmentTested": "Reactors, Transfer Lines, Preweight Tanks",
              "ChangeMgmtDate": "2001-07-24 00:00:00",
              "ChangeMgmtReviewDate": "2003-12-07 00:00:00",
              "PreStartupReviewDate": "2001-07-24 00:00:00",
              "ComplianceAuditDate": "2003-09-23 00:00:00",
              "AuditCompletionDate": "2004-03-10 00:00:00",
              "IncidentInvestigationDate": "1999-05-18 00:00:00",
              "InvestigationChangeDate": "1999-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2003-09-23 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-10-02 00:00:00",
              "ContractorSafetyEvalDate": "2003-10-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ethox Chemicals LLC. Emergency Action Plan",
              "_chemicals": [
                {
                  "PrimaryKey": 48839,
                  "PreventionProgram3ID": 33641,
                  "ProcessChemicalID": 76968
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 58266,
      "AltID": "PROPOXYLATION",
      "FacilityID": 40562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 76969,
          "ProcessID": 58266,
          "ChemicalID": 12,
          "Quantity": 510000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59611,
          "ProcessID": 58266,
          "NAICSCode": "325199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40562,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-05 00:00:00",
    "ERTrainingDate": "2003-08-22 00:00:00",
    "CoordinatingAgencyName": "DONALDSON CENTER FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "8642771429",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40562,
      "SummaryText": "Ethox Chemicals LLC.\nRisk Management Plan\n Executive Summary\n\n\n  EXECUTIVE SUMMARY\n\nEthox Chemicals LLC. ( Ethox ) is committed to operating in a manner that is safe for its employees, the public, and the environment.  As part of this commitment, Ethox established a system to ensure safe operation of the processes at this facility.  Part of this system is a Risk Management Program that helps manage potential risks at Ethox and that complies with the requirements of the Environmental Protection Agency's (EPA) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One requirement of the rule is to submit a Risk Management Plan (RMP) describing the risk management program at Ethox.  This document is intended to satisfy the RMP requirements of the RMP rule and to provide the public with a description of the risk management program at Ethox.\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nEthox is committed to employee, public and environmental safety.  A comprehensive accidental release prevention program is in place that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.  It is Ethox policy to implement appropriate controls to prevent possible releases of regulated substances.  However, if such a release does occur, Ethox is completely coordinated with Donaldson Center Fire Department which provides trained emergency response personnel to assist in the control and to mitigate the effects of the release.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nThe facility's primary activity is the manufacturing of Surface Active Chemicals.  There are two regulated substances present at the facility: Ethylene oxide [Oxirane] (EO) and Propylene oxide [Oxirane, methyl-] (PO). EO and PO are used for manufacturing detergents, emulsifiers and wetting agents. The maximum inventory in any one v"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40562,
      "SummaryText": "essel of EO or PO at this facility is 170000.00 lbs.\n\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with (NFPA-58 Standard, 1967 Edition).  A number of processes at the facility are subject to the OSHA PSM standard under 29 CFR 1910.119.\n\nThe following sections briefly describe the elements of the release prevention program that are in place at Ethox.\n\nProcess Safety Information\nEthox maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nThe facility conducts comprehensive studies to ensure that hazards associated with processes are identified and controlled efficiently.  The methodology used to carry out these analyses is Leader 2.3 process sections and deviations.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of three years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered processes, Ethox maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nEthox has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New empl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40562,
      "SummaryText": "oyees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least annually and more frequently as needed.\n\nMechanical Integrity\nEthox carries out documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks include pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Ethox to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Ethox.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nEthox conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nEthox promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40562,
      "SummaryText": " are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nEthox believes that process safety management and accident prevention is a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation to the RMP rule in particular information resulting from process hazard analyses.\n\nContractors\nOn occasion, the company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Ethox has a policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n4.    Five-year Accident History\nEthox has had an excellent record of preventing accidental releases over the last 5 years.  Due to release prevention policies, no releases of EO have occurred from Ethox in the last five years that have resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage off site.\n\n\n5.    Emergency Response Plan\nEthox has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, the emergency response equipment is regularly inspected and serv"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40562,
      "SummaryText": "iced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nGreenville County LEPC is the Local Emergency Planning Committee with which the emergency plan has been coordinated and verified.\n\n\n6.    Planned Changes to Improve Safety\nSeveral changes are in the review stage by the company steering committee."
    }
  ]
}