{
  "FacilityID": 40564,
  "FacilityName": "FARMERS MILL & ELEVATOR, INC.",
  "FacilityStr1": "27671 Danville Avenue",
  "FacilityStr2": null,
  "FacilityCity": "CASTLE ROCK",
  "FacilityState": "MN",
  "FacilityZipCode": "55010",
  "Facility4DigitZipExt": "0488",
  "FacilityCountyFIPS": "27037",
  "LEPC": "Minnesota LEPCs",
  "FacilityLatDecDegs": "44.549222",
  "FacilityLongDecDegs": "-093.152083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22740153,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "FARMERS MILL & ELEVATOR, INC.",
  "OperatorStr1": "PO BOX 488",
  "OperatorStr2": "27920 DANVILLE AVE",
  "OperatorCity": "CASTLE ROCK",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55010",
  "OperatorZipCodeExt": "0488",
  "RMPContact": "PAUL LITTLE",
  "RMPTitle": "RMP COORDINATOR",
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000115458",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-09-19 00:00:00",
  "SafetyInspectionBy": "MDA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 44.5777,
  "FRS_Long": -93.1102,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58268,
      "AltID": "30000 gallon NH3 storage",
      "FacilityID": 40564,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59613,
          "ProcessID": 58268,
          "NAICSCode": "42459",
          "_desc": {
            "NAICS_CODE": "42459",
            "NAICS_DESCRIPTION": "Other Farm Product Raw Material Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76971,
          "ProcessID": 58268,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576971,
          "ProcessID": 58268,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 58269,
      "AltID": "TOXICS: ALTERNATIVE RELEA",
      "FacilityID": 40564,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59614,
          "ProcessID": 58269,
          "NAICSCode": "11111",
          "_desc": {
            "NAICS_CODE": "11111",
            "NAICS_DESCRIPTION": "Soybean Farming"
          }
        },
        {
          "Process_NAICS_ID": 59615,
          "ProcessID": 58269,
          "NAICSCode": "11115",
          "_desc": {
            "NAICS_CODE": "11115",
            "NAICS_DESCRIPTION": "Corn Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 76972,
          "ProcessID": 58269,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 576972,
          "ProcessID": 58269,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40564,
      "SummaryText": "EXECUTIVE SUMMARY - AMMONIA\n\nThis facility complies with the Minnesota Department of Agriculture \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\".  In addition, it is our policy to adhere to all applicable federal, state and local laws.\n\nFarmers Mill & Elevator, Inc. also maintains and administers comprehensive safety and environmental programs and procedures with the assistance of insurance company loss control personnel and loss control personnel in the chemical industry.\n\nWe conduct internal audits utilizing checklist survey forms that are reviewed regularly and updated as necessary to comply with all federal, state and local regulations.  Our management conducts comprehensive annual audits to measure regulatory compliance including those governing the safe handling and storage of anhydrous ammonia.  Management requires a timely written response with the completion date of all recommendations resulting from the audits.\n\nFarmers Mill & Elevator, Inc. has appointed a \"site safety coordinator\" as an extension of management to monitor the day to day safe work activities, maintain the regulatory record keeping, conduct regular safety meetings and conduct employee training.  \n\nFarmers Mill & Elevator, Inc. is a wholesale and retail farm supply distribution center.  We store and distribute a wide variety of pesticides and fertilizers including Anhydrous Ammonia.  Ammonia is received by the truckload and is handled and stored on-site and is a regulated substance by the EPA requiring us to comply with the Risk Management Program.  We sell anhydrous ammonia to grower customers in 500 gallon, 1,000 gallon and 1,500 gallon nurse tanks.  The customer applies the ammonia into the soil as a source of nitrogen fertilizer for growing agricultural crops.\n\nFarmers Mill & Elevator, Inc. maintains (2) 500 gallon nurse tanks, (33) 1,000 gallon nurse tanks and (26) 1,500 gallon nurse tanks for customer delivery.  Our combined storage capacity in nurse tanks is 34"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40564,
      "SummaryText": "1,900 pounds.  Anhydrous ammonia is stored in (1) 30,000 gallon stationary tank on site.  The maximum storage capacity of the stationary storage tank is 140,000 pounds of anhydrous ammonia.  The total facility anhydrous ammonia storage capacity for our facility is 481,900 pounds.  The largest single-storage vessel at our facility contains 140,000 pounds.\n\n\"Worst-Case Scenario/Alternative-Case Scenario: This facility has developed a worst-case and alternative-case scenario however it has been withheld from this Executive Summary as security-sensitive information as requested by EPA\"\nOur ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shut-offs and emergency shut-off valves.  The loadout risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediately stop the flow of ammonia if a line or a hose fails.  All of the main storage tank valves and the riser load valves are locked when not in use.\n\nOur ammonia system is inspected on a regular basis with maintenance and preventive maintenance scheduled and documented.  Liquid and vapor valves, hoses, excess flow valves, gauges and relief valves are replaced when necessary and/or according to the guidelines in the ANSI standards.\n\nTraining is provided to all employees at least annually, whenever there is a change in the process or whenever competency with the regulations is questioned.  The training consists of classroom lecture, current videos, testing and certification and on the job training.\n\nThere has been no accident involving anhydrous ammonia that caused deaths, injuries, property  or environmental damage including evacuations on or off site.\n\nIn the event of an emergency involving our ammonia system, it is our policy to notify the local community fire department and request that they respond to the emergency.  In preparation for this, we have coordinated with all of the local response "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40564,
      "SummaryText": "agencies by providing information and facility tours to ensure that they are familiar with and properly prepared for an incident at our facility.  This will help to ensure that our community has the strategy for responding to and mitigating the threat posed by an ammonia release.  This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our ERC.\n\nIn addition, Farmers Mill & Elevator, Inc. has an Emergency Response and Contingency Plan for the facility that complies with the requirements of OSHA (29 CFR 1910.38 and 1910.1200).  The plan includes public notification, provisions for initial medical care, evacuations and LEPC coordination.\n\nFarmers Mill & Elevator, Inc. does not plan to make any changes to the physical site.  We continue to provide our employees with ongoing annual training to ensure that they are current with all of the safe ammonia transfer and handling procedures, and provide regular inspection and maintenance on all of the ammonia equipment."
    }
  ]
}