{
  "FacilityID": 40650,
  "FacilityName": "City of Cuyahoga Falls Water Treatment Plant",
  "FacilityStr1": "2028 Munroe Falls Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Cuyahoga Falls",
  "FacilityState": "OH",
  "FacilityZipCode": "44221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39153",
  "LEPC": "Summit County LEPC",
  "FacilityLatDecDegs": "41.140000",
  "FacilityLongDecDegs": "-081.459972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.cuyahoga-falls.oh.us",
  "FacilityEmailAddress": "youngda@cityofcf.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Cuyahoga Falls",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John Christopher",
  "OperatorStr1": "2310 Second Street",
  "OperatorStr2": null,
  "OperatorCity": "Cuyahoga Falls",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44221",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": "OH7701012",
  "EPAFacilityID": "100000182973",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-06-05 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 41.14033,
  "FRS_Long": -81.4552,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58388,
      "AltID": null,
      "FacilityID": 40650,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 77108,
          "ProcessID": 58388,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59738,
          "ProcessID": 58388,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33716,
              "Process_NAICS_ID": 59738,
              "SafetyReviewDate": "2004-09-22 00:00:00",
              "PHA_Date": "2004-09-22 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "FM-200 Fire Supression system",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-09-22 00:00:00",
              "TrainingReviewDate": "2004-09-22 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-09-23 00:00:00",
              "EquipmentInspectionDate": "2004-09-22 00:00:00",
              "EquipmentTested": "Chlorine scrubber",
              "ChangeMgmtDate": "2004-07-16 00:00:00",
              "ChangeMgmtReviewDate": "2004-09-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-09-22 00:00:00",
              "HotWorkPermitReviewDate": "2004-09-23 00:00:00",
              "ContractorSafetyReviewDate": "2004-09-23 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 48929,
                  "PreventionProgram3ID": 33716,
                  "ProcessChemicalID": 77108
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40650,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Cuyahoga Falls Fire Department",
    "CoordinatingAgencyPhone": "3309718400",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40650,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe City of Cuyahoga Falls (City) Water Treatment Plant (WTP) is a 12-million gallon per day (mgd) facility located on Munroe Falls Avenue approximately 1-? miles east of downtown Cuyahoga Falls.  The City?s WTP uses a groundwater supply.  Treatment processes include softening, oxidation, sedimentation, filtration, corrosion control, fluoride adjustment and disinfection.  Chlorine gas is used for disinfection.  Chlorine gas is the only regulated substance addressed by the Risk Management Plan (RMP) that is used and/or stored at the plant.\n\nChlorine is purchased in 1-ton cylinders and stored in the chlorine cylinder storage area located at the northeast corner of the main treatment building.  During normal operating procedures, the maximum number of full cylinders at the WTP is four.  These cylinders are located within the plant?s chlorine room and are used as the source of the chlorine feed.  Chlorine gas is fed from the cylinders by a three-eighth-inch line to two gas chlorinators where it is converted to solution.  The chlorine solution is then sent to two rotometers where it is diluted and sent to feed points within the plant.  \n\nThe City has recently developed a prevention program that addresses the accidental release of chlorine.  Written procedures for changing chlorine cylinders are maintained on file for use by employees when changing cylinders.  Employees will be required to review the procedures on an annual basis.\n\nA list of chlorine maintenance procedures is maintained on file and used by employees for the periodic checking, cleaning, and maintaining of all chlorine feed system components.  Safety information and Material Safety Data Sheets (MSDS) for chlorine and a schematic of the chlorine feed system are also maintained on file and easily accessible by plant personnel.\n \nAn Emergency Contingency Plan for the City?s Water Division does not currently exist; however, an emergency plan will be developed as part of the vulnerability asse"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40650,
      "SummaryText": "ssment process required by the Public Health Security and Bioterrorism Preparedness and Response Act of 2002.  The plan will document the emergency response policies for the WTP and will likely include detailed instructions for procedures in response to the accidental release of chlorine.  Currently, WTP employees are not to respond directly to the accidental release of chlorine but are to notify the City?s Fire Department.  \n\nAs a requirement of the RMP, different scenarios for the release of chlorine gas from the City?s WTP to the environment were performed.  The release scenarios were modeled using Environmental Protection Agency?s (EPAs) RMP*Comp model, and included both worst-case and alternative release scenarios.\n\nThe worst-case scenario assumes that the largest single container will release its entire contents to the environment over a ten-minute period.  For the Cuyahoga Falls WTP, the largest container is a one-ton cylinder that is located in the plant?s chlorine room.  Criteria used within the RMP*Comp model included a release of 2,000 lbs, a release rate of 200.0 pounds per minute (lbs/min), a wind speed of 1.5 meter per second (m/sec), an atmospheric stability class of F, and urban topography.  The enclosed storage of chlorine in the chlorine room is considered a passive mitigation measure that reduces the potential exposure to the environment by approximately 30 percent.  The projected area impacted by the worst-case release scenario, based on the EPAs model, is presented as Figure 1.  The affected area is a circle of a 0.9-mile radius and includes commercial, residential, and institutional areas within the Cities of Cuyahoga Falls, Munroe Falls and Silver Lake.  The affected area?s population is approximately 3,400.  \n\nAlthough the worst-case release scenario is a requirement of the RMP, there is an extremely low probability that such an event would occur.  A more realistic scenario that would be encountered at the City?s WTP is a leak from the chlori"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40650,
      "SummaryText": "ne feed line, which is addressed by an alternative release scenario.  \n\nThe alternative release scenario assumes that either the connector from the three-eighths-inch chlorine feed line to the chlorine tank would be severed or broken, or the line would leak from excessive corrosion.  The alternative release scenario assumed that the leak would be released to the environment over a 10-minute period (the release duration did not affect the size of the affected area).  Criteria used within the RMP*Comp model included a release of 209 pounds, a release rate of 20.9 lbs/min, a wind speed of 3.0 m/sec, an atmospheric stability class of D, and urban topography.  As with the worst-case release scenario, the location of the chlorine feed equipment in the chlorine room is considered a passive mitigation measure that reduces the potential exposure to the environment by about 30 percent.  The projected area impacted by the alternative release scenario, based on the EPA model, is presented as Figure 2.  The affected area is a circle of 0.1-mile radius that only affects the City?s WTP and a portion of a park across the street from the WTP.  During the majority of the year, the affected population would be 10 people.  When the pool at the park is in use during the summer, the maximum population affected would be 300 people. \n\nThe City?s WTP has had no accidents during the last 5 years.  In fact, the WTP has not had an accidental chemical release since the current chlorine feed system went on-line.\n\nThe RMP specifies that WTPs must have a prevention program in place for each process.  For the City?s WTP, chlorine gas is the only regulated substance and the chlorine feed system is the only regulated process.  Since the worst-case release scenario modeling results indicate that the public is within the potential effected area of a chemical release, the possible prevention programs available to the City?s WTP included Program 2 (default program) or Program 3 (consistent with Occupatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40650,
      "SummaryText": "nal Safety and Health Association [OSHA] program).  The City?s WTP has selected coverage under Program 2.\n \nProgram 2 requires implementation of a prevention program with several tasks.  The City?s WTP had existing programs for several of these tasks including review of safety information, operating procedures, training programs, and equipment (mechanical integrity) inspections.  As part of the RMP requirements for Program 2, the plant recently developed process hazard analysis, compliance audit, and incident investigation programs.  It is anticipated that these additional management and safety procedures in combination with the existing programs will help ensure the continued proper operation and maintenance of the chlorine feed system at the City?s WTP."
    }
  ]
}