{
  "FacilityID": 40745,
  "FacilityName": "Penn Specialty Chemicals, Inc.",
  "FacilityStr1": "3324 Chelsea Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Memphis",
  "FacilityState": "TN",
  "FacilityZipCode": "38108",
  "Facility4DigitZipExt": "1909",
  "FacilityCountyFIPS": "47157",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "35.173611",
  "FacilityLongDecDegs": "-089.948889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.pschem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77971781,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Penn Specialty Chemicals, Inc.",
  "OperatorStr1": "3324 Chelsea Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Memphis",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38108",
  "OperatorZipCodeExt": "1909",
  "FTE": 130,
  "OtherEPAFacilityID": "38108QCHMC3324C",
  "EPAFacilityID": "100000097655",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "00274-01 TV",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-10-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 35.17639,
  "FRS_Long": -89.94861,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58500,
      "AltID": "Furan Manufacture",
      "FacilityID": 40745,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 77237,
          "ProcessID": 58500,
          "ChemicalID": 33,
          "Quantity": 400000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 59853,
          "ProcessID": 58500,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 33774,
              "Process_NAICS_ID": 59853,
              "SafetyReviewDate": "2003-06-30 00:00:00",
              "PHA_Date": "2002-06-18 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-09-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-06-30 00:00:00",
              "TrainingReviewDate": "2003-06-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-11-01 00:00:00",
              "EquipmentInspectionDate": "2004-06-01 00:00:00",
              "EquipmentTested": "All process equipment inspected prior to 6/21/04 Furan production campaign",
              "ChangeMgmtDate": "2004-06-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-03-31 00:00:00",
              "PreStartupReviewDate": "2004-05-01 00:00:00",
              "ComplianceAuditDate": "2002-02-18 00:00:00",
              "AuditCompletionDate": "2002-08-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-01 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-11-01 00:00:00",
              "ContractorSafetyEvalDate": "2003-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 48995,
                  "PreventionProgram3ID": 33774,
                  "ProcessChemicalID": 77237
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40745,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2003-08-01 00:00:00",
    "ERTrainingDate": "2003-09-20 00:00:00",
    "CoordinatingAgencyName": "Memphis Shelby County EMA",
    "CoordinatingAgencyPhone": "9014581515",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40745,
      "SummaryText": "Risk Management Plan Executive Summary for Penn Specialty Chemicals, Inc. Plant Memphis, Tennessee\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Penn Specialty Chemicals, Inc. Memphis Plant are strongly committed to employee, public and environmental safety.  This commitment is evidenced by a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, the Memphis site utilizes the highly trained Shelby County Emergency Response Team to control and mitigate the effects of the release. We are completely coordinated with Memphis-Shelby County LEPC on all incidents that may impact the community. \n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass Organic chemical synthesis.  We have 1 RMP substance regulated at our facility.  The substance is furan, which is involved in several uses.  Furan is used for chemical synthesis and is then converted into other organic compounds or sold as a commercial chemical product.  \n\n3.    The Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario. In order to perform the required off-site consequence analysis the Penn Memphis facility used the look-up tables and equations provided by the EPA in the RMP Off-site Consequence Analysis Guidance.  While Penn Memphis has excellent programs to respond to a release of furan, this worst case scenario does not allow any active mitigation to be considered, and further requires the release to occur under conditions that are not indicative of any conditions which have been encountered. The following paragraphs provi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40745,
      "SummaryText": "de details of both the \"worst case release scenario\" and the alternative release scenario.\n\nThe worst-case release scenario submitted for Program 3 toxic substances involves a release of furan over a short period of time.  The furan liquid is assumed to be immediately released from which evaporation takes place.  \n\nAn alternative release scenario is also included for furan as part of the Program 3 processes. The alternative release scenario allows use of active and passive mitigation. The alternative release scenario evaluates the five-year accident history (see section 5 below) to evaluate potential scenarios. Since there have been no incidents as defined by EPA, an artificial scenario was created. It is important to note that the facility significantly reduced the storge of Ammonia to less than the threshhold amount by instituting process changes at the facility thereby decreasing risk to employees, neighbors, and the environment.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with State Building codes.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119 including the one containing furan.  Our facility is also subject to EPCRA Section 302 notification requirements.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nPenn Specialty Chemicals, Inc. Memphis Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40745,
      "SummaryText": "ontrolled efficiently.  The methodology used to carry out these analyses is either HAZOP or What-if Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at an interval of at least once every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Penn Specialty Chemicals, Inc. Memphis Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nPenn Specialty Chemicals, Inc. Memphis Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nPenn Specialty Chemicals, Inc. Memphis Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Penn Specialty Chemicals, Inc. Memphis Plant to manage changes in process chemicals, technology, equi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40745,
      "SummaryText": "pment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new equipment installation and to process modifications in established processes are conducted as a regular practice at Penn Specialty Chemicals, Inc. Memphis Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nPenn Specialty Chemicals, Inc. Memphis Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nPenn Specialty Chemicals, Inc. Memphis Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nPenn Specialty Chemicals, Inc. Memphis Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construct"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 40745,
      "SummaryText": "ion activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Penn Specialty Chemicals, Inc. Memphis Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.    Five-year Accident History\nPenn Specialty Chemicals, Inc. Memphis Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our release prevention policies, the number of accidental releases has been reduced to a minimum. There have been no major accidents as defined in 40 CFR Part 68, from our facility within the last 5 years.\n\n6.    Emergency Response Plan\nPenn Specialty Chemicals, Inc. Memphis Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nMemphis-Shelby County has its Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  The Penn Specialty Chemicals, Inc. Memphis Plant continuously improves and updates operating procedures, maintains equipment to original specifications or design codes and develops and impl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 40745,
      "SummaryText": "ements safety improvement capital projects.  \n\n8. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nSignature:\nTitle:\nDate signed:"
    }
  ]
}