{
  "FacilityID": 40770,
  "FacilityName": "La Palma WLE, LP",
  "FacilityStr1": "3/4 Mile La Palma Road",
  "FacilityStr2": null,
  "FacilityCity": "San Benito",
  "FacilityState": "TX",
  "FacilityZipCode": "78586",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48061",
  "LEPC": "Cameron County LEPC",
  "FacilityLatDecDegs": "26.142500",
  "FacilityLongDecDegs": "-097.641100",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 146130716,
  "ParentCompanyName": "Topaz Power Group LLC",
  "Company2Name": null,
  "CompanyDUNS": 126520365,
  "Company2DUNS": 0,
  "OperatorName": "Topaz Power Group LLC",
  "OperatorStr1": "2705 Bee Cave Road",
  "OperatorStr2": "Suite 340",
  "OperatorCity": "Austin",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78746",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rudy Atkinson",
  "RMPTitle": "Plant Manager",
  "FTE": 34,
  "OtherEPAFacilityID": "TXD027072727",
  "EPAFacilityID": "100000011596",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00027",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Chlorine - Water Treatment",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-10-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-10-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-05-16 00:00:00",
  "DeRegistrationEffectiveDate": "2006-04-14 00:00:00",
  "AnniversaryDate": "2009-10-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 26.14167,
  "FRS_Long": -97.63333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58543,
      "AltID": "Water Treatment",
      "FacilityID": 40770,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 59896,
          "ProcessID": 58543,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 77293,
          "ProcessID": 58543,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 577293,
          "ProcessID": 58543,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40770,
      "SummaryText": "La Palma WLE, LP is a gas fueled power generating facility owned by Topaz Power Group LLC. This site is within the San Benito city limits in Cameron County.  The faciliy has 34 employees.\n\nLa Palma WLE, LP was purchased by Topaz Power Group LLC from Americal Electric Power (AEP) on July 1, 2004.\n\nThe facility is a four-unit electric power station with a total generation of approximately 260 mw.  It burns natural gas as the primary fuel with fuel oil as the secondary fuel.  Units 4, 5 and 6 are General Electric steam generators with Babcock and Wilcox boilers installed in 1947 and 1970.  Unit 7 is a General Electric gas turbine installed in 1975.\n\nThe following information is part of a complete Risk Management Plan (RMP) five year re-certification that was prepared for La Palma WLE, LP.  The information includes accident prevention and safety programs, emergency preparedness and response programs, chemical description, five year accidental release history, alternative release scenario and the worst case scenario.  The sharing of this type of information is a means to improve community safety, not a prediction of the probability that either a worst case or more likely scenario would ever occur.  These scenarios are estimates required by the Environmental Protection Agency (EPA) and are used to illustrate the importance for risk reduction, safety, prevention and emergency preparedness and response.\n\nThe La Palma WLE, LP has been producing electricity for over 55 years.  During this time, there has not been any chlorine release that adversely impacted the plant or the surrouding community.\n\nThe release scenarios, a worst case scenario and an alternative release scenario, are designed to be exercises which calculate the potential impact on the community, based upon extreme conditions, defined by the EPA.  A worst case scenario is defined as the complete release of the largest inventory of the chemical over 10 minutes under weather conditions that would allow the chemical"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40770,
      "SummaryText": " to travel as far as possible.  The distance(s) used in this plan are from EPA's RMP*Comp software.  It also assumes that none of the site's mechanical controls or safety systems are operational for this theoretical excerice.  However, the laws of physical science do not allow a complete release of the chemical as described in the worst case scenario.\n\nGiven these unrealistic guidelines of a worst case scenario, more realistic scenarios or alternative release scenarios were also developed.  These scenarios involve smaller releases and allow a site's safety systems to work.  The alternative release scenarios may be used by local government and industry to prepare emergency response plans.\n\nTCC's chlorinating systems are built and installed with safety controls designed to prevent accidental releases.  Some of the typical safety equipment and systems used at the plant include:\n- Storage cylinders meeting American Society of Mechanical Engineering requirements.\n- Interlocks and relief valves\n- Specifically designed pressure gauges, fittings, connections, tubing and piping.\n\nPlant employees, including plant operators, electricians, mechanics, and laboratory technicians, receive training in the operation and maintenance of the chlorination system.  This training includes emphasis on:\n- Specific safe work practices\n- Routine operating procedures\n- Audit and inspection procedures\n- Emergency operation including shut down\n- Alarms and emergency notification procedures.\n\nTCC has an established Preventative Maintenance Procedure specifically developed for the chlorination system.  This procedure requires:\n- Periodic inspection and testing of all mechanical systems\n- Detailed documentation of all inspection and maintenance activity\n- Documentation of equipment deficiencies\n- Timely and appropriate repair of all deficiencies.\n\nA Process Safety Management (PSM) system has been specifically developed for the chlorination system at this plant in compliance with the Occupational Sa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40770,
      "SummaryText": "fety and Health Act (OSHA) Process Safety Manangement rule.  This management system includes:\n- An initial and periodic analysis of engineering and administrative controls\n- Investigation procedures designed to resolve and correct potential incidents\n- Formal audits performed by trained individuals with knowledge of chlorination systems.\n\nAll Plant personnel handling chlorine are specially trained.  This training includes:\n- Emergency shutdown\n- Emergency operation of the chlorinator\n- Hazards of chlorine\n- Safety procedures to be followed during normal operations\n- Emergency Response Procedures\n- Notification procedures\n- Evacuation procedures.\nPeriodic inspection of the equipement is mandatory.  Repairs are required on all items identified as defective during inspections.\n\nIf a release occurs, only trained Emergency Response Personnel will respond to assess and stop the leak.  In all cases, necessary actions will be taken to control the release of chlorine.\n- The Plant Control Room will be notified immediately if a chlorine leak is detected.\n- Control Room personnel will coordinate emergency response procedures.\n- Emergency response procedures may include:\n- Notification of authorities\n- Evacuation of plant personnel\n- Evacuation of public.\n- Notification of plant and/or company managers.\n\nLa Palma WLE, LP is committed to providing electricity to South Texas.  We understand our responsibility to follow federal, state and local regulations in the most effective manner possible.  La Palma WLE, LP is doing its part to provide a safe environment for the residents in our community."
    }
  ]
}