{
  "FacilityID": 40827,
  "FacilityName": "Evanston Water Utility",
  "FacilityStr1": "555 Lincoln Street",
  "FacilityStr2": null,
  "FacilityCity": "Evanston",
  "FacilityState": "IL",
  "FacilityZipCode": "60201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": null,
  "FacilityLatDecDegs": "42.061667",
  "FacilityLongDecDegs": "-087.675556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "cityofevanston.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Evanston",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Evanston",
  "OperatorStr1": "2100 Ridge Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Evanston",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60201",
  "OperatorZipCodeExt": null,
  "RMPContact": "David D. Stoneback",
  "RMPTitle": "Assistant Superintendent Operations",
  "FTE": 55,
  "OtherEPAFacilityID": "IL0310810",
  "EPAFacilityID": "100000081494",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-10-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-16 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-09-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-09-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 42.06163,
  "FRS_Long": -87.67598,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58653,
      "AltID": null,
      "FacilityID": 40827,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60006,
          "ProcessID": 58653,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 77448,
          "ProcessID": 58653,
          "ChemicalID": 62,
          "Quantity": 32600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 577448,
          "ProcessID": 58653,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40827,
      "SummaryText": "\n\nStationary Source and Regulated Substance\n\nChlorine is the major hazard and regulated substance at the Evanston Water Utility.  An inadvertent release of chlorine to the atmosphere may reach public receptors surrounding the facility.  Chlorine is heavier than air and seeks low areas.  It appears as a greenish-yellow gas and impacts public health when inhaled above the toxic end point as defined within 40 CFR 68.22.\n\nEvanston Water Utility uses chlorine to treat raw water for public consumption.  The chlorine feed system is redundant and feeds chlorine from alternate cylinders through alternate piping in the event of a leak.\n\nThe stationary source is the treatment process.  Liquid chlorine in eight one-ton cylinders naturally vaporizes into the piping system.  The cylinders are mounted on load cells and are connected to a 1-inch steel pipe header with pigtails (3/8? tubing).  In response to the load cell when the cylinders are nearly empty, an automatic valve switches flow from four cylinders at a time.  The four cylinder valves are partially open, and at vapor pressure, deliver chlorine gas to the header and vacuum regulator.  Chlorine flows at vacuum pressure from the regulator into the chlorinator that meters and controls the flow and then flows into the ejectors.  The ejectors provide motive vacuum power for the chlorinating system and mix the chlorine gas with water to form a solution.\n\nAt any time, a total of 16 one-ton cylinders and four 150-pound cylinders may be stored in the chlorine building.  Maximum inventory is 32,600 pounds and exceeds EPA?s threshold quantity of 2,500 pounds.\n\nHazard Assessment\n\nFailing to control the hazard and exceeding the toxic end point, EPA requires that the facility provide an offsite hazard assessment by evaluating two release scenarios (worse case and alternate case) to determine the toxic end point.\n\nToxic end point is based on ERPG-2 concentrations developed by the American Industrial Hygiene Association (AIHA).  The ERPG"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40827,
      "SummaryText": "-2 is a maximum air borne concentration in which is believed that almost all individuals could be exposed for up to one hour without developing serious irreversible health effects or other symptoms that could impair an individual?s ability to take protective action.  The AIHA has identified chlorine?s toxic end point as three parts per million (3PPM) or 0.0087 mg/l.\n\nWorse case is liquid chlorine released to the atmosphere for 10 minutes from a one ton storage cylinder that is caused by catastrophic failure due to corrosion, impact, or construction defects.  The worse case scenario is rupture of a one ton cylinder when falling from a truck or hoist while unloading outside the building or inside the building with the unloading door open.  The toxic end point is based on ALOHA dispersion modeling developed by the National Safety Council and summarized in Table 5-1, scenario ID CLW-2, of AWWA?s Compliance Guidance and Model RMP for Water Treatment Plants.  The toxic end point of the worse case scenario is 2.6 mile radius from the chlorine building.  Modeling does not include the effects of fires, chemical reactions, site topography, and other factors.\n\nAlternate case is more likely to occur than the worse case.  This scenario could be the failure of chlorine gas tubing (pigtail) connected from the storage cylinder to the 1-inch steel header pipe with multiple cylinders connected to the header.  Anticipated operator?s response time to attempt to stop the leak is 10 minutes.  Toxic level alarms will warn the operators who will respond by putting on self-contained breathing apparatus, with the ventilation system on when entering the building, and closing the valves required to isolate the leak.  The release inside the building is not considered a mitigating factor because of the ventilation system that replaces the entire air volume of the building in one minute.  Based on Table 5-5, scenario ID CLA-9, of AWWA?s Compliance Guidance and Model RMP for Water Treatment Plants"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40827,
      "SummaryText": " and using the more conservative amount and duration of release, the toxic end point for the alternate case is 0.63 mile radius from the chlorine building.\n\nThe attached maps show the radius of exposure for the toxic endpoints.\n\nPrevention of Chlorine Release\n\nThe process is designed in compliance with recognized and generally accepted good engineering practices of the Chlorine Institute and other applicable codes and standards of water treatment facilities.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle chlorine, safety devices inherent in the design of the facility, safe handling and operating procedures that we use, and training of our personnel.  Program 2 Prevention Program as described in 40 CFR part 68 is followed to accomplish these goals and will minimize the potential for an unplanned release of chlorine to the environment.\n\nFive Year Accident History\n\nIn the past five years, no potential or actual accidental releases have occurred.\n\nEmergency Response Program\n\nDespite the Prevention Program, incidents may still occur.  An Emergency Response Program is required to minimize the duration and effects of an accidental release, thereby protecting the public health and the environment.\n\nExcept for minor release, this facility relies on community emergency responders (Evanston Fire Department) and works closely with them to ensure that they are suitably trained and drilled in emergency response for chlorine releases.  Notification and evacuation procedures meet EPA?s requirements (OSHA Standards) and Illinois Chemical Safety Act requirements.  The Emergency Contingency Plan is included.\n\nPlanned Changes for Improved Safety\n\nThe Chlorine Building was constructed in 1994.  It complies with latest codes and standards, and the Chlorine Institute guidelines.  A chlorine scrubber is proposed to be installed and fully operational by the end of December 2004.\n\n"
    }
  ]
}