{
  "FacilityID": 40926,
  "FacilityName": "Port Arthur Lubricants Plant",
  "FacilityStr1": "End of W. 7th Street",
  "FacilityStr2": null,
  "FacilityCity": "Port Arthur",
  "FacilityState": "TX",
  "FacilityZipCode": "77640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.842500",
  "FacilityLongDecDegs": "-093.962500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "COHN@Chevrontexaco.com",
  "FacilityDUNS": 9140559,
  "ParentCompanyName": "ChevronTexaco Corporation",
  "Company2Name": "ChevronTexaco Global Lubricants",
  "CompanyDUNS": 1382555,
  "Company2DUNS": null,
  "OperatorName": "ChevronTexaco Products Company",
  "OperatorStr1": "End of W. 7th Street",
  "OperatorStr2": null,
  "OperatorCity": "Port Arthur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77640",
  "OperatorZipCodeExt": null,
  "FTE": 220,
  "OtherEPAFacilityID": "TXR000003905",
  "EPAFacilityID": "100000070825",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-10-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-10-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-10-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-10-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 29.842715,
  "FRS_Long": -93.962671,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 58812,
      "AltID": "TDI Injection to grease",
      "FacilityID": 40926,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 77713,
          "ProcessID": 58812,
          "ChemicalID": 44,
          "Quantity": 82025.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60169,
          "ProcessID": 58812,
          "NAICSCode": "324191",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 40926,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-29 00:00:00",
    "ERTrainingDate": "2004-06-19 00:00:00",
    "CoordinatingAgencyName": "Chev. Chemical/ Premcor Refining",
    "CoordinatingAgencyPhone": "4099851201",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 40926,
      "SummaryText": "1. ACCIDENT RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\n\nAt the ChevronTexaco Port Arthur Lubricants Plant (PALP), we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure th safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n- A description of our facility and use of substances regulated by EPA;s RMP regulation.\n- A summary of results from our assessment of the potential offsite consequences from accidental chemical releases.\n- An overview of our accidental release prevention programs.\n- A five-year accident history for accidental releases of chemicals regulated by EPA;s RMP rule.\n- An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment.\n- An overview of our emergency response program.\n- The certifications that EPA;s RMP rule requires us to provide for \"Program 1\".\n\n2.  STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility produces lubricating oils and greases using a variety of chemicals and processing operations.  Lubrication oil products are blends of petroleum base oils and additives into finished products that do not involve the uses of RMP regulated substances.  The manufacturing of certain grease products performed in a continuous manufacturing process do involve the use of Toluene 2,4 diisocyanate.  No other regulated chemicals are used in this activity.\n\n3.  KEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nThe following are brief summaries of these scenarios, including information about the key administrative controls and mitigation  measures to limit the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 40926,
      "SummaryText": "exposure distances for each scenario.\n\n3A.  Worst-case Release Scenario(s) Regulated Toxic Chemicals\n\nthe TDI being stored in Tank 3245 suddenly and catastrophically releases into the above ground storage tank impoundment as a result of a failure in a tank seam weld.  Eighty two thousand (82,000) pounds of toluene 2,4 diisocyanate (TDI) accumulates in the impoundment resulting in air emission at the rate of 0.0027 pounds per minute form a surface area of 519 square feet.   The estimated exposure distance of travel does not reach any public receptors.  (Note: The RMP*Submit data section (2.6- Release rate) will not accept 0.0027 lbs./min.  The next lowest release rate, and the one we used was 1.0 lbs/min).\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\n4.  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nPALP maintains a number of programs to help prevent accidental releases and ensure safe operation.  The accident prevention programs in place include over 70 site specific environmental, safety, fire and health procedures.  Most of these procedures address accident prevention and are reviewed by all employees in a three-year rotation.  Several are scheduled every month for review, and employees are tested for competancy. Additionally, our Central Compliance Committee reviews potential for incidents in the plant and recommends pro-active corrective action.  Our accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.  Our company and our employees are committed to the staneard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident preventio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 40926,
      "SummaryText": "n.\n\n5.  FIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  There were no reportable accidents involving TDI at our facility in the last five years.  In the event of an accidental release of TDI we are prepared to conduct a formal incident investigation to identify and correct the root causes of the event.\n\n6.  EMERGENCY RESPONSE PROGRAM\n\nWe maintain an integrated contingency plan, which consolidates alll of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plans and response with eht Chevron Phillips Chemical and Premcor Refining Corporation.\n\n7.  PLANNED CHANGES TO IMPROVE SAFETY\n\nA review of TDI release specific response actions is undertaken annually.\n\n8.  CERTIFICATIONS (A signed original is provided with the submittal.)\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst-case scenario, all processes at our facility is less than the distance to the nearest public receptor.  Within the past five years, the process has had no accidental release that caused offsite impacts provided in the RMP rule (40 CFR 68,10 (b)(1).  No additional measures are necessary to prevent offsite impacts from accidental releases.  In the event of fire, explosion, or a release of a regulated substance from the process(es), entry within the distance to the specified endpoints may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP.  The undersugned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\nCarl W. Johnson\nP"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 40926,
      "SummaryText": "lant Manager\nSignature Date\n\n9  RMP DATA ELEMENTS\n\nNot Applicable"
    }
  ]
}