{
  "FacilityID": 41196,
  "FacilityName": "Lake Granbury Surface Water and Treatment System",
  "FacilityStr1": "5912 Matlock Road",
  "FacilityStr2": null,
  "FacilityCity": "Granbury",
  "FacilityState": "TX",
  "FacilityZipCode": "76049",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48221",
  "LEPC": "Hood County LEPC",
  "FacilityLatDecDegs": "32.417200",
  "FacilityLongDecDegs": "-097.665300",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.brazos.org/home.htm",
  "FacilityEmailAddress": "daryls@brazos.org",
  "FacilityDUNS": 68981125,
  "ParentCompanyName": "Brazos River Authority",
  "Company2Name": null,
  "CompanyDUNS": 68981125,
  "Company2DUNS": 0,
  "OperatorName": "Brazos River Authority",
  "OperatorStr1": "PO Box 7555",
  "OperatorStr2": null,
  "OperatorCity": "Waco",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76714",
  "OperatorZipCodeExt": "7555",
  "RMPContact": "Daryl Lee Spiewak, CEM, TEM",
  "RMPTitle": "Emergency Manager",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000108162",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-09-17 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-11-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-11-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-11-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-06-06 00:00:00",
  "DeRegistrationEffectiveDate": "2012-05-31 00:00:00",
  "AnniversaryDate": "2009-11-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 32.41754,
  "FRS_Long": -97.66554,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Sale of property",
  "_processes": [
    {
      "ProcessID": 59175,
      "AltID": "Chlorination",
      "FacilityID": 41196,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60539,
          "ProcessID": 59175,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78146,
          "ProcessID": 59175,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578146,
          "ProcessID": 59175,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 59176,
      "AltID": "Electrodialysis Reversal",
      "FacilityID": 41196,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60540,
          "ProcessID": 59176,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78147,
          "ProcessID": 59176,
          "ChemicalID": 54,
          "Quantity": 44886.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578147,
          "ProcessID": 59176,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 59177,
      "AltID": "Clean in Place (Manual)",
      "FacilityID": 41196,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60541,
          "ProcessID": 59177,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78148,
          "ProcessID": 59177,
          "ChemicalID": 54,
          "Quantity": 1952.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578148,
          "ProcessID": 59177,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 59178,
      "AltID": "Sludge Press CIP",
      "FacilityID": 41196,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60542,
          "ProcessID": 59178,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78149,
          "ProcessID": 59178,
          "ChemicalID": 54,
          "Quantity": 2440.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578149,
          "ProcessID": 59178,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41196,
      "SummaryText": "     Brazos River Authority\n     Lake Granbury Surface Water and Treatment System\n\nThe Lake Granbury Surface Water and Treatment (SWATS) plant is a regional water treatment and delivery system that can treat up to 14.0 million gallons per day of raw surface water. It then delivers the treated water through a 26-mile pipeline to wholesale water customers in Johnson County. The City of Granbury, Texas, and AMUD have their own pipelines and pump stations.\n\nSWATS uses a lime/soda ash softening process, disinfection, clarification and filtration purification stages to treat the raw surface water. It also uses an ultra-filtration membrane system and reverse osmosis to remove excess salt from the lake water and render the water potable. Only chlorine is used for disinfection the raw surface water and hydrochloric acid is used for cleaning the membrains or scale. Both chemicals are stored above the allowable threshold quantity. Presently, the Electrodialysis Reversal (EDR) system is out of service.\n\nSWATS received EPA Region VI's Regional Administrator's Environmental Excellence Awards for 1993 and 1996; the Texas Natural Resource Conservation Commission's Outstanding Performance Award for 1992-1996; and was voted The Best Tasting Water in 1996\n\n     Chlorine\n\nThe chlorine is stored on the north side of the chemical building in eight one-ton cylinders, where it is used in groups of two. One group is used and the other is held as backup- When the first group is exhausted the backup group is engaged by an automatic switchover module.\n\nThree separate chlorine feeders are provided in the Chlorine Feed Room in the Chemical Building. The first feeder is dedicated to primary disinfection of the raw water as it enters the plant, the second to the secondary Feed disinfection of the finish water system, and the third to the supplemental disinfection of the settled water to UF and filters prior to transmission to Johnson County. The three systems are interconnected to allow the substi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41196,
      "SummaryText": "tution of any one of the feeders for the other, but principally to allow standby of the secondary disinfect-ion of the finish water and the supplemental disinfection of the transmission system\n\nChlorine is conveyed by vacuum through the chlorine feeders to the injectors where solution water is added. The chlorine feed rates to each point of application are set proportional to flow rates measured by the raw water meter, blend and product water meter, and high service meter. The injector mixes the chlorine with water to pass the chlorine to other areas. The injectors send the chlorine and water solution into the finish water storage tank.\n\n     Hydrochloric Acid\n\nThe hydrochloric acid (HCI) is used in the plant as part of the Cleaning-in-Place (CIP) system of lime/soda ash equipment and CIP of sludge press in small totes. The EDR process uses electric current to collect positive and negatively charged particles to further clarify the water. Minerals and other particles can build up and cause a hot spot or pressure loss down to a predetermined level. When this occurs operators run the acid cleaning task called clean-in-place (CIP). The CIP task requires a dilute hydrochloric acid solution to be pumped into the membrane stacks, recirculated and purged from the system to remove deposition of the minerals causing the pressure loss or the hot spot. \n\nThe HCI (35% solution) is stored in a 5,000 gallon tank in a containment area on the west side of the EDR building and in a day tank in a side room of the EDR building. It is administratively limited to a maximum quantity of 4,600 gallons (44,886 pounds). A chemical transfer pump moves the HCI to a smaller 1,800 gallon tank where it is mixed with water to bring about the weak HCI solution. Then a CIP pump transfers the solution through pipes to the EDR units. When the HCI solution is in the EDR unit it dissolves the build up and is transferred back to the 1,800 gallon storage tank for disposal.\n\n     Accidental Release Prevent"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41196,
      "SummaryText": "ion and Emergency Response Policies\n\nAuthority policy requires a written emergency action plan, annual exercises and reviews of the plan, emergency response training for facility personnel, and coordination with local responders- In addition, semi-annual safety inspections are conducted by the Authority's Safety Officer and risk management consultants from our insurance company.\n\n     Worst-Case Release Scenario\n\nThe worst-case scenario is the release of 2,000 pounds of Chlorine (one-ton cylinder) in 10 minutes. The release rate is 200 Ibs/min. The EPA rules specify an atmospheric stability of F and a wind speed of 1.5 meters per second. The maximum temperature in the last three years was 107 degrees F. No passive mitigation measures are in place. Therefore, the distance to the end point for chlorine vapor is 3.0 miles in a Rural environment.\n\n     Alternative Release Scenario\n\nThe plant did not have any reportable accidental releases of regulated chemicals in the past five years so we chose to analyze a broken 5/16\" valve/pipe connection at the vessel interface for Chlorine. A vapor release was chosen because the plant does not use liquid chlorine. EPA's RMP Guidance for Waste Water Treatment Plants Reference Tables specify an atmospheric stability of D and a wind speed of 3 meters per second. According to Exhibit 4-15 (Chlorine Vapor), the release rate is 15 Ibs/min. No passive or active mitigation measures are in place. Therefore, the distance to the end point for chlorine vapor is 0.2 miles in a Rural environment.\n\n     Accidental Release Prevention Program\n\nAll SWATS personnel receive awareness training to recognize and properly respond to accidental releases of hazardous chemicals. Plant supervisors employ \"management by walking around\" techniques to periodically observe the employees under actual operating conditions to ensure they follow proper procedures. Safety training is conducted throughout the year and safety inspections by outside agencies are conduct"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41196,
      "SummaryText": "ed semi-annually. In addition, various state and local agencies conduct inspections of the facility.\n\nThe chlorine process has two alarm systems. One alarm is a leak detector inside the Chlorinator Room where the chemical is dispensed to the required locations within the process. The second alarm is a chlorine switchover alarm located with the chlorine tanks. This alarm indicates empty tanks.\n\nThe hydrochloric acid tank, valves, pumps and pipiing are routinely inspected for corrosion and leaks. The tank is located within a diked area large enough to contain the total volume. If necessary, a drain will direct the chemical through underground pipes to holding lagoons safely away from any populated areas.\n\n     Five Year Accident History\n\nSWATS has not had any accidental releases of regulated chemicals in the last five years\n\n    Emergency Response Program\n\nSWATS has the capability to respond to and mitigate the release of on-site hazardous chemicals that present a moderate health and/or safety threat to SWATS and responding personnel, present a moderate potential for adverse environmental impact, are of limited size, and have low fire/explosion potential. If the spill/release is beyond the capability of on-site personnel, the City of Granbury's and Hood County's HAZMAT teams will respond by calling 911. The city and county recently conducted a WMD terrorism exercise, which included the intentional release of hazardous chemicals. They conduct annual exercises related to emergency response that Brazos River Authority personnel participate in.\n\n     Planned Changes to Improve Safety\n\nWe are conducting joint training with local first responders and conducting additional internal HAZMAT and chemical safety training for operators, maintenance, and administrative personnel. Security enhancements and procedures have been made since 9-11 and continuous improvements are made as resources become available."
    }
  ]
}