{
  "FacilityID": 41195,
  "FacilityName": "PIRTLE SPRINGS PLANT",
  "FacilityStr1": "1500 SHIPLEY RD.",
  "FacilityStr2": null,
  "FacilityCity": "CECILIA",
  "FacilityState": "KY",
  "FacilityZipCode": "42724",
  "Facility4DigitZipExt": "9737",
  "FacilityCountyFIPS": "21093",
  "LEPC": "Hardin LEPC",
  "FacilityLatDecDegs": "37.440139",
  "FacilityLongDecDegs": "-086.276111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "L1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "JBRUCE@hcwd.com",
  "FacilityDUNS": 130402811,
  "ParentCompanyName": "HARDIN COUNTY WATER DISRICT #1",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HARDIN CTY, WATER DIST, #1",
  "OperatorStr1": "1400 ROGERSVILLE RD",
  "OperatorStr2": null,
  "OperatorCity": "RADCLIFF",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40160",
  "OperatorZipCodeExt": "9737",
  "RMPContact": "PHIL CLARK",
  "RMPTitle": "WATER PLANT SUPERVISOR",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059483",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-09-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-11-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-11-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-11-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 37.69611,
  "FRS_Long": -86.1075,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59174,
      "AltID": "Chlorine",
      "FacilityID": 41195,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60538,
          "ProcessID": 59174,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78145,
          "ProcessID": 59174,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578145,
          "ProcessID": 59174,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41195,
      "SummaryText": "The Hardin County Water District No.1's (HCWD#1) Pirtle Springs Water Treament Plant (PWP) has been active in reducing risks associated with using Chlorine gas (cl2) as a disinfectant in our water treatment process. Over the past years. HCWD#1 has spent $20,000 for a building to store and confine 2,000 lb(4total) chlorine cyclinders to minimize escaping cl2 gas,a cl2 gas detector was installed to instantly set off alarms if a cl2 leak is detected over 3 ppm ( parts per million) so HCWD#1 could take immediate action to notify surrounding residences, police, medical personnel, fire department, and local government agencies.                                                                                                                                                    PWP's plan for accidental prevention is following Standard Operating Procedures(s.o.p.'s) in handling cl2, daily inspections by the operators of the equipment used in the processes and routine maintenance on the equipment used on the processes. Reviewing chlorine handling safety video's, periodically reviewing sop's. Emergency responce procedures at our facility is as follows.\n1.   Verify leak visually with ammmonia or smell(assuming there is no obvious visible plume.                                                            \n\n2. Notify the facility Emergency Response Coordinator or the alternate of the potential problem.\n\n3. Put on appropriate personal protective equipment (ppe).If it's a controlled small leak and plant personel can't stop the leak by closing the main valve they are to notify JONES CHEMICAL of the situation so they can dispatch thier emergency response team/tank repair personel.                                                                        \n\n\n4. Should a SUBSTANIAL leak be confirmed: Plant personnel will evacuate with the plant emergency cell phone.A copy of the tab-q-7 is stored in the company vehicle.The vehicle has a two-way radio mounted inside of the cab.\n\n5. Prior to exi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41195,
      "SummaryText": "ting the plant the wind direction should be observed and noted. Wind direction will dictate personnel evacuation route as well as emergency response personnel's approach to the plant.\n\n6. At first opportunitt, once clear from the site, evacuating personnel should contact Mr. HOWARD RHODES via phone (270-862-5906) and advise him that their is a chlorine leak and that he and his family should evacuate. He is the most immediate neighbor to the plant.\n\n7. In the event phone contact is unobtainable via cell phone, contact the HCWD#1 main office (270-351-3222) by radio and advise the operator on duty there to contact Mr. RHODES immediately.\n\n8. Once evacuated from the plant and as soon as the RHODES family has been notified, plant personnel are to begin notifying the people and/or agencies identified on pages q-7-11-2 and q-7-11-3 and on q-7-11 form for the plant.\n\n9.When contacting emergency services, personnel on site should provide the following information:\n\nA. Identify who you are.\nB. Identify the plant location.\nC. Identify your location.\nD. Advise as to the nature of the emergency (chlorine leak).\nE. Advise as to the wind direction and best direction to approach the plant.\nF. Remind those you contact that the staging area is Franklin crossroads mart on Hwy.86\nG. Advise those contacted that the company radio frequency is 173.39625.\nH. Give them the number of the Cell phone.\nI.  Remind the contact, once again where you are and that your primary responsibility at this point is to close Shipley Road and make emergency contacts.\n\n10. HCWD#1primary objective at this point is to:\n\nA. To keep the general population out of harms way (keep Shipley Road closed)\nB. Notify emergency response personnel of the situation.\nC. Stay in radio contact with main office.\nD.keep cordless phone with you.\nE. Keep your self out of harms way.\n\nHCWD#1 PWP is located in Cecilia, Kentucky. Raw water for PWP is pumped in from Pirtle Springs. The raw (untreated) water is then put thru a process ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41195,
      "SummaryText": "lled coagulation and flocculation by means of chemicals.These chemicals take out dirt and impurities found in raw water.During this process cl2(chlorine) is added, disinfecting the water as it goes through this process. It then travels to the next process that is called filtration, This is where the water is filtered and the filters remove 99.99% of impurities in the water and then again it is disinfected for a 2nd time and travels to a storage tank where it is pumped sixteen miles into the City of Radcliff (over 10,500 customers) and also supplying water to the City of Vine Grove, HCWD#2, and Meade CountyWater District#1.\n\nThe PWP can provide up to 2.8 millon gallons of drinking water per day. We can store up to 8,000 lbs.(four two ton cylinders) of chlorine-but only one is used at a time in the disinfection process.\n\n"
    }
  ]
}