{
  "FacilityID": 41364,
  "FacilityName": "Excursion Inlet Plant",
  "FacilityStr1": "101 Coho way",
  "FacilityStr2": null,
  "FacilityCity": "Excursion Inlet",
  "FacilityState": "AK",
  "FacilityZipCode": "99850",
  "Facility4DigitZipExt": "0090",
  "FacilityCountyFIPS": "02100",
  "LEPC": "Haines Borough Fire Department",
  "FacilityLatDecDegs": "58.250000",
  "FacilityLongDecDegs": "-135.263000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ocean Beauty Seafoods LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ocean Beauty Seafoods Inc.",
  "OperatorStr1": "P.O. Box 70739",
  "OperatorStr2": "1100 West Ewing Street",
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98107",
  "OperatorZipCodeExt": "1539",
  "FTE": 98,
  "OtherEPAFacilityID": "AK-G52-0059",
  "EPAFacilityID": "100000057779",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "ORL#000018",
  "SafetyInspectionDate": "2004-09-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-11-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-11-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-11-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 58.42361,
  "FRS_Long": -135.46667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "63360",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59430,
      "AltID": "Refrigeration",
      "FacilityID": 41364,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 78712,
          "ProcessID": 59430,
          "ChemicalID": 56,
          "Quantity": 17840.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60803,
          "ProcessID": 59430,
          "NAICSCode": "31171",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34389,
              "Process_NAICS_ID": 60803,
              "SafetyReviewDate": "2004-05-20 00:00:00",
              "PHA_Date": "2004-03-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-05-01 00:00:00",
              "TrainingReviewDate": "2004-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-01 00:00:00",
              "EquipmentInspectionDate": "2004-03-01 00:00:00",
              "EquipmentTested": "Compressors, Condensors, Piping, Valves",
              "ChangeMgmtDate": "2003-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-02-06 00:00:00",
              "PreStartupReviewDate": "2004-04-01 00:00:00",
              "ComplianceAuditDate": "1999-08-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-02-05 00:00:00",
              "HotWorkPermitReviewDate": "2004-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-01 00:00:00",
              "ContractorSafetyEvalDate": "2004-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "OSHA PSM",
              "_chemicals": [
                {
                  "PrimaryKey": 50188,
                  "PreventionProgram3ID": 34389,
                  "ProcessChemicalID": 78712
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41364,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-05-20 00:00:00",
    "ERTrainingDate": "2004-05-01 00:00:00",
    "CoordinatingAgencyName": "Haines Borough Fire Dept.",
    "CoordinatingAgencyPhone": "9077662115",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41364,
      "SummaryText": "\nOcean Beauty Seafoods, Inc.\nExcursion Inlet Facility\nRMP\nExecutive Summary\n\n                                                                                                June 19, 2004\n\nThe Ocean Beauty Seafoods Excursion Inlet Facility is a remote, seasonal seafood processing plant located in Southeast Alaska on the shore of Excursion Inlet. The facility operates from May through September. The primary products produced are canned, fresh and frozen pacific salmon products. The facility produces a small amount of frozen halibut and various sable fish species.  The closest community and/or town is Gustavas, Alaska located ten miles due west. The Excursion Inlet facility is not serviced by a road system. The only access to the facility is by small prop plan or by vessel. The population of the immediate area consists of roughly 360 seasonal Ocean Beauty employees and a dozen seasonal residents. The closest seasonal residence is more than a half-mile away. The regulated substance posing the greatest risk to employees and the public is the Anhydrous Ammonia used in the refrigeration system. The refrigeration system is used in the process of freezing and storage of the fish products produced at the facility.\n\nChemical safety as it relates to our employees, the public and the environment receive foremost attention in the development and implementation of the Ocean Beauty Seafoods Excursion Facility policies and procedures. With a strong commitment from senior management, the help of our employees, insurance providers and hired consultants, the Excursion Inlet facility is employing procedures that ensure the safe handling and use of all chemicals. It is the intent of Ocean Beauty Seafoods to develop and employ procedures and policies, which assure the safe condition and operation of all equipment while meeting federal, state and local regulatory and statutory requirements. For all equipment and operations involved in the use of Ammonia we have an established Process Safet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41364,
      "SummaryText": "y Management Plan. This plan has been recently updated beginning February 2004. The employee participation team was assembled in February; a PHA was completed in March of 2004 along with a mechanical integrity survey. Training requirements and procedures were completed in April along with hot work procedures. The Ammonia Release Emergency Response Plan was finalized in May. All Excursion Inlet SSOPs are being reviewed and rewritten during the months of June, July and August. The Management of Ocean Beauty Seafoods is committed to providing a safe working environment for their employees, as well as a secure environment for the neighbors of our facility.\n\nThe Ocean Beauty Seafoods Excursion Inlet Facility has nearly 18,000 pounds of Anhydrous Ammonia on site in its refrigeration system. This volume of Ammonia has placed us under the OSHA PSM requirement. During the last several months, as previously stated, the Excursion Inlet facility has completely updated the PSM plan employed in providing accidental release prevention policies and procedures, as well as determining equipment upgrades required to prevent releases. Such items as, additional relief and isolation valves as well as additional level and pressure controls have been installed as result of updating the PSM plan. Additional maintenance practices have been established. Such things as annual pipe insulation repairs and testing level controls weekly will aid in preventing an accidental release of Ammonia.  The PSM plan also has included updating the emergency response policies and procedures of the facility. Such things as evacuation routes have been clarified, as well as additional communication systems added. As part of the updating process the facility emergency response training program has been expanded to include three additional plant personnel receiving HAZWOPER training. This now means that their are five individuals on site capable of addressing and coordinating the emergency response procedures for "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41364,
      "SummaryText": "this facility during an accidental Ammonia release. The process of upgrading the facility PSM plan has universally improved our ability to prevent a release of refrigerant, as well as enhanced the efficiency by which we respond to an accidental release.\n\nThere have been no releases of Ammonia from the Excursion Inlet facility refrigeration system within the last five years. In fact there have been no accidental releases of Ammonia at the Excursion Inlet facility in the last ten years.\n\nAs a result of the Ocean Beauty Seafoods Excursion Inlet facility being in a remote location, the entire emergency responder activities are borne by plant personnel. As a result of this, Ocean Beauty as spent a lot of time and money to see that the on-site personnel are properly trained and equipped to respond to an accidental release of Ammonia. As previously mentioned, five individuals have received HAZWOPER certification. Additionally, these same individuals plus an additional two employees have been fit tested and trained in the donning and deployment of SCBA units. There are five individuals who have received extensive site-specific training of the Ammonia refrigeration system. All possess the knowledge of the king valve location, as well as the system isolation valves and the receivers capacity volumes. In addition to the immediate mitigation and containment issues there are several plant personnel assigned to notification and evacuation of all employees, as well as any visitors and area residents. However, as explained earlier, there are no residences within the immediate vicinity of the plant. The Excursion Inlet Facility employs a nurse certified as an EMT. In the case of an accidental release the Haines borough fire department, as well as the U.S. Coast Guard would be notified immediately. \n\nOver the next year the Excursion Inlet Facility will be purchasing and installing several additional Ammonia sensors along with upgrading the alarm system. This will include both audio a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41364,
      "SummaryText": "nd visual notification throughout the facility. The present emergency lighting is being reviewed for enhancement to ensure all paths of egress are well lit during a power failure. Additional ventilation is planned for the compressor room. The purpose of this will be to improve emergency ventilation during an accidental release. Improvements to the equipment specific SSOPs and maintenance procedures will be conducted during the present processing season and finalized in October. It is the intent of Ocean Beauty Seafoods to continually look at ways to improve the safety and efficiency of the Excursion Inlet facility. \n\nOcean Beauty Seafoods Excursion Inlet Facility has historically taken the extra step to ensure that the employees of the plant are provided a safe and comfortable work environment. The Excursion Inlet Facility has always maintained policies that protect both the neighbors and the environment surrounding the facility. The management of Ocean Beauty Seafoods, along with that of the plant will continue to establish policies and procedures guaranteeing these high standards."
    }
  ]
}