{
  "FacilityID": 4140,
  "FacilityName": "Carpenter Co.,  Elkhart Div.",
  "FacilityStr1": "195 County Road 15",
  "FacilityStr2": null,
  "FacilityCity": "Elkhart",
  "FacilityState": "IN",
  "FacilityZipCode": "46516",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18039",
  "LEPC": "Elkhart County LEPC",
  "FacilityLatDecDegs": "41.683944",
  "FacilityLongDecDegs": "-85.907306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 86769881,
  "ParentCompanyName": "Carpenter Co.",
  "Company2Name": null,
  "CompanyDUNS": 3109444,
  "Company2DUNS": null,
  "OperatorName": "Carpenter Co.,  Elkhart Div.",
  "OperatorStr1": "PO Box 2386",
  "OperatorStr2": null,
  "OperatorCity": "Elkhart",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46515",
  "OperatorZipCodeExt": "2386",
  "FTE": 350,
  "OtherEPAFacilityID": "IND980680235",
  "EPAFacilityID": "100000054898",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "T039-6059-00086",
  "SafetyInspectionDate": "1999-03-04 00:00:00",
  "SafetyInspectionBy": "State EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.69151,
  "FRS_Long": -85.909385,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4825,
      "AltID": "polyurethane products man",
      "FacilityID": 4140,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5165,
          "ProcessID": 4825,
          "ChemicalID": 77,
          "Quantity": 800000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 4931,
          "ProcessID": 4825,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 2748,
              "Process_NAICS_ID": 4931,
              "SafetyReviewDate": "1999-04-15 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Industry Experience",
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-18 00:00:00",
              "ChangeCompletionDate": "1999-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Personnel Monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-06 00:00:00",
              "TrainingReviewDate": "1999-04-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-18 00:00:00",
              "EquipmentTested": "The rail siding was inspected for signs or rail wear or defects. None were observed",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2797,
                  "PreventionProgram2ID": 2748,
                  "ProcessChemicalID": 5165
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4140,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-15 00:00:00",
    "ERTrainingDate": "1998-11-05 00:00:00",
    "CoordinatingAgencyName": "Elkhart County LEPC",
    "CoordinatingAgencyPhone": "2198753391",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "EPA Title V"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4140,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Carpenter Co., Elkhart Div.  we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This summary provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of substances regulated by EPA's RMP regulation\n *  A summary of results from our assessment of the potential off site consequences from accidental chemical releases\n *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n  *  The detailed information (called data elements) about our risk management program\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility produces polyurethane foam products using a variety of chemicals and processing operations. We manufacture flexible polyurethane foam in prime, rebonded and molded forms. In addition we blend polyurethane systems for use by other end product manufacturers.  In our process, we use the following chemical that EPA has identified as having the potential to cause significant off site consequences in the event of a substantial accidental release:\n\nToxics\n\nToluene diisocyanate (mixed isomers) CAS No. 26471-62-5\n\nWe have storage capacity for approximately 60,000 gallons of TDI inside the plant in eight\nbulk tanks located in tank pits or diked tank farms.  Our ra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4140,
      "SummaryText": "il siding has capacity for up to twelve tank cars and box cars.  We normally have about 3-4 tank cars of TDI on hand at any given time. A maximum of seven cars of TDI have been on site at one time in the past. A tank car of TDI contains 20,000 gallons or approximately 190,000 lbs of material.  TDI \nis only unloaded from one position (Rail spot #2).  Our accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of this chemical.\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n \nThe following are brief summaries of theworst case and alternative release scenarios,  including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Release Scenario - Regulated Toxic Chemicals\n\nThe worst case scenario for our facility would involve the rupture of a 20,000 gallon tank car on our rail siding due to structural failure of the tank car resulting in a catastrophic spill of toluene diisocyanate onto the ground surrounding our rail siding. EPA models indicate that an end point of 0.25 miles for the toxic vapor cloud from such a spill could be anticipated.  Depending on wind conditions and direction, there could be residential and industrial areas involved in such an incident.  The likelihood of such an accident is extremely remote since the tank cars are built to industry safety standards and inspected by the TDI suppliers at regular intervals for structural integrity and operation of safety devices. In addition, Carpenter Co., Elkhart Div. follows strict unloading procedures designed to prevent release of toxic materials during unloading operations.  No spills have occurred at this site in our sixteen years of operation that had any off-site consequences or were reportable to any other agency regulating our use of this product.\n\nAlternative Release Scenario - Regulated Tox"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4140,
      "SummaryText": "ic Chemicals\n\nAn alternative release scenario might involve a leak from an unloading hose connecting the tank car to bulk storage systems inside the facility.  The leak could occur as a result of a defective quick disconnect gasket on the unloading hose or a defect in the unloading hose itself.  Since DOT ( Department of Transportation ) regulations require that all unloading activities be attended at all time, it is assume that an leak in the unloading equipment would be observed immediately and the flow of product halted immediately to prevent any further leakage. We calculate that less than 10 gallons of product could be spilled in such an incident and that the toxic end point for such a release would be 0.06 miles. Very few public receptors would be involved in such an event;  only directly contiguous neighbors would be involved.  Neutralization of such a spill would begin immediately with supplies kept on hand.\nWe have not had any release of this type in our 16 years of operation at this facility.\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n *  Process safety information\n *  Process hazard analysis\n *  Operating procedures\n *  Training\n *  Pre-startup review\n *  Compliance audits\n *  Incident investigation\n *  Employee participation\n *  Hot work permit\n *  Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps:\n\nTDI unloading is conducted in accordance with accepted industry practices and in full compliance with internal operating and safety procedures.\n\nThese individual elements of our prevention"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4140,
      "SummaryText": "program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention. \n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  There have been no accidents involving TDI with off-site consequences during the past five years; or during the past sixteen years of operations in Elkhart.\nIf such an incident were to occur, we will conduct a  formal incident investigation to identify and correct the root causes of the event.\n\nEMERGENCY RESPONSE PROGRAM\n\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency responders.  Our response capability is limited to small spills\nand limited incidents.  Large spills are to be referred to local Hazmat responders for assistance.  \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n\n1) Expand training program on the safe handling of TDI during unloading operations to include:\n              a) updating our training materials.\n              b) expanding the scope of employee training to a larger group of people.\n\n2) Improve our equipment inspection program to include documented routine inspections of equipment used for handling TDI."
    }
  ]
}