{
  "FacilityID": 41482,
  "FacilityName": "Platteville Compressor Station",
  "FacilityStr1": "15067 WCR 37",
  "FacilityStr2": null,
  "FacilityCity": "Platteville",
  "FacilityState": "CO",
  "FacilityZipCode": "80651",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08123",
  "LEPC": "Weld County LEPC",
  "FacilityLatDecDegs": "40.223600",
  "FacilityLongDecDegs": "-104.718300",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kerr-McGee Rocky Mountain Corporation",
  "Company2Name": null,
  "CompanyDUNS": 786228718,
  "Company2DUNS": 0,
  "OperatorName": "Kerr-McGee Gathering LLC",
  "OperatorStr1": "635 North 7th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Brighton",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Fitzsimmons",
  "RMPTitle": "General Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190063",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "01WE0399",
  "SafetyInspectionDate": "2004-11-01 00:00:00",
  "SafetyInspectionBy": "DOT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-12-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-09-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-09-13 00:00:00",
  "DeRegistrationEffectiveDate": "2017-08-17 00:00:00",
  "AnniversaryDate": "2009-08-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59604,
      "AltID": "Natural Gas Liquids Stora",
      "FacilityID": 41482,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 60984,
          "ProcessID": 59604,
          "NAICSCode": "48621",
          "_desc": {
            "NAICS_CODE": "48621",
            "NAICS_DESCRIPTION": "Pipeline Transportation of Natural Gas"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78899,
          "ProcessID": 59604,
          "ChemicalID": 155,
          "Quantity": 68330.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 58499,
              "ProcessChemicalID": 78899,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 58500,
              "ProcessChemicalID": 78899,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 58501,
              "ProcessChemicalID": 78899,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 58502,
              "ProcessChemicalID": 78899,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 58503,
              "ProcessChemicalID": 78899,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 58504,
              "ProcessChemicalID": 78899,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 58505,
              "ProcessChemicalID": 78899,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 578899,
          "ProcessID": 59604,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41482,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the KMG Gathering LLC (KMG) Platteville Compressor Station (Station.)  The station is subject to the OSHA PSM standard.\n\nAccidental Release Prevention and Response\n\nKMG has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention.  KMG has an extensive operator and maintenance training program.  Safety is a major concern in the design, installation, operation, and maintenance of our processes.  KMG?s policy is to implement reasonable controls to prevent foreseeable releases of hazardous materials.  However, if a release does occur, KMG personnel are trained on how to respond to such emergencies.  If the situation requires, KMG will notify, cooperate with, and support the various emergency response agencies. \n\nLocation and Regulated Substances\n\nPlatteville Compressor Station is located in Weld County at 15067 WCR 37 in a rural area which is used primarily for farming.\n\nThe Platteville Compressor Station consists of four compressor units, #s 91, 92, 93 and 94, that discharge 85 MMCF/D gas.  Water is removed through glycol dehydration and CO2  and H2S are removed with an amine solution.  Gas is then delivered via 8\" and 10\" cleanable pipelines.  The discharge pressure is not to exceed 1,220 psig. The station is equipped with inlet separation.  Liquids separated (water and heavy hydrocarbons) are pumped into the 10? cleanable pipeline.\n\nThe purpose of the Platteville compressor station is to:\n\n1.    increase the pressure of the gas coming from the gathering system;\n2.    reduce the dew point of the gas to a level that is acceptable for pipeline transmission or further processing; and\n3.    remove H2S and CO2 from the gas stream.\n\nPlatteville receives gas from various gathering lines and supplies the pipeline that transports the gas to a processing plant.  Control of the dew point is critical sinc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41482,
      "SummaryText": "e the incoming gas contains moisture (water and heavy hydrocarbons).  The amount of moisture in the gas varies from day to day depending on a great number of variables at the wells.  The dew point increases as the concentration of moisture in the inlet gas increases.\n\nThe gas temperature will decrease to about the same temperature as the surrounding environment as the gas flows through the pipeline.  If this temperature is below the dew point of the gas, the water and heavy hydrocarbons will tend to condense.  The buildup of hydrates can begin to restrict gas flow, particularly at orifices and bends in the pipe.  In extreme cold, hydrates may form a potentially dangerous ice plug.\n\nAt Platteville, in order to reduce the dew point of the gas and minimize the formation of hydrates, the inlet gas flows through a slug catcher and an inlet separator.  Liquids are separated from the gas by simple physical principles when the denser liquids fall out from the gas stream.  These raw, natural gas liquids (NGL) are sent to the Low Pressure Drain Storage Tank or pumped to the High Pressure Discharge.  When there is sufficient volume, the liquid is pumped into a tank truck for transportation or routed back into the gathering lines.\n    \nCompression of the gas causes some of the naturally occurring hydrocarbons which are in the vapor phase of the inlet gas stream to condense out of the stream.  This allows heavy hydrocarbons and water to be removed from the gas resulting in a lower dew point.  The liquids from first stage of compression are sent to the Low Pressure Drain Storage Tank and the liquids from the second stage are sent to inlet separation..\n\nThe gas stream then is brought into contact with a proprietary amine solution in a contactor tower where the gas flows upward countercurrent to the solution flowing downward.  This process removes acid gases (H2S and CO2) from the gas stream.  The acid gases are stripped from the amine solution in an Amine Still and the amine solution"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41482,
      "SummaryText": " is reused in the process.  Stripped gases are sent to a Thermal Oxidizer where they are incinerated.\n\nThe gas then is contacted with a liquid desiccant, triethylene glycol (TEG), in a contactor tower where the gas flows countercurrent to the glycol.  Water is removed to at or below pipeline specifications and the gas stream is then metered into a high-pressure pipeline outside the plant.  The TEG is regenerated and used again.  Vapors from the TEG Regenerator are incinerated in a Thermal Oxidizer.\n\nThe Station?s maximum intended inventory of flammable substances in a mixture is larger than the threshold quantity (10,000 lbs.) of regulated flammable substances.  Therefore, the Station is subject to the EPA RMP Standard.\n\nHistory and Ownership\n\nThe Platteville Compressor Station was built by HS Resources in 2001.  KMG acquired HS Resources in August, 2001.\n\nProgram Level\n\nKMG has determined that Program Level 1 applies to the Platteville Compressor Station.  The Off Site Consequence Analysis reveals that there is no \"public receptor\" within the 0.3 mile calculated endpoint for the worst-case scenario.\n\nEmergency Response Program\n\nThe Station has established and maintains an emergency response plan that is coordinated with local response agencies. The goals of the program are to protect employees and the general public from the hazardous effects of releases and to minimize the effects of any releases. The program is routinely reviewed and updated to reflect station, personnel, and regulatory changes.\n\nAccident History\n\nDuring the last three years, there have been no accidents that meet the criterion for inclusion in this submittal.\n\nPlanned Changes for Improved Safety\n\nIdeas for changes to improve safety are actively sought from employees.  Employee safety meetings that focus on various safety issues, such as flammable substances, are held regularly.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the poten"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41482,
      "SummaryText": "tial consequences of those hazards through KMG?s ?Near-miss? program."
    }
  ]
}