{
  "FacilityID": 41488,
  "FacilityName": "ConAgra Foods",
  "FacilityStr1": "705 East Whitmore Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95358",
  "Facility4DigitZipExt": "9408",
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.595833",
  "FacilityLongDecDegs": "-120.983333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.conagrafoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 176817666,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": null,
  "OperatorName": "ConAgra Foods",
  "OperatorStr1": "P.O. Box 3659",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95352",
  "OperatorZipCodeExt": "3659",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127276",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "N-1787",
  "SafetyInspectionDate": "2004-11-15 00:00:00",
  "SafetyInspectionBy": "Modesto Building Dept.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-12-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-12-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-01-28 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-20 00:00:00",
  "AnniversaryDate": "2009-12-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 37.595833,
  "FRS_Long": -120.983333,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Partial Closure of operations, Ammonia Removed from Site",
  "_processes": [
    {
      "ProcessID": 59613,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 41488,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 78915,
          "ProcessID": 59613,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 60994,
          "ProcessID": 59613,
          "NAICSCode": "311423",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34503,
              "Process_NAICS_ID": 60994,
              "SafetyReviewDate": "2004-11-01 00:00:00",
              "PHA_Date": "2004-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-11-16 00:00:00",
              "TrainingReviewDate": "2004-09-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-11-01 00:00:00",
              "EquipmentInspectionDate": "2004-10-21 00:00:00",
              "EquipmentTested": "Evaporator coil tube",
              "ChangeMgmtDate": "2004-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2004-11-01 00:00:00",
              "PreStartupReviewDate": "2002-04-14 00:00:00",
              "ComplianceAuditDate": "2002-09-25 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": "2002-06-07 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-11-01 00:00:00",
              "HotWorkPermitReviewDate": "2004-11-01 00:00:00",
              "ContractorSafetyReviewDate": "2003-10-14 00:00:00",
              "ContractorSafetyEvalDate": "2004-11-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 50321,
                  "PreventionProgram3ID": 34503,
                  "ProcessChemicalID": 78915
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41488,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Stanislaus County Dept. Env. Res.",
    "CoordinatingAgencyPhone": "2095256700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41488,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nConAgra Foods uses anhydrous ammonia for freezing vegetable products.  Ammonia is the only hazardous chemical used at this facility that is subject to the CalARP program or federal RMP requirements.\n\nThis facility recognizes the hazards associated with the use of highly hazardous chemicals.  As a reflection of our policy to adhere to all applicable federal, state, and local laws and regulations, we submit this plan to address the hazards inherent with the use of ammonia.  Our program addresses safety precautions regarding the handling and operation of this covered system as well as proper training for those who operate and maintain the system.  The company training policy requires that all employees will be properly trained for a job position before assignment to that job.\n\nOur accidental release prevention program is clearly defined by the OSHA Process Safety Management (PSM) Program for this facility.  This prevention program follows industry-recommended standards for preventing unnecessary human exposures and reducing the threat to the health of our employees as well as to members of the community and the surrounding area.  Safety depends upon the manner in which we handle these chemicals, the safety devices inherent in the design of this facility and its processes, and the training that we provide our personnel.  This Plan is updated as required by law.\n\nOur Emergency Action Plan (EAP) details the response this facility will take as a result of an uncontrolled release of ammonia.  The Plan includes procedures for notification of the local emergency responders.  This EAP also includes a specific protocol for responding to an ammonia release and assigns an Emergency Coordinator to implement the response.  This Plan is current and updated as required by law and conforms to the requirements for an Emergency Action Plan as per 29 CFR ? 1910.38(a).\n\nThis facility has also coordinated with the local emergen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41488,
      "SummaryText": "cy responders and will maintain close contact to ensure that the responders are familiar with the system and with the general safety and accidental release program at our plant.\n\nIt is the policy of this facility to devote the time, energy, and capital toward maintaining prevention and response programs appropriate to the inherent dangers with the use of hazardous chemicals.\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Stationary Source\n\nThe ConAgra Foods facility is located in the agriculturally productive Central Valley in Modesto, California.  The plant is situated at about 90 feet above sea level at the southern border of the city limits of Modesto along Whitmore Avenue.  The historically agricultural land south of Whitmore Avenue is currently under residential development by the City of Ceres.  The Union Pacific Railroad tracks separate the facility on the west from light industrial businesses.  The Kraft Foods facility borders the northern property line of ConAgra Foods and shares the same gated entrance on Whitmore Avenue.  Approximately 40 acres of agricultural land lie to the east, which in turn, are bordered by Morgan Road on the eastern border.\n\nThe ConAgra Foods facility, operated since 1958, processes vegetables into a variety of bulk dehydrated products.  The facility operates three shifts throughout the year with some variance depending upon crop availability.  Raw vegetables are trucked to the site and unloaded prior to washing in the wet processing building. Once the vegetables have been washed, they are processed, dehydrated, and packaged.\n\nPlant security is provided by a guard located at the main gate entrance to the facility. The security guard provides emergency response support under the direction of the Emergency Coordinator.  The entire plant is enclosed by a chain-link fence, except at the main gate, where trucks and personnel enter and exit as directed by the plant security guard.  Electronic identification pass cards are re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41488,
      "SummaryText": "quired for vehicle entrance through the main gate to enter the plant.  Process and office buildings are fire-sprinklered and connected to a centralized, automated alarm system. \n\nRegulated Substance Handled\n\nThe ConAgra Foods facility utilizes anhydrous ammonia as a heat transfer fluid in the plant refrigeration system.  The system is a hybrid one-stage / two-stage mechanical refrigeration system that utilizes a recirculated liquid evaporator feed for product freezing.  The closed loop system uses both liquid pumped overfeed and flooded systems.  The system operates and is attended 24 hours a day each day of the year by a qualified system operator.\n\nThe current capacity of the system is 760 TR, operating at a low-stage saturated suction temperature of ¿40 °F.  High stage saturated suction temperature is +25 °F with a saturated discharge temperature of +85 °F.  \n\nThe primary system components include:\n\n? Five (5) high-stage compressors (HSC)\n? One (1) single-stage compressor (SSC)\n? Five (5) low-stage screw compressor (LSC)\n? Three (3) evaporative condensers (EC)\n? Two (2) high-pressure receivers (HPR)\n? One (1) intercooler (IC)\n? One (1) air precooler coil (EV10)\n? One (1) air precooler surge drum (SD1)\n? One (1) liquid recirculator package (LRPFR)\n? One (1) belt freezer coil (FF1)\n? Two (2) ammonia pumps (AP)\n? Two (2) suction accumulators (SA)\n? One (1) liquid transfer unit\n\nThe condensers, suction accumulators, and the liquid transfer unit are located on the Engine Room roof, while the compressors, intercooler, and high pressure receivers are located in the Engine Room.  \n\nAdditional system components include:\n\n? Oil pots (one at intercooler and one at the liquid recirculator package) for draining oil)\n? Two (2) semi-automatic purgers, and\n? Ammonia diffusion tank (all relief valve discharge lines lead to the diffusion tank for mixing with water in the event of a release from a system component PRV).\n\nSafety systems include:\n\n? Pressure relief and relief piping s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41488,
      "SummaryText": "ystem to ammonia diffusion tank\n? Compressor control panels to shut down the compressor operation if safe operating conditions are exceeded\n? Liquid level float switches\n? Ventilation system for continuous and emergency ventilation of the Engine Room\n? Ammonia detection and alarm system for response to elevated levels of ammonia vapor in the Engine Room and freezer area\n? Emergency refrigeration control switch for emergency shutdown of the system\n? Fire sprinkler system\n? Fire extinguishers\n? Emergency showers and eyewash stations\n? Fire diffusion panel for use by the fire department in the event of a fire emergency\n\nThe operation and maintenance staff consists of one (1) Boiler-Compressor Operator (BCO) per shift at a minimum.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nThis facility complies with the California Accidental Release Prevention (CalARP) Program and OSHA¿s Process Safety Management (PSM) Program.  Key prevention steps taken by this facility to maintain safety are outlined in the PSM Program.  These include the description of all system and equipment information, process hazard analysis, operator training, contractor qualification, operating procedures, pre-startup safety review, hot work permitting, management of change, mechanical integrity, incident investigation, compliance audits, and emergency response.\n\nThose who operate, maintain, or supervise the system will be trained to understand the principles of ammonia refrigeration and ammonia properties, an understanding of the process equipment and proper operating and maintenance procedures, recognition of abnormal conditions and the steps to correct deviations, and emergency shutdown procedures as appropriate to the level of involvement each employee will have with the process.  Contractors that perform maintenance or that design changes to the system will be qualified by the facility based upon their experience and safety record before being selecte"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41488,
      "SummaryText": "d to provide such services.\n\nThe general safety program includes hazardous communication, forklift operation, first aid, emergency response, and additional programs as necessary to maintain a safe operation.\n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no reportable accidents or releases of ammonia in the last five years.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nEmployees are trained to understand the requirements of the Emergency Action Plan.  The Emergency Action Plan includes release notification for emergency responders and the procedures for evacuation.  The Emergency Coordinator implements the response in coordination with the local emergency responders (i.e. the fire department).  It is the policy and practice to conduct evacuation drills at least twice per year.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA revalidation Process Hazard Analysis (PHA) was performed as required every five years, at a minimum.  The PHA team developed a list of recommendations to improve safety by reducing potential hazards of the process.  All recommendations were implemented, deemed unnecessary since no improvements to safety would result, or planned for implementation at a later date.  Upcoming events include:\n\n? Complete system seismic assessment\n? Minor software changes\n? Improved Standard Operating Procedures\n? Additional training for personal protective equipment (PPE)\n? Equipment room egress evaluation\n? Pressure relief valves at reciprocating compressor oil separators\n? Additional emergency safety shower and eyewash station"
    }
  ]
}