{
  "FacilityID": 41503,
  "FacilityName": "Tyson Foods  ( Omaha,Ne  Bacon Plant )",
  "FacilityStr1": "13076 Renfro Circle",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68137",
  "Facility4DigitZipExt": "3191",
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.203056",
  "FacilityLongDecDegs": "-096.116943",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.tyson.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tyson Foos Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": 0,
  "OperatorName": "Tyson Foods",
  "OperatorStr1": "13076 Renfro Circle",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68137",
  "OperatorZipCodeExt": "3191",
  "RMPContact": "Dennis L. Skou",
  "RMPTitle": "General Manager",
  "FTE": 450,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190116",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2004-12-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-12-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-12-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-12-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59632,
      "AltID": "Ammonia (anhydrous )",
      "FacilityID": 41503,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61013,
          "ProcessID": 59632,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 78939,
          "ProcessID": 59632,
          "ChemicalID": 56,
          "Quantity": 50120.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 578939,
          "ProcessID": 59632,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41503,
      "SummaryText": "EPA RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nTYSON FOODS    Omaha Bacon Plant  ( Omaha,Nebraska ) 13076 Renfro Circle \n\n\n1.  Accidental release prevention and emergency response polices.  To insure safe operation and release prevention at Tyson Foods Omaha,Nebraska this facility has implemented The Occupational Safety and Health Administrations Chemical Process Safety Management Program 29 CFR 1910.119.  All operators of systems containing the threshold amount of hazardous chemicals will undergo Chemical Process Safety Management training and operator training specific to the system. \nTo insure proper response to emergency situations, Tyson Foods Omaha,Nebraska has implemented Emergency Action Plans as required by The Occupational Safety and Health Administrations 29 CFR 1910.38(a) and Emergency Response Plans  29 CFR 1910.120. All safety personnel and operators of the process will be trained in these emergency procedures.\n\n2.  The stationary source and regulated substances handled.\n     At the Omaha Nebraska Plant  WE USE ANHYDROUS AMMONIA FOR OUR REFRIGERATION SYSTEM PROCESS COOLING WITH \n     THE MAXIMUM INVENTORY OF 50,118 LBS.\n   \n3.  The general accidental release prevention program.\n      This facility complies with the Occupational Safety and Health Administrations Chemical Process Safety Management 29 CFR 1910.119 and the Environmental Protection Agencies Risk Management Program 40 CFR Part 68.  For ammonia systems\nTyson Foods, Inc. has adopted the International Institute of Ammonia Refrigeration guidelines for system operation and maintenance.  Tyson Foods Inc. uses the IIAR Basic Ammonia Refrigeration Training Series for all operators. We have trained people in the ammonia system to maintain proper care of our system.\nWe use Garden City Ammonia training school for our Ammonia Techs. \n \n4.  Five-year accident history.  No reportable accidents in past 5 years.\n                 \n5.   The emergency response program.\nA fully trained and equipped Emergency Resp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41503,
      "SummaryText": "onse Team is on site.  This team is trained to the Hazardous Materials Responder-Technician response capability in accordance with OSHA 29 CFR 1910.120 (q).  The team is capable of affecting all control measures (both confinement operations and containment operations) required to remediate the incident.\n\nA written Emergency Response Plan has been developed and is on record at the Facility.  This plan includes Pre-Emergency Planning with Outside Agencies, Personnel Roles and Lines of Incident Command Authority, Facility Hazard Analysis and Emergency Prevention, Safe Distances and Places of Refuge, Site Security and Control, Evacuation Routes and Procedures, Decontamination Procedures, provisions for Emergency Medical Treatment, Emergency Notification Procedures, Chemical Response Procedures, Post Incident Critique, and Personal Protective Clothing and Emergency Equipment.\n\nAll Hazmat courses at Tyson Foods, Inc., are designed to meet training requirements of the OSHA 29 CFR 1910.120 (q) (7) and (8).   All Omaha , Nebraska Hazmat Team Members are trained 24 hours initially to the Technician level followed by 8 hour of refresher training per year at the Omaha Safety Council. This is Safety facility that is professionals in the Hazmat training procedures. We also have the Omaha Fire Department do an annual walk thru of our facility.\n\nThe training is designed to teach both theory and hands-on training giving the person an overall understanding of the nature of hazardous materials and the ability to assess and safely respond to the incidents in the Incident Command structure.  Technician level  training includes but is not limited to the following:\n? Knowledge of basic hazards and risk assessment techniques\n? Proper selection and use of appropriate and required PPE for the chemical hazard\n? Terminology associated with Hazmat\n? Advanced site control/security procedures\n? Advanced Containment/Control/Decon procedures\n? Use of Atmospheric Monitoring Equipment and Contaminant"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41503,
      "SummaryText": " Test Procedures\n? Incident Command Structure Roles and Line of Authority\n? Interaction with Local and State Officials\n? Standard Operating Procedures for Clean-up and termination \n? Critique\n\nWe have 40 hr and 24 hour trained in Hazmat response but only will only assist in working with the Omaha Fire Department Hazmat team incase of a emergency.  \n\nAll training materials, hands-on drills and response procedures have been developed under the direction of Tyson Total Safety.\n\nAll Team members are taught in Hazard Communication to report any observed chemical leaks/spills and odors to their supervisor or lead person immediately.  Supervisors are taught to report the above to the Safety or Maintenance department immediately for further investigation and action by the Hazmat team.  MSDS information books are accessible to all team members for review.\n     \n6.  Planned changes to improve safety.\n     Monthly and annual Inspections of all emergency equipment. Make sure all policies and procedures are in place. Continue proper training of our people to make it the safest place to work."
    }
  ]
}