{
  "FacilityID": 41554,
  "FacilityName": "Sacramento Chemical Co., Inc.",
  "FacilityStr1": "6555 Florin Perkins Road",
  "FacilityStr2": null,
  "FacilityCity": "Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95828",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.506389",
  "FacilityLongDecDegs": "-121.392778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3056496,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Harry Willey",
  "OperatorStr1": "Post Office Box 276081",
  "OperatorStr2": null,
  "OperatorCity": "Sacramento",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95827",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "43407-1-49756",
  "EPAFacilityID": "100000113995",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-09-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2004-12-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-12-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-12-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-12-18 00:00:00",
  "DeRegistrationEffectiveDate": "2012-11-14 00:00:00",
  "AnniversaryDate": "2009-12-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.3",
  "FRS_Lat": 38.50724,
  "FRS_Long": -121.39061,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59686,
      "AltID": "32870",
      "FacilityID": 41554,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 78999,
          "ProcessID": 59686,
          "ChemicalID": 62,
          "Quantity": 10400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61067,
          "ProcessID": 59686,
          "NAICSCode": "56179",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34555,
              "Process_NAICS_ID": 61067,
              "SafetyReviewDate": "2004-10-12 00:00:00",
              "PHA_Date": "2005-03-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-11-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Vandalism",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "caustic absorption scrubber",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "caustic absorption scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "audio, visual & olfactory inspection",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-10-12 00:00:00",
              "TrainingReviewDate": "2004-10-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-10-12 00:00:00",
              "EquipmentInspectionDate": "2003-09-04 00:00:00",
              "EquipmentTested": "Hydro test of small cylinders",
              "ChangeMgmtDate": "2004-09-28 00:00:00",
              "ChangeMgmtReviewDate": "2004-09-28 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2004-11-15 00:00:00",
              "AuditCompletionDate": "2004-12-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-10-12 00:00:00",
              "HotWorkPermitReviewDate": "2004-11-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-11-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 50389,
                  "PreventionProgram3ID": 34555,
                  "ProcessChemicalID": 78999
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41554,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-10-12 00:00:00",
    "ERTrainingDate": "2004-05-20 00:00:00",
    "CoordinatingAgencyName": "Sacramento City Fire Department",
    "CoordinatingAgencyPhone": "9164331627",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41554,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies\n\nSacramento Chemical Co., Inc. (also SCC), located at 6555 Florin Perkins Road, Sacramento, CA  95828, stores and repackages chlorine, which is considered a hazardous material that is a regulated substance and is considered in this Risk Management Plan (RMP).  The properties of chlorine make it necessary to observe safety precautions in handling chlorine to prevent human exposure, and to reduce the threat to the facility's workers and nearby members of the community.  It is the facility's policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the safe procedures used to handle chlorine; the safety devices and systems designed and constructed into the facility; and the training of pertinent personnel.  SCC has posted Emergency Response Procedures at the site and in the office, which includes procedures for reporting any hazardous chemical accident or release and the emergency contact telephone numbers.  SCC has also posted its Emergency Medical and First Aid Response Procedures, which is a quick reference for employees and office personnel on what to do if a person is exposed to chlorine gas, as well as its Emergency Escape Mask  Procedures, which details how to use the emergency escape mask in the event of an accidental  release.  All SCC service vehicles contain Emergency Response Documents, which is a quick reference for employees on what to do in various potential emergency and/or release situations.  SCC also has an emergency action plan contained in section N of the OSHA PSM. \n\nSCC's Emergency Action Plan is contained within SCC's PSM.  The Fire Department is the first responder for emergencies - employees will respond only to incidental releases.  When filling cylinders with chlorine, employees have available safety goggles, gloves and escape masks.  Employees test the System using ammonia for leak detection prior to filling the system with chlorine fr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41554,
      "SummaryText": "om the ton container.  A verbal notification system is in place to alert personnel about chlorine leaks, as well as an alarm leak detection system with an automatic shut off valve.  A posted Emergency Response Program identifies who to call in the event of a release, which includes calling 911.\n\n2.  Stationary Source and Regulated Substances Handled\n\nSacramento Chemical Co., Inc. provides chlorination service to swimming pools.  Chlorine is repackaged at the facility from one-ton containers to twenty pound net capacity service cylinders.  The twenty pound cylinders are used by the facility's service staff to chlorinate customer swimming pools in accordance with the Chlorine Institute's Chlorine Manual.  The facility operates five days a week (M-F), eight hours per day, and 50 weeks per year.\n\nThe Fill Yard is used exclusively for the storage and repackaging of chlorine.  The yard area provides adequate room for the delivery and parking of chlorine delivery vehicles during the off-loading of full one-ton containers and the loading of empty one-ton containers. \n\nThe Fill Yard is not exposed to vehicular traffic, and vehicle barriers are installed around the ton containers.  The Fill Yard is enclosed by a fence, locked gate and is patrolled by guard dogs.  The Fill Yard houses all of the chlorine containers and is locked after normal working hours.  Company policy does not allow unauthorized personnel entry into the building.  Signs are also posted indicating a restricted area.  Container handling and storage is per local, state and federal regulations.\n\nThe amount of chlorine packaged per month is seasonally dependent.  The summer months, for obvious reasons, are the busiest swim times of the year.  Consequently, the quantity of chlorine on site is highest during this period.  SCC stores a maximum of 10,400 pounds of chlorine.  This amount includes the contents of 3 one-ton containers, 120 twenty-pound cylinders, and the one-ton container in the repackaging process."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41554,
      "SummaryText": "The Federal threshold of 2,500 pounds is exceeded as the maximum on site at any given time is 10,400 pounds of chlorine.\n\nChlorine is purchased from and delivered by commercial chlorine suppliers.  Delivery of one-ton containers is during normal working hours.  The one-ton containers, up to a maximum of 4, are stored and/or used in the Fill Yard.\n\nOff-loading of the one-ton containers from the commercial delivery vehicle is accomplished with a fork lift.  The one-ton containers are placed on a concrete slab in the Fill Yard.  The one-ton containers are manually rolled to the desired location and chocked to prevent movement.  Empty and full twenty pound cylinders are segregated and are chained or strapped into place in an upright position.  The company has administrative procedures in place that limit the amount of chlorine at the facility to no more than 4 one-ton containers and 120 each twenty pound cylinders for a total maximum of 10,400 pounds.  The procedure, in part, requires the owner/operator to verify existing chlorine inventory to ensure that an order and delivery of a one-ton container will not cause the aggregate quantity to exceed 10,400 pounds.\n\nChlorine is repackaged as a liquid from one-ton containers into twenty pound net-capacity, DOT approved cylinders.  Any residual chlorine in small diameter, short length piping is directed into a liquid caustic absorption scrubber.  The twenty pound cylinders are transported by company service vehicles to customer's swimming pools where the service personnel dispense the chlorine as a gas into the pool.  The twenty pound cylinders are owned by the company and maintenance is performed in accordance with the PSM maintenance procedures.\n\nThe receipt, storage, and repackaging of chlorine is considered a single process.  The major components of the chlorine system are:  the one-ton DOT aproved cylinders, the proprietary transfer piping assembly, the twenty pound capacity DOT approved cylinders, the pan scale for wei"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41554,
      "SummaryText": "ghing the cylinders during the filling operation, and the chlorine absorption system.\n\nA proprietary tube assembly is attached to the lower (liquid level) angle valve on the operating one-ton container and an empty service cylinder is brought into place on a pan scale and attached to the other end of the transfer assembly.  Filling commences by opening the one-ton container liquid valve, the cylinder valve, and various other proprietary and confidential steps in the transfer assembly.  After filling, which is indicated by weight on the pan scale reaching the desired value, the cylinder valve is closed, the ton supply of chlorine is closed, and the transfer tubing is evacuated into the chlorine absorption system prior to disconnecting the full service cylinder.  The caustic solution comprising the absorption medium is prevented from being sucked back into the system using the unique design of the proprietary and confidential chlorine packaging system.\n\nThe packaging system is operated under pressure from the chlorine container.  Only a small amount of residual chlorine remains in the lines after fill to be routed to the caustic scrubber.  Operational and test procedures are in place which ensure that the scrubber system is operating correctly.  Chlorine is not vented to the atmosphere.  Full twenty pound cylinders are stored in the packaging area until loaded onto delivery trucks.  Transport and loading of the cylinders adheres to DOT and other regulations.\n\nFilling is done by trained, qualified personnel.  Written filling procedures exist and are followed.  The entire system is evacuated and the one-ton container liquid valve is shut during non-working hours.  The following emergency equipment is available at the fill yard:  escape masks; an emergency drench shower/eyewash unit; alarm leak detection system with automatic shut off valves; safety goggles; safety gloves; ammonia to detect leaks; fire extinguisher; first aid kit; valve protectors on the ton containers;"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41554,
      "SummaryText": "valve protectors on the smaller service cylinders.\n\n3.  EPA removed the requirement to include off-site consequence analysis (OCA) in the Executive Summary. \n\n4.  General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe facility complies with all applicable federal and state codes and regulations.  There are safety meetings and safety training.  The Process Safety Management (PSM) program implemented at the facility for the chlorine process system and the related activities and equipment represents the facility's main active commitment to an accidental release prevention program. \n\nSCC conducts hydro-stat testing of all small service cylinders every five (5) years.  SCC also has a maintenance program for equipment, for example the caustic absorption scrubber is tested for pH, and the fill system valves are rebuilt and/or replaced.   Equipment is continuously inspected for maintenance and upkeep.  The specific safe work processes in place at SCC's facility are detailed in the PSM.  \n\n5.  Five Year Accident History\n\nThere have been no accidental releases of chlorine in the last five years.\n\n6.  Emergency Response Plan\n\nThe emergency response program is based upon alerting personnel at the facility to evacutate the facility and await the arrival of local emergency responders at the evacuation assembly location if a release occurs that causes the evacuation to be initiated.  SCC's Emergency Response Plan is posted at the fill yard and in the office as a quick reference for how to handle an emergency.  \n\n7.  Planned Changes to Improve Safety\n\nSCC's Process Hazard Analysis element of the Process Safety Management (PSM) was updated in 2004.  Following recent state environmental and fire department inspections, changes were implemented on site, including the addition of vehicle barriers around the chlorine tons, replacement of wood work bench with metal, secondary containment of caustic tank, posting of signs on site, SCBA and ton repair kit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 41554,
      "SummaryText": "removed/donated to first responder Fire Department, an alarm, procedures and automatic shut off valve were installed, new valves and fill connectors, and an increase in inventory from 3 to 4 tons stored on site. Current applicable codes and regulations are reviewed as part of the PSM to determine if other commitments need to be made to achieve increased operational safety for the regulated chlorine process system."
    }
  ]
}