{
  "FacilityID": 4156,
  "FacilityName": "Louisiana Water Company (Crowley)",
  "FacilityStr1": "422 S. Avenue H",
  "FacilityStr2": null,
  "FacilityCity": "Crowley",
  "FacilityState": "LA",
  "FacilityZipCode": "70526",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22001",
  "LEPC": "Acadia Parish LEPC",
  "FacilityLatDecDegs": "30.208306",
  "FacilityLongDecDegs": "-92.3685",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 53250296,
  "ParentCompanyName": "Utility Holdings, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 606528255,
  "Company2DUNS": 0,
  "OperatorName": "Donald Hilliard, Area Manager",
  "OperatorStr1": "422 S. Avenue H",
  "OperatorStr2": null,
  "OperatorCity": "Crowley",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70526",
  "OperatorZipCodeExt": null,
  "RMPContact": "William E. Edrington, III",
  "RMPTitle": "Executive Vice-President",
  "FTE": 11,
  "OtherEPAFacilityID": "19479 LDEQ",
  "EPAFacilityID": "100000050785",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-05-07 00:00:00",
  "SafetyInspectionBy": "ECS Risk Control",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.2084,
  "FRS_Long": -92.36806,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4849,
      "AltID": "Water Treatment",
      "FacilityID": 4156,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 4957,
          "ProcessID": 4849,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5196,
          "ProcessID": 4849,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505196,
          "ProcessID": 4849,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4156,
      "SummaryText": "A.  Louisiana Department of Environmental Quality Facility Identification Number\n\n#19479 LDEQ\n\nB.  Accident release prevention and emergency response policies at the stationary source.\n\nLAWCO chlorine operations, maintenance, training and accident prevention follow guidelines established by the American Water Works Association (AWWA), more particularly, AWWA Manual 20, \"Water Chlorination Principles and Practices\", AWWA B301-50, \"Standard for Liquid Chlorine\", AWWA C601-81, \"Forms of Chlorine for Disinfection\".\n\nLAWCO chlorine operations equipment and processes follow guidelines established by the American Water Works Association, more particularly, AWWA M20, \"Chlorination Equipment\" and those set forth by the manufacturers of such equipment.\n\nLAWCO chlorine operations follow guidelines set forth by the manufacturer's Material Safety Data Sheets (MSDS).\n\nLAWCO's annual hazard review identifies any and all hazards associated with the process, opportunities for equipment malfunctions or human error, safeguards needed to control the hazards or prevent equipment malfunction or human error, and any steps used or needed to detect or monitor releases.\n\nLAWCO's annual review of all operating procedures assure that they reflect current operating practice, including changes that result from changes in process chemicals, technology, and equipment, and changes to stationary sources.\n\nLAWCO provides initial, thorough training for each new employee involved in operating a process that emphasizes specific safety and health hazards, emergency operations including shutdown, and safe working practices.  Training program includes annual refresher training for all employees involved with activities in the chlorination process.\n\nLAWCO's maintenance program ensures mechanical integrity of process equipment.  Our maintenance program procedures are in writing, training is provided for all employees involved in maintenance activities, and regularly scheduled inspections and testing is perfo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4156,
      "SummaryText": "rmed on process equipment.\n\nLAWCO's compliance audits ensure compliance with the provisions of the risk management plan.\n\nLAWCO conducts thorough incident investigations for any incident that resulted in, or could reasonably have resulted in a catastrophic release of chlorine.\n\nLAWCO continually monitors the Accident Prevention Management program for improvements in safety, hazard assessment, operating and maintenance procedures and training.\n\nEmergency Response Plan:\n\nLAWCO has a detailed written emergency response plan.  The plan includes specific actions that should be taken in response to an accidental release of chlorine.  The plan includes procedures for the following:\nNotification Procedures, First Aid Procedures for Exposure, Emergency Response Procedures After a Release, Procedures for Use of Equipment, Training for Employees in Procedures, Review and Update Plan, Emergency Response Plan Regulatory Agencies.\n\nC.  The stationary source and regulated substance handled.\n\nPrimary activity - drinking water treatment plant\n\nUse of regulated substance - chlorine used to disinfect drinking water\n\nQuantities handled or stored - maximum of four (4) one-ton cylinders or 8,000 pounds at any given time which includes cylinders in service and empty cylinders.\n\nD.  The worst-case scenario and alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWorst-case scenario -\nFailure of the one ton cylinder containing 2,000 pounds of chlorine, 200 pounds/minute release rate, for a period of ten minutes.\nUnder worst-case weather, the substance could travel 1.3 miles before dispersing enough to no longer pose a hazard to the public.\n\nAlternative release scenario -\nA leak in a one ton cylinder of approximately 15 pounds of chlorine, .25 pounds/minute release rate, for a period of 60 minutes before repairs are completed.\nUnder the worst-case weather, the substance could travel .1 miles before dispers"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4156,
      "SummaryText": "ing enough to no longer pose a hazard to the public.\n\nE.  The general accidental release prevention program and chemical-specific prevention steps.\n\nLAWCO is in compliance with AWWA Manual M20, \"Water Chlorination Principles and Practices\" which outlines specific procedures in Shipping Containers for Chlorine Compressed Gases, Handling Shipping Containers, Storing Shipping Containers, Emptying Containers, Connecting and Disconnecting Containers, Engineering Control of Hazards, Finding Gas Leaks, Handling Emergencies, Personnel Protective Equipment, Personnel Training, Special Care and Use of Hypochlorites.\n\nLAWCO is in compliance with AWWA B301-59, \"Liquid Chlorine Standard\", which defines liquid chlorine and explains characteristics of liquid chlorine, shipping requirements for liquid chlorine and inspection requirements for liquid chlorine containers.\n\nF.  The five-year accident history.\n\nLouisiana Water Company has not had any accidents involving any chlorine releases at this facility over the past five years, and in fact, since LAWCO purchased and assumed responsibility of operations and maintenance at the Crowley plant in February of 1983, there have been no reportable releases or accidents involving chlorine at the facility.\n\nG.  The emergency response program.\n\nLAWCO has a detailed written emergency response plan.  Our plan includes specific actions that should be taken in response to an accidental release of a regulated substance.  The plan includes procedures for public notification, notification to agencies responsible for responding to accidental releases, notification to agencies requiring such notice, information on emergency health care, emergency response after a release, use of equipment, training requirements and annual review and plan updates."
    }
  ]
}