{
  "FacilityID": 41727,
  "FacilityName": "Sysco Food Services of San Diego, Inc.",
  "FacilityStr1": "12180 Kirkham Road",
  "FacilityStr2": null,
  "FacilityCity": "Poway",
  "FacilityState": "CA",
  "FacilityZipCode": "92064",
  "Facility4DigitZipExt": "6879",
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.938411",
  "FacilityLongDecDegs": "-117.050598",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 77054450,
  "Company2DUNS": 0,
  "OperatorName": "Sysco Food Services of San Diego",
  "OperatorStr1": "12180 Kirkham Road",
  "OperatorStr2": null,
  "OperatorCity": "Poway",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92064",
  "OperatorZipCodeExt": "6879",
  "RMPContact": "Kevin Mangan",
  "RMPTitle": "Executive Vice President",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000023501",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-11-18 00:00:00",
  "SafetyInspectionBy": "SD County",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-01-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-01-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.3",
  "FRS_Lat": 32.93877,
  "FRS_Long": -117.05046,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 59910,
      "AltID": null,
      "FacilityID": 41727,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61296,
          "ProcessID": 59910,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79238,
          "ProcessID": 59910,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579238,
          "ProcessID": 59910,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41727,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Sysco Food Services facility commenced operations in June 1998 with a system expansion scheduled to be completed in January of 2005.  This facility has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nSysco Food Services maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, as well as to incorporate facility changes due to moving into a new facility.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Sysco Food Services ammonia refrigeration system startup occurred during the week of June 8, 1998 with Sysco Food Services personnel taking full responsibility for operating the entire facility in July 1998.  The facility is currently undergoing a system expansion which is scheduled to be complete in early January of 2005.  The facility is located at 12180 Kirkham Road, Poway, California 92064.  The facility has been constructed in accordance with the most recently adopted Uniform Fire and Mechanical Codes. \n\nThe ammonia refrigeration system uses 13,000 pounds of ammonia for several cold and freezer storage areas: -10?F freezer, 28?F cooler, 50?F cooler, 34?F cooler, 40?F cooler, 55?F cooler, and the 45?F dock.  The majority of the system is located in the engine room inc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41727,
      "SummaryText": "luding most vessels and all the compressors.  The new Intercooler has been installed outdoors, adjacent to the engine room. The condensers are mounted on the engine room roof, the Control Box and Diffusion Tank are located outside the engine room, and all of the evaporators are located in their respective cold storage rooms/areas.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon Receiver to the Controlled Pressure Receiver (CPR), where the pressure is reduced from 181 psig to 103 psig.  The CPR serves as the main storage vessel for the system.  The CPR supplies liquid ammonia to the High Temperature Recirculator (HTR) and Intercooler.  Pumps associated with the HTR transfer the liquid to evaporators (23) throughout the facility.  The liquid ammonia expands as it enters the various evaporator coils, reducing the temperature.  These evaporators are used to maintain low air temperatures for warehouse/dock storage in seven different zones.  As the air is chilled by the evaporators, the ammonia is vaporized and returned to the HTR, which maintains a liquid/vapor mixture of ammonia at 28 psig.\n\nThe HTR also routes the liquid from the CPR to the Low Temperature Recirculator (LTR), which further reduces the pressure of the ammonia to 1.3 psig.  The LTR supplies liquid ammonia to the freezer evaporators (10) and collects the resulting vaporized ammonia.  The Booster Compressors (2) pull this low pressure ammonia vapor from the LTR and discharge higher pressure vapor to the Intercooler.  As Booster discharge is bubbled through the Intercooler's liquid ammonia bath, a portion of the bath vaporizes, which decreases the vapor's superheat.  The High Stage Compressors (3) pull booster discharge from the Intecooler and high stage suction from the HTR and further compress the vapor.  The high stage discharge (hot gas) from the High Stage Compressors is piped to the condensers, where the ammonia is converted back to high pressure"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41727,
      "SummaryText": " liquid and recycled to the Thermosyphon Receiver.  The Thermosyphon Receiver also supplies liquid ammonia to compressors for oil cooling.  The Automatic Purger periodically purges the system of non-condensibles collected in the CPR and the condensers.  The system also has a dilution tank (into which the relief header vents), which is kept full of water.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Sysco Food Services facility was designed and constructed in accordance with the 1994 Uniform Mechanical Code which specifically outlines requirements for the safe operation of ammonia refrigeration systems.  These safety features include a water diffusion tank, ammonia sensors in the engine room, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room or on the engine room roof (condenser).  \n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\"\n\nAlso, the recent expansion followed the 2001 California Building Code, which adopts the 1997 UBC, 2000 UMC, 2000 UPC, and the 1999 NEC.\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into Sysco Food Services of San Diego, Inc.'s accident history revealed that there have been no reportable ammonia releases over the past five years (November 1999 ? November 2004).  However, the facility did have a minor release on January 1st, 2004, which is detailed below.\n\nEmployees reported a strong ammonia smell emanating from the Cooler Area.  All employees working in the general vicinity were told to evacuate by the Alternate Emergency Coordinator. The liquid line to the area was shutdown and the Cooler Area was allowed to vent.  A small pin hole in the liquid header was detected by the refrigeration contractor in the 5th circuit from"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41727,
      "SummaryText": " the top at the weld for Evaporator #12.  A certified welder was called in to weld the pin hole leak under the direction of the refrigeration contractor, Alliance Industrial Refrigeration, Inc.  Additionally, all flanges were inspected, and all gaskets were removed, inspected, and replaced on Evaporator #12.  The facility estimates 1.5 cubic feet of ammonia vapor was released. \n\nEMERGENCY RESPONSE PROGRAM\n\nThe Sysco Food Services has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nSysco Food Services maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, as well as to incorporate facility changes due to moving into a new facility.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis Addendum study, performed on November 18th, 2004, generated mitigation measures (recommendations) to address and improve safety following the facility expansion at the Sysco Food Services of San Diego, Inc. facility located in Poway, California.  In addition, the safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41727,
      "SummaryText": " the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}