{
  "FacilityID": 41813,
  "FacilityName": "Sandridge Food Corporation",
  "FacilityStr1": "133 Commerce Drive",
  "FacilityStr2": null,
  "FacilityCity": "Medina",
  "FacilityState": "OH",
  "FacilityZipCode": "44256",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39103",
  "LEPC": "Medina County LEPC",
  "FacilityLatDecDegs": "41.138333",
  "FacilityLongDecDegs": "-081.902222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sandridge.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 198721409,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sandridge Food Corporation",
  "OperatorStr1": "133 Commerce Drive",
  "OperatorStr2": null,
  "OperatorCity": "Medina",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44256",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jim Meadows",
  "RMPTitle": "Director of Process Improvement",
  "FTE": 245,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166857",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-01-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-01-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-01-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 41.13995,
  "FRS_Long": -81.90083,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60062,
      "AltID": "Refrigeration System",
      "FacilityID": 41813,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61452,
          "ProcessID": 60062,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79426,
          "ProcessID": 60062,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579426,
          "ProcessID": 60062,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41813,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nSANDRIDGE FOOD CORPORATION \nMEDINA, OHIO\n\n\nBackground Data\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Sandridge Food Corporation (Sandridge) submits this Risk Management Plan (RMP) for operations at their Medina, Ohio facility.  The operations at the Medina facility include the processing and storage of perishable prepared food products for public consumption.  These products are packaged and distributed throughout the eastern United States under several familiar brand names.  Sandridge has been in operation at this facility for 20 years providing quality products and over 250 jobs to the local community.\n\n\nAccidental Release Prevention and Emergency Response Policy\n\nSandridge is committed to protecting the health of its employees, the surrounding community, and the environment.  It is Sandridge corporate policy to maintain a safe and healthy workplace, protect the environment, and comply with all applicable regulations, including 40 CFR 68 and the Occupational Safety and Health Administration?s (OSHA?s) Process Safety Management (PSM) regulation, 29 CFR 1910.119.  \n\n\nStationary Sources and Regulated Substances\n\nTo ensure the quality of Sandridge?s ingredients and final products, refrigeration is necessary to maintain the low temperatures required for the food processing and storage areas of the plant.  These requirements are promulgated and monitored by the United States Department of Agriculture, the Ohio State Department of Agriculture, and the United States Food and Drug Administration.  To achieve this, Sandridge uses anhydrous ammonia, the 112(r) regulated substance, as the refrigerant in the cooling system.  The ammonia refrigeration system maintains the 110,000 square-foot facility within the required range of operating temperatures and provides the cooling necessary for the storage of fresh ingredients and the production of various peris"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41813,
      "SummaryText": "hable food products.  Anhydrous ammonia is a standard refrigerant for the food industries and widely used throughout the country.  The refrigeration system at Sandridge Food Corporation?s Medina facility is a closed loop system and consists of compressors, condensers, receiver vessels, pumps, evaporators, heat exchangers, air handling units, and the associated piping for this equipment.  The system can contain a maximum amount of approximately 21,300 pounds of anhydrous ammonia at any time during the course of the year.  Ammonia is the only regulated substance, covered by the EPA?s Chemical Accidental Prevention Provisions and the associated Risk Management Program requirements, that is used at the Medina facility.\n\n\nFive-Year Accident History\n\nOver the last five years of operation, Sandridge has not experienced any reportable releases of anhydrous ammonia from the refrigeration system.  Furthermore, there has not been a reportable release of ammonia from the system since its initial installation in 1990. \n\n \nWorst Case and Alternative Release Scenarios\n\nAs required by 40 CFR 68 Subpart B, Sandridge Food Corporation has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  The worst-case release scenario is defined as the release, over a 10-minute period, of the entire contents of the largest vessel or pipe in the facility?s system.  The worst-case release scenario was developed following EPA regulations, however, based on the facility?s operating history, it is not considered by Sandridge Food Corporation to be a likely release scenario for the facility.  A more realistic release scenario (alternative case release) was developed in accordance with the EPA requirements.  This scenario considers the facility?s 20-year history of operational experience and the potential hazards identified in the process hazards analysis (PHA) study conducted by Sandridge.  The PHA study was performed to ensure that the potential haza"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41813,
      "SummaryText": "rds associated with the ammonia refrigeration system were identified and evaluated to minimize their potential for occurrence.  The analysis was conducted in accordance with OSHA and EPA requirements.\n\nUsing the methodology in Appendix E of the EPA?s General Risk Management Program Guidance document and the EPA?s RMP*Comp computer program, the maximum distances to the ?endpoint? specified for anhydrous ammonia were calculated for both scenarios and reported to the EPA.  The chemical-specific endpoints, established for release scenarios by the EPA, provide conservative estimates of the distances that a chemical could possibly travel in the event of an accidental release meeting the EPA?s specified criteria. \n\n\nAccidental Release Prevention Program\n\nTo prevent, detect, and mitigate accidental releases of anhydrous ammonia, Sandridge has implemented several precautionary measures including process and equipment controls, operating procedures, preventive maintenance programs, employee training, and audit programs.  In addition, the ammonia refrigeration system was designed and constructed in accordance with recognized industry codes and standards and good engineering practices. \n\nSandridge has also developed and implemented a Process Safety Management (PSM) program pursuant to OSHA regulations and as such, has evaluated the refrigeration system for the potential to release anhydrous ammonia.  Some of the controls installed to prevent, detect, or mitigate catastrophic releases of ammonia include process equipment (pressure relief valves, check valves, backup pumps, and manual shutoffs), process alarms, and automated controls (automatic shutoffs, microprocessor control, ammonia leak detection systems, and electrical distribution system grounding). \n\nSandridge has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system.  These procedures incorporate safety measures to prevent employee injury, equipme"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41813,
      "SummaryText": "nt damage, and accidental releases.  The procedures were developed by a team consisting of personnel from operations and maintenance, plant engineering, and Sandridge?s PSM contractor.  Pursuant to written management of change procedures established by Sandridge, any changes to the operating procedures are communicated to affected employees.\n\nSandridge understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore Sandridge has implemented a preventative maintenance program.  The preventative maintenance program is scheduled, documented and managed to ensure that regular maintenance occurs on the system.  In addition, equipment inspections are performed throughout the year to confirm the mechanical integrity of critical refrigeration system components.\n\nTo ensure that the control measures at Sandridge are effective in maintaining the safe operation of the ammonia refrigeration system and other plant equipment, periodic audits are performed as follows:\n\nIn accordance with the plant?s PSM program, Sandridge conducts process safety compliance audits every three years.  Each audit incorporates a review of process safety information, process hazards analyses, operating procedures, training programs, system mechanical integrity, management of change, pre-start up safety review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and the contractor safety management program.\n\nIn addition, the facilities and/or records of Sandridge are inspected and audited by the following:\n\n? The City of Medina Fire Department\n\n? The Ohio State Department of Agriculture\n\n? The United States Department of Agriculture\n\n? The United States Food and Drug Administration \n\nSandridge?s insurance carrier also conducts independent loss prevention audits every year.\n\n\nEmergency Response Program\n\nThe Sandridge plant is included in the written comm"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41813,
      "SummaryText": "unity emergency response plan developed by the Medina County Local Emergency Planning Commission ( Medina County LEPC).  In addition, Sandridge has developed an emergency action program designed to protect both employees and the community in the event of an ammonia release, fire, or other emergency.  This program is fully described in a document entitled, ?SANDRIDGE FOOD CORPORATION ? EMERGENCY AND FIRE EVACUATION PROCEDURES?.  Included in the document are measures to be taken by Sandridge including emergency notifications, on-site and off-site coordination, ammonia release procedures, and evacuation procedures. \n\nTo ensure that local government response agencies are familiar with Sandridge?s facility and their emergency procedures, facility tours have been conducted with the following local agencies: \n\n? City of Medina Fire Department\n\n? Medina County Local Emergency Planning Commission\n\nThe Sandridge facility is located in an industrial park outside the City of Medina and as a result, there are very few residential, community, and environmental receptors in the area.  However, in the event of an ammonia release with the potential for off-site effects, the City of Medina Fire Department and the Medina County Local Emergency Planning Commission will be notified immediately.  Any notifications and/or instructions to the general public shall be made by these agencies and may include the following methods of communication:\n\n? Police and fire vehicles equipped with public address systems;\n\n? Door-to-door notification of residents; and,\n\n? Broadcast messages via the Medina County Emergency Broadcast System, if necessary.\n\n\nContinuing Efforts to Improve Safety\n\nAs part of Sandridge?s continuous efforts to optimize the performance and safe operation of the ammonia refrigeration system, several changes have been made at the facility since the last Risk Management Plan submittal.  Many of these changes have been implemented to improve safety and further minimize the potentia"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 41813,
      "SummaryText": "l for accidental releases of ammonia.  These changes include process equipment and piping upgrades, the installation of additional ammonia detection equipment throughout the plant, and the installation of a new computer-based control system to monitor and control all refrigeration system operating parameters."
    }
  ]
}