{
  "FacilityID": 41828,
  "FacilityName": "Elkhart N. Main St Well Field WaterTreatment Plant",
  "FacilityStr1": "929 N. Main Street",
  "FacilityStr2": "NA",
  "FacilityCity": "Elkhart",
  "FacilityState": "IN",
  "FacilityZipCode": "46516",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18039",
  "LEPC": "Elkhart County LEPC",
  "FacilityLatDecDegs": "41.696389",
  "FacilityLongDecDegs": "-085.976944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "NA",
  "Company2Name": "NA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Elkhart Public Works Depart",
  "OperatorStr1": "1201 S. Nappanee Street",
  "OperatorStr2": "NA",
  "OperatorCity": "Elkhart",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46516",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "3215",
  "EPAFacilityID": "100000052033",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-01-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-01-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-01-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.4",
  "FRS_Lat": 41.696389,
  "FRS_Long": -85.979161,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60089,
      "AltID": "Drinking Water Disinfect.",
      "FacilityID": 41828,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 79462,
          "ProcessID": 60089,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61479,
          "ProcessID": 60089,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 34838,
              "Process_NAICS_ID": 61479,
              "SafetyReviewDate": "2004-04-22 00:00:00",
              "PHA_Date": "2004-11-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-10 00:00:00",
              "TrainingReviewDate": "2004-03-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-17 00:00:00",
              "EquipmentTested": "System valves,vents,detectors,chlorinators,evaporators,gauges, and piping",
              "ChangeMgmtDate": "2004-04-22 00:00:00",
              "ChangeMgmtReviewDate": "2004-04-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-03-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 50720,
                  "PreventionProgram3ID": 34838,
                  "ProcessChemicalID": 79462
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 41828,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2005-04-01 00:00:00",
    "CoordinatingAgencyName": "Elkhart Fire Department",
    "CoordinatingAgencyPhone": "5742938931",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41828,
      "SummaryText": "RISK MANAGEMENT PLAN\nCity of Elkhart\n\nNorth Main Street Water Supply & Treatment Plant\n\nChlorine \n\nExecutive Summary\n\nDecember, 2004\n\nSource and Process Description\nThe City of Elkhart's North Main Street Water Supply and Treatment Plant utilizes one regulated substance in its treatment processes:  chlorine.  This substance comprises the disinfection process for the treated water discharged from the plant into the Elkhart public water distribution system.   Chlorine gas is injected into the treated effluent to destroy residual living organisms that may include potentially pathogenic microbes, as well as provide a residual throughout the distribution system.  The oxidative power of the chlorine attacks organic formations and destabilizes their structures in very short periods of time, rendering the effluent acceptable from a water quality standpoint.  \nAt the plant site, the maximum quantity of chlorine gas that is stored at any given time is 4,000 pounds.  The substance is stored in 2,000-lbs pressurized vessels.  The EPA's guidelines for threshold quantities that must be regulated are 2,500 lbs.  Therefore, the Risk Management Plan for the City of Elkhart North Main Street (NMS) Water Supply and Treatment Plant is based on this regulated substance.\n\nSummary of Major Hazards\nThe hazard with chlorine is the potential toxicity the substance can create in our environment if a significant quantity were accidentally released.  This is especially critical because of the significant toxic effects on humans in the event of a catastrophic release.  This Risk Management Plan examines a set of scenarios that evaluate the overall impacts to our community if such a catastrophic release were ever to occur. This is done using a technique to model the event and assess the impact.  The result is a circle of influence that centers at the NMS site and extends over the surrounding, adjacent community.  The area of the circle created from this radius is known as the zone of vulnerabil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41828,
      "SummaryText": "0.29 miles\n                                Alt. Case II - Cl2                8,700                   0.88 miles\n\n                              1 Population estimates based on projections from 1990 census data to 1997.\n                              2 Results based on ALOHA air advection model, as approved by the USEPA.\n  \nIt should be noted that the population numbers within a particular vulnerability zone would not all be affected in any given event because plume propagation and coverage is dependent on wind direction.  The values shown consider the entire zone without consideration of wind direction.  Within the vulnerability zone for the worst case scenario are 148 sensitive public receptors affected, which include public centers such as schools, healthcare centers, etc., multifamily residential facilities, sensitive commercial and industrial areas, and public parks.\nThe offsite consequence analysis also examines alternative scenarios, ones which may be more likely to occur due to normal operating conditions.  These release scenarios, though typically minor in comparison to catastrophic events, can nevertheless, create offsite impacts.  A key to analyzing these impacts is taking into account active or passive mitigation of the release event due to in-place preventive measures that reduce the impact of the release.  An example of this would be containment of the release within the building which houses the chemical.  The USEPA has developed through its modeling research that containment can reduce the offsite impact by 55 percent.  \nIn modeling the alternative release scenarios for the City of Elkhart's RMP, the model was executed in two steps.  First, the actual release within the containment building was modeled.  Then, an iterative set of runs were made to account for the mitigation factor to establish the maximum average sustained rate of release for areas outside the building that create the offsite impact.  It is from this second, iterative solution"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41828,
      "SummaryText": "that the offsite consequences can be analyzed.  Details of the modeling process are described in the RMP. \n\nHow Releases are Prevented\nIn order to minimize the risk of a catastrophic release or releases of lower magnitude, a prevention plan is in place.  Prevention involves incorporation of structural elements to passively mitigate the impacts of a release.  For the NMS water supply and treatment facility, the chlorine facility operations is enclosed in a building designed for containment of a release.  Secondly, the system components responsible for delivering the gas safely into the plant stream are monitored daily and fully maintained annually.  Thirdly, automated gas sensors are in each facility designed to detect the presence of the gases at very low levels of 1 part per million (ppm), resulting in immediate notification alarms to plant operators at the source facility and in remote locations throughout the site.  These sensors are held to strict, regular preventive maintenance schedules for calibration and sensitivity.  Fourthly, the staff responsible for operating these gas systems undergo extensive training annually on the handling of these substances and on their standard operational procedures.  Finally, the Material Safety Data Sheets are on file at each location where there is a regulated substance which give information on safe handling and emergency responses to accidents involving those substances. \n\n\nAdditional Steps Taken to Address Hazards\nSteps are continuing to further improve the prevention of a release either minimal or catastrophic.  Beyond the passive mitigation measures and the sensing systems already in place as described above, additional site infrastructure elements and best management practices are under development and implementation.  With respect to infrastructure, operational facilities are being renovated to accommodate greater space for operators to move and work and carry out their duties, and installation of additional on-line s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41828,
      "SummaryText": "ity.  Because chlorine gas is heavier than air, its plume will follow the ground in dense clouds in the direction of the prevailing wind.  The dispersion of the plume is influenced by barometric pressure, ambient temperature, and relative humidity at the time of the event, with the summer season being most critical.  The area covered by the dense plume within the zone of vulnerability is known as the hazard zone.\nTwo conditions are examined: a worst-case scenario, and an alternative case scenario.  In the former case, the release is catastrophic in that the container in which the substance is stored is completely ruptured, releasing all of its contents into the immediate atmosphere over a relatively short duration of time.  For this situation, the model takes into account the worst-case atmospheric conditions that may be possible to heighten the extent of the impact to its maximum level.  \nFor the alternative case scenario, the model evaluates releases substantially less than worst-case catastrophes.  These occurrences are those which may be plausible within the normal day-to-day operations and maintenance activities, such as a leak in a feed line, or rupture of a gas container valve.  These scenarios show significantly reduced release quantities and rates and take into account local mitigative efforts such as containment facilities.\n\nConsequences of Failure to Control the Hazards\nThe results of the modeling work indicate that a catastrophic release from the chlorine vessel will result in a zone of vulnerability which extends 3.2 miles from the plant site.  The table below summarizes the modeling results.\n\n                                                    Potentially Affected Populations 1\n\n                               Scenario/Chemical             NMS          Radius of Vulnerability 2\n                                Worst Case - Cl2             51,740                  3.20 miles\n                                Alt. Case I - Cl2                 1,165"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41828,
      "SummaryText": "ensing systems that link to the site's Supervisory Control And Data Acquisition (SCADA) system for improved monitoring of the operational environment.  Managerially, efforts are in place to phase out use of older pressure vessels in normal operations, improve documented training activities, and work at ways to reduce the amount of substance inventory held at the site without jeopardizing compliance with regulatory standards.\n\nResponse Action in the Event of a Release\nThe Elkhart North Main Street Water Supply and Treatment facility has always, and will continue to practice the policy that employees WILL NOT respond to accidental releases.  All on-site training is geared to support the activities, policies and response procedures of the City of Elkhart's Hazardous Material Response Team, and all the components that make up the Community Emergency Response Plan (CERP), coordinated through the Local Emergency Planning Committee (LEPC).  In order to effectively carry out this policy, a simple set of communication alert procedures and protocols are in place and posted throughout the site.  These procedures include entities for notification in the case of an emergency in order or immediate priority, and procedures for handling injuries of personnel resulting from the release.  The person ultimately responsible for the safety of the handling of these materials on-site is the plant manager.\n\nFive Year Accidental Release History\nThere have been no release incidents at this facility in past five years."
    }
  ]
}