{
  "FacilityID": 41868,
  "FacilityName": "Lower Smith River Waste Water Treatment Plant",
  "FacilityStr1": "1780 Beckham Church Road",
  "FacilityStr2": null,
  "FacilityCity": "Axton",
  "FacilityState": "VA",
  "FacilityZipCode": "24054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51089",
  "LEPC": "Martinsville Joint LEPC",
  "FacilityLatDecDegs": "36.620990",
  "FacilityLongDecDegs": "-079.826470",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Henry County Public Service Authority",
  "Company2Name": null,
  "CompanyDUNS": 198279549,
  "Company2DUNS": 0,
  "OperatorName": "Michael Ward",
  "OperatorStr1": "3300 Kings Mountain Road",
  "OperatorStr2": "PO Box 7",
  "OperatorCity": "Collinsville",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24078",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Ward",
  "RMPTitle": "Director of Regulatory Compliance",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133768",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-04-02 00:00:00",
  "SafetyInspectionBy": "Woodard & Curran",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-01-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2005-02-01 00:00:00",
  "AnniversaryDate": "2010-01-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 36.62199,
  "FRS_Long": -79.81859,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60152,
      "AltID": "chlorine",
      "FacilityID": 41868,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61543,
          "ProcessID": 60152,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79537,
          "ProcessID": 60152,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 79538,
          "ProcessID": 60152,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579537,
          "ProcessID": 60152,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579538,
          "ProcessID": 60152,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 60153,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 41868,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61544,
          "ProcessID": 60153,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79539,
          "ProcessID": 60153,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579539,
          "ProcessID": 60153,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41868,
      "SummaryText": "Lower Smith River Waste Water Treatment Plant\nRisk Management Plan\n(RMP)\nExecutive Summary\n\nFacility Background\n\nThe Henry County Public Service Authority (PSA) in Henry County Virginia owns the Lower Smith River Waste Water Treatment Plant (LSRWWTP). The Facility?s mission is to protect public health by treating and disposing of residential and commercial wastewater. \n\nChlorine is used for disinfection and a maximum of 10,000 pounds is stored on-site. Sulfur dioxide is used to dechlorinate wastewater effluent prior to disposal. A maximum of 6,000 pounds of sulfur dioxide is stored on-site. Both chlorine and sulfur dioxide are stored as a gas that is liquefied under pressure in containers (1 ton cylinders) that contain 2,000 pounds each\n\nChlorine and Process Safety Equipment\n\nThe following paragraph provides a brief narrative of the LSRWWTP?s chlorine system. The LSRWWTP has one chlorine system that serves as the disinfection system which provides a chlorine solution to application points within the treatment process. Although the disinfection system is equipped with evaporators, they are not currently used. Only gas chlorine is utilized for disinfection which employs Vacuum Regulator ? Check Units (VRCU). The VRCUs are used to reduce the pressure of the chlorine to a slight vacuum. A vacuum created as water flows through ejectors pulls the chlorine gas from the VRCUs through the chlorinators and into the ejector assemblies. At the ejectors, chlorine gas is mixed with water to form a dilute chlorine solution. The chlorine solution is then distributed to the various application points. The flow rate of chlorine gas is controlled for each application point by adjustment of the respective chlorinator located just upstream of each ejector assembly. \n\nSulfur Dioxide Process and Safety Equipment\n\nThe following paragraph provides a brief narrative summary of the LSRWWTP?s  sulfur dioxide system. The LSRWWTP has a complete vacuum system that feeds sulfur dioxide gas through"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41868,
      "SummaryText": " vacuum regulator-check units (VRCUs) mounted on ton containers. The vacuum gas system utilizes pressurized sulfur dioxide gas (approximately 130 psig) from the container passing through the VRCU where it is reduced to a slight vacuum. A vacuum, created as water flows into the ejectors, pulls the sulfur dioxide gas from the VRCUs, through the sulfonators and into the ejector assemblies. At the ejectors, sulfur dioxide gas is mixed with water to form a dilute sulfur dioxide solution. The solution is then distributed to various application points. \n\nThe complete vacuum system is inherently safe by design since most of the system components are under vacuum. Any break or damage to a vacuum component will allow air into the system but will not cause a chemical leak. The ton containers, which are under positive pressure, are the only system component where a leak could occur. In the unlikely event of a chlorine or sulfur dioxide leak, a leak detector located in the chemical container storage area will activate alarm horns throughout the facility. If the leak detector is activated, LSRWWTP staff will implement the facility?s emergency response system. \n\nRisk Management  and Process Safety Management Program Overview\n\nChlorine and sulfur dioxide are subject to the Environmental Protection Agency?s (EPA?s) Risk Management Program (RMP) regulation which can be found in 40 CFR 68 and the Occupational Safety and Health Administration?s (OSHA?s) Process Safety Management Program (PSMP) regulation which can be found in 29 CFR 1910.119.\n\nThe primary components of the RMP are as follows:\n\n? A five-year accident history\n? An off-site consequence analysis for a worst-case and alternative case scenario\n? A comprehensive prevention program to minimize risks (i.e. minimize the potential for a release)\n? An emergency response program to ensure that an accidental release is handled appropriately\n? An overall management program to supervise the implementation of the RMP\n\nThe following sec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41868,
      "SummaryText": "tions briefly summarize the elements of the LSRWWTP?s RMP.\n\n\nFive-Year Accident history\n\nIn the last five years, the LSRWWTP has had no accidental releases which were required to be reported under the RMP regulation.\n\nWorst-Case Scenario\n\nThe worst case release scenario for a toxic gas has been defined by the EPA to be an accidental release in which the largest on-site vessel releases its contents over ten minutes. Since the largest container stored at the facility holds 2,000 pounds of chlorine or sulfur dioxide, the worst case scenario for each chemical is a release of the entire 2,000 pounds over 10 minutes. \n\nAlternative Release Scenario\n\nThe alternative release is a ?more likely? incident than the worst-case. The RMP regulation allows the owner to define the alternative release scenario based on historical experience or operations staff knowledge of their system. The alternative release scenario for the facility was to assume that the vacuum regulator mounted on the chemical container gas valve failed.\n\nPrevention Program\n\nThere are always inherent risks associated with the handling and use of chlorine and sulfur dioxide. These risks include the potential inhalation of either chemical if it is accidentally released. The prevention program is a key component to reducing the risk associated with a potential chlorine or sulfur dioxide gas release. Key elements of the prevention program include:\n\n? Employee participation\n? Process safety information\n? Process hazard analysis\n? Incident investigation\n? Operating procedures\n? Mechanical integrity\n? Management of change\n? Pre-startup review\n? Training\n? Contractors\n? Compliance audits\n? Hot work permits\n? Trade secrets\n\nThe following briefly states the benefits of the following key prevention program elements: standard operating procedures, mechanical integrity, employee training and the process hazard analysis.\n\nThe facility staff has developed up-to-date and accurate written standard operating procedures (SOP's) to "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41868,
      "SummaryText": "ensure that operators have clear instructions for safe operation of the gas systems. Effective SOP's, when combined with operator training, are instrumental in ensuring safe operation of the system and in preventing accidental releases.\n\nThe purpose of the mechanical integrity program is to ensure the continued integrity of the process equipment. An effective mechanical integrity program is integral in preventing accidental releases that may result from mechanical failure of improperly maintained equipment. The LSRWWTP?s mechanical integrity program includes maintenance, inspection, and testing procedures and schedules along with maintenance personnel training.\n\nKnowledgeable well-trained personnel are essential to preventing and mitigating the effects of accidental chemical releases. The LSRWWTP?s training program ensures that personnel working on or near the chlorine or sulfur dioxide system are adequately trained in operation and maintenance procedures and the appropriate response actions to an accidental release. \n\nThe process hazard analysis is a valuable risk reduction tool that outlines deficiencies in equipment and procedures, identifies potential system failure modes, and provides recommendations for system and operational improvements. \n\nEmergency Response Program\n\nA comprehensive emergency response program has been prepared which outlines the procedures and lines of communication that are necessary to effectively respond to and mitigate a potential chemical gas release. \n\nIn the event of a chlorine or sulfur dioxide gas release a detector located in the storage area will detect the presence of the chemical. The detector will activate audible alarms throughout the facility to give warning to plant staff. The facility emergency response program includes procedures for notifying local hazardous materials (hazmat) teams of the incident and procedures for evacuating the facility. Facility staff have coordinated with the local hazmat team and fire department to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41868,
      "SummaryText": " ensure they are fully trained and equipped to quickly respond to an incident."
    }
  ]
}