{
  "FacilityID": 41888,
  "FacilityName": "RMAX Inc.",
  "FacilityStr1": "13524 Welch Road",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75244",
  "Facility4DigitZipExt": "5227",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.930556",
  "FacilityLongDecDegs": "-096.831944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "NW",
  "FacilityURL": "www.rmaxinc.com",
  "FacilityEmailAddress": "vhanlon@rmaxinc.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "HC Industries",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HC Industries dba RMAX Inc.",
  "OperatorStr1": "13524 Welch Road",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75244",
  "OperatorZipCodeExt": "5227",
  "RMPContact": "Vince Hanlon",
  "RMPTitle": "Plant Manager",
  "FTE": 31,
  "OtherEPAFacilityID": "75244RMXNC13524",
  "EPAFacilityID": "100000179111",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Revised RMP Nov 2004",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-01-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-01-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 32.93124,
  "FRS_Long": -96.83037,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60177,
      "AltID": "Pentane",
      "FacilityID": 41888,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61569,
          "ProcessID": 60177,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79581,
          "ProcessID": 60177,
          "ChemicalID": 125,
          "Quantity": 66470.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579581,
          "ProcessID": 60177,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41888,
      "SummaryText": "RMAX,Incorporated\nDallas Operations\n13524 Welch Road, Dallas, Texas, 75244\nRMP Executive Summary - Revised November 2004\n\nAccidental Release Prevention & Emergency Response Policies\n\nRMAX Inc.?s management, at both the plant and corporate level, is extremely committed to the safety and health of its employees, contractors, and visitors, and to minimizing to the greatest extent practicable the potential for releases which may adversely affect the environment. This commitment is a critical element of the facility?s RMP/PSM Plan. It will extend not only through the initial development of the plan, but will endeavor to incorporate the practices and procedures established by this plan into the facility?s normal way of conducting day-to-day business. RMAX has established a management system to oversee the development, implementation, and successful continuing implementation of its RMP/PSM Plan. The goals of this system are:\n\n?Clarify the roles and responsibilities related to process safety issues at the facility;\n?Avoid problems or conflicts among the various people responsible for implementing elements of the risk management plan;\n?Avoid confusion and allow those responsible for implementation to work together as a team;\n?Ensure that the program elements are integrated into an ongoing approach to identifying hazards and managing risks; and\n?Ensure effective communication about process changes\n?Provide full compliance to all regulatory requirements.\n\nThe overall implementation of the RMP/PSM Plan is the responsibility of the Plant Manager. Under this plan, it is his duty to ensure all elements are ultimately implemented as described. Although other employees will have key roles in the RMP/PSM Plan, the Plant Manager assumes this overall responsibility.\n\nIt is in the best interest of RMAX and it?s employees to continually evaluate potential safety issues. Should any employee find any area or practice to be a potential safety hazard, let your supervisor know. Do not wait fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41888,
      "SummaryText": "r someone to have an accident before we make the change.\n\nPolicy: We will not compromise safety for convenience, efficiency, or for any other reason. Entry to confined spaces will be permitted only after proper training has been conducted.   Our employees are not permitted to enter a bulk chemical tank. \nIt is also our policy to prevent chemical spills by maintaining our chemical handling equipment, chemical storage tanks, chemical transfer lines, and containment walls, in excellent condition. \n\nPolicy: In the case of a Major Chemical Spill our employees will immediately evacuate the facility. Our employees will not attempt to assist in the clean-up of a major chemical spill. In the unlikely event the containment wall fails to restrict a chemical spill. RMAX certified HAZMAT technicians may be asked to place absorbent barriers in the flow path of the spilled chemical. However, RMAX employees will not be asked to make contact with hazardous spilled chemicals.       \n \nFacility & Regulated Substances Handled\n\nRMAX, Dallas Operations manufactures polyisocyanurate foam insulating board (foam board). The facility operates under the North American Industrial Classification System (NAICS) Code 32615 (Urethane and other foam (except polystyrene) manufacturing). The foam board produced at the facility is used in both residential and commercial construction applications. RMAX produces foam board in thickness ranging from ? inch to 4.5 inches.\n\nRMAX uses three main raw materials in the production of foam board: Methylenebis Di-Phenylisocyanate (MDI), Polyol, and Blowing Agent(s). The Blowing Agent can be either a hydrochlorofluorocarbon (A Mixture of HCFC 141b or 245FA and R 22) or a Hydrocarbon Blowing Agent (typically a blend of N-Pentane, Cyclopentane and Isopentane ranging in percentages (by weight) of 80/20 to 60/40 (as any combination of N-Pentane/Cyclopentane/Isopentane). Several catalysts and fire retardants may also be used depending upon the type of foam board being "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41888,
      "SummaryText": "produced. MDI is considered as part ?A? and Polyol combined with catalyst and surfactants are considered as a part ?B?.   \n\nThe main raw materials are all liquids and are stored on-site in bulk tanks sized at 12,000 gallons. The liquids flow through a series of tanks, static mixers and high-pressure pumps towards the pour table. At the pour table, parts ?A? and ?B? are combined together and injected between the top and bottom facers. RMAX uses several different types of facers, depending upon the type of foam board being produced. Once parts ?A? and ?B? are combined the liquids exothermically react to form solid foam. \nN-Pentane (CAS No: 109-66-0), which may be present in combination with Isopentane as an integral component of the Hydrocarbon Blowing Agent used by RMAX, is a substance regulated by 40 CFR 68 [EPA?s Chemical Accident Prevention Provisions]. Taking into account ? 68.115(b)(2)(i), RMAX has determined the total quantity of N-Pentane in its foam board manufacturing process (for purposes of a threshold quantity determination) to be the total amount of the Hydrocarbon Blowing Agent (N-Pentane/Cyclopentane/Isopentane Blend) present in its process at any one time. The maximum amount present in RMAX??s foam board manufacturing process at any one time is approximately 66,470 pounds. This is above the threshold quantity for N-Pentane of 10,000 pounds, as established in ? 68.130. Therefore, RMAX has determined that the Dallas facility is subject to the requirements of 40 CFR 68 for N-Pentane. \n\nRMAX has defined its covered process as that equipment which contains or contacts the Hydrocarbon Blowing Agent starting at the bulk storage tank loading (or fill) connection and extending up to and including the mix heads (located at the Pour Table). This determination was made based on the fact that once the Blowing Agent is mixed with the other foam components; it is no longer a liquid and is part of a solid, non-flammable product.). Thus, the blowing agent is flammable"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41888,
      "SummaryText": " according to the definition as contained in ? 1910.1200(c). As stated in Section 1.2, RMAX Dallas Operation?s may have up to 66,470 pounds of Hydrocarbon Blowing Agent present in its process at any one time. This is above the applicability quantity for a flammable liquid of 10,000 pounds, as established in ? 1910.119(a)(1)(ii). Thus, RMAX has determined its Dallas, Texas facility is subject to the requirements of 29 CFR 1910.119.\n\nThrough preparation of this Risk Management Program / Process Safety Management Program (RMP/PSM), RMAX has determined that its Dallas Operations is a Program 3 process as defined by 40 CFR 68.10(d). This determination is based on the results of the worst-case release scenario for N-Pentane (the location of public receptors being within the distance to the endpoint) presented in Section 3.0, and the applicability of 29 CFR 1910.119 to its facility. Thus RMAX has complied with the requirements for preparation and submittal of a Program 3 RMP as contained in 40 CFR 68.\n\nWorst Case and Alternate Release Scenarios\n\nIn order to calculate the distance to the endpoint from a worst case release of Blowing Agent (N-Pentane/Cyclopentane/Isopentane Blend), the EPA automated program RMPComp v. 1.07 was used to perform the off site consequence analysis. The program provided a conservative estimate for the distance to an endpoint of 1.0 psi overpressure. The quantity of N-Pentane used in the worst case release scenario analysis for RMAX?s Dallas, Texas facility has been determined to be the amount of Blowing Agent contained in the facility?s on-site bulk storage tank. In accordance with 40 CFR 68.25(e), for purposes of calculating the distance to the worst case release endpoint, RMAX has assumed that the entire contents of the single largest vessel containing Blowing Agent (66,470 pounds) is released as a vapor, which finds an ignition source, and that 10% of the released quantity participates in the resulting explosion. \n\nRMAX has determined the maxim"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 41888,
      "SummaryText": "um threat distance to an endpoint of 1.0 psi overpressure using RMPComp is 0.3 miles for a release quantity of 66,470 pounds of Blowing Agent. However, ALOHA predicted a total maximum threat zone of 1.0 mile. The more conservative ALOHA distance was used to evaluate potential impact. Using RMAX?s Latitude/Longitude as a center point, it is estimated that the maximum residential population within 1.0 mile of RMAX is 1209 persons. Based on visual reconnaissance, the population density within the affected area will be toward the northeast edge. The remainder of the affected area is occupied by industrial and commercial properties with no residences. This assumes a uniform population density throughout the block group?s land area within the specified radius. Through a review of local street maps and by visual observations of the area surrounding its facility, RMAX has identified several types of public receptors within the distance to the endpoint from a worst case release. These types of receptors include: commercial, industrial, and retail facilities. RMAX has determined, through examination of the Addison USGS 7.5 Minute Topographic Quadrangle Map, that there are no environmental receptors located within the 1.0 mile distance to the Level 3 (Yellow LOC) end point from a worst case release from its facility. \n\nModeling of the worst case release scenario was conducted using the EPA Program ALOHA v. 5.3.1. The output of the ALOHA model is summarized at the end of Section 3.0. Meteorological data used for the modeling was taken from available information of the National Weather Service for the DFW area, and manually input into the program. The Worst Case Release Scenario Plot Plan for the RMAX Dallas facility (Figure 1) is at the end of Section 3.0. The figure shows RMAX?s location as well as the distance to the endpoint from a worst case release. The plot map footprint was generated from ALOHA using MARPLOT v. 3.3.1. A detailed release footprint overlay was created usin"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 41888,
      "SummaryText": "g the Addison USGS 7.5 Minute Topographic Quadrangle Map.\n\nRMAX has identified two (2) possibilities for the release of Blowing Agent that are more likely to occur than the release described as the worst case release scenario in Section 3.0. These possibilities are:\n\n1.Transfer Hose Release of Blowing Agent (During tanker truck unloading); and\n2.Process Piping Release of Blowing Agent (Shear of piping within the building by forklift).\n\nA Transfer Hose Release of Blowing Agent (occurring during truck unloading) is referred to as Alternative Release Scenario # 1 while a Process Piping Release of Blowing Agent (occurring inside of the manufacturing building) is referred to as Alternative Release Scenario # 2. RMAX has determined, based on the physical properties of the Blowing Agent, a release from either a transfer hose or from process piping would result in the release/spill of a flammable liquid. The evaporation rate and boiling point of the Blowing Agent are such that any spill would probably result in the formation of a pool of flammable liquid. Thus, in evaluating the consequences of a Transfer Hose Release and a Process Piping Release, RMAX has chosen to evaluate the potential radiant heat effects of a pool fire for each type of release.\n\nIn order to determine the effects of each Alternative Release Scenario, the following methodology has been used:\n\n(1)Determination of a release quantity and duration of Blowing Agent for each Alternative Release Scenario (Described in Sections 4.2 and 4.3).\n\n(2)Calculation of the maximum area of the pool of spilled Blowing Agent (at a depth of one centimeter) for each Alternative Release Scenario. This has been done using the EPA?s ALOHA program software. \n\n(3)Calculation of the distance from (the center) of the pool to the radiant heat endpoint of 5 kilowatts per square meter [as specified in 40 CFR 68.22(a)(2)(ii)]. This radiant heat level could cause second degree burns from a 40-second exposure. This distance has been calcu"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 41888,
      "SummaryText": "lated for a level of concern (LOC) equivalent to the TLV-TWA of n-pentane using RMPComp and the ALOHA programs.\n\nIt should be noted that there were differences in the predicted release amounts from the two programs. The AHOHA program gave the more conservative results, and were selected for incorporation into the RMP. \n\nThe quantity of Blowing Agent that may be spilled during a Transfer Hose Release has been estimated based on the following assumptions:\n\n?A complete disconnect of the transfer hose (either from the truck connection or from the fixed piping connection bulkhead) occurs; and\n?Blowing Agent continues to be discharged from the truck for 10 minutes.\n\nThe release was modeled by the ALOHA program as a leak from a short pipe or valve in a horizontal cylindrical tank. The chemical escapes as a liquid to form an evaporating puddle. Based on the tank volume and input parameters at prevailing weather conditions for the area, the ALOHA model predicted the following release characteristics and duration:\n\nEstimated release duration = 1 hour\nMaximum average sustained release rate  = 388 lbs/ min\nTotal Amount released = 20,849 lbs\n\nThe quantity of Blowing Agent that may be spilled during a Process Piping Release has been estimated based on the following assumptions:\n\n?A complete break of the process piping (between the transfer pump and the high pressure injection pumps) occurs; and\n?Blowing Agent is discharged from the piping (at the maximum pumping rate) for 10 minutes.\n\nIn order to calculate the distance to the endpoint of a pool fire resulting from a Transfer Hose Release, release scenario data outlined in Section 4.1 was input into RMPComp. The program estimated a distance of 0.3 miles to the heat radiation endpoint at 5 kilowatts/sq meter. The release footprint was calculated for a level of concern (LOC) equivalent to the TLV-TWA of n-pentane using RMPComp and the ALOHA programs. Because of the effects of adjacent buildings and flat topography (so-called ?near-f"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 41888,
      "SummaryText": "ield patchiness?) using the ALOHA model?s urban terrain mode, release dispersion predictions for short distances are considered highly variable. A maximum threat zone of 78 yards was predicted for this scenario. The output of the RMPComp and ALOHA programs are found at the end of Section 4.0 Although ALOHA and MARPLOT did not produce a drawn footprint for this release scenario, an estimated release footprint overlay was created using the Addison USGS 7.5 Minute Topographic Quadrangle Map. The estimated boundaries of the footprint were presumed to be within 250 ft of the release point at the tank. \n\nNote: The most likely location of a process piping release would be within the manufacturing building. However, in order to provide a more conservative estimate of the distance to the specified endpoint of a pool fire, RMAX has assumed its building would have no mitigating effects on the consequences of such a fire.\n\nUsing RMAX?s Latitude/Longitude as a center point, the estimated residential population within 0.3 miles of RMAX is less than 2 persons. Through a review of local street maps and by visual observations of the area surrounding its facility, RMAX has identified several types of public receptors within the 0.3 mile distance to the endpoint from a Transfer Hose Release (Alternative Release Scenario #1). These types of receptors include commercial and industrial facilities. RMAX has determined through examination of the Addison, Texas 1959 (photorevised 1989) USGS 7.5 Minute Topographic Quadrangle Map that there are no environmental receptors located within the 0.3 mile distance from the facility to the endpoint from Alternative Release Scenario #1.\n\nIn order to calculate the distance to the endpoint of a pool fire resulting from a Process Piping Release, release scenario data outlined in Section 4.1 was input into RMPComp. The program estimated a distance of 0.05 miles to the heat radiation endpoint at 5 kilowatts/sq meter. The release footprint was calculated fo"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 41888,
      "SummaryText": "r a level of concern (LOC) equivalent to the TLV-TWA of n-pentane using RMPComp and the ALOHA programs. Because of the effects of adjacent buildings and flat topography (so-called ?near-field patchiness?) using the ALOHA model?s urban terrain mode, release dispersion predictions for short distances are considered highly variable. A maximum threat zone of 87 yards was predicted for this scenario. The output of the RMPComp and ALOHA programs are found at the end of Section 4.0 Although ALOHA and MARPLOT did not produce a drawn footprint for this release scenario, an estimated release footprint overlay was created using the Addison USGS 7.5 Minute Topographic Quadrangle Map. The estimated boundaries of the footprint were presumed to be within 265 ft of the release point at the tank.\n\nUsing RMAX?s Latitude/Longitude as a center point, the estimated residential population within 0.05 miles of RMAX is 0 persons. Through a review of local street maps and by visual observations of the area surrounding its facility, RMAX has identified the types of public receptors within the distance to the endpoint from a Process Piping Release (Alternative Release Scenario #2). These types of receptors include: industrial facilities.\n\nRMAX has determined through examination of the Addison, Texas 1959 (photorevised 1989) USGS 7.5 Minute Topographic Quadrangle Map that there are no environmental receptors located within the 0.05 mile distance from the facility to the endpoint from Alternative Release Scenario #2."
    }
  ]
}