{
  "FacilityID": 41985,
  "FacilityName": "Tru Vue Inc.",
  "FacilityStr1": "9400 W 55th Street",
  "FacilityStr2": null,
  "FacilityCity": "McCook",
  "FacilityState": "IL",
  "FacilityZipCode": "60525",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.792222",
  "FacilityLongDecDegs": "-087.854722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5116637,
  "ParentCompanyName": "Apogee Enterprises",
  "Company2Name": null,
  "CompanyDUNS": 1962042,
  "Company2DUNS": 0,
  "OperatorName": "Tru Vue Inc.",
  "OperatorStr1": "9400 W 55th Street",
  "OperatorStr2": null,
  "OperatorCity": "McCook",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60525",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Fry",
  "RMPTitle": "Director of Operations",
  "FTE": 204,
  "OtherEPAFacilityID": "60525TRV009400W",
  "EPAFacilityID": "100000167044",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-09-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Acid Etch Process",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-02-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-02-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-02-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-02-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 41.79079,
  "FRS_Long": -87.85574,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60323,
      "AltID": "Acid Etch Process",
      "FacilityID": 41985,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 61722,
          "ProcessID": 60323,
          "NAICSCode": "32721",
          "_desc": {
            "NAICS_CODE": "32721",
            "NAICS_DESCRIPTION": "Glass and Glass Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 79737,
          "ProcessID": 60323,
          "ChemicalID": 55,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 579737,
          "ProcessID": 60323,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 41985,
      "SummaryText": "Introduction\n\nThe Tru Vue Company is committed to operating in a manner that is safe for Tru Vue employees, the public, and the environment. As part of this commitment, Tru Vue has established a system to help ensure safe operation of the hydrofluoric glass etching process at this facility. One component of this program is called the risk management program (RMP) that helps control risks and complies with the requirements of the Environmental Protection Agency?s (EPA?s) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (The RMP Rule). One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at Tru Vue. The plan is intended to satisfy the RMPlan requirements of the RMP Rule (68.150 through 68.185) and to provide the public with a description of the risk management program at Tru Vue.\n\nAccidental Release Prevention and Emergency Policies\n\nTru Vue is committed to the safety of its employees and the public and to the preservation of the environment, through the prevention of accidental releases of hazardous substances. Tru Vue implements process controls to prevent foreseeable releases of hazardous substances. In the event of an accidental release, Tru Vue controls and contains the release in a manner that will be safe for it?s employees and will cause the least degree of exposure and injury to the public or the environment.\n\nTru Vue Facility and Regulated Substances\n\nThe Tru Vue Company processes glass and uses aqueous hydrofluoric acid in its glass etching process. HF acid, at the solution concentration of 50% or greater, is regulated by the RMP Rule, and although HF of lesser concentration (about30%) is used in Tru Vue?s process, HF acid at a solution concentration of 70% is stored in one large tank at the Tru Vue facility and is diluted in the process mixture.\n\nA maximum of 4,700 gallons of 70% HF acid is stored in one 5,000-gallon tank located at the Tru"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 41985,
      "SummaryText": " Vue site. The weight of the HF acid in 4700 gallons of 70% solution is 47,940 lbs. which exceeds the RMP threshold quantity for HF acid in a process (1,000 lb.) Because the HF acid storage process is not covered by the Occupational Safety and Health Administration, process safety management regulation and because the potential exists for the offsite consequences resulting from accidental release of HF the process falls under the RMP process program level 2.\n\n\nAccidental Release Prevention Program and Chemical ? Specific Prevention Steps\n\nSafety Information\n\nTru Vue maintains a Variety of technical documents that are used to help ensure safe operation of the glass etching process. Material Safety Data Sheets document the physical properties of the hazardous substances handled at Tru Vue, including HF Acid. The engineering design documents include design and operation parameters, applicable codes and standards, and configuration of the equipment in the covered process. \n\nHazard Review\n\nTru Vue has completed a Process Hazard Analysis (PHA) using Failure Mode and Effect Analysis (FMEA) of the covered process. All hazards in the process were reviewed and the severity level, of the worst hazards, was reduced through changes to equipment and procedures. Tru Vue continues to work toward improvement of all hazards in the process.\n\nOperating Procedures\n\nTru Vue develops and maintains operating procedures to define how tasks related to process operations should be performed. The operating procedures are used to train employees and contractors and serve as reference guides for normal and emergency operation of the production line. Procedures continue to be updated as better methods and equipment become available.\n\nTraining\n\nTru Vue trains personnel in the operating procedures to help ensure safe and effective performance of their assigned tasks. A training documentation file is maintained to help ensure all employees are trained in procedures that pertain to their jobs and tha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 41985,
      "SummaryText": "t refresher training is provided on a periodic basis.\n\nMaintenance\n\nTru Vue properly maintains the process equipment in accordance with manufacturer?s suggested procedures and Tru Vue?s process requirements. The Tru Vue maintenance program includes procedures to safely guide workers in their maintenance tasks, worker training in the maintenance procedures, and a preventative maintenance program to help identify equipment deterioration and damage before the equipment fails.\n\nCompliance Audits\n\nTru Vue performs periodic compliance audits of the covered process to verify that the process is operating in compliance with the requirements of the RMP rule and within equipment specifications. \n\nIncident Investigations\n\nTru Vue investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment. Tru Vue encourages employees to identify and report any incident requiring investigation. An investigation team will be assembled, and the investigation will be initiated within 48 hours of the incident. The results of the investigation will be documented, recommendations will be resolved and appropriate process enhancements will be implemented.\n\nHF Acid-Specific Prevention Steps\n\nIndustry standards are followed at Tru Vue to help ensure safe handling of the aqueous HF acid. The vendor supplies HF via a Department of Transportation (DOT) approved tank truck and follows DOT standards when offloading the aqueous HF acid. The storage tank design and construction are consistent with American Society of Mechanical Engineers standards. Workers who perform operations involving HF acid receive training emphasizing safe handling procedures for HF acid developed by Tru Vue.\n\nFive-Year Accident History\n\nTru Vue maintains a five-year accident history that fulfills the requirements of the RMP rule (68.42). No releases of regulated substances have occurred from the Tru Vue facility in the last five years that have been of a reportable qua"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 41985,
      "SummaryText": "ntity.\n\nEmergency Response Programs\n\nTru Vue has established a written emergency response plan that complies with the RMP rule and with other federal contingency plan regulations. The plan has been communicated to the local emergency response officials. Regular dialogue is maintained between Tru Vue and the local fire chief, and Tru Vue provides appropriate information to the fire chief. Tru Vue has established a policy that will periodically conduct fire and evacuation drills, including annual drills coordinated with the local fire department.\n\nPlanned Changes to Improve Safety\n\nTru Vue constantly strives to improve the safety of the hydrofluoric etching line through the incident investigation program and audit program mandated in the RMP rule. Also, a program of safety meetings, which includes soliciting safety suggestions from all employees, is in place. The following changes to improve the process are planned or have recently been completed.\n\nTru Vue plans to continue to improve its standard operating procedures on an ongoing basis. Tru Vue also plans to make changes to its waste water processing system within two years. A new 70% storage tank will be installed this year."
    }
  ]
}