{
  "FacilityID": 42123,
  "FacilityName": "Sysco Food Services of Kansas City, Inc.",
  "FacilityStr1": "1915 Kansas City Road",
  "FacilityStr2": null,
  "FacilityCity": "Olathe",
  "FacilityState": "KS",
  "FacilityZipCode": "66051",
  "Facility4DigitZipExt": "0820",
  "FacilityCountyFIPS": "20091",
  "LEPC": "Johnson County LEPC",
  "FacilityLatDecDegs": "38.901333",
  "FacilityLongDecDegs": "-094.787083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.sysco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6966030,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 51099661,
  "Company2DUNS": 0,
  "OperatorName": "Sysco Food Services of Kansas City",
  "OperatorStr1": "1915 Kansas City Road",
  "OperatorStr2": null,
  "OperatorCity": "Olathe",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66051",
  "OperatorZipCodeExt": "0820",
  "FTE": 528,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168203",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-03-10 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Ammonia Refrigeration System",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-02-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-02-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-02-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-02-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 38.9019,
  "FRS_Long": -94.7863,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60486,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 42123,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 79909,
          "ProcessID": 60486,
          "ChemicalID": 56,
          "Quantity": 19200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 61899,
          "ProcessID": 60486,
          "NAICSCode": "42441",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 35044,
              "Process_NAICS_ID": 61899,
              "SafetyReviewDate": "2004-12-01 00:00:00",
              "PHA_Date": "2003-04-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-07-07 00:00:00",
              "TrainingReviewDate": "2004-12-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-02-01 00:00:00",
              "EquipmentInspectionDate": "2005-01-31 00:00:00",
              "EquipmentTested": "#2 Compressor",
              "ChangeMgmtDate": "2003-04-13 00:00:00",
              "ChangeMgmtReviewDate": "2005-02-01 00:00:00",
              "PreStartupReviewDate": "2003-04-11 00:00:00",
              "ComplianceAuditDate": "2005-02-01 00:00:00",
              "AuditCompletionDate": "2005-04-01 00:00:00",
              "IncidentInvestigationDate": "1997-06-02 00:00:00",
              "InvestigationChangeDate": "1997-09-02 00:00:00",
              "ParticipationPlansReviewDate": "2004-08-10 00:00:00",
              "HotWorkPermitReviewDate": "2004-08-10 00:00:00",
              "ContractorSafetyReviewDate": "2004-08-10 00:00:00",
              "ContractorSafetyEvalDate": "2005-01-31 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia Refrigeration System",
              "_chemicals": [
                {
                  "PrimaryKey": 50971,
                  "PreventionProgram3ID": 35044,
                  "ProcessChemicalID": 79909
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42123,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-08-10 00:00:00",
    "ERTrainingDate": "2005-01-31 00:00:00",
    "CoordinatingAgencyName": "Olathe Fire Department",
    "CoordinatingAgencyPhone": "9139716333",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42123,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies:\n\nWe at Sysco Food Services of Kansas City are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the ammonia refrigeration system at our facility.  It is our policy to implement appropriate control measures to prevent possible releases of regulated substances.  Unforseeably, if such a release does occur, our highly trained employees are on hand to control and mitigate the effects of the release.  We are also completely coordinated with the Olathe Fire Department, who provides our emergency response services.\n\n2. The Stationary Source and the Regulated Substances Handled:\n\nWe have one extremely hazardous substance present at our facility that is subject to the Process Safety and Risk Management Planning regulations.  That substance is Ammonia (anhydrous).  The maximum inventory of Ammonia (anhydrous) that is expected to be present at this facility, based upon process and operational requirements is 19,245 pounds.\n\n3. The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\n\nSysco Food Services of Kansas City has taken the following steps as required by 40CFR Part 68 of the EPA.  Our Ammonia (anhydrous) process is subject to the OSHA Process Safety Management standard 29CFR1910.119.  Our facility is also subject to the EPA Emergency Planning and Community Right To Know Act (EPCRA) Section 302 reporting requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our facility:\n\nEmployee Participation:\n\nSysco Food Services of Kansas City believes that process safety management and accident prevention require a team effort.  Company employees and contractors are urged to express their views c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42123,
      "SummaryText": "oncerning accident prevention issues and to recommend improvements for the ammonia refrigeration system.  In addition, our employees have access to all information created as a part of the implementation of the RMP regulation, including information resulting from process hazard analyses, in particular.\n\nProcess Safety Information:\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our ammonia refrigeration process are identified and controlled efficiently and safely.  The methodology used to carry out these analyses is the What-If Checklist.  The studies are completed by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every three years.  Any findings related to the process hazard analyses are addressed in a timely manner.\n\nProcess Hazard Analysis:\n\nSysco Food Services of Kansas City uses the What-If Checklist method of Process Hazard Analysis to identify and correct any issues that can affect the safety and/or mechanical integrity of the ammonia refrigeration system.  A team of personnel representing engineering, construction, operations, safety, management and labor convene at least every 5 years to complete or revise the Process Hazard Analysis.\n\nOperating Procedures:\n\nSysco Food Services of Kansas City maintains written operating procedures.  These procedures address various modes of operation such as initial start-up, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and start-up after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the process.\n\nTraining:\n\nSysco Food Services of Kansas City has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with those processes.  New employees receive basic classroom training in process operations, followed by on-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42123,
      "SummaryText": "the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least annually and more frequently as needed.\n\nContractors:\n\nOn occasion, Sysco Food Services of Kansas City hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance is completed.  Sysco Food Services of Kansas City has a strict policy of informing contractors of known potential hazards related to the contractor's work and the ammonia refrigeration system.  Contractors are also trained regarding the procedures for emergency notification, evacuation and employee accountability, should an accidental release of Ammonia (anhydrous) occur.\n\nPre-Startup Reviews:\n\nPre-startup reviews related to new processes, and to modifications of established processes are conducted as a regular practice at Sysco Food Services of Kansas City.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start-up prior to placing equipment into operation.\n\nMechanical Integrity:\n\nSysco Food Services of Kansas City carries out highly documented maintenance checks on process equipment to ensure proper operation.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with special training in maintenance practices.  Furthermore, personnel who construct, operate or maintain the ammonia refrigeration system are given specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a timely manner.\n\nHot Work Procedures:\n\nProcedures are in place at Sysco Food Services of Kansas City to insure that any hot work performed on or near the ammonia refrigeration system is approved by managemen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42123,
      "SummaryText": "t and safe.  Prior to approving any hot work that could affect the safety and/or mechanical integrity of the ammonia refrigeration system, the area is inspected, fire and emergency equipment is prepared and a fire watch person is in place.  A written hot work permit is issued for all areas of the facility that are not designed as \"designated hot work locations\".  \n\nManagement of Change:\n\nWritten procedures are in place at Sysco Food Services of Kansas City to manage change in process chemicals, technology, equipment and processes.  Process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process operations, are promptly made aware of, and given, training to deal with the modifications.\n\nIncident Investigation:\n\nSysco Food Services of Kansas City promptly investigates any incident has has resulted in, or could reasonably have resulted in a catastrophic release of Ammonia (anhydrous).  These investigations are conducted to identify the circumstances leading up to the incident, as well as any corrective actions required to prevent the release or near-miss from recurring.  All accident/incident reports are retained for a minimum of 5 years. \n\nEmergency Planning and Response:\n\nSysco Food Services of Kansas City is included in the written community emergency response plan.  The facility also has its own emergency response plan.  The emergency response plan includes specific actions to be taken in response to an accidental release of Ammonia (anhydrous).  The emergency response plan includes procedures for informing the public and local response agencies in the event of a release of Ammonia (anhydrous).  The emergency response plan also includes information on emergency health care.  \n\nCompliance Audits:\n\nSysco Food Services of Kansas City conducts audits on a regular basis to determine whether the provisions required by the RMP regulation are being implemented.  These audits are conducted at least every three years"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42123,
      "SummaryText": " and any corrective actions required as a result of the audits are completed in a safe and timely manner.\n\nPlanned Changes To Improve Safety:\n\nSysco Food Services of Kansas City believes that all man-made accidents and incidents are preventable.  This goal can be achieved through the safe and legally compliant design, installation, maintenance and operation of our ammonia refrigeration system.  In addition, we will continue our annual facility evacuation drills and planning/training site visits with the Olathe Fire Department in the future."
    }
  ]
}