{
  "FacilityID": 4213,
  "FacilityName": "SHORELAND FREEZERS",
  "FacilityStr1": "BATEMAN ST",
  "FacilityStr2": "SOUTH DIVISION ST",
  "FacilityCity": "SALISBURY",
  "FacilityState": "MD",
  "FacilityZipCode": "21804",
  "Facility4DigitZipExt": "6901",
  "FacilityCountyFIPS": "24045",
  "LEPC": "Wicomico County LEPC",
  "FacilityLatDecDegs": "38.349722",
  "FacilityLongDecDegs": "75.599889",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "WM",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3086840,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ARTHUR M. COOLEY",
  "OperatorStr1": "BATEMAN ST",
  "OperatorStr2": "SOUTH DIVISION ST",
  "OperatorCity": "SALISBURY",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21804",
  "OperatorZipCodeExt": "6901",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049805",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-06-29 00:00:00",
  "DeRegistrationEffectiveDate": "2006-05-12 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.3442,
  "FRS_Long": -75.60253,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 4916,
      "AltID": null,
      "FacilityID": 4213,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5268,
          "ProcessID": 4916,
          "ChemicalID": 56,
          "Quantity": 25600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5025,
          "ProcessID": 4916,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1869,
              "Process_NAICS_ID": 5025,
              "SafetyReviewDate": "1998-05-12 00:00:00",
              "PHA_Date": "1998-04-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-04-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "PRESSURE DETECTORS",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-09-10 00:00:00",
              "TrainingReviewDate": "1998-11-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-09-02 00:00:00",
              "EquipmentInspectionDate": "1998-11-02 00:00:00",
              "EquipmentTested": "HI AND LOW SIDE COMPRESSOR,CONDENSER,PUMPS,NH3 DETECTORS AND PRESSURE DETECTORS",
              "ChangeMgmtDate": "1998-02-10 00:00:00",
              "ChangeMgmtReviewDate": "1998-08-25 00:00:00",
              "PreStartupReviewDate": "1998-08-21 00:00:00",
              "ComplianceAuditDate": "1999-03-24 00:00:00",
              "AuditCompletionDate": "1999-07-21 00:00:00",
              "IncidentInvestigationDate": "1997-10-14 00:00:00",
              "InvestigationChangeDate": "1997-10-20 00:00:00",
              "ParticipationPlansReviewDate": "1998-07-07 00:00:00",
              "HotWorkPermitReviewDate": "1998-02-18 00:00:00",
              "ContractorSafetyReviewDate": "1998-09-08 00:00:00",
              "ContractorSafetyEvalDate": "1998-09-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2090,
                  "PreventionProgram3ID": 1869,
                  "ProcessChemicalID": 5268
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4213,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-09-02 00:00:00",
    "ERTrainingDate": "1999-01-29 00:00:00",
    "CoordinatingAgencyName": "SALISBURY FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "4105483134",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4213,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nOur Facility and the Regulated Substances Handled:\n\n\tShoreland, Inc. t/a Shoreland Freezers operates a public refrigerated warehousing operation at its single plant facility located at 111 Bateman Street, Salisbury, MD   21804-6901.  The Company provides freezing, storage, handling and exporting services to a variety of poultry, seafood, vegetable and meat customers.  The facility comprises 1,500,000 million cubic feet of sub-zero storage space as well as 25,000 cubic feet of cooler space. In addition, the operation is capable of blast freezing 500,000 pounds of product daily.  Facility construction consists of masonry, block and insulated panels.  The refrigeration system is a two-stage anhydrous ammonia system with temperature range capabilities of -20 to +40 degrees Fahrenheit.  The Company handles and stores 25,640 pounds of ammonia at this location.  Extensive investment in the facility since 1993 has resulted in a modern, updated refrigeration plant and engine room.\n\n\tShoreland Freezers celebrated its 50th Anniversary in the fall of 1996, and is privately owned and operated (2nd generation).  The management team consists of its President, Vice-President/Treasurer, Warehouse Manager and Plant Engineer.  Together, this team brings 75 years of combined experience in warehousing and refrigeration system operations.  The facility has a 53-year history of safe operation and has never had a reportable ammonia loss or leak. \n\nAccidental Release Prevention and Emergency Response Policies:\n\n\tThe Management Team at Shoreland is dedicated to the overall safety of its employees, its customers' product and its neighbors.  The Warehouse Manager is the acting Safety Director and he, along with the Plant Engineer, conduct regularly scheduled safety meetings and training for employees.  Since 1992 the company has been inspected once by a MOSH industrial hygienist and once by a MOSH safety inspector. In both cases there were no citations of substance and only"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4213,
      "SummaryText": "a few minor recommendations for changes. The Company also requested a safety audit by the MOSH safety division.  Additionally, the Company has and continues to utilize the loss-prevention inspection services of its own insurance companies to maintain a safe facility.\n\t\n\tThe Shoreland Freezers \"Employee Handbook\", in Section 7.2, specifically addresses safety issues, and all organizational functions (job descriptions) address the requirement for safety.\n\n\tThe Company has, over the past several years, invested substantial sums of money in both facility upgrades and training to improve its overall safety environment. Prior to 1996 the refrigeration system was primarily comprised of older, reciprocating compressors with manual controls and no alarms. Since that time, millions of dollars have been invested in state-of-the-art equipment with microprocessor controls, alarm sensors and off-site monitoring services.\n\n\n\n\nWorst-Case Release Scenario and Alternative Release Scenario:\n\nThe following two scenarios were created using OCA guidance as well as ALOHA v 5.2.1 modeling software and MARPLOT Census Data software.\n\n\tWorst-Case Release Scenario:  Shoreland's worst-case scenario involves the leak of ammonia from its high-pressure storage receiver.  This release would have offsite impact.  This vessel is a horizontal cylindrical tank measuring 15 feet in length and three feet in diameter.  Standard operating procedures limits the tank capacity to 90%.  The maximum calculated amount of ammonia in the vessel would be 793 gallons.  The scenario assumes a >\" diameter circular opening 0 inches from the tank bottom.  Once pressure was reduced, the chemical mass of the ammonia in the tank would convert to 3,707 pounds of gas/aerosol mixture that would escape.  The release rate would be 581 pounds per minute lasting a total of 7 minutes.  Assuming wind at 1.5 meters per second from the west northwest at 3 meters, a stability class of \"F\"; air temperature of 50 degrees, relative humi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4213,
      "SummaryText": "dity of 50%, five tenths cloud cover and \"urban or forest\" ground roughness; the maximum threat zone for level of concern would be 1100 yards.  The total number of people within a 360 degrees circle, 1,100 yards from the release, would be 3,300.\n\nThe point of release for this scenario is surrounded on four sides by portions of the Shoreland facility.  Heights of the facility range from 20 - 30 feet.  This should have some mitigating effect on the release, forcing it to rise before it can migrate towards the maximum threat zone.\n\n\n\tAlternative-Case Release Scenario:  Shoreland's alternative case scenario involves the leak of ammonia from a 1 inch short pipe, seal or ruptured valve gasket on the high-pressure storage receiver.  This release would not have offsite impact.  The receiver is a horizontal cylindrical tank measuring 15 feet in length and three feet in diameter.  The receiver's capacity at 90% is 793 gallons.  This scenario assumes a 1\" diameter circular opening 32.4 inches from the tank bottom.  The receiver is at 30% capacity resulting in a chemical mass in the tank of 1, 261 pounds.  The maximum computed release rate would be 46.1 pounds per minute for a total of 11 minutes or 177 pounds.  Assuming wind at 3.0 meters per second from the west northwest at 3 meters, a stability class of \"D\", air temperature of 50 degrees, relative humidity of 59%, five tenths cloud cover and \"urban or forest\" ground roughness, the maximum threat zone for level of concern would be 127 yards.\n\n\n\nThe point of release for this scenario is surrounded on four sides by portions of the Shoreland facility.  Heights of the facility range from 20-30 feet.  This should have some mitigating effect on the release, forcing it to rise before it can migrate towards the maximum threat zone.\n\n\nGeneral Accidental Release Prevention Program & Chemical-Specific Prevention Steps:\n\n\tShoreland Freezers attempts to comply with all regulations in order to stay successful and an integral part of the l"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4213,
      "SummaryText": "ocal economy and business community.  The Company is regulated by many different agencies including OSHA, MOSH, USDA, FDA, MDE, MDH and the EPA.  Specific to this summary, complying with the OSHA PSM rule and now the EPA RMP has made Shoreland Freezers a safer employer, vendor and neighbor.  Substantial investment, improved maintenance routines and employee training have all helped to improve our prevention program.\n\n\nFive-Year Accident History:\n\n\tWithin the past five years, the process has had no accidental release that caused offsite impacts provided in the risk management program rule (40 CFR 68.10 (b) (1)).\n\n\nThe Emergency Response Program:\n\n\tShoreland Freezers has adopted an Emergency Response Program as required under the \"OSHA HAZWOPER\" standard.  This program addresses process hazard analysis, management of change procedures, incident investigation, standard operating procedures, emergency response, training, hot works permitting, mechanical integrity, contractors' qualifications, medical monitoring of employees, what-if scenarios, record keeping and other issues.  The Program was subject to an extended MOSH safety inspection from August 1997 to February 1998.  The Program passed that inspection and audit.  Additionally, the Company has now adopted the EPA's \"Risk Management Program for Ammonia Refrigeration (40 CFR Part 68) in its effort to evaluate worst-case alternative-case release scenarios.\n\n\tPeriodic inspections and visits are arranged with the Salisbury Fire Department Headquarters Company.  They have drawings on-hand of the plant facility and a database of information specific to our facility. In addition, the City of Salisbury and Wicomico County have both provided funding in this year's budget to provide equipment and training for a hazardous response team. Shoreland has offered its facility to the team for training purposes. Fire hydrants are located at both street entrances to the facility.\n\n\tApplicable employees have received copies of the \"Eme"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4213,
      "SummaryText": "rgency Response Procedures, Shoreland Freezers\".  The \"Liason Officer\" maintains Federal, State and Local \"Right-To-Know\" contact information with him at all times.\n\n\tThe engine room facility is actively monitored weekdays from 7:30 a.m. until 4:30 p.m.  Weekends and holidays require two daily checks by maintenance personnel. The plant is monitored 24 hours a day seven days a week 365 day a year for burglary, fire, smoke, leaks and equipment failure by an off-premises alarm company.  Primary emergency response personnel are equipped with pagers and cell phones.  Additionally, a two-way radio system is available for use.  Windsocks are also visible on the southwest and east sides of the plant facility.\n\n\n\nPlanned Changes to Improve Safety:\n\n\tShoreland Freezers maintains active memberships and contact with the following organizations:\n\n\t\tInternational Association of Refrigerated Warehouses (IARW)\n\t\tRefrigeration Engineers and Technicians Association (RETA)\n\t\tInternational Institute of Ammonia Refrigeration (IIAR)\n\n\tThrough these organizations we receive a wealth of information, training and insight as to new regulation and the effect on our industry.  These relationships will continue to provide insight into ways in which we can improve the safety of our facility.\n\n\tAdditionally, the City of Salisbury and Wicomico County have both provided funding in this year's budget to provide equipment and training for a hazardous response team. Shoreland has offered its facility to the team for training purposes."
    }
  ]
}