{
  "FacilityID": 42275,
  "FacilityName": "POLLOCK FERTILIZER PLANT",
  "FacilityStr1": "101 SUMMIT ROAD",
  "FacilityStr2": null,
  "FacilityCity": "POLLOCK",
  "FacilityState": "SD",
  "FacilityZipCode": "57648",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46021",
  "LEPC": "WARHAWK DISTRICT",
  "FacilityLatDecDegs": "45.899250",
  "FacilityLongDecDegs": "-100.284194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NORTH CENTRAL FARMERS ELEVATOR",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NORTH CENTRAL FARMERS ELEVATOR",
  "OperatorStr1": "111 SOUTH MAIN",
  "OperatorStr2": "P.O. BOX 296",
  "OperatorCity": "HERREID",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57632",
  "OperatorZipCodeExt": "0296",
  "RMPContact": "DENNIS MOSER",
  "RMPTitle": "MANAGER",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000029961",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-03-15 00:00:00",
  "ErrorReportDate": "2005-03-15 00:00:00",
  "ReceiptDate": "2005-03-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*RESUBMIT",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-02-28 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2010-10-07 00:00:00",
  "DeRegistrationEffectiveDate": "2010-09-20 00:00:00",
  "AnniversaryDate": "2010-02-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 45.89925,
  "FRS_Long": -100.28419,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 60762,
      "AltID": "HANDLE AND STORE AMMONIA",
      "FacilityID": 42275,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62181,
          "ProcessID": 60762,
          "NAICSCode": "111191",
          "_desc": {
            "NAICS_CODE": "111191",
            "NAICS_DESCRIPTION": "Oilseed and Grain Combination Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80244,
          "ProcessID": 60762,
          "ChemicalID": 56,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580244,
          "ProcessID": 60762,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42275,
      "SummaryText": "NORTH CENTRAL FARMERS ELEVATOR-Pollock Fertilizer Plant\nP.O. Box 296\nHerreid, SD 57632\n\nFacility Manager: Dennis Moser\nFacility Telephone: (605) 437-2744\n\nAccidental Release Prevention and Emergency Response Protocols: The owners, management and employees of the Pollock facility are committed to providing a safe workplace free of accidental releases of anhydrous ammonia. Health, safety and environmental compliance are a fundamental part of every employee's job. It is facility protocol to adhere to applicable Federal, State and local laws and to implement appropiate controls to prevent accidental releases of anhydrous ammonia. If an accidental release were to occur, the facility would respond in accordance with its Emergency Planning Committee and other authorities to control and mitigate the release and minimize the impact of the release to employees, the environment and the general public.\n\nStationary Source and Regulated Substance Handling: The primary activity at this facility (the stationary source) is the storage and handling of fertilizers for direct retail sale to farmers. Anhydrous ammonia is received, stored and distributed for direct application for crop production nutrients. The maximum stored quantity of anhydrous ammonia at the facility is approximately 130,000 pounds stored in one (1) 30,000 gallon storage tank. The maximum fill level of the tank is 85% of the total tank capacity, which is controlled by a liquid level guage. This facility is loaded by transport truck; therefore, the maximum quantity of anhydrous ammonia handled would occur when the on-site storage tank is at the maximum fill level of 85%.\n\nWorst-Case Release Scenario and Alternative Release Scenario: The worst-case release would be the release of the total contents of the 30,000 gallon storage tank. The maximum quantity of anhydrous ammonia released would be approximately 130,000 pounds released in a gaseous form over ten (10) minutes. The resulting distance to the toxic endpoint conce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42275,
      "SummaryText": "ntration offsite and public receptors are within the distance to the endpoint. The distance to the toxic endpoint concentration is 1.12 miles. There was one (1) administrative control considered in this scenario; which is, the storage tank is not filled more than 85% full. There were no passive mitigation measures considered in this scenario.\n\nThe alternative release scenario involves a release of anhydrous ammonia from a break/rupture in a two (2) inch hose during transfer of ammonia from one of the storage tanks to a nurse tank. The quantity of anhydrous ammonia released in a gaseous form would be approximately 12,000 pounds, which is based on a release rate of approximately 6000 pounds per minute over a two (2) minute time period. The resulting distance to the toxic endpoint concentration extends offsite and public receptors are within the distance to the endpoint. The distance to the toxic endpoint concentration is 0.56 miles. There were no passive mitigation measures considered in this scenario.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps: This facility complies with EPA's accidental release prevention requirements and applicable State and local codes and regulations.\n\nThe following sections briefly describe the ellements of the facility's release prevention program.\n\n1) Safety Information: The facility was designed and constructed in accordance with applicable Federal and State regulations. All plans and procedures maintained at the facility are periodically reviewed by facility management for safety updates and changes. Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the anhydrous ammonia equipment are maintained at the facility.\n\n2) Hazard Review: Facility management conducts reviews of the hazards associated with the handling and storage of anhydrous ammonia. The reviews identify the opportunity for equipment malfunctions or human errors that could cause an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42275,
      "SummaryText": " accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases. The results of the reviews are documented and problems identified are addressed in a timely manner.\n\n3) Training: All employees at the facility that handle anhydrous ammonia participate in a training program. Refresher training for all employees is conducted at least once every three (3) years. The training program is reviewed by facility management on a regular basis and revised as necessary.\n\n4) Incident Investigation: Facility management will investigate each incident that results in, or could have reasonably resulted in a catastrophic release of anhydrous ammonia. The investigation will be preformed to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccuring. Investigation reports will be retained for five years.\n\nFive-Year Accident History: There have been no accidental releases of anhydrous ammonia in the past five (5) years that caused deaths, injuries, or significant property damage at the facility; nor, to our knowledge, resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program: In the event of an emergency, it is facility protocol to notify the local fire department and other emergency responders and request that they respond to the emergency. Facility employees will not respond to accidental releases of anhydrous ammonia except for those that are small or incidental, can be controlled at the time of the release by employees in the immediate release area and do not appear to pose an immediate safety or health hazard. This protocol has been discussed with the local fire department and other emergency responders and the facility has appropriate mechanisms in place to notify the emergency responders when there is a need for a response.\n\nPlanned Changes to Improve Safety: There are no specif"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42275,
      "SummaryText": "ic anhydrous ammonia safety changes planned at this time. However, safety improvements is an on-going process at this facility. Periodic evaluations are performed to assess the safety of equipment and procedures."
    }
  ]
}