{
  "FacilityID": 42535,
  "FacilityName": "Reddy Ice #312-Houston",
  "FacilityStr1": "6004 N. Shepherd Drive",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77091",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Houston-Harris Co. LEPC",
  "FacilityLatDecDegs": "29.853147",
  "FacilityLongDecDegs": "-095.410007",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Reddy Ice Group",
  "Company2Name": null,
  "CompanyDUNS": 194256293,
  "Company2DUNS": 0,
  "OperatorName": "Reddy Ice Group",
  "OperatorStr1": "8750 North Central Expressway",
  "OperatorStr2": "Suite 1800",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75231",
  "OperatorZipCodeExt": null,
  "FTE": 82,
  "OtherEPAFacilityID": "77091SPRKL6004N",
  "EPAFacilityID": "100000135409",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-04-01 00:00:00",
  "SafetyInspectionBy": "Houston Code Enforcement",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Houston New Plant Resubmittal (04/04/05)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 29.85189,
  "FRS_Long": -95.41212,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61143,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 42535,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 80714,
          "ProcessID": 61143,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62571,
          "ProcessID": 61143,
          "NAICSCode": "312113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 35482,
              "Process_NAICS_ID": 62571,
              "SafetyReviewDate": "2005-03-24 00:00:00",
              "PHA_Date": "2005-03-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-09-29 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Relief valves and storage vessel dump via fire box to water-filled neutralization tanks",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-03-29 00:00:00",
              "TrainingReviewDate": "2005-03-29 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Web-based training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-03-29 00:00:00",
              "EquipmentInspectionDate": "2005-04-01 00:00:00",
              "EquipmentTested": "Entir new system is being inspected as per PSSR program",
              "ChangeMgmtDate": "2005-04-01 00:00:00",
              "ChangeMgmtReviewDate": "2005-03-29 00:00:00",
              "PreStartupReviewDate": "2005-04-01 00:00:00",
              "ComplianceAuditDate": "2002-09-10 00:00:00",
              "AuditCompletionDate": "2005-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-03-29 00:00:00",
              "HotWorkPermitReviewDate": "2005-03-29 00:00:00",
              "ContractorSafetyReviewDate": "2005-03-29 00:00:00",
              "ContractorSafetyEvalDate": "2005-03-29 00:00:00",
              "CBI_Flag": 0,
              "Description": "The new (March, 2005) Reddy Ice #312 facility, located in Houston, Texas, has developed a Combined Process Safety Management/Risk Management (PSM/RM) Program to address the accident prevention program requirements of both the EPA and OSHA regulations. The purpose of the PSM/RM Program is to make safe operations and accident prevention systematic throughout the facility. The PSM/RM Prevention Program contains thirteen elements, tied together by a management system to ensure development, implementation, and integration of the Program requirements. These thirteen elements consist of the following:  Employee Participation, Process Safety Information, Process Hazard Analysis, Pre-Startup Safety Review Program, Standard Operating Procedures, Training, Management of Change, Mechanical Integrity, Hot Work Permits, Contractor Qualifications, Incident Investigation, Compliance Audits, and Trade Secrets.\n\nReddy Ice Group corporate management and Reddy Ice-Houston management are committed to operating safe and compliant facilities for the protection of its employees, the public, and the environment. Reddy Ice facilities are designed with multiple safeguards pertinent to the anhydrous ammonia process, including engine room ventilation, failsafe controls that shut down the compressors if operating limits are exceeded, the capability of shutting down the entire system if required, and computerized PLC controls in some facilities. Ammonia detection units/alarms are installed to notify employees or offsite personnel in the event of an ammonia release. Administrative controls are in place, which limit the utilization of vessels at less than their maximum intended capacities.\n\nThe company has also developed an Emergency Action Plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and first responder duties by trained refrigeration personnel.",
              "_chemicals": [
                {
                  "PrimaryKey": 51558,
                  "PreventionProgram3ID": 35482,
                  "ProcessChemicalID": 80714
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42535,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Houston-Harris Co. LEPC",
    "CoordinatingAgencyPhone": "7135891036",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42535,
      "SummaryText": "PROCESS SUMMARY\nThe new Reddy Ice #312 facility located in Houston, Texas, manufactures ice for wholesale/retail distribution. The reconfigured facility still maintains approximately 26,000 pounds of anhydrous ammonia as a refrigerant for ice making and cold storage. \n\nThe facility refrigeration system is a standard closed loop design with two distinct refrigeration loops, the high stage/icemaker system and the low stage/freezer system. The two systems share common condensers, thermosyphon vessel and controlled-pressure ammonia storage vessels. Other equipment in the systems includes five rotary screw compressors, ten 80-ton tube ice machines, two liquid ammonia pump recirculator packages, twelve air-cooling evaporators and a plate heat exchanger water chiller system. A Programmable Logic Controller (PLC) monitors the system and controls system operations. The system has numerous protective controls including motor overload, high and low temperature and pressure, low oil pressure, level control switches on all applicable vessels, and approved pressure safety relief valves on all applicable equipment. The SRVs discharge into two 24,000-gallon deluge tanks outside the facility to control any ammonia vapor discharged through the system. Ammonia detectors and alarms are installed throughout the plant.\n\nAnhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant. The sharp odor of ammonia provides its own warning agent. Practically all accidents involving anhydrous ammonia can be avoided through the facility?s program of proper training; knowledge of the equipment and procedures; and conducting preventive maintenance on all ammonia equipment. Reddy Ice has instituted administrative and engineering controls as well as training programs on the corporate level to prevent such accidents.\n\nThe facility has multiple safeguards pertinent to the anhydrous ammonia process. These include an ammonia detection and alarm system, exhaust purge fans, control"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42535,
      "SummaryText": "s which shut down the compressors if operating limits are exceeded, and the capability of shutting the entire system down if required. Administrative controls are in place that limit the utilization of vessels to less than their intended maximum capacities.\n\nThe company has developed an emergency action plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and first responder duties by trained refrigeration personnel.\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\nBased on the Reddy Ice-Houston facility?s ammonia inventory, location, and requirement to meet OSHA PSM standards, it has been determined the facility is subject to the Prevention Program 3 requirements. This accident prevention program is a way to make safe operations and accident prevention systematic throughout the facility. Reddy Ice Group corporate management and Reddy Ice-Houston management are committed to operating a safe and compliant facility for the protection of its employees, the public, and the environment. A Combined Process Safety Management/Risk Management (PSM/RM) Program has been developed to meet the accidental release prevention requirements of both EPA?s Risk Management Program (40 CFR Part 68) and OSHA?s Process Safety Management Standard (29 CFR 1910.119) under the Clean Air Act. The Combined PSM/RM Program contains thirteen elements, establishing requirements for employee participation, safety information, hazard analysis, pre-startup safety review, standard operating procedures, employee training, management of change, mechanical integrity/preventive maintenance, hot work permits, contractor qualifications, release incident investigation, compliance audits, and trade secrets. These elements are tied together by a management system to ensure plant-wide development, implementation and integration of all the Program requirements.\n\nMANAGEMENT SYSTEM\nA management system has been developed to oversee the implementation of the PS"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42535,
      "SummaryText": "M/RM Program elements. The plant manager has been identified as PSM/RM Program Coordinator, with overall responsibility for developing, implementing and integrating the Program requirements. Under the PSM/RM Program, various responsibilities have been assigned to other individuals. The plant engineer is responsible for portions of the program closely tied to the refrigeration equipment and operation. An established safety committee meets each month to present a safety meeting and address any safety issues brought up by employees during the month.\n\nHAZARD ASSESSMENT\nAs required by the Risk Management Program regulations, the Reddy Ice-Houston facility has conducted a hazard assessment including offsite consequence analyses (OCAs) for potential accidental releases of anhydrous ammonia. The OCAs describe the potential offsite exposure to surrounding areas from an accidental release. A worst-case release scenario and alternative release scenarios were developed and calculated using the EPA RMP*Comp modeling program, and the potentially affected offsite population and facilities were identified.\n\nFIVE-YEAR ACCIDENT HISTORY\nThe Reddy Ice-Houston facility has not had any releases that would require reporting as part of a five-year accident history.\n\nEMERGENCY PLANNING AND RESPONSE\nThe Reddy Ice-Houston facility operates under an Emergency Action Plan (EAP) that includes procedures for: notifying plant personnel, the public, and local emergency responders; emergency evacuation/response procedures; use of emergency alarms and equipment; employee training in evacuation and response procedures; first aid for ammonia exposure; and periodic review and updating of the emergency action plan. The plan is reviewed regularly for verification of data, and revised and updated as necessary to reflect changes in facility operations and personnel.\n\nAs required, the facility has coordinated emergency response activities with the Houston/Harris County LEPC and the Houston Fire Department, a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42535,
      "SummaryText": "nd has appropriate mechanisms in place to notify emergency responders if needed. The ammonia inventory is verified and reported annually to the state and local authorities, and the plant is incorporated into the community emergency response plan developed under 42 USC.\n\nPLANNED CHANGES\nThis Risk Management Plan Submittal is prepared as the result of a major reconfiguration of the facility under the PSM/RM Program Management of Change Program. The entire refrigeration system was decommissioned and disassembled in early 2005 New refrigeration and production equipment, controls, and safety-related features were installed, and a whole-system process hazard analysis was conducted on March 29, 2005. Any recommendations resulting from the PHA that indicate a high risk of consequences will be addressed by facility and corporate engineering staff prior to system startup. Recommendations that indicate a low risk of consequences will be addressed as determined necessary by the plant manager during startup or the initial phases of plant operation.\n\nThe Reddy Ice-Houston facility continues to operate an ongoing program of facility preventive and predictive maintenance to identify and implement changes that may result in improved safety and operations. The new plant was constructed with state-of-the-art refrigeration equipment and safety systems engineered in conjunction with City of Houston code authorities to assure employee safety and safety of the surrounding population and environment."
    }
  ]
}