{
  "FacilityID": 42581,
  "FacilityName": "Ferrell North America, Inver Grove  Heights, MN",
  "FacilityStr1": "10825 Courthouse Blvd E",
  "FacilityStr2": null,
  "FacilityCity": "Inver Grove Heights",
  "FacilityState": "MN",
  "FacilityZipCode": "55077",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27037",
  "LEPC": "Minnesota LEPCs",
  "FacilityLatDecDegs": "44.792361",
  "FacilityLongDecDegs": "-093.039694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ferrellgas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 861017291,
  "ParentCompanyName": "Ferrellgas, LP",
  "Company2Name": null,
  "CompanyDUNS": 861017291,
  "Company2DUNS": 0,
  "OperatorName": "Ferrell North America",
  "OperatorStr1": "10825 Courthouse Blvd E",
  "OperatorStr2": null,
  "OperatorCity": "Inver Grove Heights",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55077",
  "OperatorZipCodeExt": null,
  "RMPContact": "Clifford Slisz",
  "RMPTitle": "Manager of Safety",
  "FTE": 2,
  "OtherEPAFacilityID": "NA",
  "EPAFacilityID": "100000168034",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-07-01 00:00:00",
  "SafetyInspectionBy": "office of pipeline safety",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 44.79376,
  "FRS_Long": -93.03744,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61230,
      "AltID": "propane storage facility",
      "FacilityID": 42581,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62658,
          "ProcessID": 61230,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80827,
          "ProcessID": 61230,
          "ChemicalID": 98,
          "Quantity": 6136724.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580827,
          "ProcessID": 61230,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42581,
      "SummaryText": "The employees at Ferrell North America (FNA), Inver Grove Heights, Minnesota are strongly committed to employee, public and environmental safety.  The facility is operated to comply with all applicable federal, state, and local laws and is designed and operated in accordance with NFPA 58 Liquefied Petroleum Gas Code requirements. In addition, FNA operates this facility in accordance with our internal standards that employ good engineering practice and industry accepted principles and codes.  FNA has instituted operating and training procedures that are designed to provide a safe work environment and protect our neighbors.\n\nFNA operates a propane storage facility located at 10825 Courthouse Boulevard East in Inver Grove Heights, Minnesota.  It contains one Risk Mananagement Plan (RMP) covered process involving propane. The primary purpose of the facility is to store and distribute propane to wholesale customers.  All propane is delivered to the facility by truck, railcar, or pipeline and offloaded into storage tanks.  Propane is distributed from the storage tanks by transports to wholesale customers.  No other RMP regulated substances are present at the facility.  \n\nTo evaluate the worst case and alternative release scenarios, the facility used the EPA's Offsite Consequence Analysis Guidance Reference Tables or Equations. The following paragraphs provide details of the worst case and alternative release scenarios.  \n\nIn accordance with RMP guidelines, the worst case release scenario for the facility is a vapor cloud explosion of the largest propane storage tank.  In the scenario, 218,112 pounds of propane are released.  The release quantity has been limited to 85 percent of the maxmum capacity of the tank by a system of administrative controls.  The vapor cloud explosion is estimated to reach an overpressure of 1 psi approximately 0.49 mile from the center of the facility.  No mitigation systems were considered in the model.  The storage system is equipped with safet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42581,
      "SummaryText": "y devices to prevent accidental releases, including automatic shutoff valves that respond to excess flow and fire exposure.  \n\nThe alternative release scenario was based on a \"pull-away\" incident caused by a propane transport truck driving away while still connected to the loading or unloading system by a 2-inch hose.  This system is equipped with manual shutoff valves to allow safe remote shutoff.  The quantity of propane released in this incident was calculated assuming a liquid full hose and considering that the shutoff is not immediate.  This incident was used in an attempt to obtain a release quantity sufficient to predict an off site impact in a vapor cloud explosion.  There was no consideration of mitigation systems in the model. The amount released was estimated to be 244 pounds of propane and the distance to 1 psi overpressure following the explosion was estimated to be 0.03 mile from the center of the facility. \n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40 CFR Part 68. The elements of the release prevention program that are in place at the facility include process safety information, process hazard analyses, operating procedures, training, mechanical integrity, management of change, compliance audits, incident investigation, employee participation, and contractor safety.  \n\nFerrell North America, Inver Grove Heights, Minnesota has had an excellent record of preventing accidental releases over the previous 5 years.  Due to limited staff, FNA employees do not perform emergency response as defined by EPA, RMP rules.  Employees perform incidental response, which is limited to actions that can be safely taken to stop or prevent a minor release of propane.  In the event of a major release or incident such as a fire, the FNA policy is to depend on the local fire department to respond with the appropriately trained personnel.  FNA has coordinated emergency response with the Inver Grov"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42581,
      "SummaryText": "e Heights Fire Department and has written procedures in place in the event of an emergency.  FNA constantly reviews the propane operations and procedures to improve safety."
    }
  ]
}