{
  "FacilityID": 42619,
  "FacilityName": "Pendleton Flour Mills LLC",
  "FacilityStr1": "463 W. U.S. Highway 26",
  "FacilityStr2": null,
  "FacilityCity": "Blackfoot",
  "FacilityState": "ID",
  "FacilityZipCode": "83221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16011",
  "LEPC": "Bingham County LEPC",
  "FacilityLatDecDegs": "43.207917",
  "FacilityLongDecDegs": "-112.386667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pendleton Flour Mills LLC",
  "OperatorStr1": "463 W HWY 26",
  "OperatorStr2": null,
  "OperatorCity": "Blackfoot",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83221",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Carroll",
  "RMPTitle": "Plant Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000137737",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-02-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-05-18 00:00:00",
  "DeRegistrationEffectiveDate": "2020-04-01 00:00:00",
  "AnniversaryDate": "2010-04-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 43.20792,
  "FRS_Long": -112.38667,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "15.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61292,
      "AltID": null,
      "FacilityID": 42619,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62724,
          "ProcessID": 61292,
          "NAICSCode": "311211",
          "_desc": {
            "NAICS_CODE": "311211",
            "NAICS_DESCRIPTION": "Flour Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 80896,
          "ProcessID": 61292,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 580896,
          "ProcessID": 61292,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42619,
      "SummaryText": "Pendleton Flour Mills LLC\nBlackfoot,  Idaho\n\n\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\n\nAccidental Release Prevention Program and Emergency Response Policy\n\nIt is the policy of facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the U. S. Environmental Protection Agency (EPA) regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) Program.  The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to employees, the public and the environment.  This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.  The key concepts in our release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\n\n\nFacility Description\n\nThis facility utilizes flour mills to produce flour.  The raw materials in the process are wheat and chlorine gas.  Support operations include a chlorine system, a quality control laboratory, and administrative offices.  Chlorine is utilized to bleach the flour and is found in sufficient quantities to be subject to the requirements of 40 CFR Part 68.  Propane is also stored at the facility, but in amounts below threshold quantity.\n\n\nWorst Case and Alternative Release Scenarios\n\n\nAs specified by the EPA RMP Regulations, our worst case scenario for toxic chemicals would be the loss of all of the chlorine in our largest vessel within 10 minutes.  In the case of Pendleton Flour Mills, this would involve a 1-ton cylinder of chlorine.  Such a scenario is highly unlikely, however, using the EPA Offsite Consequence Analysis (OCA) methods and RMP*Comp, the distance that chlorine vapors could travel, in this hypo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42619,
      "SummaryText": "thetical case, would be approximately 2.2 miles from our facility.  The release parameters included in the worst case assessment are:  the chlorine gas is a liquefied gas, the cylinder is not diked but is inside a building, the nearfield dispersion environment is characterized as rural, the wind speed is 1.5 meters/second, and the atmospheric stability is classified as F (stable).  \n\nThe alternative release scenario, characterized as a more likely scenario that could involve an offsite exposure to chlorine vapors, is calculated to reach 0.4 miles from the release point.  This distance calculation is also based on the EPA OCA methods and RMP*Comp, which are known to overpredict the impact of any potential release from such a scenario.  The selected alternative release scenario for the chlorine system is a release resulting from damage or rupture of a 1\" chlorine pipe.  The operating pressure on this pipe is 80 psig.  The enclosure that the chlorine system is found in was, once again, taken into account as mitigation for this scenario.  The alternative release rate was derived from RMP*Comp, which takes into account hole size, tank pressure, and temperature and uses a wind speed of 3.0 meters/second and an atmospheric stability class of D.\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention\n\nEmployee participation in the release prevention program is encouraged and supported by management.  Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the chlorine system.  Employees are also members of the facility emergency response team.\n\nThe policy is to construct all new equipment, systems, and facilities in accordance with the most current building and safety codes.  This ensures the appropriate safety and release prevention system is included from the beginning of each project.\n\nWe are committed to provide appropriate training to all employees regarding safety procedures.  Each "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42619,
      "SummaryText": "new employee is provided comprehensive safety training during his or her initial orientation at the facility.  In addition, we conduct regularly scheduled safety training for all employees each year.  Additional training is provided to maintenance personnel for the systems for which they are responsible.  Members of the plant emergency response team receive training to ensure that response actions are promptly and safely completed.\n\n\nFive Year Accident History\n\nNo incident resulting in onsite or offsite impacts from a chlorine release has occurred at the facility within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n\nEmergency Response Program\n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the facility with the Blackfoot Fire Department.  We have personnel trained in emergency response at the facility 24 hours per day, seven day per week.  These personnel receive semiannual training on emergency procedures and response techniques.  The Pendleton Flour Mills Plant Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the facility is in place, and that plan has been coordinated with local officials, along with evacuation procedures, regular drills, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n\nPlanned Changes to Improve Safety\n\n Diligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at Pendleton Flour Mills.  Our company completes a thorough review of the chlorine system each time a design change is implemented.  Some of the key components of the safety improvements we expect to achieve are as follows:\n \n? The"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42619,
      "SummaryText": " Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n? The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n? The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n? Internal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n? An ongoing dialogue with the Bingham County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community."
    }
  ]
}