{
  "FacilityID": 42671,
  "FacilityName": "KMCO, L.P.",
  "FacilityStr1": "16503 Ramsey Road",
  "FacilityStr2": null,
  "FacilityCity": "Crosby",
  "FacilityState": "TX",
  "FacilityZipCode": "77532",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.551800",
  "FacilityLongDecDegs": "-095.031100",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.kmcoinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74198961,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Artie R. McFerrin",
  "OperatorStr1": "16503 Ramsey Road",
  "OperatorStr2": null,
  "OperatorCity": "Crosby",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77532",
  "OperatorZipCodeExt": null,
  "FTE": 110,
  "OtherEPAFacilityID": "TXD 074198961",
  "EPAFacilityID": "100000118623",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-01441",
  "SafetyInspectionDate": "2005-04-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 29.9217,
  "FRS_Long": -95.0533,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61396,
      "AltID": null,
      "FacilityID": 42671,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 81055,
          "ProcessID": 61396,
          "ChemicalID": 27,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 81056,
          "ProcessID": 61396,
          "ChemicalID": 9,
          "Quantity": 190000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 81057,
          "ProcessID": 61396,
          "ChemicalID": 26,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 81058,
          "ProcessID": 61396,
          "ChemicalID": 1,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 81059,
          "ProcessID": 61396,
          "ChemicalID": 12,
          "Quantity": 245000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 81060,
          "ProcessID": 61396,
          "ChemicalID": 49,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 81061,
          "ProcessID": 61396,
          "ChemicalID": 57,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62828,
          "ProcessID": 61396,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 35684,
              "Process_NAICS_ID": 62828,
              "SafetyReviewDate": "2005-04-14 00:00:00",
              "PHA_Date": "2005-03-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-04-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "foam suppression of toxic vapors",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "portable toxic vapor analyzer",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-04-14 00:00:00",
              "TrainingReviewDate": "2005-04-14 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-04-14 00:00:00",
              "EquipmentInspectionDate": "2005-04-14 00:00:00",
              "EquipmentTested": "Safety showers, toxic vapor analyzer",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-03-29 00:00:00",
              "PreStartupReviewDate": "2005-04-14 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-03-15 00:00:00",
              "HotWorkPermitReviewDate": "2005-03-31 00:00:00",
              "ContractorSafetyReviewDate": "2005-03-31 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 51835,
                  "PreventionProgram3ID": 35684,
                  "ProcessChemicalID": 81055
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42671,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-03-31 00:00:00",
    "ERTrainingDate": "2005-03-10 00:00:00",
    "CoordinatingAgencyName": "Garner Environmental Services",
    "CoordinatingAgencyPhone": "2819301200",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42671,
      "SummaryText": "\nKMCO\n\nRisk Management Plan\n\n\n\n1. EXECUTIVE SUMMARY\n\n\n\nKMCO is committed to operating in a manner that is safe for KMCO workers, the public, and the environment. As part of this commitment, KMCO has established a system to help ensure safe operation of the processes at this facility. One part of this system is a risk management program (RMP) that helps manage the risks at KMCO and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements; Risk Management Programs (the RMP rule). One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at KMCO This document is intended to satisfy the RMPlan requirements of the RMP rule and to provide the public with a description of the risk management program at KMCO\n\n\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\n\n\nKMCO is committed to the safety of KMCO workers and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances. KMCO implements reasonable controls to prevent foreseeable releases of hazardous substances. In the event of a significant accidental release, our trained Emergency Response personnel will respond to control and contain such releases. KMCO evaluates each situation, evacuates workers as necessary, and contact the local fire department to control and contain the release and to prevent and/or reduce the consequences of the release. KMCO, the local emergency planning committee (LEPC), and the fire department have established a program to warn the community if an accident occurs that could threaten the community.\n\n\n\n1.2 KMCO and Regulated Substances\n\n\n\nKMCO handles seven listed toxic  substances by the RMP rule in sufficient quantities to be covered by the RMP rule:\n\n\n\nEthylene oxide stored for use in the customer tolling processes.KMCO also handles propylene oxide, f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42671,
      "SummaryText": "ormalin, ammonia, allyl alcohol, ethylenediamine., and sulfur dioxide.\n\n\n\n\n\n\n\n\n\n1.3 Offsite Consequence Analysis\n\n\n\nKMCO performed an offsite consequence analysis (OCA) to estimate the potential for an accidental release of a regulated substance to affect the public or the environment. The OCA consists of evaluating both worst-case scenarios (WCSs) and alternative release scenarios (ARSs). KMCO does not expect a worst case release scenario to ever occur. An ARS represents a release that might occur during the lifetime of a facility like KMCO.  ARSs help the LEPC improve the community emergency response plan. We have shared that information with the LEPC and other organizations involved in emergency response activities. It is also available to the public. If you are interested in this information, please contact our RMP coordinator at (281) 328-3501.\n\n\n\nThe main objective of performing the OCA is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance). The following effects could occur at the endpoint distance. At distances less than the endpoint distance, the effects should be greater; at distances greater than the endpoint distance, the effects would be less.\n\n\n\nWorst-case Release Scenarios\n\n\n\nThe worst-case release scenario for toxic substances is failure of a tank car containing 168,200 lbs of Ethylene Oxide (EO). KMCO does not expect that a worst case scenario could ever occur. Nevertheless, a computer modeling program, Degadis version 1, was used to calculate offsite impact.  The scenario is based on the following: he product is liquefied under pressure, release duration is 10 minutes, release rate  16,820 lbs/minute, with no mitigation, and rural surrounding.  Although mitigation measures (e.g., deluge system at the rail car spurs) are available, none were assumed for the modeling. Factors such as city water service interruption and/or  low water pressure were also assumed. Ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42671,
      "SummaryText": "lculation resulted in a distance to endpoint of 6.81 miles, and the toxic cloud would affect the surrounding populous. \n\n  \n\nAlternative Release Scenarios\n\n\n\nThe ARS for EO is rupture of a 2-inch diameter liquid unloading line from the railcar to the EO storage tank. This scenario assumes the EO is liquefied under pressure, release duration of 60 minutes, with mitigation measure of an enclosed space in direct contact with outside air.  (The EO storage tank has a 26' x 20' x 6' deep concrete \"bunker\" around the tank, and the wall thickness is 12\".  Estimated distance to toxic endpoint was 0.56 miles. \n\nOther alternate scenarios are available for each of the other substances handled.  \n\n\n\n1.4 Accidental Release Prevention Program and Chemical-specific Prevention Steps\n\n\n\nThe following is a summary of the general accident prevention program in place at the KMCO plant. Because processes at the KMCO plant are regulated by the EPA RMP regulation are also subject to the Occupational Safety and Health Administration (OSHA) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n\n\n\nEmployee Participation\n\n\n\nKMCO encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team. Employees have access to information created as part of the KMCO plant accident prevention program. In addition, KMCO has a number of initiatives under way that address process safety and employee safety issues. These initiatives include a Safety Committee to promote both process and personal safety. The team typically has members from various areas of the plant, including operations, maintenance, engineering, administration, and plant management.\n\n\n\nProces"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42671,
      "SummaryText": "s Safety Information\n\n\n\nKMCO keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. \n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. For specific process areas, KMCO has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in PHA documentation. KMCO ensures that the process is maintained within these limits by using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g. automated shutdown systems).\n\n\n\nKMCO also maintains documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc. This information, in combination with written procedures and trained personnel,, provides a basis for establishing inspection and maintenance activities, as well as for evaluating prop9osed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nProcess Hazard Analysis\n\n\n\nKMCO has established programs to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. \n\n\n\nHAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques. The analy"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42671,
      "SummaryText": "ses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. \n\n\n\nThe PHA team findings and/or action items are forwarded to appropriate personnel. All approved mitigation options being implemented in response to PHA team findings are tracked until they are complete. The final resolution of each finding is documented and retained.\n\n\n\nThese periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to appropriate personnel for consideration, and the final resolution of the findings is documented and retained.\n\n\n\n\n\nOperating Procedures\n\n\n\nKMCO maintains written procedures that address various modes of process operations, such as (1) unity startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent graining of new operators. Procedures are periodically reviewed and annually certified as current and accurate. Procedures are maintained current by revising them as necessary to reflect changes made through the management of change process. \n\n\n\nTraining\n\n\n\nTo complement the written procedures for process operations, KMCO has implemented a company-training program for employees involved in operating a process. New employees receive basic training in KMCO plant operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g. through test, skill demonstration) having adequate knowledge to perform the duties and task in a safe manner on their own, they can work independently."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 42671,
      "SummaryText": " In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years.\n\nAll of this training is documented for each operator, including the means used to verify that the operator understood the training. \n\n\n\nContractors\n\n\n\nKMCO uses contractors to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, KMCO has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform KMCO plant personnel of any hazards that they find during their work.\n\n\n\n\n\nPre-startup Safety Reviews (PSSRs)\n\n\n\nKMCO conducts a PSSR for any new facility or facility modificat8on that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all-supporting systems are operationally ready.\n\n\n\nMechanical Integrity\n\n\n\nKMCO has practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: \n\n(1) conducting training, (2) developing written procedures, (3) performing inspections and trust, (4) correcting identified deficiencies, and (5) applying quality assurance measures. \n\n\n\nWritten procedures help ensure that work is performed in a "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 42671,
      "SummaryText": "consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits. If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or an MOC will be distributed to appropriate personnel to review the use of equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\n\n\nSafe Work Practices\n\n\n\nKMCO has safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e. hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\n\nManagement of Change\n\n\n\nKMCO has a comprehensive system to manage changes to processes. This system requires that changes to items such as process equipment, chemicals, technology (including process being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provided with any necessary training on the change.\n\n\n\nIncident Investigation\n\n\n\nKMCO investigates all incidents that resu"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 42671,
      "SummaryText": "lted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to the HSE Department for filing recommendations are tracked until they are complete. \n\n\n\nCompliance Audits\n\n\n\nCompliance audits are conducted at least every 3 years. Both hourly and management personnel may participate as audit team members and typically a third-party consultant is hired to assist in the audit. The audit team develops findings that are forwarded to KMCO plant management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nChemical-specific Prevention Steps\n\n\n\nThe processes at KMCO have hazards that must be managed to ensure continued safe operation. The prevention program summarized previously is applied to all Program 2 and 3 EPA RMP -covered processes at KMCO Collectively these prevention program activities help prevent potential accident scenarios that could be caused by (1) equipment failures and (2) human errors. \n\n\n\nIn addition to the accident prevention program activities, KMCO has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in various processes:\n\n\n\n    Release Detection\n\n\n\n* Ethylene Oxide detectors\n\n* Process alarms\n\n\n\nRelease Containment/Control\n\n* Process relief valves that discharge to a flare to capture and incinerate episodic releases\n\n* Scrubber to neutralize chemical releases\n\n* Valves to permit"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 42671,
      "SummaryText": " isolation of the process (manual or automated)\n\n* Automated shutdown systems for specific process parameters (e.g. high level, high temperature)\n\n* Curbing or diking to contain liquid releases\n\n* Redundant equipment and instrumentation (e.g. uninterruptible power supply for process control system, backup firewater pump)\n\n* Atmospheric relief devices\n\n\n\nRelease Mitigation\n\n\n\n* Fire suppression and extinguishing systems\n\n* Deluge system for specific equipment\n\n* Trained emergency response personnel\n\n* Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n\n\n\n1.5    Five-Year Accident History\n\n\n\nNo releases of Ethylene Oxide, Propylene Oxide, Sulfur dioxide, Ethylenediamine, Fomaldehyde solution, Allyl Alcohol, or Ammonia have occurred from KMCO in the last five years that have resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.\n\n\n\n\n\n\n\n1.6 Emergency Response Program\n\n\n\n        KMCO coordinates emergency response procedures with the \n\nLocal fire department. KMCO workers will respond to minor events that do not have the potential for significant effect (e.g., small fires or small leaks). In the event of a larger fire or release, workers and contractors may evacuate the area if necessary and contact the local fire department. KMCO's emergency response team (ERT) is trained to respond to larger fires and and releases. Training includes a two-day annual fire school at Texas A&M (TEEX). \n\n\n\nKMCO has established a written emergency response plan that has been communicated to local emergency response officials through the local fire department. Regular dialogue is maintained between KMCO and the Fire Chief and Department. Two Full-time employees are members of the Volunteer Fire Department, and KMCO is a member of the Local Mutual Aid Organization (MAMB).\n\n\n\n1.7 Planned Changes to Improve Safety\n\n\n\nKMCO strives to impr"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 42671,
      "SummaryText": "ove the safety of KMCO processes through periodic safety reviews, the incident investigation program, and a program soliciting safety suggestions from the workers. KMCO resolves all findings from PHA's,, some of which result in modifications to the process. The following types of changes are planned during the next 5 years:\n\n\n\n* Revisions to personnel training programs\n\n\n\n* Revised written operating procedures\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        \n\n1\n\n\n\n\n\n1\n\nPage\n\n\n\n"
    }
  ]
}