{
  "FacilityID": 42688,
  "FacilityName": "Fox Energy Center",
  "FacilityStr1": "N2310 East Frontage Road",
  "FacilityStr2": null,
  "FacilityCity": "Kaukauna",
  "FacilityState": "WI",
  "FacilityZipCode": "54130",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55087",
  "LEPC": "Outagamie County LEPC",
  "FacilityLatDecDegs": "44.322532",
  "FacilityLongDecDegs": "-088.209084",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 143169162,
  "ParentCompanyName": "Fox Energy Company LLC",
  "Company2Name": "Calpine Operating Services Company, Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fox Energy Company LLC",
  "OperatorStr1": "250 Parkway Drive, Suite 380",
  "OperatorStr2": null,
  "OperatorCity": "Lincolnshire",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60069",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "WIR000118406",
  "EPAFacilityID": "100000191589",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "03-RV-143",
  "SafetyInspectionDate": "2005-03-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61414,
      "AltID": "Electric Power Generation",
      "FacilityID": 42688,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 81085,
          "ProcessID": 61414,
          "ChemicalID": 57,
          "Quantity": 308400.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 62846,
          "ProcessID": 61414,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23043,
              "Process_NAICS_ID": 62846,
              "SafetyReviewDate": "2005-03-14 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": "All equipment design and installations were based on these standards.",
              "HazardReviewDate": "2005-03-14 00:00:00",
              "ChangeCompletionDate": "2005-04-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Uninterrupted Power Supply not on the ammonia tank delivery system",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-03-14 00:00:00",
              "TrainingReviewDate": "2005-03-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-04-08 00:00:00",
              "EquipmentInspectionDate": "2005-05-06 00:00:00",
              "EquipmentTested": "5/6/2005",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24080,
                  "PreventionProgram2ID": 23043,
                  "ProcessChemicalID": 81085
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 42688,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-03-22 00:00:00",
    "ERTrainingDate": "2005-04-04 00:00:00",
    "CoordinatingAgencyName": "Kaukauna Fire Department",
    "CoordinatingAgencyPhone": "9207666320",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42688,
      "SummaryText": "Introduction\n\nFox Energy Company LLC (Fox Energy) owns the Fox Energy Center, a combined-cycle electric power generating facility located in Kaukauna, in Outagamie County, Wisconsin.  The Fox facility is operated by Calpine Operating Services Company, Inc. (Calpine). The Fox facility includes two Selective Catalytic Reduction (SCR) systems that use ammonia for the reduction of nitrogen oxide (NOx) emissions.  The ammonia is stored in aqueous form in one 40,000-gallon storage tank located at the Fox facility.  At full capacity, the tank can store as much as 308,400 pounds of aqueous ammonia.  Since the Fox facility will be storing more than 20,000 pounds of aqueous ammonia in a process, it is subject to United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations codified in 40CFR Part 68.\n\nAmmonia is an easily liquefiable colorless gas with a sharp, intensely irritating odor.  The aqueous form ammonia is a solution of ammonia and water, and it is listed by the USEPA as a regulated toxic substance for release prevention.\n\nRelease Prevention and Emergency Response Policy\nPursuant to the RMP regulations (40 CFR Part 68), Fox Energy has developed a comprehensive written program to protect employees and the surrounding community from exposure to ammonia.  \n\nFox Energy is committed to the safe operation of the SCR ammonia system at the Fox Energy Center facility.  A release prevention program has been developed and implemented by Fox Energy that is a combination of several programs at the facility.  The release prevention program includes employee education in the hazards of aqueous ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia.  The program includes preventive maintenance programs (mechanical integrity) for the ammonia system that incorporates inspections of the system in accordance with recognized standards of equipment inspection within the ammonia industry, as well a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42688,
      "SummaryText": "s tests of system components in accordance with component manufacturers? recommendations.\n\nThe release prevention program includes programs for pre-startup safety reviews and management of changes (MOC) to the ammonia system.  The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the systems.  \n\nSpecial emphasis is placed on handling accidental releases of ammonia and coordination of emergency response with local fire departments and other emergency response organizations in the release prevention program.\n\nAs part of the release prevention program requirements, Fox Energy undertook a review of the potential offsite consequences of the accidental releases from one 40,000-gallon aqueous ammonia storage tank.  Although such a release is highly unlikely, the regulation requires this review.\n\n\nWorst-Case Release Scenario\n\nAs required by USEPA regulations, the worst-case release scenario was assumed to be the complete loss of the contents of one 40,000-gallon storage tank containing 308,400 pounds of aqueous ammonia.  This analysis included a common containment dike for the tank as a passive mitigation measure.  The USEPA guidance for defining a worst-case release scenario for a release of gas is to estimate the release rate over a 10-minute period of the largest quantity resulting from a pipe or vessel failure.  Thus, the ammonia emission rate from the worst-case release scenario used was the loss of 308,400 pounds of aqueous ammonia averaged over a 10-minute period [i.e., approximately 53.7 pounds per minute (lb/min) of ammonia released to the air].\n\nUSEPA?s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 milligrams per liter (mg/L) [or 200 parts per million (ppm)].  The model predicted a distance of 0.4 miles as the distance to the toxic endpoint due to the specified worst-case rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42688,
      "SummaryText": "ease.  Based on LandView 6 output, the total population within the potential exposure area is 42 individuals with residences being the primary public receptor that could potentially be impacted.\n\nFox Energy employees thoroughly inspect the aqueous ammonia system per guidance contained in the operations and maintenance procedures.  This greatly minimizes the chance that the tanks will fully discharge their contents in a release and minimizes the potential for an offsite impact.\n\n\nAlternative Release Scenario\n\nFor the Fox facility, the alternative release scenario was assumed to be the structural failure of a 2-inch pipe filled with aqueous ammonia under pressure at 63 pounds per square inch gauge (psig) pressure beyond the confines of the concrete dike.  The model assumed that active mitigation (e.g., use of emergency shutdown systems etc.) starts within a reasonable time after the accidental release begins.  For this analysis, the total release duration is assumed to be the time period from the beginning of the release event until the release is totally contained.  The total release duration was assumed to be 10 minutes.  In this analysis, no passive mitigation measures were assumed.  Thus, the ammonia emission rate from the alternative release scenario is given as the loss of 66,500 pounds of aqueous ammonia averaged over a 10-minute period (i.e., 1,670 lbs/min release rate of ammonia to outside air).\n\nUSEPA?s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/L (or 200 ppm).  The model predicted a distance of 1.0 mile as the distance to the toxic endpoint due to the specified alternative release.  Based on LandView 6 output, the total population within the potential exposure area is 202 individuals with residences being the primary public receptor that could potentially be impacted.  \n\nFox Energy employees thoroughly inspect the aqueous ammonia system per guidance contained in the operations and maintenance procedures."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42688,
      "SummaryText": "  This greatly minimizes the chance that there will be any discharge of tank contents in a release and minimizes the potential for an offsite impact.\n\nRelease Prevention Program\n\nAs indicated earlier, Fox Energy has proactively implemented a release prevention program for the SCR ammonia system.  The scope of the release prevention program encompasses various facets of release prevention; e.g., it engenders employee participation, increases employee awareness about the hazards of handling ammonia, establishes safe standard operating procedures and enhances access to process safety information.   Fox Energy performed a Process Hazards Analysis on the SCR ammonia system during the design process, as well as during commissioning activities for the facility.  In addition, reviews of operating procedures, equipment maintenance schedules, and operational safeguards have been performed to identify action items to render the process safer.  Fox Energy has developed a written release prevention program for the Fox facility.  The release prevention program provides the procedural backbone for safe operability functions (i.e., continual review of safe operating procedures, review of mechanical integrity of equipment, improved maintenance schedules, increased training, better access to process safety information and hazard awareness for both employees and onsite contractors, and effective emergency response planning), and allows Fox Energy to maintain, review and evaluate the program on a periodic basis.\n\n\nEmergency Response Program\n\nThe release prevention program incorporates the Fox facility?s comprehensive emergency response plan.  The emergency response program places special emphasis on handling accidental releases of aqueous ammonia and coordination of emergency response with Kaukauna Fire Department and other emergency response organizations, such as the Outagamie County LEPC and local/state police.  The response plan details the emergency response structure and includes"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42688,
      "SummaryText": " personnel responsibilities and procedures within that structure.  In addition, the plan includes procedures for notification of local agencies in the event of an incident, facility evacuation, and decontamination.  Finally, the facility reviews emergency preparedness and planning, including plans for conducting emergency response team training and drills.\n\nFox Energy?s management is committed to supporting the emergency response organization and its prescribed functions.  Emergency response team members are drawn from the existing employee pool and the organizational concept fosters pride and emphasizes concerns for safe operation of the Fox Energy facility.  The well-defined emergency response organization operates in conjunction with the Kaukauna Fire Department and the Outagamie County LEPC to alleviate safety concerns about handling aqueous ammonia.\n\n\nAuditing Program\n\nFox Energy has developed an auditing program for the Fox facility?s ammonia system.  This audit program includes elements from the Program 3 requirements and has been established to provide a mechanism for periodic reviews of the various aspects of the RMP including:\n-the physical ammonia system;\n-hazard review;\n-operation of the system;\n-maintenance procedures;\n-training procedures; and\n-incident investigation procedures.\n\nAlthough not specifically required by the RMP regulations for Program 2 facilities, audits are conducted every three years.  A copy of the audit form used to conduct these audits is included in this document.\n\n\nIncident Investigation Program\n\nFox Energy has developed an incident investigation program for the Fox facility?s ammonia system.  This program includes elements from the Program 3 requirements and has been established to provide a mechanism for determining root causes of accidental releases of ammonia and preventing such events in the future.   A copy of the form used to conduct incident investigations is included in this document."
    }
  ]
}