{
  "FacilityID": 42699,
  "FacilityName": "OHIGRO, Inc.",
  "FacilityStr1": "6720 Gillette Rd",
  "FacilityStr2": null,
  "FacilityCity": "Waldo",
  "FacilityState": "OH",
  "FacilityZipCode": "43356",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39101",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "40.451806",
  "FacilityLongDecDegs": "-083.091528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.OHIGRO.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 18407379,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jerry Ward",
  "OperatorStr1": "PO Box 196",
  "OperatorStr2": null,
  "OperatorCity": "Waldo",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43356",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Ward",
  "RMPTitle": "Safety Coordinator",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169079",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Waldo",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-04-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-04-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-07-22 00:00:00",
  "DeRegistrationEffectiveDate": "2016-07-01 00:00:00",
  "AnniversaryDate": "2010-04-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 40.45181,
  "FRS_Long": -83.09153,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61426,
      "AltID": "Ammonia Storage Tank",
      "FacilityID": 42699,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 62860,
          "ProcessID": 61426,
          "NAICSCode": "11115",
          "_desc": {
            "NAICS_CODE": "11115",
            "NAICS_DESCRIPTION": "Corn Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81097,
          "ProcessID": 61426,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581097,
          "ProcessID": 61426,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42699,
      "SummaryText": "Company Policies:\n     The management and employees of OHIGRO, Inc. are committed to the prevention of any accidental releases of ammonia.  In case an accidental release should occur, the facility is prepared to work with the local fire department and other authorities to mitigate any release and minimize the impact of the release on people and the environment.\nGeneral Operations:\n     We are located in the small town of Waldo, Ohio.  Our business is selling fertilizer, pesticides, seeds, and related items to the farmers in our surrounding area.  We also provide custom application of fertilizer and pesticides to farms owned by our customers.  We have employees who are well versed in the safe handling of all of our hazardous materials.  Any new employees are trained by management plus are given on-th-job training by experienced employees.\nAmmonia:\n     We have a 30,000 gallon storage tank for anhydrous ammonia and several mobile tanks (1000 gallon capacity) on wagons.  We do not mix or react ammonia with any other chemical.  We receive all of our ammonia by truck; the incoming trucks are unloaded by the truck drivers with their own equipment according to DOT and other regulations.  The trucks drivers are well trained.\n     After the ammonia is in our storage tank, it is loaded into the mobile tanks and delivered to farms by our employees or the farmers themselves.  The use of ammonia by farmers is very seasonal.  Most of the handling of ammonia takes place in April-June and then also in October-November.\nAccident History:\n     We have had no accidents in the lasst five years.  We have a safe history of handling anhydrous ammonia.  Our employees recognize the potential dangers of unsafe handling of ammonia and thus treat it very carefully.\nWorst Case Release and Alternative Release Scenarios:\n     In preparing this data we have utilized the \"TFI Worst Case and Alternative Case Release Summary of Results\", and the \"Land View 6 Census 2000 Population Estimator\".  In the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42699,
      "SummaryText": " worst case scenario we reported a release of the entire contents of our largest strage tank, 30,000 gallons of ammonia.  The estimated population within the maximum distance of 2.68 miles is 1,077.\n     In the alternative scenario we used the same data and supposed a transfer hose failure and a two minute release of ammonia.  The estimated population within the maximum distance of 1.18 miles is 532.\nRisk Management:\n     We operate our anhydrous ammonia installation under the rules and regulations of the Ohio Department of Agriculture.  Their representative inspects our operation annually and lists any deficiencies in the operation.  Any deficiencies are immediately corrected.  Normally, very few are found.  For instance, ammonia hoses have the date of maufacture stamped on them and all hoses are replace every five years after the date of manufacture or anytime there is evidence of damage.\n     We inspect our ammonia tank and piping annually, prior to the planting season.  Also as our employees are loading ammonia from the storage tank to the mobile tanks, they are visually looking for any problems which might potentially occur.\nTraining:\n     We believe that a hands on training is the best training for an employee who will handle anhydrous ammonia.  We have safety procedures and operation procedures for the handling of ammonia.  Annually, The Ohio Agribusiness Association conducts a one day training seminar on Safe Handling of Ammonia.  We often send employees to attend this seminar for extra training.\n     We have annual employee Right-To-Know training session that covers ammonia along with other hazardous materials.  We do emphasize the use of personal protective equipment and the inspection of tanks, piping, hoses, and wagons.\nEmergency Response:\n     We have an Emergency action plan and a safety book which spell out actions to be taken in case of spills or release of any material, including anhydrous ammonia.  We will call the local Fire Department and the Cou"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42699,
      "SummaryText": "nty Emergency Coordinator in the case of any spill which creates danger to people or the environment.  In the case of an ammonia release of substance, we will also call the state EPA and the National Response Center.\n     We do not have Self-Contained Breathing Apparatus respirators on hand and thus cannot approach leaks of ammonia unless the mist or vapor is very lowly concentrated.  We will call the Fire Department first thing in case of a release.  We will cooperate in any way possible with local and county personnel is any exercises which might help us be prepared for an emergency."
    }
  ]
}