{
  "FacilityID": 42801,
  "FacilityName": "Kings River Conservation District Peaker Plant",
  "FacilityStr1": "2611 E. North Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Fresno",
  "FacilityState": "CA",
  "FacilityZipCode": "93725",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.692560",
  "FacilityLongDecDegs": "-119.741030",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 609275578,
  "ParentCompanyName": "Kings River Conservation District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kings River Conservation District",
  "OperatorStr1": "2611 E. North Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Fresno",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93725",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Sumwalt",
  "RMPTitle": "Plant Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191865",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-05-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-05-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-05-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61567,
      "AltID": "Ammonia System",
      "FacilityID": 42801,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63006,
          "ProcessID": 61567,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81267,
          "ProcessID": 61567,
          "ChemicalID": 57,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581267,
          "ProcessID": 61567,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42801,
      "SummaryText": "Kings River Conservation District has constructed a nominal 97 megawatt, natural gas-fired, simple cycle peaking power plant in Fresno County, California,. The Kings River Conservation District Peaking Plant (KRCDPP) is located on approximately 9.5 acres south of the City of Fresno near the community of Malaga. The site address is 2611 E. North Avenue, Fresno, California, 93725.  The power plant consists of two General Electric LM6000 natural gas fired combustion turbine generators (CTGs).  There will be three full-time employees and the facility will be capable of unattended operation.  The North American Industrial Classification System (NAISC) number for the KRCDPP is 221112, Fossil Fuel Electric Power Generation.  The land-use adjacent to the KRCDPP is rural.  The closest public receptor, a residence, is located approximately 1,100 feet southeast of the KRCDPP.\n\nThe KRCDPP will employ a selective catalytic reduction (SCR) system using aqueous ammonia  for emission control of nitrogen oxides (NOx).  The aqueous ammonia will be at a concentration of 29.4 percent and will be stored in one 10,000-gallon horizontal above-ground steel storage tank.   The storage tank is located within a 17 feet by 27 feet concrete secondary containment structure capable of holding the entire contents of the tank plus freeboard for precipitation and fire water.  The truck unloading area adjacent to the storage tank has a concrete surface sloping to a catch basin trough with a surface of approximately 100 square feet.  Aqueous ammonia will be delivered by tank truck approximately twice a month (24 times per year).  A typical truckload will contain 5,000 A? 6,000 gallons of aqueous ammonia. \n\nThe facility is subject to the California Accidental Release Prevention Program (CalARP) because the amount of ammonia stored onsite (10,000 gallons of 29.4 percent ammonia, or approximately 22,000 pounds as ammonia) exceeds the CalARP threshold quantity (TQ) of 500 pounds.  The facility is also  su"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42801,
      "SummaryText": "bject to the federal Chemical Accident Prevention Provisions of 40 CFR Part 68 because the concentration of ammonia in aqueous solution is greater than 20 percent, and the quantity of ammonia exceeds the Risk Management Program (RMP) TQ of 20,000 pounds.  KRCDKPP Management prepared this plan to satisfy CalARP and federal RMP requirements for the aqueous ammonia process at the KRCDPP facility.  \n\nThe facility falls under the provisions of CalARP and RMP Program Level 1 because:\nA? As a new facility, there has not been an accidental release in the previous five years of a regulated substance leading to an offsite impact greater than the significant impact threshold.\nA? The potential impact of a worst-case spill of aqueous ammonia does produce an impact above the threshold significance level at an offsite public receptor. \nA? Emergency procedures will be coordinated with the local emergency planning and response organizations. \n\nAs part of the licensing procedure for the KRCDPP before the California Energy Commission (CEC), KRCDPP Management prepared a Safety Management Plan (SMP) for the facility.  The SMP addresses facility safety systems, procedures, and administrative controls that are in place to prevent an accidental release of ammonia, respond to a spill, and minimize the consequences of a release should one occur.  In addition, a seismic analysis was conducted for the KRCDPP as part of the CEC licensing process.  The KRCDPP facility is designed and constructed to conform to the 2001 California Building Standards Code (CBSC) for Seismic Zone 3.  As part of the licensing process, the CEC concluded that the KRCDPP facility (including the aqueous ammonia system) will be adequately constructed and maintained to provide adequate seismic safety in the event of a planning level earthquake under the CalARP program.  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nManagement at KRCDPP is very concerned with the safety of its worker"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42801,
      "SummaryText": "s and individuals living and working near the KRCDPP.  KRCDPP management has therefore implemented a number of measures to ensure that it maintains a safe working environment. Individual components of the Accidental Release Prevention Program at the KRCDPP include the following:\nA? A detailed and comprehensive SMP for the aqueous ammonia system at the facility.  The SMP addresses facility safety systems, procedures, and administrative controls that are in place to prevent an accidental release of ammonia, respond to a spill, and minimize the consequences of a release should one occur include elements to prevent accidents from occurring and response actions to take if a release does occur.\nA? Comprehensive training for all employees. \nA? Establishment of detailed material handling procedures.\nA? Safe operating procedures for aqueous ammonia off-loading, storage, and use. \n\nDescription of Stationary Source\nThe NAICS code for the KRCDPP is 221112, Fossil Fuel Electrical Generation. The KRCDPP site is located at 2611 E. North Avenue, Fresno, California, 93725, in Fresno County, California.   Maximum aqueous ammonia storage will be 10,000 gallons of 29.4 percent aqueous ammonia (approximately 22,000 pounds as ammonia) in a single above-ground horizontal steel tank pressurized by the vapor pressure of ammonia and water at ambient conditions.  Aqueous ammonia drawn from the tank will be used for injection into the exhaust of two CTGs to control the emissions of NOx.  The aqueous ammonia system incorporates the aqueous ammonia tank, pumping skid, vaporizer, piping, and the flow controller used to meter ammonia to the injection grid for the SCR control system.  \n\nThe storage tank is surrounded by a 17 foot by 27 foot (459 square feet) concrete containment structure able to contain the entire contents of the storage tank plus an allowance for precipitation and fire water.  The containment structure is xx feet deep.  A concrete paved unloading area adjacent to the storage tank"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42801,
      "SummaryText": " slopes to a catch basin trough with a surface area of approximately 100 square feet.  \n\nBoth the CalARP and federal RMP programs have defined specific TQs for hazardous chemicals covered under each program.  If a given process uses an amount of the regulated substance greater than the TQ, the regulated substance is subject to the requirements of the program.  The maximum quantity of ammonia stored on KRCDPP site exceeds the TQ for both the CalARP program (500 pounds) and the RMP program (20,000 pounds).  In Fresno County, the Administrating Agency (AA) for a CalARP program is the Fresno County Environmental Health Department (FCEHD).  The emergency response agency is the Fresno County Fire Protection District (FCFPD).\n\nThe major hazards represented by the KRCDPP aqueous ammonia process are the accidental release of a toxic substance (ammonia) due to spill or rupture of the storage vessel, associated piping system, or during a tanker truck unloading accident.  The required worst-case accident scenario for the facility is the complete failure of the aqueous ammonia tank emptying into the secondary containment structure with evaporation of ammonia from the contained liquid pool. \n\nDescription of the Process and Equipment\nKRCDPP will purchase aqueous ammonia from a single supplier.  The ammonia supplier will deliver ammonia approximately twice a month.  The dedicated aqueous ammonia tanker truck travels directly from the supplierA?s yard to the KRCDPP facility and then returns to the supplierA?s yard after the delivery.  The driver will make no other deliveries on the same trip.  Administrative controls will limit delivery of ammonia to one delivery truck at a time.  Ammonia delivery is planned for only daylight hours but may occur at night under unusual circumstances.  \n\nThe aqueous ammonia storage tank will hold 10,000 gallons of 29.4 percent aqueous ammonia (approximately 22,000 pounds as ammonia).  The tank is a cylindrical steel tank mounted horizontally on two me"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42801,
      "SummaryText": "tal supports with concrete footings.  The tank will be pressurized by the vapor pressure of ammonia and water vapor at ambient conditions.  The tank is surrounded by a concrete containment structure (dike) with a capacity to contain the entire contents of the tank plus an allowance for precipitation and fire water. \n\nThe liquid level in the tank is electronically monitored in a cabinet adjacent to the tank.  The tank is protected by a pressure relief valve on the top of the tank and manual drains with shut-off and excess flow valves at the bottom of the tank. Piping into the tank includes one fill line, one vapor return line, one tank drain line, and one outlet line to the ammonia metering system.  Ammonia detectors with audible alarms are located in the storage tank area and along the line delivering the aqueous ammonia to the vaporizer skids.  \n \nThere are three major steps in the handling of aqueous ammonia from delivery to injection into the turbine exhaust.\n\n   1. Preparation for Receipt of Aqueous Ammonia \nSteps involved in preparing for delivery include: \nA? Accepting delivery by the plant operator, \nA? Testing of safety equipment including eyewash station and safety shower, \nA? Donning of personal protective equipment (PPE) by plant personnel involved in the unloading, and \nA? Use of a delivery checklist. \n\nThe tanker truck will not enter the facility until after the manifest and bill of lading are compared to the ordered amount of aqueous ammonia and approval is given for entry.  The checklist used by the plant operator for delivery of ammonia includes elements to verify available volume of the storage tank and to verify the contents of the delivery truck.  \n\n   2. Receipt of Aqueous Ammonia\nKRCDPP administrative controls will limit receipt of ammonia to one truck at a time.  Once the KRCDPP operator gives approval to the driver to enter the facility, the truck travels at low speed (10 miles per hour maximum) directly to the unloading area and parks in the "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 42801,
      "SummaryText": "unloading containment area adjacent to the ammonia tank.  The driver secures the truck from movement using wheel chocks.  The driver and plant operator then follow their respective operating procedures, opening or closing valves as required and hooking up the inlet and vapor return hoses between the truck and the ammonia system.  The truck engine has a safety interlock to prevent operation of the ignition when the truck is pumping.  The truck operator operates valves on the truck while KRCDPP personnel operate system valves. \n\nUnloading is accomplished using a pumping and vapor recovery system on the truck.  The driver operates the pump to transfer the contents of the truck to the storage tank.  Loading will cease when the plant operator determines the desired liquid level in the tank is reached.  At the completion of loading, all residual liquid and vapors in the unloading hoses and piping are evacuated to the truck prior to disconnection of the hoses.  Unloading requires approximately one hour.\nEach step in the unloading process is verified in advance by use of the unloading checklist.\n\n   3. Transfer of Ammonia to the Vaporization and Injection in the SCR\nEach CTG has a supply line of approximately 1-inch inside diameter that carries aqueous ammonia from the pumping skid to the vaporizer skid.  The supply piping is double-walled: 1-inch carbon steel pipe inside to carry the aqueous ammonia and a fiber glass outer containment system.  Most of the piping run from the pumping skid to the vaporizer skid is underground.  For each supply system, not more than 15 feet of pipe is above ground where it connects to the vaporizer.  All above-grounding piping is protected from traffic by metal bollards.  In addition, the access way adjacent to each vaporizer is restricted to maintenance vehicles only and is not subject to normal traffic.  The nominal pressure of aqueous ammonia in the supply lines is approximately 130 pounds per square inch (psi).  Ammonia detectors with aud"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 42801,
      "SummaryText": "ible alarms are spaced approximately every 50 feet along the ammonia supply lines.\n\nThe SCR system is an emission control system for NOx in the CTG exhaust.  The vaporizer and ammonia flow control unit consists of the vaporizer, various valves, pressure regulators, high and low pressure sensors, ammonia detectors, and the supply line to the injection manifold on the SCR system. Hot flue gas from the turbine exhaust is used to vaporize the aqueous ammonia prior to injection in the SCR system at a point upstream of the catalyst grid.  At the catalyst bed, ammonia reacts with NOx in the CTG exhaust to form water and elemental nitrogen.   A small percentage of ammonia remains unreacted and exits the SCR with the exhaust gases.  This released ammonia, called ammonia slip, is regulated by the facility operating permit and will not exceed 10 parts per million by volume (ppmv).  \n\nWorst-Case Release Scenario\nThe worst-case scenario analyzed in the OCA is a total failure of the aqueous ammonia storage tank at night with the entire contents of the tank spilling into the secondary containment system.  Ammonia then evaporates into the air from the resulting contained pool of aqueous ammonia.  Peak emissions occur during the first 10 minutes of the release.  The OCA was performed for the  KRCDPP as part of the licensing application to the CEC, and verified by CEC staff during the licensing review process.  Based on the CEC staff modeling using the SLAB computer model, the distance to the impact threshold (0.14 mg/L, or 200 ppm) defined by the Emergency Response Planning Guide -2 (ERPG-2) is less than the distance to the nearest public receptor, a residence located approximately 1,100 feet from the plant site.  Consequently, there is no impact to a public (sensitive) receptor within the impact zone. \n\nThis worst-case scenario is a low-probability event for two reasons.  \nA? A complete ammonia tank failure is an improbable situation. As part of the licensing study for the KRCDPP, "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 42801,
      "SummaryText": "the CEC concluded that a complete tank rupture was not a credible worst-case accident. \nA? The OCA assumed conditions of F stability and 1.5 m/sec wind speed, the worst-case scenario conditions required for CalARP and RMP worst-case analyses. Stability conditions of F stability class only occur at night but deliveries of ammonia normally occur during the day.  Since a tank rupture is more likely when activity is occurring at the tank, such as an unloading operation, the probability of a nighttime failure is less than that during the day.\n\nFive Year Accident History\nAs the facility is not yet operating, there have been no reportable accidents exceeding threshold quantities at the KRCDPP facility in the previous five years.\n\nEmergency Response Program\nKRCDPP Management is dedicated to maintaining a safe working environment and prepared  an SMP for the ammonia system.  The objective of the SMP is to define facility safety systems, procedures, and administrative controls that are in place to prevent an accidental release of ammonia, responses to be taken in the event of a spill, and steps to minimize the consequences of a release should one occur.  \n\nThe FCEHD is the lead agency for local emergency planning and response.  KRCDPP Management will coordinate emergency response and planning for the ammonia system with FCEHD and the FCFPD.\n\nInitial emergency response training of facility personnel is scheduled to be completed by the time first delivery of ammonia occurs at the facility, scheduled for April, 2005. The site will employ three full-time employees and is designed to operate unattended.  The ammonia process will be monitored by the plant operator when the station is manned and remotely by the KRCD operations center when the facility is unmanned.  Ammonia detectors with audible alarms  are located in the tank area and at approximately 50 feet intervals along the ammonia supply lines.  There are two manual fire-water spray systems within 50 feet of the ammonia stora"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 42801,
      "SummaryText": "ge tank area. \n\nThe KRCDPP SMP specifies immediate actions KRCDPP personnel will take during a spill event including:\nA? Internal notification procedures;\nA? Evacuation procedures;\nA? PPE requirements;\nA? Spill response and cleanup procedures; \nA? Safe operating procedures for the aqueous ammonia tank and equipment; and\nA? Notification procedures to outside agencies.\n\nPlanned Changes to Improve Safety\nThe KRCDPP underwent extensive health and safety review during the CEC licensing process.  No additional safety measures beyond the mitigation measures proposed to the CEC as a condition of certification are planned at this time.\n"
    }
  ]
}