{
  "FacilityID": 42831,
  "FacilityName": "Helena Chemical Company, Wyaconda, MO (Blending)",
  "FacilityStr1": "121 E. Jefferson",
  "FacilityStr2": null,
  "FacilityCity": "Wyaconda",
  "FacilityState": "MO",
  "FacilityZipCode": "63474",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29045",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "40.389194",
  "FacilityLongDecDegs": "-091.926278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "IP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "121 E. Jefferson, Box 197",
  "OperatorStr2": null,
  "OperatorCity": "Wyaconda",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63474",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kirk Briscoe",
  "RMPTitle": "Fertilizer Manager",
  "FTE": 6,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000055913",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Department of Agriculture/Weights and Measures",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-05-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-05-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-05-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-05-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 40.39256,
  "FRS_Long": -91.92003,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - SPOT",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61607,
      "AltID": null,
      "FacilityID": 42831,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63050,
          "ProcessID": 61607,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81313,
          "ProcessID": 61607,
          "ChemicalID": 56,
          "Quantity": 18682.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581313,
          "ProcessID": 61607,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42831,
      "SummaryText": "EXECUTIVE SUMMARY\n\nHelena Chemical Company (Helena) recently acquired a Facility located in Wyaconda, MO (Wyaconda Blending).  Helena is submitting this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards. This electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Wyaconda Blending Facility located at 121 E. Jefferson, Wyaconda, MO 63474.  The electronic RMP summarizes the policies and procedures implemented by the Wyaconda Blending Facility to minimize the likelihood of an accident. The electronic RMP also summarizes the actions that the Wyaconda Blending Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\nPURPOSE FOR UPDATING RMP\n\nHelena has recently acquired this existing facility.  Under its current operating status, this facility blends ammonia below the threshold quantity.  Specifically, the system allows for the connection of up to two nurse tanks to the transfer tree.  However, this RMP considers the future potential that up to four nurse tanks could be connected to the transfer tree at one time and therefore the worst and alternative consequence analyses are based on four 1,000-gallon nurse tanks.\n\nFACILITY\n\nThe Wyaconda Blending Facility is a retail agricultural chemical facility and consists of approximately 10-acres on which three improvements are located.  One of the improvements is used for the formulation process where ammonia is mixed with water and phosphoric acid to produce ammonia phosphate fertilizer.  Ammonia is transported to this "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42831,
      "SummaryText": "facility by Helena personnel in 1,000-gallon nurse tanks from the Wyaconda Retail and Memphis Retail Facilities.  Currently, two nurse tanks can be connected to a transfer ?tree? (manifold).  The ammonia from the nurse tanks is transferred into the blender tank, or other tank, under tank pressure.  The ammonia is mixed with water and phosphoric acid to produce ammonia phosphate fertilizer.  \n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative consequence analysis were completed for the ammonia blending process. The worst case scenario release for the Wyaconda Blending Facility assumed that all the contents in the largest single storage tank were released.  (For this facility, a volume equal to four (4) 1000-gallon nurse tanks was released and modeled.)  The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\nThe alternative (or more likely to occur) scenario assumes a rupture of a 1.5-inch line caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although this event is classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment (rail guards, check valves) and operating procedures that Helena uses to safeguard ammonia transfer operations.\n\nBoth the worst case and alternative scenario are overly conservative because even a 2-minute release is unlikely to occur since check valves on the system should close immediately upon increased flow resulting from the severed transfer line.\n\nACCIDENT PREVENTION PROGRAM\n\nThe Fertilizer Manager implements the risk management planning process at this Helena facility.  The Fertilizer Manager is assisted by other Helena staff, as directed.  The Fertilizer Manager is responsible for conducting ammonia process operations in accordance with this RMP and is responsible for th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42831,
      "SummaryText": "e relevant maintenance, training procedures and documentation.  Upon request, Helena will provide a copy of its Risk Management Plan, Contingency Plan, and Operating Procedures to its contractors and auditing agency.  \n\nEMERGENCY RESPONSE PROGRAM\n\nHelena Chemical Company?s Wyaconda Blending Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Wyaconda Blending Facility.\n\nCONCLUSION\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Wyaconda Blending Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Wyaconda Blending Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Clark County, MO LEPC.\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA?s RMP Submit Program are not applicable to the Wyaconda Blending Facility."
    }
  ]
}