{
  "FacilityID": 42903,
  "FacilityName": "Front Royal Wastewater Treatment Plant",
  "FacilityStr1": "Manassas Ave-Extended",
  "FacilityStr2": null,
  "FacilityCity": "Front Royal",
  "FacilityState": "VA",
  "FacilityZipCode": "22630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51187",
  "LEPC": "Warren Joint LEPC",
  "FacilityLatDecDegs": "38.943333",
  "FacilityLongDecDegs": "-078.190000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Front Royal",
  "OperatorStr1": "P.O. Box 1560",
  "OperatorStr2": null,
  "OperatorCity": "Front Royal",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22630",
  "OperatorZipCodeExt": null,
  "RMPContact": "Keith Will",
  "RMPTitle": "Deputy Director of Public Works",
  "FTE": 12,
  "OtherEPAFacilityID": "VA0001102060",
  "EPAFacilityID": "100000113067",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-05-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-05-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-05-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-04-21 00:00:00",
  "DeRegistrationEffectiveDate": "2017-04-20 00:00:00",
  "AnniversaryDate": "2010-05-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 38.94333,
  "FRS_Long": -78.19,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61691,
      "AltID": "chlorinr",
      "FacilityID": 42903,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63134,
          "ProcessID": 61691,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81418,
          "ProcessID": 61691,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581418,
          "ProcessID": 61691,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 61692,
      "AltID": "sulphur dioxide",
      "FacilityID": 42903,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63135,
          "ProcessID": 61692,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81419,
          "ProcessID": 61692,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581419,
          "ProcessID": 61692,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 42903,
      "SummaryText": "Executive Summary\n\n1.0    SOURCE & SUBSTANCE\n\nThe Front Royal Wastewater Treatment plant is permitted to treat 4 million gallons of sewage from the Town of Front Royal each day.  It discharges treated wastewater into the South Fork of the Shenandoah River.\n\nIn order to remove harmful pathogens from wastewater before it is released into the Shenandoah River, the plant chlorinates wastewater in the final steps of treatment.  Then, to prevent damage to the river ecosystem from excess chlorine, the plant uses sulfur dioxide to remove chlorine before the water is discharged.  For these processes, eleven tons of chlorine and eight tons of sulfur dioxide are separately stored on site as gasses that have been pressurized to form a liquid.\n\nChlorine is a water-soluble, poisonous gas that is highly irritating to the respiratory organs.  At concentrations of 15 parts per million (ppm), chlorine is immediately irritating to humans by inhalation.  At concentrations of 50 ppm, chlorine is dangerous even for brief exposures, and exposures of 1,000 ppm may be fatal even if exposure is brief.  Long term damage from chlorine gas exposure includes changes in the trachea, bronchi, emphysema, and congestion in the respiratory system.  Short term effects include coughing, vomiting, headache and chest pains.  However, the human olfactory sense can detect chlorine concentrations as low as 3.5 ppm, so extensive exposure rarely occurs.\n\nSulfur dioxide is a colorless, nonflammable, water-soluble, suffocating gas which is known to be a dangerous air pollutant because of its corrosive properties.  Sulfur dioxide irritates the eyes, skin and respiratory system.  Due to these potentially serious health consequences, full measures are taken to prevent an accidental release of either chlorine or sulfur dioxide.\n\n2.0 RELEASE SCENARIOS\n\nIn accordance with federal regulation, plant management has modeled two accidental release scenarios:  ?worst-case? and ?alternative-case? for each substance.  The Worst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 42903,
      "SummaryText": "-Case Analysis uses conservative assumptions to determine the greatest distance that a release will travel before it is not longer a hazardous threat.  The Alternative-Case Analysis demonstrates an off-site impact for a smaller release.  Each scenario is described briefly below.\n\nA) Worst-Case Scenario for Chlorine of Sulfur Dioxide Release\n    The worst-case scenario results for chlorine and sulfur dioxide are identical.  The worst-case scenario describes a situation in which a one-ton storage container of either gas releases all 2,000 pounds of the gas it contains in ten minutes.  Under stable atmospheric conditions with a one and one-half meter per second wind, toxic concentrations of chlorine or sulfur dioxide gas would spread to a radius of 0.9 miles from the release site, affecting residences, schools and a hospital.  The residential population affected would be 385 people.  Accordingly, safety inspections and safety plans have been completed to help prevent such an occurrence.\n\nB) Alternative-Case Scenario for Chlorine or Sulfur Dioxide Release\n    The alternative-case scenario results for chlorine and sulfur dioxide are identical.  The alternative-case scenario describes a situation in which a one-ton storage container of either gas suffers a valve failure and releases 1,000 pounds of its gas in 67 minutes.  Under slightly unstable atmospheric conditions with a three meter per second wind, toxic concentrations of chlorine or sulfur dioxide would travel to a radius of 0.1 miles from the release site, affecting residences only.  Approximately three persons would be affected by such a release.  Safety inspections and safety plans are in effect to ensure against this type of release.\n\n    Several mechanisms already in place ensure quick response time and release control.  These mechanisms include relief valves, manual and automatic shutoffs, alarms and emergency procedures, and emergency air supply.  Also, the placement of chlorine and sulfur dioxide containers within an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 42903,
      "SummaryText": " enclosed structure slows spread time, therefore increasing time for emergency response and public notification.  Control mechanisms serve to make both release scenarios highly unlikely.\n\n3.0 ACCIDENT HISTORY & ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n    The Front Royal Wastewater Treatment Plant can certify that there have been no releases of chlorine or sulfur dioxide in the past five years that have resulted in any off site impact.  The plant is proud of its accident-free history and has put into effect an extensive accidental release prevention program to maintain its excellent safety record.\n\n    As an affected facility under Occupational Health and Safety Act Process Safety Management (OSHA PSM) requirements, the plant is a Program 3 participant.  The most extensive of the three RMP programs, Program 3 includes a number of requirements that closely track OSHA PSM requirements.  Program 3 also focuses on the off-site consequences of an accidental release.  The prevention program outlines information and procedures regarding all aspects of safe operation, including process safety information, Process Hazard Analysis (PHA), operating procedures, mechanical integrity, and personnel training.\n\n    The PHA is designed to be conducted by a cross-section of facility employees, with guidance from employees directly involved in the chlorine and sulfur dioxide processes.  The PHA team identifies, evaluates, and implements controls associated with hazards in the chlorine and sulfur dioxide processes.  The overall purpose of the PHA is to comply with the PSM/RMP Program regulations and to prevent or minimize the effects of a chemical release.  The PHA team may conduct a new hazard analysis if significant modifications have been made to the current process or new regulated processes are added.  PHAs are, however, updated and revalidated at least every five years after completion of initial PHAs.\n\n    The program also ensures that the plant maintains up-to-date, accurate, written Operati"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 42903,
      "SummaryText": "ng Procedures that provide clear instructions for all covered processes.  Effective operating procedures, when combined with operator training, are instrumental in guaranteeing safe operation of the systems and preventing accidental releases.\n\n    The mechanical integrity program is integral in preventing accidental chemical releases that may result from\nmechanical failure of improperly maintained equipment.  This program outlines equipment maintenance procedures, including maintenance, testing and inspection schedules and procedures, maintenance personnel training, correction of equipment deficiencies, and quality assurance of new equipment.\n\nFinally, personnel training practices unsure that all employees, including maintenance and contract employees, working on or near the chlorine and sulfur dioxide process fully understand the processes and safety measures necessary for correct operation. All personnel currently working at the plant have been certified as having all of the required knowledge, skills and abilities to conduct their jobs safely and efficiently.  In addition, the plant will train and certify new personnel and conduct mandatory refresher courses for all personnel. \n\n4.0 EMERGENCY RESPONSE PROGRAM\n\n40 CFR Part 68.90(b) states that ?the owner or operator of stationary source whose employees will not respond to accidental releases of regulated substance need not comply with section 68.95 of this part provided that they meet the following: (1) For stationary sources with any regulated toxic substance held in a process above the threshold quantity, the stationary source is included in the community emergency response plan developed under 42 U.S. C.  11003;?.  Since the policy of the Front Royal Wastewater Treatment Plant is to allow the emergency response teams organized by the Town of Front Royal and the LEPC to respond to emergencies at the plant, the Front Royal Wastewater Treatment Plant is not required to comply with 40 CFR Part 68.95, pertaining to the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 42903,
      "SummaryText": " development and implementation of an emergency response program."
    }
  ]
}