{
  "FacilityID": 4300,
  "FacilityName": "Charles A. Strain Water Treatment Plant",
  "FacilityStr1": "510 34 Road",
  "FacilityStr2": "PO Box 100",
  "FacilityCity": "Clifton",
  "FacilityState": "CO",
  "FacilityZipCode": "81520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08077",
  "LEPC": "Mesa County LEPC",
  "FacilityLatDecDegs": "39.076111",
  "FacilityLongDecDegs": "-108.447222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "cwd@wic.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Clifton Water District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Clifton Water District",
  "OperatorStr1": "PO Box 100",
  "OperatorStr2": null,
  "OperatorCity": "Clifton",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81520",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000051285",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.08188,
  "FRS_Long": -108.42261,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5015,
      "AltID": null,
      "FacilityID": 4300,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 5369,
          "ProcessID": 5015,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5124,
          "ProcessID": 5015,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 2843,
              "Process_NAICS_ID": 5124,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute Pamphlets",
              "FR_Comments": null,
              "HazardReviewDate": "1999-01-28 00:00:00",
              "ChangeCompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-01 00:00:00",
              "TrainingReviewDate": "1999-01-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Chlorine Response 8hr refresher",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-27 00:00:00",
              "EquipmentInspectionDate": "1999-04-13 00:00:00",
              "EquipmentTested": "Chlorine cylinder valves",
              "ComplianceAuditDate": "1999-01-28 00:00:00",
              "AuditCompletionDate": "1999-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Clifton Water District uses liquified chlorine in the water treatment process as an added component to disinfect conventionally treated water prior to use as a potable water source.\n\nThe chemical feed process for chlorine is contained in an enclosed room separated from the water treatment plant by a common exterior wall.  This enclosed room contains two compartments, one in which the two, 2,000 lb. containers of liquified chlorine are stored, and the other which contains remote readable instrumentation.  The volume of chlorine is above the threshold values for reporting under the RMP requirements.\n\nIn this process, the system feeds chlorine from one container until empty.  The treatment plant operators then manually switch the process through a valving manifold to the other full container.  The storage/feed room is locked at all times preventing unauthorized entry (except during delivery and transfer of full and empty containers by qualified chemical shippers) and has an alarm mechanism which automatically sounds both visual and audible alarms within and outside the water treatment plant.  Various flow meters and storage condition status readouts can be remotely monitored from outside the enclosed space.\n\nThe water treatment facility personnel are thoroughly trained regarding the hazards and risks associated with chlorine use to both themselves as well as the general public.  Specific regulatory operational and maintenance procedures are in place and strictly followed.  Procedure reviews and process audits are performed on a yearly basis to help identify any risks or hazards that may have been previously overlooked.  These reviews and audits are also performed anytime modifications (major and minor) are proposed to the chlorine feed/storage/handling process.\n\nThe District's chlorine feed and handling procedures and practices have been updated on an ongoing basis with the most recent being in March of 1999.  Equipment and materials were procurred to allow water treatment personnel to perform system integrity checks and to rebuild and service various componets of the process and to perform evaluation and component tests and operational calibrations.\n\nTreatment plant personnel check the chemical feed system on a daily basis (and record all inspection results) and a scheduled maintenance program is in place and followed.  the chlorine release dection sensors are located in such a manner to alarm if a release is detected.  The alarms that go off are interior and exterior auditory and a strobe light mounted on the exterior of the chlorine room.  After normal working hours, the alarm activates an automatic phone dialer and key plant personnel are immediately notified.  Specific procedures are in place for after hour alarms and all plant personnel have been trained to carry out the procedures.\n\nThe immediate vicinity of the treatment plant is enclosed by a security fence and the access gate is locked after hours.  The local fire department has site access authorization during after hours when District personnel are not onsite.",
              "_chemicals": [
                {
                  "PrimaryKey": 2893,
                  "PreventionProgram2ID": 2843,
                  "ProcessChemicalID": 5369
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4300,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Grand Junction Fire Dept. Haz Mat",
    "CoordinatingAgencyPhone": "9702441400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4300,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policy\n\nThe United States Environmental Protection Agency (EPA) requires that all facilities (both public and private) which utilize specific hazardous chemicals above defined threshold quantities in their processes, be in compliance with the requirements of the Clean Air Act (CAA) 40 CFR 112r Part 68.  The Clifton Water District (CWD) utilizes liquified chlorine in the treatment of water for use by the public.  Chlorine is on the list of hazardous chemicals covered by the threshold limits within the CAA.  The requirements presented in the CCA regarding processes that utilize hazardous chemicals identify specific safety precautions regarding handling and storage of the listed hazardous chemicals.  The CWD has specific release prevention and emergency response procedures in place to help prevent chemical exposure to water treatment personnel as well as the general public, given the life, health and safety hazards associated with liquified chlorine.  It is the policy of the Clifton Water district to strictly adhere to all applicable Federal and State rules, regulations, and, safety precautions.\n\nIt is the opinion of the Clifton Water District's Board of Directors and Management that the emergency action response plan utilized by the Clifton Water District is in compliance with OSHA's Employee Emergency and Fire Prevention Plan, 29 CFR Part 1910.38.  The emergency action plan includes procedures for notifying the Clifton Fire District and the Grand Junction Fire Department's Hazardous Materials Team (HAZMAT) to respond to hazardous chemical releases at the water treatment plant, and to notify all potentially affected neighbors.\n\n\nFacility Description and Activities\n\nThe Clifton Water District provides domestic potable water to approximately 30,000 customers located in the unincorporated portion of Mesa County generally referred to as 'Clifton' (roughly the area encompassed from I-70 to the Colorado"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4300,
      "SummaryText": " River and 30 Road to 34.5 Road, along with a detached service area in the vicinity of Whitewater, CO.  The water treatment plant, along with the main business office is located at 510 34 Road, Clifton, CO.  The CWD processes water from the Colorado River through conventional water treatment practices as well as additional treatment through a state-of-the-art process utilizing membrane technology.\n\nLiquified chlorine is delivered in one-ton bulk cylinders by certified chemical transportation companies to the water treatment plant where it is off-loaded into the enclosed chlorine storage/feed room where the cylinder is connected to the manifold feed system.  The chlorine is fed to the treated water as a part of the final disinfection process prior to delivery to the end user.  The feed system utilizes two one-ton containers that are manually switched from empty to full via the valved manifold system by treatment plant operators.  This feed system is monitored daily by plant personnel as well as continuously monitored by leak sensors that are connected to both visual and audible alarms inside and outside the treatment plant.  During off-hours, the sensor alarm system is connected to an automatic phone dialer that notifies on-call treatment plant personnel if a leak occurs so that appropriate response can be initiated.\n\nAccess to the water treatment plant facility is controlled via locked gates and security fencing surrounding the facility.  The chlorine room itself is locked at all times to prevent unauthorized access.  All treatment plant personnel are thoroughly trained regarding the hazards and risks accociated with liquified chlorine for both themselves and the general public.  Specific regulatory operational and maintenance procedures are in place and strictly followed by all plant personnel.  Procedural and personnel audits are performed on a yearly basis to idintify hazards or risks which may have been overlooked or not previously identified.\n\n\nWorst-Case Relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4300,
      "SummaryText": "se Scenario\n\nThe worst-case release scenario for a one-ton cylinder of liquified chlorine is the catastrophic failure due to corrosion, impact or construction defect of the cylinder.  This scenario assumes a release of the total contents, 2,000 pounds of chlorine in a ten (10) minute period.  The estimated perimeter from the water treatment plant, which could be affected, is 0.9 miles.  In this and any other scenario, the Clifton Fire Department and the Grand Junction Fire Department HAZMAT Team would be immediately notified and would respond to the release and would notify the public and the Local  Emergency Planning Committee (LEPC) of actions to take in the affected areas.  \n\nThe CWD feels this scenario is highly unlikely due to the procedures and work practices in place for handling the one-ton chlorine containers.  The originally installed hoisting framework (1979) was modified in 1997 with an engineered rail support extension and hoisting mechanism.  The chlorine storage/feed room is approximately four (4) feet higher than the vehicle access thus minimzing crash and puncture possibilities.\n  \n(NOTE:  The data for this release scenario was generated from EPA's RMP*Comp)\n\n\nAlternative Scenario\n\nThe alternative release scenario would take place within the enclosed chlorine storage/feed room.  The scenario assumes a leak in the feed pipe manifold either from corrosion or inadvertant contact which would result in the release of gas through a 5/16 diameter opening.  This scenario assumes a release of 11.3 pounds of chlorine per minute.  The estimated affected perimeter from the water treatment plant is 0.1 miles.  The Clifton Fire Department and Grand Junction Fire Department HAZMAT Team would be notified and would respond and notify the public and the LEPC of actions to take in the affected area.  The quantity of chemical released depends on how long it takes the HAZMAT team to respond and stop the release.  Assuming a 30 minute response and a 30 minute effort to s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4300,
      "SummaryText": "top the release, the total amount of chemical released could be 678 pounds in 60 minutes.\n\nThis alternative scenario was selected as a more-likely possibility due to the location of the manifold by the passage-way between the storage/feed area and the flow monitoring equipment area.\n\n(NOTE:  The data for this release scenario was generated from EPA's RMP*Comp)\n\n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nIt is the opinion of the Clifton Water District Board of Directors and Management that the Clifton Water District's water treatment plant is currently in compliance with the EPA's Accidental Release Prevention Rule and all applicable State of Colorado codes and regulations.  The original water treatment plant, and chlorine handling area, was constructed in 1979 to all applicable building codes and requirements.  The plant underwent expansion in 1981 and again in 1997.  Each time the plant was expanded, all applicable codes and requirements were followed and recommended chlorine handling modifications were implemented.  The District has in its five-year expansion plan to completely revamp the chlorine handling/storage/feed facility to all current State of Colorado and Chlorine Institute requirements.  Equipment and components related to receiving, feed process and final discharge of chlorine are inspected daily by plant personnel and are maintained and service according to equipment manufacturer's recommendations.  The water treatment personnel have been trained to follow specific operational and maintenance procedures while utilizing the chlorine process.\n\nIn January 1999, treatment plant operators received specific training on how to perform maintenance on the new chlorine analyzer, how to test the chlorine leak detector sensors, hands-on training on how to rebuild the regulator and chlorinator as well as the injectors and how to properly test the rebuilt components for assurance of operating within manufacturer's parameters.  Afte"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4300,
      "SummaryText": "r the training, the plant purchased the necessary equipment to build the District's own chlorine testing apparatus.    The testing apparantus is functional and is used to test individual components of the chlorine feed and monitoring processes.\n\nPlant personnel perform daily checks and inspections of the chlorine handling/storage/feed system and a scheduled maintenance system is in place.  Chlorine release detection sensors are located in the storage/feed area and are set to alarm if a release is detected.  The alarms are both visual (exterior mounted strobe light) and audible (located both inside the plant and on the exterior).  After normal working hours, the detector sensors also alarm an automatic phone dialer that notify key plant personnel that a release has occurred.  Specific activity procedures are in place for after-hour emergency notifications.\n\n\nFive-Year Accident History\n\nThe Clifton Water District has not ever had any accidental releases since the plant was constructed in 1979.\n\n\nEmergency Response Program\n\nIt is the opinion of the Clifton Water District Board of Directors and Management that the Clifton Water District's water treatment plant is currently in compliance with the EPA's Accidental Release Prevention Rule and all applicable State of Colorado codes and regulations.  This response plan is supported by the Mesa County Local Emergency Planning Committee (LEPC), the Clifton Fire District, and the Grand Junction Fire Department's HAZMAT Team.  The Clifton Fire District and the Grand Junction Fire Department's HAZMAT Team have toured the water treatment plant and are prepared for and are ready to respond to a release at this facility.\n\n\nPlanned Changes to Improve Safety\n\nThe Clifton Water District continually reviews processes and practices regarding the operation of the water treatment plant and its specific components (eg. the chlorine handling/storage/feed system component).  If hazards and risks are identified that were previously overlooked "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4300,
      "SummaryText": "or not identified, changes to practice and procedure are implemented as needed.  As a part of the five-year plant expansion plan, the chlorine handling/storage/feed facility will be completely revamped  to meet all current State of Colorado and Chlorine Institute requirements.\n\nThe treatment plant operators are continually reviewing and evaluating new technologies and methods for water disinfection.  If a new technology or method presents itself to the unique treatment requirements of the Clifton Water District's water source that reduce or eliminate the need for using liquified chlorine, evaluation and consideration of cost-effective outcomes would be persued."
    }
  ]
}