{
  "FacilityID": 43015,
  "FacilityName": "Germantown Power Plant",
  "FacilityStr1": "N96 W19298 County Line Road",
  "FacilityStr2": null,
  "FacilityCity": "Germantown",
  "FacilityState": "WI",
  "FacilityZipCode": "53022",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55131",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "43.195833",
  "FacilityLongDecDegs": "-088.149444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.we-energies.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 603165481,
  "ParentCompanyName": "Wisconsin Energy Corporation",
  "Company2Name": "Wisconsin Electric Power Company d/b/a We Energies",
  "CompanyDUNS": 157305780,
  "Company2DUNS": 7947385,
  "OperatorName": "Daniel R. Adams",
  "OperatorStr1": "333 W. Everett Street",
  "OperatorStr2": "Mail Code (A231)",
  "OperatorCity": "Milwaukee",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53203",
  "OperatorZipCodeExt": "0001",
  "RMPContact": "Daniel R. Adams",
  "RMPTitle": "Senior Air Quality Specialist",
  "FTE": 5,
  "OtherEPAFacilityID": "53022GRMNTN96W1",
  "EPAFacilityID": "100000170227",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "00-RV-027",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2009-11-18 00:00:00",
  "AnniversaryDate": "2010-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 43.20139,
  "FRS_Long": -88.15,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61896,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 43015,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63343,
          "ProcessID": 61896,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81709,
          "ProcessID": 61896,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581709,
          "ProcessID": 61896,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43015,
      "SummaryText": "The Germantown Power Plant burns natural gas or fuel oil in five combustion turbine units to generate electricity for distribution on the Wisconsin Electric Power Company (doing business as We Energies) system during times of peak power demand. The station is subject to the Risk Management Plan (RMP) regulations because it has a turbine inlet air cooling system which contains anhydrous ammonia in excess of the threshold quantity listed in the U.S. Environmental Protection Agency's RMP regulations.This system was installed in 2000 to increase electrical generating capacity in the summer months by cooling the turbine inlet air. Cooling the inlet air to a combustion turbine increases its power output. The anhydrous ammonia is used in a closed loop refrigeration system to make ice at night and on weekends to keep the water in the storage tanks cold. The turbine inlet air is cooled by the cold water circulating inside cooling pipes at the turbine inlet. There are two identical, totally enclosed refrigeration systems designed to current International Institute of Ammonia Refrigeration (IIAR) Standards. A significant release of ammonia to the environment is highly unlikely. The Germantown Power Plant has completed an exhaustive safety and design review under OSHA Process Safety Mangement Regulations, 2 CFR 1910.119. This requires a complete analysis of the anhydrous ammonia process from a catastrophic release and safety perspective prior to it being placed into service. This document can be reviewed by contacting the We Energies' offices. It is We Energies policy to not only adhere to the Federal and State laws and regulations governing the use of this chemical, but to extend safety, health, and environmental efforts beyond that of government requirements. Therefore, We Energies and its employees are committed to the safety and health of the employees and the welfare of our community. The Germantown Power Plant is supported by the internal corporate safety, health, and env"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43015,
      "SummaryText": "ironmental staff as well as a number of outside professional consultants. We Energies' emergency response planning program is based on the OSHA, EPA, and Coast Guard models for Hazardous Waste Operations and Emergency Response guidelines. The Germantown Power Plant has an interactive HAZMAT structure within the facility. The system consists of We Energies' employees working with the Washington County Local Emergency Planning Committee (LEPC), its Emergency Management Director, and contracted emergency response services and is active twenty-four hours a day to deal with any emergency related to the anhydrous ammonia. Real-time monitoring devices are located in strategic areas to warn of any ammonia release. This coupled with the most current fabrication and construction methods employed in the system further reduces the potential for major releases. Security measures are also provided by isolating the site with fencing, locked gates, and lighting. THE GENERAL ACCIDENTIAL RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE PLANNING: The facility complies with the OSHA Process Safety Management Standard for anhydrous ammonia. As part of the requirements, a Process Hazard Analysis (PHA) was performed in the form of a Hazard and Operability Study (HAZOP) including a review of mechanical integrity. As a result of this, the process and instrument diagrams (P&ID's) were reviewed as part of the accident prevention program. All valves, gangs, and headers have been placed on the roof where possible to reduce potential exposure of employees. This also reduces the potential from strike damage. Component parts are also being replaced based upon a specific schedule as established under mechanical integrity. The system is also being evaluated for leaks via real-time ammonia analyzer. All workers involved with the system have been trained regarding system safety and operation. All operations are supported by written operating instructions. An emergency response plan in the case of an "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43015,
      "SummaryText": "ammonia release has been prepared. It has also been provided for review to the Washington County LEPC and is updated as needed by We Energies corporate safety, environmental, and health staff. Changes to improve safety are an on-going process within We Energies and will continue to follow this philosophy at this facility. All changes in the ammonia system will follow the Management of Change component of the Process Safety Management Plan as prescribed by OSHA. FIVE YEAR ACCIDENT HISTORY: No accidents involving the ammonia system have occurred since the system was placed into service in 2000."
    }
  ]
}