{
  "FacilityID": 43010,
  "FacilityName": "Charles A. Strain Water Treatment Plant",
  "FacilityStr1": "510 34 Road",
  "FacilityStr2": null,
  "FacilityCity": "Clifton",
  "FacilityState": "CO",
  "FacilityZipCode": "81520",
  "Facility4DigitZipExt": "9703",
  "FacilityCountyFIPS": "08077",
  "LEPC": "Mesa County LEPC",
  "FacilityLatDecDegs": "39.078889",
  "FacilityLongDecDegs": "-108.422500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.cliftonwaterdistrict.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Clifton Water District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Clifton Water District",
  "OperatorStr1": "510 34 Road",
  "OperatorStr2": null,
  "OperatorCity": "Clifton",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81520",
  "OperatorZipCodeExt": "9703",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000051285",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-11-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-06-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-06-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 39.078889,
  "FRS_Long": -108.4225,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61868,
      "AltID": null,
      "FacilityID": 43010,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 81681,
          "ProcessID": 61868,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63315,
          "ProcessID": 61868,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23166,
              "Process_NAICS_ID": 63315,
              "SafetyReviewDate": "2005-05-31 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute Standard pamphlets",
              "FR_Comments": null,
              "HazardReviewDate": "2005-05-04 00:00:00",
              "ChangeCompletionDate": "2005-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Chlorine scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-05-04 00:00:00",
              "TrainingReviewDate": "2005-05-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Chlorine Response 8hr Refresher",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-12-13 00:00:00",
              "EquipmentInspectionDate": "2005-05-23 00:00:00",
              "EquipmentTested": "Scrubber, alarms, detection system",
              "ComplianceAuditDate": "2005-05-31 00:00:00",
              "AuditCompletionDate": "2005-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2004-12-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24217,
                  "PreventionProgram2ID": 23166,
                  "ProcessChemicalID": 81681
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43010,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-12-30 00:00:00",
    "ERTrainingDate": "2005-01-18 00:00:00",
    "CoordinatingAgencyName": "Grand Junction Fire Dept Haz Mat",
    "CoordinatingAgencyPhone": "9702441400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43010,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policy\n\nThe United States Environmental Protection Agency (EPA) requires that all facilities (both public and private) which utilize specific hazardous chemicals above defined threshold quantities in their processes, be in compliance with the requirements of the Clean Air Act (CAA) 40 CFR 112r Part 68.  The Clifton Water District (CWD) utilizes liquefied chlorine in the treatment of water for use by the public.  Chlorine is on the list of hazardous chemicals covered by the threshold limits within the CAA.  The requirements presented in the CAA regarding processes that utilize hazardous chemicals identify specific safety precautions regarding handling and storage of the listed hazardous chemicals.  The Clifton Water District has specific release prevention and emergency response procedures in place to help prevent chemical exposure to water treatment personnel as well as the general public, given the life, health and safety hazards associated with liquefied chlorine.  It is the policy of the CWD to strictly adhere to all applicable Federal and State rules, regulations, and safety precautions.\n\nIt is the opinion of the Clifton Water District¿s Board of Directors and Management that the emergency action response plan utilized by the CWD is in compliance with OSHA¿s Employee Emergency and Fire Prevention Plan, 29 CFR Part 1910.38.  The emergency action plan includes procedures for notifying the Clifton Fire District and the Grand Junction Fire Department¿s Hazardous Materials Team (HAZMAT) to respond to hazardous chemical releases at the water treatment plant, and to notify all potentially affected neighbors.\n\nFacility Description and Activities\n\nThe Clifton Water District provides domestic potable water to approximately 35,000 customers located in the unincorporated portion of Mesa County, generally referred to as `Clifton¿ (roughly the area encompassed from I-70 to the Colorado River and 30 Road to 34.5 Road), along"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43010,
      "SummaryText": "with a detached service area in the vicinity of Whitewater, CO.  The water treatment plant, along with the main business office is located at 510 34 Road, Clifton, CO.  The CWD processes water from the Colorado River through conventional water treatment practices as well as additional finish water treatment through a process utilizing membrane technology.\n\nChlorine is delivered in one-ton bulk containers by certified chemical transportation companies to the water treatment plant where it is off-loaded into the detached chlorine storage/feed facility.  The chlorine storage/feed facility is enclosed within a hardened `post-treatment¿ chemical structure.  This structure contains individual rooms for container storage, chlorinator feed systems, and the scrubber unit.  All rooms are separated by fire walls and are fire sprinkled.  The chlorine is fed to the treated water as a part of the final disinfection process prior to delivery to the end user.  The feed system utilizes two one-ton containers that are automatically switched from empty to full via the vacuum manifold system.  The system is on a routine monitoring regimen by treatment plant personnel as well as continuous monitoring by the treatment plant¿s secure SCADA system.  In the event of a leak, the SCADA system automatically shuts down the chlorine feed system, activates the scrubber, and notifies personnel, either via the onsite alarm system or the off-normal hour auto dialer.\n\nAccess to the water treatment plant facility is controlled via locked automatic gates and security fencing surrounding the facility.  The post-treatment chemical feed structure is locked and alarmed at all times to prevent unauthorized access.  All treatment plant personnel are thoroughly trained regarding the hazards and risks associated with chlorine for both themselves and the general public.  Specific regulatory operational and maintenance procedures are in place and strictly followed by all plant personnel.  Procedural and personn"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43010,
      "SummaryText": "el audits are performed on an annual basis to identify hazards or risks that may have been overlooked or not previously identified.\n\nWorst Case Release Scenario\n\nNot required for this Executive Summary.\n\nAlternate Scenario\n\nNot required for this Executive Summary.\n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nIt is the opinion of the Clifton Water District Board of Directors and Management that the Clifton Water District¿s water treatment plant is currently in compliance with the EPA¿s Accidental Release Prevention rule and all applicable State of Colorado Codes and regulations.  The original water treatment plant was constructed in 1979 to all applicable codes and building requirements in force at that time.  The plant underwent expansion in 1981 and again in 1997.  Each time the plant was expanded, all applicable codes and requirements were followed and recommended chlorine handling modifications were implemented.  In 1999, the District identified the need for a revamped chlorine handling and feed facility.  This new facility was placed in service in December 2004.  Final project acceptance was completed in May 2005.  The new system equipment and components related to receiving, feed process and final discharge of chlorine are inspected daily by trained plant personnel and maintained and serviced according to equipment manufacturer¿s recommendations.  The water treatment personnel have been trained to follow specific operational and maintenance procedures while utilizing the chlorine process.\n\nPlant personnel perform daily checks and inspections of the chlorine handling/storage/feed system.  The new facility has a complete and thorough maintenance schedule system in place.  This system is current with the new facility components installed as a part of the new facility.  Chlorine leak detection sensors are located in the container storage and chlorinator feed areas and are set to alarm if a release is detected.  The alarms are both v"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43010,
      "SummaryText": "isual (exterior mounted strobe lights) and audible (located both inside the plant and on the exterior).  The system is on a routine monitoring regimen by treatment plant personnel as well as continuous monitoring by the treatment plant¿s secure SCADA system.  In the event of a leak, the SCADA system automatically shuts down the chlorine feed system, activates the scrubber, and notifies personnel, either via the onsite alarm system or the off-normal hour auto dialer.  Specific activity procedures are in place for off-normal hour emergency notifications.\n\nFive-Year Accident History\n\nThe Clifton Water District has not had any accidental releases since the plant was constructed in 1979.\n\nEmergency Response Program\n\nIt is the opinion of the Clifton Water District¿s Board of Directors and Management that the Clifton Water District¿s emergency response plan is currently in compliance with the EPA¿s Accidental Release Prevention rule and all applicable State of Colorado Codes and regulations.  The response plan is supported by the Mesa County Local Emergency Planning Committee (LEPC), the Clifton Fire District, and the Grand Junction Fire Department¿s HAZMAT Team.  The Clifton Fire District and the Grand Junction Fire Department¿s HAZMAT Team have toured the water treatment plant and are prepared for and are ready to respond to releases at this facility.\n\nPlanned Changes to Improve Safety\n\nThe Clifton Water District continually reviews processes and practices regarding the operation of the water treatment plant and its specific components (eg. the chlorine handling/storage/feed system component).  If hazards and risks are identified, changes to practice and procedure are implemented as needed.  Based on previous hazard and risk analysis reviews, the District recently completed construction of a new post-treatment chemical facility, which includes the District disinfection component, the chlorine handling/storage/feed system.  This new facility was placed in service in Decem"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43010,
      "SummaryText": "ber 2005.  The new facility is compliant with all current State of Colorado and Chlorine Institute requirements.  It also includes security upgrades identified in the District¿s recently completed Vulnerability Assessment submitted to the EPA.  The treatment plant operators continue reviewing and evaluating new technologies and methods regarding potable water disinfection.  If a new technology or methodology were to be identified and developed that presents itself to the unique treatment requirements of the Clifton Water District¿s water source that reduce or eliminate the need for using chlorine,  evaluation and consideration of cost-effective outcomes would be pursued."
    }
  ]
}