{
  "FacilityID": 43047,
  "FacilityName": "Bear Mountain Limited",
  "FacilityStr1": "7001 Camino Grande Drive",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93306",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.419167",
  "FacilityLongDecDegs": "-118.926333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "SW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 166117804,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Bear Mountain Limited",
  "OperatorStr1": "34759 Lencioni Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "CAL000141376",
  "EPAFacilityID": "100000133786",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "S-2049-0-1",
  "SafetyInspectionDate": "2004-12-22 00:00:00",
  "SafetyInspectionBy": "Bakersfield Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-06-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2019-04-01 00:00:00",
  "AnniversaryDate": "2010-06-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 35.41975,
  "FRS_Long": -118.92569,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61935,
      "AltID": "Ammonia Process",
      "FacilityID": 43047,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 81756,
          "ProcessID": 61935,
          "ChemicalID": 56,
          "Quantity": 13500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63383,
          "ProcessID": 61935,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36058,
              "Process_NAICS_ID": 63383,
              "SafetyReviewDate": "2004-09-08 00:00:00",
              "PHA_Date": "2005-02-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Human Factors",
              "PHACompletionDate": "2005-08-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Deluge, Diffusion Tank, Plant Rounds",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Tank Cooling",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-03-29 00:00:00",
              "TrainingReviewDate": "2004-09-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-03-29 00:00:00",
              "EquipmentInspectionDate": "2005-05-17 00:00:00",
              "EquipmentTested": "Emergency Shut Down Valve",
              "ChangeMgmtDate": "2003-04-23 00:00:00",
              "ChangeMgmtReviewDate": "2005-05-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2005-02-22 00:00:00",
              "AuditCompletionDate": "2005-10-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-12-17 00:00:00",
              "HotWorkPermitReviewDate": "2004-12-17 00:00:00",
              "ContractorSafetyReviewDate": "2005-01-07 00:00:00",
              "ContractorSafetyEvalDate": "2005-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 52351,
                  "PreventionProgram3ID": 36058,
                  "ProcessChemicalID": 81756
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43047,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-02-14 00:00:00",
    "ERTrainingDate": "2005-02-15 00:00:00",
    "CoordinatingAgencyName": "City of Bakersfield Fire Department",
    "CoordinatingAgencyPhone": "6613263649",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CCR Title 8 - Cal OSHA",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43047,
      "SummaryText": "Introduction\n\nA Risk Management Program (RMP) been implemented at Bear Mountain Limited to reduce accidental releases of hazardous materials.  This RMP summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to the community.  This executive summary is organized to correspond with specific requirements, including:  \n\n-The accidental release prevention and emergency response policies at the stationary source;\n-The stationary source and regulated substances handled;\n-The general accidental release prevention program and chemcial specific prevention stepsl;\n-Five-year accident history;\n-Emergency response plan; and\n-Planned changes to improve safety.\n\n\nBear Mountain Limited Policies to Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at Bear Mountain Limited; this  RMP formalizes and documents activities to address these concerns.  Bear Mountain Limited is committed to conducting its operations in a safe and responsible manner and to reducing risks to health and environment. \n\nThis commitment to health and environment starts with management.  Management demonstrates this commitment by investing resources in accident prevention efforts, such as ensuring that safety systems are incorporated into the design, installation, operation, and maintenance of the facility.  Management implements both administrative and engineering controls to minimize the risk of an uncontrolled release of a hazardous substance.  Bear Mountain Limited¿s commitment to safety is also demonstrated in the training programs, which provide information on preventing accidents through knowledge of hazards and safe work practices.\n\n\nFacility and chemical Identification\n\nBear Mountain Limited is located at 7001 Camino Grande Drive, Bakersfield, California. Bear Mountain Limited is a limited partnership of separate private investors.  The facility produces electricity and steam utilizing a natural-gas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43047,
      "SummaryText": "-fueled turbine.  The facility uses anhydrous ammonia to minimize air pollution from the turbine exhaust.  The anhydrous ammonia reacts with the nitrogen oxides in the exhaust gas stream to form nitrogen and water.  Use of anhydrous ammonia results in a greater than 90% reduction of nitrogen oxide emissions. \n\nAnhydrous ammonia is regulated under Federal Enivronmental Protection Agency RMP regulations, California Accidental Release Prevetion regulations, and California OSHA Process Safety Management Regulations.  \n\nThe maximum amount of ammonia that will be stored at Bear Mountain Limited is 2,500 gallons, or 13,500 pounds.  The ammonia process at Bear Mountain Limited is therefore subject to Federal EPA RMP as a level 3 program, CalARP program regulations as a program level 3 process, and California OSHA Process Safety Management.\n\n\nWorst-Case Release Scenario \n\nThe CalARP regulations define a worst-case release scenario for materials that are normally gases at ambient conditions and that are handled as a gas or a liquid under pressure as a release of the entire material as a gas over a 10-minute period.  \n\nThe worst-case release for Bear Mountain Limited would therefore be the catastrophic failure of the anhydrous ammonia tank.  The ammonia is maintained as a liquid via pressurization, and the quantity is limited by an administrative control, resulting in a maximum of 13,500 pounds of ammonia to potentially be released over a 10-minute period.\n\nThe toxic endpoint for ammonia, 200 parts per million (ppm), is based upon the Emergency Release Planning Guideline (ERPG) Level 2. This level is defined as  \"the maximum airborne concentration below which nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\"\n\nOff Site consequence modeling was performed using the RMP*Comp program (V.1.07) shows that the worst-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43047,
      "SummaryText": "case release could travel 1.5 miles downwind to the toxic endpoint of 200 ppm.  This worst-case release distance could affect the public receptors of 7,215 people as estimated using LandView V Census 2000 Population Estimator, The Canyons Bike Path, Thorner Elementary School, Highland High School, and Chapman Middle School. \n\nIt should be noted that the worst-case release scenario is an extremely unlikely event.  Also, qualified individuals operate the process, and the ammonia equipment is inspected and maintained according to an established preventive maintenance schedule, which further reduces the likelihood of an occurrence.\n\nAlternative Release Scenario\n\nAn alternative release scenario, which is more credible than the worst-case scenario, was also modeled for ammonia in the hazard assessment using RMP Comp V 1.07 and population estimates were provided using LanView Census 2000.  In the alternative release scenario, a break in the ammonia transfer hose from the delivery truck to the ammonia bulk head. In this case, the amount of ammonia released would be minimal.  The alternative release scenario selected assumes that the hose break would be small enough to maintain the flow rate at less than 100 gpm and the excess flow valve would not close.  For this alternative release scenario it is further assumed that facility operators would shut down the transfer process therefore isolating the ammonia in the tank within 1 minute. Resulting in a release of 100 pounds of ammonia.  The dispersion modeling showed that a release could affect off-site receptors at a toxic endpoint of 0.1 miles where the 200 ppm would be reached. The alternative release scenario would affect 0 population and The Canyons Bike Path. \n\n\nGeneral Accidental Release Prevention Program\n\nThe required elements of a prevention program are in place at Bear Mountain Limited to minimize the risk of hazardous chemical releases in accordance with the CalARP Program and Federal EPA RMP Level 3, and Cal OSAH PS"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43047,
      "SummaryText": "M requirements.  The prevention program provides a structured approach to preventing accidents.  Specific activities in the prevention program include the following:\n\n- Process safety information is provided to all employees upon hire and is accessible at all times.\n\n- In-depth process hazard analyses are completed by a team of qualified personnel using techniques appropriate for the complexity of the process. \n\n- Written operating procedures (kept current and reviewed annually) are used for training and guiding the  work of qualified operators.\n\n- Training is provided to all employees upon hire and at least every three years or more frequently upon request, and all qualified operators must demonstrate the cabability to operate and understand the process through a documented training program and an oral board.\n\n- Operators, mechanics, and contractor personnel are qualified professionals who are trained in the hazards present in the facility and informed of any temporary situations affecting safety.\n\n- A program is in place to maintain the mechanical integrity of the process.  Program elements include written procedures, training requirements, equipment deficiency requests for employees, work orders, scheduled maintenance, and computerized documentation.\n\n- Incidents are investigated and corrective actions are taken as part of a continuous improvement effort.\n\n- Routine audits are conducted to assure that safe practices are being followed.\n\nThis systematic approach to process safety involves employees and strives for continuing improvements in overall safety.  The training, qualifications, and safety awareness of Bear Mountain Limited¿s operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\n\n\nFive-Year Accident History\n\nCalARP-defined accidents are serious incidents with either 1) on-site deaths, injuries, or significant property damage or 2) known off-site deaths, injuries, property damage, or environmental damage."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43047,
      "SummaryText": "The CalARP regulations require facilities to identify and discuss any accidents within the last five years that meet the above definition.  There have been no CalARP defined accidents at Bear Mountain Limited since the facility began operations in April 1995.\n\n\nEmergency Response Plan\n\nAn emergency response plan has been implemented at Bear Mountain Limited to protect employees, ensure public safety, and protect the environment. Plant personnel are trained to the First Responder Operational level using the California Office of Emergency Services California Specialized Training Institute (CSTI) First Responder Operations program; therefore, Bear Mountain Limited personnel are considered defensive emergency responders.  \n\nThe facility¿s emergency response plan provides procedures for responding to a chemical release emergency, including the potential release of anhydrous ammonia.  The procedures include instructions for response, communication, first aid, evacuation, accounting for personnel, and company and agency notification procedures.  An emergency response plan has been submitted to the City of Bakersfield Fire Department.\n\n\nContinued Safety Activities \n\nChemical safety is an important part of Bear Mountain Limited operations.  Appropriate training and implementation of regulatory requirements have minimized chemical exposure risks to employees and the public through ongoing internal risk reduction efforts.  Other safety improvements will be evaluated, approved by management, and implemented as part of an on-going commitment towards a safe working environment. Currenlty Bear Mountain Limited is reviewing the items identified in Appendix B Recommendations of the latest Process Hazard Analysis. Please refer to Appendix B of the PHA (attached) to review the activities currently under review to increase safety at Bear Mountain Limited."
    }
  ]
}