{
  "FacilityID": 43067,
  "FacilityName": "Specialty Polymers, Incorporated",
  "FacilityStr1": "2475 Progress Way",
  "FacilityStr2": null,
  "FacilityCity": "Woodburn",
  "FacilityState": "OR",
  "FacilityZipCode": "97071",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41047",
  "LEPC": "Salem Fire Department",
  "FacilityLatDecDegs": "45.156111",
  "FacilityLongDecDegs": "-122.834722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6148720,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Raymond Southwell",
  "OperatorStr1": "2475 Progress Way",
  "OperatorStr2": "P.O. Box 299",
  "OperatorCity": "Woodburn",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97071",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Pinkerton",
  "RMPTitle": "Safety Environmental Officer",
  "FTE": 65,
  "OtherEPAFacilityID": "97071SPCLT2475P",
  "EPAFacilityID": "100000163921",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 45.15617,
  "FRS_Long": -122.83467,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 61964,
      "AltID": "Polymer and adhesive mfg.",
      "FacilityID": 43067,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63412,
          "ProcessID": 61964,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 81840,
          "ProcessID": 61964,
          "ChemicalID": 29,
          "Quantity": 280000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 581840,
          "ProcessID": 61964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43067,
      "SummaryText": "1.  Introduction\n\nIn a series of rules promulgated between 1994 and 1998, the U.S. Environmental Protection Agency established the Risk Management Program (RMP) under Clean Air Act Section 112r.  The RMP contains a list of toxic and flammable chemicals. Facilities that manage more than a theshold amount of a listed chemical may be subject to the RMP.  Covered facilities must assess the risks associated with their management of the listed chemicals and produce a plan to prevent releases and accidents.  In order to assist in emergency planning, covered facillities must evaluate \"worst case\" and \"alternative case\" scenarios that would result from the release of a listed chemical.  This document is part of the Specialty Polymers, Inc. (SPI) Woodburn Plant's RMP communication effort.   \n\nThis document comprises the RMP plan for the SPI Woodburn Plant.  The plan contains a description of all the procedures and provisions to reduce the likelihood and severity of an RMP regulated substance release or accident.  The RMP plan is based upon a complete assessment of the processes, operations, and procedures of the plant and an analysis of potential releases of RMP regulated substances that may occur at the plant and their impacts on the offsite populations.\n\n2.  Accidental Release Prevention and Emergency Response Policies\n\nSPI has a long-standing commitment to provide a safe workplace and to prevent accidental releases.  This commitment is set forth in SPI health and safety policies:\n\n* We will ensure our operations and products are free from significant risks to the health and safety of our employees, customers, carriers, distributors, the general public, and to the environment.\n\n* We will meet or exceed all applicable laws and regulations, participate in voluntary initiatives, and strive for continual improvement in our Environmental, Health, and Safety performance.\n\n* We will provide our employees with a safe workplace and support their efforts to work safely.\n\n* We will st"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43067,
      "SummaryText": "rive to eliminate or reduce emissions, discharges, and waste from every stage of our operations.\n\n* We will communicate, listen, and be responsive to our employees, customers, neighbors, and government and will share information concerning potential hazards resulting from our operations and/or products.\n\nSPI is committed to proactive analysis for hazard identification and mitigation.  We have formal programs to verify that our facility is being operated in accordance with accepted industry practices, company standards and legal requirements.\n\nThe types of risk management programs required by the RMP have long been in place at SPI Woodburn.  Safe operation is a plant and company priority, and is refelcted in policies as well as everyday activities.  \n\n3.  Facility and Regulated Substances Handled\n\nThe SPI Woodburn plant is a specialty chemical manufacturing facility that produces a variety of non-hazardous water-based polymeric emulsions.  This activity is described by SIC code 2821 and NAICS code 325211.  Approximately fifty products are manufactured at the plant using different mixtures of reactants.  These products are used by our customers to manufacture water-based paints, adhesives, caulks, and other household and industrial products.  The SPI facility is located in Woodburn, Oregon at 2475 Progress Way, 0.26 miles northwest of the intersection with Hood Avenue.  \n\nOne RMP regulated substance is used at the facility:  vinyl acetate monomer.  The vinyl acetate process vessels used in the manufacture of emulsions are mechanically and electronically monitored and alarmed to notify process personnel of potentially unusual pressures and temperatures.  Process feed rates are controlled automatically to manage the reaction, and standard operating procedures are in place to safely manage the chemicals, the reactions, and any unusual events.  Operators are rigorously trained, updated and tested on the standard operating procedures.\n\nVinyl acetate is almost always receiv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43067,
      "SummaryText": "ed by rail car and pumped, via the top loading system, to the storage tank through installed steel lines.  The rail siding is protected by a spill collection system that provides the means to pump spilled material into the storage tanks.  When vinyl acetate is transferred from the rail car, the quantity required is pumped to a load-cell controlled tank and then pumped into a reactor which contains the water required for the emulsion.  Here it is mixed with with additives and reacted.  This process prevents over charging, and the water in the reactor is sufficient to prevent a runaway reaction.  When the reaction is complete, the vinyl acetate is converted to a water-based polymer and is no longer hazardous.\n\n4.  Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe SPI Woodburn plant is fully committed to maintaining a safe workplace.  We prevent accidents by taking measures to create and maintain safe conditions in all aspects of our operations including design, operations, and handling.  Plant prevention programs are designed in accordance with the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) and EPA RMP standards.  Examples of our safety protection measures include:\n\n* Redundant safety systems and instrumentation;\n* Automatic shutdown devices that are triggered if critical safety equipment malfunctions;\n* Secondary containment for storage tanks;\n* Alarm system and automatic shutdown devices for critical control parameters;\n* Pressure relief devices to prevent overpressurization;\n* Fire protection and vapor suppression systems;\n* Written procedures and training programs;\n* Highly trained and experienced operators;\n* Operator surveillance of unloading operations;\n* Permit system to control work in hazardous areas;\n* Preventative maintenance program for equipment;\n* Work preplanning;\n* Controlled entry to plant site;\n* Environmental, Health,and Safety (EHS) review for managing change in new and ex"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43067,
      "SummaryText": "isting processes.\n\n5.  Five-Year Accident History\n\nThere have been no accidental releases of vinyl acetate at the SPI Woodburn Plant that resulted in onsite or offisite death, injuries, evacuations, sheltering in place, property damage, or environmental damage since the facility was constructed in 1973.\n\n6.  Emergency Response Program\n\nSPI is included in the community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA).  In accordance with 68.90(b), SPI employees are trained to only contain the spill, evacuate the facility as required, and notify the facility emergency contact as well as offsite emergency responders.  A senior management employee serves as the facility emergency contact, is on-call 24-hours a day, is authorized to expend necessary funds, and is qualified to furnish facility information and technical support to the emergency responders.  As part of our commitment to workplace and community safety and environmentally-sound business practices, SPI maintains an Emergency Response Plan to mitigate the impact of releases, accidents, fires, explosions, natural disasters, and health emergencies.  This practice further mitigates the probability of a vinyl acetate release through involvement in an unrelated accident.\n\n7.  Planned Changes to Improve Safety\n\nIt is our belief that effective environmental, health, and safety systems must be continually improved.  We constantly strive to recognize areas for improvement and implement the changes necessary to achieve our goals.  We have developed and put into place sufficient layers of protection to prevent escalation from a single failure to a catastrophic event.\n\nSPI has installed new measuring devices and emergency shut off devices on the bulk monomer tanks.  In addition, SPI has installed new digital temperature recorders for the reactors.  These improvements have been made to process equipment in Building 2 and are planned to be implemented in Building 1 in 200"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43067,
      "SummaryText": "5."
    }
  ]
}