{
  "FacilityID": 43164,
  "FacilityName": "Kentucky Glass Plant",
  "FacilityStr1": "200 West Loudon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lexington",
  "FacilityState": "KY",
  "FacilityZipCode": "40508",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21067",
  "LEPC": "Fayette LEPC",
  "FacilityLatDecDegs": "38.061111",
  "FacilityLongDecDegs": "-084.486944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6386395,
  "ParentCompanyName": "GE Consumer and Industrial",
  "Company2Name": null,
  "CompanyDUNS": 1367960,
  "Company2DUNS": 1367960,
  "OperatorName": "Kentucky Glass Plant",
  "OperatorStr1": "200 West Loudon Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Lexington",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40508",
  "OperatorZipCodeExt": null,
  "FTE": 115,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000086462",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "V-99-008",
  "SafetyInspectionDate": "2010-02-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-06-17 12:30:29",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-09-27 00:00:00",
  "DeRegistrationEffectiveDate": "2010-08-28 00:00:00",
  "AnniversaryDate": "2010-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 38.061379,
  "FRS_Long": -84.486775,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62080,
      "AltID": "HF Acid Storage",
      "FacilityID": 43164,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 81964,
          "ProcessID": 62080,
          "ChemicalID": 55,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63530,
          "ProcessID": 62080,
          "NAICSCode": "32721",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23249,
              "Process_NAICS_ID": 63530,
              "SafetyReviewDate": "2009-12-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "National Fire Protection Association Vol 1-10; National Electric Code",
              "FR_Comments": null,
              "HazardReviewDate": "2006-04-20 00:00:00",
              "ChangeCompletionDate": "2006-07-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Camera system fed to computer monitor",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Facility to cease production July 23, 2010",
              "OpProceduresReviewDate": "2009-12-01 00:00:00",
              "TrainingReviewDate": "2009-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Honeywell Training",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-12-01 00:00:00",
              "EquipmentInspectionDate": "2006-05-15 00:00:00",
              "EquipmentTested": "70% HF Storage Tank",
              "ComplianceAuditDate": "2009-05-15 00:00:00",
              "AuditCompletionDate": "2009-08-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2006-04-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24305,
                  "PreventionProgram2ID": 23249,
                  "ProcessChemicalID": 81964
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43164,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fayette County LEPC",
    "CoordinatingAgencyPhone": "8592583784",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 43164,
      "SummaryText": "gral part of working safely at GE. The prevention program ensures that proper safety information is in place; operating procedures are followed; chemical hazards are identified; employees and contractors are trained; and critical equipment is properly inspected and maintained. Our prevention program meets all aspects of the accidental release prevention program requirements of the EPA's Risk Management Program.\n\nThere are many specific safety features in place at the facility. Some of the features in place at GE Kentucky Glass facility to prevent a chemical accident include:\n\n* Safety procedures that reduce the potential for human error which could lead to a storage tank overfill;\n\n* Secondary containment dike at the tank truck off-loading area to contain the full contents of the tank truck;\n\n* Secondary containment dikes around the chemical storage tanks to contain a spill;\n\n* Full enclosure of the storage tanks in a separate on-site building;\n\n* Operation of a fume scrubber which removes chemicals from the air exhausted from within the chemical storage and working areas;\n\n* Extensive safety information about the processes available to employees;\n\n* Written operating procedures that identify plant policies on emergency response actions;\n\n* Comprehensive employee and contractor training programs to promote consistently safe work-practices;\n\n* Scheduled maintenance programs to ensure equipment reliability - includes equipment testing and inspections;\n\n* Compliance auditing to ensure standards are being followed;\n\n* A safety procedure to review proposed plant modifications before they are implemented for possible hazards; \n\n* Annual HF training for Frost personnel plant employees, management and environmental, health and safety personnel.\n\n* Safety reviews prior to startup of our processes; and\n\n* Annual exercises with local Fire Dept, Hazmat Team, police, hospital ER and internal personnel.\n\n0.6 FIVE YEAR ACCIDENT HISTORY\n\nThe Kentucky Glass Plant has an outstanding"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43164,
      "SummaryText": "record of accident prevention, which demonstrates its commitment to public and worker safety. Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.\n\nThe RMP requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impact be reported in this document.  GE Consumer and Industrial has not had any reportable incidents involving HF within this five-year history that resulted in on-site impacts as defined by the EPA.  \n\n0.7 PARTICIPATION IN EMERGENCY RESPONSE\n\nThe Kentucky Glass Plant is included in the community response plan of the local fire department and its Hazardous Materials Response Team. Also, we are represented on the Local Emergency Planning Committee (LEPC).  The Plant has participated and will continue to participate with these entities in mock emergency response drills at the plant in order to facilitate any future response needs.\n\nOur most recent exercise was held in December 2010, and consisted of a table-top exercise with GE personnel, members of the Lexington Fire Department, the local hospital, Hazmat team, plant staff and onsite medical personnel.  This exercise is an important step in testing our combined readiness for the unlikely event of a medical emergency at our plant site.  \n\n0.8 CHANGES TO IMPROVE SAFETY\n\nGE Consumer and Industrial is committed to continuously improving the overall safety and environmental performance record at the Kentucky Glass Plant. Some of the more important modifications that we have made to our manufacturing operation in the last five years include:\n\n* Replacing flexible chemical transfer hoses with hard piping to minimize the chance of an accidental release; \n\n* Reducing the strength of our acid solutions to make the manufacturing process intrinsically less hazardous; \n\n* Replacing the HF acid fume scrubber;\n\n* Replacing the HF bulk storage tank with a new tank (replacement in kind)\n\n* Replacing the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43164,
      "SummaryText": "flexible hose at the frosting machine with a hard piping/manifold system\n\n* Removal of the limestone rock in the outside containment.\n\nWe believe that these projects will pay dividends in terms of ensuring the safety for our employees, neighbors in the community and our environment."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43164,
      "SummaryText": "EXECUTIVE SUMMARY\n\n0.1 INTRODUCTION\n\nThis Risk Management Plan is part of GE Consumer and Industrial's continuing commitment to minimize the potential impact from our facility on our workers, our community neighbors and the environment. It is the stated policy of GE to safely manage our site operations. In addition, we have prepared contingency plans to be used in the unlikely event that a major accident should occur.\n\nWe believe it is important for all interested parties to have access to information that can help them better understand our business and our facility. To further that objective, we conducted a Shelter-In-Place educational exercise with the local community in concert with the Division for Emergency and Environmental Management.  This was done to better educate the surrounding neighborhood on the steps to follow if a release should occur.  If you have any questions about this document, or any other aspect of our company or our plans, please contact our EHS Manager at (859) 425-1226.  Kentucky Glass Plant also conducts annual exercises with local Fire Dept, Hazmat Team, Police, hospital ER and internal personnel.\n\n\nSince the initial Risk Management Plan was submitted in June of 1999, a second submittal in June of 2000, and a third submittal June 2005, we have taken several significant steps to improve the safety and efficiency of the component of our manufacturing operation that uses highly hazardous chemicals. For a description of some of these important changes, see the section of this document entitled Changes to Improve Safety.\n\n0.2 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nOur company is committed to operating safe and environmentally sound manufacturing facilities everywhere we do business.  Protection of our neighbors and workers is the highest priority.  This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities.\n\nIn order to pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43164,
      "SummaryText": "ovide top quality products for our customers, the GE Consumer and Industrial Kentucky Glass Plant uses in its manufacturing process a chemical, hydrofluoric acid (HF) that is classified as toxic. We are committed to complying with governing laws, regulations, and engineering standards as well as systematic assessments to manage and maintain a safe operation when using this chemical. Our operating practices and procedures ensure that numerous controls are implemented to prevent an accidental release of a chemical.  However, under the unlikely event that a major release would occur, we immediately notify the local Hazardous Materials Response Team of the Fire Department.\n\n0.3 DESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES\n\nThe GE Consumer and Industrial facility located at 200 West Loudon Avenue in Lexington, Kentucky produces glass for light bulbs of various applications in commercial and residential use. One step in producing one line of light bulbs is to frost the glass in order to provide an opaque type surface on the inside of the bulb to aid in diffusing light from the filament.  The Kentucky Glass Plant uses aqueous hydrofluoric acid (HF) in the frosting of light bulb glass. Hydrofluoric acid is diluted to produce the solutions that are sprayed into the inside of the bulbs. Several steps are required in the frosting operation to initially etch, rinse and then properly fortify the bulbs for strength.\n\nThe HF is received by tanker truck and is transferred to a storage tank that is contained in a totally enclosed building with its own deluge system and camera feed to computer. When needed, HF is transferred from the storage tank to mixing tank for dilution to the concentrations needed to produce the proper frosting solutions. Other ingredients are also added at this time to the solutions. The solutions are then pumped to holding tanks that supply the spray heads used to frost the glass bulbs. Spent solutions are neutralized on site.\n\n0.4 HAZARD ASSESSMENT"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43164,
      "SummaryText": "RESULTS\n\nAs part of our risk management planning, we have specifically identified the type of event that, should it ever occur, could have the most negative impacts on our workers,  neighbors and the environment. This is known as the Worst-Case Scenario (WCS). As defined by EPA, we are required to assume that the numerous engineering and administrative safety controls we have in place to prevent or mitigate such accidents have all failed at once.\n\nThis worst-case scenario would involve the release of 70% HF acid from a delivery tank truck at the off-loading area. A worst-case scenario assumes a catastrophic failure that essentially results in the instantaneous release of the entire tank truck contents. In this event, that volume is 40,000 pounds of 70% HF acid which would be released into the containment dike. Under this scenario, the acid is assumed to evaporate and the vapors disperse in the direction of the prevailing wind. According to EPA guidelines, exposure to HF at levels above 20 parts per million (20 part HF in a million parts of air) for approximately one hour can result in serious health effects. The worst-case scenario estimates that this level of HF concentration could reach public receptors from our site as a result of this quantity of HF being instantaneously released from the delivery tank truck.\n\nA scenario using more realistic assumptions involves the failure of a chemical hose used to transfer the 70% HF acid from our supplier's tank truck to our storage tank. EPA defines this as the Alternative Release Scenario (AIR). The contents of the tank truck would drain through the failed hose into a containment dike, forming a pool that would be pumped into the plant's neutralization system.\n\n0.5 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM/ CHEMICAL-SPECIFIC PREVENTION STEPS\n\nGE Consumer and Industrial has a comprehensive program to prevent accidental releases of highly hazardous chemicals at its Kentucky Glass Plant. This prevention program is an inte"
    }
  ]
}