{
  "FacilityID": 43224,
  "FacilityName": "Optic Fertilizer, Incorporated",
  "FacilityStr1": "6090 Optic Road",
  "FacilityStr2": null,
  "FacilityCity": "Gibbon",
  "FacilityState": "NE",
  "FacilityZipCode": "68840",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31019",
  "LEPC": "Buffalo County LEPC",
  "FacilityLatDecDegs": "40.731111",
  "FacilityLongDecDegs": "-098.920556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nutraflo.com",
  "FacilityEmailAddress": "dlohry@kay-flo.com",
  "FacilityDUNS": 87066718,
  "ParentCompanyName": "Kay-Flo Industries",
  "Company2Name": null,
  "CompanyDUNS": 617594601,
  "Company2DUNS": null,
  "OperatorName": "Dirk Lohry",
  "OperatorStr1": "6090 Optic Road",
  "OperatorStr2": null,
  "OperatorCity": "Gibbon",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68840",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": "NER000005884",
  "EPAFacilityID": "100000160764",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-09-01 00:00:00",
  "SafetyInspectionBy": "State Fire Marshall's Office",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-06-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-06-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.5",
  "FRS_Lat": 40.730938,
  "FRS_Long": -98.92048,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62162,
      "AltID": "1",
      "FacilityID": 43224,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82065,
          "ProcessID": 62162,
          "ChemicalID": 56,
          "Quantity": 181072.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63617,
          "ProcessID": 62162,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36175,
              "Process_NAICS_ID": 63617,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "PHA_Date": "1999-06-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Rupture",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-03-01 00:00:00",
              "TrainingReviewDate": "2004-08-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-08-01 00:00:00",
              "EquipmentInspectionDate": "2005-06-20 00:00:00",
              "EquipmentTested": "Weekly inspection of system for leaks or other problems",
              "ChangeMgmtDate": "2005-04-01 00:00:00",
              "ChangeMgmtReviewDate": "2005-04-01 00:00:00",
              "PreStartupReviewDate": "2002-08-01 00:00:00",
              "ComplianceAuditDate": "2005-04-01 00:00:00",
              "AuditCompletionDate": "2005-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-04-01 00:00:00",
              "HotWorkPermitReviewDate": "2005-04-01 00:00:00",
              "ContractorSafetyReviewDate": "2005-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2005-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 52535,
                  "PreventionProgram3ID": 36175,
                  "ProcessChemicalID": 82065
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 63618,
          "ProcessID": 62162,
          "NAICSCode": "325312",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43224,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-04-12 00:00:00",
    "ERTrainingDate": "2003-08-01 00:00:00",
    "CoordinatingAgencyName": "Gibbon Fire Department",
    "CoordinatingAgencyPhone": "3084686118",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 43224,
      "SummaryText": "Name:  Dirk Lohry\n\n\nSignature:\n\n\nTitle:  Vice-President\nDate signed:  06-27-2005"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43224,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at Optic Fertilizer, Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility¿s primary activities encompass production of liquid starter fertilizer 10-34-0, 7-21-7, 4-10-10, and shipment of 9-18-9.  We have one regulated substance present at our facility.  This substance is Ammonia (anhydrous).  Ammonia is used to control the pH and also to react with phosphoric acid, ammonium nitrate and other raw materials to produce fertilizer.\n\n\n3.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nOptic Fertilizer, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified perso"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43224,
      "SummaryText": "nnel with expertise in engineering and process operations and are revalidated at a regular interval of every 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.  We are currently in the process of preparing to conduct a PHA update of the facility.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Nutra-Flo Optic Facility maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  A major revision is underway for the operating instructions.\n\nTraining\nOptic Fertilizer, Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nOptic Fertilizer, Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Optic Fertilizer, Inc., to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a mo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43224,
      "SummaryText": "dification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Optic Fertilizer, Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nOptic Fertilizer, Inc., conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  Routine safety and environmental audits are conducted by the HS&E manager.\n\nIncident Investigation\nOptic Fertilizer, Inc., promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nOptic Fertilizer, Inc., truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Optic Fertilizer, Inc.,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43224,
      "SummaryText": "has a strict policy of informing the contractors of known potential hazards related the contractor¿s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n4.\tFive-year Accident History\nOptic Fertilizer, Inc., has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n5.\tEmergency Response Plan\nOptic Fertilizer, Inc., has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nBuffalo County Emergency Services is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.  The Gibbon Fire Department is the first responder to any incident.  One of the plant employees is a HAZMAT trained member of the Gibbon Fire Department.\n\n6.\tPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  This facility was inspected by OSHA Consultation in September of 2002.  The findings from that visit were corrected within the agreed time periods.  \n Certification Statement\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete."
    }
  ]
}