{
  "FacilityID": 43251,
  "FacilityName": "Hasa Inc. - Longview WA",
  "FacilityStr1": "3539 Industrial Way",
  "FacilityStr2": null,
  "FacilityCity": "Longview",
  "FacilityState": "WA",
  "FacilityZipCode": "98632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53015",
  "LEPC": "Cowlitz County LEPC",
  "FacilityLatDecDegs": "46.130000",
  "FacilityLongDecDegs": "-122.990833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "hasainc@hasapool.com",
  "FacilityDUNS": 9656075,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hasa Inc.",
  "OperatorStr1": "23119 Drayton St",
  "OperatorStr2": null,
  "OperatorCity": "Saugus",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91350",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dave Johnson",
  "RMPTitle": "EHS Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192427",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-07-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62212,
      "AltID": null,
      "FacilityID": 43251,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63670,
          "ProcessID": 62212,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82130,
          "ProcessID": 62212,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582130,
          "ProcessID": 62212,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43251,
      "SummaryText": "Executive Summary - Risk Management Program (RMP)\n\nLongview WA, Facility\n\nHasa manufactures sodium hypochlorite and distributes other chlorine-based disinfectants \nfor protection of potable and waste water facilities; disinfection of sewage and waste \nwater; disinfection of dairy premises and meat processing plants; bleaching and \ndisinfection of laundry; disinfection of hospital operating rooms and related areas; egg \ncleaning and sanitization; washing solutions for fresh fruits and vegetables; and \ndisinfection of water contained in swimming pools, spas, hydrotherapy tubs, and \nrecreational water.  ?Recreational water? is a relatively new term and includes water \nsystems in amusement parks with water slides.  Sodium hypochlorite, commonly known \nas ?bleach?, is manufactured by reacting liquefied chlorine with dilute caustic solution \nunder controlled conditions of temperature and pressure.\n\nAlong with many other segments of the American economy, Hasa recognizes there is a \nnew reality, which requires a heightened level of vigilance and increased communication \nwith law enforcement and security agencies.  Hasa has taken proactive measures to \nupgrade its security so that its products will continue to be manufactured, stored and \ntransported in a manner that protects the public?s health and safeguards our environment.\n\nChlorine has been part of our country?s public health defenses for over 100 years.  As \nsuch, chlorine chemistry is part of nation?s first line of defense against terrorism.  \nChlorine-based disinfectants are used by 98% of modern water purification plants to kill \nbacteria and viruses.  This is an essential factor in delivering safe water to homes for \ndrinking, cooking, and bathing.  On top of the every day protection, chlorine also \neffectively kills many potential biological warfare agents.  \n\nIn the event of a terrorist attack using an airborne biological warfare agent, bleach can be \nused to decontaminate surfaces subject to such attacks.  Chlor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43251,
      "SummaryText": "ine chemistry is also \nindispensable to the manufacture of vinyl bags which contain donated, bullet proof vests, \nand gas masks that are used by police officers and our troops in the field, as well as the \nsafety gear that is employed daily by firefighters throughout the nation.\n\nHasa remains committed to the safe manufacture and distribution of its products that are \nessential to our economy, our way of life, and our national security needs.  Hasa supports \npolicies designed to ensure that America?s roads, skies, railways, and shipping remain as \nsecure thoroughfares for commerce and travel.  Hasa is committed to doing its part in this \ntime of national emergency to promote public safety and security, and we are working \ncooperatively with other industries and government agencies on these issues of critical \nimportance.\n\nAs mentioned above, Hasa manufactures commercial, institutional, industrial, and \nhousehold ?bleach,? also known by the chemical name ?sodium hypochlorite? by \nreacting liquefied chlorine with dilute caustic solution under controlled conditions.  \nLiquefied chlorine is the only material on-site, which is regulated under the \nEnvironmental Protection Agency Risk Management Plan (EPA RMP) and Occupational \nand Safety Health Administration Process Safety Management (OSHA PSM) programs. \nHasa also repackages and distributes a variety of compounds for disinfection and \ntreatment of potable and recreational water, wastewater, and sewage. \n\nPolicy\n\nHasa continuously evaluates its operations to ensure that the highest levels of safety, \nprotection of human health, and protection of the environment have been attained. Hasa \nmaintains a scientific and technical staff to meet these public and environmental needs. \nThe facility has been constructed in accordance with nationally recognized standards of \ngood practice.\n\nHistory of the Facility\n\nThe Hasa site in Longview, Washington is property that Hasa Inc. leases from Equapac, a \nchemical manufacturer and dist"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43251,
      "SummaryText": "ributor of a variety of chemicals including chlorine and \nsodium hydroxide (caustic soda).  Equapac in turn leases from the property owner, \nWeyerhaeuser, a pulp mill manufacturing facility.  The pulp mill opened for business in \n1931.  The mill produces a wide range of paper products, including paperboard, \ncorrugating medium, newsprint, and fine papers.  The Equapac and Hasa Inc. facility are \nco-located on Weyerhaeuser?s previously shutdown Chlor-Alkali manufacturing plant \nlocation.\n\nHasa?s first manufacturing facility opened in 1964 at the Saugus, California location.  \nSubsequently, Hasa expanded the business through acquisitions and construction of \nadditional plants. Hasa acquired the swimming pool sodium hypochlorite manufacturing \nand distribution division of Purex and all operations of the GPS Division of All Pure \nChemical Company, itself a division of Pioneer Chemical Company. The Purex and GPS \noperations were consolidated at the Saugus plant. Three new plants were constructed: one \nin Eloy in 1982 (Phoenix area), Arizona; one in Pittsburg in 1997, California, and this \none in Longview, Washington. The manufacture and unloading processes at all plants are \nessentially identical.  During the past forty-one years Hasa facilities have never \nexperienced a chlorine release.\n\nThe liquefied chlorine unloading system and bleach manufacturing module at Saugus \nsurvived two major earthquakes with no structural damage or loss of contents: the one in \nSylmar in 1972; the other with an epicenter in Northridge in 1994. The unloading system \nand bleach-manufacturing module survived the earthquakes without damage, and \nmanufacture of sodium hypochlorite solutions was restarted without any system repair or \nmodification after appropriate safety reviews.\n\n\nLongview Facility\n\nThe unloading system and bleach-manufacturing module at the Longview facility are \nstate-of-the-art installations with redundant active and passive mitigation safety controls \nin place. There are c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43251,
      "SummaryText": "hlorine gas sensors located strategically throughout the facility. If \nchlorine gas is detected, an automatic fail-safe-to-close valve system immediately closes \nthe valves on the railroad tank car, which contains chlorine. Hasa unloads millions of \npounds of liquefied chlorine annually at the four sodium hypochlorite solutions \nmanufacturing facilities. In the past forty-one years Hasa has unloaded more than 5,000 \nrailroad tank cars containing liquefied chlorine without any loss of contents.\n\n\nPrevention Program\n\nHasa is subject to the Occupational Safety and Health Administration?s Process Safety \nManagement (PSM) Prevention Program level 3.  The program consists of sections on \nEmployee Participation, Process Safety Information ?PSI?, Process Hazard Analysis \n?PHA?, Operating Procedures, Training, Outside Contractor Requirements, Pre-Start up \nReview ?PSR?, Mechanical Integrity, Hot Work Permits, Management of Change, \nIncident Investigation, Emergency Planning and Response, and Compliance Audits.\n\nEmergency Response\n\nHasa has in place an emergency response program in the event of a release of chlorine. \nHasa HAZMAT employees are trained to respond to leakage in accordance with \nDepartment of Transportation requirements. Hasa has on site a Chlorine Institute \nEmergency Kit C, which contains fittings, hoods and devices to respond to and mitigate \nunlikely leaks from tank cars.\n\nPlanned Changes to Improve Safety\n\nHasa continually monitors and evaluates safety equipment and procedures.  At the \npresent time there are no planned changes to improve the safety or to change procedures, \nsince the chlorine unloading system and bleach manufacturing module at the Longview \nfacility are already state-of-art installations with redundant active and passive mitigation \nsafety controls in place.  Hasa may periodically replace pipe, piping, valves, motors, and \nrelated items with pipe, piping, valves, motors, and related items, which meet the original \ndesign specifications, i."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43251,
      "SummaryText": "e., are identical with the original items.  \n\nFive-Year Accident History\n\nHasa has experienced no releases of chlorine at the Longview facility since production \ncommenced in July 2005."
    }
  ]
}