{
  "FacilityID": 43311,
  "FacilityName": "DuPont Performance Elastomers L.L.C.",
  "FacilityStr1": "4242 Camp Ground Road",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40216",
  "Facility4DigitZipExt": "4698",
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.216667",
  "FacilityLongDecDegs": "-085.843056",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 966339293,
  "ParentCompanyName": "DuPont Performance Elastomers L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 933194151,
  "Company2DUNS": 933194151,
  "OperatorName": "DuPont Performance Elastomers LLC",
  "OperatorStr1": "4242 Camp Ground Road",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40216",
  "OperatorZipCodeExt": "4698",
  "FTE": 264,
  "OtherEPAFacilityID": "40216DDLSV4242C",
  "EPAFacilityID": "100000041279",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "108-99-TV",
  "SafetyInspectionDate": "2004-01-14 00:00:00",
  "SafetyInspectionBy": "EPA - RMP Inspection",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-06-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2008-02-29 00:00:00",
  "DeRegistrationEffectiveDate": "2008-01-18 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 38.219361,
  "FRS_Long": -85.840056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "facility returned the last railcar containing chlorine to its supplier",
  "_processes": [
    {
      "ProcessID": 62287,
      "AltID": "Chlorine railcar",
      "FacilityID": 43311,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82249,
          "ProcessID": 62287,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63746,
          "ProcessID": 62287,
          "NAICSCode": "325212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36272,
              "Process_NAICS_ID": 63746,
              "SafetyReviewDate": "2002-12-03 00:00:00",
              "PHA_Date": "2004-03-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Audit vs. DuPont Chlorine Toxic Material Standard",
              "PHACompletionDate": "2000-12-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installed emergency cutoff switch in the field; also installed barricades at road crossings to protect chlorine piping at roadway",
              "OpProceduresReviewDate": "2003-10-30 00:00:00",
              "TrainingReviewDate": "2003-11-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer-based individual training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-15 00:00:00",
              "EquipmentInspectionDate": "2004-05-26 00:00:00",
              "EquipmentTested": "Safety Disc #004341",
              "ChangeMgmtDate": "2004-03-30 00:00:00",
              "ChangeMgmtReviewDate": "2003-07-01 00:00:00",
              "PreStartupReviewDate": "2004-03-25 00:00:00",
              "ComplianceAuditDate": "2003-08-22 00:00:00",
              "AuditCompletionDate": "2004-03-31 00:00:00",
              "IncidentInvestigationDate": "2004-04-14 00:00:00",
              "InvestigationChangeDate": "2004-06-30 00:00:00",
              "ParticipationPlansReviewDate": "2004-06-02 00:00:00",
              "HotWorkPermitReviewDate": "2002-05-06 00:00:00",
              "ContractorSafetyReviewDate": "2004-03-04 00:00:00",
              "ContractorSafetyEvalDate": "2003-06-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 52688,
                  "PreventionProgram3ID": 36272,
                  "ProcessChemicalID": 82249
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43311,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-11-01 00:00:00",
    "ERTrainingDate": "2003-04-03 00:00:00",
    "CoordinatingAgencyName": "Louisville/Jefferson County LEPC",
    "CoordinatingAgencyPhone": "5025743900",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Louisville Metro Hazardous Materials Ordinance"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 43311,
      "SummaryText": "lant, its product, and its use of a substance regulated under the Risk Management Plan rule\n* A general overview of the plant's programs to prevent accidental releases and a list of the layers of protection in place to prevent accidental releases of the regulated substance\n* A five-year history of the plant's accidental releases of the regulated substance\n* A description of the plant's emergency response program\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Dupont Performance Elastomers L.L.C. Louisville Plant is committed to the safe and responsible operation and maintenance of its manufacturing process.  Corporate and site goals are to prevent all accidental releases and process safety incidents.  The Louisville plant has both corporate and local management policies and practices supporting these goals.  Performance against these goals is continually evaluated and communicated.  Achievement of goals is recognized and rewarded in various ways, including financially; the failure to attain the goals is regarded as unacceptable performance and treated accordingly.\n\nBeyond the goal of preventing accidental releases, the site's policy is to respond immediately and appropriately to any accidental releases or process safety incidents that occur.  This response is to minimize the impact of the release or incident on the safety of the work force and the public, and the environment.  To achieve this, members of the work force from all shifts are trained as emergency responders and are available on-site at all times.\n\nSite Identification and Regulated Substance Handled\n\nThe DuPont Performance Elastomers L.L.C. Louisville Plant is located in the Louisville, Kentucky, metropolitan area, on property leased from DuPont.  The address is 4242 Camp Ground Road.  Prior to the establishment of the wholly-owned subsidiary on July 1, 2005, the facility was owned and operated by DuPont Dow Elastomers L.L.C., a 50/50 joint venture between DuPont and the Dow Chemical"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43311,
      "SummaryText": "Co.\n\nThe Louisville plant produces Neoprene (polychloroprene) synthetic rubber using chloroprene as its primary raw material.  Neoprene is used in a broad range of automotive, general industrial, aerospace, building construction, household, and consumer applications.  Typical products include CV joint boots, air springs, belts and hoses, electrical cord and cable insulation, bridge bearings, sealants, adhesives, gaskets, inflatable boats, waders, gloves, and soles for shoes and sandals.  DuPont Performance Elastomers L.L.C. also manufactures Neoprene in La Place, Louisiana.\n\nChlorine, a substance listed as toxic under the Risk Management Plan rule, is used as a raw material at the Louisville plant for the production of a co-monomer used to make certain grades of Neoprene.  Chlorine is the only listed substance at the Louisville facility that is present in amounts above the threshold quantity.  It is delivered to the site in 90-ton railcars.  Only one railcar supplies chlorine to the production process at a time.  The Louisville plant has, at most, two chlorine railcars on-site at any time.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nDuPont Performance Elastomers L.L.C. continues to employ the same concepts of accidental release prevention and process safety management as its sole owner.  Site practices that incorporate these concepts include the following:\n\n* Thorough understanding of process technology, including the safe limits of the processes and the proper materials of construction for equipment\n* Proper design and installation of equipment\n* Systematic process hazard reviews to identify and address process hazards\n* Written operating and maintenance procedures\n* Extensive training for all persons who operate or maintain chemical process equipment\n* Mechanical integrity testing for detection of potential equipment problems and preventive maintenance to avoid releases\n* Mechanical quality assurance programs to ensure th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43311,
      "SummaryText": "at the correct spare parts are installed whenever maintenance is performed\n* Procedures to identify and manage both obvious and subtle changes in technology, equipment, and personnel, that could have an effect on the site's safety and environmental performance\n* Pre-startup safety reviews for newly installed or modified equipment\n* Compliance audits to ensure that process safety management principles, procedures, and regulations are effective and properly implemented\n* Investigation of actual and potential incidents to identify and implement corrective actions\n* Participation of all employees in the process safety management system\n* Documented safe work practices, including hot work procedures requiring the issuance of hot work permits\n* Contractor safety management system to ensure that work done by contractors is performed safely and in compliance with the standards of DuPont Performance Elastomers L.L.C. and its sole owner.\n\nIn addition to the site-wide practices described above, the following items provide multiple layers of protection against accidental releases of chlorine:\n\n* Automatic air-operated valves that can isolate the active railcar (the one currently supplying chlorine to the production process) by remote control if necessary.  These valves have an emergency air supply as a backup for the plant's compressed air system.  The time required to close these valves is approximately five seconds.\n* Interlocks that automatically shut off the chlorine supply in the event of certain process deviations\n* Excess flow valves that close automatically if the chlorine flow rate indicates a potential line leak\n* Continuous video camera surveillance of the chlorine railcars from the process control room\n* After being placed in the desired location, each chlorine railcar is kept from moving by the railcar's hand brake and by chocks on the wheels.  A motion detector is activated that will automatically close the valves at the active railcar if it is moved.\n* Highly sen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43311,
      "SummaryText": "process areas where flammable materials are present, to minimize the potential for a chlorine release in the event of a fire.\n  + Replacement of pressure relief valves on the chlorine supply line with a balanced-bellows design for improved performance and reliability.\n  + Installation of a field-mounted emergency switch for automatically closing emergency cutoff valves in the chlorine supply line and at the chlorine railcar.\n  + Insertion of alarm switches between each chlorine safety disc and its outlet-mounted pressure relief valve to identify any loss of integrity of the safety discs.\n  + Installation of protective barricades for the chlorine supply line at road crossings in the plant\n  + Improvements to preventive maintenance inspections and procedures\n  + Improvements to training programs, including implementation of an annual mandatory chlorine awareness and safety training package by all site employees.\n  + Ongoing periodic process safety audits to identify any deficiencies in the plant's management systems\n\nFive-Year Accident History\n\nSince July l, 2000, the Louisville Plant has had no accidental releases involving chlorine that resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  During the five-year period, there have been no reportable releases of chlorine.\n\nEmergency Response Program\n\nThe DuPont Performance Elastomers L.L.C. Louisville Plant has developed and implemented an emergency response program for the purpose of protecting public health and the environment.  This program includes a written emergency response plan, maintained at the site, containing procedures for informing the public and local emergency response agencies in the event of an accidental release.  Documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposures to regulated substances is included in the plan."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43311,
      "SummaryText": "Procedures and measures for emergency response after an accidental release of a regulated substance are also part of the plan.  This plan is coordinated with the community emergency response plan developed by the Louisville and Jefferson County Local Emergency Planning Committee (LEPC).\n\nIn addition, the site's emergency response program includes procedures for the use, inspection, testing, and maintenance of emergency response equipment.  Under the program, training is provided to all employees in procedures relevant to their roles in an emergency situation.  The program provides procedures to review and update the emergency response plan to reflect changes at the site, and to communicate the updated plan to employees.\n\nPlanned Changes to Improve Safety\n\nAs part of the plant's process hazards analysis procedures, the manufacturing process involving chlorine is thoroughly studied periodically to identify opportunities for further risk reduction.  At this time, the plant has completed the implementation of all feasible risk reduction measures identified through these studies.  The plant will continue to look for ways to further improve its safety performance on a site-wide basis."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43311,
      "SummaryText": "sitive, state-of-the-art chlorine detectors, located around the railcar unloading spots and along the chlorine supply line, that sound an alarm in the computerized process control system when a leak is detected.  These detectors are checked and calibrated monthly.  In addition, the detectors have a self-test capability that sounds an alarm when the detector element fails.\n* A dedicated emergency scrubber system designed to absorb and neutralize the entire contents of the chlorine supply line plus the amount of chlorine that would go into the process in a ten-minute period.  This provides capacity needed in the event that the automatic shutoff valves at the active railcar fail to operate, requiring an operator to close the valves manually.\n* Valves isolate the chlorine supply line into two sections.  Either section can be vented to the emergency scrubber system, if necessary.  All of the valves in the chlorine supply line can be operated remotely from the process control system.\n* The mechanical integrity of the chlorine supply line is verified by periodic visual inspections and by annual thickness measurements.  All bends in this line are X-rayed annually to detect any evidence of corrosion or erosion that would reduce metal thickness and compromise mechanical integrity of the line.\n* Flexible unloading hoses that connect the railcars to the chlorine supply line are replaced annually.\n* When hoses are disconnected from the railcars, the free ends are covered to keep moisture out of the chlorine line.\n* Extensive training in safe chlorine unloading procedures is given to all operators who have responsibility for this area.  Operators are recertified through retraining and a written test every three years.\n* Process hazard reviews of the chlorine system are conducted at least every five years.  All recommendations arising from these reviews have been completed, resulting in:\n  + Substitution of Inconel as the material of construction for the chlorine supply piping in"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43311,
      "SummaryText": "Executive Summary\nRisk Management Plan (RMP)\nDupont Performance Elastomers L.L.C. - Louisville Plant\n\nIntroduction\n\nEffective July 1, 2005, Dupont Performance Elastomers L.L.C. (DPE) is a global supplier of specialty elastomer products with headquarters in Wilmington, Delaware.  DPE is a wholly owned subsidiary of E. I. Du Pont de Nemours and Company (DuPont).  DuPont Performance Elastomers polymer products have end-use applications in automotive systems, wire and cable, construction, chemical processing, the general rubber industry, and in high-performance parts requiring excellent temperature, oil, and chemical resistance.  Examples of the end products that are made with DPE materials include:\n\n* Coatings - from rainwear to liners for roofs and tanks;\n* Automotive products - from power steering pressure hoses to high-performance timing belts;\n* Wire and cable insulation - from electrical wiring to power transmission cable; and\n* Industrial applications - from protective gloves, O-rings, and gaskets to microwave door enclosures and chemical-resistant hoses.\n\nThe Clean Air Act Amendments of 1990 established a statutory framework for assessing the risks to public health and the environment arising from the use of certain chemicals.  Regulations specifying what facilities must conduct these risk assessments, how to assess the risk, and what data to report were promulgated by the U.S. Environmental Protection Agency.  These regulations are known as the Risk Management Plan (RMP) rule and are published in Part 68 of Title 40 of the Code of Federal Regulations.  This executive summary is provided in compliance with 40 CFR § 68.155 of the RMP rule.\n\nThe following sections provide a brief overview of the comprehensive risk management activities that have been implemented by DuPont Performance Elastomers L.L.C. at its Louisville, Kentucky, plant.  Topics include:\n\n* The plant's policies for preventing accidental releases and responding to emergencies\n* The location of the p"
    }
  ]
}