{
  "FacilityID": 43350,
  "FacilityName": "Arkansas Refrigerated Services",
  "FacilityStr1": "11 North B and 24/25 North D Street",
  "FacilityStr2": null,
  "FacilityCity": "Fort Smith",
  "FacilityState": "AR",
  "FacilityZipCode": "72902",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05131",
  "LEPC": "Sebastian County Emergency Ser",
  "FacilityLatDecDegs": "35.392806",
  "FacilityLongDecDegs": "-094.426833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "arkansasrefrigerated.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Arkansas Refrigerated Services",
  "OperatorStr1": "P.O. Box 2554",
  "OperatorStr2": null,
  "OperatorCity": "Fort Smith",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72902",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rusty Butler",
  "RMPTitle": "Facility Systems Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192016",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-04-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-04-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-05-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62330,
      "AltID": "ammonia refrigeration",
      "FacilityID": 43350,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63792,
          "ProcessID": 62330,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82297,
          "ProcessID": 62330,
          "ChemicalID": 56,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582297,
          "ProcessID": 62330,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43350,
      "SummaryText": "1.0  Accidental Release Prevention And Response Policies\n\nAt Arkansas Refrigerated Services (ARS), we are committed to operating and maintaining all of our processes (especially those involving hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  ARS maintains an open dialogue with local emergency responders and has provided them with a copy of its Emergency Response Plan, detailing important facility-specific information.  This document, or Risk Management Plan (RMP), provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including the following:\n\n?    a description of our facility and its use of anhydrous ammonia, in a single process, which is a regulated substance under EPA?s Risk Management Program Rule (RMP Rule),\n?    a summary of results from our assessment of the potential off-site consequences from possible accidental chemical releases,\n?    an overview of our accidental release prevention programs,\n?    a five-year accident history for accidental releases of anhydrous ammonia,\n?    an overview of the Emergency Response Program, and\n?    an overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment.\n\n\n2.0  Arkansas Refrigerated Services and Regulated Substances\n\n    ARS?s primary activity involves the refrigeration/freezing of agricultural products (beef, poultry, etc.) in a large warehouse facility.  In our facility, we use Anhydrous Ammonia (ammonia) that EPA has identified on the RMP Rule Toxic Substances list.\nThe ammonia is stored and used in the following locations and conditions at ARS:\n     \nTable 1.  Storage conditions for RMP Rule listed chemicals used at ARS.\nChemical    Process    Storage Temp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43350,
      "SummaryText": " (?F)    Storage pressure (psig)    Maximum Quantity (lbs)\nAnhydrous Ammonia    South Engine Room    -40 - 951    8.7 - 1812    9,500\nAnhydrous Ammonia    North Engine Room    -40 - 951    8.7 - 1812    9,300\nAnhydrous Ammonia    2nd Street Engine Room    35 - 951    51 - 1812    3,900\nAnhydrous Ammonia    B Street Engine Room    -40 - 951    8.7 - 1812    8,200\n1  Temperature varies by system component.\n2  Pressure varies by system component.\n\n\nAs this RMP will illustrate, our accidental release prevention programs and our emergency response planning efforts help us effectively manage any potential hazards posed by anhydrous ammonia.\n\n\n3.0  Accidental Release Prevention Program\n    \nARS maintains a number of programs to help prevent accidental releases and ensure safe operation.  In addition, ARS parallels the RMP Rule by complying with process safety management (PSM) as outlined in OSHA (29CFR 1910.119).  The following sections, as taken from ARS? PSM program, provide a brief summary of the release prevention program at our facility.\n\n3.1  Process Safety Information\n\nProcess Safety Information (PSI) is the first step in the PSM program before any Process Hazard Analysis can be completed.  PSI consists of employee participation in gathering and documenting information on each piece of ammonia refrigeration equipment and the ammonia refrigeration system as a whole.  This includes equipment information such as manufacturer, model, pressure settings, horsepower, operating ranges, etc.\n\n3.2  Process Hazard Analysis\n\n    Our facility conducts a process hazard analysis (PHA) to ensure that hazards associated with our processes are identified and controlled efficiently.  Designated refrigeration workers, supervisors, and managers and/or any other employee representative will meet as the PHA team to develop a ?What-If? Process Hazard Analysis.  Active participation is encouraged in the discussion of the standard What-Ifs and the development of new What-Ifs that would be site-specific for the facility.  After completion of the PHA, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43350,
      "SummaryText": "recommendations will be documented for future follow-up.\n\n3.3  Operating Procedures\n\n    Written standard operating procedures are maintained to ensure facility activities are conducted safely.  This includes site-specific standard operating procedures developed through meetings with refrigeration workers and discussing step-by-step actual procedures used for maintaining ammonia refrigeration equipment.\n    Also incorporated are existing safe work practices such as lockout/tagout; confined space entry; opening process equipment or piping, and control over entrance into a facility by maintenance, contractor, laboratory, or other support personnel.  Contractors and visitors to ARS are checked in and issued badges prior to access to any part of the facility.\n\n3.4  Training\n\n    Proper training is integral to PSM.  Training will take place for Operating Personnel including workbook training, hands-on training, emergency action/response training, mechanical integrity training, standard operating procedures, management of change procedures, etc.  General employees will be trained in PSM Orientation and emergency action/response procedures.  Regularly scheduled employee safety meetings are held monthly.  Key employees have trained in OSHA outreach ten hour courses.  All employees participate in regularly scheduled evacuation drills.\n\n3.5  Mechanical Integrity\n\nThere are written procedures for maintaining the on-going integrity of the process equipment.  Inspection and testing of the process equipment will also take place with any deficiencies corrected.  Operating personnel will be trained in Mechanical Integrity procedures.\n \n3.6  Management of Change\n\nWhen a change is intended for the Ammonia Refrigeration System, there are specific procedures to follow to ensure that all aspects of PSM have been updated and that every affected employee is informed of, and trained relative to the change.\n\n3.7  Pre-startup Reviews\n\n    When a significant change has taken place in the refrigeration sy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43350,
      "SummaryText": "stem (see also Management of Change) or for new systems, a pre start-up safety review is conducted to ensure that adequate safety measures are in place, PSM has been updated, and affected employees are trained prior to the introduction of ammonia or startup of a system.\n\n3.8  Compliance Audits\n\nThis is part of the on-going maintenance of the PSM program.  Every three years the entire PSM program will be audited to make sure every section has been maintained.  The facility may choose to do the audit themselves or to hire an outside company.  In either case, audit results will be documented and deficiencies corrected.  Any action as a result of the audit that would affect an employee?s work is communicated to them.\n\n3.9  Incident Investigation\n\nAn incident investigation team will be established to thoroughly investigate and analyze any catastrophic release or ?near misses?.  The team will prepare a report on the incident, which will be reviewed with all affected personnel.  Reports are used to determine the cause of the incident and potential corrective actions.\n\n3.10  Employee Participation\n\nParticipation begins with a written plan that includes employees in the development of the PSM program including gathering of Process Safety Information, developing the Process Hazard Analysis, developing actual site-specific standard operating procedures for the ammonia refrigeration equipment, and documenting access to the PSM program for all employees.  Involvement will include PSM Progress Meetings; Memos; Bulletins; and actual hands-on involvement in the PSM development.\nEmployees will be involved in the process of completing and maintaining the facility?s on-going Process Safety Management Program.\n\n3.11  Hot Work Permits\n\n    Written procedures have been prepared for obtaining a Hot Work Permit.  Refrigeration Operating Personnel who will perform Hot Work will be issued a Hot Work Permit for operations conducted on or near a covered process.  The permit will be kept on file u"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43350,
      "SummaryText": "ntil completion of the hot work operations.\n\n3.12  Contractor Information\n\n    PSM is not only concerned with employee safety but also contractor safety.  Information will be provided to the contract employees on safe work practices; known hazards; and the emergency action plan of the facility.  Documentation will be obtained from contractors to ensure that training of contractor employees in performing their specific job tasks and also in the known potential fire, explosion, or toxic release hazards related to his job and the process, and applicable provisions of the emergency action plan has taken place and is understood.  Contractors conducting Hot Work (including welding) are required to comply with the ARS Hot Work Permit Program.\n4.0  Chemical Specific Prevention Steps\n\n4.1  Anhydrous Ammonia\n\nSeveral process controls are in place to prevent and/or mitigate accidental releases of ammonia.  These controls include vents, pop-off relief valves (replaced facility wide in January 2005), check valves, manual shut-offs, interlocks, alarms, emergency back-up power, back-up pumps, rupture disks, and excess flow devices.  Passive mitigation includes placement of all refrigeration systems containing ammonia inside of engine rooms.  Process area detectors and perimeter monitors are in place to promptly alert ARS staff to accidental releases.  Ammonia condensers at ARS are oversized to enable operation at lower and safer head pressures.  The lower pressures mitigate potential release frequency and volume.\n\n\n5.0  Five Year Accident History\n\nThe following is a brief summary of significant accidental chemical releases involving materials covered under EPA?s RMP Rule during the previous five years.\n\n5.1  Ammonia\n\n    During the past five years, ARS has not had an accidental ammonia release, resulting in on-site or off-site site consequences, including deaths, injuries, significant property damage, environmental damage, off-site evacuation, or sheltering in place.  Although two accid"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43350,
      "SummaryText": "ental releases have occurred, neither resulted in such on-site or off-site consequences.\n\n\n6.0  Emergency Response Programs\n\nARS maintains an Emergency Action Plan (Emergency Response) as part of their PSM program.  No additional emergency response procedures have been established for the RMP as allowed by 40CFR 68.95 (b) and (c).  The program provides the essential planning and training for effectively protecting the workers, the public, and the environment during emergency situations.  The Plan includes the following components:\n\n?    procedures for informing the public and emergency responders of accidental releases,\n?    documentation of proper first aid/emergency medical treatment that may be necessary to treat exposure,\n?    emergency response procedures,\n?    procedures for using, inspecting, testing, and maintaining response equipment,\n?    employee training, and\n?    response plan review and update procedures.\n\nCoordination of the Plan with the Sebastian County Emergency Services and the Fort Smith Fire Department is an integral part of the verification process.  Safety and emergency response equipment is centrally located within the operation at ARS to be accessible to all employees in the case of an emergency.\n\n\n7.0  Planned Changes To Improve Safety\n\nARS is actively promoting public awareness and education programs concerning emergency response through the Sebastian County Emergency Services and the Fort Smith Fire Department.  This education process enhances the public?s ability to respond in a given emergency situation.  ARS continually strives to improve and upgrade operating procedures, replace or maintain equipment, and develop and implement safety improvement projects.  A list of proposed future improvements is as follows:\n\n?    Re-routing of pop-off valves so that in the event a valve is activated, gas is directed into a 1,500-gallon tank at each of the following locations:  B2, B1, N1, and S1/S2.  This tank contains water which neutralizes the gas and changes the che"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43350,
      "SummaryText": "mical makeup so that the odor of ammonia should be considerably reduced or eliminated.  Pop-off valve rerouting has been completed at all locations with the exception of N1, which should be completed by the end of May 2005.\n?    Automatic shut-off controls are currently being installed at all locations so that in the event of an accidental release in a storage compartment, ammonia pumps may be automatically shut off; also, hot gas lines may be stopped which will considerably reduce the amount of gas released.  Automatic shut-off control installation has been completed at all locations with the exception of N1, which should be completed by the end of May 2005."
    }
  ]
}