{
  "FacilityID": 43351,
  "FacilityName": "Pfizer Elk Grove Logistics Center",
  "FacilityStr1": "1350 Estes Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Elk Grove Village",
  "FacilityState": "IL",
  "FacilityZipCode": "60007",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "42.005278",
  "FacilityLongDecDegs": "-087.966389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1326495,
  "ParentCompanyName": "Pfizer, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1326495,
  "Company2DUNS": null,
  "OperatorName": "Pfizer, Inc.",
  "OperatorStr1": "1350 Estes Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Elk Grove Village",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60007",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "ILD 119572212",
  "EPAFacilityID": "100000192533",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-07-18 00:00:00",
  "ErrorReportDate": "2005-07-18 00:00:00",
  "ReceiptDate": "2005-07-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-07-07 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2014-10-02 00:00:00",
  "DeRegistrationEffectiveDate": "2014-10-02 00:00:00",
  "AnniversaryDate": "2010-07-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 42.005278,
  "FRS_Long": -87.966389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 62331,
      "AltID": "Distr Center Stora",
      "FacilityID": 43351,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82298,
          "ProcessID": 62331,
          "ChemicalID": 98,
          "Quantity": 38000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 82299,
          "ProcessID": 62331,
          "ChemicalID": 107,
          "Quantity": 163000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63793,
          "ProcessID": 62331,
          "NAICSCode": "325412",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43351,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-05-07 00:00:00",
    "ERTrainingDate": "2004-07-19 00:00:00",
    "CoordinatingAgencyName": "Elk Grove Fire Department",
    "CoordinatingAgencyPhone": "8474392121",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43351,
      "SummaryText": "(a) Release Prevention and Emergency Response Policies\n\nPfizer Inc., Elk Grove Logistics Center, located in Elk Grove Village, Illinois is a distributor of consumer healthcare products. There are no manufacturing processes on site. The Micatin product is the first material handled at the Elk Grove Logistics containing a Risk Management Planning (RMP) reportable material.\n\n\nElk Grove Logistics Center¿s environmental, health and safety policy is as follows:\n\nThe Elk Grove Logistics Center (EGLC) is committed to having the best environmental, health and safety performance in industry.  We will achieve this mission by developing a culture in which the protection of the environment, and colleague health and safety are embedded into each and every endeavor.  This culture will drive the ongoing integration of environmental, health and safety into all aspects of the EGLC with the overall objective of eliminating injuries, work-related illnesses and hazards to the environment.\n¿Environmental, health and safety performance will not be compromised for the sake of other business demands including productivity and profits.\n¿We will not be satisfied to simply meet the compliance standards for the environment, health and safety.  We will exceed the requirements to insure we are industry leaders.\n¿Environmental, health and safety incidents are preventable.  We will strive to insure that our programs are proactive on all accounts.\n¿Management is responsible for insuring colleagues have the knowledge, skills and equipment necessary to protect themselves and the environment from harm.\n¿Managements is responsible for insuring colleagues adhere to the requirements of the EGLC EHS program.\n¿Each colleague is responsible for their personal safety and health, the safety and health of their fellow colleagues and the protection of the environment.  This is a condition of employment.\n¿Concern for the environment, as well as, colleague safety and health, will be evident through the design of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43351,
      "SummaryText": "he facility, operation of the warehouse and the business decisions that we make.\n¿Continuous improvement is a way of life.  We will develop specific policies, procedures and practices to insure continual forward progress.\n¿Every task must be performed with a concern for the environment, safety and health.  This includes our selves, our fellow colleagues, our contractors, our visitors, our customers and the communities in which we operate.\n¿Protection of the environment, safety and health is a way of life around the clock.  This includes both on and off the job.\n\n(b) Stationary source and regulated substances handled:\n\nThe Elk Grove Logistics Center is a regional center for the distribution of consumer healthcare products.  A single product Micatin ¿, an aerosol consumer product stored in the Logistics Center, is covered by RMP requirements.  The propellant in Micatin is an 80/20 mixture of isobutene and propane.  Warehouse storage of Micatin is the sole RMP applicable process at the facility.  Storage is in cardboard shipping boxes containing four ounce steel cans on pallets.\n\n(c) The general accidental release prevention program and chemical-specific prevention steps:\n\nWhile the chances of a worst-case situation actually occurring are incalculable, such a scenario by definition is within the realm of possibility.  That is why the EGLC¿s first emergency management priority is accidental release prevention.\n\nWorst Case Release Scenarios were modeled using EPA¿s RMP*Comp v1.07.\n\nTo protect the facility¿s employees, the surrounding community and the environment; the EGLC¿s operations adhere to the RMP Rule Prevention Program 1 elements.\n\n(d) General accidental release prevention and chemical specific prevention steps\n\nThe center is access controlled via key card and manned guard station.  Sprinklers and fire extinguishers are provided.  The site has an on-site Emergency Response Team.  GE Gaps conducts annual fire safety inspections of the facility.\n\n(e) Five year acci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43351,
      "SummaryText": "dent history\n\nNo reportable incidents have occurred at the facility in the past five years.\n\n(h) Emergency response program\n\nThe center has an Emergency Response Plan that includes the requirements of the Superfund Amendments and Reauthorization Act (SARA) and communicates with the Cook County Central LEPC and local emergency-response organizations on matters pertaining to emergency preparedness and chemical storage.  The Micatin product is included in the emergency response plans.\n\n(g) Planned changes\n\nNone"
    }
  ]
}