{
  "FacilityID": 43360,
  "FacilityName": "City of Adrian, MI - Wastewater Treatment Plant",
  "FacilityStr1": "1001 Oakwood Road",
  "FacilityStr2": null,
  "FacilityCity": "Adrian",
  "FacilityState": "MI",
  "FacilityZipCode": "49221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26091",
  "LEPC": "Lenawee County LEPC",
  "FacilityLatDecDegs": "41.917222",
  "FacilityLongDecDegs": "-084.015278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Adrian",
  "OperatorStr1": "100 East Church Street",
  "OperatorStr2": null,
  "OperatorCity": "Adrian",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49221",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kenneth Wesley",
  "RMPTitle": "Wastewater Plant Superintendent",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000114191",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-06-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-06-14 00:00:00",
  "DeRegistrationEffectiveDate": "2007-05-19 00:00:00",
  "AnniversaryDate": "2009-10-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 41.90863,
  "FRS_Long": -84.01868,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62343,
      "AltID": "Wastewater Disinfection",
      "FacilityID": 43360,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63805,
          "ProcessID": 62343,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82316,
          "ProcessID": 62343,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582316,
          "ProcessID": 62343,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43360,
      "SummaryText": "The City of Adrian Wastewater Treatment Plant (WWTP) is committed to minimizing the risk to employees and to the public of injury or death from an accidental release of chlorine.  Chlorine gas is the only regulated substance at the WWTP and is used for disinfection of the City's effluent stream prior to discharge.  The chlorine gas is dissolved in water (through a chlorinator) to form the disinfection agent, liquid chlorine.  The maximum amount of chlorine in this process at any one time is 16,000 pounds.  This represents two full one-ton cylinders being connected simultaneously, and six full one-ton cylinders in storage.  This amount exceeds the threshold for EPA's Risk Management Planning of 2500 pounds.  There are possible offsite consequences from a chlorine release, and the facility is covered by OSHA's process safety management standard.  Therefore, the Adrian WWTP is subject to risk management program level 3.\n\nThe Adrian WWTP maintains up-to-date, accurate, written operating procedures that provide clear instructions for the chlorine process.  These operating procedures are instrumental in ensuring safe operation of the systems and preventing accidental releases.  An equipment failure could also result in an accidental release.  The WWTP has a maintenance program that is also critical to maintain the on-going mechanical integrity of the process equipment.  The Plant Superintendent ensures that all chlorine process safety information is kept up-to-date, and maintained in a format that provides easy access for employees.\n\nThe Plant Superintendent ensures that all operators have the required training to properly and safely operate the chlorine process.  All new employees must complete at least 8 hours of initial training, which consists of chlorine specific safety and health hazards, process operations, and emergency operations including shutdown.  Each employee must also complete at least 4 hours of refresher training every three years.  The refresher training"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43360,
      "SummaryText": " covers a review of all topics presented in the initial training, as well as any changes to the chlorine process or equipment.  Written examinations are given to evaluate the employees' proficiency following the training sessions.\n\nProcess Hazard Analyses (PHA) are conducted to identify, evaluate, and control the risk associated with process hazards and chlorine release scenarios.  The overall purpose is to prevent or minimize the effects of a release.  The PHA is conducted on the entire chlorine system.  The Plant Superintendent updates the PHA at least once every five years, or when a major change occurs in the process.\n\nA chlorine gas leak to the atmosphere is the primary hazard associated with this process.  The worst case scenario would be represented by the complete failure (rupture) of a one-ton cylinder outside of the chlorine room, releasing 2000 pounds of chlorine into the air.  Using EPA's guidance criteria, this release is calculated to take place over 10 minutes.  At a wind speed of 3.4 mph, the chlorine gas would travel 3.0 miles before the concentration drops below the toxic endpoint, the level at which chlorine gas is no longer a hazard to the public.  Depending upon the wind direction, such a release could affect anyone within the city and surrounding area.  The population within a 3.0 mile radius of the WWTP was estimated to be 28,679 people.  This was determined using the \"LandView5\" computer software developed by the EPA and NOAA (National Oceanic and Atmospheric Administration).\n\nNumerous alternate release scenarios were considered.  Different variables were used in evaluating each different situation.  These include the size of the opening, pressure and release duration.  The \"alternate release\" scenario chosen represents a more plausible possibility than the loss of a complete cylinder.  This situation involves the failure of one of the fusable plugs in the the chlorine cylinder due to a fire or damage.  This would leave a 1/4\" hole that would"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43360,
      "SummaryText": " allow chlorine gas to escape uncontrolled for an estimated time of one hour.  This type of release would more likely occur within the chlorine room, which would provide a reduction in the release rate to the atmosphere.  Using EPA's guidance criteria, the total release would be 554 pounds.  At a wind speed of 6.7 mph, the chlorine gas would travel 0.1 miles before the concentration drops below the toxic endpoint.  An endpoint circle with a radius of 0.1 miles does not encompass any off-site human receptors.  Only the personnel within the WWTP are at an exposure risk from a chlorine release of this type.\n\nDuring the past five years, there have been no accidental releases of chlorine from the Adrian WWTP in which chlorine escaped offsite.  Minor leaks have been noted within the chlorine room and were handled promptly by WWTP personnel.  These type responses are incidental, and are not considered a response action.  No threat was posed to the public or the environment.\n\nIn the event of an accidental release, the WWTP emergency action plan contains the procedures for evacuation of the plant and immediate notification of the fire department.  The fire department is responsible for control of the chlorine leak and evacuation of any affected residents.  The fire department has a copy of the WWTP risk management plan and conducts inspections to review plant operations, equipment and procedures."
    }
  ]
}