{
  "FacilityID": 43381,
  "FacilityName": "Dry Creek Regional Wastewater Treatment Plant",
  "FacilityStr1": "1800 Booth Road",
  "FacilityStr2": null,
  "FacilityCity": "Roseville",
  "FacilityState": "CA",
  "FacilityZipCode": "95678",
  "Facility4DigitZipExt": "9708",
  "FacilityCountyFIPS": "06061",
  "LEPC": null,
  "FacilityLatDecDegs": "38.736667",
  "FacilityLongDecDegs": "-121.317500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": "http://www.roseville.ca.us/eu/wastewater_utility/wastewater_facilities/dry_creek_wastewater_treatmen",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Roseville, Roseville, California",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Roseville, California",
  "OperatorStr1": "311 Vernon Street",
  "OperatorStr2": null,
  "OperatorCity": "Roseville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95678",
  "OperatorZipCodeExt": "9708",
  "RMPContact": "Bob Kalman",
  "RMPTitle": "Chief of Operations",
  "FTE": 49,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000103559",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-05-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-02-03 00:00:00",
  "DeRegistrationEffectiveDate": "2008-07-17 00:00:00",
  "AnniversaryDate": "2010-07-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 38.7375,
  "FRS_Long": -121.31778,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "124000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62380,
      "AltID": "Disinfection by Chlorine",
      "FacilityID": 43381,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63844,
          "ProcessID": 62380,
          "NAICSCode": "562219",
          "_desc": {
            "NAICS_CODE": "562219",
            "NAICS_DESCRIPTION": "Other Nonhazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82387,
          "ProcessID": 62380,
          "ChemicalID": 62,
          "Quantity": 240000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582387,
          "ProcessID": 62380,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 62381,
      "AltID": "Sulfur Dioxide Dechlorina",
      "FacilityID": 43381,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 63845,
          "ProcessID": 62381,
          "NAICSCode": "562219",
          "_desc": {
            "NAICS_CODE": "562219",
            "NAICS_DESCRIPTION": "Other Nonhazardous Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82388,
          "ProcessID": 62381,
          "ChemicalID": 49,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582388,
          "ProcessID": 62381,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43381,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies: This facility handles chlorine and sulfur dioxide, which are considered hazardous materials. The properties of both materials require safe handling in order to prevent human exposure to the facility's workers and nearby community personnel. It is the facility's policy to adhere to all applicable Federal and State of California rules and regulations. Safety depends upon the safe procedures used to handle chlorine and sulfur dioxide; the safety devices and systems designed and constructed into the facility; and the training of pertinent personnel.                                       2.Stationary Source and Regulated Substances Handled: The facility treats surface water obtained from reservoirs for municipal and industrial uses. This water is disinfected by mixing chlorine gas and water. Liquid chlorine is stored on site in one of two 60-ton bulk storage tanks located in the Chlorine Storage Building. One storage tank is kept empty to accept emergency chlorine transfer from the operating tank. Chlorine gas from the on-line container is piped into the chlorinators at several locations with the facility: 1)to the plant effluent at two locations, the East Roseville influent junction box and the North Roseville headworks, for odor control; 2) to the return activated sludge to control filamentous growth; 3) at the secondary clarifier weirs for algae growth; 4) to the filters to control algae growth; 5) and at two locations in the chlorine contact tank to disinfect either Title 22 or non-Title 22 water.                                                                                                                                                                           There is a daily maximum of 13, 125 gallons of chlorine at the facility.                                                                                 The excess chlorine residual is dechlorinated prior to discharge using sulfur dioxide. Li"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43381,
      "SummaryText": "quid sulfur dioxide is stored in one of two 20-ton steel bulk storage tanks situated in the Sulfur Dioxide Storage Building. One storage tank is kept empty to accept emergency sulfur dioxide transfer from the operating tank. Each 5,600 gallon bulk storage tank has a liquid withdrawl pipe connected to the sulfur dioxide evaporators; a gas withdrawl pipe connected to both the manual and electric vacuum regulator-check units; an air padding/vapor recovery pipe connected to the air padding compressed air system and to the truck unloading station; and a fill pipe connected to the truck unloading station. Sulfur dioxide gas can be released from the bulk tank to two sulfonators where the gas is monitored and drawn by vacuum to five injectors. One of the sulfonators is standby; the other regulates the flow of sulfur dioxide gas (under vacuum) to a remote injector on the effluent line. From the injectors, sulfur dioxide solution is routed to its point of use.                                                                                                                                There is a daily maximum of 13,125 gallons of sulfur dioxide at the facility.                                                                               3a. Worst Case Scenario: The 60-ton container of chlorine is the largest vessel in the chlorine feed system. Failure of this container will release 120,000 pounds of chlorine. It is assumed that the chlorine gas would be released at the rate of 12,000 pounds per minute for 10 minutes. The 60-ton container is stored inside of a building but the assumption is made that the gas release from the 60-ton container is directly to the surrounding atmosphere external to the building.                                                                                                                                                                         The distance to the endpoint of 3 ppm for the Worst Case scenario is 9.9 miles. This chlorine release wi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43381,
      "SummaryText": "ll extend beyond the boundaries of the stationary source.                                                                                                                                                                                The 20-ton container of sulfur dioxide is the largest vessel in the sulfur dioxide feed system. Failure of this container will release 40,000 pounds of sulfur dioxide. It is assumed that the sulfur dioxide would be released at the rate of 4,000  pounds per minute for 10 minutes. The 20-ton container is stored inside of a building but the assumption is made that the gas release from the 20-ton container is directly to the surrounding atmosphere external to the building.                                                                     The distance to the endpoint of 3 ppm for the Worst Case scenario is 6.5 miles. This release of sulfur dioxide will extend beyond the boundaries fo the stationary source.                                                                                                                                                                                3b. Alternative Release Scenario: The Alternative Release scenario for both the 60-ton container of chlorine and the 20-ton container of sulfur dioxide is the failure of the plant operator to properly connect the hose to the pump truck during loading of the container and/or failure of the truck or plant operator to properly close the fill valves prior to disconnecting the hose. The result for each regulated substances, is a release of the chemical from the fill pipes or hose into the containment sump.                                                                                                                                                                              The release rate for the Alternative Release Scenario for the bulk chlorine container was estimated at 1040 pounds per minute for 5 minutes. The release rate of the Alternative Release scenario for t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43381,
      "SummaryText": "he bulk sulfur dioxide container was estimated at 925 pounds per minute for 5 minutes. The distance to the endpoint of 3 ppm for the Alternative Release scenario for each chlorine and sulfur dioxide is 0.4 miles.                                                                                                                                                                                3c. Administrative Controls: Administrative controls to limit the distances for each reported scenario exists to restrict to a minimum the amount of chlorine and sulfur dioxide released should a release occur. This administrative control is inherent in the operational procedures for the chlorine and sulfur dioxide system. Training is provided to the chlorine and sulfur dioxide operators.                                                                                                                                                                         3d. Mitigation Measures: Mitigation measures to limit the distances for each reported scenario exists to restrict to a minimum the amount of chlorine or sulfur dioxide released should a release occur. The mitigation measures are based upon the design, inspection, testing, and maintenance of  the chlorine and sulfur dioxide system and its related equipment and components.                                                                                                                                                                      4. General Accidental Release Prevention Program and Chemical Specific Prevention Steps                                                                                                                                                                             The facility complies with Federal and State codes and regulations. There are safety meetings and ongoing safety training. The Process Safety Management (PSM) program implemented at the facility for chlorine and sulfur dioxide related activities and equi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43381,
      "SummaryText": "pment represents one of the facility's main active commitments to an accidental release prevention program.                                                                                                                                                                            5. Five-Year Accident History                                                                                                                                                           There have been no incidents involving the release of either chlorine or sulfur dioxide with the past five years at the facility nor in the history of the operation of this system.                                                                                                                                                                             6. Emergency Action Plan                                                                                                                                                                               The Emergency Action Plan is based on alerting personnel at the facility of the need to initiate an evacuation of the facility and await the arrival of responders from the City of Roseville Fire Department at the evacuation assembly location if a release occurs. The Placer County Office of Emergency Services incorporates this response into the County Area Plan for the Region 4 Local Emergency Planning Commission.                                                                                                                                      7. Planned Changes to Improve Safety                                                                                                                               There are no commitments made under the State of California Risk Management Prevention Program (RMPP) that are being implemented at this time. Current applicable codes and regulations are continually being monitored to determine if other commitments are necessary to achie"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43381,
      "SummaryText": "ve increased operational safety for the chlorine and sulfur dioxide systems."
    }
  ]
}