{
  "FacilityID": 43385,
  "FacilityName": "Diversified Foods & Seasonings, Inc.",
  "FacilityStr1": "109 Highway 1085",
  "FacilityStr2": null,
  "FacilityCity": "Madisonville",
  "FacilityState": "LA",
  "FacilityZipCode": "70447",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22103",
  "LEPC": "St. Tammany Parish LEPC",
  "FacilityLatDecDegs": "30.462417",
  "FacilityLongDecDegs": "-090.188167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.diversifiedfoodsandseasonings.com",
  "FacilityEmailAddress": "deymard@diversified-foods.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Al Copeland Investments",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Diversified Foods & Seasonings, Inc",
  "OperatorStr1": "1115 N. Causeway Blvd.",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "Mandeville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70471",
  "OperatorZipCodeExt": null,
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185694",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Madisonville Facility",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-07-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-07-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 30.46242,
  "FRS_Long": -90.18817,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62385,
      "AltID": "Refrigeration System",
      "FacilityID": 43385,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 82392,
          "ProcessID": 62385,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 63849,
          "ProcessID": 62385,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36356,
              "Process_NAICS_ID": 63849,
              "SafetyReviewDate": "2002-06-06 00:00:00",
              "PHA_Date": "2002-06-06 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2002-10-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Ammonia leak detectors",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-05-12 00:00:00",
              "TrainingReviewDate": "2002-06-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-06-07 00:00:00",
              "EquipmentInspectionDate": "2002-06-07 00:00:00",
              "EquipmentTested": "Refrigeration compressors, vessels, and air units",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2002-05-12 00:00:00",
              "PreStartupReviewDate": "2002-06-18 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2002-05-13 00:00:00",
              "HotWorkPermitReviewDate": "2002-05-13 00:00:00",
              "ContractorSafetyReviewDate": "2002-05-13 00:00:00",
              "ContractorSafetyEvalDate": "2002-05-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "Refrigeration System",
              "_chemicals": [
                {
                  "PrimaryKey": 52813,
                  "PreventionProgram3ID": 36356,
                  "ProcessChemicalID": 82392
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43385,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-12-29 00:00:00",
    "ERTrainingDate": "2002-06-04 00:00:00",
    "CoordinatingAgencyName": "Goodbe Fire Dept.",
    "CoordinatingAgencyPhone": "9858984913",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43385,
      "SummaryText": "EXECUTIVE SUMMARY\nThis Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  This is a stationary source. The only RMP regulated substance at this facility is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure. \n\nThis is a first time RMP submission for a new ammonia refrigeration system. \n\nThe refrigeration system in this facility will be charged with anhydrous ammonia in June and July 2002. The ammonia inventory may exceed 10,000 pounds by late June. Total ammonia inventory will be approximately 30,000 pounds of anhydrous ammonia by August 2002.\n\nThis process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance.\n\nACCIDENTAL RELEASE PREVENTION POLICY\nThis facility follows a rigorous thirteen volume Process Safety Management Program to prevent the accidental release of ammonia. The PSM program is in compliance with Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the PSM program to maintain a work environment that is safe to employees, the community, and the environment.\n\nEMERGENCY RESPONSE POLICY\nThe facility has a comprehensive emergency response plan that meets established criteria. The plan is being provided to the local LEPC for review.\n\nPROCESS OVERVIEW \nThis food processing facility operates a two-stage, anhydrous ammonia (R-717) refrigeration system with an engine room capacity of 981 TR @ +20?F high temperature suction and 588 TR @ -50?F low temperature suction. This high-temperature side of the refrigeration system is a direct expansion system. The low-temperature side of the refrigeration system is a liquid-recirculating system and is designed to operate with an overfeed-ratio of approximately 4:1 for low-side air units. Anhydrous amm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43385,
      "SummaryText": "onia (R-717) refrigerant is a Group II refrigerant. Rotary screw compressors are used in the refrigeration system.\nEngine room electrical classification is NEMA-1.\n\nThis ammonia refrigeration system contains six interconnected sub-systems:\n1. Low-temperature re-circulating evaporator system (-50?F @ 14? Hg).\n2. High-temperature evaporator system (+20?F @ 33.4 PSIG).\n3. Thermosyphon pilot receiver system (90?F @ 165.5 PSIG).\n4. Condenser system (90?F C.T. 80?F W.B.).\n5. Compressor low-temperature system (-50?F @ 14? Hg).\n6. Compressor medium-temperature system (+20?F @ 33.4 PSIG).\n\nMajor equipment located inside the engine room includes:\n?Three low temperature booster-compressors (two M&M H375BT Screw Compressors each @ 270 TR/ 425 BHP and one M&M A65BT Screw Compressor @ 48 TR/ 82 BHP).\n?Three low temperature booster-compressors (two M&M A87ETF Screw Compressors each @ 356 TR/ 335 BHP and one M&M A65ETF Screw Compressor @ 269 TR/ 264 BHP).\n?One swing compressor (M&M H267HT Screw Compressor @ 191 TR/ 305 BHP on the low-side and 488 TR/ 500 BHP on the high-side). \n?One 84? dia. x 18?-0? high-pressure receiver.\n?One 10\" dia. x 6'-0\" OAL economizer.\n?One 72\" dia. x 10'-0\" OAL intercooler @ +20?F.\n?One 84\" dia. x 11'-4\" OAL vertical re-circulator package @ -50?F.\n?One-Hansen APC Auto-Purger.\n\nMajor equipment located outside on the roof includes:\n?Two evaporative condensers (both BAC VC2-1246, rated @ 7,297.2 MBH, for +90? FCT/ 80? FWB).\n\nMITIGATION MEASURES\nThere are some mitigating measures in place. The location of the ammonia vessels is inside the engine room. Although there are doors and windows, the overall enclosure acts as a dike creating liquid pooling and limiting the liquid run-off. Ammonia leak detection is installed in this area that sounds alarms and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air through the roof which creates a lower level of concentration in the engine room for respond"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43385,
      "SummaryText": "ers. It also starts air dispersion at lower concentration levels and disperses the ammonia with greater air turbulence.\n\nSUMMARY OF HAZARD ASSESSMENT\nThis hazard assessment was conducted to meet the RMP Off-site Consequence Analysis requirements for the ammonia refrigeration system. The only RMP regulated substance at this facility is anhydrous ammonia which is classified is as a toxic substance, liquefied under pressure. The definitions and parameters for the following release scenarios are based on the \"Risk Management Program Guidance for Ammonia Refrigeration\" as described in Chapter 4: Off-site Consequence Analysis.\n\nThe worst-case release scenario (OCA-1) used in this assessment identifies the high pressure receiver (V-1) as the vessel with the potential to hold the largest quantity of ammonia. This is based on the system design that uses this vessel as a pump-down holding receiver. The worst-case release scenario is based on over-filling this vessel causing the released quantity to be equal to the total vessel volume with no piping volume included. The worst-case release is estimated to be 23,058 pounds of ammonia over a ten-minute period.\n\nThe alternative release scenarios evaluated in this hazard assessment include two possible scenarios. First alternate scenario (OCA-2) is the direct release of ammonia vapor from the largest pressure relief valve with a duration of sixty minutes. The size of the release is based on the rated capacity of the pressure relief valve (79.6 lbs/min) with a release duration of sixty (60) minutes.\n\nThe second alternative scenario (OCA-3) is the direct release of liquid from a ?\"   diameter hole/valve in a vessel having an internal pressure of 181.1 psig.  The size of this release is based on a ten (10) minute release duration at a release rate calculated from the simplified Bernoulli equation found on page 4-14 in Chapter 4 of the \"Risk Management Program Guidance for Ammonia Refrigeration.\" \n\nACCIDENT PREVENTION PROGRAM\nThis faci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43385,
      "SummaryText": "lity follows the OSHA Process Safety Management Program. Various special elements have been incorporated into this program to meet the additional EPA requirements for hte RMP. Following is an overview.\n\nParticipation - The Participation Program is an asset to both employees at the site and to the community as a whole.  As a general rule, employees who are fully involved have a greater sense of responsibility; they are more likely to catch the problems that can cause accidents. Employee awareness is for employees, not directly involved with the process, this includes knowing the hazards, the safety rules, warning signs, and evacuation procedures. All employees have access to the PSM Program. Involved employees participate directly in every phrase of the PSM program, including conducting the PHA, developing or reviewing operating procedures, reviewing incident investigations, and conducting mechanical integrity and compliance audits.\nCommunity involvement is through coordination and cooperation with the local Fire department and LEPC.\n\nProcess Safety Information - Process Safety Information includes a wide variety of books, manuals, and process information. These are available to employees that operate, maintain, or repair the process equipment or piping. There are three major categories of information: ammonia data such as MSDS, safety information, first aid, chemical properties, IIAR safety bulletins, etc.; process information such as piping & instrumentation diagrams (P&ID's), block flow diagram, mass flow balance, design codes and standards, pressure safety relief settings, safety system/devices, ventilation system design, operating procedures, safe operating limits, and ramification of process deviation; and process equipment information such as equipment specifications, electrical classifications, materials of construction, installation manuals, operating and maintenance manuals, and manufacturer's manuals.\n\nProcess Hazard Analysis - A Process Hazard Analysis (P"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43385,
      "SummaryText": "HA) was completed using the \"What-if\" technique.  This addressed hazards, engineering and administrative controls, consequences of failure of engineering and administrative controls, facility siting, human factors, and a qualitative evaluation of the possible safety and health impact. The results of the PHA were prioritized and incorporated into a PHA Findings Report for follow-up as a corrective action log.\n\nStandard Operating Procedures - SOPs are provided for each compressor, condenser, ammonia vessel and oil pot, and evaporator. Topics include general information such items as objectives, hazards, location, equipment needed, P&ID's, task flow diagrams, and step-by-step procedures with specific warnings and comments. The SOPs cover different phases of operations such as: initial startup; normal, temporary and emergency operations; emergency shutdowns; and startup following a shutdown.\n\nTraining - All employees are who are involved with anhydrous ammonia have been properly trained, at a minimum, in understanding the MSDS, routine refrigeration system operation, emergency refrigeration system operation, emergency and normal refrigeration safety practices, and, if appropriate, the individual's role in the emergency response plan.\n\nContractors - This site follows strict guidelines for qualifying contractors who directly influence the safety of the process or the system. The contractor qualification procedure ensures that contractors and their employees are fully aware of the potential dangers involved with the ammonia process, that contractors understand their responsibility and train their people, and that a contractor's safety record is considered in reviewing the bids. \n\nPre-Startup Review - Pre-startup safety reviews are required on all new or modified equipment/systems. This involves process safety information, process hazard analysis, training, safety procedures, operating procedures, and verification that construction and equipment are in accord with the desig"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43385,
      "SummaryText": "n specifications.\n\nMechanical Integrity Audits - The purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working condition.  These are performed on all compressors, condensers, evaporators, pressure vessels, piping system, relief and vent systems and devices, emergency shutdown systems, controls, and pumps.\n\nHot Work Permits - This permit process is to protect against fire, explosion and other dangers resulting from hot work (welding and cutting outside the designated areas).  Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules are met. Permits indicate the appropriate dates and the work to be done. The permits are kept on file until workers have completed the hot work operations.\n\nManagement of Change - The Management of Change (MOC) procedure requires that all changes (even \"replacement in kind\") be reviewed to see if there is a possible negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operating procedures, and authorization requirements for the proposed change.  Employees affected by the change are informed of the change before startup and trained in the proper procedures.\n\nIncident Investigation - An incident investigation shall be performed any time there is an incident which resulted in, or which could reasonably have resulted in, a catastrophic release of ammonia. The purpose is to gain information that could prevent further accidents and to identify weaknesses in the emergency response plan that need to be addressed. Investigations are initiated promptly using a trained team. The findings and recommendations will be studied and appropriate corrective action taken.\n\nEmergency Response Plan - This facility has a comprehensive emergency response plan that meets established criteria.  This plan wil"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43385,
      "SummaryText": "l be provided to the local fire department and the Local Emergency Planning Committee (LEPC).\n\nCompliance Audits and RMP Revisions - To insure that all the other 12 areas of PSM program are followed, the company requires compliance audits.  At a minimum, these must be completed every three years.\nResubmission of the RMP shall be done according to RMP Section 6.2 to meet the OCA requirements.\n\nACCIDENT HISTORY - LAST FIVE YEARS\nThis is a new facility and new process.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThis is a new system. No changes are planned."
    }
  ]
}