{
  "FacilityID": 43512,
  "FacilityName": "Perryville Electric Generating Plant",
  "FacilityStr1": "11140 Highway 165 North",
  "FacilityStr2": null,
  "FacilityCity": "Sterlington",
  "FacilityState": "LA",
  "FacilityZipCode": "71280",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22073",
  "LEPC": "Ouachita Parish LEPC",
  "FacilityLatDecDegs": "32.692778",
  "FacilityLongDecDegs": "-092.017500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Entergy Louisiana, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Entergy Louisiana, Inc.",
  "OperatorStr1": "11140 Highway 165 North",
  "OperatorStr2": null,
  "OperatorCity": "Sterlington",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71280",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "LAR000048652",
  "EPAFacilityID": "100000178808",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2160-00112-V1",
  "SafetyInspectionDate": "2002-04-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-07-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-05-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 32.695,
  "FRS_Long": -92.02472,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62612,
      "AltID": null,
      "FacilityID": 43512,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 82654,
          "ProcessID": 62612,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 64077,
          "ProcessID": 62612,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36505,
              "Process_NAICS_ID": 64077,
              "SafetyReviewDate": "2002-04-11 00:00:00",
              "PHA_Date": "2002-04-11 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "New Process",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-04-11 00:00:00",
              "TrainingReviewDate": "2002-04-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Classroom instruction: hands-on training",
              "MaintenanceReviewDate": "2002-04-11 00:00:00",
              "EquipmentInspectionDate": "2002-04-11 00:00:00",
              "EquipmentTested": "Anhydrous ammonia tank, valves, etc. (ammonia process)",
              "ChangeMgmtDate": "2002-04-11 00:00:00",
              "ChangeMgmtReviewDate": "2002-04-11 00:00:00",
              "PreStartupReviewDate": "2002-04-11 00:00:00",
              "ComplianceAuditDate": "2002-04-11 00:00:00",
              "AuditCompletionDate": "2002-04-11 00:00:00",
              "IncidentInvestigationDate": "2002-04-11 00:00:00",
              "InvestigationChangeDate": "2002-04-11 00:00:00",
              "ParticipationPlansReviewDate": "2002-04-11 00:00:00",
              "HotWorkPermitReviewDate": "2002-04-11 00:00:00",
              "ContractorSafetyReviewDate": "2002-04-11 00:00:00",
              "ContractorSafetyEvalDate": "2002-04-11 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 52988,
                  "PreventionProgram3ID": 36505,
                  "ProcessChemicalID": 82654
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43512,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-04-11 00:00:00",
    "ERTrainingDate": "2002-04-23 00:00:00",
    "CoordinatingAgencyName": "Ouachita Parish Emergency Planning",
    "CoordinatingAgencyPhone": "3183251621",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43512,
      "SummaryText": "\nPerryville Electric Generating Plant\n\n\n\nACCIDENT RELAESE PREVENTION AND RESPONSE POLICIES\n\n\n\nThe Perryville Electric Generating Plant is committed to workers and public safety.  This commitment is demonstrated by the resources invested in accident prevention such as training personnel and considering safety in design, installation, operation, and maintenance of the facility?s processes.  The Entergy Louisiana, Inc. (ELI) policy is to implement reasonable controls to prevent foreseeable releases of substances.\n\n\n\nELI operates the Perryville Electric Generating Plant located in Ouachita Parish, Louisiana. The Perryville Electric Generating Plant is a gas fired steam electric plant that produces approximately 725 megawatts of electricity.  The heat recovery steam generators used to turn electric generating units produce electricity for sale to homes and businesses.  As evidenced in the ensuing text and based on criteria in the Accident Release Program (ARP), the Perryville Electric Generating Plant is a Program 3 process.\n\n\n\nThe Perryville Electric Generating Plant was evaluated to determine if any regulated flammable or toxic substances were or would be present in the planned process and if they exceeded the threshold quantity.  There is one ammonia tank at the facility.  The identification of a vessel exceeding threshold quantities of a regulated flammable or toxic substance would subject a process to threshold determination for offsite consequence analysis.\n\n\n\nELI identified one regulated toxic substance and no flammable substances above the threshold values at Perryville Electric Generating Plant.  The anhydrous ammonia tank with a capacity of 5,000 gallons was determined to exceed the threshold quantity.  The identification of this exceedance indicates the Perryville Electric Generating Plant is a covered process with a regulated substance subject to threshold determination for offsite consequence analysis.\n\n\n\nFive-Year Accident History\n\n\n\nThe Perryville Electric"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43512,
      "SummaryText": " Generating Plant has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40CFR68.42.\n\n\n\nLocal Emergency Response Coordination\n\n\n\nThe Perryville Electric Generating Plant has coordinated its emergency response activities with the local emergency planning and response agencies as required in 40CFR68.12(b)(3).\n\n\n\nGeneral Accidental Release Prevention Program\n\n\n\nELI and the Perryville Electric Generating Plant actively encourage all levels of employees and contract employees to participate in creating a safe work environment.  This participation begins with well established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining PSM rule compliance based on their knowledge, skill job responsibilities, and experience.  Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained by the company.\n\n\n\nProcess Safety Information\n\n\n\nThe Perryville Electric Generating Plant maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as, key process parameter limits and equipment design basis/configuration information.  Specific departments within the plant are assigned responsibility for maintaining up-to-date process safety information.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDS).  This information is supplemented, when required, by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  In addition, the plant has documented safety related limits for specific process parameters and ensures limit m"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43512,
      "SummaryText": "aintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\n\n\n\nThe plant also maintains documentation that provides information about the design and construction of process equipment.  Equipment information includes materials, design pressure, and temperature and electric ratings.  This information also provides a basis for establishing inspection and maintenance activities, as well as, for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\nThe Perryville Electric Generating Plant has a comprehensive program to ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\n\n\nThe Perryville Electric Generating Plant uses a combination of what if checklists and a hazard and operability (HAZOP) study to perform these evaluations.  These methods use a highly structured approach where process parameters such as flow and temperature are examined for deviations from their intended design.  Deviation effects are considered in order to determine resulting potential hazards while recommendations for improvement are proposed.\n\n\n\nThe PHA team findings are promptly and systematically addressed.  The Perryville Electric Generating Plant assures that the recommendations are documented and resolved in a timely manner.  This documentation includes the actions to be taken and a written schedule of completion dates.  The plant also provides proof of communication with operation, maintenance, and other employees whose work assignments are in the process and who may be affected by the recommendations.\n\n\n\nTo ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43512,
      "SummaryText": "es and revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years by the PHA team.\n\n\n\nOperating Procedures\n\n\n\nThe Perryville Electric Generating Plant maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operation, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) startup following an outage or after and emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators.  Operating procedures are periodically reviewed and certified as current.  When process change occurs, operating procedures are revised as necessary through the management of change process.\n\n\n\nTraining\n\n\n\nTo complement the written process operation procedures, the PPS has implemented a comprehensive training program for all employees.  New employees receive job specific training in plant operations.  Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices.  Operations demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\n\n\n\nHot Work Permit\n\n\n\nThe Perryville Electric Generating Plant issues a hot work permit for all hot work operations conducted on or near a covered process.  Procedures for issuing a hot work permit are clearly outlined in the Safety Manual.  The Perryville Electric Generating Plant provides Hot Work Permit training to all plant employees. Copies of issued work permits are maintained in operations and maintenance for a period of one year following completion of work.\n\n\n\nContractors\n\n\n\nThe Perryville Electric Generating Plant periodically uses contractors to perform maintenance or repair, outage, or specialty work on or adjacent to a covered process.  Because some contractors work on or near process equipment, the plant has proc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43512,
      "SummaryText": "edures in place to ensure that contractors (1) are trained in the work practice necessary to safely perform his/her job, (2) have received and understood the training required, (3) follow the safety rules of the location including the safe work practices, (4) advise the plant of any unique hazards presented by the contractor, and (5) notify the facility of all illnesses and injuries that occur in the process areas.\n\n\n\nPre-Startup Safety Reviews (PSSRs)\n\n\n\nThe Perryville Electric Generating Plant conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an adequate safety, operation, maintenance, and emergency procedures are in place, and that training of each employee involved in operating the process or equipment has been completed.  A standard checklist is used to document compliance. \n\n\n\nMechanical Integrity\n\n\n\nThe Perryville Electric Generating Plant has well established programs, procedures and practices that are required to ensure that equipment used to process, store or handle lightly hazardous chemicals and/or flammable gas or liquid is designed, constructed, installed, and maintained to minimize the risk of a release.  Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls.\n\n\n\nMaintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employee?s job tasks to ensure that the employee can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 43512,
      "SummaryText": "before further use in a safe and timely manner.  When necessary, preventative means are taken to ensure safe operation.\n\n\n\nManagement of Change\n\n\n\nThe Perryville Electric Generating Plant has a comprehensive system to manage and document changes to all covered processes.  A systematic approach is followed to control and manage facility changes in order to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment, or the environment.  Employees involved in process operations and maintenance and contract employees whose job tasks might be affected by process changes are informed of and trained in the change prior to process start-up.\n\n\n\nIncident Investigation\n\n\n\nThe Perryville Electric Generating Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.\n\n\n\nEmergency Planning and Response\n\n\n\nThe Perryville Electric Generating Plant retains a written site specific formal emergency response plan, which includes the designated actions the company and all personnel will take to ensure personnel safety from fire and other emergencies.  The plan outlines actions that company technicians and contract employees are to take when there is an unwanted release of hazardous chemicals.  The intent of this plan is to facilitate the p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43512,
      "SummaryText": "rompt evacuation of employees when necessary and to account for all personnel.  The emergency plan also includes procedures for handling small releases.\n\n\n\nCompliance Audits\n\n\n\nTo help ensure that the accident prevention program is properly functioning, the Perryville Electric Generating Plant periodically conducts audits to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every three years.  The audit team includes those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nRMP Validation errors ? No Data to Report\n\n"
    }
  ]
}