{
  "FacilityID": 43558,
  "FacilityName": "Calandri/SonRise Farms, LP - Lane Ranch",
  "FacilityStr1": "West Avenue A & 175th Street West",
  "FacilityStr2": null,
  "FacilityCity": "Rosamond",
  "FacilityState": "CA",
  "FacilityZipCode": "93560",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "34.819183",
  "FacilityLongDecDegs": "-118.440353",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John A. Calandri",
  "OperatorStr1": "40445 27th St. W",
  "OperatorStr2": null,
  "OperatorCity": "Palmdale",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93551",
  "OperatorZipCodeExt": null,
  "RMPContact": "John A. Calandri",
  "RMPTitle": "Manager/Member",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192739",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-02-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "New",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-08-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-10-26 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-01 00:00:00",
  "AnniversaryDate": "2010-08-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62698,
      "AltID": "Chlorination of water",
      "FacilityID": 43558,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64172,
          "ProcessID": 62698,
          "NAICSCode": "111219",
          "_desc": {
            "NAICS_CODE": "111219",
            "NAICS_DESCRIPTION": "Other Vegetable (except Potato) and Melon Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 82769,
          "ProcessID": 62698,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 582769,
          "ProcessID": 62698,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43558,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies\n\nCalandri/SonRise Farms, LP utilizes chlorination systems on some of the ranches to control algae growth in the irrigation systems.  The chlorination systems incorporate many inherently safe design features.  These features include fail safe (vacuum open and spring close) flow valves in the vacuum feed regulator and ejectors that fail in the closed position.  As such, the equipment complies with recognized and generally accepted good engineering practices.\n\nWhile it is Calandri/SonRise Farms, LP?s objective to be a responsible citizen of the community in all of its business activities, the limited personnel in the farming operation precludes emergency response operations.  As such, an emergency action plan has been prepared for the Calandri/SonRise Farms, LP farming operations where chlorine is used and a chain of command to respond to emergencies has been established.\n\nCalandri/SonRise Farms, LP has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the CalARP regulations.  At least every three years, Calandri/SonRise Farms, LP will audit these programs and any findings of noncompliance will be documented and responded to and the deficiencies will be corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nCalandri/SonRise Farms, LP owns and leases farmland to grow onions.  To ensure that the irrigation systems work properly, some of the ranches utilize chlorine to control the growth of algae.  In these chlorination systems, chlorine is drawn from ton containers through vacuum feed regulators by a vacuum created by ejectors installed on the irrigation water pipeline.  Rotameters are installed in the vacuum tubing between the vacuum feed regulator and each ejector to regulate the flow of chlorine into the irrigation water.  This arrangement chlorinates the irrigation water only when there is water flow through the ejectors. \n\nDur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43558,
      "SummaryText": "ing normal operation, two one ton containers may be connected to the irrigation water chlorination system.  The maximum quantity in a one ton container is 2000 pounds of chlorine.  \n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for chlorine as 0.0087 mg/l (3 ppm).  This concentration has been established by the American Industrial Hygiene Association as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual?s ability to take protective action.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA general accidental release prevention program has been developed at Calandri/SonRise Farms, LP to address the chlorination systems.  This program includes the following chemical-specific prevention steps:\n\n? Safety information, including the Material Safety Data Sheet for chlorine; the maximum intended inventory of the chlorination systems; safe upper and lower temperatures and pressures; equipment specifications; and the codes and standards used to design, build, and operate the process, has been compiled.\n\n? Compliance with federal and state regulations that address industry-specific safe design and industry-specific design codes and standards has been demonstrated.  \n\n? A hazard review was performed and will be updated and revalidated at least every five years.\n\n? Written operating procedures have been developed and implemented, and are reviewed at least annually.\n\n? Each employee involved in operating the chlorination systems has received initial training and refresher training at least every three years.\n\n? Written mechanical integrity procedures have been established and implemented.\n\n? Audit procedures have been develo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43558,
      "SummaryText": "ped and will be conducted at least every three years to evaluate compliance with the RMP regulations.\n\n? Incident investigation procedures have been established.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Calandri/SonRise Farms, LP has assigned overall responsibility for the RMP elements to the Operations Manager.  The Operations Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nCalandri/SonRise Farms, LP has not had any accidental releases from any of the chlorination systems that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nCalandri/SonRise Farms, LP has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  \n\nPlanned Changes To Improve Safety\n\nThrough the accidental release prevention program, Calandri/SonRise Farms, LP regularly evaluates the need for any changes to improve safety.  Currently, Calandri/SonRise Farms, LP does not have any additional changes planned to improve safety."
    }
  ]
}