{
  "FacilityID": 43600,
  "FacilityName": "Gallade Chemical, Inc. - Santa Ana (Fed Filing)",
  "FacilityStr1": "1230 East St. Gertrude Place",
  "FacilityStr2": null,
  "FacilityCity": "Santa Ana",
  "FacilityState": "CA",
  "FacilityZipCode": "92707",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.816694",
  "FacilityLongDecDegs": "-117.855000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Gallade Chemical, Inc.",
  "OperatorStr1": "1230 E. St. Gertrude Place",
  "OperatorStr2": null,
  "OperatorCity": "Santa Ana",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92707",
  "OperatorZipCodeExt": null,
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192757",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-10-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2005-08-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2005-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 33.719127,
  "FRS_Long": -117.856675,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62766,
      "AltID": "Chemical Distribution",
      "FacilityID": 43600,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 82859,
          "ProcessID": 62766,
          "ChemicalID": 1,
          "Quantity": 15500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 82860,
          "ProcessID": 62766,
          "ChemicalID": 55,
          "Quantity": 2100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 64244,
          "ProcessID": 62766,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 36602,
              "Process_NAICS_ID": 64244,
              "SafetyReviewDate": "2004-08-12 00:00:00",
              "PHA_Date": "2005-04-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Hazard Review",
              "PHACompletionDate": "2004-08-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Np previous HazOp Conducted",
              "OpProceduresReviewDate": "2005-08-12 00:00:00",
              "TrainingReviewDate": "2005-08-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-08-12 00:00:00",
              "EquipmentInspectionDate": "2005-02-21 00:00:00",
              "EquipmentTested": "Storage Racks and Areas",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2005-02-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-02-21 00:00:00",
              "HotWorkPermitReviewDate": "2005-02-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2005-02-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 53133,
                  "PreventionProgram3ID": 36602,
                  "ProcessChemicalID": 82859
                },
                {
                  "PrimaryKey": 53134,
                  "PreventionProgram3ID": 36602,
                  "ProcessChemicalID": 82860
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43600,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-02-01 00:00:00",
    "ERTrainingDate": "2005-02-01 00:00:00",
    "CoordinatingAgencyName": "San Ana Fire Dept.",
    "CoordinatingAgencyPhone": "7146475709",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 43600,
      "SummaryText": "t.  This scenario would most likely be initiated by some external event (i.e., traffic accident, seismic event, human error, etc.).  It is highly improbable that this scenario would be initiated by a seismic event.  However, the possibility of this scenario being initiated by a seismic event cannot be completely discarded.  This scenario is considered to be extremely unlikely.  In the extremely unlikely case that this scenario occurs, up to 55-gallons of formaldehyde solution could be released (in the worst-case).  In an effort to be conservative (i.e., to estimate the largest vulnerable zone) it was assumed that the release occurs outdoors.  Thus, it was assumed that the formaldehyde solution released during the catastrophic accident forms a liquid pool from which a cloud of formaldehyde is generated.  The cloud of formaldehyde vapor was then assumed to freely migrate off-site.  Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.1-miles.\n\nAlternative Release Scenarios\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the release of anywhere from less than one-pound to up to several hundred pounds of 37-percent concentrated formaldehyde solution.  These scenarios include situations such as accidental releases during delivery of formaldehyde containers to the site, a pinhole leak in one of the containers stored onsite, a partial or complete failure of one of the containers stored onsite, or an accident during onsite movement of one of the containers.  In order to be conservative in the estimation of the vulnerable zone, it was assumed that 525-pounds of formaldehyde solution is released during an event in which the integrity of one of the 55-gallon containers is breeched by some external event.  In order to be conservative (i.e., in order to estimate the largest vulnerable zone), this event is assumed to occur outdoor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43600,
      "SummaryText": "as only.  The act of material segregation and storage is integral to the safe storage and handling of ALL materials handled at the Facility.\n\nStaging/Loading/Delivery\nAs the Company receives orders for chemicals, the Dispatch Department works out the logistics for order fulfillment and delivery.  Again, pallet jacks or forklifts are utilized to move materials from the various building areas or storage rooms to the delivery dock.  The Operator checks the Delivery Order and ensures that the load is accurate.  The delivery truck driver then delivers the load to customer site.  The process of staging, loading and delivery is identical for each regulated substance handled at the facility.  The only difference being the container types and sizes and where the materials are delivered.  \n\nIt should be noted that pre-packed regulated substances are received in sealed containers, the containers remain sealed throughout the duration of their storage onsite, and the containers are delivered sealed to customers.  Furthermore, ALL regulated substances are stored indoors in locked, secured warehouse areas/rooms that have been pre-designated via a well thought out and planned materials handling and segregation process.  As such, only chemically compatible materials or like materials are stored in the same warehouse areas or rooms.  Storage areas for incompatible materials are separated by walls, or other barriers that would prevent material co-mingling in case of spills.\n\nSite Security\nALL buildings at the site are locked at all times and access is limited to authorized persons only.  Furthermore, the site is surrounded by completely enclosed and the entry gate is locked at all times.  Each of the chemical storage buildings are secured via locked entry doors.  These security measures are designed to prevent unauthorized access to site areas including those areas where regulated substances are stored and/or handled and thus, add a level of safety for the storage of regulated substan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43600,
      "SummaryText": "ces at the site.  \n\nES 2.0\tACCIDENTAL RELEASE SCENARIOS\n\nThe RMP regulations require that at least two types of release scenarios be evaluated for their potential to impact off-site populations:\n\n¿\tthe worst case release; and\n¿\tan alternative release (an accident scenario that is more credible than the worst-case release scenario).\n\nA number of hypothetical accidental release scenarios were postulated and evaluated for the RMP.  These scenarios were categorized into worst-case release scenarios and alternative release scenarios for each of the regulated substances handled at the site.  Each of these categories of hypothetical accidental release scenarios for each of the regulated substances handled at the facility are discussed below.\n\nHYDROFLUORIC ACID (70-PERCENT CONCENTRATED)\n\nWorst-Case Release Scenario\nIn this scenario, a 550-pound container (e.g. a 55-gallon drum ¿ the largest container size handled at the site) of 70-percent concentrated hydrofluoric acid stored on site experiences a catastrophic failure due to an unknown event.  This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite impacting the area where the container is stored).  It is highly improbable that this scenario would be initiated by a seismic event.  However, the possibility of this scenario being initiated by a seismic event cannot be completely discarded (i.e., the structural failure of a wall, etc.).  This scenario is considered to be extremely unlikely.  In the extremely unlikely case that this scenario occurs, up to 550-pounds of 70-percent concentrated hydrofluoric acid could be released (in the worst-case).  In an effort to be conservative (i.e., to estimate the largest vulnerable zone) it was assumed that the release occurs outdoors.  Thus, it was assumed that the hydrofluoric acid released during the catastrophic accident forms a liquid pool from which a cloud of hydrofluoric acid fumes is generated.  The cloud of hydrofluoric acid fumes was the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 43600,
      "SummaryText": "n assumed to freely migrate off-site.  Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.3-miles.\n\nAlternative Release Scenarios\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the release of anywhere from less than one-pound to up to 550-pounds of 70-percent concentrated hydrofluoric acid.  These scenarios include situations such as accidental releases during delivery of hydrofluoric acid to the site, a pinhole leak in the 55-gallon drum containing hydrofluoric acid, a complete failure of one of the one-gallon bottles containing hydrofluoric acid, or an accident during repacking or onsite movement of the 55-gallon hydrofluoric acid drum.  In order to be conservative in the estimation of the vulnerable zone, it was assumed that 550-pounds of 70-percent concentrated hydrofluoric acid (the largest container size of hydrofluoric acid handled at the site) is released during an event in which the integrity of drum is breeched by some external event.  In order to be conservative (i.e., in order to estimate the largest vulnerable zone), this event is assumed to occur outdoors (although it could occur indoors also).  Thus, it was assumed that the hydrofluoric acid released during the accident forms a liquid pool from which a cloud of hydrofluoric acid fumes is generated.  The cloud of hydrofluoric acid fumes was then assumed to freely migrate off-site.  Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.2-miles.\n\nFORMALDEHYDE (37-PERCENT CONCENTRATED)\n\nWorst-Case Release Scenario\nIn this scenario, a 55-gallon drum (the largest container size of formaldehyde handled at the site) of formaldehyde solution (i.e., 37-percent concentrated solution of formaldehyde) stored on site experiences a catastrophic failure due to an unknown even"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 43600,
      "SummaryText": "s (although it could occur indoors also).  Thus, it was assumed that the formaldehyde released during the accident forms a liquid pool from which a cloud of formaldehyde vapor is generated.  The cloud of formaldehyde vapor was then assumed to freely migrate off-site.  Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.1-miles.\n\nSENSITIVE RECEPTORS LOCATED WITHIN THE LARGEST PROJECTED VULNERABLE ZONE\n\nDue to the location of the site (i.e., it is located within an area that is primarily industrial in nature), there very few sensitive receptors known to be present within the Maximum Projected Vulnerable Zone.\n\nES 3.0\tFIVE YEAR ACCIDENT HISTORY\n\nDuring the five years preceding the submittal of the RMP (i.e., from April 1, 2000 through April 1, 2005), the subject site has NOT had any releases of regulated substances (i.e., 70-percent concentrated hydrofluoric acid, and 37-percent solution of formaldehyde,) have resulted in:\n\n¿\tOnsite deaths, injuries, or significant property damage; or\n¿\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nES 4.0\tACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Accidental Release Prevention Program at the facility consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving regulated substances.  These programs include design and operating controls such as compliance with specified codes (i.e. compliance with building codes and fire codes, conformance to the Chemical Manufacturer¿s Association¿s Responsible Care Program, Corporate policies for segregation of classes of hazardous substances such as strong acids, strong bases, weak acids, weak bases, etc.), the Company¿s OSHA Hazard Communication Program, the Company¿s Injury and Illness Prevention Program, numerous standard operating procedures, the"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 43600,
      "SummaryText": "equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program for forklifts, etc.), fire protection, accident/incident investigation procedures (as contained in the Company¿s Injury and Illness Prevention Program), emergency response plan, the RMP Program compliance auditing program, and a variety of personnel training programs.  Details of each of these components of the Company¿s Accidental Release Prevention Program are provided in the document entitled Federal Risk Management Plan and California Accidental Release Prevention Program Risk Management Plan (CalARP RMP), Volume I - Prevention Program.  \n\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe operation of the Facility.  These devices are located throughout the facility and monitor various aspects of Operations.  \n\nES 5.0\tEMERGENCY RESPONSE\n\nGallade Chemical recognizes that emergency planning and emergency response are an integral component of risk management.   As such, the Company, as part of its hazardous materials business plan (HMBP) for the Santa Ana Facility, has currently developed and implemented an emergency response plan and an emergency evacuation plan.  However, as an added measure to improve safety, the Company is evaluating the feasibility of developing specific emergency response options for emergencies involving various classes of hazardous substances handled at the facility (including regulated substances).  \n\nES 6.0\tPLANNED CHANGES TO IMPROVE SAFETY\n\nA detailed hazard and operability study (i.e., process hazards analysis) was performed for the facility on ALL operations involving regulated substances stored and handled at the facility in order to enhance the safety of the site and to evaluate the potential for accidental releases.  As a result of the process hazards analysis performed, a number of recommendations were made.  Gallade Chemical has already completed/implemented a number"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 43600,
      "SummaryText": "of the recommended actions and expects to complete the remaining recommended actions by May 30, 2005.\n\nES 7.0\tFOR MORE INFORMATION\n\nGallade Chemicals, Inc. recognizes that some persons may be interested in obtaining more detailed information regarding the RMP and various Prevention Program components not discussed herein.  Interested parties that have additional questions regarding the Santa Ana Facility¿s Risk Management Plan and/or Prevention Program, are directed to contact:\n\n\tMr. Steve Halberstadt\n\tQuality Control Manager\n\tc/o Gallade Chemicals, Inc.\n\t1230 East St Gertrude Place\n\tSanta Ana, California 92707"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 43600,
      "SummaryText": "This document comprises the Federal RMP for the Gallade Chemical facility located in Santa Ana, California (hereinafter referred to as the site or the subject site).  The site is owned and operated by Gallade Chemical, Inc.\n\nThe purpose of this document is to comply with the risk management planning and update requirements as set forth in the Code of Federal, Title 40 Part 68 (also known as the Federal RMP Regulations).  The scope of the RMP includes all operations conducted at the subject site that involve the storage and handling of regulated substances.  Regulated substances stored and handled at the facility include:\n\n¿\tHydrofluoric acid (70-percent concentration); and\n¿\tFormaldehyde (37-percent concentration).\n\nEach of these materials is handled in varying container sizes.  \n\nES 1.0\tDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe primary operation conducted by Gallade Chemical, Inc. at the Santa Ana Facility is Chemical Distribution (NAICS Code 42489 ¿ Other Chemical and Allied Products Merchant Wholesalers).  \n\nFacility Location\nThe Gallade Chemical Facility is located at 1230 East St. Gertrude Place in Santa Ana, California 92707.  The Facility is located in an area that is primarily industrial and bounded by East St. Gertrude Place to the north and industrial facilities to the east, south and west.  \n\nFacility Description\nGallade Chemical¿s Santa Facility was constructed in 1973 to distribute industrial chemicals to retail operations and wholesale distributors. \n\nDescription of Regulated Substance Storage and Handling\nGallade Chemical¿s Santa Ana Facility is a chemical distribution facility.  As part of normal operations, the Facility purchases, receives and stores onsite a number of regulated substances in various pre-packaged container types and sizes.  These operations are further described below:\n\n70-percent concentrated Hydrofluoric Acid\nHydrofluoric Acid (70-percent concentrated) is received at the Facility in a 55-Gallon Drum an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43600,
      "SummaryText": "d stored onsite in an enclosed building.  Operators then repack the 70-percent concentrated Hydrofluoric Acid into 1-Gallon bottles.  These bottles are then stored onsite in an enclosed building until they can be delivered to the various customer sites.  In some cases, the 55-gallon containers are shipped out as received to the various customer sites without any repackaging operations.\n\nWith regard to 70-percent concentrated hydrofluoric acid, Gallade Chemicals, Inc. does not use the regulated substance onsite.  \n\n37-percent concentrated Formaldehyde\nFormaldehyde (37-percent concentrated) is received at the Facility in container sizes of 500-mL, 1-Gallon bottles, 5-Gallon pails, and 55-Gallon drums and stored onsite in an enclosed building.  As orders are received, the containers of Formaldehyde are shipped out to the various customer sites.\n\nWith regard to Formaldehyde, Gallade Chemicals, Inc. NEITHER uses the regulated substance onsite NOR repackages the regulated substance into other container sizes or types.  \n\nReceipt/Unloading/Storage\nUpon arrival of a delivery vehicle to the Facility, the driver checks in with the office and proceeds to the delivery dock.  At the dock, the delivery papers and material identities are confirmed by Gallade Operators.  Once the order is confirmed, a pallet jack or forklift is utilized (depending on the load type) to unload and stage the order being received.  An Operator then transfers the order from the staging area to the various storage rooms.  The process of receiving, unloading and staging is identical for each regulated substance handled at the facility.  The only difference being that container types and sizes may vary from material to material and storage locations of the materials vary within the Facility.  The Company has developed and implemented an extensive material segregation and storage procedure that requires that ALL materials (not just regulated substances) be stored in specifically allocated building(s) or are"
    }
  ]
}